{
    "id": "4tlhr4",
    "score": 353,
    "title": "How I've Sold $500k in 8 Months as a One-Man-Show",
    "author": "GoKone",
    "date": 1468939722.0,
    "url": "https://www.reddit.com/r/startups/comments/4tlhr4",
    "media_urls": [],
    "other_urls": [
        "https://comfortableclub.com/blogs/entrepreneur/117188933-how-ive-sold-500k-in-8-months-as-a-one-man-show)**",
        "https://www.reddit.com/r/Entrepreneur/comments/3pj9d5/i_started_a_mens_underwear_company_selling_over/)",
        "https://www.kickstarter.com/projects/comfortableboxers/premium-boxer-briefs-ridiculous-comfort-at-a-fair)",
        "https://www.kickstarter.com/projects/comfortableboxers/ultra-comfortable-mens-underwear-at-a-fair-price)",
        "https://comfortableclub.com/)",
        "https://comfortableclub.com)",
        "https://cdn.shopify.com/s/files/1/1059/8984/files/Comfortable_Club_Packaging-10.jpg?6884464036085610274)",
        "https://comfortableclub.com)",
        "https://cdn.shopify.com/s/files/1/1059/8984/files/Buybox.jpg?4437860519955730119)",
        "http://klaviyo.com/)",
        "http://www.privy.om)",
        "https://cdn.shopify.com/s/files/1/1059/8984/files/email.jpg?1514475351117951741)",
        "http://stitchlabs.com/)",
        "https://cdn.shopify.com/s/files/1/1059/8984/files/IMG_1033.jpg?10601425246704194831)",
        "http://www.gs1us.org/)",
        "https://cdn.shopify.com/s/files/1/1059/8984/files/100_0213.JPG?8245723273761910188)",
        "http://www.amazon.com/Myth-Revisited-Small-Businesses-About/dp/0887307280)",
        "https://cdn.shopify.com/s/files/1/1059/8984/files/Macro_Operations_Diagram.001.jpeg?4487767735057772902)**",
        "http://www.stitchlabs.com/)",
        "https://www.shopify.com/)",
        "http://codementor.io/)",
        "https://www.freelancer.com/)",
        "https://www.klaviyo.com/)",
        "http://www.privy.com)",
        "http://www.taxjar.com/)",
        "http://quickbooks.intuit.com/move-to-quickbooks-online/)",
        "http://backerkit.com/)",
        "http://www.shipstation.com/)",
        "https://pakible.com/)",
        "http://flexport.com/)",
        "https://cdn.shopify.com/s/files/1/1059/8984/files/reviews001-udmlmgwsvx.jpeg?12664222863729221570)"
    ],
    "postText": "**I've made this post available with full images [here.](https://comfortableclub.com/blogs/entrepreneur/117188933-how-ive-sold-500k-in-8-months-as-a-one-man-show)**\n\nA few months ago I ended up at the [very top of the frontage](https://www.reddit.com/r/Entrepreneur/comments/3pj9d5/i_started_a_mens_underwear_company_selling_over/) for r/entrepreneur when I launched my second Kickstarter campaign for my comfortable boxer briefs.\n\nMany enjoyed reading the story and how-to’s… so, in the spirit of sharing, I thought i’d tell you how things have moved along since then.\n\nI’ve since relaunched with 9 different product lines, refined the products extensively, improved the manufacturing process, replaced my platforms, completely changed the branding, and reached $500k in total sales. I'm stocked up on inventory for the rest of the year and I have a growth plan in place.\n\nThis post explains exactly how I got here, what tools i’m using, and what i’m planning on doing next. I urge you to keep the conversation productive, asking any questions you may have, big or small, and please keep the criticism polite. Suggestions and critiques are always welcome! \n\nFirst, a quick background:\n\n**Milestones in the Past 8 months**\n\n* [First Kickstarter Launch](https://www.kickstarter.com/projects/comfortableboxers/premium-boxer-briefs-ridiculous-comfort-at-a-fair) - $142k - July 2015\n* [Second Kickstarter Launch](https://www.kickstarter.com/projects/comfortableboxers/ultra-comfortable-mens-underwear-at-a-fair-price) - $219k - October 2015\n* [New Branding, Website, and Product Launch](https://comfortableclub.com/) - January 2016\n\n**The Refined Concept Behind Comfortable Club**\n\nWe started off naming the company The Comfortable Boxers Co.  It works well for SEO and gave it a nice unbranded feel to it, which resonated with those not willing to pay premiums. After striking the underwear market on a fairly significant level and with intentions of expanding our product line, a lot of thought went into a re-branding. In planning for monthly subscriptions services for our apparel, we’ve opted for a lifestyle brand with a primary focus on quality, comfort, and pricing. We arrived at [Comfortable Club.](https://comfortableclub.com) \n\nThe whole theme revolves around the idea that we shouldn’t have to overpay for premium apparel, so, quite realistically, the product line can expand into many areas. For now, though, we’re mainly focused on underwear, undershirts, and lounge products. \n\nOur name says it all. We make a premium line of obsessively engineered, ridiculously cozy underwear and lounge apparel – and deliver them at half the price of retail. Harry’s did it for razors. Casper did it for mattresses. Now, at Comfortable Club, we’re doing it for underwear and loungewear: building a great, premium brand that reflects the things that customers care about today: quality, cost, convenience and, of course, comfort. \n\n**Premium at a Fair Price**\n\nAn immediate reaction from some of you will be: \"Why would I pay $16 for a pair of underwear? I can buy X and Y for Z.\" My job since the very beginning was to convince customers why modal fabric is worth it, because your day absolutely changes when you're wearing these bad boys. Except this time, you won't be paying Calvin Klein or other brands over $35 for a pair. But I won't go into too much marketing lingo here, because the point of this post is to show you just how I managed to cut the price and built a sustainable business around the concept. Let's begin:\n\n**Bridging the Sourcing Gap**\n\nQuality underwear requires quality craft, so we partnered with the the best factory and fabric engineering experts we could find. The process was extremely long and patience was essential. First off, shy away from resellers and agents (aka Alibaba), do your research, find a sourcing partner, and go straight to the factory, the same ones used by high-end brands.\n\nOur relationships with the manufacturing plants are very close. So close, in fact, that during the peak manufacturing timeline we actually LIVE in the factory. This is part of our quality control program, which we’ll describe later. You see, the tricky part about sourcing is making sure you get a consistently high-quality product. Apart from a lack of organization, this is precisely the problem that plagues small businesses. Because small businesses usually don’t follow-up with recurring orders to the factory, the supplier is usually hands off once the product is on the boat. If you can establish a clear, long-term relationship, set your requirements up front, and have a presence in the process, you're set. \n\nWe learned this when sourcing metal sheet rolls for a multinational roofing company, so we opted for a closer relationship with the supplier. We established a permanent presence in Shanghai in partnership with a small sourcing office. This means we have feet on the ground in the factory, can supervise every step, and we establish our own quality control programs (at our expense of course).\n\n**Building Something Beautiful Through Manufacturing**\n\nEarly in our research (of which I also mean shopping around and trying everything out there), I learned there are three key factors that impact comfort: the stitching, fit, and fabrics. So in creating our underwear, we put a meticulous -- some might say, obsessive -- amount of attention into each of those areas.\n\nThe devil, as they say, is in the details, and when it comes to underwear, stitching is one that tends to get overlooked. We use a more robust, sturdier stitching in our products that make them last, while maintaining their comfort. But we shied away from traditional threads and opted for fluffy threads reserved only for the most luxurious winter apparel for a completely itch-free experience. Look closely at any pair of Comfortable Club undergarments, you can see the uniquely intricate, tight knit puffy stitch. \n\nWe opted for 92% modal fabric, an eco-friendly microfiber that enfolds the body in a light embrace. Modal is smooth, soft, and breathable, and its luscious texture feels similar to silk. It’s cool to the touch, super absorbent, and resistant to shrinkage and fading. In short, it’s the perfect microfiber fabric for body-hugging underwear.\n\nStitching, fit, fabrics. It’s a relatively simple formula, but the result is something pretty spectacular: underwear that looks great -- and feels even better.  \n\n**The Actual Manufacturing Process**\n\nHere’s a generalized model of the prototype and final manufacturing process for a new product:\n\n* Initial size, die-cut, stitching, waistband &amp; fabric specifications created\n* Textile production for prototypes\n* Dyeing process for prototypes\n* Prototype testing with real-world use\n* Revisions for prototypes\n* Revised prototypes created using same textile\n* Prototype testing under more scenarios\n* Sizing trials\n* Final exact manufacturing specifications created\n* Demand planning\n* Manufacturing order created\n* Quality control program created and programmed. Hiring process for quality control specialists begins.\n* Textile production - depending on the factory, this is done in-house or outsourced\n* Dyeing process\n* Waistband production\n* Quality control runs\n* Lab testing for fabric weight, color fastness, and shrinkage\n* Fabric cutting\n* Quality control runs\n* Revisions, if needed\n* Packaging specs created\n* Packaging order created\n* Stitching and crafting\n* Final quality control runs\n* Revisions, if needed\n* Ironing and folding\n* Packaging and labeling\n* Final check and count\n* Loading onto container\n* Freight shipping - FOB to door\n* Receiving at the warehouse\n\nPrototype as many times as you have to. Each round takes over a month of work, but the version you take to market has to be as perfect as possible. It's important to specify exact sizing guidelines and templates for every aspect of the product. Design specific packaging guidelines, including product tagging, warning messages on bags, SKU and UPC labels, and specify items per case. Color codes must be clearly stated. Fabric weight, fade, and shrinkage minimums and maximums be specified and tested. As an example, we raised our fabric weight to 190g/m2, and lowered our fade and shrinkage ceiling to 1%.\n\n**Quality Control**\n\nWhen you’re manufacturing thousands and thousands of items that involve a manual process, you can’t rely on a ‘set-and-forget’ attitude. Our quality control process involves actual third-party lab testing with SGS. We also send our own personnel to the factory.\n\nAfter finalizing the prototype phase and finalizing specs, we establish a strict defect-rate ceiling at 1% and randomly test up to 10% of the products to control for this. The sample size is large enough to be a good representation of the entire product. Of course, some defective items sneak through the cracks, but as long as you can keep it below 1%, you’re golden.\n\nTo reach this rate, however, we tripled our quality control staff and rejected every anomaly. We ended up rejecting a whole blue textile batch that led to a few delays.\n\n**Demand Planning**\n\nQuantities to produce depend highly on your demand model. With our initial Kickstarter campaign, we produced the amount pre-ordered on the campaign and at least an additional 50% for recurring orders. Problem is, we ran out of inventory within the first month! Lesson learned.\n\nFor our second Kickstarter campaign, we produced an additional 800% of total items spread out through 9 different product lines. For this reason, the transition into e-commerce was smoothly executed. Being out of stock is probably the most dangerous thing for your business.\n\nAs for quantities per size and color, black and gray are always the most popular ones by about 50% more than other colors. Sizing usually goes as follows:\n\n* S - 15%\n* M - 45%\n* L - 25%\n* XL - 10%\n* 2XL - 5%\n\nThis, of course, depends on your target market. But this model has done rather well for us so far. We also extended our offerings to include Lounge Pants, Undershirts, and a Women's Underwear line. The same model applies for all.\n\n**Presenting Your Product**\n\nIn presenting our product to the world, we could’ve opted for any local model and called it a day. we also could’ve sent our products over to a photographer that specializes in this type of photography. We truly believe we wouldn’t be here, telling you our story, if we had done this. \n\nWe instead researched the LA market for the best models we could find. They did cost us quite a bit, but the results speak for themselves. We personally flew to California, brought our own trustworthy photographer with us, rented a beautiful house on Airbnb, got some studio space, and ran the whole photoshoot ourselves. \n\nFor any product you sell online, you’ll need to create lifestyle images, e-commerce images, and product images. The theme around the lifestyle images depend on how you want your brand to be perceived.\n\nAs for [retail packaging,](https://cdn.shopify.com/s/files/1/1059/8984/files/Comfortable_Club_Packaging-10.jpg?6884464036085610274) these were created as a showcase and ‘show off’ concept. More on that later.\n\n**Optimize Your Storefront**\n\nThe [Comfortable Club](https://comfortableclub.com) shopping experience starts the minute customers hit our website. The landing page says exactly what we do and transitions into our whole product catalogue. For this and many other reasons, we’ve built and designed the site for unlimited growth potential and scalability using Shopify’s excellent platform. \n\nOptimized for conversion? You bet it is. We’ve removed tiny roadblocks that shave off seconds from the shopping experience, like custom developed color and size swatches instead of drop down menus, as well as plus and minus selectors instead of a number input form. [Every little improvement counts.](https://cdn.shopify.com/s/files/1/1059/8984/files/Buybox.jpg?4437860519955730119)\n\nWe’ve also made the navigation menu sticky and always visible for easy browsing. On top of that, the mega nav menu (the pop-up that shows up after hovering over SHOP) helps customers understand how our products are categorized and allows for easy browsing at any time, regardless of which page you’re on.\n\nThe website is always a work in progress. We’re constantly fixing tiny bit that improve the experience ever so lightly. After-all, it's all a numbers and psychology game.\n\n**Automated E-mail Flows**\n\nE-mail is a beautiful art. It’s also the highest converting platform out there. I’ve set-up my platform using [Klaviyo](http://klaviyo.com/) and pop-ups using [Privy.](http://www.privy.om) They integrate very nicely with Shopify and pull in a great deal of data that allows you to segment e-mails and create flows rather easily. As for e-mail design, [here's an example of an abandoned cart e-mail.](https://cdn.shopify.com/s/files/1/1059/8984/files/email.jpg?1514475351117951741)\n\nCart abandonment e-mails are what some people call ‘low hanging fruit’ and are huge drivers for conversion rates. It’s important to reassure your customer that you have his back.\n\n**The Enterprise Resource Planning System**\n\nOur ERP and information systems are designed to maintain exact inventory counts in every warehouse, with real-time visibility that allows us to plan our manufacturing requirements ahead of time, so we can grow with demand, instead of behind it. \n\nA lot of testing went into choosing the right platform. The first and most important criteria is integration abilities with my other platforms. Second, automation functionality. We opted for the beautifully operated [Stitch Labs](http://stitchlabs.com/) inventory management platform as my centralized hub. It handles all my sales channels, including Shopify and upcoming Amazon and eBay openings. We then assign a fulfillment warehouse to each one, and using the new 3PL integration functionality, orders flow back and forth. We designed workflows and established flow parameters like shipment mappings based on weight and destination. Stitch Labs handles the rest, including a complete accounting integration with Quickbooks. \n\nA new feature i'm probably going to end-up using is product bundling, which means I can finally build a virtual SKU composed of multiple existing SKU's. Stitch reports an inventory level of the SKU with the lowest availability. This will serve well for ‘packs’. \n\nReporting is robust enough to handle manufacturing requirements planning (MRP) and deep level sales insights, including customer loyalty and variant splits. I’m completely in love with it.\n\n**Automated Freight Logistics**\n\nOur logistics partner, Flexport, combines the power of the cloud and uses a proprietary bidding technology that guarantees the best rates and shipping times from our factory, all while streamlining the online-only process that eliminates paperwork and errors. \n\nI go with [FOB to Door.](https://cdn.shopify.com/s/files/1/1059/8984/files/IMG_1033.jpg?10601425246704194831) Customs, paperwork, and communications are handled entirely by the Flexport team.\n\n**Automated Fulfillment and the Science of Shipping**\n\nIf you run a small operation in the hundreds of items of total inventory and can find the time to spend a couple of hours a day picking, packing, sealing, labeling, and dropping off orders at the post office, by all means, do so and use Shipstation for this. If you have a small amount of SKU’s but a couple thousand items, you can upgrade to a 3PL like Fulfillrite. On the other hand, when inventory counts start getting into the tens of thousands with hundreds of SKU’s, when you expect significant growth, and when you start requiring advanced order routing, you move into a larger, more established, 3PL with advanced connectivity features.\n\nWe opted for the latter with DCL Logistics.\n\nWe have the capacity to store, pick, pack, and ship any volume with same-day fulfillment and an optimized arrangement that places the popular items closer to the picking line. We also use special bar-coding in every single item to guarantee order accuracy -- making order confusion or missing items a thing of the past. In short, we moved in with the big boys!\n\nWe have 180 SKU’s over 9 product lines. Keeping track of each one is hard, but our 3PL handles it beautifully. Bear in mind, an organized inventory is crucial and begins from the factory, especially in regards to proper tagging an labeling. [Registration with GS1](http://www.gs1us.org/) for a proper UPC code was crucial for the process, especially if we want to expand to retailers or Amazon. \n\nThe implementation process with a logistics provider of their caliber does require quite a bit of customization and know-how. The way we have it set-up is:\n\n* Order received on sales channel\n* Order pushed to Stitch Labs\n* Invoice pushed to Quickbooks for immediate realization of income\n* Order pushed to respective warehouse with mapped shipping\n* 30 minute grace period for order changes\n* Items picked, packed, and shipped\n* Shipping notice sent back to Stitch Labs with packing list\n* Stitch Labs triggers the shipment notification e-mail according to packing list\n* Stitch Labs sends Costs of Goods sold info to Quickbooks to immediately realization of expense\n\nThe 3PL receive orders from Stitch Labs through the custom-developed API, granting a 30 minute window before the order is locked from any changes (for customers that make mistakes in their orders). They've since published this 3PL connectivity feature to all customers. They pick and pack, ship, and spit back tracking information to Stitch which triggers the shipment confirmation e-mail on Shopify. If yout can't develop an API between Stitch and your 3PL, you can bridge this connection via Shipstation.\n\nThe result? [Same-day shipping](https://cdn.shopify.com/s/files/1/1059/8984/files/100_0213.JPG?8245723273761910188) on orders placed before 12:30PM EST. That’s unheard of for a small business!\n\nThe implementation process took about 2 months, which I consider to be a good thing. One-click 3PL's are very limited in functionality, whereas custom designed connectors have given me the ability to process returns, handle special rules like box sizing, and perfectly expandable features like EDI’s with large retailers. As an example, the new Amazon competitor Jet.com handles most of their sales through EDI connections with other merchants.\n\nAs for shipping providers, USPS is always the best way to go with average shipping times of 1 to 4 days. Our competitors use Fedex Smartpost or UPS Mail Innovations, services that save a few cents over USPS. The twist? They sort the packages and hand over the pre-sorted bulk to USPS anyways, except this time USPS has no incentive to deliver quickly.\n\n**Accounting**\n\nLast, but of course not least: accounting. Yes, you guessed it: also automated. Stitch Labs spits out all invoices in one single format, regardless of the sales channel it received it from, and then sends out costs of goods sold to Quickbooks once the item is shipped. All we're left to do is match bank transactions and deposits with the appropriate group of invoices.\n\nAccounting takes us about 1 hour a week. Bear in mind, the implementation and work-flow design process took months. But remember, [preparation is key!](http://www.amazon.com/Myth-Revisited-Small-Businesses-About/dp/0887307280)\n\nTake the time to learn accounting. Take a quick course or read an accounting book. It's worth the effort, as this is the base by which your business runs. It's not as simple as how much cash you have in the bank. When long-term inventory planning is involved, knowing your numbers on a deep level is crucial. \n\n**[THE WHOLE PICTURE](https://cdn.shopify.com/s/files/1/1059/8984/files/Macro_Operations_Diagram.001.jpeg?4487767735057772902)**\n\nSo, can we agree that automation is your best friend. What it comes down to is this: at Comfortable Club, we have the logistics of a Fortune 500 company -- without the Fortune 500 overhead. You might ask, what does all this streamlining, automating and general process-hacking get us?\n\nIt gets us the ability to run our entire operation -- thousands of dollars of orders across multiple SKUs every month --  as a one-man show. That’s right: the “we” we’ve been talking about this whole time? Well, it’s mostly just me. More on that in a minute.\n\n**Platforms I Use**\n\nAll of my platforms have been carefully selected to be compatible with each other. It took months of work to get them talking in such a way that requires minimal maintenance:\n\n* Inventory, Planning, and Sales: [Stitch Labs](http://www.stitchlabs.com/)\n* Ecommerce: [Shopify](https://www.shopify.com/)\n* Custom development: [Codementor](http://codementor.io/) and [Freelancer](https://www.freelancer.com/)\n* E-mail flows: [Klaviyo](https://www.klaviyo.com/) - Much much better than any other platform I’ve tried\n* E-mail Pop-ups: [Privy](http://www.privy.com) - Connects beautifully with Klaviyo\n* Sales Taxes: [Taxjar](http://www.taxjar.com/) - Counts taxes from every sales channel and creates a beautiful liability report\n* Accounting: [Quickbooks Online](http://quickbooks.intuit.com/move-to-quickbooks-online/)\n* Kickstarter Order Organization: [Backerkit](http://backerkit.com/)\n* Kickstarter Shipments Pushed to 3PL: [Shipstation](http://www.shipstation.com/)\n* Packaging: [Pakible](https://pakible.com/) (not connected but awesome supplier nonetheless)\n* Freight: [Flexport](http://flexport.com/)\n\nGetting them to communicate is a matter of understanding accounting on a basic level, maintaining organized information, and mapping things correctly. In making them work, I've developed wonderful relationships with the support teams from all of these platforms.\n\n**The Almighty Profit Margin**\n\nI’ve noticed that the topic always goes into a heated discussion, and I have a few things to say about this: some markets require a deep commitment to an aggressive pricing strategy before you can start poking around looking for customers. And no, not anyone can price something low and sell thousands.\n\nWe required heavy investments in advertising to get noticed. It's only when you have validated your product, carrying a loyal fanbase of users, when you notice a strong rate of repeat customers, and when you can convince new ones easily that you can demonstrate long-term value and can start realizing healthy streaming profits.\n\nThis is the point at which i’m in. I’ve invested every single profitable dollar, funneling it into better photography, product prototyping, new product development, improved quality control programs, new advertising methods, and the development of my automated platforms. \n\nHere’s the breakdown of factors you have to consider in your profit margins:\n\n* Item cost - this cost is realized once it leaves the warehouse to the customer. In the meantime, it’s considered an asset in your balance sheet.\n* Packaging \n* Quality Control \n* Freight\n* Import duties \n* Commissions &amp; Credit Card Processing Fees\n* Kickstarter Fee\n* Receiving and unloading\n* Storage and warehouse space\n* Insurance\n* Picking and packing per item charges\n* Per order fulfillment charges\n* Actual shipping charges\n* Advertising with Google PPC, Facebook, and Retargeting (starting mid-May)\n* Photography and Models\n* Influencer Marketing\n* Video Production, although I handled all the video production myself, including the editing\n* Cloud platforms and monthly charges\n* Payroll for any employees\n* Travel expenses\n\n**Social Proof and Reviews are Key**\n\nLike we said, we had a hunch that we weren’t alone in our quest for better, more comfortable underwear. So rather than waste time and money on expensive validation studies and market tests, we took it straight to the market -- and the results were beyond what even we expected. \n\nIn Summer ‘15, we launched our first crowdfunding campaign on Kickstarter. Less than a month later, we’d raised more than $142,000 and sold over 15,000 pairs of boxer briefs. So, being common-sense people, we launched a second, follow-on campaign, which went on to sell an additional $219,000.\n\nAll told, we have attained over 7,000 customers in less than 6 months and shipped over 30,000 items -- providing powerful proof that Comfortable Club has [struck a chord with customers.](https://cdn.shopify.com/s/files/1/1059/8984/files/reviews001-udmlmgwsvx.jpeg?12664222863729221570)\n\nNext steps are opening up the Amazon sales channel and getting in on PR outreach. As I mentioned on my previous posts, I’m shying away from expensive PR agencies and handling the outreach myself. It’s all about convincing influencers, bloggers, and publications to try on your product. And who better to do that than yourself?\n\n**About Me**\n\nThe inspiration for Comfortable Club came after I tried my first pair of premium underwear. I believed in the premium aspect, but couldn’t quite reconcile myself to the idea of shelling out $300 to replenish my underwear supply. Having worked as a supply chain and planning director for a multinational company, I knew only too well that problems with product pricing start upstream, so I put my supply chain and sourcing experience to work to develop a better, more budget-friendly solution. I also worked as director for an SAP implementation initiative on a 500-large multinational company - being the main driver for my knowledge in accounting, systems, and integrations.\n\n**Want to Meet?**\n\nIf you’re ever around Austin and want to meet up, discuss life and business, or just say hi, i’d be happy to grab a drink with you. We can make it a group thing too. I’m totally friendly!\n\nHave any Questions? Want to make a suggestion? Have a partnership opportunity? Or do you just want to say hi? E-mail me at hello@comfortableclub.com ",
    "comments": [
        {
            "level": 0,
            "comment": "Just some helpful feedback from a customer, I want a pair. I instantly hopped to Amazon since I saw you sell [a pair there](https://www.amazon.com/Comfortable-Comfort-Modal-Briefs-Underwear/dp/B01FGJ4XFW). \n\nBut there's no Amazon prime. I want it the 21st not the 25th to the 28th. \n\nI know I'm being picky, but my splurge purchase that I get two days from now from entering in zero info on Amazon turned into a non-sale. At least right now.\n\n(I don't mean this rudely, just sharing for the sake of feedback collection. I instantly fell in love with the site, images, tone, etc which made me want to splurge fast).",
            "score": 39,
            "author": "bobbonew",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's weird because it's pretty irrational to think, \"I'll only buy it if it arrives in 2 days. I'm not waiting 5-7.\" Yet, I totally agree with you. Psychology, I feel much less resistance towards buying something covered by Prime. Even if I still get free shipping. I don't really need the underwear in 2 days, unless there's a serious emergency going on at home.",
                    "score": 23,
                    "author": "gatman12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was just thinking about this yesterday.  I'm in the process of ordering a bunch of things for a project I'm working on.  I specifically found the prime version of a bunch of things - only to have them sit on my desk for the past 2 weeks.",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea I do the same thing. I think there is sort of a trust factor with Prime. Even if you don't need the thing right away, in your mind you feel like it's there and there will be less hassle getting it.",
                                    "score": 1,
                                    "author": "zipadyduda"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Channel Factors",
                            "score": 1,
                            "author": "765433bikesinbeijing"
                        },
                        {
                            "level": 2,
                            "comment": "That's the power of the impulse buy.",
                            "score": 1,
                            "author": "ademnus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Great point. I'm adding FBA in the coming months. It's a whole different ball game but my platforms work perfectly for this. Also, my website has checkout by Amazon for easy checkout!\n\nAlso, Amazon makes shipping estimates on my behalf and makes them seem worse than what they are. However, after a few months of data, i'm eligible for Amazon Prime status without Amazon shipping out my stuff. I just need to prove to them that I can ship same-day and within a 2-day time frame.",
                    "score": 12,
                    "author": "GoKone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why don't you start with Amazon shipping stuff on your behalf then switch to yourself? I'm sure it's expensive, but it seems like the increase in sales would offset the extra cost.\n\nI know that I'll happily go look for a similar product that is prime.  I'll even pay a higher price for the prime item because I know the process - 2 days, free shipping.  The only exception I make is for extremely unique things - like replacement parts with a specific part number.   Even then, I'll venture to other sites.",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's a whole lot of logistics involved in every decision. As easy as it may seem to say 'have amazon ship your items', there's concerns on interconnectivity and systems, kicsktarter shipments, Amazon not being able to ship abroad easily, etc. Also, moving items to amazon has its own costs. \n\nI personally feel starting with my own fulfillment worked best. Moving them to Amazon is my next step. What I'll do is shift a small amount of inventory to them for testing purposes. It's not a guaranteed sell, as typing in 'boxer briefs' leads to thousands of results. Its search engine favors high-selling brands and leaves smaller brands scrambling with sponsored links. In any case, it's definitely worth the attempt but it's not an easy one.",
                                    "score": 10,
                                    "author": "GoKone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you want any help let me know. I'll do about 2MM in sales FBA this year. ",
                                            "score": 3,
                                            "author": "JeffFBA",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Would you mind doing an AMA? ",
                                                    "score": 1,
                                                    "author": "mechanon05",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I would be happy to, but I feel like the FBAers have done quite a few AMAs and I'm not sure how many people are really even looking for one. ",
                                                            "score": 2,
                                                            "author": "JeffFBA",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Fair enough.  I'd love to pick your brain. I've been selling somewhat passively on Amazon for about a year, and did about 30k in sales, but would love to know what sorts of things I could do to drive those numbers up.  Would you mind looking at some listings of mine?",
                                                                    "score": 1,
                                                                    "author": "mechanon05",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sure I'll take a quick look. PM me",
                                                                            "score": 1,
                                                                            "author": "JeffFBA"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As an Australian (free shipping? 2 days? ha!), y'all sound like Amazon shills with your \"Prime or bust\" talk.\n\nI impulse buy shit all the time with a 15-45 day delivery window from a certain Chinese marketplace.",
                                    "score": 2,
                                    "author": "Lampshader"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Amazon makes shipping estimates on my behalf and makes them seem worse than what they are. \n\nWait, what? Shipping with FBA is free for the seller and Prime shipping means there's no shipping cost to the buyer.\n\nI do FBA at work and we sell boxer briefs too. USPS First Class. FBA is still cheaper after factoring in the costs for handling, package materials and the shipping cost. ",
                            "score": 1,
                            "author": "lakerswiz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd like to hear his thoughts on this, because there's likely a reason (margin, supply chain, etc) that it's not on Prime, or won't be until later. ",
                    "score": 1,
                    "author": "dibsODDJOB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "See above.",
                            "score": 1,
                            "author": "GoKone"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is an excellent post. Congratulations on your success thus far!",
            "score": 8,
            "author": "amacg"
        },
        {
            "level": 0,
            "comment": "Very informative and detailed. The \"Whole Picture\" layout was a good touch. Thanks so much for sharing!",
            "score": 6,
            "author": "thelegendxp"
        },
        {
            "level": 0,
            "comment": "Great post, thank you..",
            "score": 7,
            "author": "LifeSaTripp"
        },
        {
            "level": 0,
            "comment": "It's mostly you, but you do have people in Singapore doing quality control in the factories you use correct? \n\nWho else do you have that helps you here and there? ",
            "score": 6,
            "author": "SaltyDogTurd",
            "replies": [
                {
                    "level": 1,
                    "comment": "My sourcing agents handle the quality control. They are their own entity, so I'm technically outsourcing. However, I do find our relationship to be much like a partnership, considering how close we work. The one-man show status applies to my company and the sales operation. Absolutely no one helping there!",
                    "score": 6,
                    "author": "GoKone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a fantastic photoshoot. It's amazing how easily she can pull off some great looks. This is me trying to pull off the same thing: http://i1.kym-cdn.com/entries/icons/original/000/012/008/6133_full_(1).gif",
                    "score": 7,
                    "author": "GoKone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Having worked with girls and guys at LA Models and other top LA agencies numerous times, you made the right call going with a pro. I can't tell you how often I see people cut corners on their talent in our industry. It's an easy mistake to make, but god damn it sure makes a huge difference.\n\nI know people at some major online fashion retailers who claim that there are models who they A/B test with for ecommerce and some of them perform anywhere between 5-10x over the other model!",
                            "score": 1,
                            "author": "wedoitlive"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is inspiring, thanks! ",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congratz on your great success! This is amazing.\n\nHow many products/startups/things did you launch before this one? How did those go?\n\nI think most realize by now that overnight success is really 10+ years of hard work. I'd love to hear more about that part :)",
            "score": 4,
            "author": "swizec"
        },
        {
            "level": 0,
            "comment": "The click bait title had me skeptical, but this is a solid article that I am glad I read.  Thanks.",
            "score": 5,
            "author": "YouWillRememberMe",
            "replies": [
                {
                    "level": 1,
                    "comment": "My apologies for the click-bait title, but it is true ;) thank you for the remarks!",
                    "score": 11,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "incredible post! also great work!",
            "score": 3,
            "author": "alreadywon"
        },
        {
            "level": 0,
            "comment": "Thank you for the detailed post!  This is awesome stuff!\n\n",
            "score": 3,
            "author": "cathline"
        },
        {
            "level": 0,
            "comment": "Wow! Thanks for the tips!! ",
            "score": 3,
            "author": "frankthetank617",
            "replies": [
                {
                    "level": 1,
                    "comment": "My pleasure. I hope it helps! I'm already helping out a few people start their business. It's hard getting a grasp on the entire picture.",
                    "score": 6,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Full time, but I can get away with 2 hours of work a day. It all runs itself, except for customer service. I have time to open up new products lines, and it'll be a while before I need an employee!",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very detailed thread and great job on the success! Is this your first e-commerce shop? Do you do a lot of promoting via social media by any chance? I'm starting my own shop very soon that I think would appeal to teens. Around how much was spent on photography? ",
            "score": 3,
            "author": "billion"
        },
        {
            "level": 0,
            "comment": "Can you go more into details on things you did for growth? E.g. how did you Kickstarter get so popular? And where is the revenue coming from now.",
            "score": 3,
            "author": "outsidetheboxthinkin"
        },
        {
            "level": 0,
            "comment": "Maybe this is a n00b question, but how do you manage user accounts? Is it built into your site, or is there a database software or something?",
            "score": 2,
            "author": "BostonDrivingIsWorse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shopify manages user accounts natively. You can add functionality to this using certain apps, like my referral program by Sweet Tooth.",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The underwear was pretty basic right at the beginning. Underwear design is pretty standard. It was my second collection that really got my input. I got a whole lot more involved in the design process and specifications. Experience with the first project helped!",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck with Stitch Labs once you start growing. There are a lot of features that just plain don't work, and haven't for years.\n\n&amp;nbsp;\n\nFor example, when you create products in Stitch, then try to push them to Shopify, it will completely ignore visibility fields, publishing products you specifically asked the app to hide.\n\n&amp;nbsp;\n\nOh, and for some reason, they decided that they should ignore the tax paid that Shopify sends, and instead calculate taxes based on their own logic. This results in some orders coming in as being partially paid (off by a penny), even though they have actually been fully paid. Most shipping platforms don't queue up unpaid orders to ship, so unless you're closely watching this process, you end up getting an email from an angry customer a week later asking where their order is.",
            "score": 2,
            "author": "paulwithap",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haven't had any issues so far, but I know they just raised over $50MM and working on a whole lot of bug fixes. It works really well for me, as it does for Chubbies too.",
                    "score": 2,
                    "author": "GoKone"
                },
                {
                    "level": 1,
                    "comment": "totally agree Stitch Labs sucks!  Does not actually do anything as advertised, useless!",
                    "score": 1,
                    "author": "sigmaschmooz"
                },
                {
                    "level": 1,
                    "comment": "Out of curiosity is there another option you'd recommend? Creating products outside of Shopify and pushing into Shopify is tricky business. I run a large ecommerce site and we use Hublogix to sync inventory/orders, which doesn't support publishing to Shopify at all. \n\nIn our case, product is created on the Shopify end and then matches UPC numbers with our inventory management software.",
                    "score": 1,
                    "author": "wedoitlive",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately, I haven't found anything yet. It seems like there are a ton of solutions out there and they all suck. \n\nEveryone basically uses the shitty apps until they have the need/money to move over to Netsuite. Then they have to hire a full-time employee to manage Netsuite, because it's such a complicated mess.\n\nI used to work for an order and inventory management software company, and I think we had a better platform after 2 years of operation than any of the current guys do today. Unfortunately, we got bought up by a big corporation, and they tried to jam our functionality into their product, killing our product in the process. If it wasn't such a daunting prospect, I would probably rebuild it as a new startup.",
                            "score": 2,
                            "author": "paulwithap"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been wearing modal boxers for years at reasonable prices in France but then moved to Japan and couldn't find new ones. I bought a few from your shop and was impressed by the quality.\n\nReally great post and great inspiration!",
            "score": 2,
            "author": "nicolasmerouze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for that! We're working on some neat stuff for our next launch.",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome post ! Thanks for taking time to write it.\n\nI'm actually building a store using Spotify. Your site is very clean and effective. Which theme and plugin are you using ? Any custom development ? Which plugin do you use for the free shipping bar on top ?\n",
            "score": 2,
            "author": "prae1809",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey there! Check out the themes by Pixel Union. This is the Pacific theme with custom development on the top bar, colors swatches, and some little things here and there.",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you pay yourself yet? If yes is it a flat rate or a percentage of profit. \n\nIf no, how do you pay the bills and when do you plan on paying yourself? ",
            "score": 2,
            "author": "CalvinsStuffedTiger"
        },
        {
            "level": 0,
            "comment": "Good post. Thanks for sharing!",
            "score": 2,
            "author": "mistermannequin"
        },
        {
            "level": 0,
            "comment": "Your site is gorgeous. Well done man. I'm a tightwad so I won't be getting any undies from you. But I see you going places. Like the dollar shave club kind of places. \n\nRemember me when your rich. ",
            "score": 2,
            "author": "theageoldquestion"
        },
        {
            "level": 0,
            "comment": "So what are you netting? Whats the markup?",
            "score": 2,
            "author": "cil0n"
        },
        {
            "level": 0,
            "comment": "Best post I've read all year! Congratulations man\n",
            "score": 2,
            "author": "LevelUp100",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks bud. I hope it helped.",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have absolutely no interest in ever doing anything along these lines (healthcare biz, so apples and oranges) but I think this is a fantastic post and you sharing your expertise is very altruistic.\n\nBy the way, I assume the 'we' is a royal we 'cause you claim to be a one-man show.  Got to give you a bit of grief over that.\n\nI wish you great success.  You deserve it.",
            "score": 2,
            "author": "drsxr",
            "replies": [
                {
                    "level": 1,
                    "comment": "I transition the 'we' mid-story :) Thank you for the comments.",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The main take of this post is:\n\n&gt; Having worked as a supply chain and planning director for a multinational company, I knew only too well that problems with product pricing start upstream, so I put my supply chain and sourcing experience to work to develop a better, more budget-friendly solution. I also worked as director for an SAP implementation initiative on a 500-large multinational company\n\nYoungsters, take note! Nothing replaces experience and domain knowledge.",
            "score": 2,
            "author": "lord_jizzus"
        },
        {
            "level": 0,
            "comment": "The title, \"How I've Sold $500k in 8 Months as a One-Man-Show\" lends itself to sounding sketchy, but the content was top notch. I think you might get even higher upvotes/views if you branded yourself \"The Underwear Guy\" in your titles or something.\n\nThe Underwear Guy: How I've Sold $500k in 8 Months as a One-Man-Show\n\nThat would get more opens out of sheer curiosity in addition to being a compelling read for anyone looking to get into e-commerce.\n\nHope that border-line pointless feedback helps!",
            "score": 3,
            "author": "Lowenhigh",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe adding E-commerce to the title would've helped. But I want non-ecommerce startups or entrepreneurs to read what an important business proposition it is to open up to the online market. I was watching 'The Profit' the other day and saw the Key West Key Lime Pie Co; they opened up a local shop to the online world and sell thousands of pies online!",
                    "score": 4,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Post is better than the previous version:\n\nhttps://www.reddit.com/r/Entrepreneur/comments/4ll5nm/how_ive_sold_500k_in_8_months_as_a_onemanshow/\n\n\n\nWhat's the conversion rate from Redditors? I'm guessing quite small but I'm curious for the actual value.",
            "score": 2,
            "author": "Nium4ever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same post with new readers looking for inspiration.",
                    "score": 3,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You live in Austin right? Would love to meet you. ",
            "score": 1,
            "author": "princeoprinces"
        },
        {
            "level": 0,
            "comment": "Fucken Great!!",
            "score": 1,
            "author": "celedral"
        },
        {
            "level": 0,
            "comment": "how does the modal of these compare with the linen of the [https://maqoo.com/products/maqoo-underwear?variant=20868234759](Maqoo)? \n\nAlso, amazing write up. i would love to see videos of the process",
            "score": 1,
            "author": "agnt0007",
            "replies": [
                {
                    "level": 1,
                    "comment": "From first looks, and at $45, they're completely overpriced, although they do look well constructed. As for Linen, it's not ideal for body-hugging apparel, especially underwear. It's a great fabric for drapy clothes. Modal is great at moisture management, and feels more akin to silk. You can read more about modal here: https://comfortableclub.com/pages/how-so-comfy",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "PREFACE: This is really cool. You are really good at this and I do not want to diminish your wild success. The systems you are using are widely applicable and your willingness to share all of this is highly laudable. :) \n\nStill... let's discuss a few things. I have a decade of experience in sustainability research and positive/net-zero impact consumption. Your products are probably being made with toxic materials or additives even if you aren't personally aware of it. You have created a global shipping empire (miniature but still) involving a lot of transport and overseas travel (that's inherently super unsustainable). Your actual business is literally already being done (although I credit your overall brand vision below in its own segment). And some other bits and morsels... \n\n\n\n1. You outsourced. Right? So already we have a huge issue by removing domestic manufacturing from the supply chain. Your product is therefore NOT sustainable and a lot of fuel and resources must be used to move your product overseas. This already makes them a weak comparison to something made domestically, certainly for customers in USA/Europe/etc.  \n\nTo that end, where are your materials *INITIALLY* sourced? Is slave or wage slave labor employed to harvest the beech trees that go into your modal? Or the plant fibers that go into making your elastane/spandex? WHO is getting this to your factories? How well are they paid? How do they LIVE? These are SERIOUS questions and your company is at least partially responsible for knowing what's up with this. \n\nI love that you live in the factory. Really. That's super unique and again praise-worthy... But HOW do the chemical reagents, materials, and workers get to this factory? How is the factory built? Is it safe? What are the labor laws of the nation where it exists? \n\n2. How are your materials processed at the factory or before arriving at the factory? What is the biochemistry involved? Are harsh solvents or acids being used to clean or condition the raw materials? (This is what MOST clothing manufacturers would deploy to condition large quantities of modal/elastane) These toxic additives are what will end up giving your customers long term health problems or immediate allergic reactions, however rare. \n\nModal is often conditioned, even in the BEST case scenarios using a chemical called tetrasodium pyrophosphate.\n\nRead here: https://toxnet.nlm.nih.gov/cgi-bin/sis/search/a?dbs+hsdb:@term+@DOCNO+854\n\nThis chemical is HEPATOTOXIC to mammals! Probably not a huge concern really ever for your end users, but this is a MASSIVE problem for workers who have to deal with this chemical in your processing line, if they do... \n\n\n3. Isn't your business basically a 1-man \"Me Undies\"? They use the same material, similar design, and can basically undercut your price in bulk. I like that you have a whole brand modality setup, but as far as underwear goes they have you beat to the punch... right? Unless you have done something unique in actual sourcing, processing, or construction of your garments...\n\n\nHonestly in this case I'd prefer YOU over them because I want to support small businesses and not giant companies. But you want to give the AVERAGE consumer a reason to do so, and they will almost never share my rigorous commitment to small business. \n\n\n\n4. Using beech tree fiber is actually great. They are a sustainable tree that sequesters A LOT of carbon from the atmosphere and repopulates quickly. This is pretty cool. HOWEVER, since they are NOT \"extant fibers\" that exist in nature in a form capable of becoming clothes, you need to add some pretty crazy chemistry to the mix in order to make clothes out of these trees. That is your problem. Where are these particular chemicals sourced and how is safety maintained? Especially if this is all being done overseas. \n\n\n5. The word \"PREMIUM\" is absolutely meaningless. Please stop using it. It's a buzz word used to trick people into thinking something is better than it really is. Refer to your products using REAL material descriptive words and be HONEST. Ruthlessly so. Dan Ariely talks a lot about how advertising tricks consumers with words like this. You would do everyone a service to avoid these terms, even when criticizing your competition - even if that critique is valid! You undermine credibility. \n\n*There are absolutely no regulations about what can be called premium.* It refers to nothing. It is vapor and lies. Smoke and mirrors. You can set up a roadside lemonade stand with premium lemons or buy premium purses or shoes for 10K dollars in New York City. \n\n_____________________\n{}{}{}\nNOW... to be fair... \n\nAlmost zero of your thousands of customers will concern themselves with the truly global sourcing, sustainability, or social consequences of your clothing... but they are all things worth thinking about if you care about the planet. Happy to consult further if you see this and have additional questions. \n\nAnd remember: You aren't doing some dime a dozen software startup. You have a PHYSICAL product and you are making a real TANGIBLE impact on **PLANET EARTH**. This brings in about a hundred different and unique problems and concerns that someone building a \"weightless\" product might never need to think about! When you design a brand and make a company around something that is TRULY sustainable and can make a positive impact on the world, you will not just make money, you will actually contribute positively to society - possibly in a big way. There is A LOT of room for sustainable clothing manufacturing to come into being. Whether or not this venture addresses this or even attempts to, you are using language that suggests you might at some point want to...  \n\n\n\n",
            "score": 1,
            "author": "Artesian"
        },
        {
            "level": 0,
            "comment": "Holy cow this is overwhelmingly amazing information. Thank you for sharing. \n\n\nSo how did you find your manufacturing contacts? Was the language barrier an issue? How did you decide which manufacturer you could trust? How long were you in Shanghai?\nHow did you make your very first prototype, and how different was it from your final product? (I apologize if you've already answered any of these)",
            "score": 1,
            "author": "cameramanlady"
        },
        {
            "level": 0,
            "comment": "Thanks for the write-up; this is so awesome!! Best of luck moving forward, I hope to see an update on here in the future! Cheers",
            "score": 1,
            "author": "kobi_"
        },
        {
            "level": 0,
            "comment": "Kick-ass post. Thank you. ",
            "score": 1,
            "author": "jargonaut"
        },
        {
            "level": 0,
            "comment": "Very strong post; I expect this will do great here. Congrats on your success, focusing on both the things that don't scale well in addition to those things that do scale well. ",
            "score": 1,
            "author": "jsinkwitz"
        },
        {
            "level": 0,
            "comment": "Very informative post. Did not mind at all that it's lengthy and appreciated all the details!",
            "score": 1,
            "author": "richmondsg"
        },
        {
            "level": 0,
            "comment": "You make it seem easy! makes me wanna give it a try!",
            "score": 1,
            "author": "Coley2"
        },
        {
            "level": 0,
            "comment": "This is a fantastic write-up, thank you. A year ago I ran a small subscription box company that I ultimately closed up on because of lack of product-market fit, but I was just starting to figure out these automation details. This was really interesting insight on how far this stuff can go. Congratulations on getting this far on your own!\n\nI love seeing posts like this on reddit, because I am more likely to buy from a company when I understand how much quality and care goes into their products. I've also been complaining about my boxer briefs recently, so this was perfect timing. That said, I was confused by your product lines and couldn't find a clear answer on the site:\n\nWhat's the difference between the men's Bliss and Comfort lines?",
            "score": 0,
            "author": "pineapplepaul",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the comments Pineapplepaul. What you see now took a whole lot of time to set-up, but I can't see any other way this could be handled. As for your question, you can find a product comparison [here.](https://comfortableclub.com/pages/product-comparison) I'd be happy to help answer any questions.",
                    "score": 2,
                    "author": "GoKone"
                }
            ]
        }
    ]
}