{
    "id": "a8f6xz",
    "score": 552,
    "title": "Why didn't I get any money from my startup? - A guide to Liquidation Preferences and Cap Tables",
    "author": "Bizzle_worldwide",
    "date": 1545431790.0,
    "url": "https://www.reddit.com/r/startups/comments/a8f6xz",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/startups/comments/a80v2g/how_will_my_wifes_stock_options_work_since_theyve/)",
        "https://www.reddit.com/r/startups/comments/a80v2g/how_will_my_wifes_stock_options_work_since_theyve/ec9x3b9)"
    ],
    "postText": "*Note: I recently wrote a series of comments in response to* [*a post by danny841*](https://www.reddit.com/r/startups/comments/a80v2g/how_will_my_wifes_stock_options_work_since_theyve/) *about the value of his wife's stock options now that her company has been acquired. It was suggested that the community might benefit from having it turned into its own thread. Not being one to turn down a sanctioned opportunity to collect Karma, I'm happy to oblige.*\n\n***Note 2: The tables may not format correctly on mobile. Sorry!***\n\nMost founders share a dream. That dream being that one day, after a lot of hard work, someone will knock on their door and offer them a Scrooge McDuckian pile of money for their startup. However in order to get to this point, a founder will likely need to raise money from investors to grow. The terms attached to those investments will influence how any final buyout proceeds are distributed. If a founder isn't careful, they may find that their boat money turns out to be bus fare.\n\nTo understand why, we first need to understand how a startup grows and issues equity.\n\nWhen a startup is founded, its founders divide up the equity in it by issuing shares. The resources brought to the table can vary, but usually they’re just enough to get to some sort of proof of concept phase. We can visualize the outstanding shares of the company with what’s known as a Capitalization Table (Cap Table). At this point, it might look something like this.\n\n    \t\t\tShares\t\t% Owned \n    Founders\t\t1,000,000\t100 \n\nA lot of successful startups don’t grow using their own resources. In fact, with startups that have huge opportunity and potential, doing so would be far too slow. In order to reach their potential, they sell shares to investors. The amount of money they need to raise is usually based on expectations of what will be required to meet a certain milestone, with the number of shares issued being determined by a valuation metric that’s beyond the scope of this discussion. This process is usually done multiple times in order to reach successive milestones. Each fundraising round is referred to as a Series, and generally assigned a letter. After the first round (Series A), the Cap Table might look like this.\n\n    \t\t\tShares\t\t% Owned \n    Founders\t\t1,000,000\t50 \n    Series A\t\t1,000,000\t50 \n\nAs startups grow, they acquire non-founding employees. However working for startups carries risk. It’s a business that’s more likely to fail, and sometimes it can’t afford to pay what a more established company could. In order to compensate these employees for that risk, they’re generally issued Stock Options that allow them to buy shares of the company at some point in the future, for the price today.\n\nThis is great for the employees, but it creates an issue for investors. If I give you $10M for 1,000,000 shares thinking I’ll own 50% of your company until the next Series, and you issue 1,000,000 options to employees who all decide to exercise those options, I won’t actually own 50% of your company. I’ll only own 33%. This is what is referred to as Dilution. The issuing of additional shares reduces the overall % of a company held by any specific shareholder.\n\nIn order to avoid this, Pools are established with each Series, so all investors know the smallest possible (fully diluted) position they may be expected to have in a company before the next Series. Employee Pools tend to be between 10 and 20%. We’ll assume our startup is generous. After Series A, the (fully-diluted) Cap Table might look something like this:\n\n    \t\t\tShares\t\t% Owned \n    Founders\t\t1,000,000\t40%\t \n    Series A\t\t1,000,000\t40% \n    Employee Pool\t        500,000\t        20% \n\nIt should be noted that we are now assuming that all employees choose to exercise their options, and that our startup fully issues its employee pool. If a company continues to increase in value (or is bought), the first assumption is safe. The second assumption is rarely valid, but simplifies our example. We'll address contrary situations later.\n\nGenerally the employee pool size is adjusted to maintain its size relative to total outstanding shares. Let’s assume we’ve had two more funding rounds in our startup. The Cap Table might look something like this:\n\n    \t\t\tShares\t\t% Owned \n    Founders\t\t1,000,000\t14.5% \n    Series A\t\t1,000,000\t14.5% \n    Series B\t\t2,000,000\t29.1% \n    Series C\t\t1,500,000\t21.8% \n    Employee Pool\t        1,375,000\t20.0% \n\nNow comes the big day. The company sold for $100M all cash. A few things come into play here. First off, not all options are exercisable immediately. That’s the Vesting process, which is designed to keep employees at a company. Many option agreements indicate that upon qualifying event (such as a sale), any unvested options immediately vest. However sometimes they don’t.\n\nWhy wouldn’t they? Because the person buying the company needs to know the employees are going to stay. They just paid a lot of money for the company, and that means the staff to run it as well. Sometimes they offer new incentives to keep those employees, but often it’s easier to just keep them on their old incentives. Sometimes a company will attempt to get its employees to waive any accelerated vesting provisions in order to reduce the size of the employee pool. This isn't often in the best interest of those employees, and acts to increase potential distribution to founders and investors. Something to keep in mind.\n\nCritically, there’s something known as Liquidation Preference. Liquidation preferences, when they exist, can be the most important factor in determining how much a given shareholder receives in a buyout. **Not all shares are created equally.** Sometimes when a company needs to raise money, they need to let new investors know they will receive their money back before existing investors do. If they really need the money and are having a hard time raising it, they may even have to tell new investors that they’ll receive multiple times their money back before existing investors receive any money.\n\nWhy would existing investors agree to this? Because if the business fails, they’ll definitely lose all of their investment. So it’s better to agree to take less, than lose everything.\n\nLiquidation preferences can do weird things to payouts. Let’s use our startup as an example. We’ll need some additional information.\n\nFounders (and employees) hold what is called common stock. Common stock splits whatever funds are left after paying out all other shares.\n\nSeries A paid $2,000,000 for their shares. These are 2x non-participating, meaning that they can choose to receive back 2x their original investment, or convert their shares to common stock. They cannot do both, and so will do whichever would result in their getting the most money.\n\nSeries B paid $10,000,000 for their shares. These are 2x participating, meaning that they’ll receive back 2x their original investment \\*and\\* they’ll convert to common stock and receive a portion of the remaining funds.\n\nSeries C paid $15,000,000 for their shares. These are 3x participating 5x capped, meaning that they’ll receive back 3x their original investment and convert to common to receive a portion of remaining funds, however they cannot receive more than 5x their original investment\n\nSeem confusing? It definitely can be. There are a lot of different ways liquidation preferences can be build, but generally participating, multiples, and caps are the ones you’ll see.\n\nHow does this play out with our $100M buyout?\n\nSeries C receives 3x their initial investment, or $45,000,000 and converts to common stock. There’s still $55,000,000 left to distribute.\n\nSeries B receives 2x their initial investment, or $20,000,000 and converts to common stock. There’s still $35,000,000 left to distribute.\n\nNow Series A has a choice. It could receive 2x its original investment, which would be $4,000,000. Or it could choose to be treated as common stock. If it chose to do this, all classes in our original cap table would be common (as all other series converted). Therefore it would receive 14.5ish% of the remaining $35,000,000, or $5,090,909. This is clearly the better choice, so Series A chooses to convert to common.\n\nThis leaves us with $35,000,000 to distribute to our common shares based on their respective share of common stock owned, and a final distribution as follows.\n\n    \t\tShares       % Common   $ from Liq    $ from Common\t$ Total        % of Proceeds \n    Founders\t1,000,000    14.5%\t$0\t      $5,090,909\t$5,090,909     5.1% \n    Series A\t1,000,000    14.5%\t$0\t      $5,090,909        $5,090,909     5.1% \n    Series B\t2,000,000    29.1%\t$20,000,000   $10,181,818\t$30,181,818    30.1% \n    Series C\t1,500,000    21.8%\t$45,000,000   $7,636,363\t$52,636,363    52.6% \n    Employee Pool\t1,375,000    20.0%\t$0\t      $7,000,000\t$7,000,000     7% \n\nNotice how the % of proceeds actually received are drastically different from the % of shares held? That’s the effect of liquidation preferences, and why they’re so important.\n\nLet's compare this to another scenario where the buyout is only $80M.\n\nSeries C still receives 3x their initial investment, or $45,000,000 and converts to common stock. There’s still $35,000,000 left to distribute.\n\nSeries B still receives 2x their initial investment, or $20,000,000 and converts to common stock. There’s still $15,000,000 left to distribute.\n\nSeries A again has a choice. It could receive 2x its original investment, which would be $4,000,000. However this time if it chose to be common stock, it would receive 14.5ish% of $15,000,000 = $2,181,818. In this instance, it would choose to receive $4,000,000, and its shares would not convert to Common.\n\nNow our common distribution of the remaining $11,000,000 (80M - 45M - 20M - 4M) is as follows:\n\n               # Shares     % Common    $ from Common \n    Founders    1,000,000    17%         $1,872,340 \n    Series B    2,000,000    34%         $3,744,681 \n    Series C    1,500,000    25.5%       $2,808,511  \n    Employees   1,375,000    23.4%       $2,574,468 \n\nAnd our overall distribution looks like so:\n\n               # Shares    % Owned    $ Liq Pref    $ Common     $ Total        % of Payout \n    Founders    1,000,000    14.5%                   $1,872,340   $1,872,340     2.3%  \n    Series A    1,000,000    14.5%     $4,000,000                 $4,000,000     5%    \n    Series B    2,000,000    29.1%     $20,000,000   $3,744,681   $23,744,681    29.7%  \n    Series C    1,500,000    21.8%     $45,000,000   $2,808,511   $47,808,511    59.8%  \n    Employees   1,375,000    20.0%                   $2,574,468   $2,574,468     3.2% \n\nNotice the difference in payouts to each class. The purchase price in scenario 2 was 80% of the purchase price in scenario 1, but the payout to the founder and employees was less than half.\n\nEarlier we discussed the assumption that the Employee pool was fully issued (i.e. all options had been issued, and every option had been exercised.) This is important, because it affects distribution as well. To see why, first we need a little more information on what an option is.\n\nSimply put, an option is an agreement to acquire a number of shares for a set price (known as the Strike Price). Often times they'll only be valid between a set of dates. (Between the date of Vesting, and the date of expiry.) The strike price can be anything, but for tax purposes for employees it's generally the current share price on the day the option is issued. When you exercise an option, you pay the Strike Price, and you receive the shares.\n\nReturning to our example, we've assumed that the employee options are **in-the-money**, which is to say that the price they receive per share is greater than the strike price per share on the option. In our example, each employee would receive $1.87 per share owned ($2,574,468 / 1,375,000). If the strike price on the employee options was $3.00, an employee would choose not to exercise those options, as they would be agreeing to pay $3.00 to receive $1.87. If this were the case in our above example, the employees options would be worthless. Because no employee would exercise them, the resulting payout would look as follows:\n\n               # Shares    % Owned    $ Liq Pref    $ Common     $ Total        % of Payout \n    Founders    1,000,000    18.2%                   $2,444,444   $2,444,444     3.1%  \n    Series A    1,000,000    18.2%     $4,000,000                 $4,000,000     5%    \n    Series B    2,000,000    36.4%     $20,000,000   $4,888,889   $24,888,889    31,1%  \n    Series C    1,500,000    27.3%     $45,000,000   $3,666,667   $48,666,667    60.8%  \n    Employees   0            0%                      $0           $0             0%  \n\nNotice how everyone elses distribution increase when the employee options weren't exercised? This is why companies will sometimes try and prevent accelerated vesting of employee shares. The smaller that pool, the greater the funds available for distribution to other classes.\n\nLet's look at one final scenario to illustrate the effects of liquidation preference. At first glance, a $53M buyout seems exciting. Only $27M has been invested at this point. Let's see how it plays out.\n\nSeries C still receives 3x their initial investment, or $45,000,000 and converts to common stock. There’s still $8,000,000 left to distribute.\n\nSeries B  receives $8,000,000 and converts to common stock.\n\nAnd that's it. All proceeds from the transaction have been distributed, meaning there are no funds available to be distributed to common stock. The final returns are as follows:\n\n               # Shares    % Owned    $ Liq Pref    $ Common     $ Total        % of Payout \n    Founders    1,000,000    14.5%                  $0           $0             0%  \n    Series A    1,000,000    14.5%                  $0           $0             0%\n    Series B    2,000,000    29.1%     $8,000,000   $0           $8,000,000     15.1%  \n    Series C    1,500,000    21.8%     $45,000,000  $0           $45,000,000    84.9%  \n    Employees   1,375,000    20.0%                  $0           $0             0% \n\nFounders, employees and Series A investors all receive nothing. All that work, and high risk early stage capital goes uncompensated.\n\nSo what's the point of working at all if all of the benefits are going to be scooped away? Well, it's important to note a few things about liquidation preferences like this.\n\n1. They tend to show up when a company is struggling to raise investment. If you're having a hard time raising capital, it's likely because there's some significant risk associated with your business. Maybe you've failed to meet your benchmarks. Maybe it's highly speculative. Whatever it is, the new investors want to know they'll get their money out first, and they'll make enough to compensate them from taking those risks. On the other hand, if you have a number of sources of investment interested, there likely won't be any liquidation preference. In fact, they may want to try and cash existing investors or founders out early in order to increase their own equity holdings. As rarehugs [pointed out in a comment](https://www.reddit.com/r/startups/comments/a80v2g/how_will_my_wifes_stock_options_work_since_theyve/ec9x3b9) on the prior thread, a founder should think very carefully about cashing out early. If someone thinks your equity is worth buying now, it means they think it will be worth substantially more later.\n2. They generally only apply to private companies. Once you're public, selling your shares is generally much more straight forward. However it should be noted that often liquidation preferences apply to the process of going public. When you go public, generally all series are converted to common stock, or exited. **The order in which proceeds or common stock are issued during an IPO are often influenced by existing liquidation preferences.**\n\nNow that you understand the risks, what can you do as a founder to ensure you don't end up receiving less than you expect from your eventual exit?\n\nFirst, you're generally better off taking a lower valuation early on than you are a higher multiple. Later stage investors aren't likely to accept a multiple lower than one offered to previous stage investors. If you're trying to raise $500K for your seed round, and you have an offer to take 20% of your company with a 1x multiple (2.5M valuation) or 10% of your company with a 2x multiple (5M valuation), and you expect to require multiple future round of financing, you'd likely be better off with the lower valuation.\n\nSecond, don't raise more than you need. By their very nature, multiples work on the underlying investment. The more you raise, the higher the bar you need to achieve before you'll see proceeds for yourself.\n\nThird, when you're raising your first round of funding, model out your cap table all the way to when you expect to exit. Look at your long-term road map, and estimate how much money you'll need to raise at each stage to get there. Think about what your company will be worth when it hits each milestone. Build a cap table just like we did above, and see how much equity you'll have left, as well as what your distribution might be. Understanding the endgame helps you understand each step you take to get there in context.\n\nHopefully that provides some helpful information to some of you. Remember, it's not just about the amount of money you raise along the path, or what your company is worth. The terms attached to the money will ultimately determine how much of that you and your investors receive.\n\n**TL;DR: Liquidation Preferences, when they exist, can be the single most important item when raising funds, and can result in founders receiving a substantially smaller share of proceeds when they sell. Understand and pay attention to them.**\n\nEdit: I don't want to crowd out the discussion threads with Thank Yous to people for the kind words, but I'm reading them and absolutely appreciate them! I'm glad people are finding this information useful!",
    "comments": [
        {
            "level": 0,
            "comment": "I worked for a startup that recently sold for $300M + and not even the founders got paid out because there was so much in preferred shares from the investors. Really sad.",
            "score": 62,
            "author": "Drawman101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, and that’s not an uncommon thing. Even without a multiple, it’s easy to end up in a situation where you’ve just taken too much money in too many tranches, and your ultimate exit fails to meet expectations. \n\nOftentimes in these situations, the acquirer provides some sort of kicker to founders to keep them happy/around for a few years. But it’s rarely of the caliber they thought they’d end up with. ",
                    "score": 22,
                    "author": "Bizzle_worldwide"
                },
                {
                    "level": 1,
                    "comment": "Holy moly no one ever explained it like this! I just quit a tech startup that gave me stock options and a low salary. I put in my two week notice and am hitting the pavement. Feel like if they sold would be no where near 300M and my pissant stock options probably wouldnt be worth shit anyways. Sigh... this post is amazing ",
                    "score": 19,
                    "author": "rreutietang",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s nothing to gain by throwing the baby out with the bath water! Remember, every company has a different history of raising funds, and therefore a different cap table and liquidation preference. \n\nIn many situations, founders and employees absolutely received a not insignificant buyout. Also, many options do active significant value, especially to early stage investors. \n\nAdditionally, depending on your shareholder agreements, there are active Secondary markets that often allow shareholders to sell their shares in private startups before they go public. This can be a good alternative to cash your equity out for a known lesser value now, than a future value that could be negatively impacted by liquidation preference after future rounds. \n\nThe important thing is that you get as much information regarding your share position, and the company, as possible so you know where you stand. ",
                            "score": 12,
                            "author": "Bizzle_worldwide",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is this something that founders would just tell employees? \n\n&amp;#x200B;\n\nThings like pool size and outstanding shares and liquidation preferences? I'm in a position now where I'm about to receive options and do think the company would have a lucrative exit. I'm unsure if these are typical questions that are answered during the process though. ",
                                    "score": 4,
                                    "author": "krazyken04",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It depends on the founders, and on the company. But in my opinion, asking shows that you are knowledgeable in a topic, which is another asset in your favour as an interviewee. \n\nAlso, it’s critical that you know what your compensation is actually worth, so if they’re hesitant to tell you, especially if options make up a significant portion of your compensation package and after you’ve explained why you’d like to know, I’d be cautious as it may be an indicator of how they view their staff. \n\nThink of it this way. If I’m offering you a job, and tell you I’ll pay you 15,000 a month, but won’t clarify what the currency is when asked, you probably have a reason to be concerned. \n\nHowever, as with all things, this is scenario dependant. If the company is already paying you a fair market wage in cash and providing competitive benefits, then the option package is likely seen as a sweetener as opposed to primary compensation. In these instances, you may get pushback on providing all of that information, and pressing the issue might be to your disadvantage as a candidate.  Since I’m this example it’s such a minor piece of your compensation anyway, you can decide if it’s worth not being hired over. ",
                                            "score": 6,
                                            "author": "Bizzle_worldwide"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's like they all know devs can be strung along indefinitely with allusions to wealth based on projections that are based on wishful thinking.",
                            "score": 1,
                            "author": "IntolerableBalboa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A different TL;DR: forget about the (pre/post-money) valuation, and ask instead how much there is in liquidation preferences. That’s the floor for how much  the company has to get sold for before commons see any proceeds. ",
                    "score": 6,
                    "author": "bobinator60"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is fantastic.  \n\nGreat job being a selfless contributor and not turning this into an opportunity to promote anything other than your expertise and desire to support the community.",
            "score": 51,
            "author": "GaryARefuge"
        },
        {
            "level": 0,
            "comment": "This is killing me right now. My startup, of which I still own 10%, was involved in a deal which was basically an acquisition but for purposes of speed was structured as an exclusive lease of the technology for monthly payments totaling in the low 8 figures over 4 years. All of our convertible note holders just got their first payouts from the deal. They are each getting a surprise $20k-50k check this month. They will receive these for many months in a row from here on out.\n\nI still have received nothing, and likely won’t for 2 more years. All said and done I will probably cash out around $250k for a deal in the 8 figures which I own ten percent of and spent years of my life toiling on. Startups are a helluva drug. The struggle is real. ",
            "score": 26,
            "author": "ScoutsOut389",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh man, I feel for you, and wish I had written this earlier. \n\nIf you haven’t already, it might be worth going over the agreement and structure with an expert to nail down exactly what you will get, and see if there are any options available to you to mobilize your remaining shares. The thing about alternate, or exotic purchase arrangements is they can have unintended consequences. Sometimes, however, that works in your favour. \n\nIf you need any advice, shoot me a message. Otherwise, I hope you’re wrong and a windfall comes your way!",
                    "score": 10,
                    "author": "Bizzle_worldwide"
                },
                {
                    "level": 1,
                    "comment": "Interesting.  Do you know the official name for this kind of business agreement? \n*exclusive lease of the technology for monthly payments* in lieu of a true acquisition?",
                    "score": 1,
                    "author": "redgrange",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not sure there is a name. It’s a stupid fucking deal. The payments get taxed as normal revenue, so all said and done our earnings in the “acquisition” take a fucking massive hit just on taxes. I was 100% opposed to the deal, but the chairman of our board was overleveraged in other investments and basically saw this as a way to quickly get square on this deal, at the loss of everyone else. ",
                            "score": 4,
                            "author": "ScoutsOut389",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Feels bad man :( ",
                                    "score": 1,
                                    "author": "AnonTheFlag"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great write-up! This is one of the most confusing topics for employees because most startups keep their cap table a closed book and usually require some sort of shoulder rubbing to get enough of the numbers to attempt some back-of-the-napkin math of how much they could receive in an exit. \n\n&amp;#x200B;\n\n[Zynga](http://fortune.com/2011/11/10/zyngas-stock-scandal/) is a great example of a company that exited and prioritized the liquidation of their major holders than their own employees. The heyday of early startup employees making a sizeable return are pretty much over especially if the startup raised an institutional seed round (\\~10% equity) or went through an incubator/accelerator (\\~5% equity).\n\n&amp;#x200B;\n\nWhen folks come to me for compensation advice before joining a startup as a regular employee, I tell them to ask for equity if they're not being paid market salary and not view the equity as some kind of guaranteed \"get rich\" payout, but more as a non-guaranteed future bonus for the time they were not paid market salary.\n\n&amp;#x200B;",
            "score": 21,
            "author": "mackeymax",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's great advice for non-founder employees, and absolutely something people should keep in mind.\n\nEquity has risk attached to it. Startup equity has a lot of risk attached to it. If you're relying on it for your primary means of compensation, you need to fully understand those risks, and even still consider the likely possibility that the only compensation you receive is the cash you're paid every 2 weeks.\n\nAlso, and it varies depending on the startup, potential employees shouldn't be afraid to ask about the cap table. If your founders don't want you seeing it, it doesn't hurt asking questions like \"How much preferred equity sits above the employees?\" and \"What's the minimum buyout amount that we'd have to receive in order for employees to receive proceeds from a buyout\". Part of the startup hiring \"pitch\" is that you have the potential to be part of a buyout. It's not out of line to ask questions to find out what that's worth.\n\nAs you said, they won't necessarily answer those questions. But that gives you information about how you might expect to be treated during a buyout as well.",
                    "score": 20,
                    "author": "Bizzle_worldwide"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe the most well written thread of 2018. Excellent intro to cap tables by Bizzle.   \nMods: can we add this to FAQ or sticky? Seems many would benefit from a better understanding of how equity works in startups.",
            "score": 70,
            "author": "rarehugs",
            "replies": [
                {
                    "level": 1,
                    "comment": "We will discuss doing as much.\n\n&amp;#x200B;\n\nWe are in the process of working on a lot of changes and updates for 2019.  ",
                    "score": 14,
                    "author": "GaryARefuge"
                },
                {
                    "level": 1,
                    "comment": "Agreed. Every single founder needs to read and reread this post during any funding stage. Should definitely be added to the sidebar. Bravo OP.",
                    "score": 21,
                    "author": "mostlyemptyspace"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m so glad I happened to write it just when someone needed it. I hope it’s helped you out. \n\nI mentioned a few resources in another comment. If you’re currently raising and are confused by term sheets you might receive, take a look at that Venture Deals book I mentioned. If you can’t afford it, message me and between the two of us we can probably figure out how to lend you my kindle copy. ",
                            "score": 8,
                            "author": "Bizzle_worldwide",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn’t even know there was a third edition. I’ll have to google and see what they’ve changed!",
                                            "score": 3,
                                            "author": "Bizzle_worldwide"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey, what's the name of that book? ",
                                    "score": 2,
                                    "author": "tutak_tutak_tutiya",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The book is Venture Deals: Be Smarter Than Your Lawyer and Venture Capitalist by Brad Feld and Jason Mendelson. \n\nOn one of the other comments there’s a description about it, and some other resources. I’ll update the main post later today to make it easier to find. \n",
                                            "score": 5,
                                            "author": "Bizzle_worldwide"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the quality post! I learned things.",
            "score": 7,
            "author": "CraftyTrouble"
        },
        {
            "level": 0,
            "comment": "I'm not sure how long this took you.. but thanks! It will take some study.",
            "score": 5,
            "author": "rross",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great post. Many thanks",
                    "score": 4,
                    "author": "againagame"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fantastic post. Thank you for sharing. Are there any resources you would recommend for founders to learn more about startup financing?",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great question. I probably recommend one of these two books at least once a week to someone new.\n\n&amp;#x200B;\n\nVenture Deals: Be Smarter Than Your Lawyer and Venture Capitalist by Brad Feld and Jason Mendelson\n\nSadly, if you weren't smarter than your lawyer and your VC going into the book, you likely won't be after reading it either. (But, having worked with a lot of VCs and lawyers, I think it's safe to say you very well might already be.) It does do a great job of walking you through what you might be expected to see on a term sheet when you go and raise money, as well as tips for negotiation and things to keep in mind. Fundraising is a chaotic and busy time. Being educated on the vocabulary and the process ahead of time means one less thing you need to try and do during the process. Plus if you don't remember what something means, you have a reference source to go back to.\n\n&amp;#x200B;\n\nSlicing Pie by Mike Moyer\n\nThis is less about fundraising as it is about attributing equity for non-monetary contributions. However, I bring it up here because the majority of failed startups I've seen have failed not due to fundraising, but due to team issues. A philosophy on how equity will be attributed \\*before\\* any money comes into play would have saved the majority of them. I've always been a fan of Dynamic Equity Allocations, and this book does a great job of taking what was once an exotic financial engineering concept, and making it accessible.\n\n&amp;#x200B;\n\nLastly, not as much a resource as a strong suggestion: *Network*. Network. **Network**.\n\nMeetups, Conferences, Social Events at Co-working spaces. I can't put enough emphasis on the value of spontaneous serendipity in the success of a startup, nor can I count the number of times i've been describing a project to a stranger in response to \"What are you working on?\" where at some point in the conversation (or a future conversation) they've presented me with:\n\n\"A guy who's really into \\*insert relevant topic\\*\" or,\n\n\"A fund that's interested in that space right now\" or.\n\nasked \"If I've had a chance to speak with \\*insert name of individual at company in space\\*.\"\n\nFor a lot of people, networking is exhausting, and there's always things you think need to take priority. You already work hard on your startup. You've just taken to attaching entire stacks of post-it notes to your agile board, but never seem to move them. You haven't seen your kids or wife/husband or girlfriend/boyfriend in 3 days. You can't remember what soap smells like.\n\nWhen life is like this, prioritizing cleaning yourself up and going and having a few beers with a bunch of strangers can not just seem daunting, but also be hard to justify to the family you're likely already neglecting, and to yourself.\n\nJust remember that nobody invests in a company they don't know about. Nobody trusts a team they've never met and nobody's ever heard of. At some point you'll need to do this anyway, and it's not something that can be rushed. The sooner you start building that network, the larger it will be when the time comes to let people know that you're about to start raising financing, or looking for employees, or need advice.\n\nAnd who knows, you might just make some friends and have some fun along the way.",
                    "score": 21,
                    "author": "Bizzle_worldwide"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for sharing! Great post.\nAny words on how general this is? Valid for any kind of startup? Software startups, for example? Is this a Silicon Valley thing, or is also common in other, maybe not that startup &amp; VC crowded places too?",
            "score": 3,
            "author": "te_ch",
            "replies": [
                {
                    "level": 1,
                    "comment": "The concept of liquidation preference (and preferred shares) exists in most first world countries. Some third world countries don’t allow tiered shareholdings, in which case you often see financing structured as tiered debt which gets paid out in a similar way. (Think about having to take our second and third mortgages on a house.) However even there, rules and structures are harmonizing. \n\nYou’ll see it in every industry as well. If anyone’s ever needed someone to give them money when money was rare, it’s safe to say there’s a legal mechanism to make sure they get their investment and profit out first. \n\nThat being said, the exact format of your term sheet will vary greatly depending on jurisdiction, as might the names of common clauses. Some jurisdictions may not allow for multiples, although I can’t think of a specific example of one off the top of my head. However almost universally, at some point in the investment process with a professional or institutional investor, you’ll receive something that lays out valuation and terms of investment. When you see that, start looking for words like Preferred Shares, Fully Participating Stock, and #x preference. That’ll be where your liquidation preference is outlined. \n\nThe major exception I can think of is very early stage Triple F investors. Generally at this point you don’t have a lot of money for legal, so you just issue them Common. \n\nHowever now that you’ve read the above, you might have ideas of other sorts of shares you could offer them and ask your lawyer about! \n\n",
                    "score": 2,
                    "author": "Bizzle_worldwide",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should write a book about this :) Thanks again for the post and reply.",
                            "score": 2,
                            "author": "te_ch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At some point I plan on aggregating my various ramblings into a semi-coherent blog, but like so many people in this subreddit, I’ve got enough active projects on the go that I probably shouldn’t add another one to the list!\n\nThank you so much for the kind words. ",
                                    "score": 4,
                                    "author": "Bizzle_worldwide"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is such a fantastic post. Thank you for this.",
            "score": 3,
            "author": "totallyonsight"
        },
        {
            "level": 0,
            "comment": "That's a lot of writing. Are you a lawyer? \n\nI'm just curious. I learned dilution today. I will try learning other parts later. :)",
            "score": 4,
            "author": "alpello",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not a lawyer, although some days I spend so much time with them that I feel like one. My educational background was accounting,  and I did some time in public practice, but I hold a Chartered Financial Analyst designation. \n\nI’ve spent the last 20 years bouncing between being a consultant, a VC, and an entrepreneur, and I’ve been fortunate enough to have worked with some great people, and some great ventures. And some not so great people and not so great ventures. Both have been valuable types of experiences. \n\nI don’t want to turn this into an biography though, so I’ll leave it at that!",
                    "score": 3,
                    "author": "Bizzle_worldwide",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you make any exits? What are your thoughts on bringing an existing solution into a different country’s market? ",
                            "score": 3,
                            "author": "alpello",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve had three exits personally (two early stage, one late stage), and been involved in a number of others for clients.  I’ve also had my share of catastrophic failures, and am sitting on stakes in a number of ventures which could go either way. But overall I’ve made more money than I’ve lost, and I’ve been fortunate in that I’ve never had a personal venture implode once I’ve taken outside money, so all of my friends and family still call me at Christmas time. \n\nPart of that is that I don’t raise money until I’m absolutely convinced the venture will work, and that generally means I need to bleed a lot personally because I put off the seed round as long as possible. It also means I retain a lot more of my startups when the time comes to raise though.\n\nA lot of ideas look good on paper (See the 201X craze of “It’s Facebook/Uber/eBay/Whatever... for China!”), but transitioning the business model is never as straightforward as it appears. \n\nI think there’s been a lot of success with the localization of proven businesses provided that you are a local importing a foreign business model. The key to the success of these businesses is understanding the local customs and culture, and identifying or adapting the proven model to work.\n\nCultures are extremely different in very subtle ways, and therefore differences in the way people communicate, buy, travel, interact, and show prestige/value are easy to gloss over or not fully understand for a foreigner who just assumes that it’s the same as their country. That’s one of the reasons why a lot of larger companies have difficulty gaining traction in foreign markets, and end up seeking out local partners. \n\nConversely, just because you understand the local environment doesn’t mean you understand the business. Ride Share/social media/whatever may as straight forward a concept as it seems, so understanding the complications and challenges that the successful companies encountered is important to make sure that your venture can overcome them. \n\nIf you’re looking to Export a business model, make sure you have team members who are local partners, or intimately familiar with the local culture of the region you’re exporting to. If you plan on Importing, make sure someone on your team is an expert in the business or model you’re planning on importing. Your backers are ultimately going to want to see both. ",
                                    "score": 2,
                                    "author": "Bizzle_worldwide",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually i want to import a saas . Now i’m by myself and trying to seek partners team members etc who got technical ability to develop and maintain this system stable. \n\nIm the local one in this scenario and the similar products are from other countries.",
                                            "score": 2,
                                            "author": "alpello",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It sounds to me like you’ve seen a service that you like, and haven’t been able to find it locally. That’s a great start. The first two questions you need to ask are:\n\nWhy? It’s a big one. Are there any relevant regulations that prevent it? Is it too expensive? Does it require technology that isn’t popular or widely available? Sometimes there’s a good reason it hasn’t taken off locally. \n\nDoes it really not exist? A lot of the time other people have tried it already, and are either pre-launch but ahead of you, or they’ve failed. In either case, you need to spend a lot of time looking into this point, and reach out to anyone you find to see what happened or how it’s going with their project. One of my current projects actually formed this way, with my discovering a direct competitor who was two steps ahead of us, reaching out and setting up a meeting, and coming away from it having decided to merge our teams. \n\nIf you make it through these two steps, then it’s a matter of building your team and refining your idea. While you’re doing that, learn as much about the services you wish to replicate as possible. You might even consider reaching out to them and discussing local expansion. Bigger entities have expansion plans, and a capable local partner reaching out can help accelerate those plans, and perhaps put you in place to be part of them. \n\nThere are lots of ways to form/join a startup. Sometimes it’s a matter of creating a job for yourself at an existing one by making a market for them that doesn’t exist without you. ",
                                                    "score": 1,
                                                    "author": "Bizzle_worldwide",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You are correct but how? I mean how will you find all those people without making someone else decide to do this job on their own. Like i’m talking to devs, school alumnis, labs. etc to find out how we can make this program work. But once in a while i get the feeling that the guy im talking to thinks like oh yeah i can do this on my own why do i need you?\n\nOther than that i tried reaching out to them but didnt get any response :/",
                                                            "score": 1,
                                                            "author": "alpello"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the post I appreciate all your time put into this without trying to cross sell something. We need a lot more of this, in this community. Giving without asking anything in return says a lot about character and will get you very far socially, which I’m sure you already know. Just wanting you to know of my admiration. \n\nEdit: And of course the amount of info is appreciated by all. Cheers. ",
            "score": 3,
            "author": "TheLordGwyn",
            "replies": [
                {
                    "level": 1,
                    "comment": "As I said in another comment, I’m a big believer in spontaneous serendipity. That doesn’t just happen in a vacuum. Every one of those connections or interactions has occurred because a stranger or acquaintance decided to do something nice, or take a chance because of a feeling, or just help someone they realized they could help. \n\nIf I can be that spontaneous serendipity for someone, and have them read this at a time they need it, then I’m thrilled. \n\nIf anyone who reads this will remember it, and try and be that for others in the future, even better. \n\nThis startup world is hard. We need as many good people helping each other as we can get. ",
                    "score": 6,
                    "author": "Bizzle_worldwide"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excellent explanation. I think this is going to blow up. It's already being shared on other business forums. Well done Bizzle, you've taught a lot of people a very valuable lesson here.",
            "score": 3,
            "author": "Prince-Kheldar"
        },
        {
            "level": 0,
            "comment": "Wow, thanks. I have a business that I’ve bootstrapped to $750k value now I’m looking into apps &amp; possibly something CBD related, this was a huge help with something I never quite understood. \n\n",
            "score": 3,
            "author": "fitnessisking"
        },
        {
            "level": 0,
            "comment": "Brilliant post, thank you.\n\nI work for a startup as an employee, and had an idea of how cap tables &amp; vesting options affect final payout, but only had a vague understanding of how share preferences worked, and had no idea about multiples or participating / non-participating shares.\n\nIt's great to see your worked examples too - really helped me to understand!\n\nNow to work out if I can find out what the captable / exit plan is for my startup (&amp; if I can do anything about it)...\n\n(Minor points you may wish to edit: I believe the final table, \"$ Total\" column for the Series C investors should read $45,000,000 (not $0), and you missed a final 0 on 1,000,00 in the paragraph which starts \"This is great for the employees...\" (~1/8 of the way through your post) which foxed me for a minute).",
            "score": 3,
            "author": "Crashthatch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, thanks so much for the edits! You're absolutely correct on both, and I've fixed them accordingly.\n\nI'm glad the post could give you some clarity, as well as some things to think about/discuss with your startup. You might just end up in a situation where you understand this better than they do. \n\nIf so, angle for a promotion and if you get it remember that my preferred form of tribute is scotch. ",
                    "score": 2,
                    "author": "Bizzle_worldwide"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another tip to add Bizzle, for founders who are trying to model their cap table: you can use [https://captable.io](https://captable.io) for free. Allows you to manage initial stock grants, options packages, and convertible instruments in a pretty convenient format - a boon for those lacking Excel skills.",
            "score": 3,
            "author": "rarehugs"
        },
        {
            "level": 0,
            "comment": "Thanks for this! We're currently working on getting a business funded. My role isn't negotiating the funding, but I still would like to know how it all works and this was super helpful. In fact, it's the first thing I've ever bookmarked on Reddit.",
            "score": 3,
            "author": "Thijs-vr"
        },
        {
            "level": 0,
            "comment": ". \n(Just to remember this wonderful thread in a few years)",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Excellent write up 👌🏻👌🏻",
            "score": 3,
            "author": "avijaunty81"
        },
        {
            "level": 0,
            "comment": "So helpful. Thank you. ",
            "score": 4,
            "author": "Kurikoku"
        },
        {
            "level": 0,
            "comment": "Thanks for putting this together, I'll have to reread it once I get home so it all really sinks in.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Very informative and detailed! Thank you ",
            "score": 2,
            "author": "dozey-"
        },
        {
            "level": 0,
            "comment": "The timing for this post is great.  Thank you! I’m in a startup and just went through the process of converting my options to stock.  Fortunately, we were provided the full merger agreement and cap tables for the series B, so I had a pretty good idea what was going down when looking at this in conjunction with this post.\n\nThis was like... 3 days ago when I read this post as a comment in the other thread.\n\nThanks for taking the time! Best post on this sub in a long long time.",
            "score": 2,
            "author": "ekothree",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s great! I love hearing about situations where the staff are kept fully informed of transactions, and helped to understand how they’ll be affected. It shows that founders/management, both new and old, both recognize their value, and care about them as a team. \n\nI hope it’s as good a place to work as it sounds. I’ll message you to see if I ever need a job to see if you’re hiring. To my credit, I do make a subpar cup of coffee, and I do so quite slowly. \n\nCongrats on the merger!",
                    "score": 2,
                    "author": "Bizzle_worldwide"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is an exceptional post - thanks a ton for putting this together.  There's so much vagueness and lack of knowledge around value of Stock Options out there in the startup world, and many companies deliberately obfuscate the sharing of info/take no interest in educating employees on what their equity positions actually mean, so people generally drastically overvalue their equity/overestimate how much founders make during exits, etc.\n\n&amp;#x200B;\n\nFor me, I knew of the concept of liquidation prefs but haven't really dug too deep and seeing it laid out like this was super informative.  ",
            "score": 2,
            "author": "zenmenity"
        },
        {
            "level": 0,
            "comment": "Is it okay to ask HR about liquidation preferences? I did not even know about this prior to joining my current startup",
            "score": 2,
            "author": "rainingdx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always say that it never hurts to ask. Understanding your compensation is the right (and responsibility) of every employee. Now HR might not fully understand your compensation either, but it starts the conversation. If it feels like there's resistance to disclose, I would explain the reason you want to know, as you recently read about cap tables and how they greatly affect the value of options, and options make up a sizable portion of your compensation (if they do.)\n\nIf they're still resistant, I think that provides a signal as to the priorities of management, and you should consider how much effort you want to put into that startup.",
                    "score": 1,
                    "author": "Bizzle_worldwide"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey just wanted to thank you for this post I have practically no knowledge of financing so I really learned a lot from the post and your comments",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Folks! What are your thoughts on the recent Careem acquisition by Uber?\n\n[https://www.thenational.ae/business/technology/hundreds-of-careem-millionaires-after-staff-share-in-3-1-billion-uber-payout-1.841866](https://www.thenational.ae/business/technology/hundreds-of-careem-millionaires-after-staff-share-in-3-1-billion-uber-payout-1.841866)",
            "score": 1,
            "author": "mrabdussalam"
        }
    ]
}