{
    "id": "gmrgh0",
    "score": 1064,
    "title": "A step-by-step guide of how I would build a SaaS company right now - part 1",
    "author": "lickitysplitstyle",
    "date": 1589904387.0,
    "url": "https://www.reddit.com/r/startups/comments/gmrgh0",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/startups/comments/gr05kk/a_stepbystep_guide_of_how_i_would_build_a_saas/)",
        "https://www.reddit.com/r/startups/comments/gzwdtx/a_stepbystep_guide_of_how_i_would_build_a_saas/)",
        "https://www.reddit.com/r/startups/comments/hf4ph4/a_stepbystep_guide_of_how_i_would_build_a_saas/)",
        "https://www.reddit.com/r/startups/comments/hro693/a_stepbystep_guide_of_how_i_would_build_a_saas/)"
    ],
    "postText": "**LET'S DO THIS!**\n\nI've been getting some questions recently from people that have reached out to me for advice and I wanted to pay it forward to the community. I've advised a ton of businesses from idea, to seed, to raising money and exiting.\n\nMy focus is on business strategy, sales, and marketing. All around building repeatable processes and streamlining operations.\n\nThis is what I advise my clients to do right now -\n\n**General thoughts about B2B and B2C**\n\nIf you're B2B you're looking at either ongoing services or software and in some cases a little of both.\n\nIf you're B2C you should be looking at consumable products, things people buy multiple times, with high LTV (lifetime value) customers or a product with a subscription element. **NO OTHER EXCEPTIONS HERE.**\n\nIf you're selling into either businesses or consumers today, it's all about perceived value, which means there is some wiggle room depending on who you're selling to, BUT the following really should be held as foundational:\n\nThese are pretty much the only reasons people buy things for B2B:\n\n1. It saves them time (reduces friction or replaces a time consuming task)\n2. Makes/saves them money (creates revenue/ adds value that lets them win business)\n3. Adoption is simple for their workforce (is easy to incorporate into an existing workflow and anyone can use it/cost of switching in relearning)\n4. Adds transparency and allows for bigger insights (provides data)\n5. B2C additional one - provides them joy or enhances their life\n\nThat's it.\n\nThe most high growth businesses usually knock out at least two of the above. Really high growth companies hit four or more.\n\nUber is an example of hitting just about all of them:\n\n1. No need to call a cab company and hope they show up, know where they are\n2. Saves them money, no more guessing on price and subsidized rides\n3. Just download an app on your existing phone and add your cc number\n4. Tells me where my ride is, how long until they come to me, and how much it will cost\n5. Gives me an easy way to get a ride when parking is tough or drinking is involved because of their reliability\n\nThis works for a lot of businesses though - and there are more than a few SaaS companies that I’m close with that have nailed the majority of them and are creeping up in clients and funding as a result in historically busy spaces.\n\n**Overall management advice because it’s more important than people think**\n\nManaging is tough, just because someone was a great employee doesn’t make them a great manager and just because someone is an executive doesn’t make them a great communicator.\n\nRespect that everyone has different ways of communicating.\n\nTwo lessons I’ve learned from working with a ton of senior leadership.\n\nInternally, break down everything into little goals, constantly ask yourself \"What's my goal?\" when it relates to calls, emails, outreach, posting, hiring, meetings, etc.\n\nMake that shit your mantra then distill it down to the simplest form it can be.\n\nYou should always strive for clear and concise communication throughout all interactions. If you disagree with a request or find it not in the best interest, agree anyway first, then raise questions about it. Remember, we’re all in this together and our goal as a company is to help everyone clearly articulate “What’s my goal?” at a micro level to encourage good communication.\n\nRecord all your processes from day one - process is what sets apart winners and losers, always be looking to improve your processes because down the line you're going to be looking to automate these - having records of your approach and what worked and didn't will be invaluable while growing, scaling, or building systems to streamline your approach.\n\nThere is a tool for everything, that doesn’t mean you should use every tool. Find what works for your team and what has the highest level of adoption, create good habits around using the tools that provide you the best organization.\n\n**Pep talk done let’s get down to business**\n\nWhen you're starting out the only things that matter are:\n\nBusiness strategy, partnerships, product, and marketing strategy.\n\n**IN THAT ORDER**\n\nSome of you will argue a team should be included, but I’m of the belief that if you nail all the above correctly, the people you have running it don’t matter as much. It’s more a matter of consistency and process than the people are executing.\n\nToday most smart businesses follow the same path:\n\n1. Start with your revenue and monetization plan (are you targeting a sector that has money and can/will pay)\n2. Align yourself with others in your space (cheapest way to get traction/credibility)\n3. Work on road mapping your product to align with what complements your partnerships (cheapest distribution)\n4. Work on building a marketing strategy that can help expose and align your brand while strengthening its recognition with your partners (will this make us both look good)\n5. Build customer advocates along the way, tell their stories (lead with examples)\n\n**The above if done correctly massively increases your chances of success**\n\nLet’s go over them one by one. (this post only covers number 1 - let me know in the comments if you want me to write up 2 through 5)\n\n**REVENUE AND MONETIZATION - Will they pay? Do they have money?**\n\nThe following three questions can help you quickly weed out your ideas:\n\n1. Is what you’re building something that people are used to paying for?\n2. Is the part of the business you’re looking at a cost center or a revenue generator?\n3. Is what you’re providing a race to the bottom or increasingly a data play?\n\nYou're answers should be, YES, Revenue Generator, Data Play.\n\nThis is your best shot at success. Even a reduction in costs isn't as sexy all the time. Just compare your support budget to your marketing budget and these things become clear.\n\nStory time relevant to number 2 above - cost center v revenue generator\n\nWe were using a series of three tools to automate a series of tasks we all hated. The three tools cost us around $1500 a month, the tools that did all the automation that we added, less than $200. We had to use the other tool either way but for $200 we were able to automate 80% of our work. To us we would have paid 10x for those solutions. The gap was we didn’t have any other good options to accomplish what we needed.\n\nI thought about building out a system and a product to fit this space, knowing the amount of savings this provided, but I ran into a problem - People weren't used to paying that amount for what we could provide, the part of the business was viewed as a cost center, and the data play is something that hadn't been used in that way before. Great idea, needed, proven out, but not marketable.\n\nYou always want to be part of revenue creation - people are willing to pay more just about every time.\n\nEven really good ideas sometimes aren’t worth pursuing if the market conditions can’t support them.\n\nIf you hit all the above three then we can move on to the best steps for getting this up and running.\n\nThe steps for validating an idea\n\n1. Market knowledge\n2. Competitor research\n3. Niche\n4. Earmarked budget\n\n**Market Knowledge**\n\nKnow the industry you're entering.\n\nPlease, for the love of everything, only start a company if you have intimate domain experience. Put differently, if someone was looking for someone to present even at a local level around what you're building would you be able to speak articulately about it where people would respect your opinion because of past work you've done?\n\nIf the answer is Yes, pat yourself on the back.\n\nIf it is no, stop, don’t pass go, you’re stuck with two options -\n\n1. Recruit someone to work with you that has enough domain knowledge for the both of you, or\n2. Go get some experience in the field, then come back to your plan\n\nFar too often I talk to people that have had massive success or are really really smart, but they are taking on a project or product that is outside of their sweet spot. This leads to utter and total chaos and really is a waste of time and money in the vast majority of cases.\n\nThose that don’t know, partner. We’ll get to more of this in the second step, I’ve seen this work with companies where some groups lacked complete domain expertise. These were 3x CEOs and founders with healthy exits. This is harder to do, but works if you're smart about it.\n\nSo what happens when a founder doesn’t have domain level experience especially in the early going, problems with go to market and validation, sometimes a general lack of understanding of business principles and market conditions. The result 99.9% of the time is that without domain expertise, founders end up misjudging the market massively and fail to provide the appropriate value.\n\nThey often find themselves playing catch up and not in a good way, this is something that is easy to avoid, but hard to admit to oneself.\n\nI’m a huge proponent of learning an industry on the fly, but I feel like the better decision when possible is to get paid by someone else while you’re learning.\n\nBut what about getting advisors and consultants to help me bridge the gap?\n\nI’ve seen this one in person, I’ve been part of this one, people don’t listen all the time. In some of the companies I’ve done work for, I’ve laid out what steps they should take, and watched as they fought back based on calculations that lacked all possible basis of being remotely possible losing millions of dollars in the process. The lack of domain expertise kills you when it comes to decision making if you’re not open to listening. But as an advisor, your job isn’t to make decisions for the teams, it’s to provide guidance and engage in conversations to bring issues to light and help people focus on goals.\n\nI've literally called business results months in advance in single meetings with executives only to watch things play out exactly how I predicted - usually negatively.\n\n**Competitor Research (this is just an overview - this is it's own post and a half)**\n\nThe basics\n\n1. Selling to someone that is using an existing solution is easier than enticing someone on a new concept or idea - cheaper too\n2. If there's competitor there are easy ways to build entire spreadsheets of their client list\n3. Look for industries within those client lists to build case studies around\n4. Remember you're in the game of creating content - be a resource for your community\n5. Qualify potential customers by using their opinions in your content marketing\n6. Use existing platforms for distribution where possible (integrations anyone?)\n\nYou have more competitors that you know when launching a product, even if you’re a market first, you’re going to quickly find that the barriers to entry are steep and if the market is big enough people will be able to out spend, out maneuver, and out shout you pretty quickly.\n\nThis shouldn’t deter you, it just means you need to be smarter.\n\nExisting Providers\n\nKnow the entire landscape for the type of product that you are creating. Know all the sort of competitors, talk to people and see what they are using, ask questions on Reddit and in other forums, understand who people know in the market.\n\nThen go to G2 and capterra and every other place that people talk about those products, scrape all the reviews with pros and cons - on some websites the reviewers even have linkedin links - go to their profiles learn about the companies they work for, the roles they have etc.\n\nThere is so much data out there, work smart from the start.\n\nThis is literally a post in it’s own or a chapter of a book. (if you’re reading this and you want me to break this down I can in another form).\n\nCorrelate what your competitors do well, what they lack, and everything else in between.\n\nIf you look up CRM you’ll see more than 250 listed probably more than 300 now, not including all the new ones like airtable and others that have popped up recently that aren’t direct traditional CRMs but just as useful.\n\nThat’s a lot of space junk to get through.\n\nBut there’s an easy way to get through it.\n\n**NICHE YOUR SHIT DOWN**\n\nThe biggest problem that most companies have is being able to properly niche down to the most ideal customer profile first, then work to expand the market after the fact.\n\nRemember that perceived value comment from way above.\n\nSo how do you find yourself in the best possible chance of creating something that you can do well with?\n\nBuild something that people are paying for, generates revenue for the business, and includes a data play as icing on the cake that improves processes and decision making.\n\nThis will never work in broad terms, you need to be specific.\n\nOne of the most common missteps people have is saying, their product is for everyone or every business. **This is a red flag, don’t do this. Focus on doing one thing better than everyone else, look for data that supports a 10x uptick. This is basically required if you want someone to give your product a try as moving things over from an existing system are annoying.**\n\nYour product needs to be very narrow, when you think you’ve gone narrow, you need to go more narrow.\n\nExample:\n\nWe’re a helpdesk product.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies using Shopify.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies using Shopify and Shipstation.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies using Shopify and Shipstation that have less than 100 skus.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies using Shopify and Shipstation that have less than 100 skus and do less than $10 million in annual revenue.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies using Shopify and Shipstation that have less than 100 skus and do less than $10 million in annual revenue with support teams less than 5 people.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies using Shopify and Shipstation that have less than 100 skus and do less than $10 million in annual revenue with support teams less than 5 people who are looking to automate their processes.\n\nv.\n\nWe’re a helpdesk product for eCommerce companies using Shopify and Shipstation that have less than 100 skus and do less than $10 million in annual revenue with support teams less than 5 people who are looking to automate their processes who are currently using Zendesk.\n\nJust keep going deeper.\n\nThere are perks to going deeper -\n\nThe deeper you go usually the less competition you have - the more specific and tailored the easier the sales pitch is because you spend time creating things to help with workflows that relate to how they are working. When you know these workflows it's easier to have meaningful conversations.\n\nI’ve harped on the idea of process the entire time. And I’m going to continue to do it. Build things to simplify processes and watch people sign up and pay you to solve their problems.\n\nThe ideal solution is turnkey that works with all the workflows people have or simplifies them with the amount of tools out there find the ones that you want to be part of the process with and integrate deeply.\n\n**Earmarked Budget**\n\nIs the budget expanding, will it be expanded if you can tie results back to your product?\n\nThis is actually really important because it comes to the ability to grow an account once you are in the account. Some businesses are better than others.\n\nIf you’re a support desk product like above, and you reduce the amount of work people need to do, you’re reducing seats, if you can’t add features and other elements to increase the revenue per account or the size of the support team you’ve actually tapped out. This is the argument behind being a revenue generation company rather than a cost center. When it comes to a cost center it’s a race to the bottom and kills expansion, it forces you to always be acquiring new customers to increase revenue.\n\nThis should be plenty to digest as you're thinking of ideas to pursue.\n\nLet me know your thoughts in the comments, hope this helps people out.\n\n**I've got to stop here, we hit question 1 of 5 and we've barely scratched the surface.**\n\n**Part 2 is now live** [HERE](https://www.reddit.com/r/startups/comments/gr05kk/a_stepbystep_guide_of_how_i_would_build_a_saas/)\n\n**Part 2.5 is now live** [HERE](https://www.reddit.com/r/startups/comments/gzwdtx/a_stepbystep_guide_of_how_i_would_build_a_saas/)\n\n**Part 3 is now live** [HERE](https://www.reddit.com/r/startups/comments/hf4ph4/a_stepbystep_guide_of_how_i_would_build_a_saas/)\n\n**Part 4 is now live** [HERE](https://www.reddit.com/r/startups/comments/hro693/a_stepbystep_guide_of_how_i_would_build_a_saas/)",
    "comments": [
        {
            "level": 0,
            "comment": "This kind of post is why I come to Reddit. Thanks [u/lickitysplitstyle](https://www.reddit.com/user/lickitysplitstyle/)!\n\n&amp;#x200B;\n\n*\"If you disagree with a request or find it not in the best interest, agree anyway first, then raise questions about it.\"*\n\nThat's brilliant. As a Frenchman (so quite direct), I learned to do that when I worked in the US. We were trained to use \"the bullsh\\*t sandwich\" to communicate with our American colleagues.\n\nNow, I kept using that technique when I came back to France and IT WORKS WONDERS! People listen to your feedback 10x more if you agree with them first, even if just in appearance.",
            "score": 80,
            "author": "StephNass",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it's because we fundamentally want to hear our opinion is respected whether it's wrong or right, i.e. that our interlocutor *a priori* views us as someone capable of valuable contribution.\n\nAgree first to assuage someone that their opinion is valued. Proceed to tear it down by leading them towards the questions that invalidate it. They'll get to where you need them to get and be pleased to think it's been their idea all along.",
                    "score": 11,
                    "author": "Suecotero"
                },
                {
                    "level": 1,
                    "comment": "\"the bullsh*it sandwich\" alright, I'm stealing this",
                    "score": 5,
                    "author": "Endless-Nine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Go ahead, I stole it from someone else :)\n\nSome call it just \"shit sandwich\" or \"bullshit sandwich\". It basically the way Americans give feedback \"You did an awesome job. You just have to redo it all because it sucks. But really, keep up the good work!\". \n\nDon't try that with Germans though...",
                            "score": 6,
                            "author": "StephNass"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Makes the world go round and definitely adds to making things go smoother!",
                    "score": 8,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "PLEASE POST WRITE UPS ON PART 2-5!!! This is gold. So valuable. Thank you",
            "score": 23,
            "author": "globalconqueror",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm going to try to do one post a week, then I'll combine them on a website in a more chapter oriented format with a bit of further polish :)\n\nMaybe I'll create a course ;)",
                    "score": 20,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you have a website that I can follow? Thanks for this.. I'm going to learn a good deal from this!",
                            "score": 1,
                            "author": "ConsciousInside",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No website yet, just follow me on reddit for now. I'll work on figuring out how to put one together when things are a bit more organized :)",
                                    "score": 2,
                                    "author": "lickitysplitstyle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure :) Thanks!",
                                            "score": 1,
                                            "author": "ConsciousInside"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very well presented. I am sharing this content with a lot of my startup friends. Eye-opener!",
            "score": 7,
            "author": "jeevandongre",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad I could provide some value, if you have questions about anything, feel free to let me know.",
                    "score": 4,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey thanks for sharing this. I'd for sure be interested in reading posts about the other parts of this whole process. Also what is \"data play\"? :)",
            "score": 7,
            "author": "laimonas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Data is what influences decisions, would you prefer a platform where you put in all the inputs and had to analyze it yourself or where the platform would be able to give you recommendations?\n\nA lot of companies collect data then have no idea what to do with it, companies moving forward will have to provide suggestions against the learnings across their entire ecosystem.\n\nIn other words, make sure you have a path towards data collection in a way that allows you to provide anonymized value back to your community of users.",
                    "score": 9,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uber wasn't brilliant, they were willing to break laws.",
            "score": 5,
            "author": "TheUltimateSalesman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Look up what at actuary does.\n\nLook up the amount of fines Google and Facebook pay in a given year. You're going to quickly find out that most companies don't really play by the rules. That doesn't detract from how they played the game with go to market in the beginning.\n\nEverything is a risk reward situation. They had the option of just being a SaaS company and billing drivers by the month for use of the software more of a shopify like arrangement, they decided that wasn't the way to go.\n\nPersonally, I'm not a fan of their politics but the model can still be applied today legally with great success.",
                    "score": 11,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is an awesome post, however, I really gotta say that Uber and companies like it are bad examples especially for startups and small teams. Uber is the kind of company that can only get where it is by dumping massive loads of cash into it. Most people can't afford to make a startup that generates a net loss of tens of millions in revenue, maybe more. You can't even secure investment with a business model like that. Especially now that investors are waking up from the unicorn dream. If you want to do a BS business model, you're probably going to have to use your own money.\n\nIn any case, there are PLENTY of other companies that can be used as an example. I get that Uber is well known, but please don't use them as an example of good execution.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wrestled with this. But I went with something everyone has exposure to. I don't have to agree with their politics, their approach etc. But they do illustrate an existing market and the early days are relevant before the money infusions.\n\nTheir business model is very Bezos in approach, partner, learn, cripple, dominate.\n\nBut the core functionality of what they did does apply.\n\nThere are tons of other companies but a lot of people don't have weekly interactions with them. So that's the rub, I needed to pick something that's easy to understand.\n\nIn terms of execution - I'm going to disagree. \n\nTheir model for growth wasn't unique.\n\nThey created a product.\n\nPartnered with existing black cab companies in the early days.\n\nBribed customers to use the app. Then scaled from there.\n\nPaypal did similar things, Dropbox, etc. \n\nIf you're any company, you can do a lot of those things, in fact most companies even SaaS do partner with existing companies to offer a discount when signing up through another app store from a partner.",
                    "score": 8,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow! Crazy. \n\nThis is some serious gold content out there on reddit. \n\nLoved it man.",
            "score": 2,
            "author": "priyanshu1323"
        },
        {
            "level": 0,
            "comment": "Commenting to save this thread. Bravo op",
            "score": 2,
            "author": "Rrrroman"
        },
        {
            "level": 0,
            "comment": "This was such a great read! I hope you write the other parts as well.",
            "score": 2,
            "author": "louisettedrax",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Appreciate that you enjoyed it! As of right now I'm thinking I'll shoot for one part per week. But I'm happy to answer any questions as we go.",
                    "score": 5,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for this very informative post! I've saved it and plan to re-read it multiple times.\n\nTo your point about data play vs cost center, would you regard Slack as a cost center?\n\nWith the advent of Microsoft Teams, Google Meet, Facebook's recent rooms thing, etc I can't help but to wonder if Slack will soon find themselves in a race to the bottom (unless they pivot and/or find additional means of providing value)",
            "score": 2,
            "author": "2epic",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Data play is separate from the cost center.\n\nCost Center runs counter to Revenue Driver.\n\nSlack has done an amazing job at branding, product wise they took the platform approach from day one. This is where they differed from others, Teams, Google, etc, plugins are closed universe, Slack opened that up aiming at being the real time communication center.\n\nIt's what helped them sunset Hipchat by Atlassian. That had it's advantages of being linked with Jira. So it really just depends, the platform play is defensible though.\n\nSlack wins because if you've been with them long enough they have a ton of data stored that is all searchable. They play the sneaky game of making it hard to move to a competitor once you've been in there long enough.\n\nI used to have a rule, if you needed something from me, send an email not a slack message. But for agile development slack is great for sending screenshots and quick communication. I'm a google guy so slack is my only option for right now.\n\nI'm waiting on google to release their competitor then I might find myself moving on from slack, just because of the native integrations that will be there.\n\nThe platform play is always a good play as it buys you time to figure things out.\n\nTheir market cap is only $16.68 billion - to put that into perspective microsoft paid $26.2 billion for linkedin a few years back. Slack in and of itself isn't a large large company, not one outside of being bought by someone like Salesforce who has a history of buying public companies to bolster their bottom line.\n\nOnly time will tell.",
                    "score": 3,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great stuff, but I wanted to challenge you a bit on the importance of partnerships *in the beginning*.  \n  \nI would pace the acquisition strategy by e.g. # of customers (b2b, never done b2c myself). Some reasoning:  \n- the first 10-100 customers are key for understanding the market  \n- partners want whats good for them, too, so having thode first customers helps make the sale to partners  \n- not being in charge of your own pipeline (i.e. relying on partner channel sales) makes you vulnerable  \n- building a sales function means you have a (manually) scalable and manageable, way to acquire new customers\n- so working in gates of e.g. first 10/100/1000/10000 customers, acquisition will look vastly different at each gate  \n  \nFor every Slack out there with no sales function, there are dozens of b2b saas companies with SDRs and AEs and CSMs bringing home the bacon.",
            "score": 2,
            "author": "ruraro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah you caught me! Kidding we have a different definition of partners.\n\nI was referring to ecosystem partners not SALES CHANNEL partners. I view everything from the viewpoint of leveraging an existing larger name via an ecosystem.\n\nFor early companies building products, integrations play a huge role as to picking the right platforms to build on top of, we saw this with salesforce, Copper more recently on gmail, anything on shopify, or the slack ecosystem.\n\nYou start with people that use a solution that don't love it, but it's the best they've got, there are too many of these to count, then you build an integration to allow for data portability and onboarding. I could go on, but you know that stuff.\n\n*Answers Inline in italics*\n\nI would pace the acquisition strategy by e.g. # of customers (b2b, never done b2c myself). \n\nSome reasoning:\n\n* the first 10-100 customers are key for understanding the market\n\n*They aren't, there are way quicker ways in B2B to tell what people are using, what's good about the products, what's bad about them and where you might be able to fit in. The first customers are good for feedback, but honestly if you've already launched you're too late you should have your first 10 or so before you go public. The best companies already do.*\n\n* partners want whats good for them, too, so having thode first customers helps make the sale to partners\n\n*You're thinking sales partners, I'm thinking integration and platform partners, hence the example of the Shopify - to me partners means ecosystem partners. If you build an integration with an existing ecosystem they want to work with you to leverage the mutual benefit. You might not get a blog post immediately, but trust reaching out to a potential customer telling them you're working with a platform as a partner and have a new integration MOVES THE NEEDLE.*\n\n* not being in charge of your own pipeline (i.e. relying on partner channel sales) makes you vulnerable\n\n*Not the kind of partners I was referring to, those are completely different. Partner programs, I've run them come way down the line after you've established clear processes. Years later in most cases.*\n\n* building a sales function means you have a (manually) scalable and manageable, way to acquire new customers\n\n*Love it, this is coming in a future post, all I do is build sales funnels, I've narrowed down a sales funnel that creates content, leads, and also gets you calls basically every single time by thinking differently, it's been highly successful. I need to figure out where to fit it into the flow, it's probably separate from the existing flow but it will peek itself out in the second part :)*\n\n* so working in gates of e.g. first 10/100/1000/10000 customers, acquisition will look vastly different at each gate\n\n*Completely agree, past 50 really you should be inbound marketing and have entire programs built around supporting your existing ecosystem partners and creating user stories around your existing customers. At 100 you should have switched to mostly content marketing with different user journeys with a good amount of left over ABM still really highly personalized outreach like a human, at 1000 you should have a repeatable process and campaigns aimed at taking someone through a complete journey start to finish and understand where people are at any given time. At 10,000 you're a brand, a known one, which means you just need to provide a great customer experience and stay committed to ensuring your product keeps progressing to solve the needs of the customer base.*\n\nSeparate note, I think the idea of SDRs, AEs, SEs, AMs, CS, etc are all going to massively change inside the next 5 years almost guaranteed. People are going to be blindsided by it, too much wasted effort and shit outreach and emails, cadence isn't human and people aren't actually doing sales anymore. All the stats are pointing towards this movement, but it's about to be accelerated massively. I spend a good amount of time consulting on sales process and I can tell you this much most people suck right now and don't even realize it. (topic for another day)",
                    "score": 5,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i have spent the last bit devouring this post and  all the comments.  \n\n\ni'm curious if you're going to share more in a future post about your last paragraph here about  what is going to change in the sales process.\n\n&amp;#x200B;\n\nvery interested  to hear more on that.  \n\n\nthank you for sharing all of this  -- excited to read the next posts soon : )",
                            "score": 1,
                            "author": "gonnahaveabadtime"
                        },
                        {
                            "level": 2,
                            "comment": "This was an excellent example of handling valid counterpoints in a gentle, conversational manner without attacking each other. The web needs more of this! ![gif](emote|free_emotes_pack|feels_good_man)\n\nExcellent post u/lickitysplitstyle and good points, u/ruraro",
                            "score": 1,
                            "author": "darth_ignoramus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you! This is fucking gold!",
            "score": 2,
            "author": "CuriousIthinknot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks glad you found it helpful!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are a god amongst men",
            "score": 2,
            "author": "RobinThicc01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really appreciate it! Glad you enjoyed!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the post, definitely needs to revisit again from time to time. A side question, since you are using uber as an example, can you elaborate a little bit on why they are still unprofitable if they are doing a lot of things right?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think they are doing things right per se business wise. I think they did a lot of things right it terms of ***growth***. One of the key points listed is the subsidized rides.\n\nLook no further than that to determine why they are still not profitable. If a ride costs normally $10 and Uber made the ride $6 then that money has to come from somewhere, what you're seeing is that drivers have been pinched over and over again and the reduction in price is actually Uber owning it as a \"marketing\" expense.\n\nThey were competing against taxis - so they needed to undercut them in the beginning in order to grab market share.\n\nThey chose to make the land grab play, scale to the point of being too big to not be a major player, raise boatloads of money to subsidize and promote the adoption, work on profitability last. This is a model that a lot of high growth startups follow.\n\nThis is not a growth plan that I would advise 99% of companies to take and it's one that doesn't really fly with the current economic environment.\n\nUber really just abuses labor practices that benefit their bottom line. If places like California enforce AB-5, the business model isn't sustainable.\n\nI see ride-hailing as a race to the bottom - when we get to electric cars and autonomous driving anyone can build an Uber. There is nothing defensible about their business model other than branding.\n\nBut if you're a small hardware startup looking to get off the ground, raising a round and subsidizing the cost of your hardware is definitely something I would recommend, because in the beginning you're looking for adoption and feedback scaling towards your v2 of the product where you can negotiate better terms with your manufacturer, sales channels etc. it's a hedged bet. New technology is usually really really expensive in terms of R and D and engineering, it's also usually over engineered (read:more expensive than it needs to be).",
                    "score": 4,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a great post. Thank you!!",
            "score": 1,
            "author": "cryptoenthusiast93",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad you enjoyed! Let me know if you have any questions, happy to answer.",
                    "score": 2,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "!remindme 1 day",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 22 hours on [**2020-05-20 20:20:33 UTC**](http://www.wolframalpha.com/input/?i=2020-05-20%2020:20:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/startups/comments/gmrgh0/a_stepbystep_guide_of_how_i_would_build_a_saas/fr647po/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstartups%2Fcomments%2Fgmrgh0%2Fa_stepbystep_guide_of_how_i_would_build_a_saas%2Ffr647po%2F%5D%0A%0ARemindMe%21%202020-05-20%2020%3A20%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20gmrgh0)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                    "score": 1,
                    "author": "RemindMeBot"
                },
                {
                    "level": 1,
                    "comment": "!remindme 5 day",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great post man! Thanks",
            "score": 1,
            "author": "carmineapice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciate the kind words! Let me know if you have any questions!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for sharing !",
            "score": 1,
            "author": "PutinsArmpit",
            "replies": [
                {
                    "level": 1,
                    "comment": "No problem! Let me know if you have any questions!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "remindme! 20 hours",
            "score": 1,
            "author": "Wishmaster90"
        },
        {
            "level": 0,
            "comment": "One of the best posts I’ve seen in a long time! Thank you OP! Would really love to read parts 2-5 if you get the time to write them... I can appreciate how much time and effort went into creating this! Keep up the good work.",
            "score": 1,
            "author": "PresentingPercy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the kind words! I'm going to try to add the parts one per week depending on my schedule, looking to probably clean them up and put them in a better form when done on a website just to get them all in the same place. Let me know if you have any questions or are more interested in certain parts that I didn't go into depth on in this or in one of the future parts.",
                    "score": 2,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome post! Thanks for sharing",
            "score": 1,
            "author": "travel_lover12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad you liked it! Let me know if you have any questions!",
                    "score": 1,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously one of the best I’ve seen. Good work and let me know if there’s a part 2!",
                            "score": 1,
                            "author": "travel_lover12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There will be a part 2, it's in the middle of being written, we'll hit all 5 parts, then I'll look to expand on them and dump them on a website to make it easier to navigate - who knows maybe I'll even add in some videos ;)",
                                    "score": 2,
                                    "author": "lickitysplitstyle"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing! Thank you so much.",
            "score": 1,
            "author": "goldenhour58",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're very welcome! Let me know if you have any questions!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was a fantastic writeup! I'm new to all of this and it mostly went over my head. If I wanted to really learn this sort of thing to say, start a business in a year from now, what could I do or read? I assume getting an MBA would help a lot, but are there any books that cover all of these concepts?",
            "score": 1,
            "author": "bencelot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't have an MBA.\n\nGo work for people :)\n\nNo one tells people to do that anymore, but it's the best advice I've got to give, put yourself in a position where you can learn and grow while getting paid for it.\n\nDegrees don't really matter, it's more a matter of experience and putting yourself in positions to constantly learn.\n\nI'm sure a lot of these concepts are covered in books, I don't read business books, never really found them helpful. All of this is from experience, some good and some bad :)\n\nI do read a lot of news though, like a lot, a lot. I average between 30 - 50 articles a day at least specifically on spaces that I'm interested in.\n\nFor books, when I do read them, I only read psychology and philosophy - it's all about human behavior, logic, and thought processes more generally.\n\nI've learned to read people really well at this point.\n\nFor reading...\n\nI would suggest an RSS reader and track topics that you're interested in, block off an hour a day to read through the news and save articles and highlight things you find interesting then look up more about the topics.",
                    "score": 2,
                    "author": "lickitysplitstyle"
                },
                {
                    "level": 1,
                    "comment": "&gt; If I wanted to really learn this sort of thing to say, start a business in a year from now, what could I do or read? \n\nPlenty of business books. I've highly recommended The E Myth to a number of small business owners that were underperforming. But because it's applicable to the specific reason they were underperforming. Likewise.. I really couldn't make any recommendations for you without knowing what you do know or seeing your business in action.\n\nI agree with OP - go work for people. Most of us take jobs based on salary or connections or future career aspirations. Screw all of that. Find someone that you find inspiring and/or knowledgeable and work for them. Like.. if you're 18 and can take a gap year, find your local executive coaches, high end consultants, successful founders, etc. etc. and offer to be their assistant for minimum wage for a year. Work your ass off. You'll learn a lot and build a network.\n\nAnd do pursue ANY educational opportunities that come your way. Larger companies often offer personnel management training (emotional intelligence, DISC, leadership) and may have opportunities for things like Lean Six Sigma or Agile. Don't live and die by this stuff religiously, but you should definitely have some take-aways. Keep your ear to the ground and if you hear of such an opportunity but you weren't invited... ASK to join! (offer to make up the hours on a weekend if needed)",
                    "score": 2,
                    "author": "nevesis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "true story: my buddy hired an executive assistant on like day 2 of his startup. she's been there to watch the whole thing scale over the past 3 years. she probably could have gotten by in the role for a while doing what the job entailed. but that wasn't her plan... her plan was to make the most of the opportunity. among other things, she (brilliantly) offered to attend meetings in his place and give him scrib notes. so basically she's been an over-eager student of this business that scaled to mm annual profit, completely bootstrapped. and it's paid off.. her hard work and loyalty is appreciated... she's now paid mid-mgmt levels.. and reading the tea leaves, I wouldn't be surprised for her to leave to successfully start her own thing soon.",
                            "score": 1,
                            "author": "nevesis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad you enjoyed it! Right now the plan is to *try* to release the parts 1 per week depending on time. I'll probably wrap them all up and post them to a location when they are all done just so they are more accessible.\n\nIn the mean time let me know if you have any specific questions!",
                    "score": 2,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*Answers Inline in Italics*\n\nI'm just starting and there are a bunch of terms I need to familiarize with, any resources you recommend for starters like me? E.g.: how to calculate the LTV?\n\n*Google is your friend, there isn't one right answer here, people factor things in all different ways, some people look at cost to acquire as being just ad spend not employee salaries etc. Just depends.*\n\nPeople might see the value of a given solution but they are not used to pay for their current manual/convoluted processes, how to show them the value of a given solution and convince them to pay for it? \n\n*The cost of doing nothing - this is actually the leading cause of not being able to sell something, people have an existing solution that works good enough.*\n\n*From a sales perspective, it helps to focus on streamlined workflow, more data tracking, and a few if possible star features that are differentiating points. It's getting harder with more and more tools on the market so we're seeing a lot of really great traction with brands that are really niching down in ways that we haven't seen before. Everyone's goal is a customized system for them, the closest you can get for mass production is focusing on the existing workflows and making them work seamlessly as possible.*\n\nWhat are Cost Center, Revenue Generator, Race to the bottom and Data Play? \n\n*Cost Center - something that is viewed as something that costs a company money but doesn't directly drive revenue - Customer Support, Returns, etc.* \n\n*Revenue Generator - could be software that enables sales, an email marketing platform, affiliate program, basically anything that has a contribution towards creating more revenue usually linked with a part of the business that is responsible for revenue generation.*\n\n*Race to the bottom - where you compete on price and your idea isn't flexible enough to prevent other larger incumbent companies from competing with you directly on price. Hence a race to the bottom.*\n\n*Data Play - when all else fails, use data to help you stand out. By and large the weak point of most products is not the data collection but how that data is used or leveraged to provide insights across not only an account but a sector. Whenever you're building a product you need to position yourself as a company forward thinking enough to understand the underlying power of the data you're collecting and how to leverage it for features, future partnerships, etc.*\n\nMost importantly: how to find the topics that I need to know about but I don't even know they exist? \n\n*Read a lot. Get an RSS reader and pump in a bunch of Google Search terms and follow a bunch of different sources, commit yourself to reading at least 1 hour per day about topics that relate to what you're interested in, double down, take notes, ask questions, engage in conversations and seek information out.*",
                                    "score": 5,
                                    "author": "lickitysplitstyle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Data Play - when all else fails, use data to help you stand out. By and large the weak point of most products is not the data collection but how that data is used or leveraged to provide insights across not only an account but a sector.\n\nIt seems that the hardest challenge is defining processes in order for the data to be consistent. Most companies want to \"manage to good\" but they don't really know what good is. So they ask their peers, \"how quickly do you respond to support requests?\" and get some numbers. But one peer considers that the time it takes until someone reads the request and triages it, the second considers it the time it takes to the first reply via email (even if the email is just saying we will get back to you), and the third the time it takes to send an email that actually makes progress (even if not resolved). \n\nThis is something to keep in mind while designing SaaS -- the more flexibility you allow, the less specific data you'll gather. If targeting SMB, I'm a big proponent of including business processes with the software. And then providing anonymized comparative data as a value add. If they're competent, they'll actually get more out of the latter two than the platform itself. But you've built a community and a VERY sticky client base.\n\nThis, of course, only works when you have that clearly defined niche. But it can scale to some degree as long as the foundation is built accordingly.",
                                            "score": 2,
                                            "author": "nevesis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah the clean data v. dirty data argument. Big fan of this one.\n\nYou just hit what's coming in part 3 - how to focus on road mapping a product to align with what compliments your partnerships\n\nEssentially reverse engineering the processes that companies are looking for - more data, recommendations on what to do with that data, and finally automation of those decisions.\n\nI'll talk about this in depth in part 3, so stay tuned. You've hit on something a little early that most people never get to, I dig it!",
                                                    "score": 1,
                                                    "author": "lickitysplitstyle"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I absolutely love this.\nThanks a lot!\n\nI wanted to ask more about marketing. I mean, if you have the best product and plan, it will not go well without proper marketing right? Even in the early stages?\n\nWhat do you think? What kind of marketing activities should an  early start up do?",
            "score": 1,
            "author": "justjassil",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you have the best product and the best plan you're better than 99% of the people out there. (this is never the case)\n\nThis is really moving towards a more customer journey question - a whole other topic that brings people a lot closer to sales and the relation of sales with marketing.\n\nI'll dumb it down for a quick response.\n\nProblems with marketing - \n\nExpecting that marketing is used for conversion - it's not, it's about awareness.\n\nSpend a lot of time on your website, make sure every message is clear and concise. Read things out loud. Seriously, a lot of people don't.\n\nThink of the questions that someone would have when they come to your website, tell them a story that leads then through that process, make sure that your goal is for them to not leave without giving you something, email whatever. Focus on that.\n\nThere are different parts of marketing - awareness, driving traffic, copy, conversion, value driving etc.\n\nIn the really early stages - I'll cover this in part 2 - really personalized outreach, human outreach strategic.\n\nI think marketing activities should come after you've spent all that money instead on cold targeted outreach and aligned your growth with the growth of your early clients.\n\nThe best form of marketing is word of mouth and that comes from making early clients feel like they are your only clients. (even if it's not true)\n\nI used to have all the customers that purchased a lot of our product (high end B2C at the time) sent over to me in marketing and I'd call them out of the blue and thank them for their order and ask about what their plans were for our product. It doesn't scale but it made them feel amazing and I was able to bag a steady list of amazing people to participate in our email campaigns focused on getting to know them, real people buying real products, there is nothing more pure.\n\nFind things like this.\n\nFor a lot of SaaS companies early on, I always view the good ones as being part consultant that can share industry knowledge and part partner, looking to help you maximize your ROI using their product and most of that comes full circle to understanding, \"What are your goals?\"\n\nOne of the worst things I see is sales is a joke these days - people suck at it and don't even realize it, all the automation has gone to a \"numbers game\" so much opportunity on the table. I digress.\n\nIt depends on your product offering, in all reality if possible you're marketing is just relationship building for an early stage startup and learning. Figure out how to make other people look good.\n\nMore of this will be covered in part 2 - things will start to take shape.",
                    "score": 3,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If your app doesn't involve a subscription... is it even saas 😏?",
            "score": 1,
            "author": "foundry41",
            "replies": [
                {
                    "level": 1,
                    "comment": "haha, no not by definition.",
                    "score": 2,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "PART 2! PART 2! PART 2! please :)",
            "score": 1,
            "author": "sol687",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm working on it, it's already at 6 pages long but I still have about a third of the way to go, goal is next week.\n\nStay tuned.",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "!remindme 4 days",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "!remindme 1 day",
            "score": 1,
            "author": "SuccessfulLeadership"
        },
        {
            "level": 0,
            "comment": "This is one of the best posts on business I have read on Reddit. Great job! Do you do any consulting?",
            "score": 1,
            "author": "MrCleanCut",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Appreciate it. Glad you enjoyed it!\n\nAll I do is consult these days. \n\nHappy to help if I can.",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uber just layed off 6000 workers and closed down 45 offices. I think they are the poster child of bloat.",
            "score": 1,
            "author": "Sightline",
            "replies": [
                {
                    "level": 1,
                    "comment": "For sure they were. That’s what happens when your core business is flawed and you hedge a million different side businesses.",
                    "score": 2,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was gonna say Uber sells $2 for $1 (ie the business model is not sustainable because if price elasticity). On top of that I was gonna ask about technical implementations. I've spent the last year writing an order delivery system that remains net positive (first in Python, then in Kotlin, and now in Rust). I truly believe if you don't understand the technical implementation you will run an inefficient startup/business.",
                            "score": 2,
                            "author": "Sightline",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fully agree. App and I use that to include web app, progressive, native, etc. and tech stack is super important. Having a clear vision of what you have and what you might need in order to scale to prevent re-writing things is really key. I can say after outsourcing projects and having partnered on projects, the latter is always better but having people that can understand larger picture and a good PM that can actually manage product is something that is often lacking.\n\nScale to most people means hiring - it actually should mean automating and work through process optimization, this is the leading reason for people getting fired. The short solution is just hire more people - it solves the immediate but doesn't actually tackle the \"why\" in most cases.",
                                    "score": 2,
                                    "author": "lickitysplitstyle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "!remindme 5 hours",
                                            "score": 1,
                                            "author": "Sightline",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 3 hours on [**2020-05-21 00:34:11 UTC**](http://www.wolframalpha.com/input/?i=2020-05-21%2000:34:11%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/startups/comments/gmrgh0/a_stepbystep_guide_of_how_i_would_build_a_saas/fr9t5k2/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstartups%2Fcomments%2Fgmrgh0%2Fa_stepbystep_guide_of_how_i_would_build_a_saas%2Ffr9t5k2%2F%5D%0A%0ARemindMe%21%202020-05-21%2000%3A34%3A11%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20gmrgh0)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                    "score": 1,
                                                    "author": "RemindMeBot"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sorry, gf was talking to me about something and I didn't write out my full response.",
                            "score": 1,
                            "author": "Sightline",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No worries. Really appreciate the discussion, it's why I choose reddit as my forum for posting!",
                                    "score": 1,
                                    "author": "lickitysplitstyle"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for this! Hope I’m not too late to ask a question.\nRegarding market knowledge - I’m assuming to have an insider as a founder is probably best but from your experience how difficult it is to succeed by starting off with basic market knowledge (researching and communicating with people you’re going to sell to) and hiring at some point someone with experience?\nIt seems a lot of startups I know didn’t have an insider as a founder but they either added relevant people to an advisory board or hired someone, usually during the A round.\nI’d appreciate your perspective on this, thanks!",
            "score": 1,
            "author": "reobb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, in today's market, you better have knowledge of the market or at least a really good understanding of how the market works. Talking to people you're going to sell to without being able to provide value and insight to them in the beginning is a huge uphill battle.\n\nI have worked with a lot of Series A companies that still don't get it. Usually this comes from people being in positions for the first time and being completely out of their depth.\n\nFrom this post management in my opinion is the biggest weakness at Series A companies even some of those where people were successful before. The more companies I've worked with the more I've realized how important management is - and it's incredibly hard to teach.\n\nI've seen the advisory board play, I am an advisor for a few companies, as an advisor you're not day to day so the decisions being made are not always correct for the market, there are obviously different levels of involvement, but it's rare that someone is only advising one company and can provide you with the hands on that you need to understand a market properly.\n\nIn short, I really don't think it's enough. Series A is too late in a lot of cases as by that time there is already an established road map. If you don't have direct domain experience - find someone as early as possible that does.\n\nWhen there's something that isn't in my wheelhouse, I go to my network and ask people that are better suited than me to provide advice then I figure out how long will it take me to get up to speed to provide the advice they need. If it can be done I'll start work slowly but focus on things that always remain the same, process, and getting to the small goals to better understand the framework of the org and where they are headed.\n\nBut honestly, if it's something completely out in left field from what I know, I'm passing.\n\nI'll also pass pretty hard when talking to people that don't understand some of the basics of the industry - you can't teach someone the industry as they are building a product for it  - and who wants to come in at A round for a knock on equity when they have to basically guide the product for the company and connect the industry? Not enough upside, have to ask some questions there about their motivations. READ: They may not be as valuable as you think.",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing, saved post",
            "score": 1,
            "author": "woulduliketobuymore",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Glad you enjoyed!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you! I find this to be a very helpful guide.",
            "score": 1,
            "author": "reklosunerim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the kind words!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This absolutely fantastic- I was looking for guidance for B2B SaaS product that I have built. Looking forward for Part-2",
            "score": 1,
            "author": "naggysr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad you enjoyed! Part 2 is currently in progress likely next week depending on schedule.",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I iterally just did this. I am working on a b2b that helps me get my unpaid invoices taken care of my automating emails and texts to my clients. It was helpful so I'm building an app for others to use. Https://paid.club\n\nIt's a b2b invoice creator that reminds and annoys clients to pay the invoice. Totally free if someone wants to help me test it.",
            "score": 1,
            "author": "Grigerny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely a good area - saw this first hand in a few industries. Chasing invoices sucks.\n\nGood Luck!",
                    "score": 2,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad you enjoyed! Let me know if you have any questions!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great advice. I'm curious to know what your reason to give back to the community was.",
            "score": 1,
            "author": "roonishpower",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love good conversations. I like Reddit more than I like LinkedIn. Have learned tons over the years on Reddit. Posts that made me think.",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a good question - depends on your service, model, and aspirations. I know that's not super helpful, but really it does depend on a bunch of variables.\n\nIn my experience people can always niche down further.\n\nIt actually doesn't, but it requires a change of approach.\n\nI always tell people to go as narrow as you can to gain traction then look for similar use cases and complementary personas. In the early days it's all about getting to product market fit as soon as possible and developing that use case. For most products these days people are building flexible architectures with basically a more modular approach - the good is it can work for lots of things. The bad, there's a lot of wasted time and effort with resources chasing everything.\n\nThe better approach is to fit product market fit, dominate that specific market, then expand to similar markets.\n\nIt's better to be a big fish in a small pond than a small fish in a big pond. Be the big fish in your small niche.",
                    "score": 2,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Focus on what you can deliver, slowly tease use cases into your pitches, you'll figure out what people care about and don't care about pretty quickly.\n\nLead with your star feature - use data if you can to back up it's value add. Ask some of your early discovery calls where they would like to see their workflows go.\n\nI'll give you a hint it's going to include: Data, Automation, Recommendations\n\nPeople glamorize the whole SaaS business, build something great get a bunch of clients on board.\n\nWhat people don't realize is that for many SaaS customers the majority of their income comes from just a handful of people that love their product and it fits into their workflow perfectly. Seriously, all SaaS is this way, they start small and all look to go enterprise then enterprise makes up more than 50% of their revenues often, not always but often.\n\nWhat people don't tell you is that for some people your product is expensive, for others it's cheap - it just depends on their workflow and the value add.\n\nYou're looking for people that think your product is cheap - these are the ones that are seeing so much value out of it that in most cases they would gladly pay more.\n\nFocus on these clients in the early days, build your vision around helping them succeed. There are more like them, let word of mouth work in your favor.",
                                    "score": 2,
                                    "author": "lickitysplitstyle"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow! I love this post, mate! I learned heaps by just spending a few minutes reading through the post. You got me thinking and more motivated when I had been stuck in the past two weeks with building my own. I hope you can go through from 2 to 5 with us. Once again, thank you so much. Keep up the great sharing, Sir!",
            "score": 1,
            "author": "KuningKuningKuning",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad you enjoyed! Yes the rest of it will work it's way out slowly. Depends on my bandwidth. Targeting one part per week right now :)",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "great post! can you add one post on how to start a one person b2c saas without funding and scale it?",
            "score": 1,
            "author": "amazeguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "B2C SaaS gets a little complicated. The approach is more similar than you think and something that definitely has a lot of parallels.\n\nThe biggest problem is, it's a lot harder to know what people are currently using to solve the problem and it's pretty hard to figure out what people are ACTUALLY willing to pay for.\n\nConsumers hate spending money on apps unless they are completely into it.\n\nPersonally, I'll buy a $13 dollar beer at a sports game but I'll pass on the $1 app. From a psychological perspective it makes no sense, but I'm not alone in this.\n\nThe most profitable B2C apps are all games. In-app virtual purchases. People love this shit. These aren't subscriptions but multiple one time purchases which follows the B2C model that I stated in the main post - consumable items that need replacement or a physical hardware product that requires a subscription (Pelaton).\n\nSubscription box sales come to mind. I guess this is the only category really, I've personally never been into them, but we do get wine delivered and our house does get fab fit fun delivered. So in that sense the model does work, these are all DTC companies that are curating products rather than content, but the concept is the same, create tailored selections for people to receive every so often.\n\nBut note the trends on these, they are almost always consumables. Food, trinkets, clothing meant to be worn for less than 2 years etc. They have to have a life cycle so that you stay engaged and keep buying.\n\nI still think there is room here for meal replacement and prep products - I'm actually surprised no one has done like a dehydrated food one with instapot where you just add water and boom you're good to go.\n\nThe short version -\n\nCommunity, Virality, Engagement are the only metrics that matter.\n\nFor non subscription boxes - Allowing people to build on top of your platform and earn income/rewards from it and you'll hit all three of the above.\n\nSome key things to be aware of FRICTION.\n\nWhat actions does a user have to take to find value in your app?\n\nTake the user actions -\n\nWhat does the user have to do in order to get started?\n\nDownload the app? Add content? Just answer some questions?\n\nIf you're asking me to pay for something upfront and I need to do things to get started or add content, I need to be able to make money off of it. Consumers pay for content, think Netflix, Spotify, etc. But they don't normally pay for things that require them to download then add a bunch of information and content, especially if they can't earn income from it. This is literally true of everyone.\n\nThe only caveat I had that applied to B2C is that sometimes you can achieve sales due to enjoyment. This is OK to do with one off purchases, pretty tough to do with anything traditionally subscription based.",
                    "score": 3,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is awesome!",
            "score": 1,
            "author": "SerialHypnotist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Let me know if you have any questions!",
                    "score": 1,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, I'm currently working on a web application for a medical field. This app will not increase income but will make staying compliant with government regulations less painful. There  are big players providing this service but they are over charging and therefore thier system is not widely used. According to your guidelines, I'm off to a bad start since this situation doesn't check a lot of your boxes. How would you go about proving this concept? \n\nI know the app will make life easier because I'm working on the field. I know business I plan to target are going digital on many fronts.",
                            "score": 1,
                            "author": "SerialHypnotist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Compliance avoids lawsuits and fines. It's also very expensive.\n\nSounds like you're freeing up time to focus on other things and automating a time consuming process. Do you know any other reasons other than cost that the solution isn't being widely used?\n\nTo me this would be a flag. If something provides value but isn't being widely used, it's usually not just money. Value is entirely up to the market and the positioning.\n\nThis tells me there's a misalignment with the value proposition. And the high price tells me the market size isn't very large.\n\nThese are general assumptions without getting more information.",
                                    "score": 2,
                                    "author": "lickitysplitstyle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You've raised really really good points. I know for the where I work, price is the reason behind why we haven't gone with the product yet. Covid 19 is making it hard for most institutions to spend now so there might be an opening. \n\nI have some connections in management positions and I have told them about what I'm building. They seem to be excited about it but I know that doesn't mean anything unless if they are willing to pay X amount of money for the app. I will dig more and try to find what else might be holding them back from switching to a similar app. \n\nRegardless, I will finish the XD of my app and ask questions while demoing the XD. \n\nMy questions - \n\nwhy haven't you gotten this kind of app yet?\nWhat would you pay for an app like this?\nWhat features would increase your chances of getting this app?\nI also plan to ask info about other institutions who are currently using an app like I'm building. I plan to reach out to these institutions to ask about why they got the app? I'm guessing size or financial status might be the differencing factor. Maybe I can go after similar institutions.\n\nThanks a bunch for all the info. Anymore suggestion, questions or feedback would be appreciated. If there is anything I can do to help in anyway please let me know. I free indebted. \n\nRobel",
                                            "score": 1,
                                            "author": "SerialHypnotist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm telling you price isn't everything. If it's not in the budget for this year or whatever the first step is to balance the budget to afford it IF AND ONLY IF it's value and ROI can be proven by data. Seriously, trust me on this one. People have a habit of finding budget for things that they can justify. \n\nIn B2B this is the only thing that matters. If it's not a NEED this day in age or with institutions with tight budgets forget about it. This sounds like a nice to have right now. Go prove me wrong.\n\nLet's work on how to phrase your questions -\n\n**why haven't you gotten this kind of app yet?** \n\n*What is preventing you from purchasing an app that solves for blank?*\n\n**What would you pay for an app like this?**\n\n*What return on investment would you be looking for to use an app for blank?*\n\n**What features would increase your chances of getting this app?**\n\n*What is your current workflow surrounding blank is there a part of it that you would like to automate?*\n\n*Read part 2 linked at the bottom of this post - it's not about features it's about workflow - if you chase features you'll lose to bigger companies with bigger budgets - focus on workflow.*\n\n**I also plan to ask info about other institutions who are currently using an app like I'm building.** \n\n*This is a great place to start - ask about how it works with their existing workflow or what changes they made to accommodate it.*\n\n**I plan to reach out to these institutions to ask about why they got the app?**\n\n*Ask how the app is positively impacting their workflow. You may be surprised with some of the answers you get and might point to a gap showing the apps they are using aren't perfect but it's the best they've got.*\n\n**I'm guessing size or financial status might be the differencing factor.**\n\n*Don't guess, hypothesize and prove it out one way or the other.* *All you have to do is ask the right questions.*\n\n**Maybe I can go after similar institutions.** \n\n*See part 2 about this, sometimes with products like these, the value cannot be realized by smaller institutions. The hardest part of selling a new product is getting people to switch from what they currently are doing - it's usually a combination of app and workflow. In healthcare it's usually bureaucracy.*\n\nYou've got this, just remember, small goals.\n\nWhat is my goal for this conversation? How can I get my answer to understand someone's role and responsibility.\n\nThink back to when you were a kid and you were so excited to talk to someone about their job, use that inner voice with some poise. You'll learn more than you can imagine.\n\nI still do this today, works every time. Good luck!",
                                                    "score": 5,
                                                    "author": "lickitysplitstyle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thanks for taking the time 🙏🏽",
                                                            "score": 1,
                                                            "author": "SerialHypnotist",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No worries, good luck! Thanks for the Gold!",
                                                                    "score": 1,
                                                                    "author": "lickitysplitstyle"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are your views upon using a chatbot when it comes to your websites. Do they really make an impactful difference in your business services?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the more ways people can get in contact with you the better. I think live chat is better than bots. People hate bots.  \n\n\nChat bots are great for scripted answers - think - Where is my package?\n\nWhen it comes to SaaS most people have a specific question that usually relates to bad formatting or organization of data on the website. So I think they could be useful to point to deficiencies in the customer journey via your website, but if you are answering questions via a chatbot on your website, you might just want to look at how you have your website structured.",
                    "score": 1,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for your view much appreciated 😊",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This might be stupid question, but what would do with those spreadsheets of their client list? Beyond just looking for trends, would you target ads at them? Or something else?",
            "score": 1,
            "author": "scribeco"
        },
        {
            "level": 0,
            "comment": "Awesome stuff here",
            "score": 1,
            "author": "kanosoup"
        },
        {
            "level": 0,
            "comment": "Competitor research: what if nobody is doing what you intend to do?\n\nPs your insights are superb.",
            "score": 1,
            "author": "rossaldinho89",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone is always doing something you intend to do. Whether or not they have productized it is a different question.\n\nIf you think no one is doing it, look to other industries where people do similar things. If you really think no one is doing it, you have to ask yourself why? Who has tried before? And lastly, what is someone doing that is similar.\n\nI've never come across something that nobody has done before in all my years talking to people. I'm always happy to help where I can though.",
                    "score": 1,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Iv a guy in as an investor that has sold I believe 5 startups one of which was acquired by Cisco and they then hired him afterwards who has helped look at the market. People do the email automation of emails and an so but nobody does the core business, I mean nobody.\n\nNot even remotely close, we believe the reason is due to the difficultly surrounding the NLP of the business.",
                            "score": 1,
                            "author": "rossaldinho89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like the space, for a variety of reasons, I DM'd you.",
                                    "score": 1,
                                    "author": "lickitysplitstyle"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you suggest deeply defining your customer when you are first to market?",
            "score": 1,
            "author": "fancynotfancy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I highly doubt something is genuinely first to market. Things exist in many forms. But the same principle exists go as narrow as possible within the group as the product applies. \n\nThere is always room for going narrower.",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "So glad to hear that! Keep up the good work!",
                    "score": 1,
                    "author": "lickitysplitstyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a great and thorough explanation but I'm wondering if anyone could explain:\n\n1. The difference between a cost center and a revenue generator\n2. The difference between race to the bottom and increasingly a data play\n\nTrying to rationalize them to myself and the only way I can make sense of it is possibly that a race to the bottom is something like competition driving down prices by undercutting the competitors but I don't know what the others are.",
            "score": 1,
            "author": "DTheDeveloper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cost center is something that a business reluctantly pays for because they feel they have to in order to succeed.\n\nA revenue generator is something that a business willingly pays under the guise that it helps them grow.\n\nBest example - if marketing is working in a channel, companies will spend more to drive more revenue, if more sales deals are closing, companies will look to hire more reps before they look to hire more customer support.\n\nIf a tool helps people sell more companies will purchase pretty much immediately. If a tool is used to reduce the amount of tickets support is getting, it's more of a process to get it approved as traditionally support has no correlation to increased revenue.\n\nThe race to the bottom is broadly, quicker, cheaper, faster. Amazon is a great example of doing this, Microsoft teams is another example of this, rather than having people pay like slack, they just include it with the existing software package. Teams surpassed Slack pretty quickly in total users as a result.\n\nA race to the bottom can be beneficial if there is a data play - it becomes a value add rather than something that can be viewed at as being negative. Google has a history of giving away products for free, getting a mass adoption rate then using the data to turn around and profit. Facebook does the same. \n\nIn the B2B world, sometimes the data is more valuable than the service being provided. For example, if you're using a help desk software, the reporting is actually just as important as the transaction itself that happens in the platform. A CRM is great, but understanding which customers are most likely to convert based on specific triggers based on email context and responses, one is worth far more than the other.\n\nI would pay for the insight into the context of emails easily, I wouldn't pay more just for the basics, so if the value is on the other side, you can take over a market with a baseline product at cut rate prices then align the revenue to the enhanced feature that is only possible because of the more sizable data set.\n\nIn a lot of situations businesses simply don't have the data they need to understand what's going on with their customers and the customer's journey.\n\nLet me know if this helps.",
                    "score": 1,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. That does make more sense. I don't think I fully understand everything that's being said in the guide but I'm starting to understand more than I did.",
                            "score": 1,
                            "author": "DTheDeveloper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's a lot to digest, I know. If you have questions just ask, that's the point of these posts :)",
                                    "score": 1,
                                    "author": "lickitysplitstyle"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank for sharing",
            "score": 1,
            "author": "richptran"
        },
        {
            "level": 0,
            "comment": "Really great article! \n\nHowever need to go to the next pages to learn more.",
            "score": 1,
            "author": "lextrukhin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you know Reddit has a limit on post length. Will put this in a better format on a website soon. 🙂",
                    "score": 3,
                    "author": "lickitysplitstyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh really? That makes sense then to split it :) Nice idea for content marketing by the way!",
                            "score": 2,
                            "author": "lextrukhin"
                        }
                    ]
                }
            ]
        }
    ]
}