{
    "id": "liicid",
    "score": 546,
    "title": "Remote work was destroying my team. This is what we've done.",
    "author": "andrebotelho",
    "date": 1613157247.0,
    "url": "https://www.reddit.com/r/startups/comments/liicid",
    "media_urls": [],
    "other_urls": [],
    "postText": "Like many of you, my company has decided to go fully remote during the peak of c0vid. This was a company-wide decision where everyone weighed in the pros and cons.  \nAt first, I actually celebrated this move (I've always been a bit of a homebody) even though as the CEO, I was slightly concerned about overall team performance.  \n(Some might remember my post about this).\n\nWell, 3 months after making the transition to remote work I can confirm that team performance was indeed affected.  \nPersonally, I found myself feeling increasingly lethargic, with no motivation, depressed even - all the typical burnout effects. My teammates also reported similar feelings - my sales team being the most affected by this transition.\n\n**We had no option but to make this issue a company-wide priority that had to be dealt with immediately.**\n\nGoing into this, we supplemented the move to remote with all the go-to team/company productivity sop's, guidelines, and tools you'd expect (slack, etc.) but we completely ignored personal-level ones. The integration of the latter is what made a world of difference.\n\nAfter surveying our staff (20 people strong) we decided to create our own internal \"hierarchy of needs\". **Sleep, movement, nutrition, and time-off-screen** became essential metrics (actual rules to live by) for everyone.  \nUnder those guidelines, we were quick to find and test an array of solutions to ensure personal accountability, ultimately, so that everyone was on the same boat.\n\n&amp;#x200B;\n\n**Our self-care/personal productivity stack:**\n\n**Rescue time** (rescuetime.com)\n\n\\- I’ve used Rescue Time on-and-off over the last couple of years but didn’t get to fully dive in until recently. Getting granular visibility on how you’re spending time in front of a screen has been extremely helpful.\n\n**HeadSpace** (headspace.com)\n\n\\- I'm not one to rave about the benefits of hardcore meditation but the stress relief benefits of a daily session are too many to ignore. Plus, the team responded well to the gamification component of the headspace platform.\n\n**Rise Science** (risescience.com)\n\n\\- Sleep is everything! We found that optimizing sleep was the biggest catalyst in mitigating employee burnout/personal churn. Such a simple concept to grasp, yet very hard to implement consistently. Two important concepts Rise brought to the table: 1)Sleep Debt 2) Circadian peak optimization.\n\n**Oura Ring** (ouraring.com)\n\n\\- Initially, I was a bit skeptical but we decided to incorporate Oura into our stack (biggest investment we made, but well worth it). The spectrum of data insights it offers is pretty bananas.\n\n\\---\n\nIts been approx 2 months since we integrated a company-wide personal productivity/self-care policy and the results have been great. Everyone is having fun.\n\nIncorporating a feedback loop at a personal level has shown how closely work bleeds into one's personal life. **This can wreak havoc on mental health** if your company doesn't take the right measures to prevent it.\n\nAfter going through this transition into remote work, I believe that more companies should give their employees remote-specific care packages and adopt wellness-first policies over strictly performance-based ones.\n\n**I would love to hear your feedback and recommendations on this one!**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPS. I have no affiliation with these companies.  \nPPS. Obviously, our employees did not pay for these out of their own pockets.",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah I have no interest in reporting my nutrition, fitness, and sleeping habits to my employer.\n\nI think they are very important, and having initiatives to help and encourage employees is great, but as soon as it becomes a metric and mandatory... I'm outta there.",
            "score": 79,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. While reading this I was thinking \"I hope all this crap is optional\" because I would honestly start looking elsewhere otherwise. You can see my productivity in other ways",
                    "score": 25,
                    "author": "the_ju66ernaut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate to say it, but this post has opened my eyes to the very real possibility that this kind of policy is the future of work.  \n\nIt will always be optional, just like company social events and the gym used to be - but the implication being, failure to go along with it puts people at disadvantage relative to their peers.",
                            "score": 13,
                            "author": "Ogg149",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is a great youtuber who exposes this. I can see a company having its own unique work culture. Then there is corporate cringe. [https://www.youtube.com/watch?v=WHnJT-usJOw](https://www.youtube.com/watch?v=WHnJT-usJOw)\n\nA lot of owners/managers have egos the size of countries, and it shows through the work culture promoted. I mean I know I'm hot shit, but goddamn, my employees don't need to be thinking of my wants/needs 24/7.",
                                    "score": 2,
                                    "author": "israellopez"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agreed. I think this stuff is a bit overkill and possibly invasive. Maybe if the work culture has spiralled that badly then you might need them to ween the team into something more healthy, I don't know, but it seems like lighter handed interventions like saying \"get off your computer outside of work hours\" is probably better and less *weird*.\n\nOn my team we all just have a bit of a ritual of saying \"bye, have a good evening\" or something to that effect on slack to let team members know we're done for the day. It's simple but I think it has some good effects like setting boundaries for team mates (don't bug me) and setting boundaries for yourself (why work longer than you're giving yourself credit for?). The only thing to watch out for there is that it doesn't turn into a spiralling mess of people trying to be seen as working longer like in office presenteeism.",
                            "score": 2,
                            "author": "CaptainBland"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is almost on par with \"mandatory fun\"",
                    "score": 1,
                    "author": "Particular_Bobcat"
                },
                {
                    "level": 1,
                    "comment": "This was a collective decision amongst peers. Not one was mandated and you can opt out. The data isn't shared with management. The only peer to peer data sharing happens though in app gamification.",
                    "score": -6,
                    "author": "andrebotelho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a nice post and am glad what you’re doing is working, but I would like to offer a bit of a different viewpoint on this.  Apologies if it comes across as harsh.  I have managed remote teams and in-person teams ranging from 5 to hundreds of people so please know this comes with the best intentions: \n\nIt sounds like what was really going on here is that your employees were having difficulty setting work boundaries, and this is very common when companies go from in-office to remote (ie, there’s a clear separation of mental concerns when you go work at an office vs at home).  Working from home is not for everyone - to maintain a healthy balance you need to be both extremely disciplined as a company and as a person with your time, or else you run into what you were describing.  Anyways, from my experience having to resort to such drastic measures like you’ve done is usually a sign theres something cultural within the company that was effecting everyone’s ability to set boundaries.  \n\nSome rhetorical questions for you:  Do you have managers sending people emails/slacks at all times of day?  Are people expected to answer emails/slacks at all hours?  If not, has this been explicitly mentioned to them?  Do you encourage your employees to shut off their work computers / work phones after 5 (or whatever their hours are, unless they deliberately want to work)? Do you have expectations that they should be working “all the time” because as the owner of the company you likely are (see my first point in this paragraph on this).  These are the things that ultimately need to be implemented or changed to really create a healthy work from home environment.  \n\nAgain, I like what you’ve done here to try and fix the remote work issues and am glad it’s working, but it drives me absolutely nuts when companies try and infringe on people’s personal lives outside of work or set unrealistic expectations for their team (not saying this is you, but it’s common in the cases like what you’ve described).  \n\nAs an employer for all these people, I believe it’s your job to set them up for success in both their job but also make sure that work time doesn’t infringe on the other areas of their lives by setting clear boundaries and expectations.  If you can master that you’ll have built your remote system to last.  \n\nNote:  work boundaries are notoriously difficult to set for outside sales teams since they are likely working from their phones.  This is where expectations of when/how to answer emails, texts, slacks, etc is so crucial.  \n\nI hope this was somewhat helpful, and keep up the good work.  I especially like what you’ve done to take initiative to help people with their mental health.",
            "score": 185,
            "author": "Lazy-Contribution-50",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is an incredibly valid response. I work for a large company (100,000+ employees) and while they offer a lot of similar services/tools for stress release, mental health, etc, I actually don’t really use them as I prefer to treat myself for those concerns in my own, personal ways.\n\nThe reason I’m able to do that is because of my manager’s respect for boundaries, including: \n\n1. A suggested but not enforced “9-5” screen time policy. \n\n2. A “no questions ask” approached to putting unlabeled breaks/appointments onto my calendar during business hours, during which I shouldn’t be called or scheduled for meetings.\n\n3. An encouragement to use free office-hours time when work is slow for fulfilling and contributive learning and passion-projects (for the company).\n\n4. Gratitude for each and every instance of “overtime” (working outside normal hours). If a project has a tight deadline or we’re dealing with timezone differences, it is always verbally communicated that our efforts are EXTRA and not mandatory, and that because of those efforts, we get the lovely benefits of the “no questions asked” breaks and the such.\n\n\nThis approach has been tried in both very busy months and very slow ones, and it has worked for me for both. I’m not at all implying that your company isn’t doing these things, but rather that boundaries are just as important as tech tools/benefits in regards to the wellness of employees.",
                    "score": 81,
                    "author": "able2sv"
                },
                {
                    "level": 1,
                    "comment": "I burned out so hard in 2020 I had to take a full month off for mental health. I was spending entire days in back-to-back meetings with no opportunity to take a break. During that month, I made a few changes that have completely changed my work from home experience:  \n1) Block time on your calendar for breaks and lunch. Force yourself outside at least twice a day, even if for a short walk.  \n2) Buy an adjustable/standing desk. I rotate between sitting and standing every hour.  \n3) Buy a Peloton. If you aren't good at getting yourself moving, you can do 10 minute workouts to keep your body and mind in good shape.\n\nI'm excited by the remote work revolution, but also growing more skeptical. I wonder how many employees will be eager to go back after \\~2 years at home, and how many companies will pull back their remote work policies as they see employees struggling. At the very least, these companies need to use the money they're saving on real estate to help their employees set up healthy workspaces in their homes.",
                    "score": 25,
                    "author": "i64d",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If other people have access to your calendar, then you should 100% book lunch and break times.\n\nEven just booking time for uninterrupted work is a good idea.",
                            "score": 3,
                            "author": "Franks2000inchTV"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow. Ty so much for this. You're absolutely on it. Being a relatively young/small company    I have to admit that we were ill-equipped to deal with some of the pressures presented by working in a fully remote environment. (as well as under covid circumstances).  \nFor better or worse, this is a decision we took as a team. Going in, we collectively delineated a set of guidelines in regards to \"fundamentals\" to ensure people were respecting each other's schedules as we knew that could be an issue (as you very well highlighted). However, that just wasn't enough, as we soon found out.   \n\n\nIn addition, I'm blessed to work with absolute warriors that, very much like myself, have issues with setting up hard boundaries between work and their personal lives (\"*I can always squeeze in another call, another email, etc\".*) This is where we had to make the biggest cultural change -Looking back at it, \"gamifying\" this cultural pivot with wellness tools it's what really made it stick.  \n\n\nUltimately, changing to a wellness/health first approach really gave us the perspective necessary to make the right adjustments. It's still very much a work in progress though but we're fully committed :)",
                    "score": 20,
                    "author": "andrebotelho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a casual observer, I wonder if the point u/Lazy-Contribution-50 was trying to make was that the issue with your employees _may_ have been due to an inability to set hard boundaries between work and their personal lives, and that _maybe_, adding an additional layer of company-sponsored self-care gamification would exacerbate this issue by further bluring the lines between your employee's personal lives and work.",
                            "score": 36,
                            "author": "Ogg149",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah this is exactly right.  I applaud the OP for recognizing how important mental health is and taking some actions to help it in the workplace, but it seems like the issue of boundaries isn’t quite solved yet and is mixing a lot of personal with work.   \n\nEDIT:  instead of gamyfing these things and expecting people to use these tools and report on them together, I’d recommend just offering to pay for these kinds of things instead.  Now you’re separating work from personal and really supporting them.  Ie, don’t schedule a yoga class every day for your team to go to together - offer to let them expense a gym membership.  Expense appointments with counsellors or social workers.  Offer a budget to buy at-home fitness equipment.  Just don’t make them report on these things at work unless they bring up health issues with their managers. \n\nEven using words like “warriors” and praising your employees who work extra hours has a profound effect on your company culture - essentially what that message is sending to everyone at your company is “if you want to get praise from me, you need to hussle and eat, sleep, and live this job.”  So now everyone in the team subconsciously thinks that to get noticed here they need to work overtime all the time.   No matter what you implement, boundaries you set, etc, as long as you praise people for working extra hours that’s going to be the case.  To promote the culture you’re looking for, you want to praise the kind of things like “man, this person crushed it with their role within their work boundaries”. \n\nNow, don’t get me wrong.  There are times when you need to hussle and get stuff done and it’ll take you outside the boundaries, but that’s got to be the exception and not the rule. \n\nAlso, although I’m obviously not a big fan of this, there are companies that deliberately have a company culture where you expect people to bust their ass all the time for the job, burn out, and then fire them and hire someone new after 2-3 years.  And you can achieve results that way for your business, but if that’s what you’re going for I wouldn’t delude yourself with ideas of helping people’s mental health.  Set the expectations that this job is all consuming and hard time-wise when they sign up, and if it’s not for them they shouldn’t join or stay.   This is a bit of an aside as it’s not what the OP is wanting to do, but wanted to note that this is also a way to conduct things.\n\nTLDR - doing a good job but I fear these wins are going to be short lived without addressing the rest of the issue.",
                                    "score": 23,
                                    "author": "Lazy-Contribution-50",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed. A good business is a good set of systems, and when employees are “warriors”, it’s usually because the systems in place are ineffective.",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This 100%",
                                                    "score": 1,
                                                    "author": "Lazy-Contribution-50"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The question is how you set boundaries in an environment where your employees have a lot of personal responsibility and self-organization. You can't have employees who self-organize and then set their boundaries.\n\nIt is a problem though if you set up such an environment but your employees are not fit to take that responsibility. In that case a stricter top-down approach might be necessary.",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah this comment is very true and makes a lot of sense.  This is why in my original comment I stressed that working from home is not for everyone, but obviously during covid you need to do the best you can.  There’s also a very very big difference between “work from home” and “work from home whatever hours you want”, and depending on what you’re going for the systems and type of people you need to hire/type of training you need to provide them is very different.  \n\nWithout knowing the nature of the OPs business it’s hard to make specific recommendations, but people on this post have already suggested some really good things like setting office hours, OKRs, rules around calendar meetings, not answering and sending emails/slacks/texts after certain times every day, etc.",
                                                    "score": 2,
                                                    "author": "Lazy-Contribution-50",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I recently started to implement OKRs in the Start-Up I work for. I am really interested how that turns out.",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know you have the best intentions, but you've likely made it *worse* for some employees by adding these competitive (read: extra work) wellness programs.\n\nedit: also, after reading RescueTime's features, PLEASE TELL ME you're not viewing your team's time. The fact that it even allows for that just makes this whole scenario 10x worse than it sounded already.",
                            "score": 2,
                            "author": "nevesis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "THIS",
                    "score": -1,
                    "author": "PietroMartello"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is the company getting the Oura Ring data? That seems kinda gross and invasive.",
            "score": 34,
            "author": "UkuCanuck"
        },
        {
            "level": 0,
            "comment": "From an employee perspective, my first impression is that this sounds like repeated personal invasion on a level of a surprise colonoscopy. Especially if these processes were (a) mandatory, (b) run under corporate systems or a corporate login, and (c) the company had any kind of access to that data.\n\nI can understand perhaps *recommending* them or similar things to employees, and encouraging discussion about such aspects, but *implementing* them, or having any kind of corporate control or input into provision or administration of them, is a huge red flag.",
            "score": 9,
            "author": "Geminii27"
        },
        {
            "level": 0,
            "comment": "I started writing a reply that was a bit snarky and I deleted it. But have you considered that you might have ADHD? All of this effort is basically around you keeping a productive routine. Most of this applies in my opinion to non-remote work anyway.\n\nI have ADHD, and 2020 made me really focus on getting help.\n\nMy tools so far for surviving remote work + ADHD have been:\n\n1. Redefining my approach to working (harder than you think)\n2. Proper planning/notes, paper+pen.\n3. Walking at least 15 minutes everyday.\n4. Vitamins (regular everyday kind)\n5. Sleeping Pill that worked (this one helped the most than I expected)\n\nAnyone looking into this, if you have the money and desire go for these tools go for it. I will caution to anyone that THEY ARE NOT A PANACEA.  If you cant afford these things, you should not feel like living/working peacefully is out of reach. \n\nAs an employer I would never even consider suggesting my team do certain things for their mental health. I respect their autonomy/boundaries, and honestly if they wanted to ask they can ask. \n\nI'm just surprised you bought this for you team. That is what strikes me as paternalistic about your relationship with your employees. I guess why not start subscribing to a vitamin brand and send them monthly deliveries. Maybe send them special alkaline water too. Mail them some new copper infused underwear.  Now I got snarky. I apologize. But hey that's the internet.\n\nHonestly, what everyone needs in every business is fucking boundaries. If everyone defended their personal boundaries against the pressure of business it would help everyone up and down stream.\n\n2020 kicked my ass even though my company was already 100% remote. Remote work didn't do this to us, stress/pressure/change broke us, and that can come in any form.\n\nI saw this and I just couldnt help myself from replying. I blame my ADHD.\n\nGood Luck.",
            "score": 21,
            "author": "israellopez",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Sleeping pill that worked\" - yep.  I'd say that single thing has been a greater benefit to my mental and physical health than all of the other crap I've sunk time and money into... except exercise and meditation.",
                    "score": 3,
                    "author": "Ogg149"
                },
                {
                    "level": 1,
                    "comment": "&gt;Redefining my approach to working (harder than you think)\n\nHow did that look like and what is your result?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think its a mix of decisions and reflection. It started when I really couldnt deal with everything anymore.  When they say its lonely at the top, it really is.  There is a lot of different things that happened to get me to refocus.\n\n1) Reflection. I honestly had to just fucking stop for a bit and go \"what am I doing with my life?!\".  I was spending a lot of energy answering really-small questions (email/phone/task) level issues, and avoiding answering the big ones (life, family, retirement, goals etc,.). I just had to stop the bus for a bit and think for myself and review where we were at with my wife.\n\n2) Realignment. I knew I couldnt make a big change, i'd lose a lot of momentum if I just up and quit. So I decided to just make small changes towards what I wanted to do. If I didnt have a plan about family, we started to make a plan to plan. If that makes sense.\n\n3) Boundaries. There was a good book I listened to on vacation about Unfucking your Boundaries, in it I realized that I had really bad boundary setting habits and let the world influence me more than I thought I did. While I didn't just start pushing back immediately, I made a commitment to hold firm to what I wanted in my time/business/life.\n\n4) Buffers. I would schedule things hour-to-hour back-to-back, and that was exhausting, I thought that is what I should do. I started re-doing my weekly/daily schedule to basically avoid talking to anyone on schedule until 10AM.  Somedays it works, somedays I break the rule. But usually I need that ramp-up time before I start talking to people.  \n\n5) Early on I was a big proponent of Getting Things Done, and the act of planning/scheduling/actioning the next action of a task once I receive it. Kind of lost my way after 10 years of professional life. \n\n6) Employees are awesome. Not that I thought they weren't before, but my lizard brain saw them as sources of fires instead of agents of authority/autonomy.  It makes sense though, I'd give them an unclear goal/task, and they'd always come back asking for help/guidance when I had zero time to give it. This wasnt easy, but I made a key hire to help with day-to-day operations, and I impressed upon them the importance of understanding tasks/directions and giving them the authority to get it done. Plus with enough of them around they start to collaborate on their own and generate their own solutions before you even need to get involved. There is a lot of culture building here that is necessary to do it, hopefully I did right.\n\n7) Financial Modeling. Excel, CashFlow Forecasting, Profit First. Figure out \"how much is this worth the energy/risk\" ... figure out what you want for working 52 weeks a year. $X salary plus $X net profit. I'm not exactly where I want to be, but I can see a path to get there. \n\nAs for the result. I'm feeling a lot more in control. I feel like I was back in June of 2019 (in the before times). I can sleep. I can work without anxiety. I can celebrate my successes. That is a win for me.",
                            "score": 2,
                            "author": "israellopez"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are all your employees using all of these platforms and services? Are you requiring it of everyone? If you required it or “strongly suggested it,” was there any resistance?\n\nI would not want to use a service to monitor and track sleep or to have something like Oura Ring monitor my biometrics and collect data, especially for my employer to use.\n\nReally your program seems a little creepy.\n\nI’m all for flexible hours and letting people optimize schedules to fit their personal sleep cycles and effective work hours, but most people can tell you what those are without massive data harvesting. \n\n\n&gt;After going through this transition into remote work, I believe that more companies should give their employees remote-specific care packages and adopt wellness-first policies over strictly performance-based ones.\n\n\nThis isn’t wellness, gamified meditation isn’t wellness, it’s performance metrics by another name. You still have people looking to meet performance goals, just on a different platform.\n\nOffices should stay closed for good, people should have flexible work arrangements. But if you want wellness to be a part of that then you need to give people more autonomy, not less. A ring to track biometrics is not more autonomy. Competing to meditate is not autonomy. Everything I see in this post is less autonomy for everyone at the company.",
            "score": 6,
            "author": "NYSenseOfHumor"
        },
        {
            "level": 0,
            "comment": "Honestly it doesn’t sound helpful, it sounds like paternalism and explaining to people why they’re burned out, when the real reason is that you have a gang of “warriors” who you seem to think always want to work overtime. \n\nI fully expect in three months to see another post about attrition.",
            "score": 3,
            "author": "dCrumpets"
        },
        {
            "level": 0,
            "comment": "Any more specifics on the results? \n\nSince you are talking about the sales team, it sounds like there was a sales drop in addition to direct complaints/feedback about challenges performing.\n\nYou mention the results have been great and everyone is having fun, but are you measuring anything specific to say \"Ok, we've gotten this issue under control, and we're satisfied with the solution we have in place\"?",
            "score": 4,
            "author": "mtcoleman9"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely agree. We try to increase personal accountability across the spectrum which removes the need for managers. Also, we replaced the word managers with facilitators as we believe the only role that managers should serve is to facilitate peak performance not control and stifle.",
                    "score": -2,
                    "author": "andrebotelho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People really have problems with this. Blows me away.\n\nI’ve been consulting for a few years and have worked remotely 100% of that time along with the last three full time roles I had. Like,\nIt’s the best thing in the world.\n\nI’m also part of not-messaging-when-you’re-late-to-the-call-I-probably-don’t-want-to-speak-with-you-anyways camp. \n\nThe touchy feely stuff is a huge turnoff to me.\nMental health surveys, fifteenFive malarkey, . I just rifle off 5,5,5,5,5,5, Nothing further. \n\nI’ve also noticed that when you mark a 3 or a 4 it spawns a conversation I don’t care to have. “What changed?” - just pay me and we’re good. If I’m unhappy I’ll leave.\n\nThe real hero here is the fact the folks who NEED these tools, got them.\n\nI’m struggling with the “we haven’t made a decision regarding 100% remote work, and won’t have one anytime soon” - like seriously? Companies pretending to care about their employees while literally forcing them to sacrifice higher quality of living for an employment opportunity regardless of the fact you can do your work remotely and have been doing it remotely without a problem. \n\nCome on in to the office, work behind masks for 8 hours and in plexiglass cubes because we built a terrible “open concept” office. Uuugh.",
            "score": 7,
            "author": "Missing_Space_Cadet"
        },
        {
            "level": 0,
            "comment": "Internal blog?",
            "score": 3,
            "author": "startup_a_by_b_guy"
        },
        {
            "level": 0,
            "comment": "Have had Oura ring for a couple years now, and even at the trends and suggestions level it's awesome! Lately though it just makes me sad, knowing exactly how much sleep my baby is stealing from me 😂",
            "score": 3,
            "author": "bradcroteau"
        },
        {
            "level": 0,
            "comment": "Actually, it isn't remote work which kills your team, it is the feeling of being cooped up. \n\nI have been working remote since 2012, yet I saw a dip in productivity from about 4th week of lockdown. \n\nNot questioning the post/tools you recommend, I don't know anything about them.",
            "score": 3,
            "author": "QuotheFan"
        },
        {
            "level": 0,
            "comment": "was looking for something like rise, I sleep like shit. Thanks!",
            "score": 5,
            "author": "relok123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a former insomniac. Learning about sleep debt from Rise completely changed my sleep game.",
                    "score": 2,
                    "author": "andrebotelho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love it.  As of now my company only sends out weekly emails telling us that our mental health is of the upmost importance, and then demands a 55-60 hour work week.",
            "score": 6,
            "author": "visionbreaksbricks",
            "replies": [
                {
                    "level": 1,
                    "comment": "No bueno :( Tell your CEO to read this post.",
                    "score": -3,
                    "author": "andrebotelho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, I’d never use all the tools hosted by an employer, the amount of invasive all this is insane.",
            "score": 2,
            "author": "abbh62"
        },
        {
            "level": 0,
            "comment": "To be honest, my remote team just uses [project management software](https://quire.io/compare/best-project-management-software-reviews-comparisons) and productivity tools to stay on track. \n\nWe use [Quire](https://quire.io/?utm_source=Reddit&amp;utm_medium=bcklinks&amp;utm_campaign=reddit_bcklinks) to manage our tasks and deadlines. \n\nSlack to communicate with each other. \n\nWe do have remote therapists always ready to help deal with the depression of remote work.",
            "score": 2,
            "author": "No_Boss2907"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing your journey. Trying to launch in the middle of the pandemic has had some interesting cultural impacts and I want to manage them better. I'll have to look through your resources and see if there's anything we can steal :)",
            "score": 2,
            "author": "Angretlam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty. Feel free to share some of your resources too.",
                    "score": 3,
                    "author": "andrebotelho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. Have to say, kudos to you for being a cool employer and at least trying &amp; implementing feedback systems. More than what the employers I've encountered across the South here do that's for sure.\n\nWhen we transitioned to remote, there was zero focus on our mental health. I mean, we were all heavy into the middle of going through the change so there's that. But I can definitely tell you during this period work and personal has overlapped! I think only an empathetic manager could understand what employees are going through during this time, especially the parents out there who didn't get a stimulus check, but ain't rich",
            "score": 2,
            "author": "armorm3"
        },
        {
            "level": 0,
            "comment": "Headspace is amazing! We do group sessions of mindfulness meditation in our company and it has definitely affected out work and office atmosphere positively.\n\nI invite you to try [STATEWIZE](https://statewize.com), it’s perfect for dev teams who work remotely!",
            "score": 2,
            "author": "STATEWIZE"
        },
        {
            "level": 0,
            "comment": "You bought oura rings for your team to make sure they are monitoring their sleep and stress??? Honestly I WISH I had a boss like you.\n\nLet me know if you're hiring!",
            "score": 2,
            "author": "Lexicon-Jester"
        },
        {
            "level": 0,
            "comment": "I have been working remotely for years now. I recognize the challenges of remote work. It's not a tools problem. It's a process problem. The pandemic has felt like one long day at work because: 1. no boundaries. 2. companies treat their employees as if they are at the office. \n\nMy biggest shock is that according to the digital workspace report 51% of employees reported getting messages unrelated to work per say( unplanned distractions) according to the digital workplace [report](https://www.igloosoftware.com/state-of-the-digital-workplace/). We put together [this toolkit](https://veamly.co/toolkit-download) for companies to help with the transition. It's free, no email required. Hope it helps!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Add talkspace — a professional therapist can do wonders",
            "score": 2,
            "author": "Kanqon"
        },
        {
            "level": 0,
            "comment": "Reminds me of this case study: [https://www.businessinsider.com/how-changing-one-habit-quintupled-alcoas-income-2014-4](https://www.businessinsider.com/how-changing-one-habit-quintupled-alcoas-income-2014-4)",
            "score": 3,
            "author": "karikit"
        },
        {
            "level": 0,
            "comment": "I manage a 40 member tech team and productivity and job satisfaction have gone up across the board.  The teams enjoy the flexibility for work/home balance. Reflecting upon it a bit, I think there a few things serving as the glue that keeps the band together.\n\n *OKR's for goal setting*\n\n *Heavy usage of video conferencing technologies with a must have \"camera on\" expectations*\n\n *Daily huddles that cover yesterdays work and the days work ahead*\n\n *Slack and MS Teams*\n\n *Agile framework utilizing two week sprints*\n\n *Virtual happy hours / team builders*\n\nI think working remote does affect some more than others but for the most part it is difficult for me to see us ever going back to 100% on site. One thing to note is that tech workers tend to be introverted so the remote lifestyle is probably bliss for some if not many.",
            "score": 1,
            "author": "flat6er",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heavy usage of video conferencing technologies with a must have \"camera on\" expectations\n\nDaily huddles that cover yesterdays work and the days work ahead\n\nManagement at my company tried this: everyone including me was ready to leave because of this micromanagement stuff (that's how most saw it). Guess it depends on the people. My team has been remote since forever but yes we are all tech guys. Management gave up and in the end the biggest proponent who tried to push this way of working left soon after.",
                    "score": 13,
                    "author": "terserterseness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, I've heard plenty of others say the same thing. I'm not sure why it works for us to be honest but I do think the teams worked closely from a collaboration perspective prior to the shift to remote. Plus added flexibility in other areas maybe balances it out?  I'm sure there is someone in the organization that hates it, no doubt there.",
                            "score": 0,
                            "author": "flat6er"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Forgot to mention, great post, BTW. Thanks for sharing!",
                    "score": 4,
                    "author": "flat6er",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ty. Glad you liked it. Really good pointers on your comment too.",
                            "score": 2,
                            "author": "andrebotelho"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a great point on adoption. Well stated.",
                            "score": 0,
                            "author": "flat6er"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "RemindMe! 29 hours",
            "score": 1,
            "author": "trytheCOLDchai",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will be messaging you in 1 day on [**2021-02-14 06:50:39 UTC**](http://www.wolframalpha.com/input/?i=2021-02-14%2006:50:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/startups/comments/liicid/remote_work_was_destroying_my_team_this_is_what/gn4ldud/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstartups%2Fcomments%2Fliicid%2Fremote_work_was_destroying_my_team_this_is_what%2Fgn4ldud%2F%5D%0A%0ARemindMe%21%202021-02-14%2006%3A50%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20liicid)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                    "score": 1,
                    "author": "RemindMeBot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's interesting, how would you solve the challenge of having some employees being digital nomads or living in different time zones?",
            "score": 1,
            "author": "garethjax"
        },
        {
            "level": 0,
            "comment": "Here's my team building experience: My startup was founded in the middle of COVID, so the entire team was put together 100% remotely. Surprisingly we haven't had much communication issues. I think that's because the team members had the right expectations when they joined. You may consider hiring a few new team members to help refresh your remote team culture.",
            "score": 1,
            "author": "KindlyBug6868"
        },
        {
            "level": 0,
            "comment": "u/andrebotelho Thanks for sharing! I'm curious to know if there were any push backs from your team when rolling tools such as Rescue time.",
            "score": 1,
            "author": "leejaew"
        },
        {
            "level": 0,
            "comment": "Interesting. Remote work in this new normal has made everyone explore the new possibilities of working.\n\nWhile companies were adamant to adapt to this new normal many have come forward and accepted this new reality.\n\nWhile some of the companies have scaled up their [HR activities](https://s.peoplehum.com/hy0ib) some have started using the best technology possible.\n\nWhere AI and data processing have emerged as a hero to help companies out chatbots are even a new trend that has been benefitting a lot of companies.\n\nWhereas managing teams, onboarding employees, and engaging with their employees still remain a major factor of concern for a lot of organizations.\n\nThis is where technology has emerged as a major help and people are embracing it to the fullest.\n\nLet us know in the comment below how is your WFH life going?",
            "score": 1,
            "author": "bush_sid"
        },
        {
            "level": 0,
            "comment": "Thanks for sharing your stack.\n\nI've been remote and worked for fully remote companies for the past 10 years. Two key factors I've found useful are Asynchronous communication and \"working out loud\". \n\nThis is a good article by the CEO of Process Street - https://www.process.st/remote-working/\n\nIn all transparency I used to work at Process Street. I don't anymore. But still think this is an insightful article.",
            "score": 1,
            "author": "amiller385"
        },
        {
            "level": 0,
            "comment": "Only 6 hours ago somebody posted that they’d built an app called Rise to help with sleep &amp; now this post is also promoting it? Seems fishy. \n\nThe post: https://www.reddit.com/r/SideProject/comments/lidv7z/rise_science_built_an_app_that_tells_you_how/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
            "score": 0,
            "author": "gytu8"
        },
        {
            "level": 0,
            "comment": "How good is Oura?",
            "score": 1,
            "author": "FlyPenFly"
        },
        {
            "level": 0,
            "comment": "cocktailsfromhome.com check it out",
            "score": 1,
            "author": "i_take_shits"
        },
        {
            "level": 0,
            "comment": "I am  waking up at 2:30 am everyday now 😭",
            "score": 0,
            "author": "the_ml_guy",
            "replies": [
                {
                    "level": 1,
                    "comment": "No! Why?",
                    "score": 0,
                    "author": "andrebotelho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was working on a project after my regular work hours and screwed up my sleep cycle. Now even after I have completed the project I still awake up in there middle of the night and can't sleep.",
                            "score": 1,
                            "author": "the_ml_guy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really commend you for this and hope more companies follow suit. \n\nSo many people in your position are throwing COVID precautions to the wind and simply saying “well this didn’t work so we better go back to the office.” You dug deeper to the actual core of the issues and gave your team the resources to continue staying safe and also mentally well. That shouldn’t be as groundbreaking as it is but unfortunately it’s still rare. \n\nI’m still just a 1 person small business myself but this honestly put a lot into perspective for myself and my “team of one” \n\nThanks for sharing. I sincerely hope this is the way companies big and small start going. It’s essential.",
            "score": -3,
            "author": "genderlessadventure",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty! Going into this there wasn't a lot of public info that really dived into the real intricacies of sustainable remote work. A lot of tools, gadgets, etc. but still very much \"uncharted waters\" in regards to the mental impact of it all. Most of what we learned has been from trial and error.",
                    "score": 2,
                    "author": "andrebotelho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re so right and I think that’s such a disservice to the entire working population as a whole because the majority of what you covered here isn’t exclusive to working from home, it’s likely magnified by it and all the chaos of this past year, but really companies should be willing to prioritize their teams well-being regardless.",
                            "score": 0,
                            "author": "genderlessadventure"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great insight, sharing this on hacker news.",
            "score": -1,
            "author": "terry_teamhq",
            "replies": [
                {
                    "level": 1,
                    "comment": "ty! glad you found the post useful",
                    "score": 0,
                    "author": "andrebotelho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "glad you  liked it!",
                    "score": 0,
                    "author": "andrebotelho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love this!",
            "score": -3,
            "author": "ChristoffLew",
            "replies": [
                {
                    "level": 1,
                    "comment": "ty!",
                    "score": 1,
                    "author": "andrebotelho"
                }
            ]
        }
    ]
}