{
    "id": "m2fzy3",
    "score": 417,
    "title": "A VC I pitched gave my idea to their portfolio company. And they copied it.",
    "author": "Shaftedbyavc123",
    "date": 1615430616.0,
    "url": "https://www.reddit.com/r/startups/comments/m2fzy3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I made this new reddit account to post this anonymously and I will leave out identifying details, but I want to share a story about what has happened to me, and I want to start a discussion around this, get advice, hear other stories. \n\nI am the founder of a pre revenue post product startup that is raising its seed round. We have been pitching VCs for a few months, and we recently gained traction, but it was hard going for a while. \n\nWe pitched this one VC, that is a prominent albeit not tier 1 VC. Sent a cold email, got a email with questions, then was asked to make a video pitch, then got an actual meeting with a partner, only to be told a week later that the market was too broad and they did not want to move forward. No biggie. \n\nBut one of their portfolio companies is an indirect competitor, and has already raised a few million a couple years ago but hasn’t really reached PMF or any kind of break out success. I was browsing linkedin one week after I was rejected by this VC to see a post about a new product by this company. To my utter shock, they had opened up a waitlist to beta test a product that was literally exactly what I pitched this VC. Even had multiple lines stolen right out of my deck. I am in utter disbelief and shock at the depravity of such an unethical move. One day, I will share the names, but that will not be today. \n\nNeedless to say, they don’t know everything we know, they nor do they have the technical progress we have, and our entire company is dedicated to this whereas this is just another product by them. I am not overly worried, but still, its not pleasant. We are moving forward regardless and will just have to work 3 times as hard. \n\nThoughts, advice?",
    "comments": [
        {
            "level": 0,
            "comment": "I’d add this to the market validation slide of your deck.",
            "score": 614,
            "author": "codefame",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a great idea. Investors are pack animals and it would likely generate a lot of interest to hear that another VC copied your product",
                    "score": 97,
                    "author": "Attim0de",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "make sure to name the VC in your deck",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And make it a meme",
                                    "score": 3,
                                    "author": "sparena17"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's the pro move right there.. It'll help you while pitching next time.. but OC should try not to give enough details to actually replicate the product.",
                    "score": 131,
                    "author": "Hersheeyyzz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "??? Depending on what you’re building I’d say extremely unlikely that this is possible. You cannot have a productive conversation without explaining what problem you’re trying to solve which might be more than enough info to do something unethical with",
                            "score": 3,
                            "author": "SwaggyDaggy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&lt;3 this",
                    "score": 36,
                    "author": "Paddy-Makk"
                },
                {
                    "level": 1,
                    "comment": "Seconded. Had a similar experience in a residential real estate startup, we pitched and some of our (patented) ideas were stolen.\n\nWe had a year lead on building the product, had a couple of investors, and were able to defend our product at the same time as we could sell with \"Oh, and \\[household name brand\\] will be introducing this sometime in the future. You can have it now, for cheaper, ready to go. Try a month free on us.\"\n\nAlso... business.. ethical.. *right*. This is your only wake up call.\n\nEdit: I exited the company but checked on the competitor. Two years later, no implementation of the features. I guess we had it right from the beginning.",
                    "score": 16,
                    "author": "precisionjason",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;: I exited the company but checked on the competitor. Two years later, no implementation of the features. I guess we had it right from the beginning.\n\nWhat do you mean, you had it right from the beginning as the competitor didn't implement the features?  Thanks for clarifying.  Also what did you learn from the experience and what would you do different next time if  in the same situation?",
                            "score": 1,
                            "author": "notyethavinganimpact"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who’s had pieces of my deck taken too - don’t worry about it. A startup is as good as its last idea, not its first. You will need to throw out old ideas and rebuild them throughout the journey of your business. And guess what? A thief can’t do that. So if they’re relying on a one time boost from you, they’re gonna go nowhere anyway.",
            "score": 111,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know his idea, or if it could work for him, but here's what I do.  I have some IP and internal presentations I give.  I don't live in a cutting-edge world, so my advantage is knowing how to get a customer where he wants to go.  But I do have things in my pitches that are technically wrong.  Little things that in a casual conversation wouldn't be noticed.  I've only ever had one guy actually ask \"Hey why does that part go there, how does it work?\" and it started a whole other deeper technical discussion.  I'll even use it as a segway into a conversation, \"Can anyone tell me what's wrong here?\"  That way if someone asks for my presentation, I give them that version.  They only get the correct one, in person.",
                    "score": 11,
                    "author": "UEMcGill"
                },
                {
                    "level": 1,
                    "comment": "Couldn't upvote this more enough. I have had it happen to me as well, in many cases the competitive firm was likely working on it already and your pitch probably gave them the heave-ho over the line. As the saying goes *imitation is the sincerest form of flattery*, ergo you might be onto something.  \n\nIt's unethical and painful, but you have your innovation on your side and execute ruthlessly. Ideas are mere snapshots, execution is dynamic and everchanging.",
                    "score": 3,
                    "author": "bluzkluz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Name and shame the VC.  At least for the benefit of other startups that might pitch to them.",
            "score": 106,
            "author": "UnistrutNut",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. The unwritten law in Venture is that they don’t sign NDAs and they don’t talk. If someone has talked then they need to be outed.",
                    "score": 83,
                    "author": "wanderingisnotlost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\" Don't talk about it\" that's bs though. VCs are like recruitment agencies. If there is one thing they do it's talk about other people's ideas. They hunt and fish ideas to copy all the time!",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope. If every VC took the ideas it was pitched and decided to start an operating company with those idea, nobody would come to them. There’s a trade. You come with an idea, a product, and ideally some market traction, and they place a bet. I’m not so naive as to believe that the sort of behavior the OP experienced never happens., But when it’s a blatant as the OPs experience, they literally used language from the pitch in the beta marketing, that has to be called. I think a nice whisper campaign among startups is the appropriate way to get the word out.",
                                    "score": 13,
                                    "author": "wanderingisnotlost",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dude you have no idea or just a VC shill like many who lurk here. I can post hundreds of links about VC cut throat double dealing tactics.",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'd love to see the links if you could post them.",
                                                    "score": 1,
                                                    "author": "JG98"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This right here. Who is the VC? If one does not play by the rule we need to know.",
                    "score": 16,
                    "author": "LostAstronaut2k"
                },
                {
                    "level": 1,
                    "comment": "Agree. Rogue VCs -  startups should blacklist them",
                    "score": 16,
                    "author": "Exact-Mushroom-9028"
                },
                {
                    "level": 1,
                    "comment": "No need they ALL do this. And you better believe it!!",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they didn't, then they wouldn't be so adamant about not signing NDAs.",
                            "score": 13,
                            "author": "ghjm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We're talking about a non-disclosure, not a non-compete.  It doesn't limit anyone from doing anything, except disclosing the specific information that was given to them.",
                                            "score": 5,
                                            "author": "ghjm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Non-disclosure agreements typically have clauses that say if you receive the same information from a different source, it is not covered.  So there's only a problem if you are the _only_ person to give a VC an important piece of data.  And that's exactly the circumstance where they really shouldn't just be handing it off to their portfolio companies.",
                                                            "score": 7,
                                                            "author": "ghjm",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's a lot easier to just not have an NDA than to constantly be tracking the information you get to be able to successfully defend yourself from a lawsuit for violating an NDA. You can be sued at anytime and it isn't free to defend yourself regardless of how frivolous it is. There's so many ideas floating around constantly that it's very easy for a founder to think their idea has been stolen when really 10 other people have the same idea already. That's the other reason people always say that ideas are worthless and execution is what matters.",
                                                                    "score": 6,
                                                                    "author": "schfourteen-teen",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So I take it you agree with me that\n\n&gt; it could limit their ability to invest in other companies\n\nis incorrect, since you are now giving several other reasons why VCs might not want to sign NDAs.",
                                                                            "score": 0,
                                                                            "author": "ghjm"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They may not sign NDA’s but they need to be outed as violators of the code. It’s clear they are stealing ideas.",
                    "score": 41,
                    "author": "Daytonaman675"
                },
                {
                    "level": 1,
                    "comment": "This 100%.\n\nMake a new post as well as an update.",
                    "score": 7,
                    "author": "StartupTim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No. Do not do that.",
                            "score": -6,
                            "author": "GaryARefuge"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's not telling who because that's also part of the code.  Snitches get stitches.  Snitch on them and no VCs will ever talk to you again.  Sucks.",
                    "score": 1,
                    "author": "wellman_va"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ignore and don’t be distracted. Focus on your product + market + customer satisfaction. Looking back, there have been quite a few cycles I’ve wasted for myself / my team by thinking about this. Completely pointless when instead - we put our head down, focusing on our execution and won out in the market.",
            "score": 250,
            "author": "IBuildAndInvest",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 43,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Ideas can be stolen but not the execution\n\ncan you please expand on this or give an example?  thanks.",
                            "score": 3,
                            "author": "notyethavinganimpact",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what about the idea of how it might be executed?   I guess that is not the same as the actual execution of the idea?  I'm asking this because I'm trying to get a sense for myself, and hopefully it will help others, to know what level of information we should give to potential investors/partners to even have them consider working together (i.e. peak their interest versus when we have gone too far, even if they are ideas and ideas about how it shall be executed?",
                                    "score": 1,
                                    "author": "notyethavinganimpact"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. They might be bigger than you, but they have a whole company to take care, and that idea is just a detail for them. But for you, it's almost your life! It's natural your products is better than theirs.\n\nBut you could rethink your sales strategy. Put yourself on their shoes and think: \"Why did they copy me instead of acquiring my product / service?\". And make changes from there. \n\n- Your price is too expensive. (rethink your pricing plans, not only how much to charge, but HOW to charge).\n- You are too cheap to copy. (try to raise a competitive advantage).\n- They can't outsource such a strategic pillar. It could make them your hostage on long-term. (rethink how to build a mutual constructive relationship). \n- The project will perform better when fully integrated on their environment. (Rethink your core business)\n- Your idea is really, really awesome. And they just want to be your direct competitor. (Than you should bet even higher on your own project!)",
                    "score": 27,
                    "author": "Andre_NG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "New startup idea: create a site that lets startups anonymously rate VC’s.",
            "score": 60,
            "author": "nuttreo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like glassdoor. Cool idea",
                    "score": 9,
                    "author": "Aranthos-Faroth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wanted to do it after a few hundred meetings and realizing how many terrible VC’s there are out there.",
                            "score": 10,
                            "author": "nuttreo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 15,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interest, imitation, and competition prove there is a market. They might try to copy you but they are only getting a particular ‘coordinate’ vs. you having a vector. By the time a competitor/impersonator gets to your operational standpoint, you’ll be further along in development. By then they’ve got to choose between the 3 B’s—Build, Beat, or Buy. \n\nIf they’re just starting development, they’ve got to build you. \n\nIf they are are just as far along, then they’ve got to beat you. \n\nIf they see that they’re devoting too much attention in a specific field that you have a competitive advantage, they’ve got to buy you. \n\nThis might be an opportunity instead of an obstacle.",
            "score": 139,
            "author": "Mjb0112358",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is really motivating to read!",
                    "score": 10,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Just checking whether the \" getting a particular ‘coordinate’ vs. you having a vector.\" is original or taken from somewhere?  Would be good to know before I steal it myself :)",
                    "score": 7,
                    "author": "Paddy-Makk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You heard it straight from the og source :)",
                            "score": 5,
                            "author": "Mjb0112358"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "this guy builds, beats, buys and fucks",
                    "score": 7,
                    "author": "dreadpiraterobertsdd"
                },
                {
                    "level": 1,
                    "comment": "hey, I like you and the just-right words you strung together.",
                    "score": 11,
                    "author": "mmishu"
                },
                {
                    "level": 1,
                    "comment": "I love this so much, thank you!",
                    "score": 1,
                    "author": "lowfour"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The default route is to just keep your head down and keep working at what you’re doing. That doesn’t really have an upside though, and if you’re pre-seed you can probably afford to roll the dove a bit since you don’t have as much to lose reputation-wise.\n\nI wouldn’t advocate for naming and shaming. Any reasonable VC is meeting with a ton of companies in the same space and would be scared off of engaging with you in case something similar but unintentional happens and they get accused of brainrape. \n\nIn an ideal world people who do this would get blasted publicly, but what’s good for the community is not always good for the founder. We had a horrible VC in our seed round who threatened to blow up an acquisition if he didn’t get far more than what he was due. I would love to publicly shame him and his behavior by telling our story, but there just isn’t an upside for me to do that.\n\nWhat you might consider is posting a well documented version of the story with the names removed on Twitter/Medium. That way you might at least get some VC/Tech Community attention for your company out of it. If you appear to still be protecting the VC’s identity, you might be able to avoid scaring VC’s off and get some attention from the ones who would be interested in helping.\n\nThe lowest risk route though, is to just do nothing.",
            "score": 24,
            "author": "I_am_become_pizza",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting take by going public but with still withholding names. I will probably do nothing for now. But once we close our A, no reason not to call them out.",
                    "score": 9,
                    "author": "Shaftedbyavc123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Before calling them out, have you first called them?\n\nBecause if not, I’d echo the sentiment of the other comments - see it as validation, and keep working on your idea.\n\nOr if you want to know, call them. But call assuming the best, not the worst.  Yes, they may have taken your idea. But there’s a decent chance they already had a similar idea, and you were their market confirmation.\n\nI say this, because I’ve been there. When my suspicions were right - they took my idea - my anger didn’t serve me, it was an eroding distraction. When I accepted that this WILL happen in life at some point - probably multiple times - I realized if I kept my cool, assumed the best, and kept my emotions rooted in love with an open mind... Not only did I keep my bridges, but attracted others who admired my integrity. It literally won me allies that wouldn’t have been revealed otherwise. And in a few cases that original enemy ended up an ally as well.\n\nIt’s all part of the game. Best of luck to you.\n\n\n\nYes, it sounds like they took the idea.",
                            "score": 10,
                            "author": "trysushi"
                        },
                        {
                            "level": 2,
                            "comment": "By going public you are also highlighting that at least one VC took a careful look at your pitch, and despite liking your idea a lot, they passed. Going public reinforec the perception that there's something wrong with your team. I would wait until after you have secured funding, because at that point the successful round \"proves\" there was nothing wrong with you.",
                            "score": 6,
                            "author": "navlelo_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They didn’t really pass though. They stole it for themselves. Going public reinforces that there’s something wrong with THEM, not OP.",
                                    "score": 4,
                                    "author": "lojistechs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't take the passive route. That's weak and shows poor leadership. If I was a VC ( ethical one I will support you) the only ones who will have a problems are the unethical POS ones.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm curious, what was your VC asking beyond what he was due post-acquisition? I mean, on what legal ground was he doing this? I know they may be able to block an acquisition, but what was he looking for? Did you have other VCs in the seed round? Weren't they pissed about it? This has to be the kind of behavior that gets known pretty quickly.  Can you share what you ended up doing?",
                    "score": 1,
                    "author": "LostAstronaut2k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its a technical product, so part of diligence was a deep dive on the tech. I got to a 3rd meeting with them, and this was before we had any other investors in the round. We have now secured part of our seed, but need to keep raising. I won’t be doing anything, and I won’t call them out. Everyone here is correct, success is the best revenge.",
                            "score": 1,
                            "author": "Shaftedbyavc123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If there is true PMF I wouldn't expect to be the only product out there, but it is bizarre if they have lines stolen from your deck.",
            "score": 22,
            "author": "duhhobo"
        },
        {
            "level": 0,
            "comment": "They contacted you back because you sound exactly like one of the projects they were doing in one of their investments. It was a curious coincidence. The lines sound the same because in a niche field, all the shit sounds almost exactly alike. Looks at the Pfizer and Moderna vaccine, inevitable conclusions to basic research done by other entities.\n\n99% chance that you have nothing special, it's like inventing fire or the wheel or an alphabet, its bound to happen and everyone moves in the same direction.",
            "score": 20,
            "author": "FlyPenFly",
            "replies": [
                {
                    "level": 1,
                    "comment": "This.\n\nIf you saw this publicly 1 week after your pitch, guaranteed this company had pitched their idea months before you did. They didn't steal it from you, the both of you came up with similar ideas roughly at the same time; and likely they did it first.\n\nYour VC saw the similarities so thought he would check you out.",
                    "score": 5,
                    "author": "CC0CCO",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP said that the competitor (which had already been funded with a different but related product) set up a waitlist signup page.\n\nThat doesn't require months. It's the kind of thing that can be floated, approved, and executed inside of a day.\n\nI certainly don't know what happened, but nor can you \"guarantee\" anything.",
                            "score": 3,
                            "author": "hey_look_its_shiny"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Instagram and Twitter copied features from SnapChat\n\nLivingSocial and Groupon are essentially identical\n\n&amp;#x200B;\n\nthere are many examples of identical businesses that thrive...if the TAM size is big enough, it won't matter...there are billions of people on planet earth with internet access.",
            "score": 44,
            "author": "Western-Cartoonist-1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did a group senior design project for a novel streaming music service. Within 2 years about 50% of the idea had been implemented in whole or part by a major music service. Within 5 years about 80%. None of us ended up working in the industry. No one we know did either.\n\nOther smart designers just worked with the same materials, observed the market, and organically arrived at the same conclusions. It was actually pretty exciting to be validated like that.",
                    "score": 5,
                    "author": "trysushi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a VC. I invested in an early-stage company (EarlyCo). Some months later a much later-stage (LateCo) company in our portfolio (not my deal -- another one of my partners is on the BOD) in a tangential market launched a product very similar to what EarlyCo was trying to bring to market. LateCo even used a lot of the same marketing language that EarlyCo used on their website. \n\nI never shared EarlyCo's deck with LateCo. I *did* call LateCo while doing diligence on EarlyCo to ask them about the market and ecosystem. I asked EarlyCo's permission to do this. I pointed LateCo at EarlyCo's website but did not share any non-public information. \n\nEarlyCo was furious. Accused me of sharing their materials. When I assured them I hadn't they suggested my partner on LateCo's BOD had pulled their deck out of our CRM and sent it to them. I can't be 100% sure he didn't, but he said he didn't and believe him. EarlyCo stopped inviting me to BOD meetings (I have the right to be there, but am not exactly going to send lawyers after them for a calendar invite). Now EarlyCo is running out of money and asking if I'll participate in a bridge. Obviously not, after that behavior. \n\nIn the end, I don't see anything that LateCo did that they couldn't have learned from EarlyCo's website. We're minority investors, not owner-operators.",
            "score": 5,
            "author": "emgeehammer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn’t that a conflict of interest to invest in same/similar product companies?",
                    "score": 1,
                    "author": "msjuv"
                },
                {
                    "level": 1,
                    "comment": "I applaud you guys for trying your best to be transparent and maintain trust. Our situation was very different; they hyped us up, did a few meetings, went for a deep dive, then backed out. Their portfolio company was founded and built one completely different product, but within a week spun up this new project that was dead on what we were doing. It was no coincidence. Good on you guys for being better, it will lead to your success in the long run.",
                    "score": 1,
                    "author": "Shaftedbyavc123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know I’m late to this thread but hope the op sees this.\n\nUnfortunately multiple startups I am advising have had this exact thing happen to them recently. Apparently VCs have decided the pandemic and remote pitches give them even more opportunity to be unethical assholes. Granted this use to happen before the lockdowns, but it’s definitely accelerated in recent months.\n\nUltimately this is kind of your fault, hear me out.\n\nWhy are these features in your deck? \n\nWhy are you giving away your secret sauce?\n\nWay too many founders build pitch decks wrong. They focus entirely on what the product is, and how it works. Do NOT do this.\n\nA pitch deck only needs to really answer the question of “why now?” and “why should I trust you to solve this problem?”\n\nThe purpose of the pitch deck is to tell and sell a story. It is not to show amazing new features, give away your business model, reveal key research or insight into the market, or anything like that.\n\nThe purpose of a deck is to sell your vision and mission, state a problem, state why you’re the person to solve that problem, what the opportunity is, and why you need money to do it. That’s it.\n\nNotice how none of these things include what your product looks like? What the features are? What your business model or marketing position is?\n\nDon’t give away your secret sauce. If they want to know more they can sign an NDA and book a second meeting.\n\nIf you’re interested I would be happy to sign an NDA, actually honor it, and review your deck for you and tell you what you need to fix. I usually charge for this but it pisses me off when VCs take advantage of startups like this so I’ll do a basic review and provide my feedback for free if you want.\n\nI’m sorry this happened to you, but please learn from it. This an opportunity to learn how to be a better storyteller, play your cards closer to your chest, and as others have said this is actually market validation.\n\nYour deck is to sell the dream, or promise land, that’s it. It’s emotional. It’s a story. It’s not about what/how. It’s about why.",
            "score": 5,
            "author": "applextrent",
            "replies": [
                {
                    "level": 1,
                    "comment": "They did a deep dive on a 3rd round meeting for technical due diligence. My deck does not contain proprietary info. We did however secure funding in the end from great investors, and their team is not our, we know we will beat them.",
                    "score": 2,
                    "author": "Shaftedbyavc123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Two lessons:\n\n1). Never give away the “secret sauce”.  Never answer a “how” question, only answer “what” questions.  Tell them what you do, and what makes your product special or unique, but not HOW you do that thing.  If they push, say, “That’s proprietary, and we’d be happy to discuss specifics once you’re part of the team.”  \n\n2). If there is no secret sauce, you will be copied, and you will be copied more quickly and easily than you thought possible.  Always have secret sauce in your product.",
            "score": 3,
            "author": "TemporaryBoyfriend",
            "replies": [
                {
                    "level": 1,
                    "comment": "I said essentially the same thing. Can’t believe I had to go this far down to read this. Most of these replies about outing the VC are idiots. That’s how you never get funded. \n\nArguably, you don’t even want to get too deep into what. The deck should really be focused on the problem, how your product is the solution, and why you need funding now.\n\nToo much what is just as bad as too much how. \n\nDecks are teaser trailers. Not the whole movie.",
                    "score": 2,
                    "author": "applextrent"
                }
            ]
        },
        {
            "level": 0,
            "comment": "From my personal experience, the product is only the part of success. There are zillions of similar products on earth. Just take an example of an ice cream. \n\nWhat really matters is how you pitch your product, what perks you offer along with it, how your marketing &amp; customer service team copes with their tasks. \n\nFocus on your advantages, personalized approach and expertise. Industrial spying isn't a new thing, and many companies monitor their competitors to keep up with their product features. Just think broader, besides only technology innovations.",
            "score": 6,
            "author": "AliceGatsby"
        },
        {
            "level": 0,
            "comment": "Brainraped. NDA? Most VC’s won’t sign but just curious.",
            "score": 6,
            "author": "sgringer111",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope, wouldnt sign",
                    "score": 3,
                    "author": "Shaftedbyavc123"
                },
                {
                    "level": 1,
                    "comment": "The reason most VCs won't sign NDA is to protect themselves, just in case a coincidence like this were to occur.\n\nThat being said, I'm sure there are some unscrupulous VCs who use the freedom to pass off ideas as their own, but they would be in the minority I'm sure.",
                    "score": 3,
                    "author": "Paddy-Makk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They don't have your: vision, research, model details, GTMS, team, passion, nor traction. They've got your deck. You feel betrayed; I totally get that. Every single person that interacts with that companie's post? Send them a personalized message on LI, and pull them towards you. They want to hoover your idea? Great! They will collect a brand new volume of interested parties, which you can hoover back...and they've already met the necessary interest threshold!",
            "score": 3,
            "author": "VinoVoyage"
        },
        {
            "level": 0,
            "comment": "Call them out publically on Twitter. VCs love screwing other VCs - this way you'll score both rival firms' support and term sheets.",
            "score": 3,
            "author": "frankens_tien",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Rule 2\n\nRule 6",
                            "score": 1,
                            "author": "GaryARefuge"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazon does this a lot.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope, its a landing/announcement page, not a beta, and it wasn’t a feature, its an entire product. Quite the opposite of trivial to replicate.",
                    "score": 7,
                    "author": "Shaftedbyavc123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Checkout Jim McKelvey's book called The Innovation Stack - he's the co-founder of Square and talks about how they overcame Amazon making a replica product.\n\nIt starts off sounding like a regular business help book but I was pleasantly surprised at his really helpful reflections.\n\nHe talks about the innovation stack as a series of developments that you've have to overcome to create your product. Say each innovation you've made (be they big or small) can be replicated to around 80% similarity. If you have 5 innovations then .8\\*.8\\*.8\\*.8\\*.8 = \\~32% which means they have only a 32% chance of pulling off what you've done and the wisdom you've gained. \n\nIn addition, he talks about how it's so much harder to change someone's opinion than it is to introduce them to something new. Think anti-vaxxers here - impossible to change their mind, but easy to introduce to a new health craze. If you've created an innovation, then your customers will be harder to steal then they think.\n\nI do wish you the best, it must be a gut wrenching feeling; but know that you created this due to a want in YOUR life - they can't replicate that inspiration and as a result won't be able to give the product the design care and innovation that you can.",
            "score": 2,
            "author": "Graphene8911"
        },
        {
            "level": 0,
            "comment": "I have seen decks shared freely on whatsapp groups\nSeems like some VCs don’t even think it’s unethical at all\n\nWe live in weird times\nTake revenge with massive success\nThat’s the only answer",
            "score": 5,
            "author": "svij137",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why would that be unethical?\n\nThe purpose of the deck is to raise funding from VCs. You benefit from them sharing among other VCs. That's more opportunity for a VC to align with the deal and become interested in it.\n\nIf you're putting trade secrets into your pitch deck, you are pitching wrong.",
                    "score": 1,
                    "author": "GaryARefuge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have seen decks shared on non VC groups too by VCs\nThat’s unethical \n\nAnd the post this guy shared above clearly shows what’s unethical: sharing information with their portfolio company about a competitor \n\nSometimes trade secrets needs to be shared to demonstrate differentiation",
                            "score": 1,
                            "author": "svij137",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Sometimes trade secrets needs to be shared to demonstrate differentiation \n\nNot as part of the initial pitch. You can cover what and why without explaining the secrets of how.  \n\nThat sort of thing should occur much later during the due diligence process and with the proper protections in place.",
                                    "score": 1,
                                    "author": "GaryARefuge",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We all wish for that\nWe don’t live in an ideal world\n\nA lot of times those things are asked by VCs you believe it or not\nIt happens all the time and is highly unethical that they share it so freely on whatsapp groups",
                                            "score": 1,
                                            "author": "svij137",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "...\n\nYou have full control.  If they ask you such a thing, you explain that you need to secure specific protections before you share such trade secrets.\n\nIf they insist on you doing such a thing without those protections, you walk away. They were not the right VC for you.\n\nIt is not unethical if they are not breaching any such protections.  Again, you shouldn't be sharing any such secrets without protections in place. YOU DO NOT NEED TO at that stage of the process.\n\nAnd, again, sharing decks among each other IS WHAT YOU WANT THEM TO DO! That's marketing your deal to more potential investors. That is the purpose of the deck.",
                                                    "score": 1,
                                                    "author": "GaryARefuge",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I have done that\nWalked away and yes lost those deals\nNot all can do that\nThe fear of missing out a good brand VC forces a lot of entrepreneurs to share whatever they ask for\n\nAnd even if they share with goodwill and trust \nIts not ethical for the VC to share that with others without asking for permissions",
                                                            "score": 1,
                                                            "author": "svij137",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;The fear of missing out a good brand VC\n \nThis is irrational fear.  Don't be controlled by your emotions.  This is NOT a VC you want.  You lose nothing by walking away. If your deal is legit, there will be much better VCs to work with.\n\nSo, yes, EVERYONE can walk away and should.\n\nVery few ventures actually require a VC. If your venture does and you are struggling to court one, a legit one, you need to do more to build up your business through other means. If that is near impossible given the business, put this venture on hold until you have enough reach and influence through other successes to open those doors.",
                                                                    "score": 1,
                                                                    "author": "GaryARefuge",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So them sharing the deck with their portfolio is not unethical??\nI am not sure if you have run a VC funded business to even comment in this as everything is not all black n white",
                                                                            "score": 1,
                                                                            "author": "svij137",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Not if you don't express the deck itself is confidential material NOT to be shared.\n\nNot if you have not taken any steps to establish such things.\n\nBut, again, if you don't put trade secrets into your deck..why worry? Nothing in there should put you at any such disadvantage. No more than if they checked out your site or played with your product.\n\n&gt;everything is not all black n white\n\nYes, that is why I'm calling attention to a variety of contextual factors.",
                                                                                    "score": 1,
                                                                                    "author": "GaryARefuge"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is relatively normal. Annoying and a dick move by the VC? Yes, but not uncommon and part of the game.\n\nKeep your head down, press on with your product development and use this experience to grow.",
            "score": 2,
            "author": "kuantizeman"
        },
        {
            "level": 0,
            "comment": "You have a product.  Go sell the shit out of it, and every time you see them post comment on it about something in like, \"Don't settle for imitations, get the real deal.\"",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Name them and shame them",
            "score": 2,
            "author": "TalkingJellyFish"
        },
        {
            "level": 0,
            "comment": "&gt;Thoughts, advice?\n\nName and shame. VC is a reputation-based business. Bad actors have to be known so they can be weeded out. When it makes sense in your interactions with founders (particularly those who may consider working with this vc), make your experience known. Over time, data points add up and bad actors get blacklisted.\n\nRE the competitor: put the screenshot in your traction slide - \"we're so good competitors are ripping us off verbatim!\" Keep building and getting traction. Ebay tried to rip off Paypal in the early days but they couldn't make it stick.",
            "score": 2,
            "author": "Minister_for_Magic"
        },
        {
            "level": 0,
            "comment": "Adding my voice to those who suggest you to ignore your new competitor. However, I strongly suggest you to publicly name the VC and make sure the startup and VC community is aware of what they did.\n\nThis is an extremely bad practice for a VC, and it needs to stop. Their whole business is based on trust and reputation, so if you can’t trust a VC with a pitch deck, they’re done.\n\nThey should be held accountable and get called out for it, so that others know to keep the distance from such an unethical VC.",
            "score": 2,
            "author": "jacored"
        },
        {
            "level": 0,
            "comment": "They likely had most of the product done a while before meeting you. You don’t take a brand new idea to beta in 1 week. And since I don’t know what ‘lines  stolen’ means it’s hard to really assess. But at least it means you’re likely on the right track. It’s not necessarily being first to market. It’s about having the better product at the right time.",
            "score": 2,
            "author": "sdoc86"
        },
        {
            "level": 0,
            "comment": "*Someone who copies you is just copying one frame out of a video. If you keep going, you'll find that their video diverges from yours, and probably not for the better.* ~PG",
            "score": 2,
            "author": "ecib",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fun analogy.",
                    "score": 1,
                    "author": "GaryARefuge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does it happen?\n\nPitch is all about basic concept and numbers competition team marketing/sales\n\nSecret sauce of any venture is Details of operations which we never share with investors even when they cut cheques",
            "score": 2,
            "author": "vijaykurhade"
        },
        {
            "level": 0,
            "comment": "Well, if you wanna play rough, get a patent on the project before they get to it first and you can sue them for infringement.  Provisional patents can be jimmied up quickly, which gives you a year to get a real patent, but in the meantime, you would have a case against them, especially if they're using the same sales language and all.\n\nI'm not a lawyer, though, so I would absolutely consult with one who deals in these matters to see if it's a viable option.  Also, talk to your core team and see what they want to do.  Simply moving on is probably the less hectic route, but it could prove fatal if they end up doing a really great job.  If so, then you're basically tasked with figuring out how to differentiate yourself in a way that makes you ten times better than them.\n\nBut yeah, it really just depends on what your product is and how well you think your competitor will do.  Like, if this is a service that tons of other startups are already doing and the edge you bring is significant enough to get you into the game, but not significant enough to truly differentiate you, then it's not worth the hassle of suing.  But, if this aspect of your product or if the product itself is so revolutionary that it will spark a paradigm shift in the market and if there is literally no one else doing it?  Eh, idk.  Might be worth it then.\n\nHowever, first to market isn't always the big winner.  It's all about how your product or service is ten times better than the rest.  I guess I would just ask myself this question.  Can I iterate this product from the start so that it is ten times better than everyone else in spite of the fact that my competitor stole my idea?  If you can't or you see it as being a monumental uphill battle, you may really want to consider the more aggressive route.  But, if you feel you can adapt and outcompete, then definitely don't sue!\n\nAlso, you gotta ask yourself how truly passionate are you about the goal of the service?  Like, we all wanna be successful and make money, but is that more important to you than the actual problem you want to solve?  There's no problem in wanting to just be successful and make money, but if that is the case, then it should be far easier to walk away from this if it ends up failing, in which case it's not worth getting into a lawsuit over.",
            "score": 2,
            "author": "Telkk"
        },
        {
            "level": 0,
            "comment": "They (others in future) might be able to copy your product but your real strength lies in company vision, leadership, culture, execution etc. Remember  in 3Ps, Product is just one facet.",
            "score": 1,
            "author": "asbm104"
        },
        {
            "level": 0,
            "comment": "I can't think of any successful idea that wasn't pretty quickly cloned, stolen, copied, emulated or whatever else you want to call it.",
            "score": 1,
            "author": "cgello"
        },
        {
            "level": 0,
            "comment": "They may steal your idea, build some product based on it, but eventually execution makes the difference, so don't give up, keep going!",
            "score": 1,
            "author": "zoomekreddit"
        },
        {
            "level": 0,
            "comment": "There are a lot of VC horror stories to go around. \n\nAs others have said, just forge ahead. If they see enough value in your idea to copy it, it must be valuable. You can either gain traction in the market, or sell to a bigger company who wants what you have. \n\nJust be sure to respond to questions about competition if you are raising from others.",
            "score": 1,
            "author": "wtfisthat"
        },
        {
            "level": 0,
            "comment": "This is probably not the comment you wanted but I think you are always more prone to believe this be the case. No one really has unique ideas no matter how much domain knowledge they have and how small the competition pool. What they told you might have simply been that they didn’t understand your idea initially and that there were competition since they already invested in one. Certainly it is possible for a big team to adapt the idea in a week; it’s probably prudent to ask yourself do you feel their team could have done what they did with the resource they had. So, I wouldn’t think too much of it. Don’t be stressed (I assume you are since you went through the trouble of create another Reddit and make the post month after the event). They are likely not your enemy, just keep pushing whatever you are doing. Don’t be boggled down with negativity. Good luck!",
            "score": 1,
            "author": "dumplingkitten"
        },
        {
            "level": 0,
            "comment": "If your product is that easily copiable, it shows that a) it’s a good product and b) it wasn’t differentiated enough to prevent someone from copying exactly. Everyone’s product will be copied, you have to do it better, and be ready to pivot, and keep moving. Think of any company, then think or alternatives- their product was copied, how did they keep going?",
            "score": 1,
            "author": "iamspartacus5339"
        },
        {
            "level": 0,
            "comment": "I would probably out them. In general though if your idea is good people will copy it, beyond making sure if someone googled those vc's it could be seen they are scum I would move on.",
            "score": 1,
            "author": "Shaitan87"
        },
        {
            "level": 0,
            "comment": "That is market validation! Build a strong team of smart people, keep your good people, keep building, and stomp the competition into the ground.",
            "score": 1,
            "author": "Zenai"
        },
        {
            "level": 0,
            "comment": "No such thing as ideas, only execution :)",
            "score": 1,
            "author": "nick-jagger"
        },
        {
            "level": 0,
            "comment": "They always do this. I warned some posters here about blindly sending their business models to people here who claim to want help them look and advise them,  but got shot down by some saying ideas are dime a dozen. There is no such thing as a good VC out there to help. It's a dog eat dog world.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is market validation. The fact that someone else thought your product/ideas were good enough to copy is great. Add it to your deck. Also, spend no longer than 30 minutes looking through your existing deck to see if there is some info that needs to be removed to make it harder to copy your ideas without detracting from the quality of your deck. Chances are there's nothing that needs to be done, but sometimes it's worth a look.",
            "score": 1,
            "author": "KapitanWalnut"
        },
        {
            "level": 0,
            "comment": "Build a business, not a product.\n\nIn my neighborhood there is an angel group that does this on the regular. They've gotten a reputation, one person in particular. His name is Tom. Any time I talk to startups looking for funding I warn them. Most already know.",
            "score": 1,
            "author": "russellfreedom"
        },
        {
            "level": 0,
            "comment": "They don't have your drive, ethic, or tacful mind if they have a business of stealing others ideas. Bound to fail. Literally like a politician talking about policies they didn't make.",
            "score": 1,
            "author": "trillnoel"
        },
        {
            "level": 0,
            "comment": "Poor zucker!",
            "score": 1,
            "author": "PeaceRepresentative3"
        },
        {
            "level": 0,
            "comment": "Dont worry. It would eventually happen that others will copy you after you launch. You need to stay 2 steps ahead by innovating and being radically empathetic to your users' needs. \n\nNever share your strategic roadmap with them, even if you do, dont share critically strategic  items until you are much ahead in talks for funding.\n\nGood luck! Dont be bummed..them copying you means that you are on to something. Like codefame commented, its your market validation.",
            "score": 1,
            "author": "Exact-Mushroom-9028"
        },
        {
            "level": 0,
            "comment": "We're in a competitive space ourselves and honestly - it doesn't matter. Build your company still and get users to love you. That's how you win.",
            "score": 1,
            "author": "atomizedhq"
        },
        {
            "level": 0,
            "comment": "is it possible they were working on it, and realized they needed to be first to market after your pitch?",
            "score": 1,
            "author": "ceedeepeeWT",
            "replies": [
                {
                    "level": 1,
                    "comment": "I doubt they felt a need to be first to market as a result of some random founder giving their own pitch. It's not like OP is actually any threat to cause them to rush to the market and ignore their already established road map and schedule.\n\nIf so, they are idiots.\n\nMore likely, they were already working on it and this is just the timing that was already in place.",
                    "score": 2,
                    "author": "GaryARefuge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also a possibility. I was trying to think of non-malicious reasons, i hadn’t seen anyone mention the possibility of it being a coincidence yet.",
                            "score": 2,
                            "author": "ceedeepeeWT"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a similar experience with my last startup. The game is beyond the product and ideas, its about execution and getting to the market. If you can continue focus on execution and reaching the market with what it needs (as products need to evolve for the market), you will have a good chance to win.",
            "score": 1,
            "author": "SNoCodeZ"
        },
        {
            "level": 0,
            "comment": "Whatever happened to non compete non disclosure agreements?",
            "score": 1,
            "author": "morcaradhras",
            "replies": [
                {
                    "level": 1,
                    "comment": "No experienced investor is touching either of those just to listen to a pitch.\n\nIf your pitch includes any such confidential trade secrets that COULD and SHOULD be protected by a NDA, you're pitching wrong.",
                    "score": 1,
                    "author": "GaryARefuge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you sent them a cease and desist. I would start documenting this early in case this becomes big and you have cause to go after them when its worth it. until then keep your head down and build!",
            "score": 1,
            "author": "captaing1"
        },
        {
            "level": 0,
            "comment": "Did you make them sign an NDA?",
            "score": 1,
            "author": "ScaredMoney-NoMoney"
        },
        {
            "level": 0,
            "comment": "You NEED to sue both parties and PERFECT your product!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Ideas are nothing, execution is everything.\n\nExecution is 9/10ths of the law",
            "score": 1,
            "author": "cuteman"
        },
        {
            "level": 0,
            "comment": "Are we all sure this VC stole your idea? Is it possible you pitched them and the reason they rejected you was they already had a company in their portfolio working on a similar idea? 1 week is a quick turnaround time",
            "score": 1,
            "author": "sanman918"
        },
        {
            "level": 0,
            "comment": "Consider doing a PR run first. Not only is this a great way to get into the awareness space of new VCs, but it also is a great way to create a pre-sell demand email subscriber list. If you can gain a presell list within your market that’s very powerful and gives you a marketing leg up for when you go live. It also incentivizes the VC to go with you as you have marker momentum off the bat, something their portfolio company already has.",
            "score": 1,
            "author": "medioverse"
        },
        {
            "level": 0,
            "comment": "Those depraved animals!!!",
            "score": 1,
            "author": "123eire"
        },
        {
            "level": 0,
            "comment": "Are they ignoring an NDA?",
            "score": 1,
            "author": "Slartytempest"
        },
        {
            "level": 0,
            "comment": "Market education is often a big problem for new products and services, and it sounds like someone volunteered to do that part for you.",
            "score": 1,
            "author": "FearAndLawyering"
        },
        {
            "level": 0,
            "comment": "Happens ALL THE TIME.",
            "score": 1,
            "author": "hmmokcool"
        },
        {
            "level": 0,
            "comment": "I had a VC push out he wanted to support minority founders and when I reached out to him, he sent my pitch deck to a company he invested in and pretended to act dumb when I could see him on Doc send/letting the girl login. \n\n&amp;#x200B;\n\nReally grimmy stuff mate.",
            "score": 1,
            "author": "Difficult_Addition18"
        },
        {
            "level": 0,
            "comment": "This is a very interesting catch 22 and I was hoping to get more insight from other people in the community about how much of your idea to share with a potential investor/partner.  I was recently introduced to a VC firm that is made of coders and also smart business people who have access to over 60 coders.  I spoke with the founder on the phone for like 15 minutes and he asked me to send him everything I have.  Realizing that all I reallly have are ideas that haven't been test but I feel strongly about and knowing he has the resources to make it happen, did I make a big mistake like this guy?  Or perhaps he didn't make a mistake.  I've been spinnng my wheels with people who claim to be coders but know I would get much further working with professionals with experience.  Anyway, appreciate any thoughts echoing off the original post about how a founder can protect themselve as I know it would probably be an insult and would ensure 0 interest if asking a VC to sign an NDA.  It seems like VC have so many people presenting ideas to them that this probably doesn't happen too often?  Am I wrong and what can founders do to be protect themself?  Am I overthinking the effects of even asking them to sign an NDA?",
            "score": 1,
            "author": "notyethavinganimpact"
        },
        {
            "level": 0,
            "comment": "Good ideas are a dime-a-dozen.\n\nExecuting on a good idea and turning it into a successful business is gold. Focus on that.\n\nAlso, if your only moat was your idea, you didn't have much of a moat.",
            "score": 0,
            "author": "gwax"
        },
        {
            "level": 0,
            "comment": "It’s highly unlikely they stole your idea. I doubt within 1 week the VC met with the portfolio company. The portfolio company thought it was so brilliant they stopped everything they were doing and focused entirely on replicating your stuff, then they built and launched it (all within a week). \n\nWhat’s more likely is the VC saw your pitch and passed because their portfolio company was already building and planning to launch the product.",
            "score": 2,
            "author": "jimmyjordanbutler"
        },
        {
            "level": 0,
            "comment": "Did they sign any sort of NDA?",
            "score": 1,
            "author": "schoolofthot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most legit VCs won't be willing to sign an NDA unless you're a coveted founder with a track record of success or are working in a really cutting-edge, technical industry. Either way OP should still name-and-shame",
                    "score": 9,
                    "author": "bigchungusmode96",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why dont VCs sign NDAs?",
                            "score": 2,
                            "author": "Beli_Mawrr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can Google it but NDAs create a lot of potential legal headaches/risks for VCs, especially if they're potentially going to be frequently pitched by or invest in other startups in the same space, similar products, etc. The majority of VC's won't even bother with you if you ask for an NDA.",
                                    "score": 3,
                                    "author": "bigchungusmode96",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not to mention they are hardly worth the paper their written on. From the perspective of the founder, what are they going to do... sue the VC? They need money and also suing a VC is likely to get you blackballed from others wanting to hear your pitches.\n\nFrom the perspective of the VC like you said it's all downside and no real upside. Also you're the one with money. The people pitching you are not in a great position to make demands.",
                                            "score": 1,
                                            "author": "teamcoltra"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nope",
                    "score": 1,
                    "author": "Shaftedbyavc123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let this be a motivating factor for you, stop focusing on this unjust thing, it will only drain you emotionally. Frame it to yourself that you now have no way but to crush them into pieces. After you're done with your product and have nothing else to improve on it (this should be never) then and only then focus on how to get back at those people. Good luck, stay strong.",
            "score": 1,
            "author": "theodordiaconu"
        },
        {
            "level": 0,
            "comment": "stop getting so attached to your idea as the special sauce.  this is inexperienced thinking in entrepreneurship.  if you think your idea is unique and magical, then get a patent.  if you can't get a patent, and a single sortof-but-not-really-even-a-competitor breathing in your general direction and it takes you out, then your company sucked in the first place and you deserve to lose.\n\nbefore facebook, there was myspace, friendster, facethejury, and many other social networking sites.  and after facebook, there was digg, reddit, stumbleupon, instagram, snapchat, twitter, and mountains of other social media sites.  shit, before instagram, there were literally hundreds of similar photosharing social media apps.  you really think the idea itself was the secret sauce?",
            "score": 1,
            "author": "tilio",
            "replies": [
                {
                    "level": 1,
                    "comment": "FTJ...a real nest of humanity's worst characteristics unlike many others, at the time. The breeding ground for true trolls of the era. A rare occurrence when that shit hole gets brought up.",
                    "score": 1,
                    "author": "GaryARefuge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Heard about stories like this a few times. It did happen.",
            "score": -1,
            "author": "WhatsLoveApp"
        },
        {
            "level": 0,
            "comment": "shit happens. keep going.",
            "score": 0,
            "author": "TheRedBallz"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rule 2\n\nRule 5",
                    "score": 1,
                    "author": "GaryARefuge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was going to make a similar post about this yesterday, but decided against it. I had a VC that I felt was going to do something similar. I sent him a watered down version of my deck. I wish I sent screenshots of my ass. My concept is too complicated, and I feel I'm legitimately one of the few people in the country that could execute on it, so I wasn't worried, but still F'd up that you get the feeling they'd do that.",
            "score": 0,
            "author": "jl1585"
        },
        {
            "level": 0,
            "comment": "Contact an attorney if you have money, and let them know that you are. Absolutely terrible.",
            "score": -12,
            "author": "extrinsicly_valued",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cant sue for this. Not illegal to copy an unprotected idea. Go ahead and make a Facebook clone under different brand, they can't sue you.",
                    "score": 3,
                    "author": "calizoomer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. Do you have a patent on this idea / product?\n\n2. Was there an NDA signed?\n\n3. Get a lawyer.  Major lawsuit here.  The settlement would fund your company &amp; you wont have to go to VCs.  In the end, this VC will have funded you.\n\nDo not let them get away with this.",
            "score": 1,
            "author": "SuspiciousMeat6696"
        },
        {
            "level": 0,
            "comment": "Why are you protecting the name of the company? Name names! Help others from making the same mistake",
            "score": 1,
            "author": "inlyst"
        }
    ]
}