{
    "id": "pfojuk",
    "score": 385,
    "title": "Share Your Startup - September 2021 - Upvote This For Maximum Visibility!",
    "author": "AutoModerator",
    "date": 1630479672.0,
    "url": "https://www.reddit.com/r/startups/comments/pfojuk",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/startups/)",
        "https://www.reddit.com/r/startups/)",
        "https://www.reddit.com/r/startup/)",
        "https://discord.gg/yjMZU8g)"
    ],
    "postText": " \n\n[r/startups](https://www.reddit.com/r/startups/) wants to hear what you're working on!\n\n&amp;#x200B;\n\nTell us about your startup in a comment within this submission. Follow this template:\n\n* **Startup Name / URL**\n* **Location of Your Headquarters**\n   * Let people know where you are based for possible local networking with you and access to local resources \n* **Elevator Pitch/Explainer Video**\n* **More details:**\n   * What life cycle stage is your startup at? \n   * Your role?\n* **What goals are you trying to reach this month?**\n   * How could [r/startups](https://www.reddit.com/r/startups/) help?\n   * Do NOT solicit funds publicly--this may be illegal for you to do so\n* **Discount for** [**r/startup**](https://www.reddit.com/r/startup/) **subscribers?**\n   * Share how our community can get a discount\n\n\\--------------------------------------------------\n\n[Join our discord for instant chat, advice, and emotional support!](https://discord.gg/yjMZU8g)\n\n\\--------------------------------------------------\n\n**Startup Life Cycle Stages** (Max Marmer life cycle model for startups as used by Startup Genome and Kauffman Foundation)\n\n* 1. **Discovery**\n   * Researching the market, the competitors, and the potential users\n   * Designing the first iteration of the user experience\n   * Working towards problem/solution fit (Market Validation)\n   * Building MVP\n* 2. **Validation**\n   * Achieved problem/solution fit (Market Validation)\n   * MVP launched\n   * Conducting Product Validation\n   * Revising/refining user experience based on results of Product Validation tests\n   * Refining Product through new Versions (Ver.1+)\n   * Working towards product/market fit\n* 3. **Efficiency**\n   * Achieved product/market fit\n   * Preparing to begin scaling process\n   * Optimizing the user experience to handle aggressive user growth at scale\n   * Optimizing the performance of the product to handle aggressive user growth at scale\n   * Optimizing the operational workflows and systems in preparation of scaling\n   * Conducting validation tests of scaling strategies\n* 4. **Scaling**\n   * Achieved validation of scaling strategies\n   * Achieved an acceptable level of optimization of the operational systems\n   * Actively pushing forward with aggressive growth\n   * Conducting validation tests to achieve a repeatable sales process at scale\n* 5. **Profit Maximization**\n   * Successfully scaled the business and can now be considered an established company\n   * Expanding production and operations in order to increase revenue\n   * Optimizing systems to maximize profits\n* 6. **Renewal**\n   * Has achieved near peak profits\n   * Has achieved near peak optimization of systems\n   * Actively seeking to reinvent the company and core products to stay innovative\n   * Actively seeking to acquire other companies and technologies to expand market share and relevancy\n   * Actively exploring horizontal and vertical expansion to increase prevent the decline of the company\n\nIf you are running a traditional business that is not designed to scale rapidly, feel free to reference a traditional business life cycle model and share what traditional business life cycle stage you are at.",
    "comments": [
        {
            "level": 0,
            "comment": "**Name:** Essential Tech\n\n**URL:** [https://www.essentialtech.com.au](https://www.essentialtech.com.au)\n\n**Location:** Brisbane, Australia\n\n**Pitch:** Essential Tech is a Brisbane-based Managed IT services provider dedicated to providing organizations with better technology services. We partner with small-to-medium-sized businesses across Australia, delivering optimal security and performance.\n\nWe are leaders in flexibility, usability, and support. Providers of solutions that are fit-for-purpose, Essential Tech works with clients to debunk the endless foray of IT lingo to first principles ensuring transparency and understanding.\n\nWith offices in Brisbane, we support a range of professional services industries by applying a considered understanding of all facets of your IT function, which equips our team to deliver pragmatic, effective solutions.\n\n**Looking for:** Users and feedback.",
            "score": 1,
            "author": "essentialtech-7"
        },
        {
            "level": 0,
            "comment": "**Startup**: Mysitio ([more info in my profile website](https://beaumont.surge.sh)) The name is a combination of English and Spanish, which stands for \"My Space\" - denoting control of one's place at their home.\n\n**Location**: Hong Kong\n\n**Pitch**: A web app for blogging and selling home decor items\n\n**Details**: On its face, Mysitio is a web application that is similar to Etsy but focused on the home decor market segment.\n\nThe idea is born out of my own personal frustration in gathering local advice and guides to decorate my new apartment, it was especially surprising to find that it is difficult to acquire reviews and details of traditional furniture stores in a cultural rich Hong Kong (partly, I think, is because of modernisation and modern materialism which have taken over the traditional Chinese stores such as those selling bamboo baskets). Every magazines and online tutorials focused on grandiose designs that are often unrealistic and out of reach for the common household.\n\nMysitio aims to put the common folks in the driving seat for sharing designs knowledge by blogging their experience - something as simple as flower placement, pens station, monitors stand, IKEA tips and tricks, etc.\n\nBut in general, my personal aim is to find out how others utilise their home decor ideas to maximise the utilisation of space in the space-deprived place like Hong Kong.\n\n**Features**: Mysitio will make use of an inventory feature where users can store photos of their home decor items in their profile, from which they could\n\n* share the items as is;\n* categorise them into different saved lists (and generate a QR to share this saved list);\n* blog about their items or saved list; or\n* post an item for sell or exchange.\n\nAs an example for use case - if an Airbnb host wishes to list some of their home items for sale (so the guest could take a painting, a mug, or slippers as souvenir), the host could show the QR code to the guest which would show a list of items for sale at the house.\n\n**Role:** Founder/Developer\n\n**Goal this month**: building a demo for trial and testing based on Laravel as a PHP backend framework and VueJS as the frontend.\n\n**Reddit help**: Need someone to talk to, to validate the idea and just general brainstorming.",
            "score": 1,
            "author": "naeads"
        },
        {
            "level": 0,
            "comment": "**Startup:**  Monday Hero - [https://mondayhero.io](https://mondayhero.io)\n\n  \n**Headquarters:**  US &amp; Turkey - Remote\n\n  \n**Elevator Pitch:** Monday Hero helps product teams to finish their apps faster up to %50 by converting designs to code. It's integrated to Figma, Adobe XD and Sketch App. It converts the design to code so developers can start fast to implementing business rules without spending a lot of time on the UI.  Please let me know what you think :)\n\n  \n**Explainer Video:** https://www.youtube.com/watch?v=1Zi2C9Tcrdk  \n**What life cycle stage is your startup at?** Validation  \n**Your role?** I'm one of the co-founders.   \n**How could** r/startups **help?** I would like to get feedback from users and talk about their pain points on the process of coding UI and developing apps.    \n**Discount for** r/startup **subscribers?** Here is a 50% discount special to r/startup subscribers, apply the discount code on the payment page: 50PERCENTOFF",
            "score": 1,
            "author": "nazlitemurtas"
        },
        {
            "level": 0,
            "comment": "Startup Name / URL - Kodeclik Online Academy / Coding for Kids / https://www.kodeclik.com  \nLocation of Your Headquarters - Ashburn, VA  \nLet people know where you are based for possible local networking with you and access to local resources  \nElevator Pitch/Explainer Video - Kodeclik is an online Coding and Math academy for kids and teens 8-18.  \nMore details: We offer 1:1 and small group online classes. Our classes use our proprietary curriculum, are great fun and are taught by top notch, excellent instructors.  \nWhat life cycle stage is your startup at? Currently in the efficiency phase.  \nYour role? - Founder  \nWhat goals are you trying to reach this month? - Growth  \nHow could r/startups help? - Help us gain more exposure and visibility.  \nDo NOT solicit funds publicly--this may be illegal for you to do so  \nDiscount for r/startup subscribers? - 10% off - email us at hello@kodeclik.com  \nShare how our community can get a discount",
            "score": 1,
            "author": "kodeclik"
        },
        {
            "level": 0,
            "comment": "**Startup Name**: Unmand - [https://unmand.com/](https://unmand.com/)\n\n**Location**: Melbourne, Australia\n\n**Elevator pitch**: No-code automation platform. Unmand's no-code automation platform liberates businesses from mundane, error-prone and time-consuming tasks. Our Robotic Process Automation (RPA) [software](https://unmand.com/products/swarm/) can handle the most complicated workflows, while keeping the user in complete control. Our Intelligent Document Processing [solution](https://unmand.com/products/exfil/) leverages the latest in machine learning and optical character recognition to convert any document into structured data.\n\n**Life cycle stage**: Efficiency\n\n**Looking for**: Feedback on the product (UX, new/improved features, etc)",
            "score": 1,
            "author": "unmand-systems"
        },
        {
            "level": 0,
            "comment": "Startup: KwickBox. [https://kwickbox.cloud](https://kwickbox.cloud)\n\nLocation: CapeTown, South Africa\n\nPitch: A smart online résumé review platform where users are able to create multiple résumés without the use of templates as well as sharing their résumés with trusted people for intelligent review\n\nStage: MVP\n\nRole: I'm the Founder &amp; CTO of the startup",
            "score": 1,
            "author": "rotimi_je_suis"
        },
        {
            "level": 0,
            "comment": "**Name:** Interesting Things\n\n**URL:** https://bengtan.com/interesting-things\n\n**Location:** Australia\n\n**Pitch:** Interesting Things is a weekly email newsletter curating interesting stories and links from tech and business **which aren't covered** by the mainstream tech press.\n\nGet **40+ articles every Friday**, of which a few are usually about startups (There's usually a few more about personal productivity too). Free to subscribe.\n\nCheck out some [previous issues](https://bengtan.com/interesting-things).\n\n**What goals are you trying to reach this month?** More readers/subscribers and any sort of feedback.\n\nThank you for reading.",
            "score": 1,
            "author": "bengtan"
        },
        {
            "level": 0,
            "comment": "**Name:** Parthenon\n\n**URL:** [https://www.getparthenon.com](https://www.getparthenon.com)\n\n**Pitch:** It's a web application starter kit. It provides everything you need to build web applications or SaaS systems. It provides users, payments, teams, plans, split testing, a staff admin section, etc. It allows people/companies to build their MVPs extremely quickly. Unlike other bootstraps the aim is to provide a high level of support and maintenance while increasing the functionality provided. \n\nThe benefit over open-source is that it's not built by volunteers who provide no SLAs or promises on when things will get fixed or what features will be added. We offer support and SLAs and provide our roadmap and a promise on how long we'll provide support for each release.\n\n**Discount:** The discount is **25%** off bootstrap edition that can be purchased via the website with the code **r\\_startup.**  \n\n\n**This month's goals:** To onboard off on the bootstrap edition that can be bought via the website with the code",
            "score": 1,
            "author": "that_guy_iain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love all of the tools that you're giving your users quick access to! I'm building a micropayments platform that could also be a helpful integration for some of your users as well. Especially if they're a SaaS product or selling an API. It'd give them a quick way of implementing pay-as-you-go pricing models or one-time smaller purchases.",
                    "score": 1,
                    "author": "micma123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Cast**\r  \n\r  \n**URL:** http://joincast.co\r  \n\r  \n**Location:** Toronto based, but app is available in all primarily English speaking countries at this time (Canada, UK, USA, etc.) - continuing to expand!\r  \n\r  \n**Pitch:** Cast is a social voting app. We're on a mission to create a safe space to share your honest opinion, and see an instant snapshot of what people really think. We’re turning bystanders into active participants in every conversation.\r  \n\r  \n**Discount:** The app is 100% free to use, with no ads/spam\r  \n\r  \n**Stage:** We just launched our 2.0 version earlier this week! Available on the Google Play Store and Apple App Store ([www.joincast.co/download](https://www.joincast.co/download) will take you to the app store based on your device - mobile only)\r  \n\r  \n**Role:** Co-Founder\r  \n\r  \n**How could** r/startups **help?** We're looking for user growth and perspectives from outside of our home city of Toronto (which currently accounts for the majority of our userbase). Always looking for insight and feedback on which areas of our app we can improve on!\r  \n\r  \n**What goals are you trying to reach this month?** Continue to grow our userbase; more users = more differing opinions and unique perspectives! \n\nOur marketing plan for our 2.0 launch was to rent an RV and head down the east coast of the USA to spread the word! You can follow along with our journey on Instagram (@joincast.co)\r  \n\r  \nLast month we onboarded 1090+ users, looking to crush that in September!",
            "score": 1,
            "author": "ZealousidealHelp8311",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Name**: [Greener Spoon](https://www.greenerspoon.com/)\n\n**URL**: [https://www.greenerspoon.com/](https://www.greenerspoon.com/)\n\n**Location**: Seattle, WA, USA\n\n**Pitch**: Enables users to scan plant based milk bottles and see the health and environmental impacts of that product. Video [here](https://www.greenerspoon.com/faq)\n\nHow it works:\n\n1. Shop for groceries (specifically plant based milks)\n2. Scan barcode on product\n3. See health and environmental impacts of that product\n\n**Details**: Validation stage, team of two\n\n**Goals/looking for**:\n\n1. Feedback on the product (UX, new/improved features, etc)\n2. More users (what are the most efficient promotion channels?)\n3. Increased user retention (how can we make the product stickier?)\n4. Suggested monetization strategies (open to all suggestions)\n\n**Discount**: The tool is free\n\nTHANK YOU!",
            "score": 1,
            "author": "dballer13",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**: Skill Arbitrage Technology, Inc.\n\n\r  \n**Location of Your Headquarters:** New Delhi, India / Delaware, US\n\n**Elevator Pitch/Explainer Video:** [https://youtu.be/ipPOjhFeC7g](https://youtu.be/ipPOjhFeC7g)\n\n**What life cycle stage is your startup at?**\r  \nDiscovery phase. We do have a basic product as you can see from the explainer video, but we are still researching the market and improvising based on feedback.\r  \n\n\n**Your role?** I am a Co-founder.\n\n\r  \n**What goals are you trying to reach this month?**  \nWe would like to help at least 20 businesses / startups this month with appropriate paralegals / virtual assistants.\n\n**How could** r/startups **help?**\r  \nIt would be great if the businesses in this community can reach out for their basic legal requirements, especially where they find lawyers really expensive - they can try out the paralegals / virtual assistants and see.\n\n**Discount for** r/startup **subscribers?**\r  \n\r  \nAs noted in the explainer video, you can try a paralegal / virtual assistant free for up to 20 hours! That is a good deal of time to have them complete some basic documents for your business!",
            "score": 1,
            "author": "RemoteWorkCrusader"
        },
        {
            "level": 0,
            "comment": "**Name**: Less Columns  \n**URL**: https://lesscolumns.space  \n**Location**: Remote  \n**Pitch**: We help founders get rid of the messy product backlog and deliver more work.  \n**What goals are you trying to reach this month? -** More users for free backlog optimization call",
            "score": 1,
            "author": "loafer91"
        },
        {
            "level": 0,
            "comment": "Name: Uville Tech [Uville](https://www.uvilleinc.com)\n\nLocation: St. John's, NL, Canada\n\nElevator Pitch: Uville is a community mobile app platform that provides information about local businesses, as well as local events. For those who are new to the area or a local who's looking for live activity or shop local Uville app got you covered. For local businesses who's looking for more visibility or scale up Uville app is the platform you've been waiting for. It's free to download and to use. It's available for iOS and Android. Explainer video is available on the website, link above.\n\nLife cycle: customer/user acquisition\nRole: Founder\n\nGoals: More downloads and app awareness\nI would like the r/startups community to use the platform and provide a constructive feedback as well as to follow the uvilletech page on Instagram and repost our explainer video.\n[App store] (https://apps.apple.com/ca/app/uville-community-app/id1551670825)\n[Google playstore] (https://play.google.com/store/apps/details?id=com.uville.uvillebeta)",
            "score": 1,
            "author": "Hairy_Bodybuilder_84"
        },
        {
            "level": 0,
            "comment": "**Name:** Everconnect\n\n**URL:** [https://everconnectds.com](https://everconnectds.com)\n\n**Location:** Corona, United States\n\n**Pitch:** Everconnect Data Systems was formed in 2010 to provide a full range of database/software/support services for medium to large-sized businesses.\n\nWe guarantee our customers the best data management to direct their business towards the future. We have worked with notable organizations including Universal Studios, Hewlett-Packard, and many others.\n\nOur team has experience in supporting up to 120 concurrent database servers. Some of these DB servers house up to 100 databases on them and the sizes range from 100MB to 10 TB. Also, we have supported up to 10 SQL Server Clusters and 2 MS OLAP servers/SSAS. This takes a great deal of organization and understanding of the various data systems.\n\n**Looking for:** Users and feedback.",
            "score": 1,
            "author": "everconnectremo"
        },
        {
            "level": 0,
            "comment": "hey guys , sorry for this comment that am about to make. i have lesser karma, so i can't make a post. so here it goes :\n\nSHOULD ONE JOIN UNICORNS/DECA CORNS STARTUP? \n\nBackground : I am a software engineer who has been working in a small startup for an year and now looking for a change. i have expertise in my field and willing to take responsibility and juggle multiple hats that startup culture demands but some startups are too exploitive to even being worth it. i am talking about those whose CEOs would post  regarding weather internships should be paid or unpaid/ promote overtime / work-on-weekends culture and general politics. such stuff are too toxic for me to grow better.\n\nso i am mainly looking for \"medium\" to large scale startups that have got their HR and work culture figured  out, are willing to give good salary /promotion and help me grow individually via  supporting my learnings.  \n\nI am from India and India/the world is seeing a sudden boom in companies that raises a shit ton of money and are now being referred as unicorn /decacorn etc. indian companies like byjus , zomato, swighy, paytm, nykaa, apna, grofers , etc... have all recently been in news to become unicorns.\n\nso is this just a marketing gimmick or joining them could also benefit me as an engineer?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Name: **Autopred**\n\n**URL**: https://www.autopred.com/\n\n**Location**: Brno, Czechia\n\nPitch\n\n**Life cycle:** live.\n\n**Goal:** more users and a lot of feedback.\n\n**Discount** for r/startup subscribers?: Free to use.",
            "score": 1,
            "author": "mareean3"
        },
        {
            "level": 0,
            "comment": "**Name**: Mixpeek\n**URL**: https://mixpeek.com\n**Location**: Remote\n**Pitch**: File Search for your Software\n\nMixpeek is a cloud-agnostic API that enhances your app with a search engine that spans all your image, audio, video and PDF files.\n\n\n**Demo**: https://vimeo.com/605102151",
            "score": 1,
            "author": "mixpeek"
        },
        {
            "level": 0,
            "comment": "**Startup name**: wormhole: https://erock.io/2021/08/27/a-critique-on-project-management-software.html\n\n**Location**: remote\n\n**Elevator Pitch/Explainer Video**: Wormhole is a playground for team collaboration and project management.\n\n**What life cycle stage is your startup at?**: Discovery\n\n**Your role?**: Solo Founder\n\n**How could r/startups help?**: read my blog article and provide feedback or signup for to the newsletter",
            "score": 1,
            "author": "qudat"
        },
        {
            "level": 0,
            "comment": "Startup Name : P2P Solutions\r  \n\n\nURL: https://www.p2psolutions.co.in/startupkit\r  \n\r  \nLocation of Your Headquarters : Delhi\r  \n\r  \nElevator Pitch : A  startup kit for entrepreneurs that provides the optimal set of tools required at the startup stage\r  \n\r  \nMore details: It provides systems that serves the basic needs to help entrepreneurs track their business and provide reports for their analysis. The goal is to have the automated systems take care of internal business functions to keep the business healthy and growing.\r  \n\r  \nWhat life cycle stage is your startup at? Discovery\r  \n\r  \nYour role? Founder\r  \n\r  \nWhat goals are you trying to reach this month? More Signups \r  \n\r  \nHow could r/startups help? Help to reach more audience. More feedback, sharing your challenges in scaling your business\r  \n\r  \nDiscount for r/startup subscribers? Depending on your most challenging business function , we will share one system free for you.  \r  \n\r  \nShare how our community can get a discount - Put your reddit username in Comments box on the form. We will check if you are member of r/startups.",
            "score": 1,
            "author": "reachyourpotential",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name:** Bunking ([https://www.bunking.com/](https://www.bunking.com/))\n\n  \n**Location:** Ottawa, Canada  \n\n\n**Pitch:** Bunking will be a revolutionary marketplace that will make it possible for you to connect with like-minded people from all around the world. We are presently in stealth mode, designing an extraordinary marketplace through design thinking that will redefine shared living. For the first time ever, you will be able to book long term or short term accommodations with a group of people that share your interests and match your energy.  \n\n\n**More Details:** STAGE: We are in discovery in the midst of building our MVP, which is scheduled to launch this fall! MY ROLE: I am apart of the social media team looking to create engagement and spread the word.  \n\n\n**Goals:** We are trying to increase our following across all social medias. It would mean a lot if you guys could even just check these pages out! ([https://www.facebook.com/bunkinglife](https://www.facebook.com/bunkinglife) / [https://twitter.com/bunkinglife](https://twitter.com/bunkinglife) / [https://www.linkedin.com/company/bunking/](https://www.linkedin.com/company/bunking/)  / [https://www.instagram.com/bunkinglife/?hl=en](https://www.instagram.com/bunkinglife/?hl=en))   \n\n\n**Discount:** We are currently in talks about creating a referral program for our users.",
            "score": 1,
            "author": "Carter_Bunking"
        },
        {
            "level": 0,
            "comment": "* **Startup Name / URL:** [Campaignware](https://campaignware.com/)\n* **Location of Your Headquarters:** Sydney, but we're worldwide!\n* **Elevator Pitch:** A platform to help businesses engage with their social audience and grow their email list - through a huge range of free digital content campaigns, from quizzes, trivia, polling, surveys, user generated content and much more. At a low cost with no code.\n* **Explainer Video:** [https://youtu.be/RPbsKDFy4ss](https://youtu.be/RPbsKDFy4ss)\n* **More details:** Bootsrapped, post-revenue, Freemium subscription SaaS\n* **Your role:** Founder\n* **What goals are you trying to reach this month?** We just launched on [Product Hunt](https://www.producthunt.com/posts/campaignware), would love an upvote there, but we're hyper focussed on user acquisition, so feel free to sign up for a [free account](https://admin.benchvote.com/#!/signup?planId=free_monthly_USD)!\n* **How could** r/startups **help?** Any who's interested in partnering with us to deliver value to their audience is more than welcome to join our Partner Program \n* **Discount for** r/startup **subscribers?** 50% off a paid plan for 3 months, sign up using the link above, then just drop a message on our live chat and we'll get that sorted for you :)\n\nThanks!",
            "score": 1,
            "author": "robotocha"
        },
        {
            "level": 0,
            "comment": "Hi friends! We are [Operance](https://Operance.co). A suite of tools allowing freelance work to feel truly free. \n\nYou can sign up [Here](https://operance.co/signup) absolutely free with no commitment. \n\nElevator Pitch \n\nOperance helps freelancers and agencies with day-to-day operations and analytics allowing them to focus on what really matters. We offer CRM, invoicing, job tracking, timesheets, in-app messaging, financial analytics, key metrics, budgeting, reporting, and will have integrations with Stripe, Quickbooks, Xero, and Slack. \n\nMore details\n\nCurrently in validation stage. Our users and customers are the most important part of our business and their feedback is absolutely crucial to see what features we can add or how we can make their life easier. \n\nWhat goals are you trying to reach this month?\n\nOur goal this month is to sign up 100 users. We offer a free version and then three tiered paid plans that unlock chat, time tracking, and reporting features. \n\nR/startups community would be super helpful in giving our product a try and providing any feedback on features we should add or changes that would be beneficial to freelancers and agencies. \n\nDiscount for R/startups subscribers\n\nWe are offering all subscribers from R/startups a 3 month free trial to any of our paid monthly plans. Use code STARTUPS for 3 free months!",
            "score": 1,
            "author": "profitly_"
        },
        {
            "level": 0,
            "comment": "Hi friends :)\n\n**Startup Name:** Sidekick\n\n**URL:** [http://thesidekick.app/beta](http://thesidekick.app/beta)\n\n**Location**: New York\n\n**Elevator Pitch**: Block distractions and work towards the things that matter the most.\n\nSidekick is how you take back control of your most valuable resource, time. As the world gets increasingly distracted, we must be intentional with how we spend our time because once it's gone, it's gone forever.Sidekick is a productivity tool to help you limit internet distractions and immerse in deep work. You can set goals, schedule deep work sessions, and block distracting sites.By emphasizing your long term goals and building a sustainable work ritual, you intentionally work on what matters the most to you and make the most of your time\n\n**What life cycle stage is your startup at?** Validation. Launched Private Beta, have a small group of recurring users. Lots of new features in the work.\n\n**Your role?** Co-founder\n\n**Goal:** 100 users!\n\n**How could** r/startups **help?** 🙏 Please try Sidekick out and let us know what you think. Feedback please!**Discount for** r/startup **subscribers?** It's free! DM me to skip the waitlist or join the waitlist at [http://thesidekick.app/beta](http://thesidekick.app/beta).\n\nThanks for reading, A.",
            "score": 1,
            "author": "Particular-Chip1038"
        },
        {
            "level": 0,
            "comment": "**Name:** Bespoke Technology\n\n**URL:** [https://bespoke.tech](https://bespoke.tech)\n\n**Location:** Newcastle, Australia\n\n**Pitch:** Bespoke Technology focuses on providing holistic technology solutions backed by high levels of customer service from our amazing team of technicians. Our team are specialists in IT service management, and we work to implement technology to enable businesses to focus on the important stuff while we take care of the technical stuff.\n\n**Looking for:** Users and feedback.",
            "score": 1,
            "author": "bespoketech-8"
        },
        {
            "level": 0,
            "comment": "Start-up name: CryoComics\n\nWebsite: CRYOComics.com (not active)\nLocation: Maine\n\nElevator pitch: Comic book creation website using drag and drop function.\n\nMore details: Just started working on a basic website design intended to be used for pitching my idea to potential investors.\n\nMy Role: Idea man.\n\nGoals for the Month: Try to find investors.",
            "score": 1,
            "author": "yankowsky02"
        },
        {
            "level": 0,
            "comment": "**Startup Name:** DrapCode ([https://drapcode.com](https://drapcode.com))\n\n**Location**: London, UK &amp; Noida, India.\n\n**Pitch/Video:** DrapCode is a No-Code Web App Development Platform to build and launch full-fledged Web Applications without writing any line of Code. Users can also export the source code and host the apps in their environment/servers if needed. So you can go from no-code to pro-code with [DrapCode](https://drapcode.com) :)\n\n**Intro Video:** [https://www.youtube.com/watch?v=d7JWzFWHNuA](https://www.youtube.com/watch?v=d7JWzFWHNuA)\n\n**Status**: We are currently live with our MVP and are into the prodict-market-fit validation phase.\n\n**Goals**: Looking to add 10+ paying users this month. Get more and more feedback from early users.\n\n**Discount for Subscribers:** We are currently not charging anything with the early users and we do have a free plan for whoever wants to build and launch no-code web apps. So its free for you!",
            "score": 1,
            "author": "voss_steven"
        },
        {
            "level": 0,
            "comment": "**Startup Name:** Wylo | https://www.wyloapp.com\r  \n\r  \n**Location of Your Headquarters:** Chennai, India\r  \n\r  \n**Elevator Pitch/Explainer Video:** Wylo is an interest-based social network that lets you explore your fav topics &amp; connect with like-minded people in the most effective way.\r  \n\r  \nMany people don’t get to do what they love. Be it studies, a hobby or side-gig or job. Upon research, I found three major interconnected reasons why this happens: Lack of exposure, difficulty in finding like-minded people, and the overwhelming nature of the internet.\r  \n\r  \nSo we built a platform that would ease the three problems above. Thereby, we make it easier for people to chase their passion.\r  \n\r  \n**Check out our** [**product teaser**](https://www.youtube.com/watch?v=BtO7UmnDAkc)\n\nRaised pre-seed, launched the app in India, and have more than 30K users currently.\r  \n\r  \n**Looking for:** Feedback, networking",
            "score": 1,
            "author": "thenamestaken1"
        },
        {
            "level": 0,
            "comment": "**Name:** *Adjust* [https://adjust.qflair.com](https://adjust.qflair.com)  \n**Location**: New York City\n\n  \n**Elevator Pitch**: Improve your home yoga practice with personalized feedback from experienced yogis. With many yoga studios closed or not offering hands-on adjustments, learning to practice yoga safely is a challenge. With *Adjust*, you can submit a recording of your home practice and have it reviewed by a yoga teacher.\n\n  \n**What goals are you trying to reach this month?** Idea validation. My goal is to understand whether a) yogis are interested in such a service, and b) whether yoga teachers see this as a viable business model for some extra income.  \n**How could** r/startups **help?** Direct feedback on the business idea, or suggestions on how to reach potential users (e.g. specific subreddits, Facebook groups, forums, etc.).",
            "score": 1,
            "author": "mojojojo_24"
        },
        {
            "level": 0,
            "comment": "Startup Name / URL : [2BTech](https://www.2btechinc.com/)  \nLocation of Your Headquarters: Lahore , Pakistan   \nElevator Pitch/Explainer Video : https://www.youtube.com/watch?v=w8sW23AKi3M&amp;ab\\_channel=2btechInc  \nMore details:  \nWhat life cycle stage is your startup at? \n\nValidation   \nYour role? \n\nCoFounder   \nWhat goals are you trying to reach this month?\n\nTo share my services and knowledge with potential clients   \nHow could r/startups help?\n\nOffering 10% off who share the SS of this snippet on [talha@2btechinc.com](mailto:talha@2btechinc.com)   \nDo NOT solicit funds publicly--this may be illegal for you to do so  \nDiscount for r/startup subscribers?\n\n10%  \nShare how our community can get a discount  \nOffering 10% off who share the SS of this snippet on talha@2btechinc.com",
            "score": 1,
            "author": "talhafakhar"
        },
        {
            "level": 0,
            "comment": "What's up everyone!\n\nI'm creating a $5 a month financial education newsletter.\n\nItll be all about financial tips, theories, analysis, and much more.\n\nI encourage you all to join the waiting list for it through this link\nhttps://financebycwt.wordpress.com/2021/09/22/join-my-newsletters-waiting-list/",
            "score": 1,
            "author": "ZomaticLex"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:** [Dynasty Global Investments AG](https://ieo.dynastygi.com/)  \n**Location of Your Headquarters:** Zug, Switzerland | Sao Paulo, Brazil  \n**Elevator Pitch:** We are Dynasty Global Investments AG. Born in 2016 and established at the Crypto Valley in Switzerland, the most important ecosystem for the fostering  innovation for blockchain companies. Founded by brazilian entrepreneurs but with global focus, Dynasty Global comes to revolutionize the financial market, by combining two powers: Real Estate &amp; Crypto.\n\n**Explainer Video:** https://www.youtube.com/watch?v=jFjSS9r4exw&amp;feature=emb\\_title  \n**More details:** Basically, Dynasty owns real estate assets located in the most prestigious financial centres around the world and rents them to afford the buy-back and burn procedure. Also, these properties give an added value to our token, increasing the potential of our project. With the income from the rents coming from these assets – minus administration and maintenance costs – we buy D¥NS on a quarterly basis from the exchanges where we are listed. Finally, we transfer those tokens from Dynasty treasury to a burn portfolio that is specified in our smart contract. When the D¥NS enter the portfolio, they are burned, that means they are destroyed forever from the Blockchain and removed from circulation, which causes scarcity and therefore, more liquidity to our token.  \n**Your role?** Marketing team\n\n  \n**What goals are you trying to reach this month?** \n\nWe are trying to engage more with our international community to build a stronger relationship with clients, people who are interested and future clients.  \n**How could** r/startups **help?** By getting more interactions and any sort of feedback**.**\n\n&amp;#x200B;\n\n**Come join us!**",
            "score": 1,
            "author": "DynastyGlobal"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL** \\- [Code&amp;Jobs](https://www.codenjobs.com/)\n\n**Location of Your Headquarters** \\- Remote\n\n**Elevator Pitch** \\- We are a startup that intend to help users (job seekers, recruiters) with our profile share and easy job search features etc.  You can test our [Telegram bot](https://t.me/codenjobsbot) that shows our service to help our users and [channel](https://t.me/codenjobs) for instant job notifications.\n\n**More details:** The worldwide network to help you find a job and candidate\n\n**What life cycle stage is your startup at? -** Validation**What goals are you trying to reach this month?** \\- Reaching to companies to share jobs and find business partners to share at our website to advertise their services\n\n**What goals are you trying to reach this month? -** Organize payment part to receive cryptocurrency.\n\n**How could** r/startups **help?** Feedback, partner request or invest\n\n**Discount for** r/startup **subscribers?** You can get a referral or cryptocurrency later**Share how our community can get a discount -** Help us improve and actively participate to the website and you will get a share of our profit",
            "score": 1,
            "author": "codenjobs"
        },
        {
            "level": 0,
            "comment": "**Startup Name** : UptimeLive\n\n  \n**URL** : [https://uptimelive.com](https://uptimelive.com)\n\n  \n**Location of Your Headquarters** : Belgrade, Serbia\n\n  \n**Elevator Pitch** : Easy &amp; reliable uptime and performance monitoring solution, with highly customizable and fast status pages.\n\n  \n**More details:** Unlike our competitors we decided to listen to our users and try and work with them in order to meet all of their needs for a service like this. That is the sole reason why we cam up with some unique features for the product like performing checks from multiple different locations. Adding not only SSL certificate expiry monitoring but also notifying you up to a month before your domain expires too. We have added highly customizable status pages hosted by us , on your own domain, so your users can always check where the problem is. We have also added webhook support to notify you by slack or discord if that is what you prefer. And of course hearthbeats, that always make sure that your cronjobs are up to date and working!\n\n  \n**What life cycle stage is your startup at?**\n\n Currently at the validation stage, looking to grow our userbase even more and get even more input on how to improve before scaling.\n\n  \n**Your role?** Founder  \n\n\n**What goals are you trying to reach this month?**\n\n We are currently sitting at a little over 30 paying users, so breaking 50 by the end of the month would be awesome!\n\n  \n**Discount for** r/startup **subscribers?**  \n\u0010There is a pretty generous free plan for anyone willing to register and try out the service.  \nIf you guys have any request , tips or opinions to share feel free to reach out either thru here or the livechat on our website. You can also shoot us an email to hello@uptimelive.com",
            "score": 1,
            "author": "rbitar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL** \\- Rapidr ([https://rapidr.io](https://rapidr.io))\n\n**Elevator Pitch** \\- Make better product decisions with customer feedback. Complete the entire feedback lifecycle from Product Ideation, Roadmap, Strategy to Releases.\n\n**What life cycle stage is your startup at?** Early traction. Looking for customers to give us critical feedback.\n\n**Your role?** Founder.\n\n**What goals are you trying to reach this month?** \\- Kickstart our content marketing &amp; SEO plans- Ship a big feature we're working on for the last month or so.\n\n**How could** r/startups **help?** Seeking critical feedback. Looking for early adopters to help us build an even better product.\n\n**Discount for** r/startup **subscribers?** Happy to give early-bird discounts, just reach out to me personally on rajat \\[at\\] [rapidr.io](https://rapidr.io) or support \\[at\\] rapidr.io.",
            "score": 1,
            "author": "thisisrajat",
            "replies": [
                {
                    "level": 1,
                    "comment": "The style of the landing page is great and I really Luke the idea.",
                    "score": 1,
                    "author": "albierto",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Name: MyDone  \nURL: https://www.mydone.io  \nLocation: Ukraine / Will be fully remote  \nPitch: 95% of startups shouldn't fail.  \nStage: Launched Alpha on ProductHunt - https://www.producthunt.com/posts/mydone  \nLooking for: beta users, feedback.  \nMore details - We are all hands on building Beta version at the moment, and in parallel we are doing user interviews to discuss problems which are most annoying. If you’d like to share some of your pains please let us know, we would be happy to talk!  \nRole - Co-founder and CEO  \nWhat goals are you trying to reach this month? - Get feedback on current functionality and lunch Beta version.",
            "score": 1,
            "author": "vdemkiv"
        },
        {
            "level": 0,
            "comment": "**Name**: [Murmel](https://murmel.social)\n\n**URL**: [murmel.social](https://murmel.social)\n\n**Elevator pitch**: Stop scrolling endlessly around Twitter. Get the top news and stories shared by your Twitter friends in one daily email \n\n**Current stage**: Available to use\n\n**Location**: Bavaria, Germany\n\n**Looking for**: Feedback - We are improving the service and adding features every week, curious to get your opinion on it :)",
            "score": 1,
            "author": "preslavrachev"
        },
        {
            "level": 0,
            "comment": "**Startup**  Groove\n[GetGroove.app](https://www.getgroove.app)\n\n**HQ**  Miami, FL\n\n**Pitch**  The app for your offline social life with a live heatmap of venues in your city\n\n**More Details**  \nGroove provides real-time information to help you decide where to go to have the best time. No game mechanics to generate exhaustive screen time. We aim to create a social utility for users that elevates experiences and relationships in the physical world. \n\nGroove will be free to download with basic information available to all. Groove will also have an private, referral-based network to foster an intimate community of like-minded individuals.\n\n**Stage**  Building MVP &amp; growing waitlist to create community around product\n\n**Role**  Founder\n\n**September Goal**  \n• 10K waitlist sign ups \n• Solidify 10 bar partnerships\n\n**Reddit help**  \n• Sign up, please :-)\n• Would love to chat with anyone who has a background in GIS &amp; sensory hardware!",
            "score": 1,
            "author": "GetGrooveApp_Please",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup:** [Zentser](https://www.zentser.io/)\r  \n\r  \n**HQ:** Boston, MA\r  \n\r  \n**Elevator Pitch:** Automate with hardware.  Zentser enables air, soil, gas, and other sensors to alert you on your mobile device. \n\nUse sensors in your home, hobbies, and work. Get historical readings, see measurement trends, and uncover hidden insights.\r  \n\r  \n**Explainer video:** [https://youtu.be/KI\\_dFZoT4uk](https://youtu.be/KI_dFZoT4uk)\r  \n\r  \n**Life cycle stage:** Validation\r  \n\r  \n**Your role:** Co-founder\r  \n\r  \n**How could** r/startups **help?**\r  \n\r  \nLooking for feedback. If my idea gives you any kind of reaction, positive or negative, let me know?\r  \n\r  \n**Discount for** r/startup **subscribers?**\r  \n\r  \nZentser is free for up to three devices. Reach to me directly if you want to measure more.",
            "score": 1,
            "author": "Zentser"
        },
        {
            "level": 0,
            "comment": "A perfectly Form Fit mouse, all from a simple picture of your hand.\n\nhttps://www.formify.ca/\n\nAny interest/critiques appreciated! Feel free to DM me I'm team lead.",
            "score": 1,
            "author": "WillMacFormify",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is interesting.\nI wonder how precise the dimensions are with just a picture",
                    "score": 1,
                    "author": "IntelligentLeek123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looking for early users(free access) and feedback.\r  \n\r  \n**Name**: cliff.ai\r  \n\r  \n**URL**: www.cliff.ai\r  \n\r  \n**Location**: London, GB\r  \n\r  \n**Pitch**: World's first Business Reliability Platform- track unexpected changes in your metrics without setting up dashboards.\r  \n\r\r  \n\r  \nThanks in advance!",
            "score": 1,
            "author": "Berserk_l_"
        },
        {
            "level": 0,
            "comment": "CityFALCON / [cityfalcon.com](https://www.cityfalcon.com?utm_source=reddit&amp;utm_medium=medium&amp;utm_campaign=ao_startup)\n\nUnited Kingdom, Ukraine, Malta\n\nLife cycle stage of the startup: Profit Maximization\n\nFinancial news platform/app. We are in stage of having released many [new features](https://www.cityfalcon.com/blog/the-startup-journey/new-web-mobile-features-for-first-half-2020/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=ao_reddit_startup) last year and we continue to constantly improve our infrastructure, coverage and increase our revenues\n\nLooking for feedback and new clients",
            "score": 1,
            "author": "mr_j_b",
            "replies": []
        },
        {
            "level": 0,
            "comment": "  \n**🔥 BurnerPage**  \n[https://burnerpage.com](https://burnerpage.com)\n\n  \n**Elevator Pitch**  \nBuild burner pages in &lt;60 seconds to rapidly validate business ideas.\n\n  \nEverything from page design to survey generation to metrics tracking and campaign assistance is built in. I previously used this exact lean validation method to grow and sell my previous startup Aviary to Adobe.\n\n  \n**Explainer Video:**  \n[https://www.youtube.com/watch?v=jskkyWc0-iI](https://www.youtube.com/watch?v=jskkyWc0-iI)\n\n  \n**Location of Your Headquarters:**  \nRemote (but I'm in NYC)\n\n  \n**What life cycle stage is your startup at?**  \nJust launched 2 months ago into public beta. It was #1 on ProductHunt for the day. \n\n**Your role?**  \nFounder  \n**-What goals are you trying to reach this month?**  \n\\- I want the site to be fully customizable so that all different types of landing pages can be build.  \n\\- I want to figure out new acquisition channels with promising unit metrics.  \n\n**How could** r/startups **help?**  \nTry the site out and let me know if it works well  \n1. Were you able to create a simple responsive page in under 60 seconds?  \n2. Could you easily build and attach surveys?  \n3. Do you know how to publicize your pages online using the campaigns feature?  \n4. Did you encounter any bugs?  \n\n\n**Discount for** r/startup **subscribers?**  \nI have 50% off the cost as part of the beta launch.",
            "score": 1,
            "author": "jaxomlotus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just used this…. Amazing, and literally what I am looking for. This is so simplistic and perfect for what I need. Like you literally saved me so much time and effort this is so well made and convenient I love ittttt.",
                    "score": 1,
                    "author": "GIueStick",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Name: The Full Stack\n\nURL: [https://thefullstack.network](https://thefullstack.network/invite/rstartups21)\n\nHQ: \nDublin, Ireland\n\nElevator pitch: \nThe Full Stack is a professional network built for software engineers to find and show off work, connect and collaborate with engineering teams and build personal brand to discover high quality opportunities in tech.\n\n- Showcase you and your projects on a professional network specifically for Software Engineering.\n- Connect with like minded engineers and build a more meaningful network (without the spam)\n- Don’t let your work get overlooked, let it connect you to opportunities from Teams and Engineering Managers looking for engineers just like you.\n- Unlike other networks liked LinkedIn, (there are no recruiters, sorry recruiters) when \"real\" engineering hiring managers reach out to you on The Full Stack, you get paid into your wallet for reading and responding to opportunities, putting you in control.\n\nLifecycle: Growth\n\nGoals: \nIncrease sign ups to gather community feedback, iterate and learn \n\nLooking for: \nWould appreciate feedback, different perspectives and visibility.",
            "score": 1,
            "author": "danoely",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:** Bot Market  \n\nWebsite - [https://www.botmarket.app/](https://www.botmarket.app/)  \nApp Store - [https://apps.apple.com/us/app/bot-market/id1512178327/](https://apps.apple.com/us/app/bot-market/id1512178327/)  \nGoogle Play - [https://play.google.com/store/apps/details?id=com.gomasko.botmarket](https://play.google.com/store/apps/details?id=com.gomasko.botmarket)  \nApp Gallery - [https://appgallery.huawei.com/#/app/C104563535/](https://appgallery.huawei.com/#/app/C104563535/)\n\n**More details:**  \nBot Market is a mobile application that allows you to search for chatbots for specific platforms. For chatbot developers, Bot Market provides the ability to promote their chatbots.  \n\nOur world is dynamic and as we see lots of chatbots are being created right now. Some of these chatbots are very useful but others are not working properly and are poor in necessary functions. The main purpose of our application is to find the right chatbot you need.  \n\nThis application includes a search, rating, and comment system. Each chatbot has at least a description, categories, and chat links.  \n\n**What life cycle stage is your startup at?** MVP launched\n\n**Role:** Founder\n\n**How could** r/startups **help?**  \nI need your opinion and feedback! Share this with the chatbot developers!\n\n**Discount for** r/startup **subscribers?**  \nWe have profitable introductory subscription prices now! Join us!",
            "score": 1,
            "author": "gomasko"
        },
        {
            "level": 0,
            "comment": "Hi everyone.\n\n**Name:** Right Financials\n\n**URL:** [https://getright.app/](https://getright.app/)\n\n**Location:** Alberta (Canada), Delaware (USA)\n\n**Pitch:** Right Financial is a fully automated solution that helps you to manage your money in a way that no one other bank does. We focus not only on automation of regular banking processes, but our app communicates to clients based on their psychological profile and helps each individual to achieve great saving results by helping clients to form the right habits towards money.\n\n**How startup community can help out:**\n\nFor each influencer or person with a big network who can bring clients, we are ready to provide a permanent percentage of the revenue from the group of clients that you will bring. You can create a permanent full-time income from being with us, instead of just a 1-time affiliate payout.\n\n**Benefits we can provide:**\n\nFor each influencer or person with a big network who can bring clients, we are ready to provide a permanent percentage of the revenue from the group of the clients that you will bring. You can create a permanent full-time income from being with us, instead of just a 1-time affiliate payout.\n\nAlso would be nice to hear some feedback on the website.",
            "score": 1,
            "author": "daniel-polyakov",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Name:** Tapline\r  \n\r  \n**URL:** [https://tapline.io](https://tapline.io)\r  \n\r  \n**Location:** Berlin, Germany\r  \n\r  \n**Elevator Pitch:**\r  \n\r  \nWe enable SaaS entrepreneurs access to frictionless capital.\r  \n\r  \nTapline is a funding and trading platform that enables companies with recurring revenues to receive non-dilutive, non-debt funding while providing investors with an attractive 12-month return. To do this, we turn your monthly subscriptions into instant capital. Hassle-free and without any involvement of your subscribers.\r  \n\r  \nStage: Just got small pre-seed funding, MVP launching in December.\r  \n\r  \n**My role:** Co-Founder &amp; CTO\r  \n\r  \n**Goals &amp; Looking for:** 1. All SaaS or recurring revenue startups who would be interested in alternative funding sources and want to learn more. 2. Investors (institutional or private) that would be interested in a new fixed-income assets class or want to share their experience dealing with such companies.\n\nAdditionally we are looking for Full Stack Engineers. If you want to help building a startup from day0, reach out under [https://tapline.io/careers](https://tapline.io/careers)\n\n\r\r  \nDiscount for r/startup subscribers: On launch, we will wave the transaction fee for the first users on the waiting list.",
            "score": 1,
            "author": "dml1337",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Name:** [Scanops Antivirus](https://scanops.net)\n\n**Location:** Raleigh, NC\n\n**Elevator Pitch:** Scanops is an antivirus scanning API for developers. Websites and apps that accept user uploads without checking for viruses put their users and systems at a huge risk of spreading malware. Scanops lets you prevent this by integrating antivirus scans into your own code via our REST API, which is powered by multiple antivirus engines.\n\n**Life Cycle Stage:** Validation - our MVP is launched and were are refining our product based on user feedback.\n\n**Goals This Month:** Finish converting to a per-customer dedicated hosting model, which was the most desired change from our customer feedback.",
            "score": 1,
            "author": "Scanops"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:** [Snappy Form](https://snappy-form.com) \n\n**Location of Your Headquarters:** Russia \n\n**Pitch:** Form builder that will solve and simplify the task of collecting and analyzing data for everyone. Snappy Form works in Drag&amp;Drop format and allows to quickly add all the necessary question blocks. \n\n**More details:**\n\nMain functions of Snappy Form\n\n* Easily add new blocks using the drag&amp;drop feature;\n* Embed a form on the website or share a link to the form;\n* Restrict the access to the form by time or the number of responses;\n* Customize the style of forms;\n* Get email notification of new replies. The message body can be customized and made dynamic;\n* Export answers to XLSX, CSV;\n* Redirect upon completion of filling out the form;\n* Ready-made templates;\n* And much more.\n\n**Stage:** MVP \n\n**Role:** founder \n\n**Monthly goals**: 100 users, new feauters \n\n**How could** [**r/startups**](https://www.notion.so/r/startups) **help?** Try the product and give feedback",
            "score": 1,
            "author": "Bright_Surround_9955"
        },
        {
            "level": 0,
            "comment": "\n    Startup Name / URL\nTaskade (https://taskade.com)\n\n    Location of Your Headquarters\nRemote / Global / San Francisco, Singapore, New York\n\n    Elevator Pitch/Explainer Video\nhttps://youtube.com/taskade\n\n    More details:\n        What life cycle stage is your startup at?\nSeed Stage Y-Combinator Backed Startup\n\n        Your role?\nCofounder, CEO\n\n    What goals are you trying to reach this month?\nRelease our latest layout updates and improvements for real-time organization and communication with collaborative mindmapping and kanban boards on web, desktop, and mobile.\n \n        How could r/startups help?\nSend over any feedback to https://taskade.com/feedback or /r/taskade\n\n        Share how our community can get a discount\nDM for discounts and free upgrades here or contact us directly on https://taskade.com/pricing and mention Reddit!",
            "score": 1,
            "author": "Johnxie"
        },
        {
            "level": 0,
            "comment": "Hey Community!\n\nWe have re-launched our Product:\n\n**Doubletick for Gmail** \\- [https://www.getdoubletick.com](https://www.getdoubletick.com)\n\nGet WhatsApp like Read-Receipts in Gmail when recipient opens your Email\n\nDoubletick is the only email tracking tool, which does not access your mailbox, you can track your emails without permitting full-mailbox access.  \nDiscount for r/startup subscribers? - [Get life-time deal](https://appsumo.com/products/doubletick-for-gmail/)\n\n**or** \n\nGet 25% discount on Doubletick Pro Annual Plan -- Use Code **\"STARTUP25\"** on checkout page.",
            "score": 1,
            "author": "karanshinde"
        },
        {
            "level": 0,
            "comment": "*Startup Name: Remote &amp; Relax (ReRe)\n\n*Location: Remote/Vietnam\n\n**Pitch:** \nFor digital nomads/remote workers, ReRe is a team of locals organizing community based work and travel programs in Vietnam. Our trips are mindfully crafted to bring out the best of Vietnam and digital nomad life.\n\nWe're also building a website that aggregates and streamlines all information you need to know about digital nomading in Vietnam (Visa, Covid, policies, guides, etc.), so you can save your time researching. \n\n*Explainer Presentation: https://bit.ly/3hlzAqX\n\n**Looking for: Your feedback would be truly appreciated",
            "score": 1,
            "author": "alex_nlnb"
        },
        {
            "level": 0,
            "comment": "Company name: The Company App ([https://joincompany.io](https://joincompany.io)\n\nLocation: remote\n\nStage: validating idea, just completed mvp and in beta testing\n\nElevator pitch:\nMeet new friends who share your interests in a small group setting (max size of 8). Large groups/forums can often be intimidating especially for new members to post, and often have a lot of noise and it's easy for your voice to get lost. In smaller groups, you can create deeper, closer relationships and have real conversations around your passions.",
            "score": 1,
            "author": "2TitanUp7"
        },
        {
            "level": 0,
            "comment": "**Name:** Chrome Extension Ideas\n\n**URL:** [https://chromeextensionideas.substack.com/subscribe](https://chromeextensionideas.substack.com/subscribe)**Pitch:** A newsletter where we share demand-based chrome extension ideas.\n\nSo when you launch your product, you have a hungry audience waiting for your solution. This will help you reach product-market-fit way faster.\n\n**Life Cycle Stage:** Validation\n\n**My Role:** Creator and Curator.\n\n**Goals:** Reach 500 free subscribers.\n\n**How could** r/startups **help?** By subscribing to the newsletter and providing feedback.\n\n**Discount?** You can subscribe for free.\n\nThank you :)",
            "score": 1,
            "author": "Honeysyed"
        },
        {
            "level": 0,
            "comment": "**Name:**\n\n[Occasional.ly](https://occasional.ly/get-occasional-ly)\n\n**Location of Your Headquarters:**\n\nAnn Arbor, MI\n\n**Elevator Pitch:**\n\nWe all know remembering birthdays, anniversaries, and holidays is difficult on its own. Furthermore, remembering special occasions and then buying thoughtful, personal gifts is quite stressful in today’s time-poor society. Introducing Occasional.ly. Occasional.ly allows users to expedite the gift-giving experience with custom reminders and “gift” recommendations. Occasional.ly helps these “gifters” breeze through their to-do list in a fast-paced environment with an effortless and welcoming user experience, helping them feel in-control, zen, and accomplished - “like a boss”- ultimately allowing them to spend less time gift shopping and more time gift giving.\n\n**More details:**\n\nValidation\n\nSoftware Engineer\n\n**What goals are you trying to reach this month?**\n\nIdentify 2-3 areas of potential product improvement to result in significant increase in onboarding/adoption rates\n\nIncrease our user base by 100 users\n\n**Discount for** r/startup **subscribers?**\n\nIt’s free!",
            "score": 1,
            "author": "LukasDevDog",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Name:** Evendo\n\n**URL:** [https://www.evendo.com](https://www.evendo.com)\n\n**Location:** London, United Kingdom\n\n**Pitch:** Evendo is everything you need to arrange better events and celebrations. By combining the World's biggest marketplace for Event-related products with a suite of easy-to-use tools, you will be choosing between 100,000's bookable activities, experiences, venues, restaurants, transportation, party equipment, motivational speakers, and entertainers. Make your next event unforgettable with Evendo.\n\n**Looking for:** Users and feedback.",
            "score": 1,
            "author": "evendo-1"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:** Honest Math: [https://www.honestmath.com](https://www.honestmath.com) \n\n**Location of Your Headquarters:**  Overland Park, KS\n\n**Elevator Pitch:** We built a professional-grade monte carlo retirement simulator for everybody. Most online \"retirement calculators\" and FIRE tools are very flawed. We love seeing the growth of the financial independence movement, but it bothers us tremendously that some of the most popular tools on the internet are terribly ill-suited for serious long-term planning. So, we aimed to provide investors with better information and software. \n\n**More details**: With flexible portfolio settings, customizable investment parameters, and enhanced statistical modeling (including \"Fat Tails\"), Honest Math offers users a free, high-powered alternative to traditional “retirement calculators.”\n\n**Life cycle stage:** We just launched the MVP a few days ago.\n\n**My role:** Founder\n\n**What goals are you trying to reach this month?** Build up our following across social media and obtain new sign-ups on the website.\n\n**How could** r/startups **help?** Not sure! I'm new to reddit.\n\n**Discount for** r/startup **subscribers?** We're free for everybody. Anybody can sign up and begin running unlimited portfolio simulations immediately.",
            "score": 1,
            "author": "HonestMathAdmin"
        },
        {
            "level": 0,
            "comment": "**lockrMail** [https://lockrmail.com/](https://lockrmail.com/)\n\n**Elevator Pitch:** lockrMail is a free productivity tool that acts as a pre-filter for your inbox, providing you with a unique and secure email address to use online. Customizable and automated filters enable you to decide which brand emails come to your inbox(es) and which are blocked.\n\n**Explainer Video:** [Intro to lockrMail](https://www.youtube.com/watch?v=b6mXHW3UGqo)\n\n**Location of your HQ:** Fully remote team but I’m based in the tri-state area.\n\n**What life cycle stage is your startup in?** lockrMail launched in private Beta in January 2021, expanding to the public in May 2021 with a launch on Product Hunt (#2 product for the day). We are in the scaling / growth phase of our life cycle, looking to drive significant user adoption over the coming months.\n\n**Your role:** Founder &amp; CEO\n\n**What goals are you trying to reach this month?** Our primary goal this month is to drive user adoption and spread the word about lockrMail. We are also refining our product offering and are looking to elicit helpful feedback on our product utility and desirable features for the future of our roadmap.\n\n**How could** r/startups **help?** We would love for the r/startups community to [create a lockrMail account](https://app.lockrmail.com/reddit-startup), test our product and provide feedback. lockrMail provides you with a public-facing email address to use online and the ability to enact automated or customized filters across your senders, taking back control of your inbox. So if you’re overwhelmed by email and looking for a tool to help, we’d love you to try lockrMail.\n\n**Discount for** r/startups **subscribers?** lockrMail is a free product with no cost to sign-up. While we typically have a month-long waitlist, I have set-up an instant access link for r/startup subscribers. Simply click here to create your account: [https://app.lockrmail.com/reddit-startup](https://app.lockrmail.com/reddit-startup)",
            "score": 1,
            "author": "lockrMail"
        },
        {
            "level": 0,
            "comment": "Startup Name - Niccolo Marketing\n\nURL - [https://www.niccolomarketing.co.uk](https://www.niccolomarketing.co.uk)\r  \n\r  \nLocation of Your Headquarters - Edinburgh, United Kingdom\r  \n\r  \nElevator Pitch - Creative content writers for the energy and recruitment industries\r  \n\r  \nWhat life cycle stage is your startup at? Efficiency - everything works and scaling is starting soon.\r  \n\r  \nHow could r/startups help?\n\nAlways interested to hear about copywriting tools\r  \n\r  \nDiscount for r/startup subscribers?\n\nMention r/startup for 25% off of our copy services.",
            "score": 1,
            "author": "EnergySolutionsUK"
        },
        {
            "level": 0,
            "comment": "Hey there! \n\n&amp;#x200B;\n\n**Startup Name / URL -** [Presentii](https://presentii.com/)    \n**Location of Your Headquarters -** London Ontario, Canada  \n**Elevator Pitch/Explainer Video -** Pesentii measures audience interest as you present, providing great insights for a presenter. Check it out:\n\nhttps://www.youtube.com/watch?v=AtXxG7aUscg  \nMore details:  \n**What life cycle stage is your startup at?** We [just launched](https://www.producthunt.com/posts/presentii) and we are running a free trial to get users on the platform exploring how Presentii can help.  \n**Your role?** Project Manager  \n**What goals are you trying to reach this month?** Our goal is to build up strong advocates and users on the platform   \n**How could** r/startups **help?** Explore the platform, let me know what you think and whether it might be interesting for you to use.   \n**Discount for** r/startup **subscribers?** As mentioned, the platform is currently **FREE**. Check it out!",
            "score": 1,
            "author": "katie-deeee"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**  \n[DoTheySupportIt.com](https://www.dotheysupportit.com)\n\n  \n**Location of Your Headquarters**\n\nUnited States  \n**Elevator Pitch/Explainer Video**\n\nTrack influential people's stances on bitcoin, ethereum, and other cryptocurrencies.  \n**More details:**\n\nWe're focused on documenting and categorizing the stances prominent politicians and other famous people have taken when it comes to cryptocurrency.\n\n  \nEvery stance (or publicly accessible comment) that someone has made about cryptocurrency is given a score between 1 and 5:  \n1 - Very Against Crypto  \n2 - Somewhat Crypto  \n3 - Neutral Towards Crypto  \n4 - Somewhat Pro Crypto  \n5 - Very Pro Crypto\n\n  \nTo determine a person's overall score, the average of these stances is calculated. Sometimes this behavior is overridden (for example, if a person makes negative comments but then later on changes their stance).  \nScores are assigned by thought leaders and policy experts in the cryptocurrency space. You'll see the individual responsible for a ranking and any additional commentary they have below each stance.  \nSometimes, when no expert has weighted in on a given stance, the team that maintains DoTheySupportIt.com will attempt to categorize a stance. These categorizations are always superseded by any policy expert takes.  \n**What life cycle stage is your startup at?**\n\nJust launched!  \n**Your role?**\n\nSole developer  \n**What goals are you trying to reach this month?**\n\nSpreading awareness about the launch! Would love for this resource to help other people learn about their respective representative's stance on crypto.  \n**How could** r/startups **help?**\n\nSpread the word!",
            "score": 1,
            "author": "DoTheySupportIt"
        },
        {
            "level": 0,
            "comment": "**Name:** Autoly\n\n**URL:** [https://autoly.io](https://autoly.io)\n\n**Location:** Mississauga, Canada\n\n**Pitch:** Without the proper knowledge, keeping up with sales, maintenance, and other aspects can prove to be challenging. Hopefully, there is an app that can help you connect you with available vehicles in your region while directing you to services required to preserve your machine — Autoly.\n\nAutoly turns auto trading into a highly entertaining experience using AI technology to make buyer, seller, and owners’ journeys more fun and less stressful.\n\n**Looking for:** Users and feedback.",
            "score": 1,
            "author": "autoly"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Name:**  HypeRooster\n\n**Link:**  [https://hyperooster.com/](https://hyperooster.com/)\n\n**Location:**  Saskatchewan, Canada\n\n**Elevator Pitch:**  Plan your customized sports trip for free by picking your date range and inputting your favorite teams or a city your going to and HypeRooster will show you the best possible sports trips and recommend hotels, tickets, where to tailgate, eat and party! We take all the hard work of planning your ultimate sports trips with friends by cross referencing all leagues and sports teams schedules and doing first hand research to give you advice to ensure you have the best possible experience on your sports trip!\n\nWe are simply die hard sports enthusiasts who love the vibe live sporting events and want to help fellow sports fans get the most out of their sports trips!\n\n**Lifecycle:** Validation - we have gained some traction but need help getting our first \"tranche\" of users/testers to help us refine our platform and to further validate the market need.\n\n**My Role:** Co-founder\n\n**How could** r/startups **help?**  We just recently launched and are are looking for any and all feedback. It would be great to get some advice on how to drive traffic to our site in order to obtain more feedback to help us make the platform better and to further prove our concept.\n\n**Discount:** Our platform is completely free for all users. We hope some of you love sports the way we do and that you see value in HypeRooster!\n\nThank you for the opportunity and your thoughts!",
            "score": 1,
            "author": "Kevinsports36"
        },
        {
            "level": 0,
            "comment": "Hey, I'm Axel, one of the co-founders of MediaNuova, a digital agency based in the canary islands! We have founded the agency as a means to collect like-minded freelancers to pool our strength together and make something special. We are by no means a large corporation, there are 3 founders and we have other freelancers we outsource to help us with our jobs.  \n\n\nWe specialize in social media branding &amp; marketing, web design services &amp; app development. If you need any of the above services, we offer a 20% discount for all fellow Redditors :)  \n\n\nWe are looking for feedback on our website and Facebook page. Please let us know if you have any suggestions on what to improve. Below are the links directly to our website and Facebook.\n\n  \nCheck us out on our socials and if you can, help us and leave us a like or follow!  \nwww.facebook.com/MediaNuova  \nwww.medianuva.com",
            "score": 1,
            "author": "ajawek"
        },
        {
            "level": 0,
            "comment": "Name/URL: [dEDI Incorporated](https://dediinc.com/)\n\nLocation: Nashville, TN \n\nPitch: EDI has served the supply chain well over the past 50 years, but it is time to transition to a modern platform. dEDI is EDI's on-ramp to Web 3.0 built on one of the world's most powerful blockchain's. \n\nPhase: Discovery (Building MVP)\n\nGoals for this month: Drive traffic to crowd funding site. \n\nDiscount: The first $100k get early bird discount of 20% off Valuation Cap. \n\n&amp;#x200B;\n\n*disclaimer: We are 'testing the waters' to gauge investor interest in an offering under Regulation Crowdfunding. No money or other consideration is being solicited. If sent, it will not be accepted. No offer to buy securities will be accepted. No part of the purchase price will be received until a Form C is filed and only through Wefunder’s platform. Any indication of interest involves no obligation or commitment of any kind.*",
            "score": 1,
            "author": "nastydawg6r"
        },
        {
            "level": 0,
            "comment": "[therr.app](https://therr.app)\n\nA Geo-Social Network\n\nI'm the founder and primary developer.\n\nIt's just about ready for MVP\n\nLooking for advice and user feedback",
            "score": 1,
            "author": "zizzle6717"
        },
        {
            "level": 0,
            "comment": "**Name:** GraduGreat\n\n**URL:** [https://www.talentbay.app](https://www.talentbay.app)\n\n**Location:** Munich, Germany\n\n**Pitch:** GraduGreat is Europe's only career platform that connects academics directly with the desired specialist experts in the company. It currently has access to over 600,000 profiles of students and doctoral candidates. The algorithm-based matchmaking takes place between the students and the responsible technical experts of the companies.\n\nGraduGreat is a career networking platform for Gen Y and Z young academics. Tinder-like and lightweight app with AI matching based on a deep understanding of the academic world. It includes a senior team of serial entrepreneurs and recruiting industry professionals. Full remote setup. Angel investments from several active fortune 500 managers.\n\n**Looking for:** Users and feedback.",
            "score": 1,
            "author": "gradugreat"
        },
        {
            "level": 0,
            "comment": "Hi 👋\n\nHow is your day? I hope it's great 👌.\n\nWe build **friendly IT community for everyone |** [Dirask](https://dirask.com/)**.**  ❤️ 💻 🙂\n\nWe help you to solve coding problems for free  **✔️**.\n\nYou can share your coding knowledge via [Dirask - Wiki for Code](https://dirask.com/posts)  **📝**.\n\nYou can ask for help with your coding problems via [Dirask - Coding questions](https://dirask.com/questions) ❓.\n\nYou can share interesting links around coding knowledge from around the internet via [Dirask - Findings &amp; News](https://dirask.com/findings) **😊.**\n\nWe believe coding, sharing and helping others is a better tomorrow  **🚀**.\n\nWhy we do it? Because there is no place to share coding knowledge like we envision it.\n\n**URL:** [https://dirask.com](https://dirask.com/)\n\n**Location:** Krakow, Poland, Europe\n\n**Pitch / Mission:** Organize world's programming knowledge and help software developers to be 10 x more productive  **🔥** .\n\n**Looking for:**\n\n* Investment\n* Hiring (Equity Compensation) - We are looking for passionate people in areas: product building, brand building, marketing, sales and coding (we do not require business experience)\n* Contact: [hello@dirask.com](mailto:hello@dirask.com) (Investment, Hiring)\n\nThanks for reading, see you soon. **✋ 😀**\n\nKrzysztof (Full Stack Engineer at Dirask)\n\n&gt;Let the coding knowledge of Dirask be with you.",
            "score": 1,
            "author": "kriscoder"
        },
        {
            "level": 0,
            "comment": "Promising NFT Project with Real World Use-Case \\[Looking for an Angel Investor\\]   \nMy team and I are working on a promising NFT project that has real world utility. We are a group of artists in coordination with a web development team and a marketing lead.    \nCurrently, we are facing monetary constraints to support operations. So we’re looking for someone to backup this project financially—someone preferably well-versed in the NFT and Crypto space in general.   \nTo know more about the this, kindly send me a message or email me at acv.11@protonmail.com. I’d be happy to discuss the intricacies of this project, our business model, and funding needs.   \nThank you.",
            "score": 1,
            "author": "Seth_V_NFT"
        },
        {
            "level": 0,
            "comment": "* The name is **BotMeNot**, and you can find us over at [**https://botmenot.com/**](https://botmenot.com/)\n* We are located in **Belgrade, Serbia**\n* What is BotMeNot and what does it do? **BotMeNot is a bot protection score service that will run several tests on your Website to check your anti-bot protection and tell you how protected your website is from bots.**\n* Currently, we're still in the **discovery** phase of our development, gathering feedback on everything regarding our product (from the functionality to the website)\n* The goals we're trying to reach this month are **getting more beta users, improving our SEO,** and **finalize some important development tasks!**",
            "score": 1,
            "author": "BotMeNotReddit"
        },
        {
            "level": 0,
            "comment": "Startup Name / URL - [Routelay](https://routelay.com)\n\nLocation of Your Headquarters - Delaware, US\n\nElevator Pitch - We are a fiat on/off ramp solution, we are like stripe for crypto, any Defi/NFT app can integrate our widget to their application and open themselves to the global world of fiat currencies. We take care of all the KYC/AML comlpliance, crypto liquidity, fiat provider integrations, so that the defi app can focus on their core business.  \nAlso as a standalone product, we make the checkout experience for any user who want to buy/sell crypto very seamless. We provide variety of payment method to users to choose from.\n\nYour role - Growth/Marketing",
            "score": 1,
            "author": "t0m_moore"
        },
        {
            "level": 0,
            "comment": "Tell us about your startup in a comment within this submission. Follow this template:\r  \n\r  \n**Startup Name:** Bridge, [babybrigde.app](https://babybrigde.app) (not yet live) and insta babybridgeapp\r  \n\r  \n**Location of Your Headquarters:** Virginia\r  \n\r\r  \n**Elevator Pitch/Explainer Video**: Bridge provides a platform for parents of new babies (through birth or adoption) to be better connected with their loved ones. Similar to a meal train loved ones can signup, but bridge expands the list and changes the way signups happen - making it caregiver-driven and building community at the same time. [https://youtu.be/tFpVx8WA7Gk](https://youtu.be/tFpVx8WA7Gk)\r  \n\r  \n**Stage**: Discovery stage  \n\n\\- I have only half a prototype created, and am still searching for either an app developer or looking into options to pay to have the app created even.\n\n\\- I'm also trying to research funding options (currently interested in the best way to monetize, but will eventually also need to confirm how to fund the *building* of the app too).\r  \n\r  \n\\- I'm the founder/owner\r  \n\r  \n**This month's goals:** \n\n\\- I'm conducting break-even analysis and so would love help with ideas of costs both of building and also on-going maintenance costs\n\n\\- I'm also curious if there are alternatives to ad revenue that would still allow users to use it for free. Someone mentioned corporate sponsorships, but I thought that was only for non-profits?\n\n\r  \n**Discount:** I don't know how it will be monetized as of yet, but would love to offer a discount once that's established.",
            "score": 1,
            "author": "PutSumPantsOnThatKid",
            "replies": []
        },
        {
            "level": 0,
            "comment": "MarketplaceBuilder\n\nhttps://wordpress-665676-2178442.cloudwaysapps.com/\n\nNo headquarters currently\n\nWe’re a marketplace builder without drag and drop. We offer a set of features which all marketplaces need as well as some customisation of your marketplace.\n\nWe’re currently in the validation phase and are looking to get a few sales to prove the concept.\n\nThis month it would be awesome if we could get some sales and keep working on marketplace features.\n\nFor r/startup subscribers we are offering a BIG discount, $25 for a basic marketplace instead of the usual $50!",
            "score": 1,
            "author": "TheRoyalYukeofDork"
        },
        {
            "level": 0,
            "comment": "Startup Name: Aureal | [https://aureal.one](https://aureal.one)\n\nLocation | HeadQuarters: Nagpur, India\n\nElevator Pitch:\n\nSocial Podcasting app for The Next Generation Internet\n\nCreating a podcast takes time and podcast monetisation is a pain. The number of Profitable podcasts are in 2 digits.   \nAureal is a social podcasting app built on Hive Blockchain that helps you monetise your podcast from day one. All you need to do is share your RSS feed and when your listener likes your episode you generate cryptocurrencies.  \n\n\nAureal takes the experience of Blockchain and Podcasting industry to create a hybrid which solves multitudes of problems at once:\n\n**- Creating &amp; Editing your podcasts**  \n**- Discovering new shows**  \n**- Going Live and Letting your audience listen**  \n**- Monetising your episodes**  \n**- Transcribing your episodes**\n\nAureal is a competitor of Clubhouse when it comes to going live, the only difference is that your content monetisation starts from Day one.   \n\n\nWhat seperates Aureal from other podcast platforms including spotify &amp; apple podcast ?   \nAureal has a direct mode of monetisation without ads or sponsorships or donations.  \n\n\n\\#YourVoiceIsWorthSomething\n\n**What life cycle stage is your startup at?**\n\nEfficiency  \n\n\n**Your Role?**  \nFounder &amp; CEO\n\n**What goals are you trying to reach this month?**\n\nApp Downloads : PlayStore | AppStore\n\n**How could** r/startups **help ?**  \nSuggesting podcasting as a better way of marketing products and services and using Aureal to generate revenue while increasing the sales of their product and services. Generating Evergreen content helps startups generate constant leads overtime, take an example of Slidebean. You can reduce your marketing expenses and interact with your potential customers and have podcasts as additional revenue stream through Aureal.  \n\n\nIt'll be better if we have more podcasters from r/startups subreddit.  \n\n\nDiscount for r/startups:\n\nAureal is free for everyone, we are launching a premium very soon with varieties of features to enable your voice is heard.  \n\n\nHappy Podcasting!",
            "score": 1,
            "author": "blockanarchist"
        },
        {
            "level": 0,
            "comment": "**Startup Name** : [Vadootv](https://www.vadoo.tv/)  \n**Location** : Remote  \n**Elevator Pitch :** Video hosting and marketing for creators &amp; businesses. We allow users to record, upload, share videos anywhere and we also provide tools to market your videos.\n\n  \n**Efficiency:** We have 15,000+ users our product monthly  \nHelp us reach to a wider audience and also help us improve our features  \nUSE \"**EARLY20\"** to get 20% discount on the paid plans",
            "score": 1,
            "author": "coderBug4411"
        },
        {
            "level": 0,
            "comment": "**Startup:**  Whim Local.  https://www.whimlocal.com/feed  \n**Location of Your Headquarters:** SF Bay Area (Peninsula)  \n**Elevator Pitch/Explainer Video:** Whim: a shop local online site to discover unique products from independent retailers and artists.  We launched Whim (www.whimlocal.com) with 30+ local retailers &amp; artists in the San Francisco Peninsula.   \n Whim is an online local shopping destination. Similar to a downtown, where all small businesses benefit from collective foot traffic, our goal is to enable the same experience online. Our vision is to create a visual experience similar to walking down a whimsical street with beautiful products from local stores.   \n**What life cycle stage is your startup at?** Early-stage, recently launched  \n**Your role?** Growth Marketing  \n**What goals are you trying to reach this month?**  Awareness, drive engagement via Instagram, gather feedback, and understand the buyer's journey of a customer who identifies with the problem so much that they are ready to buy.   \n\n\n**How could** r/startups **help?** Feedback, help understand the buyer's journey, customer pain-points  \n**Discount for** r/startup **subscribers?**  If you are an independent retailer or artist in the Bay Area, specifically Peninsula, we want to connect you to local residents and buyers. Right now you can join for free after you sign-up on our website.",
            "score": 1,
            "author": "trustybyte"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:** Collate Technologies (www.collate.org)\n\n**Location of Your Headquarters:** London, United Kingdom\n\n**Pitch:**  \nWe’re building a platform facilitating deep, meaningful dialogue between the public and political, cultural and intellectual leaders. Collate facilitates valuable online dialogues that will help us discover better leaders, cultivate better ideas, and find more togetherness. Our team based in London, UK, grew up with the internet and are aware of how fortunate we are to have more opportunity at our fingertips than ever before. But there’s a risk our generation’s potential gets stunted as online platforms intensify division and breed digital natives lonelier and more depressed than older peers. We believe online toxicity and polarisation are not inevitable, and we’re here to prove it.   \n\n\nWe’re giving a platform to the public to learn from, scrutinise, question and understand those previously out of touch. And we’re offering a platform to those leaders to express themselves with nuance, provide context, go into detail and engage richly with their fans, voters, readers or stakeholders without facing a tsunami of abuse. But most excitingly, we’re a novel and enriching online community where thinkers mingle with the curious, the erudite meet the eager, and everyone learns something new. \n\n&amp;#x200B;\n\n**Looking For:**\n\nOur waiting list has just been released. Join us (www.collate.org) and become a founding member of Collate! Would love for all of you to be apart of it!",
            "score": 1,
            "author": "CollateTechnologies"
        },
        {
            "level": 0,
            "comment": "**Startup Name** \\- Talkiehq.com  \n**Location** \\- India  \n**Elevator Pitch**\\- Talkie is a virtual workspace for remote teams, Communicate effortlessly with **Quick &amp; easy 1**\\-click voice-only collaboration.  \n**Stage** \\- MVP launched - Looking forward to onboard remote teams on the platform.  \n**Role** \\- Founder  \n**Goals** \\- Reach 1000+ users end of the month",
            "score": 1,
            "author": "itsamoghtiwari"
        },
        {
            "level": 0,
            "comment": "* **Name:** Over Easy News\n* **URL:** [www.overeasynews.com](https://www.overeasynews.com)\n* **Headquarters:** Bay Area, CA\n* **Pitch :** Business news over easy with a side knowledge. Over Easy News is a business newsletter that launches every Monday, Wednesday, and Friday that aims to give you easy to read business news and also teach you about everything we talk about in the news. The newsletter is completely free!\n* **Lifecycle:** Efficiency\n* **Goals:** Increase sign-ups for our newsletter.\n* **Discount for** r/startups **subscribers?** No need for discount, it's completely free! However, DM me when you sign up, and ill shout out your startup if you have an MVP launched. I'll give you a free article and talk about your startup! Thanks!",
            "score": 1,
            "author": "dr7s",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name** : Freeday\n\n**URL** : [https://freeday.ai](https://freeday.ai)**Location of Your Headquarters** : Rotterdam, The Netherlands**Elevator Pitch** : Our mission is to *Unlock Human Potential.* Freeday is a platform where business hire digital employees (AI Robotic Assistants) to take over repetitive and tedious tasks from teams. Think about providing a password reset or hardware request over and over and over again when you are working at an IT Helpdesk, or scheduling an appointment via a contact center through mail, phone or chat. By letting our digital employees do this work, more time is available for team members to do the more complex work or interact with clients to really add value.\n\n**Explainer Video** : [Introduction video of Jennifer, our digital employee for Customer Service](https://www.youtube.com/watch?v=wtZ7ksJAYkY)\n\n**More details** : Businesses can hire digital employees without upfront tasks and pay a monthly fee based on how much work has been done. What makes us unique is that we offer a standardized service through currently five different digital employees, that we can train and onboard to your business in a way that they add value from day one.\n\n**What life cycle stage is your startup at?** Freeday launched in October 2020. We have a growing list of customers in the Netherlands. It is so great to see so much traction. Every month new talent is added to our team.\n\n**What goals are you trying to reach this month?** Besides introducing new clients, we want to increase and improve visibility of our services.\n\n**How could** r/startups **help?** If you have suggestions for me to *improve visibility and awareness of Freeday*, please let me know. What I am also interested in is *what kind of tasks you would like to be automated at your work / within your team.* And why? We love to get suggestions so we can train our digital employees to do more and more tasks.",
            "score": 1,
            "author": "Freeday-AI",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Name: Orkst Invoice\n\nURL: [https://orkst.com/free-estimate-template](https://orkst.com/free-estimate-template)\n\nLocation: Canada\n\nCreate and download free estimate template at Orkst. Choose right invoicing design from a wide range of invoicing templates. Edit the template to add your details. Make the invoices personalized for all clients. Send the ready-invoice to unlimited clients to receive timely payment. \n\nThank you for reading.",
            "score": 1,
            "author": "sendwishonline1"
        },
        {
            "level": 0,
            "comment": "Startup Name / URL: CloudMatos  \nLocation of Your Headquarters : Bay Area, California  \nElevator Pitch/Explainer Video : https://cloudmatos.com/beta  \nWhat life cycle stage is your startup at?  \n**Validation**  \n\\- Achieved problem/solution fit (Market Validation)  \n\\- MVP launched  \n\\- Revising/refining user experience based on results of Product Validation tests  \n\\- Refining Product through new Versions (Ver.1+)  \n\\- Working towards product/market fit  \nYour role? Head of Cloud  \nWhat goals are you trying to reach this month? Beta testers / First Customers  \nHow could r/startups help? Wonderful if someone could help me figure out where to go from here as far as finding beta testers. We have been aggressively looking on LinkedIn, but no one bites so far.  \nDiscount for r/startup subscribers? Early-adopters get massive discounts on our platform. And even amazon gift cards!  Reach out here on this profile to know more.",
            "score": 1,
            "author": "i_am_master_ed"
        },
        {
            "level": 0,
            "comment": "Startup Name :  [https://www.getflip.co/](https://www.getflip.co/) \\- Flip  \nLocation : Remote  \nElevator Pitch: Task management tool for entrepreneurs and small teams  \nMore Details - Early stage, in search of stickinessRole - Co-founderGoal - In search of first 100 users  \nDiscount - Beta access tor/startup community, get early access here - [https://www.getflip.co/](https://www.getflip.co/)",
            "score": 1,
            "author": "oyewolekay"
        },
        {
            "level": 0,
            "comment": "I want to help startup founders go through shitty periods on their way to long-term goals. I launched a few MVPs, but didnt feel I'm solving the problem right. If you are a startup founder and have been working on your project less than 4 years -let's chat and I'll ask about how you go through challenging periods. This will really help me create a more useful product.",
            "score": 1,
            "author": "denis_shatalin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ask them questions so it can help u create a product? 🤔",
                    "score": 1,
                    "author": "imdshizzle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly",
                            "score": 1,
                            "author": "denis_shatalin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Startup Name**: Utradea\r\n\n**Location**: Toronto, Canada\n\n**Website**: [https://utradea.com/](https://utradea.com/)\n\n[iOS App](https://apps.apple.com/ca/app/utradea/id1558492959)\n\n[Android App](https://play.google.com/store/apps/details?id=com.utradea.utradeaapp)\r  \n\r  \n**Elevator Pitch**: Investors face a fundamental problem, what to invest in? Utradea provides investment ideas and insights \r through an ecosystem of content, tools, and \r  \nsocial engagement. \n\n**What goals are you trying to reach this month**?  \n\nMore registered users and feedback on our platform and apps. \r  \n\r  \n**Discount for** r/startup **subscribers?** \n\nWe are currently free to use. Planning on launching a a premium tier in the next few months.\n\n**How could** r/startups **help?**\r \n\nIf you invest in stocks, can try out our platform or app and provide some feedback.",
            "score": 1,
            "author": "utradea",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is amazing!",
                    "score": 1,
                    "author": "Platers_HomemadeFood",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Name:** LoopMessage - Mass personalized messaging in popular messengers on your Mac and iPhone\n\n**URL:** [LoopMessage.com](https://loopmessage.com/?ref=reddit) &amp; [https://apps.apple.com/app/id1562182389](https://apps.apple.com/app/id1562182389?ref=reddit)\n\n**Location of Your Headquarters:** California\n\n**Explainer video:** [https://youtu.be/n7B399bnUSQ](https://youtu.be/n7B399bnUSQ)\n\n**Elevator Pitch**: LoopMessage is a perfect tool for messaging marketing. You can send personalized bulk messages via iMessage/SMS, WhatsApp, FB Messenger, Telegram, Viber, and Skype in 4 steps:\n\n1. Compose message\n2. Select recipients\n3. Choose the sending mode\n4. Press \"Start\" 📤\n\nEasy peasy, right?\n\n**More details:**\n\n* This is a 100% native iOS and macOS app with a minimal UI and maximum performance 🚀\n* Sending will be done on your device from your accounts in iMessage, Facebook, WhatsApp, Telegram, Viber, and Skype (iOS and macOS app supports different counts of instant messengers).\n* LoopMessage app will not ask for passwords from your messengers, so you can be sure that your accounts are safe.\n* Also, you can send regular SMS from your Mac and iPhone.\n* Fully automatic sending on macOS\n* App stores all data only on your device, without using external servers.\n* You can deny access to the phone book and use only internal contacts in the app. Thus, your personal contacts will not be known to the app.\n\nAll details you can check on our [ProductHunt](https://www.producthunt.com/posts/loopmessage) page or [website](https://loopmessage.com/?ref=reddit).\n\n**How could** r/startups **help?**\n\nWe are looking for resellers/representatives who are willing to cooperate with us to distribute our software for reward 🤑 Please contact our support team if you are interested in a partnership.",
            "score": 1,
            "author": "Deliany-Andrew"
        },
        {
            "level": 0,
            "comment": "* **Name / URL:** [https://firedating.me](https://firedating.me)\n* **Location of Your Headquarters:** Munich, Germany\n* **Elevator Pitch/Explainer Video:** place for FIRE (Financial Independence / Early Retirement) enthusiasts to find friends and a partner.\n* **More details:**\n   * What life cycle stage is your startup at? Efficiency.\n   * Your role? Developer.\n* **What goals are you trying to reach this month?**\n   * Finalize the new style and branding. Run user calls to test new search UX.\n* **Discount for** [**r/startup**](https://www.reddit.com/r/startup/) **subscribers?**\n   * The site is free.\n\nThe site actually works for finding a partner. 14 couples, who met through the site, have reached out to me. Recently Wanderer &amp; FIRECracker from Millennial Revolution even made an interview \"[FINDING LOVE DURING COVID](https://www.millennial-revolution.com/freedom/finding-love-during-covid)\" with the couple #5 - Ms.X and Liam. It is an amazing story, which involved them meeting for the first time in... Barbados. Worth noting that together they will be FIRE in only 2 years instead of 5-7 years. Wanderer &amp; FIRECracker did [an interview with me too](https://www.millennial-revolution.com/uncategorized/firedating-apps-creator-speaks-out/). With 4 couples I did interviews: [Ms.X and Liam (couple #5)](https://firedating.me/blog/12/couple-5-interview), [Will and Julia (couple #6)](https://firedating.me/blog/9/couple-6-interview), [Taylor &amp; Cody (couple #7)](https://firedating.me/blog/10/couple-7-interview), [Ellie and Mr.X (couple #9)](https://firedating.me/blog/11/couple-9-interview).\n\nOverall as of today, there are 6617 users (27.9% women, [all stats](https://firedating.me/open/)), but the number is growing everyday!",
            "score": 1,
            "author": "firedating",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey I would be happy to help with branding and UX! I’m a university student studying UI/UX design and I send you some of my works if you want.",
                    "score": 1,
                    "author": "peanutcolata",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "* **Startup Name:** [LearnDvorak](https://becausecurious.me/learn_dvorak/)\n* **Elevator Pitch:** Decrease typing related discomfort\nby learning Dvorak layout touch typing. This is a guided course to make the transition as smooth as possible.\n* The project is at 'Discovery' stage. I am validating the market.\n* I would love to hear your opinion. Have you thought about learning Dvorak? Does it sound like a lot of work? I switched to Dvorak recently and, overall, this was easier than I thought, but there were frustrating periods.\n* **What goals are you trying to reach this month?**\n   * Talk to a couple more potential customers.",
            "score": 1,
            "author": "becausecurious"
        },
        {
            "level": 0,
            "comment": "* **Startup Name:** [VocabBoost](https://vocabboost.online/) (browser extension: [Chrome](https://chrome.google.com/webstore/detail/vocabboost/obgbcamdmcdcenchjmhggocjabmnnaab?), [Firefox](https://addons.mozilla.org/en-US/firefox/addon/vocabboost/?))\n* **Elevator Pitch:** Make a language test out of any website to learn foreign language vocabulary from websites you love instead of boring text books.\n* The project is at 'Efficiency' stage. There are people who love the extension. I intentionally keep it free to give everyone equitable access to learning resources (donation based model).\n* I would love to hear your opinion how I could reach broader audience. So far I've been spreading the word in language learning communities on Reddit.\n* **What goals are you trying to reach this month?**\n   * 2k users installed the extension\n* **Discount for** [**r/startup**](https://www.reddit.com/r/startup/) **subscribers?** The extension is free",
            "score": 1,
            "author": "becausecurious",
            "replies": [
                {
                    "level": 1,
                    "comment": "you might wanna check out toucan, its something similar to what your pitch suggests",
                    "score": 1,
                    "author": "themojoking-45",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "* **Startup Name:** [TwitterFollowerCuration](https://becausecurious.me/twitter_follower_curation/)\n* **Elevator Pitch:** Keep your Twitter replies free from spam, trolls, toxic and political accounts\nby automatically removing followers based on rules like keywords in their bio, location, profile pic etc.\n* I've implemented an MVP and validating the market.\n* I would love to hear your opinion. Do you or someone you know have this problem?\n* **What goals are you trying to reach this month?**\n   * Talk to a couple potential customers.",
            "score": 1,
            "author": "becausecurious"
        },
        {
            "level": 0,
            "comment": "* **Startup Name:** PawsWhatYouAreDoing (browser extension: [Chrome](https://chrome.google.com/webstore/detail/paws-what-youre-doing/adbdhkeebjandlnkbnmiflchgbnehjbb?hl=en), [Firefox](https://addons.mozilla.org/en-US/firefox/addon/paws-what-you-re-doing/))\n* **Elevator Pitch:** On every webpage, when your mouse cursor is close to the bottom of the page, a cat may jump after it.\n* I am not sure whether I could grow this, but for now I want to see whether people like the idea.\n* **What goals are you trying to reach this month?**\n   * See how many people like it.",
            "score": 1,
            "author": "becausecurious",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it’s funny. Idk how practical it is.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends on your definition of practical ;)",
                            "score": 1,
                            "author": "becausecurious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It would definitely make people remember your page lol. Probably makes it worth it right there",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like it. I don't know how it would make money though.",
                    "score": 1,
                    "author": "ZomaticLex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me neither :)",
                            "score": 1,
                            "author": "becausecurious"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**What If Satelites Could Push Shipping Containers?**\n\n**Startup Name** / [https://h-industries.io](https://h-industries.io)\n\n**Location** / Melbourne, Australia\n\n**Elevator Pitch** / [54s YT Pitch](https://youtu.be/xJgSEcI10Y8) \\- What if satellites could push shipping containers? H. Industries is modelling use of a novel propulsion method and could have them arriving weekly in orbit around Mars by 2030 to supply the next step of human space exploration. If we stockpile supplies before their arrival, we can have bigger crews that stay there longer and grow a sustainable habitat with reliable low speed, lost cost freight shipping. Save rockets for people and emergencies, we can use satellite mounted electromagnets to move freight containers slowly but cheaply between any two planetary orbits - starting with Mars.\n\n**Life Cycle Stage** / Venture Capital Series A Offering - MVP Feasibility Study\n\n**Role** / Founder, all work to date. Business Analyst / Implementation Project Manager by trade, mining engineer by training.\n\n**Goals This Month** / 1,000 [Pitch views](https://youtu.be/xJgSEcI10Y8) and contact with a venture capital firm.\n\n**How Could** r/startups **Help**? By checking out the pitch video and letting me know your thoughts on what comforts of home or equipment astronauts might want on Mars when we have crews land!\n\nThanks for reading, M",
            "score": 1,
            "author": "H_MJW",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Name: FLOW OS\n\nURL: [https://sessions.us/](https://sessions.us/) \n\nLocation: Delaware\n\nPitch: Sessions is the platform that makes meetings better by bringing all your collaboration tools into one single space. Sessions is designed to simplify your workflow, increase your productivity and help you finish your meetings on time, whether you’re a business manager, freelance designer, educator or a sales executive.\n\nWhat goals are you trying to reach this month? More users+more feedback\n\n**Thank you for reading.**",
            "score": 1,
            "author": "Ill-Economist-2104",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really like it though the concept of sticking to agenda , generally in zoom and other places it gets lost",
                    "score": 1,
                    "author": "liveforfiction",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "🙏 thanks",
                            "score": 1,
                            "author": "Ill-Economist-2104"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**: [Landelity - International Property Listing](https://landelity.com/)\n\n**Location:** Remote\n\n**Pitch:** Landelity connects property buyers and sellers anywhere in the world. Our users can list any property like home, apartments, or land for sale or rent with the exact location and property/parcel borders visible on the map.\n\n**Explainer Video:** How to use our service to list a property in a short 3 min video - [https://youtu.be/d1mn0CNxm34](https://youtu.be/d1mn0CNxm34)\n\n**Looking for:**\n\n* Your feedback\n\n**Discount** for r/startup subscribers?\n\n* Free",
            "score": 1,
            "author": "zoomekreddit",
            "replies": []
        },
        {
            "level": 0,
            "comment": ".",
            "score": 1,
            "author": "jazzben",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Name:** Namy\n\n**URL:** www.namy.ai\n\n**Location**: Spain\n\n**Pitch:** A domain generator that's *actually* good. Perfect for /r/startups :P\n\nIt's a relatively simple UI, most of the power comes from the AI model behind it. I just finished that part this week. It also tells you which domains are available, and which ones aren't.\n\nHappy to get any feedback!",
            "score": 1,
            "author": "Hugo0o0",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;www.namy.ai\n\nuhhh it just recommended [retardasscocksucker.com](https://retardasscocksucker.com) to me...",
                    "score": 1,
                    "author": "gradual_alzheimers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's hilarious. I'll have to implement some profanity filtering.\n\nIt shows you a mix of the past 100 queries, so someone must've searched for something naught :)",
                            "score": 1,
                            "author": "Hugo0o0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is great haha, some good suggestions I'd never thought of",
                    "score": 1,
                    "author": "WillMacFormify"
                },
                {
                    "level": 1,
                    "comment": "Wonderful :D",
                    "score": 1,
                    "author": "nurehmancoder",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "\\* Startup Name: [CloudYali.io](https://CloudYali.io)  \n\\* Location of Your Headquarters: We don't have a HQ  \n\n\n\\* Elevator Pitch: Discovering AWS Cloud resources from multiple AWS accounts, regions in one place can be difficult. Even difficult to find change history for those resources in one place.We are aiming to simplify the AWS Cloud discovery and querying for the engineers.\n\nWe are currently supporting more than 200 Cloud resources. And keep adding more resources.  \n\n\nUsing CloudYali, engineers would be easily be able to answer questions like:  \n\\- How many Cloud Resources do you have?  \n\\- Which regions have what resources?  \n\\- Are there any orphaned/abandoned/unused resources for which you are paying?  \n\n\n\\* Explainer video: [https://youtu.be/j83DPTdbTPk](https://youtu.be/j83DPTdbTPk)  \n\n\n\\* What life cycle stage is your startup at?: Currently we have finished the MVP and interviewing  DevOps/Cloud engineers to understand the feedback. We are offering free 2 months subscription.  \n\n\n\\* What goals are you trying to reach this month?: Moving from invite-only mode to general availability of our preview release.  \n\n\n\\* How could r/startups help?: If you're AWS cloud engineer, and have ever felt the need to discover your cloud, visit my website [CloudYali.io](https://CloudYali.io), signup with your email and try product.  \n\n\n\\* Discount for r/startup subscribers?: 2 months free trial (fair use policy), starting in September 2021.",
            "score": 1,
            "author": "heldsteel7"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**:\n\n[CxO Industries](https://cxo.industries)\n\n**Location of Your Headquarters**:\n\nSouth Africa\n\n**Elevator Pitch/Explainer Video**:\n\nGet business advice and help with writing a business plan. Intended to be fully automated.\n\n**What life cycle stage is your startup at**?\n\nDeveloping the MVP\n\n**Your role**?\n\nFounder / developer / every hat.\n\n**What goals are you trying to reach this month**?\n\nI'm developing the initial screens.\n\n**How could** r/startups **help**?\n\nPlease sign-up for notification of when the MVP is released.\n\n**Discount for** r/startup **subscribers**?\n\nNot yet applicable, but if there is a discount, it would be for those who sign-up early.",
            "score": 1,
            "author": "jasfi"
        },
        {
            "level": 0,
            "comment": "* **Startup Name / URL**\n   * **FINLO** \\- [https://finlo.io](https://finlo.io)\n* **Location of Your Headquarters:**\n   * Remote 🌎\n* **Elevator Pitch/Explainer Video:**\n   * **FINLO** is an investment research platform built to modernize and optimize the process of stock tracking, due diligence and financial analysis.\n* **More details:**\n   * What life cycle stage is your startup at? Efficiency\n   * Your role? Co-founder and CEO\n* **What goals are you trying to reach this month?**\n   * Implement new features from our product roadmap\n   * Acquire more users",
            "score": 1,
            "author": "oldworlds"
        },
        {
            "level": 0,
            "comment": "* **Startup Name:** [Brijj](https://brijj.io/)\n* **Location:** Bristol, UK\n* **Elevator Pitch:** Brijj is a collaboration tool for data &amp; insight teams. Like having Google Forms, Trello, Jira and Confluence in one, it helps data teams save time &amp; effort and work effectively with their customers so they can deliver valuable insight, together.\n* **Video:** [https://youtu.be/SwwfiKQwGwA](https://youtu.be/SwwfiKQwGwA)\n* **What goals are you trying to reach this month?** More signups to our interactive demo playground so we can get more feedback on the platform\n* **Discount for** r/startup **subscribers?** There is a free forever tier plus 25% one year discount on paid plans for anyone willing to provide quality feedback. DM for details.",
            "score": 1,
            "author": "adebrijj"
        },
        {
            "level": 0,
            "comment": "**Name**: [ImprovMx](https://improvmx.com)\n\n**URL**: [ImprovMx.com](https://improvmx.com)\n\n**Elevator pitch**: Forwarding emails as a service. Simply redirect all incoming emails from @your-domain.tld to your personal inbox.\n\n**Current stage**: Available to use\n\n**Location**: Hamburg, Germany ; Belfort, France\n\n**Looking for**: Feedback - We are improving the service and adding features every week, curious to get your opinion on it :)",
            "score": 1,
            "author": "cx42net"
        },
        {
            "level": 0,
            "comment": "**Name**: [PDFShift](https://pdfshift.io)\n\n**URL**: [PDFShift.io](https://pdfshift.io)\n\n**Elevator pitch**: Convert any HTML documents to high fidelity PDF in a single POST request.\n\n**Life Cycle stage**: Scaling\n\n**Location**: Belfort, France",
            "score": 1,
            "author": "cx42net",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, this will come in handy. Thank you.",
                    "score": 1,
                    "author": "naeads"
                },
                {
                    "level": 1,
                    "comment": "I like this a lot! Looks super easy to use. What are your thoughts on a pay-as-you-go pricing model?",
                    "score": 1,
                    "author": "micma123",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Startup Name:** MyPicket\r  \n\r  \n**Location:** Orlando, FL\r  \n\r  \n**Elevator Pitch:** Home searching for the millennial. Users can swipe left, up, or right and it will categorize those houses into dislike, maybe, or love. Users won't see homes they dislike again and again.\r  \n\r\r  \n**What life cycle stage is your startup at?** Should be launching in beta within the next week or two.\r  \n\r\r  \n**What goals are you trying to reach this month?** Launch on testflight and get 30 beta users, get feedback and then hopefully launch on iOS and Android. \r  \n\r  \n**How could** r/startups **help?** Just visibility and maybe some feedback. Also looking for awesome developers with SaaS experience.",
            "score": 1,
            "author": "PicketApp",
            "replies": [
                {
                    "level": 1,
                    "comment": "so basically its like tinder but for real estate?",
                    "score": 1,
                    "author": "RealLafayet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**: [Privasim](https://privasim.com/)\n\n**Location of Your Headquarters:** Manila, Philippines\n\n**Elevator Pitch/Explainer Video:** We help schools teach data privacy to students easily using game-based learning.\n\n**More details:** We make games that oversimplify difficult tech terms such as data privacy, user tracking, privacy laws, dark patterns, blockchain, and so on.\n\n**What life cycle stage is your startup at?:** Early Stage\n\n**Your role?:** Founder\n\n**What goals are you trying to reach this month?:** Pilot testing to schools and educators\n\n**How could** r/startups **help?:** Connect with schools and educators for initial pilot testing. No plans on charging schools.",
            "score": 1,
            "author": "darkplaceguy1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name:** [Jama.ai](https://jama.ai)\n\n**Location:** Singapore\n\n**Elevator Pitch:** Gong but for Whatsapp sales conversations\n\n**Problem we're solving:** B2B sales people in Asia Pacific (APAC) communicate with their clients over Whatsapp and Wechat (the non-business, personal version). These conversations are completely not integrated into the CRM, making them difficult to manage. The problem is especially severe in enterprise sales (&gt;3 months sales cycle, &gt;$100k annual contract value), as deals often involve &gt; 10 stakeholders, resulting in miscommunication and lost sales. \n\n**Our solution:**\n\n* Chat integration - Sales reps can continue to communicate with buyer-side stakeholders on their personal Whatsapp/Wechat/LINE. Our platform will automatically log the messages, analyze them for sentiment, and suggest responses based on topic.\n* Mutual Success Plan collaboration - Sales reps can use our platform to collaborate with buyers on project timelines, milestones, documents, etc.\n* Analytics &amp; Forecasting - The data allows us to provide insights on who's engaged, what items are at risk, what the close date would be, etc.\n\n**What life cycle stage is your startup at?** Building MVP\n\n**Your role?** Co-founder\n\n**What goals are you trying to reach this month?**\n\n* Finish and launch MVP\n* Get 5 LOIs\n\n**How could** r/startups **help?** Anyone in sales free for a short chat? I'm doing customer interviews and showcasing my prototype.\n\n**Discount for** r/startups **subscribers?** Drop me a message and I'll give you a custom discount",
            "score": 1,
            "author": "fly4cheap",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**  \n [https://gocookieless.net](https://gocookieless.net)\n\n  \n**Location of Your Headquarters**  \nBelgrade,Serbia  \n**Elevator Pitch**  \nTesting out the market for cookieless analytics. We are simple, easy to use, lightweight analytics and are completely GDPR compliant which means no more annoying popups for your users to accept cookies. All of this with the added bonus of privacy for your users data. We do not sell data, we delete all the gathered data in 180 days / or the timeframe in your chosen package and you can always request to have the data deleted before then.  \nWhat life cycle stage is your startup at?  \nValidation. We have the product completed and are now looking for user feedback.\n\n  \n**Your role?**  \nFounder (Solo)\n\n  \n**What goals are you trying to reach this month?**  \nRegistration to the website is currently free for everyone since we are gathering users to test out the product and give feedback and also give suggestions on how the product can be improved. I am currently in the process of building a public roadmap for the requested features.\n\n  \n**How could** r/startups **help?**\n\nAs I said the registration is currently free and I would love to get more people onboard to test the product. For any questions, feedback and suggestions you can contact me here or email hello@gocookieless.com  \n\\*The logo is currently just a placeholder logo, in the process of getting a small ghost eating a cookie",
            "score": 1,
            "author": "rbitar"
        },
        {
            "level": 0,
            "comment": "# [F5Bot](https://f5bot.com) - Get emailed when your startup is mentioned on Reddit!\n\n**Location:** Iowa\n\n**Pitch:**\n\n1. Add some keywords:\n  * your company name\n  * your product name\n  * your competitors' names\n2. Get an email every time they appear on Reddit.\n\n**Discount:** It's free!\n\n**Looking for:** New users / feedback.\n\n**More Details:** We've been around since 2017, stable and reliable. Still adding new features.",
            "score": 1,
            "author": "CodePlea"
        },
        {
            "level": 0,
            "comment": "# [Pipewing.com](https://Pipewing.com)\n\nConnecting digital nomads and remote workers who are in the same location.  \n\n\n**URL**: [https://pipewing.com/](https://pipewing.com/)\n\n**Stage:** First few hundred users have joined\n\n**Goals this month**: Onboarding more users\n\n**Discount**: It's free",
            "score": 1,
            "author": "PlaneConcentricTube",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is cool. What's your business model?",
                    "score": 1,
                    "author": "tarankhalsa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Name:** [**Young Alfred Home Insurance**](https://www.youngalfred.com/)  \nLocation: Based in NYC and PA and AZ (USA)  \nPitch: Your TLDR for the 90 page home insurance policy. Shopping for home insurance today sucks. Most of it is sold over the phone or by an agent down the street, but Young Alfred is making it digital for everyone. We have turned a 5-hour shopping nightmare into an informed 15-minute transaction. We let customers **compare and buy home insurance without making a phone call**. We have over 50 insurance companies on our platform and can offer special bundled discounts when you add in auto, flood, and umbrella insurance! We also can offer coverage on condos, rental/landlord properties, vacation homes, mobile homes, tiny homes, vacant homes, and more!  \nMore details: Currently available in all 50 states! (insurance is regulated state by state)  \nLooking for:  \n\\- partnerships in home buying space (real estate and mortgage)  \n\\- [**home insurance blog**](https://www.youngalfred.com/homeowners-insurance) article ideas - what would you like to know about insurance?  \n\\- engineers - always and forever  \n**Discounts:** We can't give direct discounts because of insurance rebating laws. But you can get a quick estimate for home insurance with our [**free home insurance calculator**](https://www.youngalfred.com/home-insurance-calculator). It's built on 42,000 custom models - one per US zip code.",
            "score": 1,
            "author": "young-alfred"
        },
        {
            "level": 0,
            "comment": "Startup Name/URL: [**Breue**](https://breue.com/)\n\n**Location**: SF, DC\n\n**Pitch**: You are an entrepreneur. Whether you are a first timer or a serial entrepreneur, you have an amazing idea that you wanna turn intro reality. Unfortunately, you can’t code yourself, don’t have a co-founder that can, and it can be a headache to find the right person or dev shop. Meet Breue - your digital launch partner. We turn a good idea into a beautiful full-functioning product for $15k and in 8 weeks. We want to see you succeed. So we’ll be there to chat and collaborate with you on a daily basis. We’ll also advise you on the product vision and business model so you can go validate your idea and get some traction.\n\n**Details**: Breue is a one person shop. So far, it's been pretty fun working with some neat people on some inspiring ideas. You can checkout some of the stories of these projects on the site.\n\n**Goals this month**: I guess to connect with some interesting peeps.\n\n**Discount**: Free product roadmap, helping you spec out any features for development. Also, shoot me an email if you are just looking for feedback or any advice/help :)\\*A little helpful read I put together in this subreddit a bit ago - [https://breue.com/how\\_to\\_validate\\_your\\_startup\\_idea](https://breue.com/how_to_validate_your_startup_idea)",
            "score": 1,
            "author": "breued",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey man it's a small question but do you mind telling how did you set up a website for business? I have seen Shopify and stuff but I never got how to make a website like yours or anyone else's and I would just like to know.",
                    "score": 1,
                    "author": "IamTheOnlyAJ"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**\n\nProfs - [Profs.co](https://Profs.co)  \n\n\n**Location of Your Headquarters**NYC  \n\n\n**Elevator Pitch/Explainer Video** \\- We connect companies with vetted top sales talent.  \n\n\n**More details:** Companies come to us to hire fractional sales talent for a variety of tasks. As basic as hiring an SDR to generate leads to fractional sales management. Most of our talent has full time jobs but because of remote work they're able to add an extra 10-20 hours per week helping companies. Sometimes founders need help with management but can't hire a FT manager yet, GTM strategy or simply to write better email copy so they can book more meetings.   \n\n\n**What life cycle stage is your startup at?** Validation  \n\n\n**Your role?** Co-Founder  \n\n\n**What goals are you trying to reach this month?** Double Revenue  \n\n\n**How could** r/startups **help?** \\- only one way to double revenue  \n\n\n**Discount for** r/startup **subscribers?** 10% off first month's engagement  \nShare how our community can get a discount - startup sales",
            "score": 1,
            "author": "startupsalesguy"
        },
        {
            "level": 0,
            "comment": "**Name:** Overmind  \n**URL:** [overmind.wiki](https://www.overmind.wiki)  \n**Pitch:** Your thoughts are a mess. Overmind is a tiny, self-organizing notepad.\n\n**Current stage:** Closed beta  \n**Location:** Remote  \n**Looking for:** Beta users &amp; feedback! DM me to skip the waitlist",
            "score": 1,
            "author": "MysteriousArtifact"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL** \\- [https://www.riftpay.io](https://www.riftpay.io)\n\n**Elevator Pitch** \\- We are a real time payments splitting platform built for roommates. Our app allows roommates to split bills and utilities automatically. We provide you with a physical and virtual debit card for you and your roommate to use, make automatic payments together. No more asking to get paid back for last months rent, utilities or other bills, RiftPay lets you split bills and live hassle free.\n\n**More details** \\- Our app helps you automatically split bills, payments, utilities with roommates on a one-time or recurring baisis.\n\n**What life cycle state is your startup in -** Validation and customer acquisition.\n\n**What goals are you trying to reach this month?** \\- Reaching out to at least 100 people to gauge interest and possible beta testing.\n\n**How could** r/startups **help?** \\- Would love feedback, and if this is a platform you think you could use, would love to set up a customer interview, just DM me!",
            "score": 1,
            "author": "Born-Opportunity-356"
        },
        {
            "level": 0,
            "comment": "Name: Ivy Podcast Discovery\n\nURL: [ivy.fm](https://ivy.fm)\n\nPitch: Ivy allows listeners to follow over a million different topics, including people, across podcast episodes. \n\nStage: Scaling\n\nMy Role: Co-founder\n\nLocation: Austin, TX\n\nGoals: Increase listenership\n\nHow can Reddit help: Check us out and let us know what you think. Ivy is free to use.",
            "score": 1,
            "author": "Lindseymcp",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL**\n\nCapture / [https://www.joincapture.com/](https://www.joincapture.com/)  \n**Location of Your Headquarters**\n\nWilliamsburg, Brooklyn, NY  \n**Let people know where you are based for possible local networking with you and access to local resources**\n\nWilliamsburg, Brooklyn, NY  \n**Elevator Pitch/Explainer Video**\n\n[https://youtu.be/BubaD-e7o-c](https://youtu.be/BubaD-e7o-c)  \n**More details:**\n\nBecause nobody reads a PDF anymore, we created The Capture Commercial. It's a Video Case Study that helps clients close deals 40% faster.  \n**What life cycle stage is your startup at?**\n\nScaling. Looking for more clients who need to transform their PDFs into Videos and startups that are video-first.  \n**Your role?**\n\nCo-Founder  \n**What goals are you trying to reach this month?**\n\n4 new clients  \n**How could** r/startups **help?**\n\nGive us interesting stories to tell. We help turn your Clients into Spokespeople.  \n**Discount for** r/startup **subscribers?**\n\n25% off our Starter Package of $3500 (for the first video)  \n**Share how our community can get a discount**\n\nUse the keyword, \"Fidelio\".\n\nThere is no second keyword.",
            "score": 1,
            "author": "wisestartupblog",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Looking for genuine feedback for our travel startup\n\n**Name** YellowStrips Inc.\n\n**URL**: [YellowStrips](https://www.yellowstrips.com/)\n\n**Location**: Bangalore, IndiaElevator \n\n**Pitch**: YellowStrips is building a community of travelers who share the same interests as you and are traveling at the moment. We recently launched our beta product and are looking for genuine feedback and some early beta travelers.\n\n**Note**: We recently crossed 1K travelers registered on the platform\n\nThanks in advance!",
            "score": 1,
            "author": "kkmeghwal",
            "replies": [
                {
                    "level": 1,
                    "comment": "On the website it says ''Posted By: Annoymous'' now i have no idea how this works but if someone didn't type that name personally, rather it was automatically asignt, you might want to change it to ''anonymous'' :)",
                    "score": 1,
                    "author": "MePorro2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;anonymous\n\nThanks for pointing this out, must be a typo. We corrected it. Cheers!",
                            "score": 1,
                            "author": "kkmeghwal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\r\rStartup: [Trends Predictions](https://trendspredictions.com/) \r  \n\r  \nLocation: Panama City, Panama\r  \n\r  \nElevator Pitch: Hard to find new content ideas?  Well... Trends Predictions gives you access to current and past trends to find hot topics but... past and present is no enough sometimes... that's why Trends Predictions take this to the next level! Trends Predictions gives you access to **predictions about trending** topics as well, **powered by AI🤖!** \n\n*Find trends, top hashtags and accurate predictions up to 3 hours in advance!* \r  \n\r  \nLife cycle stage: Validation\r  \n\r  \nRole: Founder\r  \n\r  \nGoals this month:\r  \n\r  \n\\* **Get 1000 visits in the website** 👉 [https://trendspredictions.com/](https://trendspredictions.com/)   \n\r  \n\r\\* Get first 300 followers on Twitter👉 [https://twitter.com/trendspreds/](https://twitter.com/trendspreds/)  \n\n\\* Get first 300 followers on Facebook 👉 [https://www.facebook.com/trendspreds/](https://www.facebook.com/trendspreds/)     \n\n\\* Get first 300 followres on Instagram 👉 [https://www.instagram.com/trendspreds/](https://www.instagram.com/trendspreds/)   \n\r  \n\r  \nHow could you help: I'll really appreciate if you share this with journalists or content creators and follow us on social networks if you find this interesting",
            "score": 1,
            "author": "wisdomtool",
            "replies": []
        },
        {
            "level": 0,
            "comment": "**Name/URL**\n\nThe Kinnect Company | https://app.kinnect.us/signup\n\n**Location**\n\nWe’re a globally distributed team. We have team members living in the New York City and Orlando areas in the US, and in Delhi and Mumbai in India, among other locations.\n\n**Elevator Pitch/Video**\n\n* Kinnect is an easy to use family communication platform. It helps users organize, manage, and share important information so those who rely on them have what they need, when they need it. \n\n* Our CEO lost his grandmother in 2017. His family, when they should have been celebrating her life, dealt with the frustration of having to track down her information. It ended up taking over a year to collect everything they needed. We built Kinnect because we believe that this is a predictable problem, and can be avoided. \n\n* In the future, we’re planning to add photos, videos, and stories. We’re also building out a professional workspace (think wealth managers, attorneys, accountants, etc.) to allow them to collaborate with clients. \n\n* You can see more about how Kinnect works with this video [here](https://www.youtube.com/watch?v=Qb0HHKFOz18)\n\n**More details**\n\n* We’re at the validation stage, having launched our closed beta last month on Product Hunt. My mother finds the platform easy to use, so hopefully you will too!\n\n* I’m a product marketing manager and co-founder\n\n**What goals are you trying to reach this month?**\n\nWe’re hoping to have a few thousand users by the end of the year. Mostly looking for feedback this month.\n\n**Discount for r/startup subscribers?**\n\nAccess to the closed beta. You also get a free six month premium subscription without having to put down a credit card (the base version is always free, but you get additional security features and storage with the premium version for $2/month).",
            "score": 1,
            "author": "jnf95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love this idea. My parents went through a lot of pain trying to find all the paperwork/accounts/insurance policies/share certificates etc etc when my grandparents died. They also have a hard time finding stuff to do with my kids when they need it, and I wouldn't have a clue where to find details of my mum's affairs if she passed. A single, secure shared place for all this stuff could be really useful. Could also aid transparency if you have copies of wills and details of the estate stored. I suppose one good commercial aspect of this is you would have people subscribe for life? Best of luck 👍",
                    "score": 1,
                    "author": "socialdisdain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you! Yes, it’s quite the problem, one most people don’t realize they have. We’ve actually found that 70% of people believe that other people will be able to handle their affairs if something were to happen to them, but only 30% of people feel confident they could handle someone else’s affairs if it became their responsibility to do so. And yes, increasing transparency, reducing need for probate, etc. are among our goals. \n\nThe commercial aspect, at least from my perspective, seems to be more on the professionals side. We have *some* market validation on that side, but the trend so far seems to be that professional services are becoming commoditized and professionals are looking to add value as a way to preserve their fees. The family side seems more limited, as it would have to be free in order to attract most people. But yes, we would hopefully have users for life once they signed up.",
                            "score": 1,
                            "author": "jnf95"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Name:** [Softdrive](https://www.softdrive.co)\n\n**Location:** Toronto, Canada\n\n**Pitch:** Softdrive is putting the PC into the cloud, enabling businesses to run their high performance software smoothly on any device.\n\nThrough our software, we can turn old or underpowered computers into powerful workstations.\n\n**Stage:** Validation: Team of 4. Running pilots with a few customers. We're starting out B2B, looking at 3D modeling in construction in particular.\n\n**Looking for:**\n\n* Feedback on the pitch, product, and website.\n* We're hiring for C++ networking and cloud architecture positions. Please reach out if you know anyone!",
            "score": 1,
            "author": "Softdrive-Alan101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Finally a startup that seems interesting!! Keep up the good work.",
                    "score": 1,
                    "author": "Navier-gives-strokes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Name: iSolace Inc. \n\nURL: [iSolace ](isolacinc.com) isolaceinc.com\n\nLocation: Durham, NC, USA\n\nProducts and videos: \n\nCOVIAGE-Fully portable and expandable negative pressure isolation system for COVID-19 patient isolation that can act as an ICU room. Specifically designed to keep healthcare workers safe from COVID-19 positive patients, COVIAGE provides a barrier between them and has been proven to filter 99.997% of aerosolised particles from the tent using low-cost non-HEPA filters. COVIAGE has been granted FDA EUA.  \nDemo video: https://youtu.be/uomTPEnRzek\n\nLumosIV- illuminated IV lines to drastically reduce time for IV line tracing in critical care settings while increasing accuracy  \n\nLife-cycle stage: Efficiency/Scaling\n\nMy role: Co-founder\n\nGoals: getting COVIAGE out to hospitals heavily impacted by COVID-19 patients, especially those hospitals that don’t have ICU space left. \n\nHow can r/startups help? Help us by putting us in contact with hospitals and raising awareness of COVIAGE! COVIAGE can help these hospitals by increasing ICU capacity. We’re working on it but could sure use the help.",
            "score": 1,
            "author": "TheRealAelin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really interesting product",
                    "score": 1,
                    "author": "Biryani__Whisperer",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Name**: Surplus: Expense Tracker\n\n**Platforms:** iOS/iPad OS\n\n**Public Beta Link:** [https://testflight.apple.com/join/L0KeKQ31](https://testflight.apple.com/join/L0KeKQ31)\n\n**Pitch**: I had trouble finding a personal finance app with an emphasized focus on the current month and how much I had left to spend factoring in any upcoming payments. So I decided to build one\n\n**What life cycle stage is your startup at?** Public beta was released recently on TestFlight\n\n**What goals are you trying to reach this month?** Get as much feedback as possible from beta users to help shape the product and roadmap.  Hoping to publish the official release end of this month or early October",
            "score": 1,
            "author": "b-pixel"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:** Right QA - https://www.rightqa.com\n\n**Location of Your Headquarters:** Seattle, WA\n\n**Let people know where you are based for possible local networking with you and access to local resources:** Based in Redmond, WA. So if anyone in Redmond, Bellevue, Seattle wanted to meet in person/zoom call to understand my offering and how can I add value to the business, feel free to get in touch\n\n**Elevator Pitch/Explainer Video:** I create and maintain end-to-end automated tests for startups and save them the effort to hire and manage QAEs or automated test engineers\n\nMore details:\n\n**What life cycle stage is your startup at? :** Discovery\n\n**Your role?:** Solo Founder\n\n**What goals are you trying to reach this month? :** Trying to get first few clients\n\n**How could r/startups help?:** r/startups community can help me find first few clients\n\n\n**Discount for r/startup subscribers?:** 10% discount on first 3 months of service\n\n**Share how our community can get a discount:** Use CODE RQAREDDIT10OFF",
            "score": 1,
            "author": "rightqa"
        },
        {
            "level": 0,
            "comment": "# [ChatKitty](https://www.chatkitty.com) - Build Premium In-App Chat in 2 days.\n\n\r  \nElevator Pitch: A chat API solution that helps companies build premium in-app chat experience Quickly, Easily, and Cheaply.\r  \n\r  \nLocation: Toronto, ON, Canada.\r  \n\r  \nStage: The chat API is launched to the public.\r  \n\r  \nPurpose: Helping companies build a premium in-app chat experience quickly without the complexity of building a backend or managing servers. We provide a RESTful Chat API with cross-platform React Native SDK and Serverless cloud functions, so they have everything needed to build a reliable chat experience.\r  \n\r  \nUse Cases: In-app messaging for · Online Community Platforms · Online Marketplaces · Dating Apps · Health Care.\r  \n\r  \nProgress update: I have been posting in the r/startups for few months. I want to start to provide some updates to everyone who follows our journey.\r  \n\r  \nIn April, we made our first sale.\r  \n\rIn May, we got our first premium plan customer.\r  \n\rIn June, we got our first 10 paying customers.\r  \n\rIn July, our numbers of paying customers are growing, but we lost two important customers.\n\n\\*\\*\\*August has been one of our best months. We not only gained new customers, but also we got two growth plan customers. As of September 1st, we have over 20 paying customers and tracking to have $3000 MRR by the end of September.\\*\\*\\*\n\nIf you are interested in learning more and following our journey, check out our [IndieHacker](https://www.indiehackers.com/product/chatkitty) and [Twitter](https://twitter.com/aerovulpe).",
            "score": 1,
            "author": "uncleray21"
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:** ScanMeFindMe – [https://ScanMeFindMe.com](https://ScanMeFindMe.com)\n\n  \n**Location of Our Headquarters** – HQ Australia/Spain, operations - worldwide\n\n**Elevator Pitch**\n\n* ScanMeFindMe is a website where you can generate QR codes with a large range of colours, logos, and styles for free. You can also upload your own logos!\n* We provide a very powerful API for integrations with custom solutions.\n* The website allows you to create and save your own templates with custom captions and other features to efficiently use the same templates over and over without having to customize them again. (Additional template ideas on:  [https://github.com/ScanMeFindMe/templates](https://github.com/ScanMeFindMe/templates))\n* It is also possible to download multiple QR codes onto a single page, ready to print.\n* And a user friendly interface!\n\n**What life cycle stage is your startup at?** \n\n2. Validation (The website is now live, but there are more features to come!)\n\n&amp;#x200B;\n\n**Your role?** \\- Founder\n\n**What goals are you trying to reach this month?** \\- Reach our first clients, and receive feedback for the website.  \n\n\n**How could** r/startups **help?** \\- Provide feedback and recommend the website to others.  \n\n\n**Discount for** r/startup **subscribers?**   \nAbsolutely! The coupon REDDIT30, can be used during September 2021. Enter the code in the payment form when you decide to upgrade from the free trial to a paid membership. This will apply a 30% discount for the first year!",
            "score": 1,
            "author": "scanmefindme"
        },
        {
            "level": 0,
            "comment": "**Startup Name:** [Telios](https://telios.io)\n\n**Location of Your Headquarters:** Wilmington NC\n\n**Elevator Pitch:** You, along with 4 billion people worldwide, use email to send and receive over 300 billion messages a day. Over 90% of you use an email service provided by Google, Apple, or Microsoft. Yet, according to surveys, 60% of you don’t trust these same companies with your private data. Email contains some of your most private data and the keys to that data are in the hands of companies you said you don’t trust. Telios is an email service focused on your privacy. We enable you to send and receive fully encrypted emails through a decentralized peer-to-peer network that gives you (not us) the ownership of your private data and the keys to unlock it.\n\n**Explainer Video:** [https://www.youtube.com/watch?v=NjfIOc_5drU](https://www.youtube.com/watch?v=NjfIOc_5drU)\n\n**Stage:** Discovery\n* Designing the first iteration of the user experience\n* We are about to launch our alpha version which will have a simple but robust user experience.\n* Working towards problem/solution fit (Market Validation)\n\n**Role:** Founder / CTO\n\n**Goals:** We are trying to gain exposure and increase the number of sign-ups to gather as much feedback as we can when launching our alpha version",
            "score": 1,
            "author": "Pr1meNumber7",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Name: Castup\n\nWebsite: https://www.usecastup.com\n\nLocation: Remote\n\nLocation of the HQ: India\n\nElevator Pitch: Professional Podcast Editing from 40¢ per published minute.\n\nMore details: Castup is a audio/video editing service Podcasters &amp; Podcast Networks can subscribe to.\n\nAre you looking for anything? If you are a Podcaster, we'd love to help you out. If you're someone who's friends with a Podcast, give our Affiliate program a read.",
            "score": 1,
            "author": "busynessguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's your value prop compared to Rev (dot) com that charges $1 per minute?\n\nIs it just price? Or there's more of a differentiation?",
                    "score": 1,
                    "author": "thisisnahamed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, Rev does not provide audio editing services. They just provide transcription + other transcript related services. While we do offer some of those as well (and cheaper btw), our product is more about editing the audio. The transcript is just an add-on",
                            "score": 1,
                            "author": "busynessguy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's excellent. Thanks for clarifying",
                                    "score": 1,
                                    "author": "thisisnahamed"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Name:** Watt\n\n**URL:** [https://watt.fit](https://watt.fit)\n\n**Location**: San Diego, CA\n\n**Pitch:** Watt is a fitness tech. startup bringing strength training into the 21st century. Upgrade your existing equipment using our low-cost sensors, which automatically track your weight, reps and other statistics in our app - no more pencil &amp; paper, totally automatic. Fits any type of machine including dumbbells, bar and weight plates, plate loaded and selectorized machines, and supports devices from any manufacturer. See your progress in the app, and leverage our AI recommendation system to improve your fitness training.\n\n**Stage:** Pre-MVP.\n\n**Role:** Co-founder.\n\n**This month's goal:** 500 subscribers to our email list on our landing page. We are pre-MVP but closing fast &amp; trying to grow an interested fanbase.\n\n**How could** r/startups **help?** Get on our email list &amp; spread the word if you're interested.\n\n**Discount**: TBD when released through the fanbase email list :)",
            "score": 1,
            "author": "gambrinous_sloth"
        },
        {
            "level": 0,
            "comment": "**Startup Name:** [OneThirtyFive](https://onethirtyfive.com/)\n\n\n**Location of Your Headquarters:** Cleveland, OH\n\n\n**Elevator Pitch:** OneThirtyFive is an on-demand prospecting marketplace for B2B SaaS and Marketplace startups to exapand their reach while staying lean.\n\n\n**More details:** We're always looking for highly motivated college students ('22, '23, '24, '25) to join who are looking to gain industry and business development experience while making money in-between classes.\n\n\n**What life cycle stage is your startup at?** Validation\n\n\n**Your role?** Founder &amp; CEO\n\n\n**What goals are you trying to reach this month?** $500 in revenue\n\n\n**Discount for r/startup subscribers?** Onboarding fees and subscription costs will be waived for the first 3 interested startups.\n\n\n**Share how our community can get a discount** [Sign-Up](https://onethirtyfive.com/sign-up_client)",
            "score": 1,
            "author": "OneThirtyFive_Kevin"
        },
        {
            "level": 0,
            "comment": "**Name:** Team tracker  \n**URL:** https://team-tracker.com  \n**Location:** Cambridge, UK  \n**Pitch:**  \nWith the rise of flexible working there are challenges arising knowing where people are going to be on a given day. Team tracker provides employees a means to:\n\n* Plan and share their weekly whereabouts\n* See desk availability and book desks\n* Key track of holidays and share across multiple teams\n* Brings all this information together in a single view.\n\nWith all this it becomes easier to plan projects, arrange workshops and know when to come into the office. Integrations with Outlook, Teams and Slack mean you can update once and share everywhere.  \n**Video:** https://team-tracker.com/video.html  \n**Stage:** Validation  \n\n**\\*\\*What goals are you trying to reach this month:\\*\\*** We’ve nearly onboarded a massive corporate client, so to finish that and secure payment",
            "score": 1,
            "author": "ishysredditusername"
        },
        {
            "level": 0,
            "comment": "**Name:** Saga - [https://saga.so](https://saga.so)\n\n**Location:** Remote / Europe\n\n**Pitch:** The effortless way to make sense of your knowledge, docs, and notes.\n\n**Video:** [https://youtu.be/ybIINvn7GbA](https://youtu.be/ybIINvn7GbA)**More details:** Saga is a notes and documents editor that helps you make sense of your knowledge. It can automatically search, suggest and cross-reference information for you. Saga recognizes what you are writing and creates links to other parts of your knowledge base automatically.\n\n**What goals are you trying to reach this month?** Onboard more users and receive more feedback. Launch team collaboration in the app.**Thanks for reading this!**",
            "score": 1,
            "author": "ftsanev"
        },
        {
            "level": 0,
            "comment": "**Name:** Quonective\n\n**URL:** https://www.quonective.com/\n\n**Location:** Charlotte, NC\n\n**Pitch:** A new social network for investors and founders.\n\n**Stage:** Pre-seed/idea stage - I'm still validating and improving the idea. \n\n**Role:** Founder &amp; CEO (No technical)\n\nNOTE!: I'm still validating the idea, so everything you see now in the website is subject to change. \n\nAlso, I'm looking for two co-founders to join me in this journey (Technical and UI/UX Designer)",
            "score": 1,
            "author": "ivanavila82",
            "replies": [
                {
                    "level": 1,
                    "comment": "How will you find founders and investors?\n\nHow is it different from that Bumble connect feature?\n\nI was interested in doing something similar. More of a way to monetise it than connect people though. Regardless, I can see myself using it if it kicks off.",
                    "score": 1,
                    "author": "_Smoulder_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "URL: [https://researchai.co/free-tools](https://researchai.co/free-tools)\n\nLocation: US\n\nPitch: **Free Cover Letter for your next job in 15 seconds using AI.**",
            "score": 1,
            "author": "Fidelli_eco"
        },
        {
            "level": 0,
            "comment": "**Startup Name:** [Nerdbuilding.com](https://Nerdbuilding.com)\n\n**Location of Your Headquarters:** Denver, Colorado\n\n**Elevator Pitch:** \n\n**More Details:** Nerdbuilding.com is a random generator, meant for a fairly specific audience of tabletop gamers, worldbuilders, and writers. While global interest in these communities has increased recently, the audience is still fairly constrained. Despite their relatively small size, these communities are very passionate, and the desire for access to services and products has increased exponentially. The desire for comprehensive, integrated products and services has increased even faster.\n\n**What life cycle stage is your startup at?:** Validation (MVP launched, currently in Pre-Alpha development)\n\n**My Role:** Project Manager/ Founder\n\n**What goals are you trying to reach this month?:** 2000 users\n\n**How could** r/startups **help?:** Integration is going to be a massive part of our generator. VTT (Virtual Table Top) sites, or content management sites, such as World Anvil and Legend Keeper, are perfect examples of integration possibilities. If you, or someone you know, is working on anything related to TTRPGS, RPGs, writing, etc. I would love to work with them on possible integration.\n\n**Discount for** r/startup **subscribers?:** Right now, we have no paywalls. The generator will be free, and supported by ads. Future plans for premium accounts are in place to allow custom indexes that would make use of our coding framework. So, right now we cannot offer discounts, because there is nothing to discount.",
            "score": 1,
            "author": "thebeardedheathen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[LearnStash.com](https://learnstash.com)\n\n•Charlotte, NC\n\n•Directory of the latest and greatest personal growth books, podcast episodes, and apps organized by goal (i.e., build better habits, improve mindset, grow business skills, etc.)\n\n•My Role: Co-founder\n\n•Goals: Grow newsletter subscribers from 1500 to 2K by October and launch our membership site October 3. Subscribers of our newsletters will get $5/mo. founder pricing before we launch\n\n•Discount: Access is free for the next 30 days and then we’ll be putting the directory behind a membership paywall and will include courses and a live chat feature where you can request new recommendations for books, podcasts, and apps depending on your scenario. We’ll do the research for you and send you the best options.",
            "score": 1,
            "author": "mydogcaptain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lovely!!   \nI was searching something like this for quite some time now.  \nWhat are your plans with future expansion with this?",
                    "score": 1,
                    "author": "IntelligentLeek123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Our goal is to be a hub for discussing your personal growth journey and build the largest, thriving community of lifelong learners in the world.\n\nA place to hold each other accountable, chat about the latest books, podcasts, and apps — and ultimately encourage each other to keep growing and learning.\n\nIf you’re interested be sure to sign up for our newsletter. We’ll be sending out invites soon!",
                            "score": 1,
                            "author": "mydogcaptain",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Startup Name / URL:**  [Allverts](https://allverts.com)\r  \n\r\n\n**Location of Your Headquarters:** Edmonton, Alberta\r  \n\r\n\n**Elevator Pitch:**\n\nallverts.com, is a place where you can write up mini blog like posts to promote anything you want. You can post promotional posts like Craigslist but it is easier to find and see stuff as there is a social media like feed.  \n\r\n\n**More details:**\n\nYou can also like/dislike, comment and share posts. The home feed has a machine learning based recommendation system that gives you posts that others like you liked.\n\n\r**What life cycle stage is your startup at:** Validation\r  \n\r  \n**Your role:** Founder\r  \n\r  \n**What goals are you trying to reach this month:**\n\nGet more people to share things on the website.",
            "score": 1,
            "author": "-u-deleted",
            "replies": []
        }
    ]
}