{
    "id": "9cfm1k",
    "score": 20,
    "title": "I miss Ball State",
    "author": "1017Shaolin",
    "date": 1535922960.0,
    "url": "https://www.reddit.com/r/BallState/comments/9cfm1k",
    "media_urls": [],
    "other_urls": [],
    "postText": "I graduated two years ago and have been working since then. I recently went back to grad school at another school and it has me reminiscing about the good times I had in Muncie. It was a fun place to be, although it's unfortunate that anyone there now won't have exactly the same experience I did. When I went there, The Village was actually cool and had like 20 different bars. You could literally go to all of them in one night, get completely shit-hammered, and not spend TOO much money. They all closed during my second to last year though. But Ball State is Ball State so I'm sure everyone is finding a way to have fun. \n\n&amp;#x200B;\n\nIt was a lot more than partying though, it's just a cool place to be and there's something for everyone. There's all walks of life there and from my experience everyone was generally nice to everyone else. Those of you still there I hope you appreciate it.\n\n&amp;#x200B;\n\nChirp Chirp! ",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Locker Room was my favorite. Me and my friends would always go to the very highest table on the upper level and feel like kings while drinking our $5 pitchers haha. It's nice to see that there's still some culture there though. I wasn't there long enough to see what the village turned into. ",
                    "score": 8,
                    "author": "1017Shaolin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Village turned into a giant multi-story, multi-block apartment complex that literally casts a shadow over everything else that’s still there.  The first floor of that complex is all retail and is sitting about 50% empty (if not more). There have already been a couple of failed restaurant ventures there.  From what I’ve read, the retail leases in that building are very high. The Village was everything when I was a student (a long, long time ago) and downtown was empty. Now, it’s almost the opposite. Most new bars and restaurants that open, do so downtown - where the buildings are older and leases are more reasonably priced.  Muncie is small and businesses around here have to be able to survive the BSU summer break. For whatever reason, the locals here only venture to the Village for Scotty’s, Greek’s, and The Cup. Meanwhile, downtown, there are now a total of 12 bars/restaurants - including three local breweries. ",
                            "score": 4,
                            "author": "shacklyn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Speaking as a formal local and bsu student, locals like the chug and they liked that martini bar above the mt cup until it went out of business, but Greeks is a freaking tradition and a must. My last night of living in Muncie, I went to Greeks. Greeks and pizza king, and even though they have franchises in other cities it is not the same as in Muncie. “Pizza forum” and “Clara’s” my ducking ass. ",
                                    "score": 3,
                                    "author": "kanooka"
                                },
                                {
                                    "level": 3,
                                    "comment": "Huh. When I was there downtown just had The Heorot and Savage's. I guess it's cool that there's more in downtown Muncie though. ",
                                    "score": 1,
                                    "author": "1017Shaolin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah, there was the fickle peach, doc’s (unless that closed less recently than I remember), etc\n\n",
                                            "score": 1,
                                            "author": "kanooka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh yeah, I forgot about the fickle peach. Only went there once or twice. Savage's was my go-to.",
                                                    "score": 1,
                                                    "author": "1017Shaolin"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "word",
            "score": 3,
            "author": "sgnmac"
        }
    ]
}