{
    "id": "c0jusf",
    "score": 3,
    "title": "Fraternities",
    "author": "w_r_3190",
    "date": 1560517457.0,
    "url": "https://www.reddit.com/r/BallState/comments/c0jusf",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm an incoming freshman and I've always wanted to join a fraternity. I'm also bi; does anyone know if that matters to fraternities? I'm not one of those people who shoves it down your throat and makes being bi my whole personality, but I feel as though I should be upfront about it. Anyone have any advice/insight into this?",
    "comments": [
        {
            "level": 0,
            "comment": "As fraternities go, Ball State’s are pretty progressive for the most part, so I don’t think most fraternities would even care to be honest. It’s not like you are going to be asked at the door do you like guys or girls. \n\nI’d encourage you to meet all the fraternities and don’t just settle on the first rush event you go to. At the end of the day, it’s about finding where you feel most comfortable and at home. You might even find out that joining a fraternity isn’t for you.",
            "score": 14,
            "author": "abdunworth"
        },
        {
            "level": 0,
            "comment": "In all honesty, it depends on what fraternity you rush. Some chapters have almost no LGBT members, others have a large amount. I highly recommend going to the Meet the Greeks event during the Fall semester to \"meet\" all of the fraternities and see which chapters you are interested in. Don't be afraid to be yourself and if you run into any jerks, you probably won't want to be in their fraternity anyways. Feel free to PM me if you'd like a list of fraternities that are more LGBT friendly at BSU to look out for at Meet the Greeks. If not, then trust the system and have a blast.",
            "score": 5,
            "author": "malaka2247"
        },
        {
            "level": 0,
            "comment": "I was in a fraternity and we had a few guys in the LGTBQ community join and there were no problems whatsoever. We never made a big deal about it and as far as I know there were no hateful comments towards them. \n\n\nBut like most other people said, try a bunch of fraternities and see what one fits you best I’m sure there’s a lot more than the one I was in that is accepting.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm sure it varies from frat to frat. Some are douche-canoes and others are regular ass dudes. Don't put all your eggs in that one basket though. You don't have to pay for friends, especially at Ball State.",
            "score": 12,
            "author": "1017Shaolin"
        },
        {
            "level": 0,
            "comment": "You should really just focus on being yourself when you go through rush. And ask lots of questions. When I went through rush years ago, I was dead set on one fraternity until I asked a question regarding hazing. When I couldn’t get a straight answer, I was out. \n\nThe experience will only be whatever you make of it. \n\nI’d also suggest either waiting until spring or your 2nd year before you rush. Actually making friends the old fashioned way, either in classes or in the dorms, was more beneficial to me. The people I’m closest to 20 years later I met in Schmidt/Wilson.",
            "score": 5,
            "author": "Capta1nRon"
        },
        {
            "level": 0,
            "comment": "Everyone here is forgetting that Spectrum is a Greek organization too. Spectrum is the LGBT one. I don’t know too much about it but that would be worth looking into.",
            "score": 1,
            "author": "7dreamweaver7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spectrum is not a greek org",
                    "score": 0,
                    "author": "sunhitter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My bad, Gamma Rho Lambda.",
                            "score": 2,
                            "author": "7dreamweaver7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Late reply but: I was a Phi Sig when I was at school and we had a bi guy rush one of my last semesters in the chapter. None of us cared, we joked about it with him and treated him just the same. I think you'll find that true for most chapters.",
            "score": 1,
            "author": "Juls317"
        },
        {
            "level": 0,
            "comment": "I’m late to this conversation, but I thought I should add this: Ball State’s Greek Life is very progressive and I wouldn’t worry about it. I can think of one fraternity off the top of my head that has a handful of LBGT members and I can also think of one fraternity in particular that has a few guys that are bi. Ball State Greek Life is the island of misfit toys; I know you’ll find your place. Ball State has a Chapter for everyone.",
            "score": 1,
            "author": "plucktheduck2"
        },
        {
            "level": 0,
            "comment": "Tbh in that community I would keep it to myself or only tell code friends. Like if it comes up that's fair but it's pretty hard to tell someone is bi. And I'm sure some frats are more lgbt friendly than others",
            "score": -2,
            "author": "Kenna193"
        }
    ]
}