{
    "id": "etnjpa",
    "score": 9,
    "title": "Any advice for the writing proficiency exam?",
    "author": "intp-amelia",
    "date": 1579935578.0,
    "url": "https://www.reddit.com/r/BallState/comments/etnjpa",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm taking mine soon and want to know if there's anything I (or others) should know!",
    "comments": [
        {
            "level": 0,
            "comment": "Understand how to write a coherent essay? Then you should be fine. If you can write a paragraph with a good thesis, support and conclusion you will be fine. Make sure you understand how to use quotes and citation correctly- I think they have you reference an article in your writing. If you’re worried you can always stop by the writing center and see if anyone has advice for you.",
            "score": 3,
            "author": "_Nemzee_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or email TCOM professor Paige Waters to schedule a private meeting. She’s super nice. She was my professor during the session.",
                    "score": 5,
                    "author": "c8it"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, I wouldn't sweat it too much. The exam really seeks to find out if you can right an organized, coherent essay. I did a five paragraph essay (intro, main point 1,2,3 and a conclusion). \n\nI had a professor who said he used to grade the exam. He said that honors students and English majors were most likely to fail simply because they overwrote and lost any semblance of organization. \n\nI went in blind and just made sure to make sure my email essay was organized and threw a few big vocabulary words and it was fine. \n\nIf you are really stressed, try and take closer to the 60 credit hours mark than the 90. That way you can take it again if need be. \n\nDon't worry too much though, you've got this!",
            "score": 3,
            "author": "twerking_nine2five"
        },
        {
            "level": 0,
            "comment": "Don’t wait til the last second to print out your article lol",
            "score": 2,
            "author": "yee12haw",
            "replies": [
                {
                    "level": 1,
                    "comment": "And read it multiple times before the exam",
                    "score": 3,
                    "author": "JRoyalSmoochie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The TCOM department hosts a help session. The professors are apart of the team who grades it. There’s tons of posters hanging around letterman and AJ with the dates and times. It’s usually the week of. I totally recommend going, this was the reason I passed. I failed the first time.",
            "score": 2,
            "author": "c8it"
        },
        {
            "level": 0,
            "comment": "Write the most direct 5 part essay you can. Don't make it complicated. Your writing to the prompt. It's not hard, just don't overcomplicate it.",
            "score": 2,
            "author": "lmmyers12"
        },
        {
            "level": 0,
            "comment": "You've been given solid advice by everyone here.  When I took it I took it a bit close to 90 credit hours and passed it the first time.  Like everyone said, just make sure you know how to write a coherent essay and how to properly cite evidence and you'll be fine.  I think I printed out my article a week in advance and then just underlined and marked stuff that got my attention.  Marking up texts makes things a hell of a lot easier in my experience so if you think that will help, do it.  If you don't pass after 90 credit hours I think there's some seminar you can take but I don't know a lot about it.  \n\nYou've been given good advice in this thread!  Good luck and don't stress too much!!!",
            "score": 1,
            "author": "AggressiveTulip"
        },
        {
            "level": 0,
            "comment": "Find out how it is graded.",
            "score": 0,
            "author": "Kenna193"
        }
    ]
}