{
    "id": "f3aaar",
    "score": 11,
    "title": "Disappointing conclusion to an insane event, how does everyone feel about it?",
    "author": "Gingarius",
    "date": 1581601992.0,
    "url": "https://www.reddit.com/r/BallState/comments/f3aaar",
    "media_urls": [
        "https://www.theindychannel.com/news/local-news/ball-state-professor-at-center-of-controversy-wont-teach-rest-of-semester"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\" *Dr. Borna will not be teaching  classes for the remainder of the semester. This decision is in the best  interest of Dr. Borna and the University.\"*  \n\nYes, the best interests of Borna come first and then the university. I guess they don't care about the best interests of the students.",
            "score": 10,
            "author": "jccalhoun",
            "replies": [
                {
                    "level": 1,
                    "comment": "False",
                    "score": 1,
                    "author": "SwankyBarbecue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t live there anymore but I’ve heard about this incident. Why was the person being asked to move and why wouldn’t they move?",
            "score": 5,
            "author": "MrKittenz",
            "replies": [
                {
                    "level": 1,
                    "comment": "So supposedly, in Dr. Borna's syllabi there's a part that says any students on laptops will be required to move to the front of the class. \n\nThe student in question did not sit in the front of the class because the seats were already full of other students with laptops. He sat in the back to borrow a laptop charger if I remember correctly.\n\nOne student left, and Dr. Borna singled him out to move to the front, even though there were supposedly other students also on their laptops not in the front. \n\nWhen the student refused, Dr. Borna called UPD. Which no matter how you look at this whole thing, was the wrong move. The student wasn't being aggressive and felt like he was being singled out because of his race.\n\nUPD wasn't hostile but they weren't exactly nice. They seemed to take the professor's side. Ultimately, the student just left the class because there is video and his classmates were on his side. It's just a bad situation all around.",
                    "score": 15,
                    "author": "twerking_nine2five",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From what I've heard, the Prof had a student working in the department to call UPD for a disruptive student, so basically Prof lied to get UPD to show up and they thought they were responding to someone disrupting class and knowing what they were told, handled it as well as we can hope (remember they didn't know why the student was at all because it wasn't communicated to them and they are psychics). From what I've heard after the fact, UPD hates the situation just as much as the students because they were used for a petty reason.",
                            "score": 7,
                            "author": "Hunter8Line"
                        },
                        {
                            "level": 2,
                            "comment": "100%. I agree that the professor overreacted, but he sincerely apologised after the incident. We've only heard the student's side of the story. Both he and other students are pulling the race card just because the student happens to be black. The portion of the incident that went viral was pulled out of context as well. This is not acceptable! I feel sorry for this professor, he will now be labeled as racist for no legitimate reason!",
                            "score": 3,
                            "author": "SwankyBarbecue"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "TLDR: Borna’s “punishment” after all this time is no longer being allowed to teach for the semester. \n\nThere is no mention of any corrective training or service either and it’s to be assumed he will return in the fall and continue things as always sadly",
            "score": 9,
            "author": "Gingarius",
            "replies": [
                {
                    "level": 1,
                    "comment": "As I understand it, tenured professors are incredibly difficult to fire. I can't speak for the professors, but administration at Ball State only recently became at-will employment. \n\nPrior to the switch, there were clauses in administrative contracts that entitled employees to one year's notice before they were let go.\n\nSo I imagine that given how long Dr. Borna has been at the university, the university couldn't just fire him. If anything, they might just be trying to make his position functionally obsolete until they can actually let him go.",
                    "score": 4,
                    "author": "twerking_nine2five"
                },
                {
                    "level": 1,
                    "comment": "Corrective training was described in President Mearn's email to the campus 2 days after the event.  Being benched for the semester is in addition to that stuff.",
                    "score": 6,
                    "author": "stoopnagel99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do remember a mention of that but I feel that a spot light should’ve been shone more on that in the statement. Ball State is no longer commenting on the subject so I’m gonna assume the early semester end is the only punishment.",
                            "score": 0,
                            "author": "Gingarius"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hope ar the very least he isnt getting paid, but he probably is.",
                    "score": 2,
                    "author": "Dr_Doorknob"
                },
                {
                    "level": 1,
                    "comment": "It’s not punishment. It’s for his safety because idiots were threatening harm to him through calls, emails, etc.",
                    "score": 1,
                    "author": "Express-Stuff"
                },
                {
                    "level": 1,
                    "comment": "\"sensitivity training.\" What does that even mean? Sounds like a made-up snowflake term.",
                    "score": 1,
                    "author": "SwankyBarbecue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean I don’t remember treating others with respect and understanding as being a snow flake. \n\nI don’t know why a lot of people think this is an “attack on professors” or a “student crying for attention”, this situation is just truly disappointing as a Ball state student. \n\nA student, just like you and me (I’ll assume), minded his business and was trying to work hard but was targeted after causing no trouble or harm. \n\nThis isn’t where we all sing Kumbaya and hold hands but honestly would we rather have cops called on students than that? “Sensitivity training” isn’t some whole new idea, for generations as a society we’ve finally begun to realize how backwards things were and for some it’s taken longer to adjust, thus why sensitivity training is crucial. \n\nAll in all, we all just want Ball State to be a school we can be proud of and be behind and I know personally, this event has left me ashamed and questioning what limits tenure professors truly have.",
                            "score": 7,
                            "author": "Gingarius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I appreciate your humble approach.",
                                    "score": 3,
                                    "author": "SwankyBarbecue"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly unacceptable.",
            "score": 4,
            "author": "Cjamesdixie01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely. All this time just to give him a basically three month early start to vacation is a complete joke. \n\nNo mention of training either which is horrific. I knew this case would get side swiped the second it started, tenure professors have no respect for the rules as they just don’t apply to them anymore.",
                    "score": 5,
                    "author": "Gingarius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But what was the disruption? While it is an ability of a professor, this was an abuse of power and lack of regard for common sense and safety of the class. \n\nThere’s a lot of questions that need to be answered and the fact Ball State has been so hesitant to do anything shows we will probably never get any true conclusion and this behavior will be accepted by the people that are here claiming to set us up for a better future.",
                                    "score": 1,
                                    "author": "Gingarius",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They absolutely threw him under the bus, because every action he took was the result of the student refusing to follow his request not once but multiple times. Read the syllabus Mufasa and all others signed on day 1. Read the student code of rights and responsibilities, appendix F, I believe, and the fact that office of student conduct advised the professor last year if a student disobeys then he is to call UPD. Mufasa is a big guy, Borna is 5’, if that, and 100 lbs soaking wet. You tell me who felt threatened. They put him on leave because people were making serious threats to him via email and phone. This was all about behavior and nothing about race, they just cowered to bullies.",
                                                    "score": 1,
                                                    "author": "Express-Stuff",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "100 lbs is 45.4 kg",
                                                            "score": 1,
                                                            "author": "converter-bot"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I stand with this professor. Part of going to university is learning discipline and obviously this “student of color” needs to learn it. I’m a student and I am not sure where they’re getting the bit that students called for this teacher to retire and do sensitivity training. It’s a shame that they have to mention that it’s a “student of color” like it’s a race issue. Shit news story and shit people.",
            "score": -1,
            "author": "Ottawa_bass_catcher",
            "replies": [
                {
                    "level": 1,
                    "comment": "100%. I agree that the professor overreacted, but he sincerely apologised after the incident. We've only heard the student's side of the story. Both he and other students are pulling the race card just because the student happens to be black. The portion of the incident that went viral was pulled out of context as well. This is not acceptable! I feel sorry for this professor, he will now be labeled as racist for no legitimate reason!",
                    "score": 5,
                    "author": "SwankyBarbecue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m still a little iffy on the “apology” that was reached, it felt the most basic possible and just really didn’t address what was happening. \n\nI know Borna is in a tight spot but not for any random reason, he made some truly rash decisions and sadly, this professor is also notorious for targeting students, primarily black. \n\nI’m not going to claim he’s a racist as I nor anyone truly knows why this happened but I think it’s safe to agree this professors had a rough past, out of the 34~ years he’s been here 20 of those are filed with valid and large complaints. I think calling police on a student because he was minding his business in a seat he was assigned at the beginning of class is way over the line and Borna knows that but because he’s tenure, he can honestly do whatever he wants which I think everyone truly needs to think about.",
                            "score": 0,
                            "author": "Gingarius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This student left out a key factor when replying to the media: the syllabus mentions that anyone with a laptop must sit in the front of the class. He wasn't singled out because he's black like he says he was, he had his laptop open. This student's ignorance is to blame!",
                                    "score": 3,
                                    "author": "SwankyBarbecue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "While yes that’s true, the student was seated there by Borna and was oddly called out when a front seat student left the class. \n\nI can see why people will argue that but what I think matters most is what would it have changed moving the student. He was just minding his business after being seated once by the professor and then was not causing a scene at all. The students defended him saying he was just like everyone else so it seems no one else was troubled or minded. \n\nI believe the main issue here is abuse of power and just odd endangerment of the class. The police are not meant to be used as a power flex on students and Borna has a history of pushing his limits as a tenure professor. \n\nThe student was not ignorant, but instead just like us who is now in the spotlight of an ugly situation.",
                                            "score": 1,
                                            "author": "Gingarius",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He was not seated in the back of the room by the professor. The student chose to be there after his assigned seats was taken by another student.",
                                                    "score": 1,
                                                    "author": "SwankyBarbecue"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not true at all. He’s a stickler for rules, and he has rules explained in the syllabus everyone including Mufasa signed on day 1. If you refuse multiple times like he did, to follow a professors request, that is insubordination and disrupting the class, and is explained in student rights and responsibilities. Further regarding conduct, the Office of Student Conduct advised him last year that when that happens he is to call UPD.",
                                    "score": 2,
                                    "author": "Express-Stuff",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Being a stickler and being power hungry are much different. Mufasa minded his own business after his seat was taken and was not disrupting the class at all. The only person who disrupted the class was Borna himself. From what I know lots of kids sit in the back of the room with their laptops and don’t get cops called on them. I’m still ashamed in BSU for allowing such incredible misuse of power and letting Borna off the hook with no punishment for endangering the class",
                                            "score": 1,
                                            "author": "Gingarius",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He’s not power hungry. You do not know him at all. He is the most humble, polite, courteous person you would ever meet. He is a man of customs, who grew up being taught respect, rules, and all that goes with that. Something none of you would know about. Again, each professor has their own class rules and it is the RESPONSIBILITY of the student to adhere to them. He signed it. Like it or not, it was all spelled out. There was no danger to the class y’all are blowing this out of proportion. UPD is ALSO there to provide BUILDING SECURITY. Which is what that call was about. He is just a whiny brat and y’all are feeding into this with a ton of misinformation.",
                                                    "score": 1,
                                                    "author": "Express-Stuff"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you can't understand the scrutiny and negative cost of living due to the inherent racism in America for any non white-passing person and choose not to understand, well... You're not a POC, but a POS",
                    "score": 3,
                    "author": "phoenixjayne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do data collection for quarterly cost of living surveys and that’s the most ignorant comment I’ve heard. Goods and services don’t cost more for POC. In fact, they cost less in poorer communities than they do in affluent ones. Do you see the checkout charging a POC more for an item than the white guy? Further, what the hell does that have to do with this entire conversation?",
                            "score": 1,
                            "author": "Express-Stuff"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what an ignorant person you are, its unfortunate i have to share a campus with people like you. &amp; im 100% you wouldn’t say any of that shit to his face if you saw him lmao",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m 100% sure I would and I’ve already contacted the board of directors in support of the professor. It’s a shame I’ve got to share campus with you. You’re a disgrace.",
                                            "score": 1,
                                            "author": "Ottawa_bass_catcher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m the disgrace? lmao in what way? If you’d say it to his face let set up a meeting then",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What so he can pull the race card and sue me. Obviously you are immature and are unsure how the world works.",
                                                            "score": 1,
                                                            "author": "Ottawa_bass_catcher",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "lol yeah, everyone else in the world is so stupid and immature and undisciplined and you’re just god’s greatest creation. \n\nlike i said, you wouldn’t say that shit to his face so stop acting over the internet",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Okay Afro skater.",
                                                                            "score": 1,
                                                                            "author": "Ottawa_bass_catcher",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "🤟🏽",
                                                                                    "score": 1,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "White males are the most discriminated against people in USA. Look at all the scholarships and grants for people of color. You get into college over white males if you’re colored simply because you’re not white. I think you should take a step back and check reality",
                            "score": 0,
                            "author": "Ottawa_bass_catcher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’d like to first always ask how again was the student causing trouble? He was isolated out of the rest of the class for doing nothing different than everyone else. \n\nTake it with a grain of salt, maybe Borna wasn’t racially challenged in his decision, but in context it’s just wrong and dangerous. There is a huge disparity between people of color and law enforcement. \n\nThat whole topic is another debate but at the end of the day, why would we be mad at others working towards a brighter future for themselves? Yeah sure “maybe” you’ll be more likely for aid if you’re a minority but who would read that and think that’s not okay.",
                                    "score": 1,
                                    "author": "Gingarius",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree that the professor over reacted, but this student clearly did not read the syllabus! His ignorance is framing the professor as a racist!",
                                            "score": 1,
                                            "author": "SwankyBarbecue"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}