{
    "id": "fb07j4",
    "score": 5,
    "title": "Advise on moving off campus",
    "author": "giggle1234557",
    "date": 1582918426.0,
    "url": "https://www.reddit.com/r/BallState/comments/fb07j4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I’m a freshman and I’m thinking about moving off campus next year into University Village but I keep hearing that living off campus will really isolate you from the campus life. Currently, I live in the dorms and am rarely in my room at all. In addition, the village has a shuttle and claims to add a night bus next year. I was wondering what your experience is like off campus and if you would do it as a sophomore. Mainly, can you live off campus and still get the “college experience”?",
    "comments": [
        {
            "level": 0,
            "comment": "From a financial standpoint, you'll really appreciate living off campus when you see your student loans. My wife probably could have saved $10,000 by moving her sophomore year.\n\nTo answer your question, yes you can still do things on campus while living off. Also, you experience different things living off campus as well. I transferred there and I never lived in the dorms and I met all of my friends either through class, roommates or neighbors.",
            "score": 10,
            "author": "mfilosa17"
        },
        {
            "level": 0,
            "comment": "IMO better as a sophomore to use your resident hall \"seniority\" over the incoming freshmen and get a newer/more central dorm. And given you don't have a solid friend group yet, stay on campus another year to see what else materializes in terms of your social life next year. Then move off campus when you're a junior.",
            "score": 12,
            "author": "heres_one_for_ya",
            "replies": [
                {
                    "level": 1,
                    "comment": "^^This!  If you don’t have a close knit group in the dorms, then your dorm sucks and you should move to another dorm. I made more lifelong friends from the dorms than I did from joining a fraternity.",
                    "score": 3,
                    "author": "Capta1nRon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My freshman dorm wasn't very social. But I was in the male honors dorm, so people weren't very sociable. Other guys I knew who lived in LaFollette still have a great group of friends who still hang out to this day.",
                            "score": 1,
                            "author": "heres_one_for_ya"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "off campus is way better. don’t rent with best bsu rentals though",
            "score": 5,
            "author": "onlycameforthekate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why is it way better?",
                    "score": 1,
                    "author": "giggle1234557",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "more freedom, more adult feeling. i still walk to class and things like that but i couldn’t wait to get out of the dorms, personally.",
                            "score": 3,
                            "author": "onlycameforthekate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you feel like you still were able to socialize easily?",
                                    "score": 2,
                                    "author": "giggle1234557",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yes just get some roommates, meet your neighbors, go on walks. you’ll see people and make connections.",
                                            "score": 1,
                                            "author": "onlycameforthekate"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk if it was just me, but the second I moved off campus, I basically never went back on campus. I lived a 5 minute walk from the building 98% of my classes were in and thats as deep into campus I went. If you’re friends with the people you live with, it makes it fun. I would suggest renting a house over an apartment, though... apartments are just glorified dorms.",
            "score": 5,
            "author": "ExpensiveTap1"
        },
        {
            "level": 0,
            "comment": "I feel like it depends on if you have a good group of friends already solidified or not. If you already have friends I’d say as long as you stay in contact you have nothing to worry about.",
            "score": 5,
            "author": "subparhumor",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a boyfriend on campus and I have friends but I’m not sure about a solid friend group.",
                    "score": 2,
                    "author": "giggle1234557"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t understand the idea of not having the college experience living off campus. Personally a big part of the college experience is living off campus with roommates. If you end up living far from campus or in another town then yeah, that’s another situation all together. \n\nI agree with some of the others here though. Stay in the dorms another year and solidify that core group of friends if you can afford it. Then move to a house or apartment. Sophomore year you learn who’s dorm room everyone’s gonna run to when the cops bust the party. Next year you pre party at that person’s apartment. Or don’t. You do you boo",
            "score": 3,
            "author": "8WhosEar8"
        },
        {
            "level": 0,
            "comment": "If you want to keep the college experience then live within walking distance of the campus. Once you have to drive and park to do anything, you’re no different than a commuter.",
            "score": 4,
            "author": "Capta1nRon"
        }
    ]
}