{
    "id": "fuew9f",
    "score": 4,
    "title": "Best apartments on/off campus",
    "author": "boilerupbabe",
    "date": 1585942557.0,
    "url": "https://www.reddit.com/r/BallState/comments/fuew9f",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ll be a graduate student in fall 2020 (undergrad from Purdue) any tips on where to be and places to avoid will be nice! TIA💕",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly, if you can get into University apartments you'd be in good shape. Cheaper than living anywhere else. They don't have every amenity known to man but you have Ball State as your landlord, they're very responsive to issues. You have all utilities included in your rent (tv, internet, electric). Lived in them 4 years and it was terrific. \n\nEdit: Stayed in Anthony (north side of campus) for 4 years, loved it. Anthony is on campus but a ways from the dorms. It is totally walk-able and right next to a bus stop, but I'd recommend a bike as it is probably the best way to get around campus.\n\n The other complex is Scheidler, which is mostly townhouses. The real drawback is they aren't on campus and if you missed the last bus back it is a fair walk across a couple busy roads. Most people get along fine w/ just the bus, but French grad student used a scooter (and it worked out great for him).",
            "score": 6,
            "author": "Nikoli_Delphinki",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really liked living at Scheidler. It was much quiter than when I lived at Windsong (Silvertree) and maintenance was better too. Plus I could use BSU scholarship money to pay rent 😎",
                    "score": 1,
                    "author": "notnatalie"
                },
                {
                    "level": 1,
                    "comment": "Love scheidler! I lived at the Haven for a year and maintenance and the front office staff were horrible. Scheidler is so awesome. Love the staff and maintenance. Super cheap too!",
                    "score": 1,
                    "author": "c8it"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve heard the worst about The Haven. Even visiting there a couple times it’s kinda sketchy. I’m at Varsity House right now and it’s not bad even though the rent isn’t the cheapest.",
            "score": 3,
            "author": "Dutchy___",
            "replies": [
                {
                    "level": 1,
                    "comment": "The haven was the absolutely worst experience for me. Do not recommend at all",
                    "score": 4,
                    "author": "belljar6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was loud and hectic. The bus service they provide to campus was out of service a lot. My roommate violated her lease and they did nothing about it. I eventually moved out early yet they kept illegally charged me for electric and stuff. Then when I continued to call they switched management 3x. They tried to charge me more for missing keys yet they actually had them all along and lost them. Then when they did find that and the paperwork they swore I had put the fake papers in their locked office. Also they charged me and my other roommates that were there (even though we had photo proof and signed copies proving otherwise) for damage the other roommate did while she lived there before us.\n\nEdits: grammar",
                                    "score": 2,
                                    "author": "belljar6"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Avoid ANYTHING from Campus Rentals !!!!!!! Can’t stress enough.",
            "score": 3,
            "author": "yee12haw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, seriously. If you value anything you own, your personal safety, and privacy don’t rent from them.",
                    "score": 1,
                    "author": "Allio188",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“BSU campus rentals”?",
                            "score": 1,
                            "author": "boilerupbabe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Generally speaking, the closer to campus you go, the more of a “college kid” vibe you get. More parties, more litter around, stricter contracts etc. I’ve found places like Mill Pond, Sugarbush, and Fox Brook to be good options. Places like University Village Muncie and the Village Promenade have nice amenities but boy, they can be pricey. Good luck!",
            "score": 2,
            "author": "savannahotterburgh"
        },
        {
            "level": 0,
            "comment": "I lived in a 3br townhome at Beacon Hill for 2 years and had a good experience. The manager was reasonable and nice, and I always had quick responses from maintenance when needed. Very close to campus. Downsides are that they're kind of old (not gross or anything, just older) so you have to keep a close eye out for any maintenance issues, but I had very few while I was there. Other downside is that it's around the corner from the fraternity houses, so if you're a light sleeper, you probably would want a unit towards the back of the complex to avoid the loud freshmen sounds on weekends. It's been a few years so things could be different now, and have no idea what they charge for a room there now, but I liked it.",
            "score": 2,
            "author": "_littlebee"
        },
        {
            "level": 0,
            "comment": "I live in the 400 apartments and love it.  The landlady is sweet as can be and maintanence is always responsive.  Sadly no dogs allowed but you can have other pets.  They're one of the only places that let me have 3 cats and for pretty cheap too.  They have 1 bedroom, 2, and 3 bedroom apartments.  You pay electric/gas and for your own internet though.  I love it.",
            "score": 1,
            "author": "AggressiveTulip"
        },
        {
            "level": 0,
            "comment": "There are some cool houses in the old west end as well.",
            "score": 1,
            "author": "Kenna193"
        },
        {
            "level": 0,
            "comment": "avoid silvertree and their properties",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’m looking to sublease my room in my house next year. I’ll PM you!",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}