{
    "id": "gkkybk",
    "score": 8,
    "title": "What’s it like to be LGBTQ+ on campus?",
    "author": "SpoopGoesForALoop",
    "date": 1589588734.0,
    "url": "https://www.reddit.com/r/BallState/comments/gkkybk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was the only queer person at my high school and I’m wondering what it’s like to be queer at Ball State University, which is a rather large school\n\nDoes the campus(dorms, faculty, students in general) feel welcoming? Is there a LGBTQ+ presence on campus or do you feel isolated? How do you connect with other LGBTQ+ people? How would I get connected?",
    "comments": [
        {
            "level": 0,
            "comment": "As a member of the LGBTQ+ community I can tell you I never felt isolated or unwelcome. The guy that I dated for three years and I had no concern with holding hands in public, and this was quite a few years ago, so I can only imagine it has gotten even more inclusive. Spectrum is the campus organization that supports the LGBTQ+ community and put on many great events during the year.\n\n&amp;#x200B;\n\nOf course you will always face bigots and stares as you're mixing people together of all sorts of backgrounds, but I don't think I ever heard a verbal insult in my 6 years on campus. Honestly, if anything, I felt like the LGBTQ+ community was more difficult than anything (gay dating....yeesh........). Haha seek out Spectrum, talk to your RA's (they'll know how to help you out!) and just make friends of all sorts...you'll make your way to people you can identify with and feel comfortable around!",
            "score": 12,
            "author": "yoyojoe13",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re the only LGBTQ+ person I know of who’s responded so I really appreciate hearing your experience on campus. It’s great to hear. Thanks for the advice!",
                    "score": 3,
                    "author": "SpoopGoesForALoop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like everyone else here explained it perfectly.  I would like to add, in the Village, which is right next to Ball State where there are a lot of bars and restaurants and stores, there is this one place called the Queer Chocolatier.  The Queer Chocolatier is basically a chocolatier that sells truffles and chocolate beverages that is LGBTQ+ friendly.  The owners are unapologetic queer and it is a very positive LGBTQ+ space in walking distance from campus.  They sell very good truffles.  It is a really good and positive atmosphere and I would recommend checking it out down there.\n\n [https://www.queerchocolatier.com/about](https://www.queerchocolatier.com/about)",
            "score": 7,
            "author": "awkward_actress",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oooooh I love truffles! I’m so excited to check it out when I visit campus!  Thanks!",
                    "score": 4,
                    "author": "SpoopGoesForALoop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there! So I hope someone can weigh in on on campus lifestyle(I can’t) but maybe I can fill you in on a little of everything else Muncie LGBTQ+. \n\nMuncie is very liberal as far as Midwest small towns go. I have a few rentals and about 1/2 of my tenants are LGBTQ+ and they really like living downtown. Mark III Tap room, when it’s open(covid needs to go home) is a wonderful inclusive space as are all the other bars, coffee spots, hang out places I’ve been to. \n\nIn general I feel like Muncie is very much inclusive and if you ever feel weird on campus(don’t think you will at all) there’s other places you can find some like minded/inclusive/awesome people.",
            "score": 4,
            "author": "Disregardmypain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for your answer! Really encouraging to hear :)",
                    "score": 2,
                    "author": "SpoopGoesForALoop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey no problem! I want to add-don’t let all of your experiences be on campus/Village(the area where BSU students frequent). Muncie gets a bad rap sometimes. It really is a nice little city. I live 90% of the year in New Orleans and it’s amazing, but I find Muncie to be a nice little get away. Relaxing, simple, a little sweet spot in the Midwest. I’m basically the female version of Gary from Parks and Rec lol",
                            "score": 5,
                            "author": "Disregardmypain"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Spectrum is the LGBTQ+ club/student org on campus. Frankly, I think Ball State is a pretty liberal campus (most of the student body at least) and people will treat you with respect regardlessly. Ball State was (still is, I think) also part of the \"brave space\" initiative. Some offices I know of were also considering getting their pronouns on their nametags and a lot of administrators I've met will include them in their email signature. \n\nI would hope you'd feel welcome and at home there. It would be a pretty stark contrast from a rural, small-town high school imho. Hope this helps.",
            "score": 3,
            "author": "twerking_nine2five",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m getting the impression that it’ll be different in a very good way. Thanks for the helpful response",
                    "score": 3,
                    "author": "SpoopGoesForALoop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! Good luck with your education!!",
                            "score": 3,
                            "author": "twerking_nine2five"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m heading in to my senior year as a theatre major, and members of the LGBTQ+ community are ABUNDANT. The dating scene is reflective, though, of anywhere you go - dismal at best. 😂\n\nHonestly, though, I’ve never felt more included in any setting I was a part of. I’ve worked with numerous groups on campus, have had projects ranging from Muncie Community Schools to one of the largest student-led organizations on campus and my sexual orientation has been nothing more than a passing thought.\n\nWe are all welcomed and accepted by the faculty and staff and doubly-so for the students. Not to mention that Muncie is (hopefully!) planning its first-ever Pride event during this upcoming school year. We’ll be on campus for it all, so who knows what will happen!\n\nI am so excited for you to experience Ball State as a queer student, and I think you’ll find a wonderful spot. Be prepared to see your fellow students protest (peacefully but often comedically) any naysayers and picketers at the Scramble Light, though.  Wishing you the best!",
            "score": 3,
            "author": "willhitejusten"
        },
        {
            "level": 0,
            "comment": "I'm an arts major and all of my projects inspired by my experiences as an L(G)BTQ+ person have received warm welcoming. I can give a general blanket statement that the visual fine arts department is very welcoming. I only felt unsafe when realizing that many of the church organizations on campus believe that being gay is a sin. I stopped going to the Revolution because I felt depressed about it. Obviously not everyone believes that. But I think the management does since thats what my small group leader was telling me.. Other than that, BSU is an awesome place and I've felt safe in our classrooms, dining facilities, and dorms. Feel free to express yourself and feel safe at our University! Nobody has EVER jeered a slur at me. I'll be a senior in the fall.",
            "score": 2,
            "author": "chadasaurus001"
        },
        {
            "level": 0,
            "comment": "I'm bi and a returning sophomore for the 20-21 school year and I was just fine last year. That being said, I don't really care to get involved in the LGBT groups and stuff. I think you'll find that Ball State is a place where you can find friends no matter who you are. A large majority of my friend group is conservative, including my roommate, and they were still completely ok with it (they may have been a bit more accepting bc I'm also conservative).\n\n&amp;#x200B;\n\nIt really is what you make it. If someone doesn't accept you for who you are, ignore them and find people who will (not just on campus, but in life as well). It's a big enough school that I promise you will! If you need advise or a friend on campus, feel free to hmu.",
            "score": 2,
            "author": "w_r_3190"
        }
    ]
}