{
    "id": "gv7l0x",
    "score": 5,
    "title": "Dorms this year?",
    "author": "dishbish8478",
    "date": 1591105429.0,
    "url": "https://www.reddit.com/r/BallState/comments/gv7l0x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Any one have an opinions or ideas on how it’ll be dorming this year? I’m anxious to see what Mearns will say in the next couple days regarding it. Sad we can’t sit in the dining halls either",
    "comments": [
        {
            "level": 0,
            "comment": "I think opening the dorms is going to be a mistake honestly and get a lot more students and families sick and endanger professors and anyone immunodeficient. \n\nI know everyone wants to come back and enjoy a normal life again but Indiana alone has been ranging from 250-600 new cases daily and that doesn’t even take into consideration out of state students and how their towns are handling/mishandling the situation. \n\nI firmly believe Mearns and BSU are putting on a pretty picture making us think we will be back to keep deferring low and freshman enrollment high and then once the deadlines pass by for cancelling enrollment, they are going to announce online only. \n\nNo parent would want to pay this much money for a meh online education, BSU knows it and so do we.",
            "score": 8,
            "author": "Gingarius",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is the mindset of a lot of other universities too, unfortunately. College is a business.....",
                    "score": 4,
                    "author": "intp-amelia"
                },
                {
                    "level": 1,
                    "comment": "I feel like you’re right. Was debating whether or not to go this year and just attend Ivy Tech instead. Hope I didn’t make the wrong decision and waste money.",
                    "score": 4,
                    "author": "dishbish8478",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Man I feel that, I just wish we knew anything 100% right now. I swapped out two classes for ivy tech since I just didn’t want to deal with BSU, take as little as I need senior year. \n\nI’m sure it’ll all work well in the end, just ready to be done and out.",
                            "score": 1,
                            "author": "Gingarius"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Then once the deadlines pass by for cancelling enrollment, they are going to announce online only. \n\nI can't really see that. You're going to get a revolt, especially from graduate students.\n\nI know most people here in this sub are undergrad, but I think people here forget how much grad students need access to the school itself to work.\n\nFurthermore, most of us are funded by assistantships and fellowships. If there's no school, most of us will be out of work, and no work means no funding.\n\nBall State for a lot of us isn't just studying and researching, it's also our place of work as well. \n\nJust my two cents.\n\nP.S. However, I did wish Ball State waited to demolish the rest of Lafollette so we can use that to spread out more students.\n\nIndiana is only allowing 1 person per dorm room this year. That's a good compromise I think.\n\nLastly, they should have allowed people who wanted to stay online. Not offering online classes, but allowing in-person classes to have the ability to be online for high-risk people.",
                    "score": 3,
                    "author": "GuyOnTheLake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I only hope this is true. I will be so upset I wasted so much money. I agree they shouldn’t have torn down lafollette yet so students could get space. But I thought I read somewhere it wasn’t completely getting demolished just yet. So maybe that’s what they will do. \n\nLove hearing everyone’s theories",
                            "score": 3,
                            "author": "dishbish8478"
                        },
                        {
                            "level": 2,
                            "comment": " I am majoring in the school of fine arts at Ball State, and I don't know how I am going to get my major when most of my work requires hands on.",
                            "score": 2,
                            "author": "awkward_actress"
                        }
                    ]
                }
            ]
        }
    ]
}