{
    "id": "iaabsc",
    "score": 14,
    "title": "Muncie central high school has suspected covid cases in the double digits",
    "author": "Gingarius",
    "date": 1597508744.0,
    "url": "https://www.reddit.com/r/BallState/comments/iaabsc",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah, I really hope we go all online and fast. I hate being stuck at home and my job is 100% reliant on campus being open BUT I also don’t want to be a walking Petri dish bringing COVID home to my family every day. Plus you already have dumbasses planning parties. For once I’m not looking forward to the start of the semester.",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m honestly betting two weeks before we go online, lots of Indiana public schools are already getting cases and shutting down and we don’t be different especially since our age range tends to be more rebellious, go to parties and bars, and so on. The worst part is because Mearns wanted money, he’s going to shut down dorms after a bit and everyone will go right home during the asymptomatic stage most likely and infect their families. This is just going to be so ugly and sad, I’m ashamed of our administration and their fake show or new banners and “cardinal care”, if they did they would’ve made the most out of online and kept it that way till the vaccine comes.",
                    "score": 4,
                    "author": "Gingarius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's a symptom of how profit-driven education is in the United States.\n\nMy small undergrad flat-out told everyone that they have to open or fire entire departments. That's after they already bought out dozens of professors already.\n\nHell, southern schools (Alabama, Georgia, etc) plans to have fans in the stadium for their football game! What an utter joke. \n\nSchools shouldn't be in a position to falter when people are online.",
                            "score": 4,
                            "author": "GuyOnTheLake"
                        },
                        {
                            "level": 2,
                            "comment": "I was thinking the same thing! All the kids in the dorm won’t have any idea they’re sick and have no where to go but back home to infect their whole community unwittingly. It’s frankly disgusting to see all the posturing about caring about our health while knowingly risking lives, I agree.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile barstool and ballstatechicks on instagram is actively encouraging folks (especially incoming freshmen) to party during welcome week 🤦",
            "score": 5,
            "author": "Nacho98",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah honestly, it’s pitiful people can’t put aside their need to party (plus I mean, it’s BSU, any kickback with a few friends is a trillion times better than a party) and focus on others, I give it two weeks till we lose a professor or shut down.",
                    "score": 7,
                    "author": "Gingarius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We've already lost at least one professor last semester actually. Hoping it won't happen again, but it will. Wouldn't be surprised if there are more I haven't heard about yet.",
                            "score": 3,
                            "author": "Nacho98",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Two I think which is so sad, the teachers/janitors/general staff are all here to help us and give us better lives and yet they will suffer the most. I’m just ashamed in Mearns and the administration, at this point it’s all about cashing in and securing enrollment and contracts before they pull back and keep all the money.",
                                    "score": 5,
                                    "author": "Gingarius"
                                },
                                {
                                    "level": 3,
                                    "comment": "We did? That’s awful I didn’t know. Who passed?",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "George Gannage, an assistant teaching professor of marketing and assistant director of the Center for Professional Selling at Ball State University in Indiana, died April 6. I remember hearing good things about him from students when the announcement was made.\n\nArticle talking about him here: https://www.insidehighered.com/news/2020/04/15/academics-lost-covid-19-fondly-remembered",
                                            "score": 6,
                                            "author": "Nacho98"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey guy that made that post here. Everyone came back negative. Everyone's stumped cause one kid was literally a walking symptom list.",
            "score": 1,
            "author": "Bannedidiot1"
        }
    ]
}