{
    "id": "isrt1y",
    "score": 8,
    "title": "Accounting Major?",
    "author": "littledude1234",
    "date": 1600110961.0,
    "url": "https://www.reddit.com/r/BallState/comments/isrt1y",
    "media_urls": [],
    "other_urls": [],
    "postText": "What do you guys think about the accounting program at Ball State? I’m a high school senior considering my options, and I really want to go into accounting.",
    "comments": [
        {
            "level": 0,
            "comment": "It’s fine. Lots of help if you need it. If you’re not sure about it you can pivot to one of many majors pretty late into it and not lose out on much.",
            "score": 5,
            "author": "guyfellamanboydude"
        },
        {
            "level": 0,
            "comment": "The accounting major is one of the better majors Ball State has. Good professors that are easy to talk to and want to see you succeed. It can be very challenging, but overall I’d recommend it.\n\nAlso as the other person said if you don’t enjoy it it is very easy to switch majors within the business college and not be behind",
            "score": 5,
            "author": "crusty8919"
        },
        {
            "level": 0,
            "comment": "I have been told many times that the Accounting program is great at ball state. From experience, I transferred from Chemistry into Accounting and Finance, and it was such an easy transition. As others said, many professors will help because they want you to succeed, like most professors. \n\nThough, be careful with your prereqs, ACC201 and ACC202, because it was waaaay too easy and does not prepare you well enough for your 300 classes. The reason being is that the professors don't want to go into much detail and challenge you as much because those taking the class aren't all accounting majors.",
            "score": 1,
            "author": "myanimetiddies"
        },
        {
            "level": 0,
            "comment": "Just graduated from the accounting program this semester.   The support from the professors is AWESOME.  Literally got my internship and job offer thanks to connections a professor helped me make.  The 300 level classes are a huge jump though.  I saw a lot of people struggle in 302 especially.",
            "score": 1,
            "author": "kavalrykiid"
        }
    ]
}