{
    "id": "q04jpg",
    "score": 4,
    "title": "Is this a good college",
    "author": "mybest34s",
    "date": 1633212442.0,
    "url": "https://www.reddit.com/r/BallState/comments/q04jpg",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m planning to go here for prerequisites",
    "comments": [
        {
            "level": 0,
            "comment": "As someone who was at Ball State for 6 years, I can honestly say that I LOVED my time there. But why only go somewhere just for prereqs and then go somewhere else? You can easily lose all those relationships that you built while you were there.",
            "score": 7,
            "author": "Capta1nRon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cause I want to apply to a dental hygiene program and Ball State doesn’t have that.Plus I always wanted to go here.",
                    "score": 2,
                    "author": "mybest34s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would choose a community college for pre reqs. You’ll save a lot of money unless you’re getting a bunch of scholarships. If you want to have the college experience you want to find the school that you plan on attending for dental hygiene and start there unless it’s more expensive.",
                            "score": 6,
                            "author": "NakedDuelist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it’s less expensive",
                                    "score": -1,
                                    "author": "mybest34s"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would strongly suggest to find a school that offers the program you’re looking for and spend all your time there. Life is all about relationships. And personally, the friends I made in college are all lifelong friends. (Literally never speak to anybody from high school). If you start going here, you’re gonna have to change majors because you’re not going to want to leave.",
                            "score": 16,
                            "author": "Capta1nRon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You are definitely right.Just really wish they had a dental hygiene program",
                    "score": 1,
                    "author": "mybest34s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Truth be told, I thought I was going to be a teacher going into college. That major didn’t last 3 months.",
                            "score": 4,
                            "author": "Capta1nRon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a pretty based college",
            "score": 1,
            "author": "willguine"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "Kenna193"
        }
    ]
}