{
    "id": "uthx0a",
    "score": 0,
    "title": "Rising COVID cases",
    "author": "Vegetable_Climate454",
    "date": 1653009115.0,
    "url": "https://www.reddit.com/r/BallState/comments/uthx0a",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/poll/uthx0a)"
    ],
    "postText": "With rising COVID cases, it is likely we will reenter lockdowns and masks mandates. Thoughts?\n\n[View Poll](https://www.reddit.com/poll/uthx0a)",
    "comments": [
        {
            "level": 0,
            "comment": "No. We won’t see another “lockdown” in my opinion. Too much was lost bc of the first one. Mask mandates returning? Maybe. And there are 325 or so COVID patients in the hospital in Indiana right now. I’ve been tracking this and it hasn’t jumped up, it has been a slow rise. All the scary headlines on this are either out of context or downright misleading. I saw one that said “hospitalizations double in local hospital in past two weeks.” They went from 5–10 COVID cases in the hospital. That’s not some huge number but of course the headline was designed to create fear. Omnicron pt 2 is no more lethal than the original, thus far. We have to learn to live with this virus bc it isn’t going away.",
            "score": 7,
            "author": "cmgww"
        },
        {
            "level": 0,
            "comment": "I think it's possible Ball State \\*might\\* reinstate another mask mandate if cases are really rising. I would be absolutely shocked if there was a lockdown of any sort. For that to happen I think hospitals would have to be really overrun and I don't think we will see that to the extent that it was happening earlier in the pandemic.",
            "score": 3,
            "author": "evitreb"
        },
        {
            "level": 0,
            "comment": "We will not comply",
            "score": 4,
            "author": "Cumphreybogart",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do you plan that?",
                    "score": 0,
                    "author": "Vegetable_Climate454"
                }
            ]
        }
    ]
}