{
    "id": "x6wuwh",
    "score": 16,
    "title": "Has anyone ever been down to the tunnels under campus? And if so what are they like?",
    "author": "Exotic-Accountant-",
    "date": 1662426538.0,
    "url": "https://www.reddit.com/r/BallState/comments/x6wuwh",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Most of them are maintenance tunnels, so it’s just a bunch of dusty old tubes. A few have some sort of wall and floor, usually cement and linoleum. Most do not have working lights any more, but those that do have ancient fluorescents that make you want to vomit. Overall, 3/10. Nowhere near as good as Purdue’s.",
            "score": 15,
            "author": "mymaloneyman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah when I was there they were spoken about like the Catacombs of Paris….I went down and was like “that’s it??”",
                    "score": 10,
                    "author": "cmgww"
                }
            ]
        },
        {
            "level": 0,
            "comment": "WHERE ARE THEY",
            "score": 11,
            "author": "Slooneytuness",
            "replies": [
                {
                    "level": 1,
                    "comment": "It doesn’t take much exploration to find most of them. I can’t find the one between Sursa and Hargreaves for the life of me though.",
                    "score": 8,
                    "author": "mymaloneyman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well I think I know what I’m doing this weekend",
                            "score": 7,
                            "author": "Slooneytuness"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes.  Back in the 80’s when I worked for the School of Music.  Nothing fabulous or cool.",
            "score": 7,
            "author": "ParticularPressure68"
        },
        {
            "level": 0,
            "comment": "Was an RA from 2016-2018, went in the tunnels. Lights. Wires. Nothing else to see really. \n\nI will say though, there’s a tunnel under Noyer that’s lowkey creepy as fuck. Have fun with that knowledge.",
            "score": 6,
            "author": "SimplyLanden",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that the one with the big creepy eye and the Satanic graffiti?",
                    "score": 3,
                    "author": "Phantom-Watson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "YUP",
                            "score": 3,
                            "author": "SimplyLanden",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Anyone know how to get to the noyer one?",
                                    "score": 2,
                                    "author": "thedragonman02"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "- Enough interesting graffiti to fill a book, some of which is signed and dated and goes back to the 1960s\n- Cave formations from decades of flowing water leaving mineral deposits\n- Access to the basements of all of the major buildings on campus\n- Strange rooms with no discernable purpose\n- Some areas that are hidden behind obstacle courses, ranging from mildly inconvenient to quite challenging\n- Miles of inscrutable machines, wires, ducts, valves, and pipes, some of which constantly spray scalding steam\n- A particularly difficult-to-reach area that has been named The Signature Room, with some of the oldest graffiti\n- Spooky sounds and the constant loud whir of fans, which makes it very difficult to listen for the presence of other people in the tunnels, which means you can never rule out that someone is around every corner\n\nIf you're interested in exploring them, I strongly encourage you to follow the same code of conduct that past tunnel-explorers have. Don't cause any damage, don't steal anything, and leave no evidence that anyone was there (except for maybe some tasteful graffiti). If you can't access an area without breaking something (like a lock or a window) then either come up with a more clever plan or turn around.",
            "score": 6,
            "author": "Phantom-Watson",
            "replies": [
                {
                    "level": 1,
                    "comment": "I went in from the access at LaFollette in about 80-81.  I think it was in the basement of Clevenger.  From my experience, all that stuff Phantom-Watson says is correct.  In those days, I don't think the tunnels were old enough that we had the mineral formations, but I remember that we could hear conversation from above in the tunnels under Noyer and you could hear and see lights from the traffic above as you went down the tunnels next to McKinley. I regret not leaving any graffiti, but there was a ton of it down there.  Keep in mind my experience is from forty years ago, so I have no idea what they're like now.",
                    "score": 2,
                    "author": "CombinationOk8400"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yep. Pretty forgetful. Haven't thought about them in years until seeing this.",
            "score": 2,
            "author": "MurrayRothbard__"
        },
        {
            "level": 0,
            "comment": "In the  70's,  we used them frequently",
            "score": 1,
            "author": "Hot-Idea-2952"
        }
    ]
}