{
    "id": "b3bm7o",
    "score": 11,
    "title": "Looking To Play A Show In Aberystwyth",
    "author": "MADSPANNER",
    "date": 1553086211.0,
    "url": "https://www.reddit.com/r/Aberystwyth/comments/b3bm7o",
    "media_urls": [
        "https://www.reddit.com/r/Aberystwyth/comments/b3bm7o/looking_to_play_a_show_in_aberystwyth/"
    ],
    "other_urls": [
        "https://www.youtube.com/watch?v=EtIfHri19Rk](https://www.youtube.com/watch?v=EtIfHri19Rk)"
    ],
    "postText": "Aberystwyth is my hometown where I spent most of a decade trying and failing to put a band together or getting live rock bands to play. I moved away about 2 and a half years ago to start a band and things are going very well with an album about to come out but one thing I would love to do is come back home with this energetic metal/punk and play a show. Is there any promoters or anyone who puts on shows that might be interested?   \n\n\nHere's a stop-motion animation for the recent single - [https://www.youtube.com/watch?v=EtIfHri19Rk](https://www.youtube.com/watch?v=EtIfHri19Rk)  \n\n\nDiolch yn fawr! ",
    "comments": [
        {
            "level": 0,
            "comment": "Ask Bar46 or Yoko's.\n\nThe Angel are very big on metal/rock music.",
            "score": 8,
            "author": "sjh19"
        },
        {
            "level": 0,
            "comment": "The Angel seems to be the place for rock gigs nowadays.\nIf you're making a weekend of it, Y Llew Coch in Machynlleth has become quite the rock pub overnight, check them out on Facebook for booking details.",
            "score": 8,
            "author": "nickysyddyma"
        },
        {
            "level": 0,
            "comment": "Haven't lived in Aber' for close to 10 years, but I remember The Angel being good for this, and I would probably mosh the fuck out of it it. Pob lwc!",
            "score": 3,
            "author": "Yarg"
        },
        {
            "level": 0,
            "comment": "I'd say The Angel is perfect, or even ask to play in Yoko's on their alt night!",
            "score": 2,
            "author": "Gwenwar"
        },
        {
            "level": 0,
            "comment": "Thank you all very much for your responses, I've emailed Y Llew Coch and messaged Yokos and the Aber RocSoc!",
            "score": 1,
            "author": "MADSPANNER"
        }
    ]
}