{
    "id": "lhvzd9",
    "score": 2,
    "title": "Survey about Emotions and Vaccinations (18+; 10 minutes to complete)",
    "author": "willispsychkent",
    "date": 1613080800.0,
    "url": "https://www.reddit.com/r/Aberystwyth/comments/lhvzd9",
    "media_urls": [],
    "other_urls": [
        "https://kentpsych.eu.qualtrics.com/jfe/form/SV\\_5zrxlyi5WWdU3Bz](https://kentpsych.eu.qualtrics.com/jfe/form/SV_5zrxlyi5WWdU3Bz)"
    ],
    "postText": "Hello, we are a group of psychology researchers from the University of Kent, UK. It would be a huge help if anyone interested in participating would fill out our quick survey (18+ years old only) about emotions and vaccinations:\n\n[https://kentpsych.eu.qualtrics.com/jfe/form/SV\\_5zrxlyi5WWdU3Bz](https://kentpsych.eu.qualtrics.com/jfe/form/SV_5zrxlyi5WWdU3Bz)\n\nThe survey takes around 10 minutes to complete, and we are happy to respond to any queries or questions. Please private message us to avoid giving away the point of the study to others. \n\nThanks for your time. \n\n**Edit:** The survey is now closed! Thank you very much for your time, we will be sure to post the results up here when they're ready. ",
    "comments": [
        {
            "level": 0,
            "comment": "why is it exclusively for ppl whose first language is English?",
            "score": 2,
            "author": "Shneancy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Prifysgol Saesneg ydy hon.",
                    "score": 2,
                    "author": "Inevitable_Acadia_11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "(apologies, I don't speak much Welsh)\n\nwell yes, but just saying \"people who speak fluent English\" would bring a bigger poll of people and also be more inclusive.",
                            "score": 1,
                            "author": "Shneancy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I suppose \"fluent\" doesn't necessarily meet the threshold for \"fully competent\" and might distort the results.  That said, I clearly skipped this bit as my first language isn't English, but I have now completed the survey :o",
                                    "score": 1,
                                    "author": "Inevitable_Acadia_11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "huh, emotions and vaccines don't strike me as some advanced topics requiring a native-level range of vocabulary and innate understanding of grammar tbh. I'm of the rare breed that actually likes surveys but maybe next time lol",
                                            "score": 1,
                                            "author": "Shneancy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, just do the survey, they didn't put a filter question so they'll have a few non-L1 speakers completing it.  Ironically, I think some of the items are so vague that one native speaker will interpret them very differently from the next one anyway.",
                                                    "score": 2,
                                                    "author": "Inevitable_Acadia_11"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}