{
    "id": "rbr0a4",
    "score": 21,
    "title": "\"Aberystwyth Place, Binghamton, New York\" Anybody knows any history of this? Just a random street in the middle of New York named Aberystwyth Place.",
    "author": "kain_tr",
    "date": 1638968963.0,
    "url": "https://www.reddit.com/r/Aberystwyth/comments/rbr0a4",
    "media_urls": [
        "https://www.reddit.com/r/Aberystwyth/comments/rbr0a4/aberystwyth_place_binghamton_new_york_anybody/"
    ],
    "other_urls": [
        "https://goo.gl/maps/AaNc6ViJKis6kY77A](https://goo.gl/maps/AaNc6ViJKis6kY77A)"
    ],
    "postText": "Maps Link: [https://goo.gl/maps/AaNc6ViJKis6kY77A](https://goo.gl/maps/AaNc6ViJKis6kY77A)\n\nCan't find anything online. I find it really interesting that there's just a random street called Aberystwyth Place in America.",
    "comments": [
        {
            "level": 0,
            "comment": "A common practice in the states is to name roads in a neighborhood after a unified concept. For example my grandparents neighborhood has like Canterbury, Charing, and Chrisbin roads which are all like vaguely fantastical sounding English places. The theme is rarely consistent, never accurate, and never understood by anyone.\n\nIf I had to guess the theme here was vaguely Gallo-Brittonic. For this subdivision you have Gordon, a vaguely Gallo-Brittonic name, Helen, a Greek name common in France which was once Celtic dominated, Druid, obviously related to Gallo-Brittonic roots, and Aberystwyth.\n\n\nThat might seem like pulling something out of my ass, but you have to remember...... they were too. This is legitimately how a lot of neighborhoods are named in the states and that seems the most likely to me.\n\nTo clarify: I promise, without a shadow of a doubt, not a single person on that building project, development company, nor a single person who lives there has any goddamn clue what Aberystwyth is beyond a place that annoyingly pops up whenever they type their address into google.",
            "score": 6,
            "author": "theRealBassist",
            "replies": [
                {
                    "level": 1,
                    "comment": "That makes a lot of sense. Really good theory. Seems believable to me so I'll take it haha. Thanks for the reply!",
                    "score": 2,
                    "author": "kain_tr"
                }
            ]
        }
    ]
}