{
    "id": "14619bh",
    "score": 5,
    "title": "Worldwide BS Engineering",
    "author": "BigPictur33",
    "date": 1686406206.0,
    "url": "https://www.reddit.com/r/erau/comments/14619bh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I see that the BS Engineering through ERAU Worldwide is now ABET accredited. My question is: How will this general engineering degree with no specific focus (electrical, mechanical, etc.) be viewed? \n\nFor the record, I have about ten years of electro-mechanical troubleshooting experience, mainly as an Air Force avionics technician, and now as a medical device Field Service Engineer. I have an electronics based Associate’s degree as well as a BS Aeronautics (ERAU WW). I do not have a schedule which would allow for me to go to school in person locally (and none of these programs offer night school). \n\nThanks for the insight!",
    "comments": [
        {
            "level": 0,
            "comment": "Are you me? Ive got an as ee and bs aeronautics. \n\nIt's great to hear that they finally have an ABET accredited online program. I was thinking about going back to my local university to finish my EE but it would take me a while to finish the 11 or so classes. \n\nA lot of the job I've seen are looking for a stem degree. I feel like a multidisciplinary in engineering may suffice for a majority of them.",
            "score": 2,
            "author": "OkieEE2",
            "replies": [
                {
                    "level": 1,
                    "comment": "If this program were accredited prior to the COVID era when I was finishing up the Aeronautics program, this would have been a great fit, but hind sight is 20/20 and it was not accredited. It appears there is still time, though. \n\nUnfortunately, there just are not any good opportunities to finish an engineering degree in my area.",
                    "score": 2,
                    "author": "BigPictur33"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you make it through the gauntlet, you'll find a high paying job without an issue. A more specialized degree might get you a leg up for the top tier employers in that speciality.",
            "score": 2,
            "author": "Zolty"
        },
        {
            "level": 0,
            "comment": "You'd be just fine after graduation. Instead of avionics, I was a knuckle dragger, got a BS in Aeronautical, and went straight to work for one of the 3 major defense contractors.\n\nBest of luck!",
            "score": 2,
            "author": "Pyr_Phaethon"
        },
        {
            "level": 0,
            "comment": "Did they provide any info on how you would do lab classes?",
            "score": 1,
            "author": "CostcoRanger17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of the online engineering programs I’ve looked into will have you purchase some supplies/equipment for at home labs and also use virtual simulations or other types of similar programs. So, I am assuming that’s how this program will handle labs.",
                    "score": 2,
                    "author": "BigPictur33"
                }
            ]
        }
    ]
}