{
    "id": "12g6nhf",
    "score": 139,
    "title": "Trip Report - 14 days in Tokyo, Kyoto, Nara, and Hakone",
    "author": "air805ronin",
    "date": 1681008720.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12g6nhf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Weather is fun!\n\n* As the trip got closer, we noticed the weather report was notably wet.  Rain every day for 5 days.  That prediction stayed pretty solid right up to landing as it was raining when we landed so we hit a FamilyMart and grabbed some umbrellas.\n* My backpack was not waterproof.  This wasn't too big of a problem as long as I thought about it.  Storing our goshuinchos and a journal in a ziplock bag I'd brought plane snacks in protected the most important items I had on me.\n* My shoes were also not waterproof and weren't really great for prolonged tourism in the rain.  I was really, really happy when everything dried up later in the week.  I probably should have just bought some new shoes but I was stubborn.\n\nLanguage is fun!\n\n* I spent about 4 months studying some Japanese before I went, mostly just conversational stuff so I could ask for things, be polite, and handle myself.  That was an overly ambitious goal, but I knew that going in.  I knew I'd be learning overly polite forms of everything.  It was definitely time well spent to help me get around.\n* There were three types of responses I'd get when trying to handle interactions in Japanese:\n   * They'd be very excited I was even trying to use Japanese, encouraging me through it all and working with me.\n   * They'd not care either way and just do the transaction.\n   * They wouldn't understand me, or try to guide me towards just using English\n* Interactions where I felt like I'd done well or where I was encouraged really made me want to keep studying even now that I'm back.\n* The ones where I felt like I was getting eye-rolled were almost always in super touristy areas and its probably my bad not just launching into English at the start.  I was usually pretty good at gauging that but definitely had some bad misses.  You can't be perfect for two weeks, in my experience.\n\nFood is delicious!\n\n* We went in without reservations for anything and the intent to just find things for lunch and dinner.  It worked out really well with only a couple of long waits for meals.\n   * Once at a Sushiro in Ueno on a Friday night because... well.. I mean Ueno was finally dry and it looked like it was date night.  Everyone and their mom was out eating in Ueno.\n   * Once at a Tonkatsu place in Porto by Kyoto station... and... the place was hopping.  The whole restaurant block in Porto had lines and I had at least learned how to use the reception machines without even needing a language change on the machine.\n* We only ate at one spot that needed a reservation, but without one because my card kept declining the transaction to set one up.  It was a Sukiyaki restaurant  next door to our ryokan near Hakone-Yumoto.  They just needed about 10 minutes to get set up and got us into quite possibly our most memorable dinner of the entire trip.\n* Some of the other memorable restaurants we ate at were the kind of places with like 5 - 10 seats and an old lady chain smoking at the seat closest to the door.  A little tiny izakaya that only serves karaage, but its the best karaage you've eaten.  Those were the kind of places we really enjoyed.\n\nShipping your Luggage is AWESOME\n\n* We shipped two times, Tokyo -&gt; Kyoto and then Kyoto -&gt; Hakone, and it was pretty awesome.  We just carried backpacks and got where we were headed.\n* We opted not to ship from Hakone to our hotel by Haneda and it honestly wasn't that awful.  We reserved seats with the extra baggage area from Odawara to Shinegawa.  It went fine.  We stored them in Odawara for a bit so we could run to a place, and it was pretty easy to get them on the Keikyu line to Anamori-Inari.\n* Coin lockers can be hit or miss.  We found them in Odawara but they were a particularly expensive bank.  The less expensive banks were completely packed.\n\nA lot of places are awesome\n\n* I thought Nara was a really cool place to spend a day. I found the deer adorable.  We worked our way through the deer and park to Kasuga Taisha.  We grabbed lunch at a small Thai restaurant and then hit the Isui -en Gardens.\n* Climbing Mount Takao was a great experience, even if it was raining a bit.  We went up the \"easy\" path which was pretty hard for my wife.  Yakou-in Temple was really cool and had some amazing views.  We had some soba at a restaurant by the cable car landing and it was delicious, as was the cablecar down.\n* Ueno was an amazing place to select as a base of ops for Tokyo.  Our hotel was only 5 minutes from the station which made getting around easy.  Ueno park is beautiful in the rain, beautiful dry, and an awesome party atmosphere thanks to the Cherry Blossoms.  There are also a lot of great places to eat and most everything outside of the Ameyoko area doesn't have bad waits.\n   * It was also great for running, because I could hop on the train to Tokyo station and run around the Imperial Palace, or just run to the Sumida river and follow the paths there for miles.\n* For me, at least, Fushimi Inari Taiga was the best spot in Kyoto.  We went early and hiked all the way up and enjoyed the atmosphere.  Early morning casts a lot of great light everywhere and my wife and I found it simply magical.  By the time the hike was over, things were open and we could get our goshuin and have breakfast at a cafe.",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Thanks for the report. I can totally relate with Ueno Park being really beautiful with cherry blossom. Was similar to the Kamakura king cherry blossom path way. \n\nThe hike up is really awesome. The view wasn’t as good as expected but the ice cream on top made up for everything.\n\nAnd totally it was raining quite a little bit during the end of march. It did make outside day trip a pain but overall was still very fun.\n\nHow did you find Gion or Arashiyama if you went there?\n\nEdit: if someone goes to Hiroshima try out the okonomiyaki restaurant hassei. Please reserve. One of the best okonomiyaki in Hiroshima.",
            "score": 7,
            "author": "Character-Length5997",
            "replies": [
                {
                    "level": 1,
                    "comment": "We went to both.\n\nArashiyama was on the schedule because my wife really wanted to see the bamboo forest and she felt it was a little bit of a let down.  It is beautiful, but its not nearly as big as one may think.  \n\nThe monkey park, on the other hand, was pretty neat.  A lot of animal attractions in Japan can be quite sad, but this one just feels like a place where a troop of monkeys shows up to lounge around and get free food.  Whether that is a good thing or not is definitely up for debate, but they definitely seem free to come or go.  I know my wife was quite nervous to be wandering around Japanese Macaques once she saw the adults were not that small...\n\nGion was..  I liked Yasaka shrine well enough but Gion was just too busy in the middle of the afternoon.  Everywhere you walked you were shuffling in a moving line of tourists.  We got so peopled out and tired of shuffling we decided to try to find a Kyoto craft beer.    \n\n\nWe were still close to the shrine at the time and found Beer Bar Kurenai.  Its amazing how fast the crowd thins once you're not on one of the main roads in the district!  The alley this bar was in was nearly deserted and we had the place to ourselves at 3 p.m.  The lady who owns the joint was very sweet and the 90's music videos made for fun discussions topics.  Also... her potato salad was on point.",
                    "score": 5,
                    "author": "air805ronin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello! Glad you enjoyed your trip! I am going next month the 24th and I have a qeustion about shipping the luggages, was it difficult and can the hotel help you do that?",
            "score": 6,
            "author": "UrTrashKed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only shipped baggage once from a train station to Tokyo, but I am sure hotels can help too. Even with limited English, the lady helped us and it was super easy :) If shipping from a luggage forward service, remember the reservation number for your hotel. We forgot ours but the lady simply called the hotel for us:) this is only to make sure you are sending it to the right place",
                    "score": 4,
                    "author": "TheRantingSailor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perfect thank you!",
                            "score": 1,
                            "author": "UrTrashKed"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It wasn't difficult. Both times I did it, the front desk folks at my hotel helped me.  You provide the address for your next hotel and their phone number, and bring the luggage so it can be measured and weighed.\n\nThe price is based off the size of the luggage and the front desk folks have a neat chart they lookup the price after measuring the suitcase dimensions.",
                    "score": 1,
                    "author": "air805ronin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Roughly how much did it end up costing?",
                            "score": 2,
                            "author": "Kaltrax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Our two main bags were on the large size, about 30 dollars a bag.  Something more in a carry on size is much less.  Our bags started about half full and gradually... got filled by purchases....",
                                    "score": 2,
                                    "author": "air805ronin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you! That’s very helpful. Glad you had a great trip and thanks for the write up",
                                            "score": 2,
                                            "author": "Kaltrax"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Did you have to check with the receiving hotel first to make sure they accepted shipped luggage? Or is it just so commonplace that it's assumed they will.\n\nHow long did the luggage take to arrive? Could you ask for a future arrival date?",
                            "score": 2,
                            "author": "AllieKat7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The hotel service staff made that call for me.  They'll tell you earliest possible arrival and you can schedule it if you want for a particular day past that minimum transit time.",
                                    "score": 1,
                                    "author": "air805ronin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What services did you use? Did you just go to the front desk of the hotel and ask to ship your luggage’s?",
                            "score": 1,
                            "author": "gH0o5T",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just asked if they could help me ship the luggage and they used the service they normally use.",
                                    "score": 1,
                                    "author": "air805ronin"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the report! I've been studying Japanese on and off for a few years and have gotten very serious since deciding to go to Japan later this year. \n\nJust curious - what resources did you study and can you share a general skill level? Did you learn much Kanji? Were you able to understand and reply to questions (simple ones) - or mostly relying on memorized phrases? No wrong answers of course, just trying to gauge how useful cramming Japanese for 6-7 months will be potentially.",
            "score": 5,
            "author": "leethobbit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Regarding Kanji, I think you can learn quite a lot of Kanji in that time frame with dedication. I've been using wanikani and kaniwani to add a lot to my vocabulary. I use other things for grammar and speech and such",
                    "score": 3,
                    "author": "Galanta"
                },
                {
                    "level": 1,
                    "comment": "I didn't learn much Kanji, but did learn hirigana and some katakana.  It wasn't nearly as helpful, without more Kanji, as just learning vocab.\n\nI was able to respond to basic questions, although I really feel like I was speaking like a kindergartner.  If I had something I knew would be above my skill level I'd usually open with asking if someone understood English and if they said no I'd pretranslate an opening description of what I needed.\n\nOne of those times was finding a big mess in a hotel hallway and just calling attention to it.  Another was when I was initially trying to ship some souvenirs home.\n\nI studied a variety of items.  An old 80's Japanese textbook I picked up at a book sale, a newer book called Japanese from Zero someone recommended, Hirigana/Katakana flash cards, and even a little bit of Duolingo (though I don't see the point of that app it can be good for learning some vocab via repetition).",
                    "score": 3,
                    "author": "air805ronin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello love your trip report! \n\nCould you give us the names of the restaurants you tought were great? Especially your favourite one\n\nThank you!",
            "score": 5,
            "author": "stelinmemes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can, actually, because I journaled the entire trip and wrote them down.\n\nTonkatsu KYK - Kyoto Porta Mall\n\nSukiyaki Ukon - 牛なべ 右近 - Hakone Yumoto (favorite)\n\n羽田の居酒屋 穴守空港 - Anamori Inari fried chicken Izakaya\n\n和食-タイ料理 ほんま家 - Nara Thai Restaurant  \n\n\nThese were standouts amongst some particularly amazing food for two weeks.  I'd say my most boring meals were two times we had Coco Ichibanya and even that is particularly delicious.",
                    "score": 7,
                    "author": "air805ronin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;We went in without reservations for anything and the intent to just find things for lunch and dinner. It worked out really well with only a couple of long waits for meals.\n\nGreat to hear. Lots of talk of reservations on this sub (which I totally understand), but I kinda prefer to play it by ear. Nice to see the \"reservation or bust\" comments some people make are not totally the case.",
            "score": 4,
            "author": "UmeSays",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you aren't eating at fancy restaurants, next to a station at rush hour, or right next to a popular tourist attraction, you really do not need to bother with reservations.\n\nIf you see a line, ignore it and keep walking.\n\nThis sub is absolutely obsessed with reservations, luggage transfers, and a few other really specific things.",
                    "score": 4,
                    "author": "MaxAugust",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And for what its worth I was stationed in Japan before and knew about most of this except the luggage transfers.\n\nGoing to be honest, the luggage transfers are kind of expensive but they're so convenient and they free you up to do things instead of watching your luggage or hoping there are open coin lockers.  I'd do them again.\n\nI'm not sure I'd do a reservation except at a place that explicitly requires them for their more fancy menu sets like the Sukiyaki restaurant we hit up in Hakone.  I really tried to do that reservation but my credit card kept declining and my hotel staff didn't want to help me phone one in.",
                            "score": 1,
                            "author": "air805ronin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great report!\n\nQuick question for luggage shipping. How did you let the hotel you're shipping it to know ahead of time? Just gave them a call?",
            "score": 2,
            "author": "neobowman",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I shipped it the hotel employee that was helping me called to confirm my reservation with my next hotel and let them know I was shipping baggage.  \n\nEach hotel would make a note in my reservation and when I got to Kyoto they literally showed me my bags when I checked in, and my hotel in Hakone let me know the bags would arrive a little later and they'd bring them up.\n\nMade for a no worry trip, really.",
                    "score": 3,
                    "author": "air805ronin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Woah so you had the shipping from the hotel! I assumed you would havs to go to a convenience store for that. Did you ship it the night before you leave or the morning of?",
                            "score": 1,
                            "author": "neobowman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We did the morning of for Tokyo to Kyoto and carried a change of clothes with us.\n\nWe did the night before for Kyoto to Hakone and carried an extra set.\n\nDidn't really matter as you just have to be able to plan on how to carry clothes for 1-2 days appropriately based on when you hand them your stuff.",
                                    "score": 2,
                                    "author": "air805ronin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Alright, that sounds great! Thanks for the tip!",
                                            "score": 1,
                                            "author": "neobowman"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Whatever you think about luggage shipping, it reality it is 100 times better. It’s so great.",
                                    "score": 1,
                                    "author": "Yellohsub"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great report! Can you tell me the days in each city and transport used between? Our upcoming trip is also to those 4 locations.",
            "score": 1,
            "author": "Aerieslady",
            "replies": [
                {
                    "level": 1,
                    "comment": "* Tokyo (6 days)\n   * Travel and a little bit of Ueno Park\n   * Asakusa and Ueno\n   * Inokashira Park and Fussa\n   * Imperial Palace and Akihabara\n   * Harajuku, Shibuya, and Shinjuku\n   * Mount Takao\n* Kyoto (4 days)\n   * Travel by Shinkansen and Gion\n   * Fushimi Inari Taiga and Nijo Castle\n   * Arashiyama\n   * Nara Day Trip (local Nara line train)\n* Hakone (2 days)\n   * Travel by Shinkansen and Odawara Castle\n   * Hakone Loop\n      * train to Gora, cable car to Sounzen, gondalas, boat cruise\n      * Walk to Checkpoint, walk to Hakone shrine, then walk the old Hakone road to the Amazake Chaya teahouse.\n      * Bus to complete the loop\n* Last Day in Anamori Inari by Haneda\n   * Shinkansen to Shinegawa",
                    "score": 5,
                    "author": "air805ronin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the detailed reply! Very helpful.",
                            "score": 1,
                            "author": "Aerieslady"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love your report! It gave me some ideas for my upcoming trip. Thank you!",
            "score": 1,
            "author": "m0rbidowl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I just wanted to give back a little bit as this sub has been a source of inspiration since I first started planning this trip before the pandemic started.",
                    "score": 3,
                    "author": "air805ronin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for this!! How did you ship your luggage? Was it same day?",
            "score": 1,
            "author": "appalachia_roses",
            "replies": [
                {
                    "level": 1,
                    "comment": "This has come up a few times and there is more detail in those responses.  Shipped via front desk staff at my hotel. For the most part it was next day.",
                    "score": 2,
                    "author": "air805ronin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you go with 3 doses of vaccine or pcr. And if pcr was it this special rt pcr I keep seeing or just any regular pcr",
            "score": 1,
            "author": "SternballAllDay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Vaccines, and we wore masks pretty much anytime there were crowds or we were on public transit.",
                    "score": 3,
                    "author": "air805ronin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ty for the info",
                            "score": 1,
                            "author": "SternballAllDay"
                        },
                        {
                            "level": 2,
                            "comment": "Did your cdc card work fine or did you need a different kind of confirmation?",
                            "score": 1,
                            "author": "SternballAllDay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just submitted pics of my CDC card to the Visit Japan Web site.",
                                    "score": 1,
                                    "author": "air805ronin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Perfect I just did it and got an email response saying \"We have received and accepted the image(s).\". Can I stop panicking about this now lolol",
                                            "score": 1,
                                            "author": "SternballAllDay",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You'll get another email once they process them and you can go back and screenshot the blue box.  Make sure the screenshot also has the name of the person the clearance is for.  I messed this up in and had to go grab them again in Narita once we landed.",
                                                    "score": 1,
                                                    "author": "air805ronin"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}