{
    "id": "12g9nzd",
    "score": 40,
    "title": "Back from 2 weeks in Japan",
    "author": "No_Sail1814",
    "date": 1681017229.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12g9nzd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just got home from almost 2 weeks in Japan. I feel like I did a moderate amount of planning, but still had holes in my itinerary when I got there. Wanted to share in case this helps anyone else out there:\n\nTokyo: March 26th-29th. \n\n26th: Flew in from Haneda &amp; stayed at Ryokan Sawanoya. The airport was packed &amp; we got a DiDi (cab) to our ryokan due to our large luggage, was expensive but worth it (maybe 50-60$ for 35 min). The stay at Sawanoya was great. Booked my room too late (about 1 month out) and got a room with only a shared bathroom, but it was really never an issue. Loved the place. The futon was comfortable, the smell of the tatami mats was comforting, and they made a pretty good breakfast. Got in late so got dinner by a near-by 7/11 &amp; fell asleep immediately. \n\n27th: Spent the day walking around Ueno Park. It was within walking distance of our ryokan. Ended up finding a surprise (to us at least) Sukura? Festival. There were vendors everywhere, tons of food, and tons of shopping. It was a good time and we stayed here for hours exploring. Went to an Ashnikko concert that night &amp; had a blast. \n\n28th: Woke up &amp; soaked in the sento at the ryokan. Relaxing with some rain and large window to outside. Went to DisneySea. Wanted to go at least once, and glad I did, but probably won’t be back anytime soon. There were lots of long (240 min wait long) lines. Using the app was slightly confusing at first. They did make us specific vegetarian options at one of the restaurants though, so that was nice. It’s a cool park but the express pass (or lack thereof) was different than the set up here in the U.S.A; harder to navigate for me. Did some shopping and rode 4-5 rides within my 8-9 hours of being there. \n\n29th: Explored some shrines &amp; parks in Taito. It was sunny &amp; beautiful outside. Had great vegan ramen at T’s Tantan at Tokyo station while commuting to Hakone. I also became obsessed with gachapon and was looking all over for machines at the station. Arrived to Hakone later in the day; wish I had reserved more time for Hakone because it was probably my favorite place in Japan. Stayed at Kansuiro Annex because they were willing to accommodate a vegetarian breakfast (best breakfast my entire stay)&amp; allowed tattoos in their onsen. This place was also my favorite stay on my trip. We were allowed to use the onsens in their main building &amp; the annex. \n\n30th: My fiancé proposed to me while we had an onsen all to ourselves during the morning; it was dreamy. We found another onsen where you can overlook a large river that runs through Hakone &amp; all together had about 5 onsens to visit on the ryokan property. It was a perfect day. Checked out of our ryokan &amp; went exploring around Hakone. Went on a short walk in the woods, to the city to get some sweets, &amp; then got on the road to Fujikawaguchiko. The Shinkansen ride was no biggie but didn’t realize that the buses to Kawaguchiko fill up so quickly. Got lucky with having 2 seats available on the last bus of the day to get us to Mt. Fuji. Arrived late at night &amp; stayed at Fuji View Hotel. The hotel was okay- had some amenities, like a hotel restaurant (not many, if any, vegetarian options), and onsen (not tattoo friendly though). We opted to walk down the road late at night to a random “restaurant” we found on Google maps, “Restaurant Cafe Partita”. It was ran by a local guy out of what I can only describe as a charming house that was set up as an eatery. He had a little dog that we played with and made us some of the best pizza from scratch I’ve ever had. We joked &amp; talked for hours. He played us the violin &amp; told us scary stories of Japanese black bears in the area lol. Overall a very fun night, and surprisingly amazing food. This place was a lifesaver since there weren’t any vegetarian places open late and/or within walking distance of our hotel. It was great spending time with a kind local too. I highly recommend this place, especially since he stays open pretty late (doesn’t have times listed online- he just decides when to open &amp; close daily depending on customer base). \n\n31st: Woke up to an amazing view of Mt. Fuji! It made the trek there so worth it. Walked around the hotel garden and went to the sightseeing ropeway. Even better views here. Took some pictures, found some souvenirs and started our way to Osaka. Took the bus back (I learned my lesson and found the online website for purchasing tickets). Bought our Shinkansen tickets online, which always made the process very smooth. \n\n~To be continued~",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "31st continued: Got settled into our hotel &amp; stayed at Citadines Namba in Osaka. Lots of nice amenities here. Good breakfast and got to do our laundry here for super cheap. \n\nApril 1st: Had breakfast at hotel and went exploring in Osaka. Found a boba and macaron place called “Little Bears Tea” that we really liked. Used huge chunks of real fruit in their teas. Went to a Taito Station not far from our place and played arcade games. Became obsessed with Maimai (check it out if you’ve never played it, it’s a single player or multiplayer). Went shopping at Shinsaibashisuji. Shopping took most of day, &amp; we rested the other half. We realized how hard it was to go from Tokyo to Hakone, Hakone to Mt. Fuji, &amp; Mt. Fuji to Osaka. We tired ourselves out &amp; needed extra sleep.\n\n2nd: We we’re still pretty tired so just spent our time in town. Went shopping at Den Den Town. Went to an amazing vegan restaurant called Paprika. Had amazing karaage. Was happy to find authentic vegan Japanese food. Mainly used this day for rest because this far in our trip we hadn’t been sleeping as much as we should have. We were walking 20,000-25 k steps a day.\n\n3rd: Woke up &amp; went to Universal Studios. I bought tickets month ago on Klook (high recommend doing this!), as my US card wouldn’t work on their website. Klook does give you automatic random time slots for entry into certain areas of the park, which you do need if you wanna go to Super Nintendo World, but overall I had a more pleasurable experience here than at Disney. I loved how much Pokémon was incorporated into the park. The park did have a more child-like theme to it, but Super Nintendo World was so badass. It was fun buying headbands here &amp; Disney because they are so much cheaper than the U.S.A. Very long lines like Disney though. Probably rode 5-6 rides and had a few meals/snacks during our 8-9 hours there. I would say skip the Monsters Rock N Roll show though, it was super derpy lol. \n\n4rd: Went to Kyoto and the trip wasn’t too bad. Checked into our hotel, Yoin Hotel Kyoto Gion in the afternoon. This was my least favorite hotel, mainly because there weren’t any amenities, and there was no real AC. Also no staff there at the hotel after 10pm, which sucked. Didn’t even know they offered AC to rent but for 250$ a night you would think they could crank up/turn on their central unit to have some cool air because it was 70 degrees outside; won’t open the windows either. Basically stay clear of this place. All that said, the location was phenomenal! Walked around Kyoto &amp; went to the vegan restaurant Padma. It was so good! Owner did everything &amp; she cooked us a big arrangement of different types of Japanese vegan food. Get there early because the shop is small, but very worth it. Walked around Gion &amp; went to a sento that evening for my first true Japanese bathing experience (there weren’t many people at all at our previous hotel’s onsen- but this place was busy), Funaoka Onsen, even tho it’s a sento. They were tattoo friendly and never even mentioned my tats when I walked in &amp; I have a full sleeve. One of the bath tubs even had a big electric bath to help “soothe sore muscles” but just felt like little bugs bitting my body lol. I much preferred their outdoor bath and cold bath.\n\n5th: Visited Arashiyama &amp; the bamboo forest. We got there around 12:30-1pm &amp; it was pretty busy. We were still able to enjoy it though. Had lunch &amp; then went to Fushimi Inari Shrine. It was a lot of fun learning about the history of the Torii gates &amp; the grounds. We even met a shrine kitty that loved on us :) Be careful in the evening/rain as there are many mosquitoes that will start coming out. Ended the night by going on a late night walk around 11-12pm. Saw maybe 8 or so geisha walking back home and saying goodbye to clients. It was so much fun. Didn’t anticipate on seeing any, but it was surreal to have them literally walking right in front of me a few feet away. \n\n6th: Attended the Miyako Odori for the show at noon. I had really been looking forward to this and bought tickets months ago. My fiancé and I had front row seats and I could even feel the geiko’s fans blowing on us from when they were dancing. One of the best parts of the trip tbh. Got lunch at Ain Soph. Journey Kyoto &amp; they had the best pancakes &amp; teriyaki soy chicken. They were really busy, but even though we didn’t have a reservation we still got seated before they really started picking up. Traveled back to Tokyo that afternoon &amp; checked into our new hotel, All Day Place Shibuya. I liked this place even though it was on the smaller side. The bed was huge and the room was nice and cold. They have a coffee shop &amp; pizza place attached to the hotel as well. \n\nApril 7th: Woke up, packed to head back home that afternoon, and went to Shibuya. Had breakfast at Eggs ‘N Things. Had the biggest pancakes with whipped cream I’ve ever seen in my life. Went to Shibuya Crossing &amp; then went to an arcade to finish up our morning. Arrived at HND in time to return our portable wifi router. We used Japan Wireless and I could not recommend them more. It was only 60$ &amp; we had unlimited data for our 2 weeks. Super simple getting it when we arrived, working the router, &amp; dropping it off. \n\nOverall we had an amazing trip. I feel like I could have planned more before the trip, but it was also fun taking each day as it came. I had an idea of the overarching things/places I wanted to see &amp; then we just filled in the gaps. If I could redo anything it would probably be looking up transportation to and from each area we were staying &amp; buying tickets for the buses ahead of time. I didn’t buy a JR pass &amp; was glad because we didn’t spend enough to justify the cost for a 2 week pass. We only took taxi’s a few times; to &amp; from the airport, &amp; then once more when we were out late in Kyoto &amp; there weren’t many modes of transportation still running. I don’t feel like we utilized our time in Osaka as much, but by that point we were exhausted and really needed some time to rest up. Please feel free to ask any questions or leave any comments, as I am already looking to plan another trip next year :)",
            "score": 15,
            "author": "No_Sail1814"
        },
        {
            "level": 0,
            "comment": "Congrats on the engagement!!!!  Oh my gosh, so good to hear a trip report from a fellow vegetarian.  We are doing Disney Sea and I couldn’t believe how limited the options are.  What did you eat there?",
            "score": 9,
            "author": "hectare_rebel",
            "replies": [
                {
                    "level": 1,
                    "comment": "That you so much! Oof yeah I was disappointed with DisneySea veg options as well. I went to Vulcania Restaurant &amp; asked them if they had any vegetarian options; they then gave me a tablet that stated to select all of my “allergies” in English &amp; then it gave options for me to choose at the end. I had to select like 10 things bc all meat is listed individually, but they were patient with me. There was a bit of a language barrier because my Japanese isn’t great, but there was a curry &amp; a stew with white rice that my fiancé and I got. The almond jelly also didn’t have any gelatin in it, &amp; it tasted delicious. I don’t think there are a ton of options around the park, but that was the only restaurant we ended up going to. The tropical fruit ice cream Mickey bars are vegan and are sooo good if you’re looking for dessert.",
                    "score": 4,
                    "author": "No_Sail1814",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks so much, that’s good to know.  It’s nice they at least tried with the allergen list but we might try to survive on snacks in that case!  Fruit ice cream works 😂 I’m hoping to convince the family to stop for ramen at Tokyo station on the way back to the hotel!",
                            "score": 2,
                            "author": "hectare_rebel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely! Yeah, snacks are def a good idea. The ramen at Tokyo station was totally worth the stop. Hope you enjoy your trip!",
                                    "score": 1,
                                    "author": "No_Sail1814"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We have reservations at Fuji view. I'm a vegetarian. What did you do for breakfast there?",
            "score": 3,
            "author": "redjunkmail",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuji View had a breakfast option there but we never got it because it was 3,000 yen. It was too expensive for my liking without knowing if there were veggie options for us. I never specifically asked them what was offered at breakfast but the photo online looks like there are some options. We ended up bringing lots of snacks (highly recommend) &amp; just had that for breakfast. The hotel is more secluded so you either have to take a taxi to the area near Kawaguchiko station where there are some veggie options around, or take the hotel shuttle when they do hourly drop offs (need reservations for the 8:30-11:30 am drop offs).",
                    "score": 1,
                    "author": "No_Sail1814",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you see a hotel there that you would have preferred to stay at more so?",
                            "score": 1,
                            "author": "redjunkmail",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t have another particular hotel in mind, but I should have booked my room sooner because I didn’t have many options left by the time I was looking to solidity my room (about 1.5 months out). Fuji View was beautiful but the seclusion of it, not many veggie options, &amp; no large tats in their onsen made it just okay.  Maybe look for places near the station more if you’re interested in having more veggie options",
                                    "score": 1,
                                    "author": "No_Sail1814"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ha, we ate at Eggs &amp; Things too, and my 7yo ordered the Berry Berry Pancakes. An eye-popping breakfast.",
            "score": 2,
            "author": "ttownep",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was the most amount of whipped cream I’ve ever seen in my life lol. I bet that looked like heaven to a 7 year old!",
                    "score": 1,
                    "author": "No_Sail1814"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great report and congrats!!! I was as DisneySea on April 5 and 6th and my impression was the same as yours. I’m glad I went and it was a beautiful park but so busy and the food there was the worst I’ve had in two weeks all over Japan. Due to weather, the nighttime show and the fireworks were cancelled.",
            "score": 2,
            "author": "Yellohsub",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh and I also saw the Miyako Odori and it was so cool. I wasn’t sure if it would be cheesy or too confusing since my Japanese isn’t good. It was great. I’m glad I took time to see it.",
                    "score": 2,
                    "author": "Yellohsub"
                },
                {
                    "level": 1,
                    "comment": "Thank you! Man, that sucks. Sorry to hear that you didn’t get to see the nighttime show. Yeah, exactly. I probably won’t go back since they don’t have an express pass like here. I can actually pass the lines &amp; normally don’t wait longer than 30-40 minutes for rides at Disney in CA, but I could not do 2-3+ hr waits for any ride. No matter how “great”",
                    "score": 2,
                    "author": "No_Sail1814",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got in line for Toy Story first thing when they opened and it ended up being over two hours. I paid 1500 yen to skip the line on Journey to the Center of the Earth (which feels absurd but I can’t imagine I’ll ever be back at DisneySea) because I just couldn’t emotionally deal with standing in line that long againx",
                            "score": 2,
                            "author": "Yellohsub"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you please give a list of restaurants you recommend for veg options?\nAlso their best dish acc to you…",
            "score": 1,
            "author": "hereforthetalk97"
        },
        {
            "level": 0,
            "comment": "What are your thoughts on the location of Citadines Namba? Seems a little far from the train stations to get elsewhere in Osaka",
            "score": 1,
            "author": "ericforman29",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t think the location was too far for me personally. It was about a 7 minute walk to the subway station, which is what we used the most. It could have been a little closer but it wasn’t bad enough to where it caused difficulty for us",
                    "score": 1,
                    "author": "No_Sail1814"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! Thanks for your detailed breakdown. Was wondering how you booked Shinkansen tickets online? Thanks!",
            "score": 1,
            "author": "mayor-tortimer"
        },
        {
            "level": 0,
            "comment": "Did you go with 3 doses of vaccine or pcr. And if pcr was it this special rt pcr I keep seeing or just any regular pcr",
            "score": 0,
            "author": "SternballAllDay",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had 3 doses of the vaccine. Before you get to the airport you fill out your required documentation through an app for the Japanese government. I just sent a pic of my COVID vaccine card. Not 100% on the PCR requirements but if you’re going after May 8th, I think they’re actually taking away all COVID requirements.",
                    "score": 1,
                    "author": "No_Sail1814",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did your cdc card work fine or did you need a different kind of confirmation?",
                            "score": 1,
                            "author": "SternballAllDay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My CDC card got declined my first try bc the person who gave me my first dose didn’t differentiate whether they gave me Pfizer or Moderna, but I sent them a follow up screen shot of my electronic medical record that said it and they approved it then",
                                    "score": 1,
                                    "author": "No_Sail1814"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Boooooring",
            "score": -5,
            "author": "summerlad86",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mostly wrote this as a fun way to reminisce on my trip &amp; remember the details, and if it happens to help others along the way that’s just a plus. I’m okay with the fact that it might be boring. Thank you for the input though.",
                    "score": 2,
                    "author": "No_Sail1814",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gotta be honest. \nI replied to the wrong person.",
                            "score": 1,
                            "author": "summerlad86"
                        }
                    ]
                }
            ]
        }
    ]
}