{
    "id": "12hkq3l",
    "score": 10,
    "title": "Need Advise with Itinerary - 3 weeks in August - Travelling during Obon Festival",
    "author": "olnaop",
    "date": 1681137483.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12hkq3l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, my sibling and I have booked our flights to travel to Japan in August (only time we can travel due to our schedules). \n\nI have been to Japan pre-COVID (also in August) while for my sibling, this will be their first time. \n\nHere is our itinerary excluding food. \n\n**10th August: Arrive in Tokyo**\n\n* Arrive at night time. \n\n**11th August: Tokyo**\n\n* Imperial Palace and East Gardens\n* Tuskiji Outer Market \n* Ginza\n* Akihabara \n\n**12th August: Day Trip Yokohama**\n\n* Gundam factory \n* Chinatown \n\n**13th August: Tokyo**\n\n* National Museum of Emerging Science and Innovation\n* Statue of Liberty \n* Tokyo Tower\n\n**14th August: Day Trip Kamakura**\n\n* Kōtoku-in\n* Hokokuji Temple\n* Tsurugaoka Hachimangu Shrine \n\n**15th August: Takayama**\n\n* Leave for Takayama very early\n* Explore Takayama\n* Hida Folk Village \n* Old Town\n\n**16th August: Shirakawa-go + Takayama**\n\n* Bus to Shirakawa-go \n* Explore Takayama in the evening\n\n**17th August: Kyoto**\n\n* Leave for Kyoto very early\n* Leave suitcase in hotel and check in, in the evening\n* Explore Arashiyama \n\n**18th August: Day Trip Hiroshima &amp; Miyajima** \n\n* Hiroshima Peace Park\n* Hiroshima Castle \n* Daisho-in Temple\n* Itsukushima Shrine at night  \n\n**19th August: Day Trip to Nara**\n\n* Rent a bike \n* Cycle around Nara \n* Important sightseeing \n   * Todai-ji\n   * Nara Koen Park\n\n**20th August: Kyoto**\n\n* Fushimi Inari Shrine  \n* Daigoji Temple\n* Kinkakuji (Golden Pavilion)\n\n**21st August: Osaka**\n\n* Leave for Osaka \n* Explore Minami district \n\n**22nd August: Osaka**\n\n* Universal Studio \n\n**23rd August: Osaka**\n\n* Osaka Castle \n* Explore Kita (Umeda)\n* Cup Noodles Museum \n* Harukas 300 or Umeda Sky Building at night\n\n**24th August: Osaka**\n\n* Explore Minoo Park\n* Explore Nakazakicho District\n\n**25th August: Tokyo**\n\n* Explore around hotel before leaving for Tokyo\n* Leave suitcase in the hotel and go to Ueno Park\n\n**26th August: Day Trip Fujiyoshida**\n\n* Chureito Pagoda\n* Explore around Lake Kawaguchiko\n* Boat ride in Lake Kawaguchiko\n\n**27th August: Tokyo**\n\n* Hopefully we are successful getting Studio Ghibli Museum ticket\n* Shinjuku Gyoen National Garden\n* Shibuya\n* Harajuku\n\n**28th August: Tokyo**\n\n* DisneySea\n\n**29th August: Tokyo** \n\n* Hopefully Team Lab Planets ticket for the morning secured but if not, whatever time is fine\n* Senso-ji Temple and Asakusa area\n* Tokyo Skytree \n\n**30th August: Tokyo**\n\n* If we couldn’t get ticket on the 27th, hoping to get Ghibli tickets \n* Chill day before we leave, explore areas we enjoyed previously\n* Shopping \n\n**31st August: Leave Tokyo**\n\n* Flight back home \n\nWe are going to get the 14 days JR Pass and we will start it on the 14th of August. As part of our first half of our trip will be during the Obon festival period, we wanted to make sure we do our trips starting from Takayama onwards to Osaka near the end of the festival period. \n\nWe would like to get feedbacks especially from the 10th to 17th August. We understand how crowded it will be, this is fine with us, we just want to make sure we time Takayama and Shirakawa-go correctly. I have checked Nouhibus website and it said they are closed from Aug 13-15 that is why we chose 16th to travel to Shirakawa-go. \n\nThen in Osaka, we would like to get feedbacks on which skyscraper to visit either Harukas 300 or Umeda Sky Building?\n\nThank you in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Also planning a three week trip for this time! Based on your last trip during Obon, are there any considerations I should keep in mind? Is it mostly higher than usual crowds?\n\nEdit to update this comment: my partner and I spontaneously booked a week long trip to Tokyo which caught the end of Golden Week. It was definitely a lot busier, specifically in shops etc, but it wasn’t unbearable. If Obon is anything like this - I’m no longer concerned :)",
            "score": 4,
            "author": "wrongthingsrighttime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes it was very crowded however it wasn't overwhelming. I could move around, take pictures and enter places I wanted to visit without having to wait too long. I think it helped that I overestimated how crowded it would be, so when I got there I was fine with it and I didn't have much problem. \n\n  \nI did Tokyo ( with day trips to Kamakura and Nikko), Nagoya, Kyoto (day trip to Nara) and Osaka. Kyoto was were I saw the most crowd, it wasn't in all parts. The crowded area for me was Kiyomizudera, Kinkaku-ji and Higashiyama district. Even through I saw the most crowd there, I was still able to move around comfortable without the need to say \"so sorry excuse me\" while moving around. \n\n  \nThe one main thing I wish I did back then was was use the luggage forward service. I actually didn't know it existed until a month ago. Having to go to the train stations with my large suitcase and carry on suitcase during such a high crowd traffic was very stressfully and tiring. \n\n  \nThe weather was very hot and humid, I am from a colder country so I was worried but honestly I was fine. I kept myself hydrated and never had any issues with the heat.",
                    "score": 2,
                    "author": "olnaop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for your detailed response! I think for us, we will be in Yokohama and Nikko over this period.  We are going to Yokohama for a Pokémon event, so I expected it to be busy anyway. \n\nOh yes, I’ve been a little apprehensive about luggage, to the point where we are considering going very light and having a backpack each only. It’ll be a nice test for us to see if we can! \n\nI have been worried about the heat, even though I’m in Australia and their summers are similar to ours, I just don’t enjoy the hot weather. It gives me a little hope that you were fine!",
                            "score": 2,
                            "author": "wrongthingsrighttime"
                        },
                        {
                            "level": 2,
                            "comment": "How was booking tickets for the shinkansen during this time? I'm also going to be coming in August and plan on going from Tokyo to Osaka on the 16th, coming back to Tokyo the 21st. Did you book train tickets a month in advance or were you able to reserve them with the JR pass once you picked it up in Japan?",
                            "score": 1,
                            "author": "1frogy8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I used an authorised vendor to purchase my JR pass when I went. Then when I arrived I would get my reservation ticket the day before each travel. I never had any problems, I was always able to reserve the seat I wanted. When I was there, on the 16th of August, I left Tokyo for Nagoya around 11am. I know you are going to Osaka then but for my travel, I remembered going around Tokyo station and having no troubles moving around the station with a large suitcase and a smaller suitcase. \n\nHowever for this trip with my sibling we have decided to purchase our tickets with the official website. When I was last there being myself I felt made it “easier” to get the seats that I want but as there are two of us going this time, we would prefer to reserve our seats one month in advance.",
                                    "score": 1,
                                    "author": "olnaop"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Spooky, i am planning a trip on almost the exact same dates, just flipped, starting in kyoto area myself then tokyo. For Fushimi Inari try to hit it up early to beat crowds and heat. And for the Arashiyama area look into the scenic railway and river cruise. I am hearing more good reviews of Harukas 300 for ease of access, but have not been there myself yet.",
            "score": 2,
            "author": "fafnir47",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the suggestions for Arashiyama. We will definitely look into the scenic railway and cruise. We are starting to lean more towards Harijans 300. We really would like to do the Umeda but I think we like the actual building instead of what type of view we can see from it.",
                    "score": 2,
                    "author": "olnaop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can also visit fushimi at night, it doesn't close.  There's lights but bring a flashlight.",
                            "score": 2,
                            "author": "Furrymcfurface",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I didn't know that and that is a great option to go at night. We were already planning to go very early in the morning. This could be another option. Thank you for letting me know",
                                    "score": 3,
                                    "author": "olnaop"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe you want to be in Kyoto for the 16 of August when they burn the 大 etc on the mountain.",
            "score": 1,
            "author": "Sad_Title_8550",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m going to be in Japan around this time too - what festival is going on then?",
                    "score": 1,
                    "author": "Outlandishness-Life",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s the last day of Obon. In Kyoto they make fires on the mountains to help the spirits find their way back to the other world. \nTokushima has the Awa Odori festival around this time, and Kochi has Yosakoi before that.",
                            "score": 1,
                            "author": "Sad_Title_8550",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "hey where can i find info on this / other obon things going on? i'll be in kyoto on the 16th as well.",
                                    "score": 1,
                                    "author": "sic_transit_gloria",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There’s a site called Discover Kyoto that has info. Look for Gozan Okuribi Ritual Fires. But if you’re in Kyoto on the 16th just go outside at nightfall and look around - you’ll see it!",
                                            "score": 1,
                                            "author": "Sad_Title_8550",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "perfect thanks so much. really looking forward to it",
                                                    "score": 1,
                                                    "author": "sic_transit_gloria"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard that lots of shops/places close during Obon? Is this true from experience? The last 2 days of our trip are August 13-15 so I’m not wondering if this will effect our last minute shopping lol",
            "score": 1,
            "author": "Theplasmacutter",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I went back then, the large shopping centres (malls) and department stores were opened. I had no problem shopping back then. I’m sure there were some places closed but at that time I just went to the large shops.",
                    "score": 1,
                    "author": "olnaop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What about restaurants or other activities/businesses? Like arcades or cafes?",
                            "score": 1,
                            "author": "1frogy8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Never had any issues, there were many restaurants and cafes opened. The only problem I had was the queue. I remember queuing for 10-15 minutes to get a seat. As I was by myself I didn’t queue that long as the restaurants would ask everyone queuing how many people and those who said 1 or 2 tends to get a seat quicker. There could be people that has been queuing for 10 minutes before I joined the queue and I would get a seat first due it just being me.\n\nFor activities, Museums, temples, etc no problems at all. I was able to go to different places with none of them closed. \n\nDuring the obon festival time, I was in Tokyo.",
                                    "score": 1,
                                    "author": "olnaop"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}