{
    "id": "12mdlzf",
    "score": 4,
    "title": "Itinary check and advice needed : Osaka / Koyasan / Himeji / Nara / Kyoto / Tokyo / Kamakura 14 days trip",
    "author": "Other_Lavishness_676",
    "date": 1681506730.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12mdlzf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, \n\nWe are going to Japan next week, and I would like to get some advice or ideas for things to do, around mostly food &amp; gastronomy light trails in nature / sacred area / craftsmanship, live music, 80’s …\n\nFrench couple, 40 (kids stay at home), it is first time in Japan for my wife, personally I’ve been there 12 times but for work so with just some shorts week ends trips in Tokyo/Kyoto/Yokohama area.\n\nItinerary and questions :\n\nDay 1 / April 24th : Land in Osaka, go to hotel in Namba, spend the night in Namba / Dontonbori\n\nDay 2 / 25th : Osaka day.      \nI would like to go to Osaka Central Fish Market but seems to need guided tour, otherwise will only go to Kuromon Market to enjoy food experiences.\nFor the afternoon, I have read that Nakazaki-Cho was a nice hipster / trendy /arty area. Is it still the case ?\n\nDay 3 Himeji : day trip to Himeji .\n- garden and castle first, of course\n- Question  about going to Engyo-ji temple : does it worth the time ? \nOther option could be to stop at Kobe when returning to Osaka\nAny other interesting things to do near Himeji castle ?\n- go back to Osaka for the night\n\nDay 4 : Koyasan (day + night in temple / shukubo : Ichijo-in)\n- take a train in the morning\n- drops the bags in the shukubo\n- basic idea is to make the 7 mont pilgrimage in 2 steps : first step first day (women’s pilgrim) with a little bit of visit, then 2nd half (Koya Sanzan) route the tomorrow. Each part is said arround 3 hours walking. \n- go back early to enjoy Shukubo\n-&gt; If we have to choose only one part, which one should we perform ?\n\nDay 5 : Koyasan :\n- 2nd half of the trail\n- end of the visits\n- taking back the luggage in shukubo, and go back to Osaka for the night\n\nDay 6 : Nara :\n- train to Nara / leave the luggage at the station (Is there enough lockers ?)\n- visit Nara / hike to the top of the mount\n- train to Kyoto\n\nDay 7 : Kyoto :\n- Southeast part : Fushimi inari \n- I have seen we can walk in the mountain to Kiyomisu dera, anyone experienced ?\n- other temples / finish early to enjoy Ryokan from 5pm\n\nDay 8 : Kyoto :\n- morning at Ryokan\n- path of Philiosophy / Northeast temples\n- Gyon\n\nDay 9 : Kyoto and trip to Tokyo :\n- rent a bike and go to bamboo forest / golden temple / North west part\n- Nozomi Shinkansen to Tokyo at 5 pm (already booked, because I feared of Golden week busy trains)\n\nAny specific recommandations for Kyoto ?  (Including restaurants)\n\nDay 10/11/12/13/14 : Tokyo\n\n- one day trip to Kamakura and Enoshima\n        -&gt; I have seem a hiking path from Kita Kamakura (tennen trail ?), is it really in the nature and temples ?\n\n- 4 days in Tokyo. Will stay in Shimbashi for trade off of good suburb connection and lively area\n    - temples / shinjuku / cocktail night at New York bar on top of Park Hyatt\n    - harajuku in the week end\n   - I have loved Shimokitazawa in a 2018 trip, if it is still alive I will go back\n   - any recommandations around food or art things ? \n   - Tsukiji fish market does not exist anymore. Any interest to return in the place for the remaining restaurants ? \n   - I have seen Toyusu is not visitable, right ? \n\nDay 15 : back to France early in the morning from Haneda\n\nThank you very much for you our advice /recommandations / step out ideas !!!\n\nBest",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "You can visit Toyosu but the public viewing area is behind glass so you won’t hear the auction",
            "score": 2,
            "author": "beefrodd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, so interest is limited, right ?",
                    "score": 1,
                    "author": "Other_Lavishness_676",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For me, yes! Not gonna get up early for it",
                            "score": 2,
                            "author": "beefrodd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you very much !",
                                    "score": 2,
                                    "author": "Other_Lavishness_676"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your itenerary for kyoto and tokyo seems well planned and doable. We did roughly the same",
            "score": 2,
            "author": "RaymondLovesMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks ! Any outstanding off track recommandation ?",
                    "score": 1,
                    "author": "Other_Lavishness_676",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really, its honestly all retty similar. Just go with the flow, let it hit you. Dont try and see everything if you are too tired",
                            "score": 2,
                            "author": "RaymondLovesMan"
                        }
                    ]
                }
            ]
        }
    ]
}