{
    "id": "12o4deg",
    "score": 84,
    "title": "Trip Report - 32 days - Osaka (Kobe, Nara) &gt; Kyoto &gt; Lake Kawaguchiko &gt; Tokyo",
    "author": "sylvinngo",
    "date": 1681641742.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12o4deg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Thoughts\n\n\\-\n\n**People, Service &amp; Hospitality**\\- Coming from Australia, the average height here is shorter which initially made things felt interesting- The AMAZING hospitality coming from airport and train station staffs, store clerks, waiters and waitresses felt undeserved, it made the entire travel experience feel so welcoming.- One of my biggest surprise was that English was barely spoken! And I'm talking even in places like hotels, including Haneda Airport Hotel.- Even in places and restaurants off the beaten path in seemingly the middle of nowhere, even when no english at all was spoken by the staff, I always felt welcomed and never like a nuisance.- Lines were everywhere and for everything, rides, restaurants, food stands, trains.- The loudest people in trains or generally anywhere in public at any given day were foreigners.- There were barely any overweight people.\n\n**Logistics Advice - Station Lockers**\\- There are MANY lockers at every major station we came by, Kyoto, Shin-Osaka, Tokyo etc.Which we will be utilizing on our next trip. They were quite cheap and things including full size luggages could be left in there for a few days.\n\nExample- If you want to travel to a city 2hours away from Tokyo but will only be staying there for two/three nights. You can leave your luggage in the locker at Tokyo Station and have enough clothes/supplies in a carry on to take to your hotel in the next city.\n\nThat way you don't have to drag your full size luggage through the next city as it might not be necessary to have all your things with you.\n\nAs a side note, traveling during peak season might make it harder to find vacant lockers that could fit luggages as they would be getting used for more frequently. Try getting there early in the morning before everyone else to be safe.\n\n**Other well documented quirks about Japan**\\- Prioritise having readily available cash and a way to carry coins as many places don't do EFTPOS.- Google Maps is great, but if you have a JR Pass, use the official Japan Travel App to find transportation that utilizes your Pass to make the most of it.- If you're traveling to places everyone else goes to, research the times that are quiet there, what killed my experiences with these popular places was when I couldn't even get around without feeling like a sardine.\n\n**Misc Tip -** The fast food there, McDonalds, Burger King, KFC, Pizzahut were of all really high quality. As in, buns not cold, meats not dry, onions and pickles never missed and so forth\n\n**Biggest Disappointment**  \nSome places were on everybody's itinerary, they're on every website and Itinerary Check's, chances are they were the places I least enjoyed, because there were too many tourists, sardines-packed level of crowded. It would've been okay if the place was actually REALLY amazing as the internet has made it out to be, but almost always they felt over hyped, but then I wouldn't have known until I went\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n***OSAKA***\n\n**MY PERSONAL HIGHLIGHT** \\- **Universal** **10/10** \\- GET AN EXPRESS PASS\n\n&amp;#x200B;\n\n**Aquarium 8/10** \\- The design was so well done, the tank was massive and quite clear, it really did do justice to show off how majestic these sea creatures are. Go on the giant Ferris Wheel while you're here as it is right next to the Aquarium.\n\n**Dontonburi 8/10** \\- A food district like no other, instagrammable places and signage left and right, but be prepared for long lines, avoid weekends and enjoy the food. The river boat ride looking back was kind of boring but might be decent if you want to relax for a bit.\n\n**Katsuo Ji Temple 9/10** \\- It felt off the beaten path unlike many other temples and shrines, barely any other tourists there, look it up on google images, compared to other temples, this really did have a more 'open' feel as it's in the middle of a foresty hill with good scenary and solitude.\n\n**Umeda Sky Observation Deck 9/10** \\- Best observation deck out of the few I have went to. It had an open deck unlike some of the other's which was glassed up.\n\n**Osaka Castle 5/10** \\- Lovely surroundings and nice to look at, but inside the castle, it was more squishy than I thought it would be because of the crowds, nothing much to see inside, a cramped museum.\n\n**TeamLab Botanic Garden 7/10** \\- Something about strolling through an artistic lit up garden at night was very peaceful, a good way to wind down and something a little bit more calm.\n\n**Pokemon Center 5/10** \\- If you like Pokemon, you'd probably enjoy window shopping all the cute plushies, merchandises and stationary. But I personally thought time could have been better spent elsewhere.\n\n**Shiba Cafe 3/10** \\- The Shiba's just seemed so numb to human attention, I was expecting them to be more playful and interactive but I had set the wrong expectations and thus was disappointed.\n\n**Tennoji Zoo 1/10** \\- I want to support the Zoo, I really do, but I couldn't help but feel so depressed at most of the exhibits, they seemed way too small for the animals in them. However, I am really glad that the locals seem to be enjoying the zoo much more than I was.\n\n**Toho Cinema Namba**  **8/10** \\- We were sitting on the left side of the cinema, it seemed to be quite packed especially in the middle. Halfway through the movie I looked over to the middle and I couldn't believe it, EVERYONE HAD THEIR FACE MASKS ON. And there I was with my mask off munching on popcorn and starting to question whether I should put them back on to fit in like everyone else.\n\n**Golds Gym** **9/10** \\- Guess passes are available for travelers. There are a few rules to note if you're going to a Japan gym for the first time. At Gold's, no phone was allowed on the gym floor, separate gym shoes must be worn and not outdoor shoes, there are a few more but it may depend on the gym/franchise itself. Seemed daunting at first but I guess it's just one of Japan's quirk having things orderly and clean.I got kicked off a machine because another gym patron came over saying she hasn't wiped it after using it yet! A startling but humorous incident.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n***KYOTO***\n\nMY PERSONAL HIGHLIGHT - Taxi to **Otagi Nenbutsu**, hike downhill to **Adashino Nenbutsuji** though **Saga Toriimoto Preserved Street** and purchased these lovely origami from a store in the middle of absolutely nowhere. If you want to feel the beating heart of Old Japan whilst in Kyoto, please please explore this area and purchase something from the locals to support them.\n\nSECOND HIGHLIGHT - **Hozugawa River Boat Ride 10/10** \\- Just look up some of the pictures that are on Google, for anyone who's a nature/scenery lover, this is the bomb in Kyoto.\n\n**Sightseeing Train @ Arashiyama** **4/10** \\- I mean, if you want to see some scenary I would instead highly recommend the Hozugawa River Boat Ride\n\n**Mipig Cafe 8/10** \\- A great great alternative to the Shiba cafe's, the mipigs actually crave attention instead of being nonchalant to people.\n\n**Cat Cafe 5/10** \\- Just like the Shiba cafes, the cat's seem so numb to presence of other people, although not as bad as the Shiba's.\n\n**Shiba Cafe 2/10** \\- I went to the Shiba Cafe soon after going to the Cat &amp; Pig Cafe just to see whether the Shiba's give a crap about other animal's scent on me, nope, not a care in the world\n\n**Nishiki Market 5/10** \\- Personally didn't really find much to shop/eat here, had some Kobe skewers and Sashimi but I don't get why this is even on other people's itineraries\n\n**Arashiyama Bamboo Forest** **9/10** \\- Arrived at 7am and it was 'almost' empty, great time to take those cliche photos for your gram'.\n\n**Arashiyama Park 7/10** \\- Like, if you're going to be going through the Bamboo Forest, or Tenryu-Ji or the Monkey Forest, you might as well take a hike around the park to some of the lookouts overseeing the river.\n\n**Monkey Park 8/10** \\- Monkeys everywhere, feed them and take photos whist enjoying the scenery overlooking the city\n\n**Fushimi Inari 6/10** \\- This place is only worth going to if you really want to take photos, other than that the over popularity of this place kind of kills the serenity of walking through all those torii gates. Hiked all the way to the top only to be greeted with a lackluster end, wasn't much to see up there.\n\n**Kiyomizu** **2/10** \\- For what it is, it was so packed, similarly to Fushimi Inari, it felt more popular than it should be, probably because this temple is one what people see when they google Japan Itinerary, what to do in Kyoto or best temples and shrines.Went during the middle of December, but I can imagine during autumn or cherry blossom this place having some amazing sights and photo opportunities.\n\n**Kinkakuji 5/10** \\- Another bucket-list type of temple in Kyoto, very pretty however there wasn't much to do after seeing it, far away from the main city.\n\n**Otter Cafe** **6/10** \\- The Otters attentiveness were better than the cats and Shiba's but nowhere near the mipigs\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n***LAKE KAWAGUCHIKO***\n\n**Mt Fuji Panoramic Ropeway** **8/10** \\- Best place around the lake as far as I know to get a shot of Fuji unobstructed. If you go up the mountain which is a 15 minute walk from the ropeway, you could also some nicer photos and see a small shrine.\n\n**Sightseeing Boat Cruise 6/10** \\- As long as there's no tour groups filling up the boat, expect some serenity and calm to admire Fuji\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n***TOKYO***\n\n**Ginza Art Aquarium Museum 7/10** \\- Each exhibit design here was unique and a nice place to check out one time\n\n**Tsukiji Market 2/10** \\- Over hyped, overcrowded, full of tourists who probably fell into the same trap as we did, there were food stalls here and there but the lines were very long for every one of them, so we walked 5 minutes away from the fish market and ate at a nice little restaurant we stumbled across.\n\n**Meiji Jingu 8/10**  \\- The park surrounding the shrine was amazing and encapsulating, it was crazy how it took me away from the bustling Tokyo environment\n\n**Shibuya 8/10** \\- Neon lights, Shibuya crossing, loud night life, just how you'd expect Tokyo to be like\n\n**Disneyland 7/10** \\- One of my biggest surprise, I was expecting more of some sort of Pixar, Finding Nemo, Incredibles, Cars etc. But it was more Mickey Mouse &amp; Cinderella oriented\n\n**Disneysea 8/10** \\- Rides were more thrilling than Disneyland which I had preferred, however the parade wasn't as cool and so were the fireworks at the end of the night which had a worse vantage point than if I was at Disneyland\n\n**Meiji Shrine Botanic Garden 4/10** \\- Coming from some amazing places in Osaka, Kyoto &amp; Fuji, by this point of the trip, this botanic garden just couldn't compete sadly\n\n**Takeshita Street 3/10** \\- Felt like a tourist trap, another bucket list item most tourists follow because it's seen all over the internet on Tokyo itineraries. On paper this area had some interesting things to offer on a travel and something different to other parts of Tokyo. However, not being able to get around without squeezing through people made it very unworthwhile. NOTE however we did go on a Saturday.\n\n**Hedgehog Cafe 8/10** \\- Small, cute, spiky, sleeps all the time, felt a lot more engaging than a Cat or Shiba Cafe\n\n**Meerkat Cafe 7/10** \\- Questionable living conditions aside.... We had the chance to hold a meerkat in our arms for quite a while which was a cool experience, they were very playful.\n\n**Odaiba Fireworks 10/10** \\- The fireworks were being launched near Rainbow bridge and we were situated at a beac\\[h, the sounds traveling and bouncing off the massive buildings along the beach were pretty cool\n\n**Tokyo Imperial Palace 2/10** \\- Couldn't see much, place is pretty much closed to the public, would not recommend\n\n**Yushukan Museum 7/10** \\- The museum is quite big, there were many stories and information in chronological order on Japan's military history. I tried skimming through everything as to not waste an entire day there but there were so much content and much to see\n\n**Tokyo Midtown Illumination 5/10** \\- Compared to the other illuminations around Tokyo, this Netflix sponsored one was pretty lackluster, I'm surprised that there was even a massive line for it. The Ice rink next to the illumination also had a massive line. \n\n**Tokyo Mega Illumination 9/10** \\- Went around the place at 7pm and it was way too crowded, came back at 9pm, an hour before closing and got to really appreciate the illuminations a lot more as it was almost dead\n\n**Teamlab Tokyo 7/10** \\- This was where I saw the most overseas tourists like myself during the entire trip. I wouldn't go back as it felt somewhat of a tourist trap and overhyped, but if I could go back for the first time again, I would go when it's quiet, similarly to the other museums and illuminations.\n\n**Sensoji 4/10** \\- The temples at Nara/Kyoto &amp; Osaka were better, but then I went during the day. On google images, the photo of Senoji at night looks a lot prettier than what I saw during the daytime. \n\n**Maxwell Aqua Park Shinagawa 8/10** \\- The afternoon dolphin show was spectacular and very entertaining, the night dolphin show felt majestic. The aquatic and animal exhibits looked to have been designed well, as in not too small.\n\n**Kyubey 8/10** \\- Came here because Buzzfeed got me salivating. Had the Nigiri Omakase and found it to be a very interesting experience trying all the different seafood.\n\n**Ueno Park ?/10** \\- The museum and swam boats were closed so I was sad, my fault, if memory servies me right, they close from the 28th December for the new years holidays.\n\n**Shibuya Sky 9/10** \\- A must go to if you're in Tokyo, the observation deck was very roomy, outdoors and felt like I could stay there for quite a while, lots of couples there, must be a top date spot for the locals.\n\n**Tokyo Red Tower 7/10** \\- The variety and high-techiness of the entertainment there were pretty cool and a fun way to kill time. However some equipment there were of poor quality or not set up properly, which included one of the VR Motion Racing Simulator &amp;  a VR shooter\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Bonus Cities**\n\n**Nara 9/10** \\- Animal lovers can spend a whole day with the deers at the Park, I know I can, they were so cute playful (rough playful). However if animals aren't your thing, perhaps focus more on the world heritage sites or hiking Kasugayama Primeval Forest instead.\n\n**Night Bus from Kyoto to Lake Kawaguchiko** **2/10** \\- even after purchasing a neck pillow and having an entire seat, the sleeping conditions were unbearable, although it was a lot cheaper than a bullet train which was why we went with the night bus, but probably never again.\n\n**Day Bus from Kawaguchiko to Tokyo Station 2/10** \\- took a bus again to save some money, the seats were narrow, space was tight and the trip was horrendous but it didn't take long to get to Tokyo\n\n&amp;#x200B;\n\n**Kobe**\n\n**Atoa Aquarium 5/10** \\- An artistic aquarium. It doesn't really have a lot of walking space so do your best to avoid weekends.\n\n**Herb Garden &amp; Ropeway 8/10** \\- Very pretty, we took the ropeway up to the top, then walked all the way down instead of taking the ropeway again. If you're looking for something more serene on your travels I would recommend doing the same, and besides, it's all downhill",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Ranking of activities is always nice to see, do you happen to have a list of restaurants to rate as well?",
            "score": 12,
            "author": "Nice_Reddit_Username",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't have a bad experience anywhere. It's been a few months since the trip and I have forgotten many places but my memory has still kept this tiny place in Kyoto, run by only one person, in the middle of nowhere somewhat near Kyoto Station. \n\nIf I'm in the area again when I come back I will definetely be giving it another visit. The place's vibe just felt like I was being served at someone's home.\n\n洋食グリルスタンド\n+81 75-746-5770\nhttps://maps.app.goo.gl/kXfx1bsquPCbWRLT8",
                    "score": 2,
                    "author": "sylvinngo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone also living in Oz, everything here feels expensive and crap.\n\nTsukiji Market, I'd say go there if you wanna try sushi zanmai tokyo main branch. I find it funny, that you \"don't like crowds\" while being a tourist and also going to tourist spots. Consider going during odd-hours, that's how you avoid crowds. Then again, tokyo is crowded af, being sardined everywhere is kinda a given but everything flows orderly almost perfect i'd say. Imagine if melbourne with its current population have an area of 2000km(sq), you'd never leave melb central.",
            "score": 11,
            "author": "poipoiwithnyannyan",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're right, I heavily contradicted myself by repeatedly mentioning how its too crowded here and there, yet I was a tourist in tourist hotspots\n\nAnd you're also right in that going in odd hours should be considered, I hope that anyone that is reading this and are going to Japan can keep it in mind if crowdedness might bother them.",
                    "score": 2,
                    "author": "sylvinngo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Since there are a lot animal cafes mentioned here, I wanted to post a comment and advise against them.  \nIf you are an animal friend, don't go to zoos or animal cafes (except rescues) in Japan.",
            "score": 10,
            "author": "breakhelppls",
            "replies": [
                {
                    "level": 1,
                    "comment": "The owl cafe I had been to many years ago claimed to be all rescued birds, that they have lost parents etc. They were still being chained to a log, pet and disturbed throughout the day despite their nocturnal pattern. I didnt realise how bad it was back then, but now its a definitely no for me.\n\nOP seems to love animals and I hope he/she will avoid those cruel spots at all costs in the future.",
                    "score": 7,
                    "author": "lorrenzo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you knew anything about shibas you wouldn’t have been surprised that the dogs weren’t into you. They are a breed that is known for NOT being outgoing and affectionate with strangers. They aren’t golden retrievers. \n\nDisturbing that you talked about the meerkats having questionable living conditions (animal welfare is a huge problem with animal cafes) but still rated it 7/10",
            "score": 6,
            "author": "agentcarter234",
            "replies": [
                {
                    "level": 1,
                    "comment": "I rated it highly despite the living conditions because of how cheap it was at that cafe to be able to hold and pat them. In Sydney, no zoo's would allow you to do that.",
                    "score": -3,
                    "author": "sylvinngo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They wouldn’t allow you because those are wild animals who deserve decent living conditions, not interactive toys for your amusement.",
                            "score": 2,
                            "author": "agentcarter234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't disagree with you, the way some animals are used and housed in Japan would be frowned upon by many.",
                                    "score": -2,
                                    "author": "sylvinngo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m floored that you were so clueless about wearing a face mask in a crowded theater until halfway through (and it sounds like you didn’t even put it on once you realized). Just got back from 10 days in Japan and was pretty ashamed to see so many other tourists being so inconsiderate and oblivious.",
            "score": 3,
            "author": "internet4ever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep I didn't put my face mask back on, it felt weird to do so being seated towards the edge of the cinema and not the middle, many seats away from anyone in front, behind or to the side of me. Maybe I should have been more thoughtful, what do you think?",
                    "score": 0,
                    "author": "sylvinngo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Btw the Hozugawa River Boat Ride is cancelled indefinitely after there was an accident and 2 people died",
            "score": 2,
            "author": "PM_ME_FREE_STUFF_PLS"
        },
        {
            "level": 0,
            "comment": "I have noted down some of the places you mentioned for my next trip.\n\nThanks for sharing your experience!",
            "score": 1,
            "author": "kenzi28"
        },
        {
            "level": 0,
            "comment": "!!",
            "score": 1,
            "author": "Bettalad"
        },
        {
            "level": 0,
            "comment": "Thanks for the list and ratings!  Super excited to see Nara now.",
            "score": 1,
            "author": "kiloparesis"
        },
        {
            "level": 0,
            "comment": "This is very helpful, thank you!",
            "score": 1,
            "author": "Stilllovethevixen"
        },
        {
            "level": 0,
            "comment": "Thanks for your report. Thanks for rating all you experiences, it will help me a lot finishing my trip organisation.",
            "score": 1,
            "author": "nalakme"
        },
        {
            "level": 0,
            "comment": "I'm confused by the second Tokyo Midtown Illumination that's rated very highly. Does that mean it's very worthwhile to go to, just in the last hour?",
            "score": 1,
            "author": "mianhaeobsidia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry! I just fixed it up, the second Midtown Illumination I rated so highly was meant to be written as Tokyo MEGA Illumination",
                    "score": 1,
                    "author": "sylvinngo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you! Will add it to our trip plans",
                            "score": 1,
                            "author": "mianhaeobsidia"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you have to fill out a lot of forms in order to enter the Golds Gym? I'd like to use the one in Shibuya when I'm there in a few weeks",
            "score": 1,
            "author": "nile_green",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, the form to fillout was quite tedious but it was in good enough english, make sure to bring your passport with you and a towel, if you're lazy just take your hotel's face towel with you!\n\nIt is also a rule in Japan's gym that you cannot use the same shoes you wear outdoors into a gym, so have some spare shoes with you if you don't want to risk it",
                    "score": 2,
                    "author": "sylvinngo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Got it, thanks! I’m hoping to get a month membership so will email them beforehand in hopes of streamlining it",
                            "score": 1,
                            "author": "nile_green"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just to let you know, this is the best review I've ever seen. I'm going to Japan next January (2024) for a month and I've now included so many new places based off your list.\n\nThanks so much.",
            "score": 1,
            "author": "ObviousOptimist"
        }
    ]
}