{
    "id": "12ostkr",
    "score": 814,
    "title": "Missing person during trip in Japan (link to the picture below)",
    "author": "AcademicFly2000",
    "date": 1681686749.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12ostkr",
    "media_urls": [
        "https://www.reddit.com/r/JapanTravel/comments/12ostkr/missing_person_during_trip_in_japan_link_to_the/"
    ],
    "other_urls": [
        "https://japantoday.com/category/national/connecticut-woman-missing-since-april-10-after-going-on-hiking-pilgrimage-in-japan-1",
        "https://imgur.com/a/kP9n0OT"
    ],
    "postText": "Missing person during travel in Japan (update info below)\n\nhelpfindpattie@gmail.com \n\nhttps://japantoday.com/category/national/connecticut-woman-missing-since-april-10-after-going-on-hiking-pilgrimage-in-japan-1\n\nHey guys, I’m not in Japan or planning to go soon. But a person I care about went and now she’s missing, so we’re looking for help to find her. She was last seen around Osaka. Help.\n\nThese are the word of her son: \n“My family and I urgently need your help. My name is Murphy Murad, daughter of Patricia Wu-Murad, a U.S. citizen who has gone missing while hiking the Kumano Koto trail in Japan. My mother was reported missing to local authorities on Monday evening, April 10, and despite a 72-hour search and rescue effort, she has yet to be found. Our family was notified by the U.S. Embassy on Thursday, April 14, and we are desperate to find her.\n\nWe have been pleading with local authorities to continue the search, but unfortunetly, we have had zero luck. We now need to take matters into our own hands, hire a private search and rescue mountain crew”\n\nPlease share with your community and help us finding Pattie.\n\n\nShe was last seen leaving Mandokoro hostel Monday, April 10th. The plan was to hike the Kumano kodo trail, but she never made to the next hotel. \n\nMiura-toge pass is the specific trail she was supposed to be in. That’s the trail that connects the place she was to the next accommodation. \n\n\nhttps://imgur.com/a/kP9n0OT",
    "comments": [
        {
            "level": 0,
            "comment": "Since the information in OP is not clear, these are the [two minshuku between which missing person would have been travelling on **Kohechi**](https://www.google.com/maps/dir/Japan,+%E3%80%92637-1224+Nara,+Yoshino+District,+Totsukawa,+Imoze,+101+%E4%BA%94%E7%99%BE+Minshuku+Mandokoro/Taiyou+no+Yu,+%E8%A1%8C%E8%80%85%E6%B0%91%E5%AE%BF+%E5%8D%81%E6%B4%A5%E5%B7%9D%E6%B8%A9%E6%B3%89+%E5%A4%AA%E9%99%BD%E3%81%AE%E6%B9%AF+Hiradani,+Totsukawa,+Nara,+Japan/@33.9761614,135.6612206,12.26z/data=!3m1!5s0x6006f79b2373c1df:0x142d4c8796b1fce8!4m14!4m13!1m5!1m1!1s0x6006e4b8a525d0c9:0xb2f60fd1dd177cba!2m2!1d135.6947625!2d34.0348401!1m5!1m1!1s0x6006f79b230cf8b7:0xb897af21dc755210!2m2!1d135.762548!2d33.93869!3e2), though obviously not the actual route, which leads through a very rough terrain, where you may see no other hikers for hours or in case of inclement weather days.\n\nPlease note that traversing this secton of Kohechi requires your own food and water supply, as well as full hiking gear.",
            "score": 1,
            "author": "mithdraug",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Could someone post this on r/japanlife?",
            "score": 174,
            "author": "Rosendustmusings",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, that would be highly appreciated",
                    "score": 45,
                    "author": "AcademicFly2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you have to contact the mods yourself, unfortunately.",
                            "score": 43,
                            "author": "Rosendustmusings"
                        },
                        {
                            "level": 2,
                            "comment": "I'll try to contact the mods!",
                            "score": 24,
                            "author": "Rosendustmusings"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just happen to be there on business. I’ll ask around in my free time. Although probably won’t be much help",
            "score": 120,
            "author": "ClancyIsDuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "You never know when you might put something in someone's mind that they might realize later or see something after the fact.",
                    "score": 61,
                    "author": "cjxmtn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this all the information you have? Pretty sure that’s a large area. Did she check in anywhere? Last known location?",
            "score": 67,
            "author": "0ld_Ben_Kenobi",
            "replies": [
                {
                    "level": 1,
                    "comment": "\nShe was last seen leaving Mandokoro hostel Monday, April 10th.",
                    "score": 36,
                    "author": "AcademicFly2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Address? It’s not on Google maps",
                            "score": 13,
                            "author": "0ld_Ben_Kenobi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Hello all,\n\nMy wife is missing somewhere on or near the trail. She was last seen leaving Mandokoro Hostel at 7am on Monday, April 10. She never made it to her planned next stay at Giyoja Minshuku Taiyo-no-Yu that evening. \n\nLocal authorities conducted a search but called it off after 3 days. Only then did they contact the US Consulate, so her family is only now on their way to Japan. \n\nPlease, if you’ve seen her, or have any information, however insignificant it may seem, drop a comment below. \n\nThat smile tells you how much she was enjoying her trip. \n\nThank you.”\n\nThat’s all the info we have",
                                    "score": 45,
                                    "author": "AcademicFly2000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The plan was to hike the Kumano kodo trail",
                                            "score": 17,
                                            "author": "AcademicFly2000"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes but do they have an address for the hostel?",
                                            "score": 4,
                                            "author": "laika_cat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Actually I found the place https://www.visitnara.jp/venues/H01160/",
                                                    "score": 17,
                                                    "author": "AcademicFly2000",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "101 Imoze, Totsukawa, Yoshino",
                                                            "score": 10,
                                                            "author": "Kapper-WA",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "吉野郡十津川村五百瀬101",
                                                                    "score": 6,
                                                                    "author": "Kapper-WA"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Giyoja Minshuku Taiyo-no-Yu\n\nThat is here (34.034852,135.694724). I do no know where Giyoja Minshuku Taiyo-no-Yu (her possible next destination is)",
                                                            "score": 8,
                                                            "author": "lpninja1"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Super helpful. Thank you.",
                                                            "score": 4,
                                                            "author": "laika_cat"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Unfortunately I don’t. But there’s a gmail address on the post that you can get in touch with her daughter who’s in Japan now in case you have information about the area.",
                                                    "score": 5,
                                                    "author": "AcademicFly2000"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ll get this info and update the post",
                    "score": 9,
                    "author": "AcademicFly2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you could please so we can all look on the Google maps link.",
                            "score": 2,
                            "author": "Lucylight777",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And here’s the most recent update \n\nPart 1\n\nFirst my family and I would like to express our gratitude for the outpouring of love, support and generosity we have received from everyone around the world. While we cannot respond to all of your messages, please know we are reading them and please keep them coming. When we are in our darkest moments, your words keep our heads above water. \n\nPolice and Rescue Dogs:\n\nAs a result of our incredible friends, family, and continued support around the world, the police restarted their search on April 18 and we were able to find an organization to supply search and rescue dogs to work closely with the police. Since then, we have had the full support of the police. They have been out everyday, using multiple resources, and asking help from prefectural institutions. \n\nFrom the 19th to the 22nd, one or more officers have visited the Taiyo-no-yu guesthouse, where we are currently stationed, in order to gather additional information about our mother and relay the different ways they are working on her case. They have collected things such as my mom’s google history, credit card history, and information we’ve been able to collect ourselves. They will also be looking into social media posts to find anyone who may have seen my mom during her visit in Japan (arrived March 5). At this point in time, with their inability to find any leads, they are opening a parallel investigation to potential foul play whilst continuing search and rescue efforts. \n\nWith the support of the consulate based in Osaka, we have been able to put in multiple requests of the different things we have deemed to be suspicious or concerning. Up to this point, they have been able to follow up on the majority of our requests. \n\nThey have also worked with us to create and print 100 fliers (we will be requesting more) to be dispersed in public areas throughout the region. They have posted a PDF of the flier on their website: \n\nhttps://www.police.pref.nara.jp/cmsfiles/contents/0000000/285/koukaitehai_R5gojou_patricia.pdf\n\nIf you or someone you know lives in Japan please send this around. \n\nPrivate SAR teams:\n\nMountain Works, the private search and rescue group we’ve hired, has been on the trail every day since April 16th. They have been our greatest asset on the ground since we heard of Pattie’s disappearance. They have shown extensive knowledge of the terrain and are able to search in areas off the trail the police are not able to reach. During the first few days, they walked the length of the Kohechi trail and looked in high probability areas where she may have slid or fallen off the path. They also checked nearby waterfalls and streams in case she was lost or injured and found her way to a source of clean water. The majority of their search in the first few days took place on the second half of the trail. They explained, majority of fallen or lost hiker cases occur on the descent from the Miura-toge peak. Unfortunately, they were unable to find any trace of Pattie and continued planning and strategizing with the family to explore other areas off the path. After coming up empty handed on April 20th, the team started considering lower probability areas further away from the trail itself. With their success rate, they started to worry an incident occurred as opposed to an accidental fall or injury.\n\nRecently, we have had a substantial number of volunteers reach out to us through our social media pages, family, friends, and [email redacted] account. As a result over the past 24 hrs we have been able to add 6 additional search and rescue teams to assist in looking across a broader scope off the trail. With the number of teams we have operating out on the ground (including the police), we are hopeful we will find Pattie soon.",
                                    "score": 4,
                                    "author": "AcademicFly2000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Part 2 (please read Part 1 if you haven’t already)\n\nFamily\n\nMy brother, dad, and close friend have been able to walk the length of the Miura Toge Pass of the Kohechi trail with the aid of three experienced, local guides. On April 19th, they started at the guesthouse where my mom was last seen (Mandokoro) and walked the trail leading up to the highest point. During their visit at the guesthouse, they found two pieces of paper with my mom’s handwriting. One appeared to be a list of my mom’s itinerary for the upcoming days. Another (that has been posted to social media) included messages from the people staying at the guesthouse (mom and an Australian guest). My family also reported the first half of the trail was straightforward with very few problem areas considering Pattie’s experience. \n\nThe second day (April 20th) they returned to the peak and walked the descent all the way to the guesthouse at which my mother was intended to stay the night of April 10th. This section of the trail appeared more advanced with slick terrain and narrow footpaths. However, they’re still under the impression it would be unlikely for her to find trouble along the path. On this day, they found a camera at a local residence that pointed directly towards the trail. We have asked the police to follow up on this and after reviewing footage, the camera led to another dead end. During the whole trek, on both days, everyone on the trail had access to cell service.\n\nWhile they were walking the trail, I stayed back to handle logistics and planning. It’s difficult for me to describe my role so I’ve asked my brother to write how he would best describe what I’ve been doing:\n\n“She is the liaison between all these parties: the American consulate &amp; embassy in Japan, DC, private SAR teams, volunteers, cell carriers, the police, translators, accommodation, transportation, our family on the ground and back home. All while trying to keep regular updates with social media, press and gofundme (all of our finances). \n\nSomehow, my sister Murphy (a 27 y.o. Basketball coach) has been tasked with running the whole search and rescue operation on the ground; when clearly, she (nor any of us) are experts in SAR. She has become the de facto point-person for the entire operation. With her living in Singapore, she was in a similar time zone as my mother and the first person to touch down in Japan. Meaning all information was fed through her for the crucial first days of the missing persons case. Now, we have government officials telling her she is the point person on this case because she handled herself so well in those first few days. This is criminally insane. She has government officials asking her to create itineraries so that people just do their jobs every day. Mind you, the missing person is her own mother, and she is expected to keep a level-head and stay logical with all these people. It’s extremely frustrating. And to her credit, she has been extremely gracious throughout this process. The privacy laws are insane. The red tape is astronomical. She’s playing the strongest soldier, and it’s clearly overwhelming for us all but for her the most.”\n\nOther Important Efforts\n\nOur family in the States has been tremendous in reaching out and getting support from government officials and providing insights into the case that myself, brother, and Dad would not have thought of ourselves. They are also the reason our story is out on social media platforms and major media outlets. It is because of their efforts that we were able to find trained volunteers to help with our SAR operations. Just yesterday, our search and rescue team saw another group of individuals out using tactical gear, searching different areas off the trail. After debriefing with all the parties involved, we realized there are individuals taking independent action to help find our mom. There are compassionate, selfless, lifesaving people who are coming down to the Kii peninsula to help search for Pattie. \n\nWe also want to note that Senator Blumenthal and his office were pivotal in getting us connected to the right government officials in Japan. His support alone has caused a domino effect which led to a meeting between the ambassador and the foreign minister. We hope this continues to climb up the ladder until someone officially takes over this entire operation, instead of it being run by a direct family member. \n\n\nAllocation of Funds\n\nWe could not have fathomed the amount of money that goes into a missing person case. On top of that, the area in which we are working is especially difficult and expensive to reach. One taxi from the airport to our location is over $400 USD. \n\nEven though many people have volunteered, we still have to help pay for accommodation, travel, and food expenses. At this point in time: we have utilized close to 90% of our total funds raised (current 136,155 - GoFundMe fees = 131,480). This includes expenses for volunteers, travel and accommodation for my own family, local guides, translators, and private SAR teams.\n\nHere is an overview of how the resources from gofundme have been allocated thus far:\nSearch and Rescue efforts (80k)\nVolunteer Compensation (Transportation, Accommodation, Food) (25k)\nFamily travel and accommodation (8k)\n\nPlease continue to share our story and share this page. We don’t want to have to slow down or stop. People don’t just disappear off the face of the earth. Something has happened. We want to be able to hire a private investigator after putting so much time, effort, and resources into search and rescue. Please continue to help us find her and get to the bottom of this.",
                                            "score": 7,
                                            "author": "AcademicFly2000"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So, the last known location is the guest house \n\nhttps://www.visitnara.jp/venues/H01160/\n\nAnd there’s a flyer from the police \n\nhttps://www.police.pref.nara.jp/cmsfiles/contents/0000000/285/koukaitehai_R5gojou_patricia.pdf",
                                    "score": 3,
                                    "author": "AcademicFly2000"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cross posted to Wakayama International and American JETs Facebook groups. I used to live in Wakayama for 3 years and am familiar with the Kumano Kodo. Please reach out if you think I could be of any assistance to this family.",
            "score": 48,
            "author": "witty-name",
            "replies": [
                {
                    "level": 1,
                    "comment": "I sent you a private message",
                    "score": 8,
                    "author": "AcademicFly2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Kumano Kodou trail in Wakayama? Since it is actually several different trails, if you can tell exactly which one she went hiking I'm thinking it could help. The most popular one is the Nakaheji, and if I'm not mistaken it is also one of the hardest. \n\nI'm hoping you can find her safe and sound.",
            "score": 43,
            "author": "tonkotuCO",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll try to get this info and update the post.",
                    "score": 12,
                    "author": "AcademicFly2000"
                },
                {
                    "level": 1,
                    "comment": "\nShe was last seen leaving Mandokoro hostel Monday, April 10th.",
                    "score": 11,
                    "author": "AcademicFly2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To prepare yourself and her family of the obstacles you'll encounter dealing with Japan's police, do a search on the disappearance of French tourist Tiphaine Veron in 2018.\n\nThe Evaporated podcast episode 7 has a detailed deep dive, with interviews of family members.",
            "score": 44,
            "author": "gulpandbarf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, japanese police are pretty inept. It's known they underreport issues and crimes + their prosecutors only have such a high conviction rate due to pursuing cases only where success is guaranteed / via convictions which may or may not be forced.\n\nHope they find her!",
                    "score": 20,
                    "author": "D_crane"
                },
                {
                    "level": 1,
                    "comment": "There are still posters up for her in Nikko. I just saw one today.",
                    "score": 17,
                    "author": "khuldrim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope this this famliy find their mom asap",
            "score": 38,
            "author": "kretsstdr"
        },
        {
            "level": 0,
            "comment": "Ask the hostel to post the information where other hikers can see it, maybe they can informally help look out for her near trail areas.",
            "score": 32,
            "author": "nominus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Her daughter and son arrived in Japan today and hired some private investigators and are talking to the hostel ppl and other hikers that had contact with her last week",
                    "score": 48,
                    "author": "AcademicFly2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is someone going to hike down the trails and see if they find her? Even if the police have already done that, it might be wise to have someone double-check (of course it should be someone who's comfortable with the rough trail). \n\nAnd if the other Redditor on this thread is correct and there are several trails there, all of them should be checked thoroughly the whole way down.\n\nI say this because I do get concerned about how thoroughly the police really checked the trails. Especially if some of the trails are tough to tackle.",
                            "score": 8,
                            "author": "Pakutto",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Miura-toge pass is the specific trail she was supposed to be in. That’s the trail that connects the place she was to the next accommodation. The private search team was in the area since the 16th. The family is going there tomorrow with a local guide.",
                                    "score": 5,
                                    "author": "AcademicFly2000"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does she use apple devices that you have access to ? Like an ipad that she left behind. If so, you can check where her iphone is if she have one via find my phone. Of course this will only work if both devices are under the same icloud account",
            "score": 20,
            "author": "A-MeiZing-",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think some android devices also offer this service.  While a completely different situation, my mom with dementia misplaced her cell phone and we used it to know her cell phone was still in the assisted living facility.",
                    "score": 1,
                    "author": "soldoutraces"
                }
            ]
        },
        {
            "level": 0,
            "comment": "please add it to a local Drone group also. Best wishes on the search.",
            "score": 15,
            "author": "lpninja1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, do you have the link for any of those groups? So I can share there too",
                    "score": 2,
                    "author": "AcademicFly2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mithdraug has posted a link to the locations of the minshuku at the start and end of Pattie's itinerary for the 10th. As they note, the route between them shown at that link is not accurate.  The official English language guide for the Kumano Kodo's Kohechi Route can be found [here](http://www2.tb-kumano.jp/en/kumano-kodo/pdf/Kumano-Kodo-Kohechi-Route-Maps-Complete.pdf). Minshuku Mandokoro is marked at the right edge of the map on P. 9. Pattie's route for the day begins there and she presumably intended to follow the Miura-toge Pass route shown on P10–11 to her destination hostel Taiyo no Yu, located at the right edge of P11. It is not labelled, but if it were, it would appear in the detail map on P12–13 along Route 168 roughly midway between the Friends restaurant and the Hirataniso inn.",
            "score": 12,
            "author": "Itchy-and-Scratchy4"
        },
        {
            "level": 0,
            "comment": "I hope you will find her! I will share her information with people around me.",
            "score": 9,
            "author": "Whatdidthecatsayoink"
        },
        {
            "level": 0,
            "comment": "https://www.facebook.com/groups/999427673485587/permalink/6118413658253604/?mibextid=S66gvF",
            "score": 8,
            "author": "AcademicFly2000"
        },
        {
            "level": 0,
            "comment": "Thank you for all of your suggestions. Directly below is the latest plea for help, as well as an update from the family who are now in Japan coordinating the rescue efforts.\n\nWe are desperately trying to disseminate to as many local Japanese, US and international news outlets as possible in the interests of getting the information spread as far and wide as possible. I will post a second comment with some Japanese specific tags / outlets we have been trying to engage with:\n\n***We believe our best chance of finding Pattie is with the use of Search and Rescue scent tracking dogs. The previous searches did not utilize any dogs and unfortunately no clues or leads were found. If anyone knows of police units with K-9 units, locals with bloodhounds, or any other ideas on how to get dogs quickly please let us know. The scent trail is now 8 days old and diminishing so time running down.***  \n**Updates from the GoFundMe Page below:**  \nMy family and I have gathered that she was following the Kohechi route of the Kumano Kodo trail, traveling north to south.   \nPattie was last seen on April 10th checking out of the Mandokoro guesthouse at about 7am. The employee remembers her wearing a “brownish red jacket with a camera in her hands.” I have included a photo of her wearing the jacket we believe he was referring to.   \nShe had reserved a stay at the Taiyo-no-yu guesthouse the night of April 10th. The part of the trail between these two particular guesthouses is called the Miura-toge Pass. It is approximately a 18km (11.2 mi) trek that takes about 7-9 hours according to the Kumano Tourism Bureau. Given her departure time and length of route, it was estimated she should have arrived between 4-5pm. At approximately 8:15pm the host of the guesthouse reported to the local police that Pattie had not shown up.   \nAs previously noted, local police conducted a 72 hr search from April 11-13 with 26 officers and helicopters but were unable to find any leads. They were reluctant to restart the search because they did not have any leads and have “limited resources over the weekends.”   \nPattie planned to be in Osaka on April 13th and 14th. She was also supposed to meet up with a couple close to the family in Ryozen-ji Temples on April 16. Our family friends went to the location hoping she would show up but after waiting for a few hours, walking around both temples, and showing Pattie’s picture around, they came out empty handed.   \nMy father, myself, and another family friend (Japanese native) plan on visiting the Gojo Police department tomorrow, April 18 to get more information and urge them to utilize their resources to help us continue with our search. After this we plan on going to Taiyo-no-yu for a few nights with a local guide and translator. We hope to interview both guesthouses, get in touch with the local branch where the call was made, and stop at major checkpoints/sites where people may have seen Pattie.   \nOur private search and rescue team was deployed early morning on April 16 and have so far come up empty but will be continuing their efforts. The past 48 hours they have searched areas where individuals are more likely to get lost, fall from heights, or get swept up by the nearby river. At this point the private search and rescue team believe, “that a very irregular situation occurred on April 10.”  \nOther information to note: the last known text message exchange with Pattie was with me, Murphy. I received a message on Sunday, April 9 @ 8:02 AM (JST) and responded 40 minutes later and the message sent through. The earliest known text message that was not delivered to her phone was from a family friend on Wednesday, April 12 @ 2:53 AM (JST).   \n\\*\\*If you were in contact with my mom and have had any message interactions that fall between these dates and times PLEASE CONTACT ME DIRECTLY!\\*\\*",
            "score": 8,
            "author": "ronnagesh",
            "replies": [
                {
                    "level": 1,
                    "comment": "No personal experience with search dogs, but here are the results of a quick web search. Everything is all Japanese, but I understand the family has language-capable help: \n\n1. In addition to their own resources, the Nara Prefectural Police appear to also [outsource dogs/handlers as needed](https://www.police.pref.nara.jp/0000003041.html), so one would think they might be able to offer info on who to call locally even if they cannot spare their own crews.\n2. There is a Nagano Prefecture based private mountain rescue organization that uses rescue dogs and seems primarily focused on rescues in the Japan Alps but does list at least two successful discoveries in Nara Prefecture over the last couple of years (including one on the Kumano Kodo route in Jan 2021). [This page](https://www.mountain-rescue.net/accomplishment) lists the cases they've worked on. [This page](https://www.mountain-rescue.net/network) shows their staff, including drone pilots and dogs. Phone hotline in upper right corner.\n3. I also find [one other Nagano-based private S&amp;R organization](http://www.backcountry.co.jp/rescue/index.html) (that seems to have taken part in the same Jan 2021 Kumano Kodo search) but they seem more drone focused and there is no mention of dogs.\n4. I don't immediately find any similar organizations in Nara or the Kansai area.",
                    "score": 4,
                    "author": "Itchy-and-Scratchy4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you",
                            "score": 2,
                            "author": "ronnagesh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you have Facebook please consider joining both the Japan Travel Planning group and Japan Travel, Friendly Discussion Groups to post this. Both groups have thousands of locals and tourists posting trip reports, advice for international travel including incidents while abroad etc. I’m certain that the mods will let you post (I think only the friendly discussion is on admin approvals), maybe someone in there did that same hike that week and could be of value? It’s an easy way to get word out as well to thousands who are actually there in Japan, I haven’t seen her missing notices or news articles posted on there at all which is surprising.",
                    "score": 4,
                    "author": "gtck11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ll definitely try that. Thanks",
                            "score": 3,
                            "author": "ronnagesh"
                        },
                        {
                            "level": 2,
                            "comment": "Please help keep the fundraising momentum up to find Pattie -Donate and Share.\n\nWe are reaching out to everyone for another push on the fundraising effort. \n\nPlease share the posts on all of your social media.\n\nInstagram: https://www.instagram.com/p/CrS57RUPdUh/?utm_source=ig_web_copy_link\nFacebook: https://www.facebook.com/fastbreak.com.sg/\nTwitter: https://twitter.com/fastbreakbcsg/status/1649368623222513665?s=46&amp;t=p4OEEJlk7f5tGreYPFdzZw",
                            "score": 3,
                            "author": "ronnagesh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP please consider joining Japan Travel Planning and Japan Travel, Friendly Discussion Group on Facebook I’m a member of both and they’re full of tourists posting trip reports across all parts of Japan, it could be helpful to get the word out and find others who did the same trek last week!",
            "score": 8,
            "author": "gtck11"
        },
        {
            "level": 0,
            "comment": "Latest update on the GoFund page by Murphy:\n\nUnfortunately, another week has passed and we are still coming up empty handed. This past week has been especially difficult on the family with my dad's birthday, Mother’s day, and my parent’s 33rd wedding anniversary all occurring days apart from each other. \n\nOur local Japanese SAR team was unable to search for a week straight due to heavy rain and other assignments. They have recently been able to start search efforts again, extending their search beyond the Miura-toge pass. We are doing what we can to assist them in choosing search areas but they are only able to field a two member team from here on out. \n\nWhile this was taking place, my father and I had multiple conversations and meetings with the top ranking members of our US SAR groups. We discussed scenarios, planning regions, search strategy and evaluated the overall risk versus gain of additional efforts. Last night, we participated in a virtual strategy meeting with representatives from all three waves that came to Japan, as well as planning experts who have done a tremendous amount of work remotely. \n\nAt the end of this meeting the team came to a consensus and agreed the best course of action is to assist the Japanese team by filling in the remaining gaps along the trail. We are gearing up to fly another US SAR team as soon as possible. We will keep our eye on the region’s weather to ensure this wave has at least four consecutive days with no rain in order to have the best visibility and avoid losing out on a working day. \n\nThe team also agreed that getting data from the Japanese telecommunication companies would help us narrow the search area. The FBI continues to work with Japanese officials to see if this data is available. However, we have been waiting for this data for over a month and are waiting to hear back about a potential timeline. We will hold off sending a team if they can provide us with any information or progress otherwise we are not willing to stand by idly for an additional month. \n\nIn order to send out this group we need your help in making another big push on our GoFundMe. It costs about $5,000 to field a single SAR member from the US. This includes last minute flights, accomodation, food, taxis and other expenses incurred along the way. We would like to source at minimum a 6 member team. This also means I will likely be returning to Japan to help with logistics on the ground and will also need to aquire flight and accomodation for myself. \n\nWe know so many of you have contributed to our efforts and understand everyone has financial burdens of their own. If you are unable to make a donation we ask that you please share this link and continue talking about our story. \n\nJust by spreading awareness, we have received information from a solo female hiker that a man near one of the Kumano Kodo trails asked if she would go home with him to help him practice his English. This incident occured on April 20th, 10 days after Pattie’s disappearance. We forwarded all information to the Japanese police as well as the FBI and this hiker has been more than willing to help in any way she can. This is why we need to continue talking about my mom’s story. The police have come to a lot of dead ends in their investigation but its you getting our story out on multiple platforms to reach people all around the world who have these stories that we never would have been aware of. We still believe there is a possibility that Pattie’s trust in people could have made her a victim of foul play and all stories and suggestions are welcomed. \n\nWe remain determined in our pursuit to find Pattie, to find answers.",
            "score": 8,
            "author": "AcademicFly2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "I donated something small today, it’s all I could afford. I wish I could do more.",
                    "score": 2,
                    "author": "Tall_Egg9224"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope they really do find her safe and sound. Was she travelling alone? Doing the hike alone? Don't people usually go in pairs or more when traveling or hiking for that matter? Isn't it a bit dangerous to travel alone when you're that much older?",
            "score": 6,
            "author": "DesertDragen",
            "replies": [
                {
                    "level": 1,
                    "comment": "She was alone yeah, but she was used to this kind of trip.",
                    "score": 4,
                    "author": "AcademicFly2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should reach out to the youtube r\"oriental pearl\"  -- shes a brilliant young woman who speaks chinese, japanese, english, and korean fluently.  She lives in Japan and her husband is japanese.  \n\nShe has connections all around japan and might be able to help.",
            "score": 5,
            "author": "kbdcool",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the big issue with reaching out to YouTubers is, whether or not they will even see the message/email/comment regarding it. If she's as big as it sounds, it becomes almost infinitely unlikely she'll see the pleas",
                    "score": 7,
                    "author": "civilized-engineer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She has a business email address that I am confident she would at least respond to.",
                            "score": 6,
                            "author": "kbdcool"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope she is safe.. but hiking the Kumano Kodo trail system is very treacherous.   It is not a trail from point A to B.   There are many branches of the Kumano  trail and it can be easy to get lost.  Some places are remote and if you have an accident on a weekday, you can't expect that someone will pass by to offer you help.     Japanese trails for the most part follow the spine of a mountain.  Some trails can be just a meter or so wide and slip either way, you are going down a sleep slope with many rocks and trees to injure you.   The mud is fine and very slippery, carrying micro-spikes even in the summer is a must.  After a heavy rain, trails can get very slippery.   Another problem are the bears...  in this area I stayed at a free mountain hut for a night, the next morning maybe 200 meters from where I was sleeping in the middle of the trail was bear poop still fresh.   Even guided tours can be dangerous.. there have been tours where the leader caught hypothermia and a few of the tour members died.. and this was in the summer.   I saw a group of 12 hikers or so come in to the hiking lodge I was staying after dark on a rainy night hiking the Odaigahara trail.   Some of the trail is only a body length in width with a sheer 200 meter drop into a river.   Not a place I would hike in the dark in the rain.   This is someone who has hiked Nara and Wakayama numerous of times.",
            "score": 5,
            "author": "frenchosaka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for that, people tend to forget that the saying 'japan is one of the safest countries to travel to' pertains to city life and people, not the rugged countryside.\nI agree with all the above, after having hiked parts of the michinoku coastal trail, I'd never even dare to do kumano kodo on my own. \n\nHiking in Japan is no joke, not even for seasoned hikers.",
                    "score": 3,
                    "author": "TheBungo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Best of luck finding her.",
            "score": 5,
            "author": "No_Document_7800"
        },
        {
            "level": 0,
            "comment": "As an update, the family is still searching and adding new information on the Go Fund Me page! There are currently no suspects or evidence of human remains. The family is still fighting diligently to bring their loved one home or figure out where she could be!",
            "score": 5,
            "author": "mybackhurtsimtired",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is so frustrating, I can’t wrap my head around the fact that there’s not a single trace of her anywhere",
                    "score": 3,
                    "author": "AcademicFly2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "UPDATE TODAY FROM GO FUND ME \n“We received information on May 1 regarding three trail runners who were seen on the camera located before Mandokoro at 8am. This same group of athletes were spotted on the post office camera towards the bottom of the trail 3 hours later at 11 am (closer to Taiyo-no-yu). Based on this pace, they would have passed Patricia on the ascent to Miura peak. However, all three trail runners confirmed they never saw her. \n\nThis has led many people to believe the likelihood she made it onto the correct trail is significantly lower than we originally thought. There is a path directly across the main trail head that we have been focused on over the last 3 days. Although there is a sign that says \"Not Kumano Kodo\" at the beginning of this route, we also discovered multiple white banners tied around trees that said \"Kohechi Trail\" in orange letters. These banners were used for a trail running event back in October of 2022. Coincidentally, the day after we found these banners, two trail maintenance workers were taking them down. \n\nAfter preliminary search efforts from Mountain Works and our American SAR team, it seems unlikely she would have continued down this path. However, we have learned a handful of people have struggled finding the entrance to the Kumano Kodo in this area. Since Pattie’s disappearance, new signs have been put in place in multiple areas in Miura Guchi (where Mandokoro is located). We have asked our local team and volunteers to continue their search efforts in this region of the trail. My brother, Bryce, has also managed to procure multiple drones and drone operators in order to cover as much of this new ground as possible. We plan on putting this footage through forensic imaging software (provided by our US SAR team) with the hope to detect colors Pattie was last seen wearing. \n\nAfter an extensive meeting with investigators on May 2, there is no evidence that suggests foul play occurred in Patricia’s case. However, the investigation remains open and the family still considers this as a possible explanation to her disappearance. The local police have notified the family they will continue providing search efforts on the ground and in the air (helicopters) until May 7. After this date, they will adjust to patrolling along major roads and waterways along the trail. \n\n\nThe bottom line is we still have ZERO leads from both the SAR &amp; investigative side of my mom’s missing persons case and not for a lack of trying. “",
                            "score": 8,
                            "author": "mybackhurtsimtired"
                        },
                        {
                            "level": 2,
                            "comment": "This is SO traumatic and the complete absence of any evidence is so jarring! I’m trying to share on SM as much as I can",
                            "score": 6,
                            "author": "mybackhurtsimtired",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s the worst part, since she disappeared there’s not a single trace of her anywhere. It’s like she just vanished from the face of Earth.",
                                    "score": 4,
                                    "author": "AcademicFly2000"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can’t imagine how Mr. Murad, Murphy, Bryce amd Rachel are feeling frustrated… I’m not even from the family and I’m super frustrated with the lack of evidence",
                            "score": 3,
                            "author": "AcademicFly2000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "!RemindMe in 1 week",
            "score": 4,
            "author": "Pakutto"
        },
        {
            "level": 0,
            "comment": "I'm not in that region, but all I can say is I hope and pray you and your family have a happy outcome.",
            "score": 3,
            "author": "funbunnystar"
        },
        {
            "level": 0,
            "comment": "I am trying to work out where the caves are in relation to the area of disappearance.",
            "score": 3,
            "author": "Lucylight777",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, were you able to see the update? There’s some more detailed info about the trail she was supposed to be in.",
                    "score": 3,
                    "author": "AcademicFly2000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 2,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I’ll be in the area this week! I’ll ask around as well!",
            "score": 2,
            "author": "Distinct-Cup-9890"
        },
        {
            "level": 0,
            "comment": "Long shot, but do you/the son have a way to login to the moms Google/Apple account to get the phones last location?",
            "score": 2,
            "author": "M4NOOB",
            "replies": [
                {
                    "level": 1,
                    "comment": "So, she went missing April 10th, the family only found out about it on the 14th and by then the location was not available anymore.",
                    "score": 2,
                    "author": "AcademicFly2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If Google Maps was installed on the phone and the timeline feature wasn't disabled, you may get lucky there: [https://timeline.google.com/maps/timeline](https://timeline.google.com/maps/timeline)\n\n&amp;#x200B;\n\nIt lets you look at your location data ever since you installed Google Maps, no matter if it was years ago (unless you disable the tracking). I can go back as early as 2014 for example",
                            "score": 5,
                            "author": "M4NOOB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You need to login using her user and password",
                                    "score": 1,
                                    "author": "Loud_Discipline4461",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hence my first comment is referring that?",
                                            "score": 5,
                                            "author": "M4NOOB"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can anyone confirm if this was a self guided package tour/walk hike that had an extra day of the Kohechi.\nI read a latter update and I think based on the description the was the following route covered: mizugamine peak - omata- Obako Togo pass - Muira guchi- miura toge pass - totsukawa onsen? \n\n\nAnd then I saw another later update which said there were markers which were semi misleading regarding a label for a running track set up for an event. Is it possible she never made it onto the track and was mislead somehow onto the false track? \n\nhttps://itra.run/Races/RaceCourse/KOHECHI.Trail.Journey.in.TOTSUKAWA.KOHECHI.Trail.Journey.in.TOTSUKAWA/2022/77528\n\nThis is the map for the event.\nAssuming the navigation of her next destination.. if she followed this track she would have been going the wrong way which may be cause for the trail runners not having seen her and the camera footage not showing her near the planned destination?\n \nThe distance for the markers would have been a total of 58km. \n\nAlso can anyone confirm if the trail is similar to Nakasendo (Magomr) because I know in that region there is bears? But I’ve not done this trail before and I am unsure if this region has the bells that ward off bears.",
            "score": 2,
            "author": "Tall_Egg9224",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could she have headed towards the mountain instead of the pass? I’ve emailed the gmail account.",
                    "score": 2,
                    "author": "Tall_Egg9224",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The search team covered a huge area, but I can’t confirm if they followed the “wrong trail” until the end.  If you think you may have helpful information please send a message to the email linked on the post. I appreciate the concern and the interest in helping.",
                            "score": 2,
                            "author": "AcademicFly2000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read that there was some loss in momentum since the family had to leave Japan, do you know if they’ve been able to gain that back at all? I hope the SAR will not quit early on them after some of their comments. This is so bizarre to me how there is no trace still after all the searches and her likely wearing such bright clothes.",
            "score": 2,
            "author": "gtck11",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’re seeing the options and considering sending another group from the US. The biggest issue was the local police reducing their resources to the search. But they’re still working with the fbi in order to get access to the phone information, hopefully it’s gonna happen soon. \n\nAnd yes this is a very weird situation, there is zero evidence that she even got to the trail that day. No smell left behind, no images in the security cameras, other people who were in the trail haven’t seen her that day. It’s like she just vanished.",
                    "score": 2,
                    "author": "AcademicFly2000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s great news about the FBI, it’s crazy to me how Japan police handle these things. It reminds me of the girl from France who had a similar situation years ago, and if I’m remembering correctly the local police did even less for her and washed their hands of it. Kind of makes you wonder if there was some sudden bizarre shift of plans - like she changed plans or met someone (harmless or not) who convinced her to go somewhere else? I hope they get some answers soon.",
                            "score": 2,
                            "author": "gtck11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me too. Apparently Japanese police is known for how bad they handle these kinds of situations. We’re all still hoping for the best, or at least for some closure. She is an amazing woman and the family is really suffering. \n\nThe weirdest thing is that she’s very experienced, she knew the trail and said it was not going to be crazy challenging.",
                                    "score": 2,
                                    "author": "AcademicFly2000"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -97,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’s Chinese and married to an American man.",
                    "score": 16,
                    "author": "AcademicFly2000"
                }
            ]
        }
    ]
}