{
    "id": "12wwke1",
    "score": 2,
    "title": "What to do in Tokyo area on a Sunday (August Travel)",
    "author": "Least-Biscotti364",
    "date": 1682296623.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12wwke1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all, just want to ask if anyone has any recommendation on an activity within Tokyo for a family of 3 (with a 1.5 yo baby)? Our current itinerary is below, I'm running out of ideas where to go on a sunday that's not too crowded or tiring. For context our accommodation is in the alley beside Sensoji.\n\nDay 1 - Friday (Asakusa) August 11\n\nTranspo to (Accommodation)\n\nBag drop at Accommodation\n\nCheck in at Accommodation + Rest\n\nWalk around Asakusa/Kaminarimon + Asakusa Culture Tourist Station (viewing deck 8th floor)\n\nDay 2 - Saturday (Ueno) August 12\n\nUeno Zoo\n\nNational Museum of Nature and Science\n\nStroll around Ameyoko (+gacha/arcades/souvenirs) + snack\n\nDay 3 - Sunday August 13\n\n?????\n\nDay 4 - Monday (Ghibli Museum) August 14\n\nDay 5 - Tuesday (Disney Sea) August 15\n\nDay 6 - Wednesday (Akiba) August 16\n\nDay 7 - Thursday (Shibuya) August 17\n\nDay 8 - Friday (Departure) August 18\n\n&amp;#x200B;\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "It might take some creative googling but a lot of temples have flea markets on Sundays. There should be a Tokyo-wide schedule at the very least, it was what I used to find the \"antique sale\" at Hanazono where we picked up some lovely secondhand kimono obis and cool lacquerware plates.\n\nGood luck with the heat in August!",
            "score": 3,
            "author": "wakattawakaranai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the heads up! I was initially looking at Sumida Aquarium at Skytree then the Hop on Hop off to odaiba but if that's too hot then good thing I scrapped that. I'll check on that flea market, we're very fond of thrift shops and the only ones we've been to is Hard-Off!",
                    "score": 2,
                    "author": "Least-Biscotti364",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Y'know I love Hard-Off, but there's definitely more opportunities if you love thrifting. The flea markets/resale booths at temples are still outside, so you'll still be baking in the August heat, however it's not strenuous, and chances are good there'll be delicious street food vendors on the spot as well.\n\nI'm disappointed we didn't have a chance to get to Shimokitazawa, The Suburb For Thrifting, but I feel like Shimokita in August would be hotter and nastier than casually strolling through a temple. Shimokita is more for vintage clothing and maybe music, but you'll find art, dishware, kimono, trinkets, and a wide range of weird shit at flea markets.",
                            "score": 2,
                            "author": "wakattawakaranai"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly there are a million awesome parks in Tokyo that your kid will like and won’t be crazy crowded. Just regular neighborhood parks all over the place. Some have really cool or funky playground equipment. Some have sand pits. Go to a park in the morning, then grab lunch, back to hotel for a nap and that’s a good bit of your day! Maybe explore another park in the afternoon! [The Tokyo Chapter](https://www.thetokyochapter.com/) lists and reviews lots of parks. Be sure to stop by a Daiso or similar first and grab some bubble wands for an even better experience!\n\nYou could also go to someplace like [The Toy Museum](https://art-play.or.jp/ttm/), but on a weekend I’d get there early as parents all of have the same issue on a weekend (what do we do to get kid out of the house??)\n\nI’ll also say that we just did a rickshaw ride with our 4 year old and it was FANTASTIC, as kid got to be up high checking everything out and no one had to walk much. The company, [Ebisuya](https://www.ebisuya.com/), also operate in Asakusa. We plan on trying a ride with them in Asakusa some time.\n\nETA: I see you’re traveling in August. Definitely look for fountains or similar in parks so kid can splash around. It’s pretty hot. Or look for indoor playgrounds, but they’ll get crowded as everyone else tries to escape the heat. We love Bornelund in Yokohama, and I see they have locations in Tokyo too.",
            "score": 2,
            "author": "beginswithanx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for the tips and suggestions! My wife is more than excited to go to to the Toy Museum, I also saw that  beside it is the Fire Fighting Museum which is free!",
                    "score": 1,
                    "author": "Least-Biscotti364"
                }
            ]
        },
        {
            "level": 0,
            "comment": "On weekends there are often events and festivals at various parks. I remember I went and stumbled upon a Filipino food festival on the day I went to Ueno!\n\nSunday august 13th is the start of Obon this year so perhaps there are some Obon-related events to check out?",
            "score": 2,
            "author": "11plantsandcounting",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the summer there are also sometimes water features in parks for kids to play in so that could be somewhere for you child to cool down and have fun. I’m not sure what’s in the Tokyo area for that, though.",
                    "score": 2,
                    "author": "11plantsandcounting"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tsukiji Fish market is good on a Sunday.",
            "score": 2,
            "author": "Planet-Nice"
        },
        {
            "level": 0,
            "comment": "When I first visited Tokyo over a decade ago I went to Yoyogi Park on a Sunday afternoon, and there happened to be a meetup of rockabilly dancers. I learned it happens weekly by the Harajuku Station entrance to Yoyogi. Hopefully it is still going on, check it out for a fun slice of Tokyo life.",
            "score": 1,
            "author": "pequapitt"
        },
        {
            "level": 0,
            "comment": "The Fish Market in the early morning.",
            "score": 1,
            "author": "caveatemptor18"
        }
    ]
}