{
    "id": "12yk4gs",
    "score": 10,
    "title": "Itinerary Check/ 18 days Tokyo, Nagano, Osaka, Kyoto, Hakone",
    "author": "MinuteMaidJuicer",
    "date": 1682430831.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12yk4gs",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys! \n\nWill be heading to Japan next month with my wife and would like to get some feedback on the feasibility of our itinerary, as well as suggestions on how to make it better. \n\nI’m trying to keep the days not so packed so we have some time to explore and perhaps wander into a hidden gem\n\nWe will be utilising the JR Pass from day 5 onwards :)\n\nThanks in advance for your responses!!\n\nDay 1 – Narita / Tokyo\n-\tSetting luggage down at Narita Airport, heading down to Narita Town\n-\tBack to Narita Airport and JR to Hotel\n-\tStroll around Ginza area\n\nDay 2 – Tokyo\n-\tSushi Dai (intending to reach at 3am for this)\n-\tTsukiji Outer Market\n-\tSeiko Museum Ginza\n-\tGhibli Museum\n-\tStroll around Shibuya area / dinner\n\nDay 3 – Tokyo\n-\tTeamlabs (first slot to avoid the funk)\n-\tSmall Worlds\n-\tMipig (Micropig café)\n-\t??? still thinking of what to do today, any suggestions would be great\n\nDay 4 – Mt Fuji \n-\tShibazakura festival\n-\tFugaku Fuketsu Wind Cave\n-\tNarusawa Hyoketsu Ice Cave\n\nDay 5 – Nagano / Yudanaka Onsen &amp; Snow Monke\n-\tShinkansen to Nagano (Sending luggage to Osaka hotel, backpacking in the Nagano leg)\n-\tYudanaka Onsen Seifuso\n-\tExplore snow monkey park\n\nDay 6 – Nagano / Shinbu Onsen\n-\tTransfer to Shinbu Onsen Kanaguya\n-\tWhole day at Shinbu Onsen and ryokan\n\nDay 7 – Nagano / Obuse\n-\tObuse \n-\tCheck into hotel near Nagano Station\n-\tDinner at Shinshu Soba\n\nDay 8 – Toyama / Tateyama-Kurobe Alpine Route\n-\tTateyama-Kurope Alpine Route (one day to Toyama)\n-\tEnjoy Toyama bay sushi\n\nDay 9 – Osaka\n-\tShinkansen to Osaka\n-\tUmeda Sky building\n-\tOsaka Castle\n-\tShitenno-ji\n-\tDotonburi Kani Doraku\n-\tHozen-ji Yokocho\n-\tRound One\n\nDay 10 – Osaka\n-\tKuromon Market\n-\tTakoyaki Tamaya / Harukoma Sushi\n-\tCup noodle museum\n-\tShinsaibashi / Doguyasuji\n-\tIsomaru Suisan Namba\n-\tDotonburi\n\nDay 11 – Osaka / Day trip to Hiroshima\n-\tMiyajima\n-\tAnagomeshi Ueno unagi\n-\tHiroshima Peace Memoral Museum &amp; Park\n\nDay 12 – Osaka / Day trip to Himeji Castle &amp; Kobe\n-\tHimeji Castle\n-\tKobe Lunch\n-\tKobe Nunobiki Herb Gardens\n\nDay 13 – Kyoto\n-\tDeposit bags at Kyoto hotel\n-\tFushimi Inari Taisha \n-\tNishiki Market\n\nDay 14 – Kyoto / Amanohashidate\n-\tAmanohashidate (day is not really planned yet)\n\nDay 15 – Kyoto / Arashiyama\n-\tSagano Bamboo Grove (as early as possible)\n-\tKakura koisenyen\n-\tStroll around arashiyama for street food\n-\tArashiyama Randen Station\n\nDay 16 – Kyoto / Nara day trip\n-\tNigatudo \n-\tSangatsudo\n-\tTodaiji Temple / Yoshikien Garden\n-\tNakatanidou Mochi\n-\tNara Park\n-\tDinner @ Kamameshi Shizuka Kouen-ten\n-\tSend Luggage to Narita hotel\n\nDay 17 – Hakone\n-\t(day is not really planned yet. Intending to do the Hakone loop and stay in a ryokan) \n\nDay 18 – Transit to Narita \n-\tThinking of spending the day in Hakone, or if there are any other suggested day trips before heading to Narita Airport hotel\n\nDay 19 – Flight back home",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Aw I did my student exchange in Toyama. So happy to see this on your plans, it’s a beautiful place (especially the yuki no otani!) \n\nI’d avoid the micropig cafe or any similar “exotic” animal cafe, if you have a look through other posts on this sub you’ll see a fair bit of agreement that they’re not the greatest in terms of animal welfare. AFAIK there are some cat cafes run by shelters that are more legit if you are looking for some kind of animal cafe experience. \n\nHakone is lovely (just did three nights there), I also did a day trip to Kamakura which was great too. I you’re into exploring temples/shrines I would give it a look, Hasedera and Daibutsu are amazing sights IMO.",
            "score": 11,
            "author": "matcha_oatmilk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks a lot!! Would definitely look them up for the last day before Narita. \n\nWould also explore alternatives from the mipig cafe! \n\nReally looking forward to Toyama especially! A little regretting not dedicating more time but the hotel at the top of the alpine route was really expensive",
                    "score": 1,
                    "author": "MinuteMaidJuicer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi!\n\nNone of this is meant to be rude.\n\nI just want to make sure you are aware of the G7 Conference in Hiroshima in May since you don't have your dates listed.  I expect it is going to cause a lot of trouble in Hiroshima for regular tourists.\n\nI hope you have your Ghibli Museum Tickets already.\n\nPersonally, I can't imagine the snow monkey park being as interesting in May since it's not snowy then.  The monkeys don't exactly want to go in the onsen when it is warm and often need to be bribed to do so.\n\nI do really like Nagano though.  I've been multiple times.\n\nBTW you're not actually taking a shinkansen most of the way to Osaka.  From Toyama, the fastest way to Osaka by far is taking the shinkansen one station (or the Tsurugi shuttle shinkansen) to Kanazawa (about 20 minutes) and then taking a limited express to Osaka about 3 hours to Osaka Station, though there might be transfer time.  I guess you could also take a Limited Express Hida to Nagoya and then switch to a shinkansen, but there are only 4 Hidas a day and the trip is going to run you like 3.5 hours without even taking into account then catching a shinkansen in Nagoya.  The only way to do the trip almost entirely by shinkansen would be backtracking to Tokyo from Toyama and then taking the shinkansen from there to Shin-Osaka but that would take more like 5 hours just in train travel not including any transfer times and is the slowest method.\n\nGood luck!",
            "score": 6,
            "author": "soldoutraces",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heya! Thanks for the comments! \n\nTotally didn’t know about the conference, checked and it’s right smack in the day we’re supposed to go hahaha. Would it be wise to still go? \n\nGotten our tickets after an online queue battle at the start of this month!\n\nAlso prepared for the lack of monkeys - do you recommend anything in particular for nagano? \n\nThanks again for your info!",
                    "score": 2,
                    "author": "MinuteMaidJuicer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi!\n\nAgain I don't know your exact dates but....\n\n[https://www.reddit.com/r/JapanTravel/comments/12nld6r/hiroshima\\_peace\\_memorial\\_museum\\_closed\\_for\\_g7/](https://www.reddit.com/r/JapanTravel/comments/12nld6r/hiroshima_peace_memorial_museum_closed_for_g7/)\n\nThe thread also mentions Miyajima being closed to tourists during that period.\n\nSo I think going to Hiroshima then is just really not on the table.  I would give the whole area a few days leeway on either side of the official conference to give time for setup up and letting things go back to normal.\n\nPerhaps you might want to switch it out with Nara?  Getting to Nara from Osaka is 100% doable and there is an early Hikari from Kyoto that goes directly to Hiroshima, I want to say it leaves around 8, but you would need to check.  I took it and made a 10:30 am train to Miyajima and was on Miyajima by 11:30, but I was just doing Miyajima and not trying to go to Hiroshima as well that trip.  (I was traveling with my then 6 year old.)\n\nI like Zenkoji in Nagano and I keep always meaning to go to Togakushi.\n\nI went to Matsumoto as a day trip from Nagano, there is one express train every hour or perhaps more often?\n\nBessho onsen I've heard is quite nice  and I liked the ruins of Ueda Castle, which is easy to visit on the same trip.  \n\nI enjoyed the ruins of Matsushiro Castle and Kawanakajima Battlefield Park, though I visited the latter during Autumn leaf viewing.  I don't know what it is like in May.\n\nI went to Shiga Kogen during February so it was snowy, but supposedly it is nice to hike when the snow is gone and there could still be some patchy snow as the back ski areas are much further up the mountains than the monkeys.  [https://www.shigakogen.gr.jp/english/green/trekking.html](https://www.shigakogen.gr.jp/english/green/trekking.html)\n\nI've not been but Karuizawa it has some nature and birding tours. \n\nI am specifically making sure everywhere I mention is within 1 hour of Nagano, since it makes it easier for the Alpine Route you have planned later in your trip.\n\nI've stayed at the Dormy in Nagano City and the Metropolitan.  The latter was much cheaper than I expected.  I stayed at Hotel Senjukaku near Jigokudani.  \n\nI hope this information helps and sorry about the bad news regarding Hiroshima!",
                            "score": 3,
                            "author": "soldoutraces",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mate you’re an absolute lifesaver. Would have wasted a good day otherwise! \n\nI’ll probably switch Nara and Hiroshima days around then.\n\nWas looking at Bessho as well and considering cancelling my booking at yudanaka (which is right beside Shibu onsen anyway) for it \n\nWill take a look at available ryokans in bessho ;)\n\nReally appreciate your wealth of information provided!",
                                    "score": 2,
                                    "author": "MinuteMaidJuicer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Glad I could help! :)",
                                            "score": 1,
                                            "author": "soldoutraces"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just came from the Tateyama Alpine Route - it’s so nice up there! \n\nJust a note, I think it’s better if you book your tickets directly from the website or along the route itself instead of joining a Klook group - so you have control how long you want to stay in each section. \n\nAlso I can suggest to swap Hakone with Nikko - it’s a wonderful there, almost like a slightly less touristy version of Kyoto.",
            "score": 5,
            "author": "bigbadbernard",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi thanks!! Let me check Nikko out! \n\nWe are intending to get the one way trip tickets at nagano station a day before.. would online be better?\n\nAlso, would u recommend anything in particular up the Tateyama Alpine route to dedicate more time on? \n\nThanks a lot!!",
                    "score": 1,
                    "author": "MinuteMaidJuicer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you can get online that would be the best, but online tickets sell out really fast. Your plan to get tickets from Nagano should be alright. And I think going from Nagano to Toyama is better as there are way more people coming from Toyama to Nagano from what I saw.\n\nThe Klook tickets costs twice as much as when you buy directly from the website or along the route itself. \n\nMurodo is definitely where you want to be - there are a number of hiking routes suggested and it’s worth doing at least 1 of them. Though Kurobe Dam and Midogihara are quite nice too. \n\nAlso I suggest to go as early as possible to avoid crowds - I think we reach Shin Omachi at around 7:30am and reached Murodo around 10:30am. \n\nLastly, you can consider luggage forwarding from Hotel A in Nagano to Hotel B Toyama so you won’t be bringing a lot of things along the Alpine Route.",
                            "score": 1,
                            "author": "bigbadbernard"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Day 3 TeamLabs funk is unavoidable. We were there at open today - every soft surface (there are a lot) has absorbed the smell and it permeates those areas. The places where you get relief are the water areas (chlorine smell) and the mirrored floor areas. I suggest you wear a mask in here even if you aren’t for the rest of your visit to Japan as it definitely helps a bit with the smell.",
            "score": 2,
            "author": "pogs1827"
        },
        {
            "level": 0,
            "comment": "A thought on the Hiroshima/Miyajima day: it’s quite full for one day especially factoring in the fact that you’ll be riding the Shinkansen to/from Hiroshima (roughly 90 minutes each way on the faster Sakura line). If you go to the peace park and ride transit to Miyajima, it’ll take about an hour to get back to Hiroshima station, take a local train to Miyajimaguchi, and riding the JR ferry to the island. Add about the same amount of time to get back to Hiroshima so you can catch a Shinkansen back to Shin-Osaka and that’s a lot of transit time for one day.\n\nOn the Himeji/Kobe day, you can definitely get back to Kobe by lunch but you’d need to get there around when they open at 9 and generally move quickly. We did a guided tour (free English speaking tour guide volunteer) and while a little slower than we otherwise might’ve gone through the castle, it really made it a special experience. I also recommend the gardens adjacent to the castle (Kokoen). Castle with tour took us 2 hours. Garden took another hour plus we had a nice lunch at the restaurant in the garden. Then you have to deal with the less frequent train schedules so you might not get a Shinkansen to Kobe exactly at the right time (roughly hourly departures, plus slower local train options) We got to Kobe around 2-3 and opted for dinner instead of lunch. If you do Kobe beef it’ll be more expensive than lunch, but I think that’s worth it to take a bit more time in Himeji.",
            "score": 1,
            "author": "pogs1827",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your suggestion on Himeji!! Just applied for a volunteer guide for the Himeji leg of the journey. Guess we would also have to settle on a more pricey Kobe dinner :)\n\nOn Hiroshima: it does indeed seem to be a little packed for a day trip.. would really have to plan in depth for this. Really wanna see both though I understand that it’ll be mostly touch and go without much room for exploration",
                    "score": 1,
                    "author": "MinuteMaidJuicer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Make sure you leave some time in Hiroshima and space in your stomach to try some of the other food specialties - oysters and Hiroshima style okonomiyaki. On Miyajima in the town there are numerous vendors where you can get a couple grilled oysters for 500-600 yen, probably easiest to just try as a street food snack there rather than looking for a restaurant to eat at. For okonomiyaki, okonomi-mura is walking distance from the peace park and there’s any number of places there to get one.",
                            "score": 2,
                            "author": "pogs1827",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Heya! We did a free guided tour at Himeji and it was really not to be missed. Thanks for the suggestion!",
                                    "score": 2,
                                    "author": "MinuteMaidJuicer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Glad you enjoyed it!",
                                            "score": 1,
                                            "author": "pogs1827"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Strongly suggest spending the second day in Hakone. We went to a private onsen and loved it!",
            "score": 1,
            "author": "hotspots_thanks"
        },
        {
            "level": 0,
            "comment": "Definitely check out zenko-ji temple in Nagano, maybe over the snow monkeys. I was most pleasantly surprised by this part and nagano is known for oyaki which are sold all over the street leading up to it. I found it to be a quieter, more enjoyable version of senso-ji in tokyo. We also stayed in Yudanaka and debated going to the monkey park, but ultimately canned the idea. Instead, we stored our bags at nagano station after arrival, walked around nagano for a few hours, then caught the train to Yudanaka closer to the end of the day.",
            "score": 1,
            "author": "pbj800100"
        }
    ]
}