{
    "id": "12ytndw",
    "score": 176,
    "title": "Trip Report: Disneyland and DisneySea Early April",
    "author": "foodonmyplate",
    "date": 1682451667.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12ytndw",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/TokyoDisneySea/comments/121kwgy/believe\\_sea\\_of\\_dreams/jf5kqim/?context=3](https://www.reddit.com/r/TokyoDisneySea/comments/121kwgy/believe_sea_of_dreams/jf5kqim/?context=3)"
    ],
    "postText": "I posted our entire trip report but left out the Tokyo Disney Resort part since most travelers don't need that information. It seemed some wanted it so I am making a separate post! I used the r/TokyoDisneySea subreddit for information and questions. We had the catch 22 that we didn't want to get spoiled too much but we also wanted to be prepared, not sure if that worked in our favor but I'll give details here so read at your own risk!\n\nTraveling squad: Me (36F), husband (37M) and 6 year old daughter\n\nTips: \n\n* Make sure you have your app downloaded, signed in and credit card information inputted. We bought our tickets through our hotel when we checked in, only possible at Disney hotels and we didn't have to worry on if tickets sold out or not. We attempted to buy park tickets when they went on sale but our American CC's kept getting denied so we just waited. We couldn't put the paper tickets in our app until after we went through the main gate. This was the very first thing I did as we walked/jogged to our first ride. If you buy your ticket online I believe you can already have it on your app before you go through. \n* Bring a portable charger, you will be using your phone ALOT to check ride times, use the map for food and showtimes, and if you guy Premier Access passes. \n* We live in Southern California and are originally from Florida so we have been to Disneyland many times. That helped in regards to not having to ride everything in that park so the advice there may not be as helpful. The cost of a ticket was also significantly cheaper than in the states so we didn't mind paying for Premier Access for rides to get fast pass.\n* Everyone dresses VERY cute in the parks. Lots of groups wearing the exact same thing. Something I noticed was that very short skirts were ok but sleeveless was very rare. I wore a sweater to Disneyland and took it off midday because it was warm. Having my arms exposed felt strange because no one else was dressed like that. My chest was not out at all but I still kept the sweater over my shoulders to not feel inappropriate lol. \n* Monorail costs money, which was surprising to us. Florida monorail goes between 4 different parks and is free! We used our Suica cards for it but it was an unexpected expense. I believe they have day passes at the machines you can get. Figure out what works best for you!\n* Hotel: We stayed at the Tokyo DisneySea Miracosta. It's one of the most expensive Disney properties in the world and the only hotel that is inside a Disney park. It was an incredible hotel and a once in a lifetime stay. Of course not all travelers can afford that (we'll be paying it off for a while lol) but I do recommend staying at any Disney hotel if you can so you can get Happy Entrance! Set your alarm to book a hotel right when they are released, 3 months before your date of stay at 11AM Japan time, and do the research to know what hotel you want to stay in and even what kind of room you want, they went FAST.\n\nDay 1, Tuesday:  Disneyland. Happy Entrance ticket gets you in 15 min before opening time that day. \n\n*  Arrived at entrance around 7:50am for 8:15 opening with Happy Entrance. The park opened at 8:30 for rest of public. We thought we would get there a little earlier but we didn't account for time going through security. There was already a huge crowd of people! The Happy Entrance definitely had a smaller crowd in front of the gates. We were prepared for crowds since it was a peak time but it was never as bad as we thought it would be though. \n* Rope drop. Straight to Beauty and the Beast, while opening our app to get our first Premier Access pass: Baymax. Line for B&amp;B was probably 35 min even though we were the first ones in the park! The ride was incredible! Belle is my princess so I may be bias but my husband was impressed with the ride mechanics and animatronics. Highly recommend Premier Access for this ride if you do not do it first in the day, the line was very long the rest of the day. \n* Breakfast at pizza parlor while waiting for Baymax time. We failed by not eating breakfast before going into the park (we finally \"slept in\") or having our trusty conbini snacks with us. This didn't set us back too much as we had to wait for our Baymax time so we had 20 min to kill. \n* Baymax ride with fast pass\n* Gaston's Tavern for beer and hot wine and to walk around Belle's village and take it in more. We ran to the ride so we didn't get the chance to actually look around. \n* Toon town for Minnie's fashion studio and to meet her - 25 min line: While in line we attempted to get Entry Requests for all the shows available and character meetings but we were denied all of them. Not really sure how it decides that. Try to do the Entry Request anyways, it is free. \n* It's a Small World - 20 min line: Kid's pick. Same as in the states but in Japanese and there are way more Disney characters incorporated in the different countries. \n* Haunted Mansion - 35 min line: Same as in the states but its my husbands favorite ride. \n* I kept checking Premiere Access to see when Splash Mountain would have a good time for us as we wanted to wait for the heat of the day. Still was too early. \n* Lunch at Hungry Bear, by Thunder Mountain: Curry and rice which was SO good! My kid really enjoyed it as well and the kids plate was shaped like Mickey. \n* Thunder Mountain - 65 min line: this was the longest line we stood in all day but it is my daughters favorite ride. Got Premiere Access for Splash Mountain while waiting, it warmed up in that uncovered line!\n* Splash Mountain with fast pass\n* Pictures in front of the castle! We had been so go go go that we kept joking we hadn't even seen the castle yet. So beautiful! This would probably be a good time to do any other Fantasyland rides you want to if you don't need to do a photoshoot like we did lol. \n* Popcorn buckets at The Big Pop - 10 min line: When we walked by this place earlier it had probably a 30 min line so I'm glad we waited. Popcorn is no joke at the Disney parks there!\n* Shopping on Main Street: Merchandise was cute but not as varied as we thought it might be. I personally thought I would spend much more on merchandise but the clothes wasn't as cute. I bought some ears that are Tokyo exclusive, the Boo headband from Monsters Inc and almost bought a Baymax head since he is not as popular in the states and everyone was wearing those helmet stuffys, thats what we called them, they were so cute but impractical for the hot weather we get back home. Do people wear them in the summer?? **Tip**: We are VERY glad we did our shopping earlier in the day (5pmish) because when we were leaving the park the lines were crazy long just to get in to the stores. \n* Monsters Inc ride - 40 min line\n* Walked around Adventureland. Pirates and Swiss Family treehouse were closed and we didn't need to ride Jungle Cruise or do Tiki Room so it was nice just to look around the land at dusk. \n* Dinner at China Voyager in Adventureland - 30 min line: Longest we had to wait for food. Yummy ramen that warmed our souls lol. With Mickey shaped yolk in soft boiled eggs, how do they do that?! Gyoza was good for the kid too, she devoured it. \n* At this point (6:30) we thought we should go find a spot for the parade (7pm) because people had been posting up for hours before! We found a spot behind a group of people and then we got some magic from a Cast Member that told us there was a better place to sit! He walked us over to the right of in front of the castle and we got a lovely spot sitting down. I didn't realize that people stay seated in that area and I LOVED that because we didn't have to worry about our daughter not being able to see the parade, which is what usually happens in the states. The floats were incredible, 10x better than back home and we miss the Electrical Parade that used to be in CA, so it was awesome. Tokyo really knows how to do theming and design well!\n* As soon as the parade ended we ran to the castle to go inside and see Cinderella's throne room. There was no wait and it was empty inside so easy to get pictures. Definitely pick something you want to do and \"run\" there right when the parade ends because it will most likely be empty!\n* Day over for us! We were exhausted by this point but maybe could have squeezed in another ride?\n\nPremier Access rides in Disneyland:\n\n* Beauty and the Beast\n* Baymax\n* Splash Mountain\n* Electrical Parade\n\nDay 2, Wednesday: DisneySea\n\n* Rope Drop at 8:15. We got there at 7:30am and were first people in line. Spent the wait eating our conbini breakfast snacks that we got in our hotel lobby the night before, we were better prepared today. \n* Straight to Journey to the center of the Earth. 2nd people in line. Amazing ride! Got Premier Access for Tower of Terror while walking there.\n* It seemed EVERYONE went straight to Soaring at rope drop, I later learned this is the more popular ride, we have it in the states so we weren't as concerned in riding it until we learned the theming is totally different there. I would probably rec going to Soaring at rope drop cause PA is more expensive for it than Journey.\n* Took our time walking over to Tower of Terror since we had time before fast pass, the park was kind of dead still and some rides weren't even open yet, it was cool to see it like that. Had a churro and sausage on a bonestick? At 9am dining reservations open for the day so I made reservations for Teddy Roosevelt Lounge. If you want to do any restaurants, make sure you are ready at the time to reserve!\n* Tower of Terror fast pass: Theming was totally different and very cool. The ride itself was&gt;! not very thrilling. My husband and I looked at each other in shock when it was over, there were 2 very small drops and that was about it. Our kid loved it! It's one of our favorite rides at Disney parks so it was just kind of disappointing !&lt;Regardless the theme was very cool but there was no merchandise at the store for the ride! We totally would have bought the cursed idol little dude lol\n* Character meeting with ShellieMay - 15 min line: We were very excited for Duffy stuff. Soaring Premiere Access while waiting in line here.\n* Duffy shopping: My daughter saw everyone walking around with their Duffy stuffys and ears and couldn't continue with the day until she had hers lol. It was a shame LinaBelle ears were sold out but we bought Duffy and ShellieMay ears and a LinaBelle stuffy. They've got to bring these characters to the states! So cute!\n* Gyoza dogs, tiramisu ice cream bar and Mickey ice pop snack time while waiting for Soaring time. The snacks and popcorn are so unique at the parks. We didn't really have a sitdown meal because we just kept snacking. \n* Soaring! fast pass: Again, amazing theming!! Really glad we rode this even though we weren't going to. I loved the theme and queue aesthetics. Soaring is a fun ride too as usual and&gt;! I liked that it had Tokyo at the end so it was a little different. !&lt;\n* Mermaid lagoon! Going \"under the sea\" to Ariel's Kingdom was SO COOL! I didn't even know that they had her grotto and that was just so cool as an 80's/90's Disney kid to see in person. My daughter played in the playground there for a while and didn't really want to ride anything there, we would have had time for 1 ride I imagine.\n* Walked through Agrabah Marketplace got a tiger tail snack.\n* Sindbad's Adventure - 5 min line: I love this ride! It's \"small world\" style, boat on the water, relaxing ride and I couldn't get the song out of my head even though I didn't know the lyrics. I was obnoxiously singing it the rest of the day. Wish I could find this song on Spotify lol\n* Big Bad Beat Show - The only thing I got Entry Request for in the park. We were denied everything else. Husband took a nap, kid rested her feet and I got some broadway tunes so it was a win win!\n* Lunch at Dockside Diner - I believe it was just some fried chicken, nothing wild.\n* Drinks at Teddy Roosevelt Lounge aboard the SS Columbia. Very lovely aesthetics but in the end it was just overpriced drinks that were too sweet. Got a dessert for the kid. \n* Jamboree with Mickey Show: I promised kid we would see this show. We couldnt get entry request for it so we just had to stand to the side. It was pretty cute learning a dance with a crowd of people and then doing it with the characters. \n* Aquatopia - 25 min line: We thought it was funny since we have AUTOtopia back home. This was way better than that lol\n* After the ride we went back to our hotel to get our puffer jackets and put down some merchandise. A theme park on the ocean gets windy and cold! We also had dinner at the hotel since we were there already and didn't want to waste time in the park. \n* Indiana Jones: Husband did single rider line for this at the same time that me and daughter did\n* Jasmine's Carpet Ride - 25 min line\n* We met back up at a spot to watch Believe! We didn't get a Premiere Access for this but found a really good spot at the end of the Ponte Vecchio bridge on the ramps that lead down to the water. [https://www.reddit.com/r/TokyoDisneySea/comments/121kwgy/believe\\_sea\\_of\\_dreams/jf5kqim/?context=3](https://www.reddit.com/r/TokyoDisneySea/comments/121kwgy/believe_sea_of_dreams/jf5kqim/?context=3) This comment helped us pick the spot. We were under the 3 on the image posted. \n* The show was so good!! Tokyo Disney really knows how to put on a show, we were so impressed. We rarely stick around for shows anymore when we go to parks and I'm so glad we did. \n* Nemo and Friends - 15 min line: We \"ran\" there when the show ended like the day before, and were so glad to not have to wait long because the line for this was kind of long all day but we really wanted to do it. It ended up being my kid's favorite ride of the day!\n* Day over! We were going to shop but the queues just to get into the store were ridiculous. We should have taken our advice from the day before! Shop early!\n\nPremier Access Rides at Tokyo Disney:\n\n* Journey to the center of the Earth\n* Toy Story Mania, we skipped this ride as we have it back home.\n* Tower of Terror \n* Soaring!\n\nDisneySea probably needs 2 days if you really want to experience everything. It's so beautiful and there is so much to see! Stimulation overload! My husband would have liked to ride Raging Spirits but didnt discover it until too late in the day. We never even walked into the Toy Story area which is a bummer, it just got away from us. We still think we did really good for 1 day during peak season!\n\nThe morning that we left we went to Ikspiari, which is Downtown Disney if you are familiar, and did some shopping at the store there but they didn't have any actual Parks merchandise, just cute Disney stuff. I was hoping to get a Starbucks Tokyo Disney mug but I guess they don't make those in the Been There series! Another merchandise disappointment but in the end our wallets thanked us lol. Hope this write up helps someone! I'm sure there are things I forgot, feel free to ask!",
    "comments": [
        {
            "level": 0,
            "comment": "If you stay at a Disneyland hotel, they give you passes for the monorail or resort line for the length of your stay.",
            "score": 11,
            "author": "speakwithcode",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think they stopped providing complimentary passes for hotel guests.",
                    "score": 9,
                    "author": "jumpman0128",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was just there in January/February so this change must be pretty recent then.\n\nEdit:\n\nLooks like they did stop providing them based on their FAQ.\n\nhttps://faq.tokyodisneyresort.jp/tdr/en/faq_detail.html?id=20678&amp;category=&amp;page=1",
                            "score": 7,
                            "author": "speakwithcode",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[https://faq.tokyodisneyresort.jp/tdr/en/faq\\_detail.html?id=20678&amp;category=&amp;page=1](https://faq.tokyodisneyresort.jp/tdr/en/faq_detail.html?id=20678&amp;category=&amp;page=1)\n\nDang....lucky you!",
                                    "score": 3,
                                    "author": "jumpman0128"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "WHAT?! How did no one tell us this?!",
                    "score": 3,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It looks like they changed it recently.  They're no longer giving out complimentary passes.  I stayed at both the Disneyland Hotel and MiraCosta Hotel.  They both gave us 3-day and 2-day passes for our stay, but this was back in January/February.  It looks like they updated their FAQ to indicate that there are no more complimentary passes.",
                            "score": 11,
                            "author": "speakwithcode",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We stayed at MiraCosta at the end of March and picked up our free passes from the concierge/luggage drop off just outside Mahaima Station.",
                                    "score": 3,
                                    "author": "KinkyPolly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They stopped providing complimentary passes on April 1st, 2023.",
                                            "score": 3,
                                            "author": "JLikesStats",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's a bummer, man.",
                                                    "score": 2,
                                                    "author": "KinkyPolly"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Journey to the center of the earth ride was the craziest ride ive been on !",
            "score": 10,
            "author": "CareerAdviceThrowMe",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's the same ride system as Radiator Springs or Test Track but the theming (including the queue) is great.",
                    "score": 2,
                    "author": "Bobb_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I couldn't get the song out of my head even though I didn't know the lyrics.\n\nThere's a version with English lyrics\nhttps://www.youtube.com/watch?v=DmK2VlFHyWQ",
            "score": 7,
            "author": "Bobb_o",
            "replies": [
                {
                    "level": 1,
                    "comment": "O m g. I cannot wait to play this for my family later! A million thanks!",
                    "score": 5,
                    "author": "foodonmyplate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for your review! Which park do you reccomend for 2 adults with no kids?",
            "score": 3,
            "author": "SuccessfulRegister25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably DisneySea? Hard choice and they both serve alcohol lol, which was surprising to us as Disneyland in CA does not. DisneySea did seem more adult with the whole Italian and American area.",
                    "score": 18,
                    "author": "foodonmyplate"
                },
                {
                    "level": 1,
                    "comment": "100% DisneySea.",
                    "score": 6,
                    "author": "Bobb_o"
                },
                {
                    "level": 1,
                    "comment": "Definitely DisneySea.",
                    "score": 4,
                    "author": "SunflowerSamurai_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Guardians of the Galaxy ride had my throat sore from screaming and my entire body shaking with adrenaline - how does the Tower of Terror compare? I like the idea of its theming, but I almost puked after the GotG ride so I don't want to risk it if it's similar.",
            "score": 5,
            "author": "someone-who-is-cool",
            "replies": [
                {
                    "level": 1,
                    "comment": "It does not compare at all in thrills! We actually rode the Guardians ride a week later and couldn't believe the difference. Tower of terror is much, much more tame.",
                    "score": 3,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I went to Disneysea March 1st they were apparently doing an “extreme” special event where the drops were larger. I’m the biggest drop ride wimp even though I love intense rollercoasters and thought the extreme version was just about right for me, so I bet you won’t have any problems with the normal version",
                            "score": 1,
                            "author": "agentcarter234"
                        },
                        {
                            "level": 2,
                            "comment": "Out of experience I can say thats mostly the one in Japan though. Tower of Terror in Paris is much wilder.",
                            "score": 1,
                            "author": "pklokgieters"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not only is the ride tamer they have full shoulder seat belts like in a car.",
                    "score": 2,
                    "author": "Bobb_o"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Literally had the same reaction to tower of terror! Such a shame. They cancelled Believe and the fireworks too as it was a bit windy. Other than that though, loved the overall experience of Disney Sea!",
            "score": 4,
            "author": "Krus93"
        },
        {
            "level": 0,
            "comment": "I was lucky and went in early march and Tower of Terror  was in \"Unlimited\" mode, I guess they run a different drop pattern and its double the drops, I think US towers do a random mode or special like this too. But Honestly Tower was the best, it was the only ride that the crowd was loud and excited like in the states. I had a blast on that ride and the dude next to me was worried I wasn't prepared he kept pointing to the rail so I would hold on.",
            "score": 3,
            "author": "cafemofo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha that sounds like a really good time!",
                    "score": 1,
                    "author": "foodonmyplate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm thinking about skipping Takayama so I can spend the extra days at DisneySea. I know I know, giving up a beautiful mountain resort for a theme park, but I do love Disney theme parks.",
            "score": 4,
            "author": "ZarthanFire"
        },
        {
            "level": 0,
            "comment": "Thank you so much for this write up! Going to Japan next year purely so I can experience Disney for the first time! (Also a HUGE Belle fan) Being in NZ, we don’t have a lot of experience with any parks so this was extremely helpful in planning out our Disney days",
            "score": 4,
            "author": "LittleBoo2121"
        },
        {
            "level": 0,
            "comment": "Just went last week to DisneySea and your review is spot on! I am also from So cal so I agree I was really surprised the tower of terror was so tame (the storyline also seemed racist) AND I regretted not wearing a t shirt under my sweater because I got soooo hot and didn’t feel comfortable with my tank top. I also felt very underdressed!\n\nRaging Spirits is equivalent to goofy ride at DCA back home. It was fun but only 35 seconds long or so! If the line was longer than 20 minutes it wouldn’t be worth it. \n\nI was shocked by how little the park is too! We saw everything and even rode things twice w/ premier pass so we ran out of things to do !! Lol",
            "score": 4,
            "author": "cancerrising77",
            "replies": [
                {
                    "level": 1,
                    "comment": "In your opinion was it less busy at night time after 5pm or just as crowded as in the day time ?",
                    "score": 1,
                    "author": "leofire97",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It got busier in the afternoon for sure!",
                            "score": 1,
                            "author": "cancerrising77"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "thanks a million for this information. In your opinion was it less busy at night time after 5pm or just as crowded in both parks? \n\nThanks for taking the time to help us :)",
            "score": 3,
            "author": "leofire97",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've been to TDR a few times, granted last time was during Japan's Covid Closure. Land felt emptier at night, in my opinion, since more families with kids go to that one. By 5pm a lot of the people with young kids leave. Land and Sea both offer twilight tickets tho that are good after like 6pm or whatever, so Sea never really felt \"emptier\" to me until right before close. Last time we were there, Land was quiet enough in the evening that we were able to ride Beauty and the Beast twice before the parade, but I doubt that would be doable now that the borders are open lol",
                    "score": 1,
                    "author": "hitoribocchan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome! Thank you so much for this write up!\r  \n\r  \nJust a quick question for you regarding loading the tickets onto the app, since we're staying at MiraCosta as well and will be purchasing tickets when we check in...\n\nYou mentioned that you had to wait until you got past the main gate to load your ticket onto the app. So you were already inside the park, walking/jogging to your first ride while trying to load the tickets onto the app?  Or were you able to load the ticket onto the app when you were waiting in the Happy 15 line? \n\nI was under the impression that you couldn't get into the park using paper tickets and that all tickets had to be on your phone/app. Thanks so much!",
            "score": 2,
            "author": "jumpman0128",
            "replies": [
                {
                    "level": 1,
                    "comment": "Once they scanned our paper tickets into the park at the gate, I took all our tickets and scanned them easily into the app. So yes, we were inside the park already, it would not let me scan them before we were in the park. Not sure if they are changing procedures but paper tickets were the only option when buying at the hotel.",
                    "score": 1,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "got it.  thanks again!  so helpful!",
                            "score": 1,
                            "author": "jumpman0128",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hope you have a great visit!!",
                                    "score": 1,
                                    "author": "foodonmyplate"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saving this! Is it true that it’s super crowded? How would you compare it to Disneyland crowds?",
            "score": 2,
            "author": "Cindita86",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I was there in 2018 it wasn't super crowded, just typical Disney park. The crowds are better though, people seem be more respectful and there's just cultural differences (sitting down for parades, no shoulder kids, less strollers, etc.) \n\nI will say that I think the TDR crowds are \"smarter\" than the American crowds about knowing which rides to hit and how to navigate the park.",
                    "score": 3,
                    "author": "Bobb_o",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes it seems like it! My Japanese host family on my last trip said they waited 3 hours for Toy Story when they went a couple years back! I couldn’t believe it. It could be because it had just opened",
                            "score": 1,
                            "author": "Cindita86",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Toy Story Mania is one of if not the most popular rides at DisneySea, I skipped it when I was there since I've done it plenty of times at WDW and DCA but a lot of the early crowd heads there. It seemed like the thrill rides weren't the big draw as we hit ToT during the Happpy15 and then went to Journey which also didn't have more than a 5-10 min wait. This was before Premier Access so things may have changed.",
                                    "score": 3,
                                    "author": "Bobb_o"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So helpful! Thank you!",
            "score": 2,
            "author": "danzie_"
        },
        {
            "level": 0,
            "comment": "Is Disneyland Sea it’s own thing? First I’m hearing about it",
            "score": 2,
            "author": "PieOhMyVengence",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea it’s a unique Disney theme park only in Japan! It’s not technically owned by Disney so there are some unique characters like Duffy.",
                    "score": 2,
                    "author": "wanderercouple",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Duffy was first introduced in America, though! It just didn't take off there like in the Asian parks. Also, Tokyo Disney is a partnership between Disney and the oriental land company!",
                            "score": 1,
                            "author": "Cleigh24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for correcting me! Didn’t know that backstory.",
                                    "score": 1,
                                    "author": "wanderercouple",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m a little obsessed with it 😅😅 I have a problem haha",
                                            "score": 1,
                                            "author": "Cleigh24"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oops also I just found out I am WRONG about the ownership! You are right, it’s completely the oriental land company!",
                                            "score": 1,
                                            "author": "Cleigh24"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Tokyo Disney monorail is infinitely superior to the one in Florida. Yes it cost, but it is minimal and the trains are newer and well maintained, unlike works in Florida, the monorail in Florida does not go to all the parks as you mentioned and it breaks down frequently",
            "score": 2,
            "author": "scyoung121",
            "replies": [
                {
                    "level": 1,
                    "comment": "You get what you pay for I guess! It's been over a decade since I've been to FL Disney so my memory must be escaping me, thanks for the correction.",
                    "score": 1,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s still a great resort don’t get me wrong, but those monorails in Florida were last replaced in the 90s.",
                            "score": 1,
                            "author": "scyoung121"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for this great in-depth review!",
            "score": 1,
            "author": "glasshearthymn"
        },
        {
            "level": 0,
            "comment": "Thank you for the review! What do you think - if you have been to the US parks (many times), do you think Disneyland is worth it? I’m wondering if we should skip it and do two days at DisneySea instead.",
            "score": 1,
            "author": "poly-wrath",
            "replies": [
                {
                    "level": 1,
                    "comment": "I personally can't imagine going all the way there and not seeing it at all (as a former Anaheim CM), but a compromise would be to do 1.5 days at DisneySea and get the weeknight pass to enter Land on one of the evenings. For about $35 you can enter the park from 5-9pm. To me that sounds like a bargain. It's cheaper than adding park hopper in the states.",
                    "score": 9,
                    "author": "whattodoie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a great idea! Thanks!",
                            "score": 1,
                            "author": "poly-wrath"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm tempted to say do 2 days at DisneySea! The beauty and the beast ride was awesome though. They don't have anything like that, and in general the park was more beautiful than in the states. It was also cool to be able to go in the castle. Buuuut it would have been really nice to do DisneySea not as rushed.",
                    "score": 4,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s fair! We’ll probably end up doing both of them — I have a kid who is a big Beauty and the Beast fan, so she’ll love that ride.",
                            "score": 2,
                            "author": "poly-wrath",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would stay at the Ambassador Hotel since it gives you early entry into both parks.  A good majority of people who get early entry into the park rushes to the Beauty and the Beast ride.  I was there alongside them rushing to the ride. On less busy days, the wait time can get up to 2 hours.",
                                    "score": 1,
                                    "author": "speakwithcode"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Disneyland is still totally worth it for beauty and the beast, monsters inc, and Pooh imo!",
                    "score": 1,
                    "author": "Cleigh24"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you so much for so many great details,   doing both the parks are on my list so you really helped me see how many days I need etc...",
            "score": 1,
            "author": "alanamil"
        },
        {
            "level": 0,
            "comment": "&gt;Took our time walking over to Tower of Terror since we had time before fast pass, the park was kind of dead still and some rides weren't even open yet, it was cool to see it like that. Had a churro and sausage on a bonestick? At 9am dining reservations open for the day so I made reservations for Teddy Roosevelt Lounge. If you want to do any restaurants, make sure you are ready at the time to reserve!\n\nSo reservations can be made in the park rather than in the US where we would have to reserve MONTHS in advance?",
            "score": 1,
            "author": "Twofu_",
            "replies": [
                {
                    "level": 1,
                    "comment": "They have both. You can book stuff from one month before at 10am until the night before your visit. Then they have limited openings for day of at 9am. We took our chances with that since it was filled up the other way when we checked. At 9 am it looked like all restaurants had availability. They were gone as soon as I finished making 1 reservation. I was hoping to make 2. I wish they had that system in the US! We never get reservations there!",
                    "score": 3,
                    "author": "foodonmyplate"
                },
                {
                    "level": 1,
                    "comment": "they open up a limited amount of same day reservations for restaurants at 9am for those that could not get reservations a few months back",
                    "score": 2,
                    "author": "jumpman0128",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay, good to take note of. Thank you!",
                            "score": 1,
                            "author": "Twofu_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "FYI - I just booked dining reservations for a month out (they release at 10am local time 30 days in advance). The very best ones go immediately (within a minute) and it seems like the site often breaks when they are released. Most of the rest are gone within 5 mins.\n\nSo...pretty much exactly like the US.",
                    "score": 2,
                    "author": "fysu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just to be sure 10am JST?",
                            "score": 1,
                            "author": "Twofu_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep! 6p PT / 9p ET. You want to have your search box all filled out and then right on the dot (use a world clock), hit search. I tried doing it 5 seconds early and it didn't work. Also make sure you are already logged in to your Disney account. And remember, you might get your time selection but when you go to enter your info the page will crash. Immediately go back and research (don't waste time fretting, it's a lost cause). I'd also recommend having someone else in your party trying on another computer.\n\nThe hottest restaurant is Magellan's, that's the one that will go in seconds. You have a few extra minutes for the others (assuming you are booking for a weekday). And better odds if you have a smaller party size.",
                                    "score": 3,
                                    "author": "fysu"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, everything would be their local time.  I was up late my US time checking hotel rooms and dining reservations.  Hotels are harder to get than dining reservations.  Once you have a hotel, dining reservations are so easy to do.",
                                    "score": 1,
                                    "author": "speakwithcode"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for write up… how much time does premier access save? Sorry not much experience with going to Disney parks being an Australian!",
            "score": 1,
            "author": "dlcx99",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh you save so much time! The Soaring line was probably 90 minutes, Tower of terror was 75, even Baymax was 45 min. We skipped all those lines and walked straight to the front.",
                    "score": 4,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cool thanks - looks like it’s not cheap to do but maybe I’ll just need to suck it up for sake of saving time, it’s not every day you end up at Disneyland",
                            "score": 3,
                            "author": "dlcx99"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for the tip about shopping! I would have waited until the end of the day so since I don't want to carry everything around with me I will probably need to plan to store my purchases in a locker.",
            "score": 1,
            "author": "whattodoie"
        },
        {
            "level": 0,
            "comment": "Really helpful thanks for this breakdown!",
            "score": 1,
            "author": "rikomatic"
        },
        {
            "level": 0,
            "comment": "Where did you meet ShellieMay at? She’s my actual favorite, and a HUGE priority for me to do when I go!!! Thank you so much 🫶🫶🫶",
            "score": 1,
            "author": "totorobree",
            "replies": [
                {
                    "level": 1,
                    "comment": "RIGHT in front of Tower of terror there is a fountain, she was there on and off all day!",
                    "score": 2,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omggg thank you so much!!!! Does it say anything on the app about her appearing? I don’t want to miss her!!!!",
                            "score": 1,
                            "author": "totorobree"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We are Disneyworld locals but we don’t have premier access here.  Is this just basically to go in the shorter line, and you pay per ride to do the premier access??  And do you still get the free fast passes or do you pay for those too?\n(Eta- is fast pass different than premier access?  I’m assuming it’s like the old system in Florida where you get a fast pass with your ticket?)\n\nAlso, what do I need to do in advance.  Sounds like you got your tickets and then would be good to get dinner reservations, but all the fast passes and premier access stuff, that is all same day??\n\nSorry for the stupid questions!!",
            "score": 1,
            "author": "kiloparesis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah I'm sorry, I used the word fast pass and premier access interchangeably. Premier Access is the only thing they have and it's only for the rides I listed. It is LIKE fast pass in the fact that you skip the line. There is no other way to do a shorter line. You have to pay for it and you can't reserve/pay for a time unless you are in the park. \nGetting tickets and reserving dining is about the only thing you can do early. And bring a cute outfit! Both my husband and I got compliments on our spirit jerseys because they are not a thing over there :-)",
                    "score": 3,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol!  Ok cute outfit, I’m on it 😂 Thanks for clarifying, that makes way more sense now.",
                            "score": 1,
                            "author": "kiloparesis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What’s premier access rides? Is that like fast pass?",
            "score": 1,
            "author": "Raddpixie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, but it cost between 1.500 and 2.000 per ride.",
                    "score": 2,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 1,
                            "author": "Raddpixie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yay thanks for the review!! I always love reading about people's experiences at Tokyo Disney. 🥰",
            "score": 1,
            "author": "Cleigh24"
        },
        {
            "level": 0,
            "comment": "Did you go consecutive days? I was thinking of doing disneyland and sea 2 days in a row and staying at one of their hotels but worry about how exhausted we would be.",
            "score": 1,
            "author": "Purple-Dust1769",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah we did consecutive and it's definitely exhausting but, it's the only way we would have done it so we could do both parks.",
                    "score": 1,
                    "author": "foodonmyplate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the great information! I'm headed there in 3 weeks and have nearly the same plan.\n\nHow did luggage and hotel check in go? Did you drop all your bags at Miracosta before heading to the castle park line?",
            "score": 1,
            "author": "Lichtwald",
            "replies": [
                {
                    "level": 1,
                    "comment": "We checked in the night before. You could easily just leave your luggage there though. We saw people doing that on our way out in the morning",
                    "score": 2,
                    "author": "foodonmyplate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome.  Good to know! Thanks!",
                            "score": 1,
                            "author": "Lichtwald"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is such a detailed and helpful report!\n\n- what rides at Tokyo Disneyland were superior to CA Disneyland, in your opinion? We will only have 5-9pm there so want to hit 1-2 rides.\n- super tactical, but how long did it take you to walk from your room to the happy mornings entrance? What kind of room did you get and did you think it mattered? I want to stay at the Miracosta but it looks hard to get a Harbor view room.",
            "score": 1,
            "author": "CupcakeExternal8582"
        },
        {
            "level": 0,
            "comment": "Thanks for all the info! We’re planning a trip with our (will be) 18 month old in October. Which park do you think would be best suited for families with toddlers?",
            "score": 1,
            "author": "Buttercup_047",
            "replies": [
                {
                    "level": 1,
                    "comment": "Disneyland for sure! More rides for little ones. I have 18-month-old twins (that didn't go on this trip), we took them to California Disneyland last week and they loved all the Fantasyland rides!",
                    "score": 1,
                    "author": "foodonmyplate"
                }
            ]
        }
    ]
}