{
    "id": "12z1blr",
    "score": 13,
    "title": "Tax free process upon departure",
    "author": "Bound4Tahoe",
    "date": 1682469458.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12z1blr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Update: made it through just as others described…I carried what I could in my backpack in case they asked to inspect, but knives were checked.  After security, go to customs and immigration, scanned passport, got the happy Mt Fuji picture and moved onto immigration.  My tax free purchases were under $2000 USD.  Not sure if other procedures apply for higher amounts.\n\nOriginal post:\n\nI have read a number of conflicting things about the tax free process upon departure, including one note that says the process changed on April 1, 2023.  We purchased some jewelry at tax free stores, they simply didn’t charge the tax on the transaction and we don’t have any special forms or documentation inside our passports.  I don’t know what would trigger any additional process at the airport, but I want to be sure we don’t have a problem after we have checked our bags.  Any recent experiences that required you to do something at the airport?",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Its attached to your passport electronically. When leaving you scan it and if theres an issue you have to go to an actual person. We just got back and had a bunch of stuff tax free and 0 issues. Didn’t have to show proof or anything.",
            "score": 6,
            "author": "Weak-Mathematician91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep same for us when we flew back last weekend. (Needed to check liquids and were concerned about needing to show at customs but were told it wouldn't be an issue)",
                    "score": 3,
                    "author": "Auroraslight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes that’s my concern.  We also have knives which have to be in checked bags so was worried if they ask to see them and the bags are already checked…one thin I read said the you can call customs to the check in counter when checking in, which sounds like a huge hassle and delay for people behind us.  Odd they aren’t able to articulate the process a bit more clearly.",
                            "score": 2,
                            "author": "Bound4Tahoe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I came back on April 8th and my experience was the same as u/Weak-Mathematician91 described, AND I had a knife in my bag. We got the knife tax-free too so it would have been linked to my passport. Nobody cared. I scanned my passport as mentioned above, and the sign near the scanner showed that there were two possibilities that could come up once successfully scanned. Mine was a picture of Mount Fuji and a thank you, which meant I just proceeded through security like everybody else.\n\nSo other than scanning my passport as I passed by, I literally did nothing else and there were no problems.\n\nETA:  I kept all my receipts handy, with my tax-free purchase receipts separate for just in case. I didn't need any of them, but probably not a bad idea to be prepared.",
                                    "score": 4,
                                    "author": "Lady-Zsa-Zsa"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For tax free the rules are pretty simple.  There are two designations for tax free:  general goods and consumable goods.\n\nIf when you use the item it depletes and runs out at some point then it is a consumable good.  IE, food, shampoo, perfume, lotions, powders, etc..  These items have to remain sealed while in Japan and can only be used after leaving the country.  If you plan on using them before leaving Japan then you should pay the tax on them.\n\nGeneral goods:  purchases of a value of 5,000 yen or more are eligible for tax-free status if they are purchased at a location that is enrolled in the tax-free program.  When this happens the location will take your passport info and the purchase will be associated with your passport (unless the location is 'old school' and gives you a lengthy paper receipt.)    General goods have to leave Japan with you.  That's it.  In theory these goods are supposed to be 'gifts' - but I suppose you can purchase gifts for yourself.\n\nThe uncertainty comes down to a manual customs check at points of departure.  If you do not have the goods with you at customs then customs can (probably will) charge you the tax for those items at that time.  However, if customs thinks that you resold your stuff inside of Japan then they can levy a fine or even jail time.\n\nThat's why people say that the goods should be with you when you leave (in your carry-on.)  If the items are in your checked luggage then, in theory, customs can have the luggage retrieved but the reality is that they are more likely to simply charge you the tax on them and move on.  Retrieving luggage from an international plane that's already been loaded or in the process of being loaded is not a trivial act.  That could cause a significant delay to the flight.\n\nThe process at the airport is that you are supposed to scan your passport at the customs desk (some people straight up miss this step when leaving since it's after security but you aren't funneled into a line going to it) and the reader will either show a 'thank you' or 'see customs' type message.  I'm paraphrasing the message.  If you get the 'see customs' response then you are being selected to talk to a customs official who may request physical verification of your tax-free goods to ensure that they are leaving the country.\n\nYou can read about the tax-free thing here at the official japan government site:\n\n[https://www.nta.go.jp/publication/pamph/shohi/menzei/201805/pdf/explanation\\_eng.pdf](https://www.nta.go.jp/publication/pamph/shohi/menzei/201805/pdf/explanation_eng.pdf)\n\nand\n\n[https://www.customs.go.jp/english/c-answer\\_e/extsukan/5004\\_e.htm](https://www.customs.go.jp/english/c-answer_e/extsukan/5004_e.htm)",
            "score": 3,
            "author": "whiran",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, it’s the worry of having things in my checked bags that have already gone to the the plane and then customs (post security) demanding to see them.  Like knives.  And other things I would prefer to have in my checked bag.",
                    "score": 1,
                    "author": "Bound4Tahoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If that happens then you can explain it to the customs official that the goods are in the checked luggage.  I'm pretty sure that happens all of the time.  I wonder if you could take a picture of the items in your checked luggage before you head to the airport.  I have no idea if that'd help in that situation though.  It would be date and time stamped so... maybe?\n\nAt that point, it'll be a matter of how they are feeling, probably the overall value of the goods (is it worth the effort to charge the tax,) and whatever standard operating procedure they have to follow.\n\nThe possible outcomes:\n\n* You are let through without paying\n* You are asked to pay the taxes on the missing items which you do at the airport itself (I believe it is a separate counter though.)\n* They call for the checked luggage to be brought over to be inspected\n\nAt the end of the day, it's not a big deal.  The likelihood of being selected for manual inspection seems to be extremely low.  Even if you are selected for a secondary inspection the customs official might not request visual confirmation of the goods.  That's an \"as necessary\" designation sooo...\n\nI suspect that there is a threshold of value in play as well.",
                            "score": 2,
                            "author": "whiran"
                        },
                        {
                            "level": 2,
                            "comment": "I have a job where I can’t afford to have these kind of issues. So I went to the customs office before I checked my bag.  At Haneda it’s just behind the checkin desks before security.  They took my passport for a few minutes and then said I was ok.",
                            "score": 2,
                            "author": "WulfyGeo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did the process yesterday. You will need to scan your passport on a machine after the security control (or at least this is like it was at Narita).\n\nAt least for us it let us go automatically.",
            "score": 2,
            "author": "kami_sama",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here, left via Narita yesterday. Had most of the tax free goods in my carry-on luggage for possible inspection, the rest in checked baggage due to airline-imposed weight limits for carry-on bags. Went to the customs counter after security, the customs officer scanned my passport and asked whether I am exporting all the goods I bought tax-free. After answering 'yes' I got my passport back and could continue leaving the country without opening my luggage.",
                    "score": 1,
                    "author": "seven_rock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I couldn't do that, considering I bought a knife and it has to go into the checked luggage.",
                            "score": 1,
                            "author": "kami_sama"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We left Osaka yesterday - checked all of our tax free things but I kept my receipts in my carry on just in case. All I had to do was scan my passport, nothing else. I explicitly asked at my airline check in if I needed to do carry on and they said no",
            "score": 1,
            "author": "mvzzy"
        },
        {
            "level": 0,
            "comment": "You are technically not supposed to put it in checked luggage, bring it in carry on. They did scan your passport at the store, so custom wouldn’t know you have purchased it. True, knife or liquid need to be checked, so technically if they decide to inspect you, you would have to explain and maybe they would pull your luggage for inspection. Does it happen often? No. Could it happen… possibly. Who knows.",
            "score": 1,
            "author": "gdore15"
        },
        {
            "level": 0,
            "comment": "Traveled through Haneda this morning, had tonnes of stuff from Don in my check in and no checks whatsoever  just breezed through",
            "score": 1,
            "author": "Difficult-Designer25"
        },
        {
            "level": 0,
            "comment": "Thank you for the post! \nI mistakenly purchased household goods (toilet paper, paper towels, hair straightener etc) tax free when I purchased gifts to take home. The items are sealed in the same bags. I need to use the household goods for my stay. Will opening the bag get me in any trouble?\nThank you!",
            "score": 1,
            "author": "escobedonj"
        }
    ]
}