{
    "id": "12zt5gw",
    "score": 3,
    "title": "Itinerary Check - New Year's 2024 (20 nights)",
    "author": "karmability",
    "date": 1682534020.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/12zt5gw",
    "media_urls": [],
    "other_urls": [],
    "postText": "In the process of planning our second trip to Japan and need a sanity check about our travel plans during the New Year's period of 2024. I'm aware that it is an intense week of travel for local citizens and want to minimize the travel crush as much as possible.\n\nTentative current plans:\n\n22-Dec (Fri) - Arrive in Tokyo NRT via LAX  \n23-Dec (Sat) - Tokyo - take it easy, acclimate to jetlag  \n24-Dec (Sun) - Tokyo - Ghibli Museum  \n25-Dec (Mon) - Tokyo - Ghibli Museum (back-up day)  \n26-Dec (Tue) - Tokyo - Disneyland  \n27-Dec (Wed) - Tokyo - DisneySea  \n28-Dec (Thu) - Tokyo &gt; Nagoya  \n29-Dec (Fri) - Nagoya - Ghibli Park &gt; Kyoto  \n30-Dec (Sat) - Kyoto  \n31-Dec (Sun) - Kyoto  \n1-Jan (Mon) - Kyoto - Nara day-trip  \n2-Jan (Tue) - Kyoto &gt; Kanazawa  \n3-Jan (Wed) - Kanazawa - Shirakawago day-trip  \n4-Jan (Thu) - Kanazawa &gt; Osaka  \n5-Jan (Fri) - Osaka - Himeji day-trip or relaxing in Osaka  \n6-Jan (Sat) - Osaka &gt; Hiroshima  \n7-Jan (Sun) - Miyajima &gt; Tokyo  \n8-11-Jan - Tokyo (eating, shopping, possible side-trips to Kamakura, Yokohama)  \n12-Jan (Fri) - Departure  \n\n\nWe last visited in 2018. We primarily stuck to the golden route during that visit, so we're looking to do more of the smaller cities this time around.\n\nOur plans are pretty firm for the first and last week, but I've some concerns regarding the middle week that includes New Year's. We'll be two families traveling together with two children who do not enjoy being in large crowds in confined spaces, so we want to minimize running into the crush on the trains as much as we reasonably can. We will be trying to get reserved green car seating whenever we're able.\n\nQuestions/concerns:\n\n* Will the shinkansen from Nagoya &gt; Kyoto in the evening of 29-Dec (Fri) already be packed, or will most citizens be traveling that Sat instead? \n* From what I've read, traveling from Kyoto &gt; Kanazawa on 2-Jan should be against the majority flow of traffic. Is that correct?\n* Will Shirakawago be mostly back to normal by 3-Jan?\n* Will Ghibli Park likely be open on 29-Dec (Fri)?\n\nAn alternative we're considering is to do Kanazawa before Kyoto. We prefer the above itinerary, but if the following will mean running into a lot less traffic, we'll do it.\n\n29-Dec (Fri) - Nagoya - Ghibli Park &gt; Kanazawa  \n30-Dec (Sat) - Kanazawa - Shirakawago day-trip  \n31-Dec (Sun) - Kanazawa &gt; Kyoto  \n1-Jan (Mon) - Kyoto - Nara day-trip  \n2-Jan (Tue) - Kyoto   \n3-Jan (Wed) - Kyoto  \n4-Jan (Thu) - Kyoto &gt; Osaka\n\nThanks in advance for any help!",
    "comments": [
        {
            "level": 0,
            "comment": "So, for New Year, the holiday rush usually runs from 12/29 to 1/3. Both the trains going down to Kyoto and the trains going up to Tokyo can get pretty busy during this period. In addition to that, lots of Japanese like to visit shrines during the New Year, which means any shrine, or even local trains,  will be super crowded between 1/1 and 1/3, especially in Kyoto.   \nIf I were traveling as a big group, I would go to Nagoya-&gt; Kyoto/Nara-&gt; Hiroshima-&gt; Osaka -&gt; Kanazawa -&gt; Tokyo to avoid the crowds in Kyoto during the New Year. Kanazawa is much less crowded than the other cities.   \nNo official announcement for the schedule yet, but Ghibli Park was closed on 12/29 last year.",
            "score": 3,
            "author": "fushigitubo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the suggestion. I like the idea of essentially starting out West and making our way back to Tokyo.\n\nWould this revised itinerary better avoid the overcrowding?\n\n24 - Tokyo &gt; Nagoya  \n25 - Ghibli Park &gt; Osaka  \n26 - Osaka - Himeji day-trip  \n27 - Osaka - Nara day-trip  \n28 - Osaka &gt; Hiroshima  \n29 - Miyajima &gt; Kyoto  \n30 - Kyoto  \n31 - Kyoto  \n1 - Kyoto &gt; Kanazawa  \n2 - Kanazawa - Shirakawago day-trip  \n3 - Kanazawa &gt; Tokyo  \n4-11 - Tokyo (Disney, Ghibli Museum, Kamakura, etc)  \n\n\nI feel like our decision is to spend New Year's in either Kyoto or Osaka. We're using Osaka as a base for day-trips in the region and dining in the evenings. Given the likely closures during that period, I'm thinking we'd be better served to be in Kyoto where most attractions should still be open (though crowded). We'd hate to be in Osaka during a time when most restaurants are closed and day trips would be difficult due to crowds. Does that make sense? \n\nWas Ghibli Park open this past Christmas?",
                    "score": 1,
                    "author": "karmability",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see your point. While restaurants typically remain open throughout Japan during the end of the year, taking a train for a day trip around that time can be inconvenient. So, your plan makes sense. If you don't mind the crowds, there are many special events that take place around New Year's, such as lit-up temples and temple bell ringing (bell ringing is only on 12/31). Staying in Kyoto should be pretty interesting.\n\nHowever, I highly recommend reserving seats for the Thunderbird on 1/1 and the Shinkansen on 1/3 as soon as possible. You can make reservations starting at 10 am (JST) one month before the boarding date. Especially, the Shinkansen bound for Tokyo is expected to be super busy because 1/3 marks the end of the New Year's vacation for most Japanese people. Additionally, it's a good idea to make dinner reservations in advance.\n\nOne more thing: As I mentioned in response to your other post, the Omicho Market in Kanazawa will be closed from 1/1 to 1/5, while Kenroku-en will be open and free of charge. Ghibli Park was open last Christmas.",
                            "score": 2,
                            "author": "fushigitubo"
                        },
                        {
                            "level": 2,
                            "comment": "I think January 8th is a holiday. Would the plan be to do Disney after that weekend?\n\nI considered staying in Kanazawa another day to try and do Shirakawago on the 2nd but was concerned about the bus schedule over the holidays. I need to do some more digging about that, now that you bring it up.",
                            "score": 1,
                            "author": "kineticpotential001",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, it's Coming of Age day on the 8th. I'm not sure how big of a holiday that is, but we weren't planning to do anything in particular that day.\n\nWith the above itinerary, we'd do Disney on 1/4-5 and Ghibli Museum on the 6th. The other family traveling with us is leaving on the 7th so we need to squeeze those in before they depart.\n\nRe: Shirakawago bus -- they run on New Year's Day, so I figure the other days should be fine. I think I have a bookmark somewhere with the bus schedule that I'll share if I find it again.",
                                    "score": 1,
                                    "author": "karmability",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh yikes, gotcha on the Disney dates. That week looks to be pretty busy, historically. I'm trying to put off them parks until the second and third weeks in January in the hopes of smaller crowds (probably futile lol).\n\nI'd love the bus schedule if you come across it, when I was digging into it I thought there were issues with trying to reserve buses, but it may actually have been tours I was looking at and not just the buses.",
                                            "score": 1,
                                            "author": "kineticpotential001",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Both the bus and the tour operate on 1/2. \n\nBus schedule  \n[https://www.nouhibus.co.jp/highwaybus/kanazawa\\_en/](https://www.nouhibus.co.jp/highwaybus/kanazawa_en/)\n\nTour Schedule  \n[https://visitkanazawa.jp/en/activities/detail\\_281.html](https://visitkanazawa.jp/en/activities/detail_281.html)",
                                                    "score": 2,
                                                    "author": "fushigitubo"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, if we were traveling by ourselves, I would put Disney at the very end of the trip, after the holiday period is over. We can still do their night-time ticket that week if we feel like going back again.\n\nI can't find the actual schedule for that time of year, but I did find some threads that indicate that buses are operating during the New Year period. [thread1](https://www.tripadvisor.com/ShowTopic-g780847-i33587-k13046491-Shirakawa_go_on_New_Year_s_Day_1_Jan_2020-Shirakawa_Fukushima_Prefecture_Tohoku.html) [thread2](https://www.japan-guide.com/forum/quereadisplay.html?0+171633)\n\nYou can book the bus tickets [here](https://japanbusonline.com/en/CourseSearch/11900040002?afcd=MDI=&amp;RosenNm=shirakawago-kanazawa), but it looks like they only go 30 days out.",
                                                    "score": 2,
                                                    "author": "karmability"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll be following to see what advice you get as I will be there around the same time (arrive and depart a few days later). I'm only planning on one night in Kanazawa and would be doing Kanazawa&gt;Osaka on January 2nd (not ideal, but if we both stick with our current plans we could wave as we pass each other lol).",
            "score": 3,
            "author": "kineticpotential001",
            "replies": [
                {
                    "level": 1,
                    "comment": "Since we're traveling over the same period, just wanted to share an update that we've finalized our itinerary. (I find it helpful to see how others plan their trips as they can spark some ideas.)\n\n12/22-24: Tokyo (Ghibli Museum)12/25-27: Disney12/28: Hiroshima/Miyajima12/29-30: Osaka12/31-1/3: Kyoto (Nara, Himeji)1/4: Nagoya (Ghibli Park)1/5-6: Kanazawa (Shirakawago)1/7-12: Tokyo\n\nI wanted to remain in place over the bulk of New Year's, so I anchored the itinerary around staying in Kyoto during that period and everything else fell into place pretty nicely. I think our only concern is going from Hiroshima to Osaka on 12/29, but hopefully it won't be too bad since we're traveling East and it's on a Friday.\n\nI saw from your post history that we're both award travelers. 😄 We're gonna be doing Hyatts (HR Tokyo, HR Kyoto, Centric Ginza, Andaz Tokyo) and Hiltons (Tokyo Bay, Hiroshima, Nagoya, Conrad Osaka) for all of our stays. Flying SQ J out and Y back.\n\nFeel free to PM if you wanna chat more. Love travel planning. This'll be our second trip to Japan, and our first international trip since COVID (so we've got a ton of points to burn).",
                    "score": 2,
                    "author": "karmability",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for sharing, it is useful to see what others do. I may consider switching our bookings around, but trying to find availability new New Years is now much more challenging so I am not sure how much success I'll have.\n\nYes, reward bookings ftw! We are doing ANA F and J (I'll be trying to switch both to the same cabin if possible, but we are currently in adjacent rows so I'm not thinking it really matters) and I've got 11 nights split between GH Tokyo, PH Kyoto and Andaz Tokyo on points. I am working on the rest of our hotel bookings, but those will be cash stays. I dearly wish we had more points to burn!",
                            "score": 1,
                            "author": "kineticpotential001"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just wanted to let you know that Omicho Market is closed on 1/1 and 1/2 as well as the Ninja Temple and some museums. Kenroku-en is open and free of charge, though. I recommend checking the New Year’s schedule for places you want to visit.",
                    "score": 1,
                    "author": "fushigitubo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, the only goal of the brief visit is Kenroku-en to see the yukitsuri. I don't know why, but I am completely enchanted by them and would dearly love to see them in person. I figure if we arrive around lunchtime we should be able to visit either that afternoon or the next morning before we depart. Anything else we see or do would be a bonus, but there is no agenda other than the garden.",
                            "score": 1,
                            "author": "kineticpotential001",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, yukitsuri is absolutely gorgeous, even though it can be really cold there... if you’re interested, [Kanazawa Castle and its garden](https://visitkanazawa.jp/en/spot/detail_50335.html) will be illuminated for New Year. Kanazawa is also known for its great fish. If you enjoy seafood, even affordable kaiten-zushi restaurants such as [Morimori-sushi](https://tabelog.com/en/ishikawa/A1701/A170101/17000906/) offer high-quality sushi. I hope you have a great time there!",
                                    "score": 2,
                                    "author": "fushigitubo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Many thanks! The cold is something I should (hopefully) be prepared for, and I'll absolutely look into the illumination you mentioned. Really appreciate you sharing.",
                                            "score": 2,
                                            "author": "kineticpotential001"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}