{
    "id": "131xr7x",
    "score": 1,
    "title": "First Time Japan Trip Itinerary Check - 10 days",
    "author": "Raptor_Legend_Hakeem",
    "date": 1682695906.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/131xr7x",
    "media_urls": [],
    "other_urls": [],
    "postText": "Little last minute, but wanted to check and see if the itinerary for my upcoming trip starting May 3rd with my gf made sense / was feasible. We've got a general idea of where / what we want to go to everyday, but are open to better suggestions where needed. \n\n&amp;nbsp;\n\n\nSome background info: all of our accommodations are booked, we've got a 7 day JR Pass, and we're looking to huge crowds where possible (might not be feasible until after golden week). Not interested in the night scene too much as neither of us drink, looking for places with vegetarian/ low meat options as well when possible. Limited Japanese, willing to use Google translate where needed tho if English accommodations in certain areas are sparse\n\n&amp;nbsp;\n\nDay 1 (May 3rd): arrive in narita airport at ~8:30am. Hoping to get suica card and mobile wifi before 10, heading to hotel in minato city for check in. Likely will sleep after this as the timezone difference is 13 hours where we're from. Will either go to main garden, prince shiba park or shibuya in the afternoon and get lunch + supper.\n\n&amp;nbsp;\n\nDay 2 (May 4th) tokyo sea life park (free admission day), check out edogawa city, tokyo Disneyland/ Disney sea (not sure which one yet) in the evening.\n\n&amp;nbsp;\n\nDay 3 (May 5th): either a day trip to Mount Fuji or a day spent in / around shibuya and shinjuku. Mainly looking to see some parks and shrines if we don't go to Mount Fuji that day, or some fun relatively affordable city attraction recommendations. \n\n&amp;nbsp;\n\nDay 4 (May 6th): traveling to Kyoto (early morning / noon after we check out). Should be around 3 hours total from hotel to hotel, looking to get lunch near our hotel after checking in (Nakagyo ward). This is the tail end of golden week, would it be advisable to wait until it's over to check out some of the popular shrines/ the bamboo forest? Looking to fill the afternoon of this day, need to check out a few more destinations close to our hotel. Also, how easy is it to bring luggage on buses / non-shinkansen trains?\n\n&amp;nbsp;\n\nDay 5 (May 7th): philosphers path, nishi market (switching the order of these two might make sense as the market is closer to our hotel initially), imperial palace, kyoto botanical gardens. Might go to Nara instead of the last 2 as well, would that be a good afternoon trip? Or is it better spent as a day trip.\n\n&amp;nbsp;\n\nDay 6 (May 8th): day trip to osaka, heading to dotonbori district first (is arriving at 9am too early? If so, we'll get breakfast in kyoto before we head out). Either will go to osaka castle or Sumiyoshi Taisha Shrine, both are roughly the same distance from dotonbori (castle is closer). Any recommendations close to the district/ in the district itself would be appreciated, looking to avoid too much back and forth on public transit when possible. Another possibility for the day would be universal studios, but only if it's not overly crowded. \n\n\n&amp;nbsp;\n\nDay 7 (May 9th): kyoto to tokyo, another 3ish hours. Likely arriving early afternoon 11am checkout + 3pm check in. This one is near chiyoda city / Chuo city, will likely hit up the imperial palace and check out \"downtown\" Tokyo. Might do the other Disney attraction we didn't go to earlier in the trip in the evening.\n\n&amp;nbsp;\n\nDay 8 (May 10th): same as day 3, interchangeable. If we went to Mount Fuji earlier then we might do akihabara on this day instead as it's very close. Ueno park as well\n\n\n&amp;nbsp;\n\nDay 9 (May 11th): looking for potential day trip ideas on this day, would be interested in going to a spa / onsen town if feasible. \n\n\n&amp;nbsp;\n\nDay 10 (May 12th): flight leaves at ~6pm from narita, will take about an hour to get there from our hotel on the skyliner (have tickets already). Looking to be there 3 hours early, so planning to leave at 2pm. Gives us the morning to get food before 11am checkout, what places near chiyoda are easy to hang around with luggage?\n\n&amp;nbsp;\n\nDon't have a lot of specific things planned aside from cities, mainly want to go to certain areas and explore what's there when possible. Any itinerary changes / suggestions are welcomed, thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "Doing a half-day or less at Disneyland/sea seems like an ill-advised choice; you’re going to spend so much time getting there and deal with all the hassle of getting into the park and by then, queues will be formed and you won’t have enough time to do much of anything. Unless you’re really uninterested in doing attractions in the parks and are happy to pay for tickets just to walk around in the park, it seems like a non-starter idea.",
            "score": 9,
            "author": "beefdx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the feedback, we'll keep that in mind. We're specifically doing the weeknight evening tickets, hoping to avoid crowds that way. Both parks are fairly close to our accommodations, so it isn't super inconvenient to get to. My gf really wants to visit the parks, but I'm personally not a big theme park person due to sensory issues, so the evening ticket idea was our compromise",
                    "score": 1,
                    "author": "Raptor_Legend_Hakeem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s golden week so you absolutely will not avoid crowds. 😵‍💫",
                            "score": 8,
                            "author": "Cleigh24"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sleeping mid day on arrival on a 10 day trip seems like a horrible idea. I would highly recommend you not do that.",
            "score": 5,
            "author": "Envelope_Torture"
        },
        {
            "level": 0,
            "comment": "Day 1. You won’t be able to check in until 3pm. Japan is strict about rules.\nDay 2. My friend waited 2.5 hours for one ride at Disneysea on a weekday/non holiday. Just saying.\nDay 3. Visiting one shrine is enough.\nDay 4. Being on the train between 11am and 3pm would be optimal although most likely crowded.\nDay 6. Dotonburi is better at night.\nDay 8. Ueno park is 1.5 hours max.\nDay 9. Hakone\n\nSounds like a great 10 days, have fun.",
            "score": 3,
            "author": "Alyx-Kitsune",
            "replies": [
                {
                    "level": 1,
                    "comment": "We'll definitely look into Hakone for day 9, thanks for the suggestion! Good to know about Dotonburi and the Disney attractions, we'll keep that in mind and rework our plan as necessary to fit them in properly. We're gonna do as another commenter suggested for day 1 and rent out a locker at the station near our hotel while we wait to check it",
                    "score": 1,
                    "author": "Raptor_Legend_Hakeem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have some options. You can do lockers. You can have the bags delivered to your hotel at the airport. You can also go to the hotel and drop off your bags before 3pm and they will hold them for you for free until you come back to check in. Also when I was there, one bag got full of stuff from shopping. I didn’t want to lug it around so I dropped it off at the hotel I planned to stay on my last night in Tokyo. I told them I would come back on so and so date etc… This worked and was also free.",
                            "score": 2,
                            "author": "Alyx-Kitsune"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Interesting, just left Japan today and we were sble to check in early to our hotel in Osaka (the only location we tried). I also was under the impression (from reddit) that we couldnt check in early so we were just asking to drop our bags off and the concierge told us we could check in &gt; 2 hr early",
                    "score": 1,
                    "author": "Halloweentwin2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd try and sleep on the plane, its about 1 hour by train to Tokyo from Narita, your hotel probably won't let you check in to the room until 3pm too. And if you sleep at 3pm your sleep pattern will stay messed up.\n\nWhenever I visit I land early in the day but excitement keeps me awake until night then I crash and I'm on Japan time from the next day\n\nAs for carrying your luggage around on busses and trains. Its possible on trains but wouldnt reccomend it. Just rent a locker for the day at the station you are going to be using most, or try luggage forwarding service to send them to your hotel.\n\nThe rules on Shinkansen for luggage storage have changed recently and im not too familiar with how they work now",
            "score": 2,
            "author": "Skellyhell2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the suggestion on not sleeping when we get there, we're definitely planning on sleeping on the plane ride. We'll look into the luggage forwarding service for our hotels, any service recommendations? I know there are several prominent ones, wasn't sure which would be best for tokyo to Kyoto and back. As for the locker rental, are there fairly straightforward steps for it in English at the stations/ workers that can help with it? Or is the process pretty streamlined",
                    "score": 2,
                    "author": "Raptor_Legend_Hakeem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've never used luggage forwarding but locker rentals will have an English option.\nIf you get a suica card you can use that to book/open your locker otherwise you'll get a ticket with a code on, I've only ever used lockers with a suica card",
                            "score": 2,
                            "author": "Skellyhell2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep in mind that May 3rd-May 7th is Golden week, which is going to be full, extra chaos this year.",
            "score": 1,
            "author": "Cleigh24"
        }
    ]
}