{
    "id": "13399qu",
    "score": 19,
    "title": "Itinerary Check: May in Tokyo / Hakone / Kyoto / Osaka",
    "author": "StrongIon",
    "date": 1682809080.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13399qu",
    "media_urls": [],
    "other_urls": [],
    "postText": "My (30F) husband (31M) and I are taking our first trip to Japan this May. Many thanks to this community for your itinerary ideas and trip reports that have helped us form our itinerary. We are taking a bit of a food tour through the big cities and have therefore reserved many of our dinners ahead of time.\n\nI'm a chronic overplanner, but tried to make up for that by making much of our itinerary optional. Optional things will be in *italics.*\n\nMy main questions are:\n\n\\-Are there things that we should remove from our itinerary altogether?\n\n\\-Are there any big logistical issues in our plans?\n\n# Sun, May 14: Tokyo\n\n1420 Land in Tokyo\n\nBuy a SIM card to last 2 weeks\n\n* SIM: Ubigi: download eSIM prior to leaving. Activate upon arrival.\n\nThings to take care of at the airport:\n\n* Limosine bus\n* Tokyo subway pass 72h\n* SUICA card: Load with 2000jpy x2\n* JR passes: 2F. If the line is too long we can do this at Shinjuku station.\n\nCheck into hotel. Stop at 7-eleven to withdraw 20,000jpy and print our sumo tickets.\n\n1900 Dinner: All you can eat sukiyaki/shabu shabu at Nabezo Shinjuku-Sanchome\n\n*Check out the view from the Tokyo Metropolitan Government Building*\n\n*Drinks at Bar Benfiddich*\n\n# Mon, May 15: Tokyo\n\nShinjuku\n\n* Isetan Shinjuku: explore the basement\n* *Shinjuku Gyoen National Garden*\n\n1130 Lunch at Kobe Beef Kaiseki 511 B1F DIA PLAZA AKASAKA, 4-3-28 AKASAKA, MINATO-KU, TOKYO\n\nHarujuku\n\n* Takeshita Street\n   * Purikura Land\n* Omotesando\n\nShibuya\n\n* Meiji Jingu (can do this in the early morning to avoid the crowds if we wake up early)\n\n1800 Dinner at Usukifugu Yamadaya\n\n*After 9pm: Bar-hop along the Shinjuku Golden Gai, Omoide Yokochō*\n\n# Tues, May 16: Tokyo\n\n0800 Tsukiji fish market\n\n* *Namiyoke Inari*\n* *Matcha stand maruni*\n* *Okame*\n\n1200 TeamLab Planets\n\n1500 Check out the Sumo wrestling tournament\n\n1730 Dinner at Sushi Yuu\n\n*Roppongi Hills, Mori garden*\n\n# Wed, May 17: Tokyo\n\nIkebukero\n\nSunshine City\n\n* Sunshine 60 Street (shopping)\n* Pokémon Center Mega Tokyo\n* Namco Namja Town\n\nNakano Broadway\n\n* Mandarake\n* Capsule Toy Specialty Shops\n* Sun Mall Shopping Street\n\n1820 Shibuya Sky to watch the sunset, booked.\n\n# Thurs, May 18 Tokyo to Hakone\n\n0700 Take the Odakyu line to Hakone Yumoto station\n\n0900 Drop off our bags at the luggage service / lockers\n\nSightsee in Hakone with the Hakone free pass\n\n1600 Check into ryokan\n\n# Fri, May 19 Hakone / Kyoto\n\nLeisurely morning. Breakfast and one last soak in the ryokan hot spring.\n\n* *~~Kinkakuji, if it's clear out~~*\n* Nishiki Market\n* Daimaru Depachika\n* *Nijo Castle*\n\n# Sat, May 20 Nara day trip\n\n7:30-8a: Early morning to Nara\n\n* Rent a bike\n* Kofuku-ji\n* Tōdai-ji\n* Nara Park\n* *Kasuga-Taisha Botannical Garden, will skip if wisterias are not in bloom*\n* Nakatanidou (10-7p): mochi!\n* *Mochiidone Shopping Arcade*\n\n*(Lunch / dinner: Ramen at 麺屋 K)*\n\n# Sun, May 21 Kyoto\n\n(If we get up early and it’s nice out, can go see Kinkakuji temple)\n\nArashiyama Area: Rent a bike!\n\n* Monkey Park\n* ​​Tenryu-ji\n* Bamboo Forest\n* Saga-Toriimoto Preserved Street\n* Adashino Nenbutsuji Temple\n* Otagi Temple\n* *Daihikaku Senkoji, kind of out of the way. Will skip if our feet are sore*\n* *Stick around until evening to see lit up kimono forest or head to Kinkakuji for sunset*\n\n# Mon, May 22 Kyoto\n\nLots of walking today! We hope to enter the **bolded** places and just walk by and admire the non-bolded ones.\n\n* 0600 Early morning at the **Fushimi inari** shrine to beat the crowds\n* 0830 **Sanjūsangen-dō**\n* **Kiyomizudera**\n* Ninenzaka/sannenzaka path\n* Hokanji (Yasaka Pagoda)\n* Ishibe alley\n* Yasaka shrine\n* **Kenninji**\n* *Lunch: Yamamoto Menzou*\n* Heian shrine\n* Nanzenji\n* Philosopher’s Path\n* *Second lunch: Juugo*\n* Ginkakuji\n* *Dessert: 甘味処鎌倉 京都銀閣寺前店 warabi matcha drink*\n\n1700 Dinner at Hyotei\n\n# Tues, May 23 Kyoto/Osaka\n\n*Amerikamura*\n\n* *Kogaryu Takoyaki to-go, enjoy it at Triangle Park to people watch*\n\n*Shinsaibashisuji shopping*\n\n*Namba Yasaka Jinja*\n\nKuromon Ichiba Market\n\n*Matsusakagyu Yakiniku M Hozenji Hanare*\n\n*Shinsekai*\n\n*Harukas 300 sunset (a lot of serendipity has to happen - we'd have to be around the area during sunset with tickets still available)*\n\n*Nipponbashi Den-Den town*\n\n*Pokémon center*\n\nDinner: Dotonbori\n\n*Drinks at Hozenji Yokocho*\n\n# Wed, May 24 Osaka\n\n~~Osaka Castle~~\n\n~~Tempozan:~~\n\n* ~~Osaka Aquarium (1000)~~\n* ~~Tempozan Giant Ferris Wheel~~\n\n~~OR~~\n\nHimeji Castle\n\n**(\\^\\^Which would you recommend?)**\n\nExplore the Umeda neighborhood at night\n\nDinner: Waitlisted for Hajime\n\n# Thurs, May 25 Osaka / Yokohama / Tokyo\n\n*Ramen museum*\n\nMinatomirai\n\n*Ferris wheel (if it’s clear, we can maybe see Mt Fuji at the top!)*\n\n*Cup Noodles Museum*\n\n*Red Brick warehouse shopping*\n\n*Chinatown*\n\nGundam Factory\n\nHead back to Tokyo and see the Kaminarimon Gate at night, which is right next to our hotel\n\n# Fri, May 26 Tokyo\n\n*Sensoji &amp; Imado shrine (close to our hotel, will head this way if we get up early)*\n\nUeno Park\n\n* Shinobazunoike Benten-do\n\nAkihabara\n\n*Dinner on Tsukishima Monja Street*\n\n# Sat, May 27\n\nHead home in the afternoon.\n\n&amp;#x200B;\n\nThanks again for all your help!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Given that it appears that you are travelling from the US, you will need to revise your plans to allow for the effects of jet lag. It is highly unlikely that you will be wanting to go out for the first few nights of your trip.",
            "score": 10,
            "author": "Appropriate_Volume",
            "replies": [
                {
                    "level": 1,
                    "comment": "We’re hoping to take a long nap on the plane ride over, but yeah, definitely dreading the jet lag. I’m in bed at 9pm and up at 6am at baseline so the night activities are just in case we’ve got the energy.",
                    "score": 1,
                    "author": "StrongIon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My wife and I have been in Tokyo for two days of our two week trip out here. We thought the same thing and we’re very wrong! Also sunrise seems to be about 4:15am so there’s that too. We are finally getting on a local schedule now!",
                            "score": 3,
                            "author": "Noel3leon"
                        },
                        {
                            "level": 2,
                            "comment": "Youll be fine....its tough but you just power through it.  STRONGLY recommend Ambien scrip before leaving.  Works wonders",
                            "score": 2,
                            "author": "3h1tKollektor96"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mon May 15 seems packed, you should probably explore Shibuya the same day as your Sky tickets. Also, without reservations, having specific restaurants picked may backfire if you’re not prepared to wait an hour. It’s a hit or miss if the restaurant you found online was also found by everyone else.",
            "score": 6,
            "author": "trigerfish",
            "replies": [
                {
                    "level": 1,
                    "comment": "We’ve reserved all of our dinners ahead of time! We wanted to hit some Michelin spots so I figured it wouldn’t be possible otherwise. \n\nThat being said, we had to move some things around the dinner reservations themselves so that’s why shibuya sky is in an awkward spot. We’re staying nearby so hopefully it won’t be too bad.",
                    "score": 2,
                    "author": "StrongIon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Excellent!",
                            "score": 2,
                            "author": "trigerfish"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Indeed very over planned. I usually would not recommend people to plan for a specific restaurant (If it is not a fancy reservation only place or a must go for other reasons). It kills your day and places that have been popular on instagram tend to get ridiculous long queues. Especially during peak hours. 12-13 &amp; 18-20. So avoid them as best as you can.\n\nBeing more flexible with food means less wait times and the chance to discover something new.",
            "score": 5,
            "author": "JoergJoerginson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Alas, 4 of the 5 dinners we’ve reserved are fancy reservation only places. I do anticipate that we’ll have to sacrifice some sightseeing for these planned meals, especially for the lunch reservation on May 15.\n\nI’m sure you’re right in that our favorite places to eat will have been things that we just stumble upon, and hopefully there will be enough room for that during the rest of the trip",
                    "score": 3,
                    "author": "StrongIon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No advice but just mentioning our days are similar :) we arrive May 14 as well!",
            "score": 3,
            "author": "AhsokaTaco",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome. Let us know if you’d like to meet up for drinks / food / karaoke!",
                    "score": 1,
                    "author": "StrongIon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah sure! Will do! Where are you both flying from? I actually read through your itinerary and we are going to sumo the same day",
                            "score": 1,
                            "author": "AhsokaTaco",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We’ll be heading there from the US!",
                                    "score": 1,
                                    "author": "StrongIon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i personally would skip osaka castle and/or nijo in favour of himeji castle since the one in osaka (and most castles in japan for that matter) are relatively recent reconstructions, and it's hard to explore nijo at your own pace / it's more of a residence anyways tbh. I find i also get a little templed out in kyoto/nara, so it might be good to cut it down to a few very distinct temples and a few very distinct shrines. i personally think seeing the mossy stone lanterns at kasuga taisha in nara are more interesting than some of the buddhist temples but that might just be me.  I didn't think the red bricks or chinatown in yokohama were really something to write home about, but the parks around the waterfront were really lovely and was a huge highlight for my husband. We were pretty underwhelmed by hoppy st tbh if you are planning on stopping by there for supper on the night you're around asakusa, ueno is a short train ride away, and its ameyoko/market area around the train station is significantly larger. i also noticed you wrote down 7:30 -8 as early morning - just a heads up that things tend to open and close relatively early, which works well if you're coming in from north america with jetlag lol.",
            "score": 4,
            "author": "slooshyslush243",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for this, I really appreciate reading about your experiences. I had read that many places didn’t open until 10a, so we didn’t want to head out too early, but it’s great to hear that we’ll have options if we’re jet lagged",
                    "score": 1,
                    "author": "StrongIon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol half my trip was spending time with family that live there,  and and the other half was sight seeing with my partner who was there for the first time so I got a lot of advice (solicited and unsolicited lol) around what to see from ha family haha. And in retrospect, we did spend a lot of times at parks, and checking out temples without entering, so that might be why the 10am opening time didn't bother us!  ooh if you have time, the walk along the river is pretty nice in arashiyama, we ended up enjoying this more than the bamboo forest itself lol. If you are a chronic overplanner, take a look at how to order ramen from a vending machine and how to eat tsukemen! We struggled hard on our first night with both of those haha, but it was fun lol. I dont know if it matters for you, but we dont like the smell of smoking, so we had a hard time finding izakayas that were non-smoking in osaka, so we ended up getting some delicious chinese food instead lol and saved the izakayas for tokyo where smoking is less common.",
                            "score": 2,
                            "author": "slooshyslush243",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Walking around parks and temples in the early morning sounds lovely too. Lol I’ll YouTube the ramen vending machines and tsukemen, thanks for heads up!",
                                    "score": 1,
                                    "author": "StrongIon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No advice but I love your itinerary! We're traveling around the same time as you 😊",
            "score": 3,
            "author": "626junkie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let us know if you guys would like to meet up!",
                    "score": 1,
                    "author": "StrongIon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Monday May 22nd seems very packed (but maybe doable if you’re fit and used to walking a lot?) We only did the Fushimi Inari hike halfway up and it took us almost 2h to go up, down, take pictures etc. By the time we were at Sanjusangen-do we had already done 12.000 steps and climbed 40 floors. It would probably be a more enjoyable day if there are spaces for coffee breaks to rest up a bit!\n\nKiyomizudera is also huge and has a bit of climbing up hills and stairs, and has a cute street filled with gift shops right in front of it. It took us 3h (7h30-10h30) between the shrine and the shopping.\n\nWould it be possible to do Fushimi Inari and Kiyomizudera in separate days?",
            "score": 2,
            "author": "beateafic",
            "replies": [
                {
                    "level": 1,
                    "comment": "\nAh I didn’t realize Kiyomizudera was so huge. I’ll move it to the morning that we’re heading to Osaka since most of that day is maybes. Thank you!",
                    "score": 1,
                    "author": "StrongIon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in Nara on April 24 and the wisteria were in nearly full bloom at the Shrine (next to the botanical garden) but im not sure how long the bloom lasts. We thought about renting bikes but just took the loop bus to the point for Nara Park, Todaiji, ans Kasuga-Taisha Shrine and that met our Nara needs. The shrine is super pretty even if there aren't wisteria.",
            "score": 2,
            "author": "VioletB10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah I didn’t know there was a loop bus, I’ll look into it, thanks!",
                    "score": 1,
                    "author": "StrongIon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.narastation.com/nara-city-bus/",
                            "score": 2,
                            "author": "VioletB10"
                        },
                        {
                            "level": 2,
                            "comment": "We rented bikes in Kanazawa and ended up wishing we took the bus so we applied that lesson learned to our Nara day trips. The bikes were fine but by time we got them and then learned we couldn't just park them wherever.. It was sort of a pain. The Nara JR station had really nicely free maps with rhe bus route and a helpful visitor center too. Not sure what the other station in Nara has but the yellow city bus stops there too. There are several busses in Nara but the yellow city loop bus was easiest and takes Suica cards. As a (not creepy) bonus, we got on it once and about a dozen school children got on and it was just about the cutest thing too.",
                            "score": 1,
                            "author": "VioletB10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you get a 1 day bus pass? For 500 yen it sounds like a great deal, cheaper and easier than a bike. Thanks!",
                                    "score": 1,
                                    "author": "StrongIon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We didnt, just paid with our suica but if you think you might take it to a few stops, it's totally worth it.",
                                            "score": 2,
                                            "author": "VioletB10"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Going in June and curious about bike rental... \nWhat is the parking situation? Is there a danger of them being stolen?",
                                    "score": 1,
                                    "author": "Star------",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No danger about them being stolen! In Kanazawa, the bike rental place was pretty serious about letting us know to only park the bikes in bike parking areas (probably for orderly-ness). The bike parking was near the sites, but it just sort of added another complication.  So that's why we decided to use the (very easy) Nara city loop bus.",
                                            "score": 1,
                                            "author": "VioletB10",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gotcha! Thank you for explaining. Crime is the main reason I don't rent a bike most places, but I had heard crime is low in Tokyo. Looking forward to expanding my transportation options.",
                                                    "score": 2,
                                                    "author": "Star------"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can I’d HIGHLY recommending skipping the physical suica card and get it on your phone! It is SO much easier and faster than having to pull a card out to enter and exit every time.",
            "score": 2,
            "author": "tldig",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll look into it, thank you!",
                    "score": 1,
                    "author": "StrongIon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "you can get a suica card in your apple wallet before you even leave if you want to be able to skip that step at the airport (its easy at the machines, its just even easier to fully skip).",
            "score": 2,
            "author": "unwellgenerally"
        },
        {
            "level": 0,
            "comment": "I’m doing a similar food focused trip (doing Kiyama instead of Hyotei!). One word of caution - Yamamoto Menzou is VERY popular and I saw a queue already close to an hour before opening. Might not fit in with your overall plans.",
            "score": 2,
            "author": "BubbleFoam",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s awesome, how have you been enjoying it so far?\n\nThank you for the warning! I think we will skip it if the queue is too long and look for food elsewhere",
                    "score": 1,
                    "author": "StrongIon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s been great! I ended up punting things from my schedule similar to you (I’m traveling with my elderly parents) but still manage to squeeze in a few sights every day. I never ended up making 2 commitments / reservations in a day since that always goes against the grain of unplanned gems, but hopefully you’ll be able to find a good balance. Your itinerary looks great.",
                            "score": 2,
                            "author": "BubbleFoam"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For Mon, May 22 Kyoto\n\nWe just got back - Fushimi Inari is worth it, but quite exhausting, especially combined with jet lag and all the walking you do normally in Japan.  If you plan on going up to the top, I would make it on it's own day and do something easy the rest of the day.  \n\n\r  \nWe ended up doing a separate day where we walked from Kiyomizudera up to Yasaka stopping at the temples and shrines in between and checking out the streets and that was also enough for one day and it was already later in the afternoon by the time we had made it there. We had originally considered continuing the walk up the philosopher's path but we were already very tired by the time we had made it to Yasaka.",
            "score": 2,
            "author": "sparkly_skull",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! It's always helpful to get the perspective of someone who's been there. I think we'll move Kiyomizudera to the day after and focus on the bolded sections if we get tired after Fushimi Inari.",
                    "score": 1,
                    "author": "StrongIon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our trip dates are just about the same as yours! Arriving May 12 and leaving May 28! We will be in Tokyo the whole time, though! Its our fourth time and I’ve been struggling to plan specific things so your list was helpful!!",
            "score": 2,
            "author": "ninjabread15",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m glad it was helpful ^-^",
                    "score": 1,
                    "author": "StrongIon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd put a lot more money on your Suica. You can use it all the convenience stores many restaurants and more. Using your phone is an option too. \n\nA LOT of bars in Golden gai have charges just to sit down from 500 up to 2000 yen or higher. Bar hopping can get expensive, check for charges before entering and chalk up an expensive bills to experience. \n\nIt seems like you are missing a lot of the sumo matches arriving so late. They can be kind of interesting and the arena is a lot more empty/relaxed. \n\nYou are looking at 3 hours from Hakone to Kyoto, then another 40 minutes by bus to get to Kinkaku-ji. It's really out of the way, and you might have to wait for a bus. If I recall, there isn't an easy way to get from Kinkaku-ji to Nijo, I'd recommend a taxi and probably switching the order with the market as Nijo is between the two. Maybe bus 204 for Nijo or 12 for the market. \n\nI'd probably skip the trip to Nara. It's just more temples and there are plenty in Kyoto. They'll all start look the same at some point. You already have a pile in Kyoto. Consider the zen temples for something along the same lines, but different. Rock gardens, moss gardens bamboo etc. Have some alternative things on your list or consider a trip down to Osaka (about 30-40 minutes)\n\nI'd highly recommend Himeji, and if you get there early consider Engyoji. [http://www.shosha.or.jp/\\_en/](http://www.shosha.or.jp/_en/).\n\nYour plans for Yokohama might be optimistic. Are you planning on sending luggage in advance?",
            "score": 1,
            "author": "cjlacz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate your feedback!\n\n&amp;#x200B;\n\nYikes 2000 yen is a lot for a seat - maybe we'll just pick a bar and hang out there if we end up going. It's not really our cup of tea anyway.\n\nWill cross out Kinkaku-ji on that date and just head to the market first.\n\nWill cross out the aquarium and plan to head out to Himeji.\n\nWe were hoping to store our luggage at the train station in Yokohama. We'll be bringing two backpacking backpacks there. I do worry that if we accumulate more luggage for souvenirs in Tokyo it'll become a problem. Do you think just Minatomirai and the Gundam factory will be doable?",
                    "score": 1,
                    "author": "StrongIon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2000 is the highest I saw, but many bars weren’t on the site. 500-1000 is typical. There places with no charges. Golden gai is interesting. Use some common sense and you’ll find a place that’s welcoming and fun. \n\nFinding a locker for backpacking backpacks might be tough. You’ll probably have better luck at shinyokohama station where the Shinkansen stops rather than Yokohama station. More likely to have a luggage service. \n\nYeah. They are on opposite sides. Gundan factory is near Chinatown, so you can probably see some of it before catching the train back. You can walk to the red warehouse district too, but it’s fairly large, and minomirai walkable from there. As long as you aren’t spending too much time at a location you might be able to make all of them. I generally spend more time in areas so I don’t hit all of them when I go to Yokohama. The kannai area is good for beer.",
                            "score": 2,
                            "author": "cjlacz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s super helpful, thank you!",
                                    "score": 1,
                                    "author": "StrongIon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know it’s too late for you but I’d rather do Osaka, Kyoto, and then Tokyo for first timers. Osaka - for a mix of modern and traditional but more modern… Kyoto - the same but in reverse, more traditional… Then muthaeffin’ Tokyo for an explosion of the two, combined!",
            "score": 1,
            "author": "RonskiC"
        },
        {
            "level": 0,
            "comment": "What airline are you taking?",
            "score": 1,
            "author": "JamesEdward34"
        }
    ]
}