{
    "id": "13agvdq",
    "score": 0,
    "title": "6 days in tokyo",
    "author": "Silogallday",
    "date": 1683446081.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13agvdq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Good day! Will be spending 5 days in tokyo and its our first time! Really excited for this and we made a rough draft of where we want to go but would love input from you guys if we should add or take out some stuff in our list. Then headed to osaka.\n \nUPDATED ITINERARY \n\nTokyo july 28 to aug 1\n\nJuly 28\nArrival from airport free day\nGo to air bnb\n*Piss alley For dinner\n\nJuly 29\nMt fuji\n5 Lakes\nTea ceremony\nShopping\n\n\nJuly 30\nTsukiji market\nPlanet lab\n*Odaiba \nShibuya crossing\nHachiko\n*Shibuya sky for sunset\n*gyukatsu in harajuku \n\nJuly 31\nSensoji temple\n*edo taito crafts\nGolden gai\n\nAug 1\n*tokyo tower\n*tokyo art aquarium \n*Prepare to go to osaka reminder we have our bags already \n\n\n\n\n\n\n* is my additional from sams IT kase kay sam we have 2 free days here i made it 1 lang pra sulit.",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I dont have many tips, except for the art aquarium since I was there a week ago. When you're trying to find it, know that it's on the 8th floor of Mitsukoshi department store (I  didnt realize this at first). However, the entrance itself is on the 9th floor, so you will have to take an elevator there either from the bottom or from the 8th floor like I did. \n\nAfter you're done, the department store has a lot of things to offer if you want to shop. My favourite was all the tea bowls, sake cups etc and especially one shop which had so many beautiful chopsticks.",
            "score": 5,
            "author": "Ok-Heart1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh and I believe they still want you to wear masks in the aquarium so be sure to have some with you",
                    "score": 3,
                    "author": "Ok-Heart1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ty for the reminder we always travel with masks as well. Appreciate it",
                            "score": 2,
                            "author": "Silogallday"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ty for this! Will be very helpful",
                    "score": 2,
                    "author": "Silogallday"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tokyo is one of the greatest food cities in the world. You can easily do a lot better for dinner than convenience store food.",
            "score": 5,
            "author": "Appropriate_Volume",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes we plan on the following days. We just want to settle in for the 1st day or go to piss alley",
                    "score": 2,
                    "author": "Silogallday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omoide Yokocho is less of a tourist trap and more. tiny, intimate places where everyone chats together and decompresses after work. Think Midnight Diner. It might be hard to get by without much Japanese.",
                            "score": 3,
                            "author": "hakujitsu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Appreciate this. Hmmm might pass since we have 0 Japanese speaking capability",
                                    "score": 1,
                                    "author": "Silogallday",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can get by with Google lens and translate. I really love piss alley, I wouldn't skip it",
                                            "score": 1,
                                            "author": "turkeybone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Appreciate it its on my list too! Ty",
                                                    "score": 1,
                                                    "author": "Silogallday"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There are cheap and cheerful type restaurants literally everywhere that would be a better option",
                            "score": 1,
                            "author": "Appropriate_Volume",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Appreciate this will do this instead ty'",
                                    "score": 1,
                                    "author": "Silogallday"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would you mind sharing some suggestions, please? :)",
                    "score": 1,
                    "author": "dmgirl101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always good to list where you're from and where you're staying as advice changes based on that. \nI've just finished 6 days in Tokyo and am currently in Osaka.  \nSleep early the first day you're here, leave early for Tsukiji market (before 8). There's a sushi/sashimi store that is in the market building adjacent to the stalls. Just in front of the toilets. The otoro sushi there is amazingly cheap (600 yen for 2) and legit. Just 5 metres away the stalls &amp; restaurants will sell lower quality otoro for 2-3x more. You can then take a single bus down to Teamlabs (20mins incl walking). Do not arrive more than 15 mins early for Teamlabs, there is absolutely nothing else to do in the immediate surrounding area.  \n\nIf anything, I found Takeshita st/Harajuku to be more of a tourist trap, but I suppose you should go. Omote sando is next to it and pricey, but the architecture is quite interesting.  \nConsider planning naps in your day. We would wake up early to beat crowds for our first destination, walk 20k steps by 3pm, head back for a nap, then come out again at 6pm+ after rush hour to see the city at night. \nI've found good wagyu yakiniku to be easier to find and way cheaper in Osaka.",
            "score": 2,
            "author": "throwawaynewc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciate this ty! Yes heard nothing to do in team lab areas and we can get soaked ao a change of clothes is needed",
                    "score": 1,
                    "author": "Silogallday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You won't get soaked, they provide shorts, you walk barefoot and there's a changing area. Just wear whatever. \nI suppose don't wear a dress.",
                            "score": 2,
                            "author": "throwawaynewc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ty!",
                                    "score": 1,
                                    "author": "Silogallday"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No the JR Pass is not worth it.\n\nThe new version of the art aquarium is terrible compared to it's former glory (the original). Consider skipping it.",
            "score": 2,
            "author": "aucnderutresjp_1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Appreciate this thank you",
                    "score": 1,
                    "author": "Silogallday"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most folks are up early on their first morning from the time adjustment, so it's not a bad day to hit Tsukiji Outer Market. Good combo with TeamLabs since they're on the same part of town. If you're into Gundam, you can explore Odaiba afterward.\n\nAs someone pointed out, you could plan Meiji / Harajuku / Shibuya for the same day.\n\nIf you're going to Tokyo Tower and you enjoy VR video games, my college-age kid very much enjoyed RED Tokyo Tower. Kind of a VR amusement park.",
            "score": 2,
            "author": "evilhubie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty yes i plan to pass gundam too! So i could do \n\n1. Tsukiji\n2. Team lab\n3. Odaiba \nSame day? Then meiji shibuya harajuku next?",
                    "score": 1,
                    "author": "Silogallday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tsukiji is about 15-20 minutes (via transit/walking) to TeamLab, and TeamLab is 15-20 minutes to Unicorn Gundam. We did them all on the same day.\n\nMeiji and Harajuku are adjacent to each other. And then it's about 5-10 minutes to Shibuya Crossing.\n\nGenerally, Tokyo is really easy to navigate, and you can't go too far wrong with any itinerary. But it's probably worth plotting out all your points of interest and grouping by area just to save a little transit time.",
                            "score": 2,
                            "author": "evilhubie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! Really appreciate this",
                                    "score": 1,
                                    "author": "Silogallday"
                                },
                                {
                                    "level": 3,
                                    "comment": "Updated our itinerary hopefully you guys can put some inputs",
                                    "score": 1,
                                    "author": "Silogallday"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to akihabara and check out the electronics stores. Also go to Asakusa and eat tempura. If your into nightlife I think Roppongi/Azabu are better than Shinjuku….although Kabukicho is worth a visit. Rainbow Bridge is also with a couple of hours and if you can get a tour of Sukiji Fush market do it it won’t be there for long from what I hear. Might be worth it also to spend a day in Kamakura. IMHO people often spend too much time in Tokyo. It’s not an easy city to navigate but seems like you have very specific things in mind. Would suggest Kyoto and Nara they are worth it. Would spend at least 2 days there. Although the food is amazing I don’t think Osaka is that interesting.",
            "score": 2,
            "author": "PizzaPoopFuck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for this yes planning to go to the nara deer park. Also cant do nightlight aince i am with fam. Appreciate the input will def try thenstuff here",
                    "score": 1,
                    "author": "Silogallday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nara is fantastic and you only need a couple of hours. Be sure to go to the temple on the right side of the main hondo where the giant Buddha is. It’s an epic view and the artwork is amazing. Those buildings house thousands of artifacts from the Silk Road. Nara is the gateway to it. Also, go to the Grand Inari Shrine as well you can do both in an afternoon.",
                            "score": 2,
                            "author": "PizzaPoopFuck",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is so good\n\n1. Nara deer park\n2. Temple with giant buddha\n3.  Grand inari shrine\n\nTy'",
                                    "score": 0,
                                    "author": "Silogallday"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just got back from a two week trip with my parents and we also spent 5/6 days in Tokyo, including two nights spent in a hotel overlooking Shibuya crossing. We also spent four nights in a hotel in Ueno.\n\nHot take, but I personally don’t find Shibuya that interesting and I think you should do an evening in Shinjuku and then spend your time in a smaller, more interesting neighborhood. We loved Nakameguro and  Kichijoji and you might also try Daikanyama if you’re into vintage designer consignment stores. Yanaka Ginza is a nice little street with interesting shops and it’s about a 15 min walk from Nezu shrine. As someone who cooks a lot, I love Kappabashi St (you can do a fake food class at Ganso Shokuhin Sample-ya if you book in advance and I’d highly recommend checking out the taiyaki making experience at Guraku)! We also had a great time doing the washi paper making class at Ozu Washi paper shop/museum.\n\nGoogle Maps has gotten MUCH better over the past few years and we used it very reliably to find restaurants (4.0+ rating is considered excellent and you may have to wait in line, but we had good meals at places in the 3.7-3.9 range too).\n\nIf you haven’t already, check out Airbnb experiences! Even if you don’t want to book any activities, there are lots of walking tours offered that might inspire you to check out various neighborhoods.",
            "score": 2,
            "author": "laughternforgetting",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hello' thanks for this its super helpful will keep these in mind thnk you'",
                    "score": 1,
                    "author": "Silogallday"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would say, skip Tokyo tower. You can see it from everywhere and nothing there.\n\nInstead, goto Skytree on day 5.\nIt is 10 minutes from Sensoji by train or 15 minutes walk.\nSkytree is twice higher, easy to access, interesting shops under it.\n\nThe one Food display sample shop is my recommend.\n\nhttps://www.ganso-sample.com/en/",
            "score": 1,
            "author": "StarMarPokeFoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is easy to put together west side of tokyo.\n\nLike this\n\n1.Meiji shrine\n\nGet off Yamanote line at Yoyogi station\n\nGo to Meiji shrine from west exit of station to nearest entrance.\nDo not use google map “Meiji jingu”\n\nUse it heading “Meiji jingu Kitasando torii”\nThrough the torii(Gate) follow the road to center of Meiji jingu. (15 minutes walk from station. Meiji jingu is HUGE)\n\n\nThey have many entrance and each one a mile apart. Google map seems to direct you far side gate.\n\n\n2.Harajuku\n\n From center of Meiji jingu, you heading another gate to exit “Harajuku guchi”\nwhen you exit, Harajuku station is in front of you.\nSo you can easily go to Harajuku Takeshitadori.\n\n3.Shibuya\n\n  After walking Harajuku, go back to Harajuku station and ride Yamanote-line to Shibuya.\nit’s one stop.\n  Enjoy Shibuya\n\n4.Shinjuku\n\n    After shibuya, go back to Shibuya station and take yamanote-line to Shinjuku\n     3rd stop only takes 7 minutes.\n\n\nSo this way you can go around in one day\n And you only riding Yamanote-line.\nSimple.\n\n\nWhen you plan always go shrine or temple 1st.\nThey opens around 6am so You can use day longer.",
                    "score": 6,
                    "author": "StarMarPokeFoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Super great ty",
                            "score": 1,
                            "author": "Silogallday"
                        }
                    ]
                }
            ]
        }
    ]
}