{
    "id": "13iy4hc",
    "score": 1,
    "title": "Stayover in Fukuoka vs Kitakyushu",
    "author": "japanonabike",
    "date": 1684222073.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13iy4hc",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've just arrived in Fukuoka, cycling from city to city. There's two days of bad weather upcoming Thurs-Fri, so I want to do a city break before setting off again. Is it worth spending three more days in Fukuoka, or cycling to Kitakyushu tomorrow ahead of it and waiting out the rain there? Which is a more unique stopover in your opinion? Fukuoka seems good for shopping, parks and food, but quite light on actual sightseeing/things to do. Kitakyushu has more museums/unique places, but from what I know it's mainly an industrial port. Which would you stay over in?",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Fukuoka. Aside from having more to see, it also has a small subway system that would help you dodge the bad weather. Kitakyushu makes a good day trip, but Fukuoka is more interesting for tourists.",
            "score": 7,
            "author": "Appropriate_Volume"
        },
        {
            "level": 0,
            "comment": "Japan resident here.\n\nIf you are going Kitakyushu, highly recommend to go to 唐戸市場  Karato Ichiba (Karato fish market)\n\nIt is 26km from Kokura Station in Kitakyushu.\n\nYou can have BEST Sushi in Japan there.\n\nI always take my friend or family to Karato when We go to Kyushu. And They love it.\nIf you want same level of Sushi, it will cost more than 5 times in Tokyo.  \n\nKarato ichiba is not in Fukuoka pref. It is in Yamaguchi (but very close).\n\nIf you google map, use 唐戸市場 for search.\nEnglish Karato ichiba lead you somewhere else.\n\nhttps://www.karatoichiba.com",
            "score": 5,
            "author": "StarMarPokeFoo"
        },
        {
            "level": 0,
            "comment": "I would recommend a visit to Iizuka and Tagawa along the way to Fukuoka. Those are two former coal mine towns that quickly became two of the poorest cities in Japan after coal mine shutdown. There's a museum in Tagawa on the history of mining.\n\nOtherwise, I think there's more to explore in Fukuoka than Kitakyushu.",
            "score": 2,
            "author": "silentorange813",
            "replies": [
                {
                    "level": 1,
                    "comment": "What did you like at Iizuka and Tagawa? The history? Coal miner cuisine sounds interesting.",
                    "score": 1,
                    "author": "Furrymcfurface",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, the history of the region is interesting. Not only the former coal mines that can be located throughout the cities, but also ancient burial mounds and edo era streets. \n\nIt also happens to be the hometown of former prime minister Aso, who referred to Iizuka as the ghetto, so I was curious to see what it's like. \n\nIn reality, I found such descriptions to be exaggerated after visiting, but I did catch some subtle hints like billboards for buraku liberation and communist sentiments. I also had a friend living there that drove me around and shared his experience, which made the trip eye-opening and educational.\n\nI'm not sure if coal miner cuisine is a thing to be honest.",
                            "score": 3,
                            "author": "silentorange813",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd assume they developed some unique flavors from all the different laborers. Maybe cuisine was the wrong word.\n\nI know there are some lawless towns, like no police presence.  Is that what you were looking for?",
                                    "score": 0,
                                    "author": "Furrymcfurface",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was just curious about how communities adapt or don't adapt to waves like coal mine boom and bust. It's not really a lawless town. Rather, a lot of people live off of unemployment benefits, so it's closer to utopia / dystopia  where people feel \"protected.\"",
                                            "score": 1,
                                            "author": "silentorange813",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hmm, an entire town on benefits. Are the people happy?  Is there a plan on how to make the town economically stable again?",
                                                    "score": -1,
                                                    "author": "Furrymcfurface"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would say Fukuoka just for the food scene alone!",
            "score": 1,
            "author": "qb1120"
        }
    ]
}