{
    "id": "13jsp6y",
    "score": 5,
    "title": "Is it worth going to Kanazawa + Shirakawago OR Beppu + Yufuin?",
    "author": "Wise_Zucchini5232",
    "date": 1684301967.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13jsp6y",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! My sister and I are planning a 10 day trip around Japan for early November.\n\nOur itinerary so far is:\r  \n\r  \n**Wed, 2nd Nov** \t\n\nTravel from Korea to Japan in the morning   \nArrive in Tokyo:  \nShibuya Crossing   \nTokyo Metropolitan Government Building – to view Tokyo Skyline for free  \nHarajuku or Shimokitazawa  \nAkihabara / Nakano Broadway   \nRikugien Garden or Ueno Garden   \nTeam Labs   \n**Thur, Nov 3rd** \t\n\nTokyo Disneyland   \n**Friday, Nov 4th (activate JR pass now)**\t\n\nTravel from Tokyo to Kawaguchi-ko – experience onsen + visit mount fuji  \nReturn to Tokyo OR stay in Kawaguchi Lakes in a minshuku  \n**Sat, Nov 5th**  \t\n\nTravel from Tokyo to Kyoto   \nVisit the Kiyomizudera Temple   \nThen walk to Yasaka and Gion   \nStay in Kyoto \n\n  \n**Sun, Nov 6th**  \t\n\nVisit Fushimi Inari   \nThen go to Arashi Yama to see the Bamboo Groves   \nThen take the train to Hiroshima and have dinner then sleep   \n**Mon, Nov 7th**\t\n\nWake up in the morning and see the following:  \nHiroshima Peace Memorial Park  \nHiroshima Peace Memorial Museum  \nThen travel to Miyajima and arrive around lunch   \nThen travel back to Hiroshima and stay the night \n\n  \n**Tues, Nov 8th**\n\nTravel from Hiroshima to Beppu (2hrs trip)  \nSee the Hells of Beppu   \nDo the sand bath and chill in onsen \n\n  \n**Wed, Nov 9th** \t\n\nTake the Yufuin no Mori to Yufuin and explore there for the day  \nTravel back to Osaka in the evening   \n\n\n**Thursday, Nov 10th** \n\nExplore Osaka then take evening flight back to Sydney \r  \n\r  \nI was wondering if it would be better to go to Kanazawa &amp; Shirakawa instead of Beppu + Yufuin before going to Hiroshima. We are keen on scenic / unique views+experiences\r  \n\r  \nOr alternatively if it worth increasing our trip by a couple of days to cover these extra locations - however I may have to purchase extra tickets outside of JR pass which Ofc is $$$.\r  \n\r  \nThanks!!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I was not impressed by Beppu - I did the sand bath down in Ibusuki near Kagoshima and that was great, but Beppu itself did not impress me. I believe a lot of the Hells in Beppu are like the Yellowstone geyser - you can see but you cannot soak so it’s more gimmicky above all else. On the other hand, Yufuin is a delightful little stretch of great shops and delicious snacks, Kinrin Lake really was breathtakingly beautiful.\n\nHaving said all that, I wouldn’t bother with the effort and time to get ALL the way down to Beppu/Yufuin in your short timeframe - a quick Google Map search gives me 2h39m from Hiroshima to Beppu on JR, IMO Beppu is not a sufficiently great a destination to warrant a 5+h to visit when pressed for time.",
            "score": 3,
            "author": "AlwaysStranger2046",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! Thanks for letting me know - I love viewing pretty scenery and trying unique experiences, do you have any recommendations for any places I should visit in autumn? Happy to change my itinerary to suit travelling to that place so anywhere in Japan would be fine. I'm mostly staying in Beppu to see Yufuin but it being an onsen town would make for a nice place to relax",
                    "score": 1,
                    "author": "Wise_Zucchini5232",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d say go to amanohashidate and Kinosaki onsen? There should be nice foliage there for autumn, and do go on BOTH sides for their very different view of the same “bridge”. \nI really, REALLY like Tottori for their sand dunes, it was a very surprising and “not-typically-Japanese” sight.",
                            "score": 1,
                            "author": "AlwaysStranger2046",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thankyou!!",
                                    "score": 1,
                                    "author": "Wise_Zucchini5232"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm pretty biased because I live over near Kanazawa and I think it's a great city to visit. However, it is often called \"Little Kyoto\". It has a lot to offer that is somewhat similar to Kyoto. I think they're both worth visiting but because it's Kyoto-esque and you're already going there... you may feel like it's more of the same?\n\nShirakawa is really great, and many people do it as a day trip from Kanazawa. The scenery there is pretty unique. It's a beautiful place in the mornings and the fall scenery would likely be really nice. I think it would be pretty different from other things on your itinerary. \n\nI guess having said all that, Yufuin + Beppu would possibly be more unique than Kanazawa + Shirakawa. So maybe worth the time more?\n\nHow long is your JR Pass good for? You can always activate it later in your trip. Maybe pay for some of the othe travel up front and then activate your pass a few days in if you decide to stay longer. That might already be something you have thought about though.",
            "score": 1,
            "author": "RamblingRamsbothams",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the comment! This is really helpful - do you know if there are any other locations similar to Shiragawa-go in Japan? It just looks so so pretty but I’m unsure if I could get to it directly from tokyo",
                    "score": 1,
                    "author": "Wise_Zucchini5232"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been to both and I would go for beppu. \n\nYufuin city is kinda boring in my opinion, but the mountain is beautiful. Kujurenzan is also amazing in that area",
            "score": 1,
            "author": "ihavenosisters",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the comment :) I’m excited for the Beppu sand on send",
                    "score": 1,
                    "author": "Wise_Zucchini5232"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Day 1 is definitely overbooked unless you spend only a few minutes in each location.  Its a couple hours flight from Korea + customs + baggage claim + at least an hour from Haneda or 2 from Narita to get to Shinjuku/Shibuya.  The earliest you could possible arrive at the airport in Japan is 8 am, but 10 or 11 is more likely.  So you are looking at 10am arrival in Shinjuku/Shibuya at the absolute earliest, but 12pm or later is more realistic. \n\nI'd honestly skip the Kyushu part this time around (Beppu and Yufuin) and spend time in Tokyo or Osaka if those are important to you.  There's lots of scenic stuff around the greater Osaka or Tokyo areas that would be easier to do than flying to and back from Kyushu.  Don't get me wrong, Kyushu is great, but trying to squeeze Tokyo + Kyoto + Hiroshima + Osaka + Kyushu in 10 days is going to be hard and you'll spend a lot more time traveling than actual sight seeing at that point.",
            "score": 1,
            "author": "urzu_seven"
        }
    ]
}