{
    "id": "13liyso",
    "score": 37,
    "title": "Feasibility of travelling Okinawa via full public transport",
    "author": "blackstaircase",
    "date": 1684464715.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13liyso",
    "media_urls": [],
    "other_urls": [],
    "postText": "Long story short, 3 of us (all non-drivers) impulsively booked a grad trip to Okinawa without realising that a car is absolutely essential.\n\nAs I'm currently planning the itinerary now, I'm seriously petrified by the comments on the public transport system in Okinawa. But at the same time, I really want to make this trip work :( \n\n\n\n\nMy original itinerary is rather packed too:\n\n\nDay 1: Naha airport -&gt; Hotel in Nago\n\nDay 2: Hotel in Nago -&gt; Nago pineapple park/orion happy park\n\nDay 3: Hotel in Nago -&gt; Matayoshi Coffee Farm -&gt; Hotel in Nago -&gt; Hotel in Naha\n\nDay 4: Hotel in Naha -&gt; Kayaking at Kaneku seaside park -&gt; Snorkeling at Blue cave -&gt; Mihama American village\n\nDay 5: Hotel in Naha -&gt; Makishi market/Kokusai Dori Street -&gt; Okinawa City\n\n\n\nI understand that the public transport in Naha is still relatively decent, so my main concern is really the travelling for Days 3 and 4.\n\n\n\nHere to get some brutal feedback and advice on the feasibility of executing this itinerary via public transport... and in a worst case scenario, if we should just forgo our bookings for this trip and stick to mainland Japan...\n\nIf you're able to help, would really appreciate your honest input. Thank you very, very much in advance! :)",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "My advice would be to get to the bus stops like 10 minutes early. The buses are infrequent sometimes and if no one is waiting at the stop then they will not stop even if they get there earlier than expected. That being said, there is sometimes bad traffic on the island so the buses also have a higher chance of being delayed.",
            "score": 43,
            "author": "Fcawog8527",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see! By any chance, would you know if Google Maps provides a reliable navigation route / time estimation?\n\nThank you for your reply btw!",
                    "score": 7,
                    "author": "blackstaircase",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah google maps was accurate to my knowledge. I was there like 3 days ago and also didn’t want to drive. I stayed primarily in Naha though, only leaving for the castle and American village. \n\nYour itinerary doesn’t seem to be packed so you should be just fine. Just make sure to check the return bus times because I think they stop running earlier than mainland",
                            "score": 3,
                            "author": "Fcawog8527"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can't really add much since I'm currently in Okinawa and rented a car but I just wanted say skip the castle, it unfortunately burnt down in 2019 and there isn't much to see there besides a view over the city, in my opinion it's not worth the price (time and ¥) also try to add a stop in the American village in the evening, it's beautiful and pretty fun with loads of quirky shops and cafes with everything being a Japanese/Americana fusion. Also if you're coming soon, plan backup indoor plans (Aeon mall, aquarium etc) it's rain season and some days have torrential rain that will make outdoor activities impossible.",
            "score": 19,
            "author": "Maultaschenman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Moin,\n\nMind sharing some of the places you went? Going there in July, still looking for some inspiration\n\nAnd going to rent a car. \nDid you had an international Drivers license or was your (I presume) German license sufficient?",
                    "score": 3,
                    "author": "nadajet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have to bring both International Driving Permit and your home country's driver's license. They check both when you pick up a rental car.",
                            "score": 4,
                            "author": "waronjoypiter"
                        },
                        {
                            "level": 2,
                            "comment": "For German drivers licence, a translation is enough. You have the translation done online and then have it printed out in any 7/11 in Japan. (i have an Irish licence). I went to the Pokemon center, American village, the aquarium, a couple of beaches, Naha kokusai dori, shuri castle and did a kerama islands snorkeling tour via klook. I had plans to visit a few more beaches and towns but the weather has been extremely bad some days, being from Ireland, I've never seen as much rain before lol.",
                            "score": 4,
                            "author": "Maultaschenman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the Tipps.\nLooks like your name misled me a bit 😅",
                                    "score": 1,
                                    "author": "nadajet"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Of course unless you want to support the castle by giving it a visit. I mean, yeah it's not that much to see, but originally I wanted to travel to Okinawa last winter and actually was looking forward to see the reconstruction in progress",
                    "score": 2,
                    "author": "K1nk1lla"
                },
                {
                    "level": 1,
                    "comment": "Thanks for the advice, will keep that in mind! :)",
                    "score": 1,
                    "author": "blackstaircase"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to live in Okinawa and looking at your itinerary, I would get a hotel in Chatan on Day 3 instead of going all the way back to Naha. American Village is in Chatan and in the middle of the Okinawa main island. It would be easier for you to get to your Day 4 activities as well. Okinawa City is also closer to Chatan. You'd be backtracking if you went there at the end of Day 5. I can't speak to the public transportation since I only took the bus or monorail for short distances on the days I didn't drive. But feel free to message me if you have questions, I lived there for 5 years.",
            "score": 10,
            "author": "waronjoypiter",
            "replies": [
                {
                    "level": 1,
                    "comment": "This!\n\nStay in Chatan, there are some decent hotels there. Go to Ryukyu Mura by taxi in the morning , then there’s a great restaurant at the harbor called ‘Wagyu Cafe Kapuka’ you could hit up for lunch. Hit up American Village in the afternoon after lunch. \n\nThere are numerous restaurants in and around American Mura (hell, there’s even an A&amp;W and a Red Lobster!). I like Blue Ocean Steak. The menu ranges from about ¥2500 all the way up to ¥15,000 for the really good stuff.",
                    "score": 3,
                    "author": "Japanat1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nice, thanks for the recommendations! Just trying my luck but do you have any must-try Japanese food recommendations in Okinawa too?",
                            "score": 2,
                            "author": "blackstaircase",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let’s see…\n\nThere’s chanpuru, which is a stir fry with Spam, egg and bitter cucumber; it’s considered Okinawa’s signature dish.\n\nOkinawa’s beef is not as famous as Kobe Beef, but it’s quite good. There are Benihana-type restaurants all over where the chef cooks your dinner right in front of you on large griddles in the middle of the table. These are popular with the military and their families, because they’re delicious and reasonably priced for beef in Japan..\n\nThe sushi is fresh. If you want the Japan experience, be sure to go to one of the conveyor belt sushi restaurants.\n\nIf your hotel can recommend something, you have to try a traditional course dinner (Kaiseki ryōri). Many different little dishes which add up to a visual treat and taste very good as well.\n\nBlue Seal ice cream is famous and quite tasty. Try out the beni potato flavor if you can find it.\n\nIf you want to try something more western, taco rice (literally tacos on rice) is good, and Okinawa’s regular tacos are pretty good, too.\n\nI’m an American living in mainland Japan, so I tend to try to get tacos, etc, every time we go there to visit my SIL.",
                                    "score": 2,
                                    "author": "Japanat1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for the advice! I've changed my second hotel to one in Chatan and the estimated travel time has improved by so much already :')",
                    "score": 2,
                    "author": "blackstaircase"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okinawa is car dependable for sure. The yui rail can take you around central naha only and as there are some nice things to do in the center, the good stuff is all over the island, hence why a car is important.\nI rented a car and it was great. I got to places i would never be in if i didn't rent a car. Taxis are expensive as expected. \nTry to connect with other travelers that have a license and suggest splitting the car bill or even paying for all of it",
            "score": 7,
            "author": "GammaFruits",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure why you were downvoted, I lived there for many years and this is spot on",
                    "score": 4,
                    "author": "cjxmtn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Make sure you’re getting on the right bus. Check the bus number. During my time in Okinawa, using the buses, I accidentally got on the wrong bus because two buses arrived to the same location at the same time but I was not aware of this so I got onto the wrong bus.",
            "score": 6,
            "author": "souji5okita"
        },
        {
            "level": 0,
            "comment": "Regarding the rental car - do none of you drive (no license) or are you just not interested in driving? \n\nI was in Okinawa a few weeks ago and I rented a car for 3 days. Driving was not as intimidating as I thought it would be, if that is a concern.\n\nI can’t comment with authority on public transport options. They exist, but they are not as frequent or convenient as mainland Japan. Therefore you would have to build your itinerary around the bus timetables etc. which I personally find can be stressful.\n\nThere are taxis but I found them mostly concentrated in the Naha area. Also they can get expensive for longer hauls and the bigger issue is you might be able to take a taxi from city -&gt; country but finding a taxi when you’re out in the country can be tough.",
            "score": 7,
            "author": "friendlyguy1989",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, thanks so much for your reply!\n\nUnfortunately we all don't have driving licenses :/\n\nAnd yes, I've looked up the bus timetables, but I also saw some comments saying that buses in Okinawa tend to be late / not on time... Do you have any idea about that?\n\nWas wondering if there was a way to check the live bus arrival times, so we can figure out if we've missed our bus or anything too...\n\nRegarding taxis, would you think it's possible to get a taxi from somewhere like Matayoshi Coffee Farm to Nago via a ride hailing app like Didi?",
                    "score": 3,
                    "author": "blackstaircase",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bus possibly being late is not only a Okinawa thing. I was in Saitama prefecture yesterday, only 4 bus a day, and is was late by a couple of minutes. Never know if there will be traffic or more people using it, or a grandma that take time paying and getting out of the bus. But I have been in bus that wait a couple of minutes at specific stops just to not run in advance, but still better be a bit in advance.\n\nFor having traveled in other regions with less train/bus, it is possible but require a strong planning, knowing bus time and such. You might be able to see less and might having to wait for bus.",
                            "score": 7,
                            "author": "gdore15"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for giving me a glimmer of hope :')",
                    "score": 1,
                    "author": "blackstaircase"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You could definitely use this site to plan your route/bus stops with a timetable. this site also displays the different kind of buses that you could hop on.\n\nhttp://www.kotsu-okinawa.org/en/map\\_south.html",
            "score": 3,
            "author": "pollerkid21"
        },
        {
            "level": 0,
            "comment": "I've done similar stuff by bus, a bit annoying, but doable. \n\nAs well, if the schedule is not fixed and you get good weather, I'd recommend taking a ferry from Naha to Kerama Islands (Zamami, Aka). They are way more natural and quiet compared to the main island. Good for beaches, snorkeling, diving and calm village life. Staying overnight is prefer, while doable as a day trip too. \n\nOn the main island I liked Cape Manzamo a lot.",
            "score": 3,
            "author": "Empty-Impression6262"
        },
        {
            "level": 0,
            "comment": "Was there on a nature tour last month and we spent most of our time on the north end of the island, such as Yambaru National Park.  But we were there for the birds and other wildlife (gotta see the rail!).\n\nNaha (and the south end in general) really surprised me from an appearances standpoint.  For a subtropical island, the architecture is amazingly non-tropical looking.  It's all harmless concrete buildings that are ugly and it looks like you could be anywhere but an island paradise.\n\nAmami-oshima I liked a lot better because it is mainly small towns that have a lot more charm.  And it has even more beautiful scenery and some nice wildlife at that.",
            "score": 3,
            "author": "Vin-Metal",
            "replies": [
                {
                    "level": 1,
                    "comment": "The buildings in Okinawa are made out of concrete to withstand typhoon season. When it comes to typhoons, Okinawa usually gets hit first. So yes, most of them are not pleasing to look at but they serve a purpose.",
                    "score": 3,
                    "author": "waronjoypiter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "in the same boat- just commenting to boost",
            "score": 2,
            "author": "hkraze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boat is also good option to be fair",
                    "score": 6,
                    "author": "Maultaschenman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve done this many years ago when I was under 18, and it was my first time traveling abroad alone. It was very feasible back then if you don’t mind spending a lot of time for bus or just walking a lot.",
            "score": 2,
            "author": "H2TG"
        },
        {
            "level": 0,
            "comment": "Try looking for day trip bus tours that will go the places you’re interested or ask your hotel if they can arrange a full day sightseeing taxi.  Relying on public buses to sightsee around the island will be very, very difficult and frustrating as if you miss the scheduled departure you may be stuck waiting for a long time.",
            "score": 2,
            "author": "phillsar86"
        },
        {
            "level": 0,
            "comment": "The busses I have rode in Japan are generally not marked nearly as well as trains, and often don’t display the bus line name or route in romaji, and so if you can’t read Japanese it gets very confusing trying to figure out if the the kanji on your google maps navigation matches what’s on the bus electronic display. When I got on the buses in Japan i always had to ask the driver to be sure I was on the right one. I’m not sure if there’s more English speaking in Okinawa, but I would make sure that you and everyone in your group can confidently, without second thought, ask the bus driver  “Is this bus going to &lt;insert place&gt;” in Japanese - “Kono busu wa &lt;insert place&gt; ikimasuka?”",
            "score": 2,
            "author": "tzcw"
        },
        {
            "level": 0,
            "comment": "Can you rent bikes?",
            "score": 1,
            "author": "Xoxohopeann"
        },
        {
            "level": 0,
            "comment": "Take a ferry to the Kemara islands and you won't even need a car! I just came back from Okinawa and public transportation SUCKS.",
            "score": 1,
            "author": "Either-Marketing233"
        },
        {
            "level": 0,
            "comment": "Swing by the DMV and grab your license. Assuming you're at least 18, it should be pretty quick to get.\n\nAfter that, apply for the AAA international drivers license, which you'll need, and rent a car. You will be miserable if you're sticking to busses only, and will be limited in what you can see. \n\n Personally, I'd skip mainland and go to Okinawa. Okinawa has a lot to see and is very nice, you just need to plan accordingly.",
            "score": 0,
            "author": "Awkward-Action2853",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's assuming that OP is American, which from their comment history they may not be.",
                    "score": 2,
                    "author": "waronjoypiter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is true, as I didn't think about looking at their past comments.\n\nThe same concept would apply though, however depending on their home country, it might be more time consuming to get a license. They'd also need to check whether or not they need an IDL, as that changes from country to county, and how Japan accepts their license.",
                            "score": 1,
                            "author": "Awkward-Action2853"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use taxi and uber.\n\nWhen you get back, get started on getting a license. Not judging you for not having one, it’s just such an invaluable skill.",
            "score": -3,
            "author": "Taido_Inukai"
        }
    ]
}