{
    "id": "13tbm9h",
    "score": 40,
    "title": "Help an over-planner with Kyoto leg of trip",
    "author": "LadyBosie",
    "date": 1685204506.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13tbm9h",
    "media_urls": [],
    "other_urls": [],
    "postText": "We are not even going until November, lol but I am obsessed with planning anytime we go on a trip. I totally understand that some of my plans won’t end up happening but it’s how I roll. My husband is the one who will convince me to go off script when necessary lol.\n\nANYWAY that being said I could use some help determining if this makes sense for the Kyoto portion of my trip. I’m about 99% sure that there are more shrines than are feasible here, but I’m having trouble figuring out which ones will take how long and which I should prioritize so I’d appreciate insight. (By the way, I am not holding myself to the exact amount of time spent at each but it helps me to estimate lol) Also whether my walking paths make any sense or not and thoughts on Option 1 and Option 2 (or something else, lol) on day 3.\n\n**Day** 1\n\nCheckout Tokyo, Head to Kyoto Shinkansen\n\n* Check in at Sotetsu Fresa Inn Kyoto-Kiyomizu Gojo\n* ~~Wander through historic &amp; shopping areas in central Kyoto Gion Geisha district, visit Yakata Antiques Hanami-koji Street &amp; side alleys Shirakawa Area along the canal Shijo Avenue~~\n* Yasaka Shrine (20 min)\n* Gion wandering/shopping\n* Kodaiji Temple Lightscape (600Y/$5-6) at night (5-9:30 PM)\n\n**Day 2**\n\n* 6  AM, depart for Fushimi Inari Shrine (free)  (**spend about 3 hours?)**\n* On the way out, check out vendor stalls and get some street food.\n\nGo to Philosopher's pathish area\n\n* ~~Yasaka Shrine (Free)~~ **~~(15-20 min)~~**\n* ~~Heian Temple (Free)~~ **~~(time?)~~**\n* ~~Kurodani Temple or Konkaikomyo-ji Temple (Free) (45-1 hour)~~\n* Eikan-do Zenrin-ji Temple **(1-1.5 hrs)**\n* Kumano-Nyakuoji Shrine **(quick stop)**\n* ~~Okazaki-jinja Shrine (Free)~~ **~~(might skip)~~**\n* Otoya-Jinja (Free) **Quick stop**, mouse guardians\n* Stop for shaved ice at Komichi\n* Shinshō Gokuraku-ji (Shinnyo-dō) Temple **(2ish hrs??)**\n* Honen-in Temple (Free) Small, **quick stop**\n* Higashiyama Jisho-ji (Silver Pavilion) (500Y/$4-5) **(1 hr)**\n\n**Day 3**\n\n***Option 1***\n\n* ~~Take Karasuma line to below Kyoto Botanical Gardens (200y $1-2)~~ **~~(1-2 hours)~~**\n   * Walk to nearby Kamigano-Jinja Shrine (free) (**Time**?)\n* 30ish minute walk to Shoden-ji Temple ($400Y/$3-4) (**Time**?)\n   * Beloved by David Bowie\n   * Bamboo\n* Back to Hotel\n* 8:30 PM, 20-30 min walk to Kiyumizu-Dera shrine (400Y/$3) to see it lit up at night\n   * (may need to check the time for this closer to the date).\n   * Arriving closer to closing time is better for less people\n\n***Option 2***\n\n* Kyoto Imperial Palace &amp; Gardens (free) (**1hr**)\n   * One of the few imperial palaces that don’t require an application for admission\n* Seimei Shrine (free) (Quick stop)\n* Nijo Castle (800 yen/$6, additional 500/$4 to go inside\\* (**Possibly skip**) (**Time**?)\n* Explore Nagayo Ward (lots of shopping and eating and drinking) Kawaramachi Dori and Shijo Dori and Teramachi and Shin-kyogoku covered shopping arcades\n\nDay 4 Arashiyama\n\n* About 1 hr to Saga Arashiyama Station \n* Tenryuji Temple (**20 min**)\n* Nonomiya-jinja Shrine &amp; Arashiyama Bamboo Grove (Free) (**1-1.5 hrs**)\n* Okochi Sanso Garden (1000 yen/$7-8) to train station **(1 - 1 ½  hour)**\n   * Okochi-Sanso Villa is the former estate of actor Okochi Denjiro (1898-1962)\n   * Admission fee includes a cup of matcha and a sweet Hilltop view of entire city\n* Take the Sagano Romantic Train Get off train at Kameoka Station and take to Saga Arashiyama Station\n\nThese 3 Dependent on Time/Energy\n\n* Gioji Temple (300Y/$2-3)  (**Time**?)\n* Adashino Nenbutsu-ji Temple (500Y/$4-5) **(Time?)**\n   * Bamboo grove\n* Otagi Nenbutsu-ji Temple (300Y/$2-3)  (**Time?)**\n   * 1200 statues\n\n**Day 5**\n\n* Check out Kyoto\n* Train to Daigo-ji Temple (1500 yen to see whole thing) **(time??2 hours??)**\n   * Bentendo Hall, especially beautiful in Nov, most photographed building\n   * Landscape garden\n* Nara Park DEER.\n* Kasuga Taisha Shrine &amp; Garden (Free grounds, 500Y/4-$5 inner area) **(1 hour)**\n   * Famous for its many stone lanterns\n* Get some Sake at Harushika Sake Brewery\n* Train to Osaka",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I admire your ambition in setting up this detailed schedule. My first reaction is - that is a LOT of temples for one trip. Are you a big fan of temples, or just feel that is what you should focus on in Kyoto? If the latter, I might diversify activities a bit.",
            "score": 42,
            "author": "Yesterday_Is_Now",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a big fan of temples, however I already am pretty sure all of them will not happen. If I don't get templed out I'm sure at least my husband will. So probably I'll be putting some in the definite category and some in the maybe but it's so hard to choose because they all look so beautiful! And the nature surrounding many of them.",
                    "score": 11,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Speaking as someone who lived in the area for several years, but is only a moderate temple enthusiast, my list of must see Kyoto temples would include: Kiyomizu-dera, Ginkaku-ji, Heian-Jingu, Kinkaku-ji, Tenryu-ji, and if you like rock gardens then Ryoan-ji. Also Todai-ji in Nara and Byodo-in in Uji (between Kyoto and Nara).\n\nIn Arashiyama there is a fun monkey park on the south side of the river - lots of small monkeys running around freely. You can feed them, but watch your possessions as they are not shy about grabbing stuff.\n\nThe shopping arcades near Kawaramachi dori are fun - a little touristy but lots of eclectic goods to look through, and there are a bunch of restaurants nearby.",
                            "score": 22,
                            "author": "Yesterday_Is_Now",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks so much! We actually decided to skip the monkey park this time\n\n&amp;#x200B;\n\nI love eclectic goods.",
                                    "score": 2,
                                    "author": "LadyBosie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wise choice re: monkey park. I am a huge animal lover and found the park to be extremely underwhelming.",
                                            "score": 2,
                                            "author": "cupcake_214",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think it's good when you have kids and that's about it lol. I used to live in the area and we'd bring friends there because they wanted to see the monkeys but I always felt the park was meh. Ironically I'm going there this summer but only because my daughter really wants to see the monkeys lol. On the plus side we'll get to go to one of my favorite ice cream shops that's nearby.",
                                                    "score": 1,
                                                    "author": "gimmethelulz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The hike was a bit more than we expected, and we had limited time in Arayashima, which was so so lovely with cherry blossoms. Wish we had skipped it and walked around more. Totally see it bring fun for kids though!",
                                                            "score": 3,
                                                            "author": "cupcake_214"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I happen to be staying right near there, could you share the name of your fav ice cream place? Thanks!",
                                                            "score": 3,
                                                            "author": "kaitoujeanne23",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They specialize in soft serve that uses tofu as it's base instead of milk and it's delicious😋\n\nhttps://maps.app.goo.gl/m3J7GsssLuWuD6mJ7",
                                                                    "score": 7,
                                                                    "author": "gimmethelulz"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah originally I thought it sounded interesting, but after watching the videos I was less impressed, plus the hike is supposed to be fairly steep and I don't want to waste my energy for somehing just meh\n\nThe other monkey park in nagano I think, I kind of like better because it feels less \"zoo-like\" but I don't think we'll be doing that either this trip.",
                                                    "score": 1,
                                                    "author": "LadyBosie"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We loved Arashiyama! That's where I got my dad a pair of engraved chopsticks. Riding the Randen was fun, our Airbnb was near the Kyoto end of the line.",
                                    "score": 2,
                                    "author": "NotUntilTheFishJumps"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Blows my mind that people are like this ahah (that’s a good thing btw, it’s interesting to see how we all differ and everyone’s approach is equally valid. \n\nI’m going to Kyoto in 3 days (I’m in Tokyo for the moment) and don’t even an hotel booked yet.",
                            "score": 3,
                            "author": "Fucile8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "omg, that strikes terror into my heart lol",
                                    "score": 1,
                                    "author": "LadyBosie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah man, live life and be free from the shackles of planning!",
                                            "score": 0,
                                            "author": "Fucile8"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What are other activities we can do? Because I'm planning a trip and most of Kyoto's attractions seem to revolve around temples.",
                    "score": 2,
                    "author": "ButltWasMeDio",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with the suggestion of the Nishiki market arcade to sample the many food offerings, and again the various shopping arcades near Kawaramachi dori for souvenir hunting. \n\nOtherwise:\n\nMount Hiei (or Hiei-zan): Located at the NE edge of Kyoto  - you can take the train there, then take the cable car (ropeway) up to the top of the mountain. From there you get nice views out over Kyoto on one side, and Lake Biwa on the other. Plus there's a pretty garden you can stroll around. On the far side of the mountain is Enryaku-ji, which is a temple, yes, but unlike the hustle bustle of central Kyoto this one is quite serene and surrounded by tall trees. (it wasn't serene in the 16th century - the forces of Oda Nobunaga slaughtered the monks and burned down the buildings). But I think you would need to take a bus to get there.\n\nToei Kyoto Studio Park - western Kyoto: Half movie set and half amusement park. I've never been there, but if you like samurai movies/TV then you can walk around the outdoor sets where many such things have been filmed, and also I think see some live performances. A little bit of anime-themed attractions as well. I would not expect to be amazed, but it might be a interesting for a change of pace.\n\nKyoto Railway Museum - southern Kyoto: I haven't been here either, but should appeal to any train enthusiasts.\n\nThat's all that comes to mind for the immediate Kyoto area, but there's a wide range of day trips you could take to Nara, Osaka, Kobe, etc.",
                            "score": 4,
                            "author": "Yesterday_Is_Now",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Al of them sounds interesting especially Mt. Hiei. Thank you",
                                    "score": 2,
                                    "author": "ButltWasMeDio",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure, always happy to chat about tourism destinations in Japan, especially around the Kansai region..",
                                            "score": 1,
                                            "author": "Yesterday_Is_Now"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nishiki Market was fun, plus shopping streets like Sannenzaka",
                            "score": 3,
                            "author": "artificialnocturnes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha, I'm more looking for people who have suggestions of something to cut out, or like if the order I have for doing something makes no sense. Believe it or not my mom plans EVEN MORE intensely. Like \"take a right out of the hotel and walk x feet to this street, then take a left\" lol",
                    "score": 3,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A few thoughts on the Nara day.\n\nDaigo-ji is a bit out of the way to Nara. You could get off at Rokujizo Station and walk/take the metro, but it's still out of the way. This transfer will take you longer that you expect, consider if it's worth it. (haven't been to that temple, speaking from general exp.). You also need to make sure you get into a train that stops there (express trains might not, I am not sure)\n\nYou see deer as soon as you walk into the part (everything in green on Google Maps on the eastern side of Nara is basically one sprawling park). There's most deer in that area (Kofuku-ji, Nara national Museum area broadly speaking), but that's also where everyone wants to take a photo. But there's more deer! They are EVERYWHERE! My best deer experience was a little deeper into the park where people spread out between the temples, but the interactions are just as fun. You can always get some deer cookies on the way back.\n\nImportant to know about Nara (also Kyoto largely speaking) it's ALL uphill from the station. Not in a major way, but you keep walking uphill until you reach Kasuga Taisha (or even further if you want to). I had a slightly different schedule (Kyoto -&gt; Osaka for a nights in a capsule -&gt; Tokyo) and I forwarded my main luggage straight to Tokyo. Consider doing that or at least leave it in a locker in the train station. You don't want to be dragging it on an unpaved path all the way to Kasuga Taisha.",
            "score": 7,
            "author": "870223",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much! This really helps. Often Google map routes definitely make things seem easier than they really are. Definitely will consider just doing Nara instead",
                    "score": 1,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My son and I just went to Nara yesterday, and there are so many deer, it is crazy to see in person. Definitely go further into the park, but if you go really far in towards the mountains there are few people, lots of deer but these are much more aggressive compared to the ones by the entrance. They won't bow as much, will gang up on you and eat everything you're holding including bags. It's an amazing experience. Also, most shops seem to close by 5pm or 5:30pm.",
                            "score": 3,
                            "author": "FizbanMccloud"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey! I’m a heavy overplanner too but I’m in Kyoto right now and wanted to chime in! Is this your first Kyoto trip? I’d honestly recommend taking a look at Japan-guides suggested day trip itineraries. A lot of things you’re doing are super spread out with your plan, when they’re a 10-15 min walk from other temples you’re doing on other days!  For example philosophers path and ginkaku-ji are right next to each other but super far from Inari. Also Inari is not too far from kiyomizu dera. Don’t underestimate how long it takes to catch a train + the added time of trying to figure out where the entrance is / what platform to use. That alone added 10-15 minutes to every train trip I took lol. If there’s things you can just walk to instead, try to set the days up that way! I didn’t follow Japan guide 100%- but I did just split the 8 hour itineraries in half to make 4 hour days so I could make time for other reservations / events (tea ceremony, special cafes, sento etc). The website also has ratings / rankings for attractions so you can figure out what to prioritize. Hope that helps!",
            "score": 8,
            "author": "Canadian_Kaiju",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Yeah I'm def getting from the comments I should overestimate the times more, I've been just going by whatever it says on google maps.  With Kiyomizu dera I didn't have it on that day because I had it at night since I saw it has night illumination in fall.",
                    "score": 1,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a few points to make:\n\nThere is no train to Philosopher’s Path. You can take the train to get closer to it, but you’ll have to take a bus or a taxi to get to it (or take a very long walk). I would recommend going to Ginkakuji if you are there as it is the highlight of the Philosopher’s Path area. \n\nRegarding Nijo Castle, it is currently undergoing renovation, so the outside is covered with a tarp, but I believe you can still go inside. If you want to skip that, I recommend moving Daigo Temple here, which would allow you to devote a whole day to Nara.\n\nIn Nara, you should definitely add Todaiji. It is quite impressive.\n\nI really admire your plan. You include a lot of places that are lesser known to overseas tourists. That means you’ll have a unique experience in Kyoto. One last recommendation is to perhaps prepare a non-temple activity or two in case you get temple burnout, which is a real thing. Perhaps a museum or a craft activity or cultural experience could break up the parade of temples in a way that would help you avoid that burnout.",
            "score": 8,
            "author": "DizzyHoops",
            "replies": [
                {
                    "level": 1,
                    "comment": "Re: train, just a shortcut in my writing but I did look up where the train was etc.\n\nGood to know about Nijo. I think I'm leaning toward skipping it anyway.\n\nThanks so much! Yeah I'm curious if I'll have the temple burn out since it is like so my type of thing but it is A LOT but I know for sure my husband will have it, haha",
                    "score": 2,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a good point. Perhaps some people won’t reach burnout level while others might reach it earlier. It’s good to know your limit. It that case, it might be a good idea to allow some time to do separate actives in some time slots during the plan. That way, you could reduce conflict during the trip in case one of you reach burnout level before the other.",
                            "score": 1,
                            "author": "DizzyHoops"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You’ll have to check schedules, but Nijo Castle usually has a light-up festival inside the grounds in November-December, often with hundreds of aquariums of various shapes and sizes and different types of fish (primarily types of bubblehead goldfish) under various colors of lighting. I really enjoyed it pre-COVID, but don’t know if it will start up again this autumn.\n\n[https://nijo-jocastle.city.kyoto.lg.jp/event_info/event_annual_sc/?lang=en](https://nijo-jocastle.city.kyoto.lg.jp/event_info/event_annual_sc/?lang=en)",
                    "score": 2,
                    "author": "Japanat1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Day 2 seems a bit jam-packed with vastly underestimated times for travel as well as sight-seeing. Heian is not a short distance from Yasaka, and giving yourself only 20 minutes to soak in Yasaka is...rushing it tbh. There could be some really cool festival or performance there and lingering to watch or wait in line for some takoyaki would throw your whole schedule off. Taking taxis between all of these locations can add up even if it cuts time a little, and that's if you can find one quickly.\n\nOn the one hand, I found that maps were hard to gauge actual distances between sights, especially in Osaka and Tokyo, but on the other hand some of them \\*aren't\\* in easy strolling distance, and with hills and stairs you're adding time to every walk, never minding the fact you'd have to tell yourself not to stop and glance into a cute shop or a delicious-smelling food stall. Strongly suggest you decide which sights are the most interesting to you (be it for history, beauty, or other personal reasons) and then map based on location. The imperial palace and Nijo are very close by so those make sense, but trying to hit Fushimi Inari AND upper Higashiyama (Yasaka, Philosopher's Path, etc) is already a lot without 6 additional stops. With high tourist traffic it can take upwards of half an hour to walk from Kiyomizudera to Yasaka, and that's if you blitz through without looking at any shops. Now you're tired and annoyed and have you really actually SEEN Kyoto?",
            "score": 4,
            "author": "wakattawakaranai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I had a feeling Day 2 was not going to happen in full for sure, but it's so hard to figure out what to prioritize (Fushimi Inari is a definite for sure), if you have any suggestions.  And I definitely don't want to take taxis all day. Maybe I should look at google earth to get a better feel for the terrain. Like theoretically I know there are hills but it's hard for me to imagine how much as a Floridian lol. \n\nBut you definitely have some good points thank you!",
                    "score": 2,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh man I feel you - I'm from the midwest, so \"hills\" here are not HILLS like they are in Japan. Climbing up Ninenzaka from the Gion area toward Kiyomizudera was an eye-opener to be sure, good thing my bad knee was taped to hell that day.\n\nIf you're not opposed to youtube as a source, I suggest looking up some of the \"walk\" videos, like Kyoto Walk that literally just has videos of them walking around various areas of Kyoto. You'll be able to see the terrain for yourself and also gauge by the length of the video how much time is actually consumed between points A and B. I don't use youtube much but those videos honestly prepared me for Kyoto and Osaka like no blog or photo ever could. It also showed a vast difference between walking through a tourist area or shotengai (shopping arcade) versus just walking on regular residential streets, how you can enjoy the experience without just zooming to a destination.",
                            "score": 1,
                            "author": "wakattawakaranai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's such a great idea! I've seen a lot of those videos come up while looking at other things. \n\nYeah I know I'm so not prepared for all the incline lol. This is really motivating me to try to get in at least a little bit better shape, lol. I've started doing the stairs up and down as much as possible on my breaks at work, lol",
                                    "score": 1,
                                    "author": "LadyBosie"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So the first time I went I started at Fushimi in the morning and spent a few hours there. Then took a cab to Kiyomizu-dera and after that walked through Old Town to get to Yasaka-jinja. I timed it so I got there shortly before sunset so I was able to get photos of it in the day and get photos of it with all the lanterns lit up at night. Then I walked through Gion (the geisha district, very close to Yasaka) and enjoyed a nice dinner there. After that I walked across the river from Gion to Ponto-cho and found some really cool little bars there to end the night. Honestly it was one of the best days ever. I saw a LOT in one day [and got a lot of awesome photos.](https://imgur.com/gallery/30w4EfS)",
            "score": 5,
            "author": "Morningxafter",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a great tip, your photos came out gorgeous",
                    "score": 3,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you! Yeah I basically tried to plot a path to avoid zig-zagging all over town. It was a LOT of walking, but it was totally worth it. \n\nAlso, I recommend NOT skipping Arashiyama. It’s really cool [(Got some really cool photos there too!)](https://imgur.com/a/kazHBj5) and from there it’s an easy cab or train ride to Kinkaku-ji (the golden temple). So pairing those two is a convenient time saver.",
                            "score": 2,
                            "author": "Morningxafter"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some thoughts on your Arashiyama day.\n\nI just went there yesterday and spent half of the day exploring the area. And  I don’t think I covered all of it. \n\nAt 7am, it’s quiet, less people. I get to take good pictures of the Bamboo Forest. I walked through park and ended up by the Oi River. It’s close to the Togetsukyo Bridge. The other side of the river is where the Monkey Park is located. It’s an uphill hike, about 20 minutes or so. This side of the river where most boat rentals are docked is very zen like. \n\nI walked further down the river and saw this sign saying great view up ahead. I followed the sign and hiked uphill. There was a small shrine at the top of the mountain overlooking the city. The view, to say the least, is breathtaking. All I can hear are the birds chirping and the flow of the water coming from the nearby waterfalls.\n\nBy the time I came back to the Bamboo Grove at around 1pm, it’s already crowded. I also saw a line up at Arabica. I was thinking of going there to grab coffee earlier in the day but they don’t open until 9am. I ended up having a cool brunch at this place called Muku. \n\nArashiyama is one of my favourite places in Kyoto. The half-day trip clocked in 12kms in my fitness app.",
            "score": 3,
            "author": "Artistic_Candle426",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beautiful but crowded if you don’t time it right. The walk up to the monkey park will challenge you if you’re not in shape.",
                    "score": 1,
                    "author": "nunudad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I've heard this and watched a couple videos, personally I don't feel like it's quite worth it for the hike compared to some other things so we're probably going to skip it. Not in the best shape now, hoping to be better by then, Japan is definitely working as a fitness motivator more than most things lol",
                            "score": 2,
                            "author": "LadyBosie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are an overplanner you may enjoy making a map of the places you want to go (eg [https://www.google.com/maps/d/u/0/edit?mid=1\\_UIG\\_Pe8\\_Hbg53uYWuQvLIKEbbe-62Bf&amp;usp=sharing](https://www.google.com/maps/d/u/0/edit?mid=1_UIG_Pe8_Hbg53uYWuQvLIKEbbe-62Bf&amp;usp=sharing))\n\nThis helps identify distances and timing.",
            "score": 2,
            "author": "miketheriley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh nice, I have a map with spots marked but never done directions thing before",
                    "score": 1,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m an over-planner too, and I also mapped out must-see and optional temples and shrines for each day, and skipped optional places depending on how things went like what you’re planning here. It worked out fine for us and our plan was quite less ambitious than yours. Just keep in mind how much time it may take to get to each place, how sleepy you may feel in the morning, how tired your feet will be etc. to avoid disappointment. Trying to visit too many places may dilute the experience.\n\nWe visited 3-4 temples and shrines each day on average and didn’t get temple burnout. Each of them has unique characteristics and many have beautiful gardens. It may also be because we’re Asian, we can make the connection quite naturally. I don’t know if you have a budget for this, but a private walking tour with a professional local guide, even for half a day, can enhance the experience if you enjoy temples and shrines. For example, our guide talked about the differences between Buddhism and Shinto, how they co-exist, Zen Buddhism vs Pure land Buddhism, how to walk through torii gates and pray in Japanese manners, etc.\n\nDay 2 looks super busy. 2-3 hours is decent amount of time at Fushimi Inari. I highly recommend planning proper time to enjoy Kyoto cuisine. Proper meals may take 1-2 hours. We love food so can’t imagine a trip to Kyoto without trying local cuisine such as kaiseki, herring soba, mackerel sushi, tofu set meal, Kansai-style unagi and sukiyaki.\n\n\nI don’t see Kinkaku-ji in your itinerary. I personally think it’s worth visiting though some may say what you’ll see will be the same as many photos on the internet. I enjoy seeing it in person, viewing from different angles and analyzing the architecture. Initially, I thought it would potentially be a disappointment when planning but I was glad to visit it. Try to come early morning or late afternoon to avoid big crowds.\n\nDay 4 looks packed too. Otagi Nenbutsu-ji and Adashino Nenbutsu-ji took us 45-60 minutes each. After visiting Adashino, we walked past the crowded and touristy bamboo forest and felt no need to linger there. The serene atmosphere at Adashino bamboo grove was way better.",
            "score": 2,
            "author": "Midna2910",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much! Yeah I expected I wouldn't be able to hit everything, but I'm glad I posted because people have pointed out so many things I wasn't considering that you couldn't rely on google maps for. I'll definitely look into the tour! Thanks your insight on Day 4 is especially helpful!",
                    "score": 1,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can chime in on day 2 as I am in Kyoto right now, and have literally just done a version of your day! We got up at 5am, and arrived at Fushimi Inari at 6:15am. It was perfectly quiet, we had a super, but very tiring walk up! We left about 8:30, arrived back to our accommodation near Kiyomizudera at 9:15ish, and had a cup of tea, a shower, and a rest. \n\nWe left for Philosophers Path at 11:30, and stopping for lunch on the way started the walk at the top at Ginkajuji at 1pm. We walked down the path, spent time in a couple of nice shops, had a coffee, and saw Honen-in and Otoya-jinja By 3:30pm we had only just left the latter, and decided to make our way home having done 20,000 steps already! \n\nThe three temples we saw this afternoon were all lovely, and I would recommend them all. Otoya has a super cute mouse goshuin design if you collect those (and as a shrine/temple lover, if you don't, you should look in to it on this sub!).\n\nI think you have a lot planned, so I'd build in a little rest into your morning, and start at Ginkakuji when you're ready and work your way down, because that's a 'not to be missed' IMHO. The walking map lies about the time it will take you, because you're not on a mission walking from A to B, you're strolling and admiring and taking side routes into temples! \n\nIt's also worth me saying that we're on day 13 of the trip, and fatigue is setting in, so if it's earlier in the trip for you, you may find more energy!",
            "score": 2,
            "author": "Marilliana",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much I love this insight!  I don't think I'd realized how many shops were also around there.  And yeah, I'm definitely learning that google maps lies a lot hahah\n\nAlso, nice! 13 of how many? Just curious. We'll be there from day 6 so hopefull that'll help a lilttle! haha",
                    "score": 1,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "okay, I may have some input here.\n\nfirst thought, first paragraph in\n\nplaning early is not bad, and being very detailed on paper can be a great thing, but I caution you, plans might not work, and or being too rigid may actually prevent you from experiencing great things\n\nnow, a lot of temples in kyoto. there is a thing called temple fatigue. not everybody gets it though. you seem aware so I will not lose another word about it\n\nokay next thoughts, going into your actual plan\n\nday 1, you come from tokyo. exploring the area, you know about nighttime illumination at kodaiji, plan on going, great.  \nbe aware, it could be FULL, as in 2-3h long wait until you get in. you might want to also see entokuin while you are there...\n\nday 2, 6am start.\nyou know, it sounds so easy. \"start early\" \"you can do fushimi 24/7\" getting up to depart at 6am is a lot harder than it sounds, especially when you have been doing 10k+ steps, and when you have been doing full days since you arrived.  \nits hard to estimate how long you will need for a shrine. it depends on how fast you walk, how long you sit down, if you will eat something on the hike, but 3h seems a reasonable estimation for rough planning  \nyasaka btw you can also visit in the evening if you dont need the food stalls. pretty lights. \noh boy, time estimation for heian... you know, it depends, will you see the garden? you can hop in, and leave in 15min, or spend over an hour going through the garden...\nnow I will admit, even though I know a lot of temples, i dont know the others by name on your list.  \nit sounds overly ambitious. but I know if you walk along the route and are able to duck in and see some temple/shine you can actually see a good number in a day, so I wont say its not possible.  but I would advise you to have a backup plan, even if that is just \"well then i wont see them\"\n\nday 3: \neverytime I went to the imperial palace it was closed for the public. nijojo was good. and option 2 would still allow for the kiyomizudera at 8:30 pm . you might still find some time for exploring some more of kyoto with imperial palace and nijojo. \noption1. botanical gardens may be great but in october, november... thats possibly very disappointing... \n\nday 4:\nwhen you exit tenryji garden you will stand at the entry of the bamboo grove. and you will need to go through it to get to the entry of okochi sanso garden, so no \"will skip if too busy\".\nand while adashino has a prettier bamboo piece, if you lack time and stand at tenryuji and you want to see okochi, I am not sure its neccesary or even too practical to rush up to adashino.  \nthe rest of your day very ambitious, I think you probably wont make it to adashino, or nenbutsuji. and when you start walking up there you might find other POIs. I advise to follow those and find some maybe hidden gems, even if it means you wont see it all.\nseeing all of arashiyama is not possible in 1 day. i am not sure 3 days will suffice\n\nday 5 looks okay, but, even though it looks simple, its still plenty to juggle\nchecking out, what about the luggage?  \nthen heading to daigoji, sure. it is a bit out of the way though. but after, going to nara. now, its okay, makes sense, you are already in south-ish kyoto, but, you probably need to spend time and effort to get back to a place where the train to nara can get you.  \nso you make it to nara. you get to the park, good. to get to kasuga taisha, you have to walk through a lot of the park.  \nwalking back to the brewery, and from there you need to get to a train station which connects to osaka.\nbring good shoes.\n\nhope that helps. sorry that i cant give you \"that will take 67minutes\" estimations.",
            "score": 1,
            "author": "catwiesel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! That was very helpful. I'm glad I posted here because there is so much stuff I didn't take into consideration. I plan pretty much every trip like this but I have a lot better feel for what to expact with how long things will take, what the terrain is like etc. for the places I've traveled in the US so it's definitely very different.\n\nRe: Luggage, I was thinking about this too. I keep seeing posts about how easy it is to get luggage shipped ahead, but I haven't gotten into looking at this in detail yet. And someone else thought that + Nara might be too much. I could def see it changing.",
                    "score": 1,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just chiming in a bit! I agree with most everything catwiesel said as it’s pretty much spot on, except with the imperial palace, I’ve never had issues getting in during opening hours. I’m not sure if you were here during/post-Covid times? I believe it’s closed on Mondays, but otherwise open. The opening times are here:\n\nhttps://sankan.kunaicho.go.jp/multilingual/lang/en/information.html\n\nAlso with the botanical gardens, it’s pretty flexible year round. I went in December last year and the rose garden and autumn momiji were beautiful, but when I went again in March the rose garden was dead but the camellia section and the cherry blossoms were really pretty. There’s also a greenhouse there with tropical plants which (I assume - I’m no plant expert!) is good all year round. In October/November, if the autumn momiji is still going on, it might be really pretty there, but I do agree that it’s worth checking online in advance to avoid disappointment.\n\nFor the Kiyomizudera night illumination, I would be cautious as well. I’ve tried to go multiple times in my time here and it is always absolutely rammed haha, and we got there just after sundown at around 5pm-ish last November. The crowd was so big we couldn’t even see the queue, so we ended up giving up and heading back down. Some of my friends have made it in though, so I guess it is possible!\n\nAs a quick note on your Yasaka Shrine visit, it’s very close to Gion/Kiyomizudera and almost forms part of the route down through Higashiyama, so it may be worth moving it to your first day if you’re in Gion anyway. It’s quite a trek from philosophers path in my opinion! OtherwiseI I echo what catwiesel said, it’s probably worth making sure you won’t be too tired before/after fushimi inari as it’s an exhausting trek haha.\n\nHope you have a great trip here, you seem super organised!",
                            "score": 1,
                            "author": "Snowleetah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks so much, great tips!",
                                    "score": 1,
                                    "author": "LadyBosie"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Question - do you think there'd be any difference in crowds if I switched Arashiyama to Friday instead of Saturday or not really?  My Friday was the most up in the air and I originally made it that way to have a buffer day between getting up super early for Fushimi Inari and then for Arashiyama but if it makes enough difference I'll do two super early days in a row haha",
                    "score": 1,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "in theory, yes, the weekend is supposed to be more busy\n\nhowever, I think there are other factors like weather, season, public holidays/time of year, which seem to be much more pronounced\n\nin essence, the difference between weekend or not seems to be miniscule, to the point where I am not sure I ever noticed a difference. keep track of it though to make sure whatever you may want to do is not closed.",
                            "score": 1,
                            "author": "catwiesel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay thanks! I've already made a lot of changes hugely helpful",
                                    "score": 1,
                                    "author": "LadyBosie"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Day 3, start by renting bicycles or E bikes.  Then plan your day accordingly now that you have a flexible mode of transportation (faster than walking yet you can stop anywhere).  I highly recommend you use the river as much as you can while cycling.  It's one of the best experiences I've had there.",
            "score": 1,
            "author": "JesusChrisAbides",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much! I was thinking about that for some of the trip for sure!",
                    "score": 1,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha, I figured a lot of people would say that. But I really won't be upset. I'd just rather have too much to do than be like crap we've walked around this area 5 times and now I have to spend time googling where to go. I plan every trip this way and so far so good, my husband is not into such meticulous planning so I always know at some point we'll be going off script. Plus I find it nice that if like, something's rained out one day and we didn't do something the other day because we ran out of time, I know exactly what to switch it with.\n\nI'm sure he'll definitelly make us have time to wander, though idk getting off at a random stop might be a little too scary for me lol\n\nRe: Golden Temple. Yeah I'm so on the fence about this. It looks beautiful but I've read a lot of people who say it was kind of overwhelming because it's basically one photo op and not near a lot of other stuff which has made me want to skip it but then people keep yelling at me that I can't lolol",
                    "score": 1,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m going to Japan in July and would love to hear more about your trip! Have you done any research on onsens? I’m going to Tokyo, Kyoto, Osaka and Mt Fuji - would love to share trip plans!",
            "score": 1,
            "author": "OhHolyOpals"
        },
        {
            "level": 0,
            "comment": "For the autumn night time illuminations...they get extremely crowded. I was there last November when the supposed foreign tourists numbers were still recovering and it was packed to the brim. It was worth it in the end but being mentally prepared for the crowd might help.\n\nThe Sagano Romance train I would highly recommend making reservations ahead. \n\nFor Nara, it's best to get there early. The deers lose interest by the afternoon after they've already been well fed, you might still find deers willing to take your treat but it will be harder.",
            "score": 1,
            "author": "McClumsy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "LadyBosie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve travelled a lot and to be honest. Sure make plans for a few places and do that. Also just wonder around. I always see these crazy detailed itineraries and it blows my mind. The best food I’ve ever had was always a random place. Best shops were always random not something off trip advisor. I get the excitement but are you really enjoying if you have a crazy set schedule? Japan is amazing, but all of my best memories or food has been down random streets.",
            "score": 1,
            "author": "IMB88",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mostly agree for food and drink and shopping. I usually put a few places I've heard good things about just in case we're not sure what to do but typically don't super stick to that part",
                    "score": 1,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah there’s things I definitely wanna see but a little of both seems to be the best mix. Honestly the food in Japan is so good it’s hard to go wrong. Kyoto has a bunch of really popular places that always have lines, I just can’t do that more than once. Anyways you’ll have a blast. It’s an amazing country.",
                            "score": 1,
                            "author": "IMB88"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey! My husband and I literally got back from 4 weeks in Japan including Kyoto (and we stayed in that hotel), your planning looks seriously great and I strongly second factoring in using buses not relying on the trains in Kyoto (they're good, but can't get you everywhere). We found the buses really easy to use with an IC card and google maps was the most reliable tracker for stops. I'm in no way an expert but also a massive planner so v happy to chat if there's anything I can help with, it wasn't our first trip there and I love the city. Hope you have a super time when you go!",
            "score": 1,
            "author": "glasswig",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so glad to hear the buses were easy, I'm actually really nervous about them! What were your favorite things in Kyoto?",
                    "score": 1,
                    "author": "LadyBosie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you'll be totally good - buses are straightforward. get on in the middle, off at the front. pay the fare as you're getting off (either in exact coins or swipe your IC) and say thanks to the driver (always!). nearly all of the signage/announcements are bilingual Japanese/English in Kyoto too, so if you don't know much Japanese you'll be okay.\n\nsights: Fushini Inari! one of the most incredible places in Japan, absolutely worth it and definitely aim to be early. Kinkakuji also fab in my opinion. Loved Toji + its Sunday market. Shosei-en is my favourite garden, it's a bit small but an absolute oasis, Kyoto railway museum was worth the trip for something a bit different. \n\nDepending on your food preferences, I'd recommend a trip to Pontocho. It's very touristy but we really enjoyed the experience/novelty. Otherwise, had some great (a bit more veggie-based) meals at Mimiko and Kitchen Bonasai. Actually enjoyed more cafes than restaurants to be honest. We also walked up the Kamo river from Shichijo to Gion which was gorgeous in the sunshine, not very busy at all when we went, and a really nice way to see another side to the city.",
                            "score": 1,
                            "author": "glasswig"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone in Kyoto right now, the temples start to look the same after a while. We ended up doing 2-4 must-see temples a day along a route with other things to mix it up. Unless you are a huge fan of temples/shrines/history, I would pick a few standouts that you absolutely can't miss and explore other parts of the city in between. You will undoubtedly stumble across more unexpected temples in your exploring. \n\nI am also a big planner and my itinerary was incredibly overcommitted. I narrowed it down the closer we got to our trip when I realized how much transit time (and walking) it was going to take just to get to all of them.",
            "score": 1,
            "author": "missashley21"
        }
    ]
}