{
    "id": "13uabqb",
    "score": 2,
    "title": "3 weeks itinerary review in November",
    "author": "jeremybarbet",
    "date": 1685305845.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13uabqb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi there!\n\nWe are a couple planing to visit Japan for the first time in November for 3 weeks. We put together a first draft of the itinerary we are thinking about.\n\nA quick word about us. We are in our late 20s, we love food, nature, explore local small town, not big fan of big city and crowded places. We would rather take our day lights and spend our time well in each location. We will fly in Tokyo and fly out from Osaka. \n\nWe would also like to take this trip slow. Allow us to rest and chill in some nice hotels in the country-side.\n\nWe are not so sure about day 13 to day 15 in Hiroshima as sights we found are not very attractive to us. We would love to get some recommendation of places to  visit between Tokyo and Osaka. \n\n- Day 1: Arrive and stay in Tokyo\nLand into Tokyo around 3pm\nActivate our JR pass\nGetting Sim card + wifi\nHead to our hotel in Shinjuku area\n\n- Day 2:  Stay in Tokyo\nExplore Tokyo\n\n- Day 3: Leave Tokyo - Stay in Hakone\nLeave Tokyo to Hakone\n\n- Day 4: Stay in Hakone\nTake train to Saiko\nVisit Saiko Iyashi-no-Sato Nenba (Traditional Japanese Village)\nHike up in the area for a view over Mont fuji\n\n- Day 5: Stay in Hakone\nSpend the day around the hotel and surrounding\n\n- Day 6: Stay in Hakone\n30mins drive to Ashigarashimo District (we are thinking about taking a taxi but would appreciate some recommendation)\nHike around Lake Ashi\nStop by Narukawa Art Museum\n30 mins drive back to hotel\n\n- Day 7: Stay in Hakone\nRest day and enjoy the day at the hotel and surrounding\n\n- Day 8: Leave Hakone - Stay in Kyoto\nHead to Kyoto with Shinkansen, check into the hotel and spend time around the hotel\n\n- Day 9: - Stay in Kyoto\nKiyomizudera Temple\nGion Neighbourhood\nHokanji Temple Pagoda\n\n- Day 10:- Stay in Kyoto\nFushimi Inari Taisha\nNishiki Market\n\n- Day 11: - Stay in Kyoto\nDay trip to Kibuya No Sato\n\n- Day 12: - Stay in Kyoto\nArashiyama Bamboo Grove\nTenryuji Temple\nZen Garden\n\n- Day 13: Stay in Hiroshima\nHeading to Hiroshima\nAtomic Bomb Dome\nHiroshima Castle\nShukkeien Garden\n\n- Day 14: Stay in Hiroshima\nMiyajima\nHike to Mount Misen\n\n- Day 15: Leav Hiroshima - Stay in Osaka\nHeading to Osaka\n\n- Day 16: - Stay in Osaka\nExplore Osaka\n\n- Day 17: - Stay in Osaka\nDay trip to Nara\n\n- Day 18: - Stay in Osaka\nDay trip to Kobe\n\n- Day 19: - Stay in Osaka\nExplore Osaka\n\n- Day 20: \nExplore Osaka and prepare for the flight home.\n\nThat's our first draft of the itinerary and would welcome any feedbacks on it.\n\nThanks in advance,",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "&gt; Stay in Hakone Take train to Saiko\n\nPlease note this is an extremely convoluted journey by public transportation involving several transfers. The village also seems very duplicative with Kayabuki No Sato (Day 11) except for the Mt Fuji view which can also be caught from Hakone. I would simply delete the Saiko detour (and shorten Hakone, five nights is far too much even for an ardent relaxer).\n\n&gt; Hiroshima/Miyajima are not attractive\n\nIf you seriously like villages with old huts, Tsumago-Magome is quite popular as are villages around Takayama (Shirakawago is a zoo but okuhida onsen and such can be nice).",
            "score": 6,
            "author": "tribekat"
        },
        {
            "level": 0,
            "comment": "I'm not on Team Hiroshima, I totally get what you are saying.\n\nFor your declared preferences, you are spending most of the trip in big cities, excepting only the biggest city -- this makes no sense to me. (To me personally, Osaka actually *feels* like a bigger city than Tokyo due to the city architecture and layout.)\n\nHakone is a tourist onsen town, not the countryside IMO. And, no matter how slow you like it, you are spending a crazy amount of time there. There's just not that much to do, even if you love relaxing.\n\nAre you comfortable renting a car? Consider a nice little Wakayama road trip. Osaka --&gt; Koyasan --&gt; one of the smaller onsen towns (e.g., Ryujin) --&gt; Kumano Hongu Taisha --&gt; return to Osaka via Yuasa, where you can see some soy sauce related stuff since you say you are into food. Not exactly sure what the weather is like in Wakayama in November, but it shouldn't be a problem. Would probably be able to still do a fruit-picking experience too (kaki? citrus?). \n\nKoyasan, despite being touristy, is super serene. And once you get past it, it quickly gets very rural and nature-y.",
            "score": 4,
            "author": "tdrr12",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s actually a very good point. We also want to experience big cities of Japan but we might have schedule too much time staying there. Thanks we will amend some changes. \n\nThe Wakayama road trip looks interesting. We will look into that as well. Thank you for the recommendation",
                    "score": 1,
                    "author": "jeremybarbet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;The Wakayama road trip looks interesting. We will look into that as well.\n\nIf you do decide and have questions, lmk via DM. I can give more specific recommendations for the area.",
                            "score": 1,
                            "author": "tdrr12"
                        }
                    ]
                }
            ]
        }
    ]
}