{
    "id": "13utmgv",
    "score": 54,
    "title": "Japan Trip Report: Keeping Strictly Kosher in Japan &amp; More!",
    "author": "Defiance42",
    "date": 1685363581.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13utmgv",
    "media_urls": [],
    "other_urls": [],
    "postText": "# Tokyo-Lake Kawaguchiko-Kyoto-Osaka\n\nThe trip was my wife and I (upper 20s/lower 30s) for 10 days (not including 2 flight days) in May just after the end of Golden Week. It was our first trip to Japan and we had an amazing time! We did a lot of the standard tourist activities, but our perspective as kosher-observant travelers is a bit more unique so I figured I'd start the post with it. Feel free to skip past that section if it doesn't interest you.\n\n**Keeping Kosher and Sabbath Observance in Japan**\n\n* While there are a decent number of vegetarian/vegan (which some kosher-observant people would be comfortable eating at, though we were not) and a small number of Halal restaurants in Japan, kosher-certified establishments are basically non-existent. The Tokyo Chabad in Minato does run a kosher-certified restaurant called Chana's Place (they deliver as well) and some of the other local Jewish communities also have prepared meals you can pick up or have delivered to you. We didn't really take advantage of any of these so I can't personally vouch for them though.\n* Every hotel and ryokan we stayed in had mini fridges as well as electric water kettles, which we relied on heavily to prepare food. We usually mixed some couscous or other easily cooked grain we brought with us along with some locally bought produce in a food thermos for hot meals (the daikon are so big, just half of one lasted us for days). Seasoned kosher travelers will likely have their own strategies, though if you can, staying somewhere with a kitchen will definitely expand your meal options. We had a pretty action-packed schedule, so we didn't opt for this this time, but if we ever go back to Japan, we'll likely make sure we're staying places with kitchens if possible.\n* Though we couldn't eat almost any of it, the food in Japan all looks and smells amazing (with the possible exception of some of the more exotic seafood). The smells wafting from the bakeries were absolutely heavenly. If you're kosher observant and traveling in Japan: be prepared for some major food FOMO. Salmon sashimi was one of the only local foods that fit our kosher diets, and the sashimi I got from one of the stands in Nishiki market was absolutely delicious.\n* We were only in Japan for one Saturday and spent Shabbat (Sabbath) near the Tokyo Chabad in Minato. Prayers and meals at the Chabad were a really wonderful experience, with a lively and jovial atmosphere and lots of different Jewish people who were visiting (or living in) Tokyo for a variety of reasons. We stayed in a very nice Airbnb close to the Chabad. If you are visiting Japan and want a place close to the Chabad to stay, feel free to DM me (I'd rather not post more info about a family-run Aribnb to a public forum).\n\n**Tourist Tips and Cultural Observations**\n\n* The discount bus between Narita airport and Tokyo station is really great. We took the NEX from the airport but lost our paper return tickets during the trip so ended up taking the bus back. It was about as comfortable, much cheaper, and only a little bit slower.\n* Though most of the COVID restrictions have been lifted, masking is still very common in Japan, especially in busy urban areas. I'd estimate about 80% of the locals were wearing masks on public transit in Tokyo. In less crowded areas, fewer people are wearing masks, though a notable minority definitely still are.\n* Public transit in in Japan is a real wonder to behold. It is extremely efficient, was almost never late, with a very different etiquette from in the West. Very orderly lines form at the marked spots where the train doors will be when the train stops. On the train itself, people are very quiet, with the only exception being some soft conversation between friends and the occasional group of rowdy foreigners. \n* Google Maps worked great for us in terms of navigating public transit, though moreso in Tokyo than in Osaka, which seems to have a slightly more confusing train system.\n* Navigating Kyoto is a bit harder since the train system isn't quite as extensive there. IC cards will work on the buses, though we were a bit thrown off by the fact that everyone enters through the back door of the bus and exits through the front door. You pay the bus fare as you leave the bus and not as you get on. Friends of ours recommended renting bikes in Kyoto if the weather is nice, and while we didn't end up doing it, it's probably not a bad suggestion.\n* Were were told that the Arashiyama bamboo forest would be packed if we got there too late, but this wasn't the case for us. We got there around 10:00-10:30 and while there were plenty of people, it didn't feel overly crowded. Could be a different story during busier times, but this was our experience.\n* We took the Tokaido Shinkansen and it's a very cool and comfortable way to travel. We ordered our tickets online and were able to link them to our IC cards. There seemed to still be enough of seats available when we booked, though if you're looking for a specific seat (such as the ones with the extra baggage area) you should probably book as much in advance as in practical since a lot of the seats were taken even a few days in advance.\n* A lot of people on this forum emphasize how few Japanese people speak fluent English and it's definitely true! I expected as least the staff at hotels to speak some English, but very many did not. I was also surprised that when interfacing with a member of the hotel staff who didn't speak English, they never called over a colleague to translate or take over. I know a handful of Japanese words and phrases, and combining those with gestures and Google Translate generally worked well enough. On the rare occasion I tried to say anything a little more complex, people seemed really pleased and encouraging, even though I’m pretty sure I was butchering the language.\n* Although most people in Japan don't speak English, signage and automated announcements on public transit and the like generally do have English translations.\n* The public bathrooms in Japan are very common and almost always super clean (even the less clean ones are still cleaner than the average public bathroom in the U.S.). Not sure if this is due to COVID or not, but paper towels are virtually nonexistent and hand dryers are rare. Luckily, small hand towels are sold all over and the themed ones make great souvenirs. \n* Pretty much every Western-style toilet is equipped with a bidet. The Japanese-style toilets didn't seem to exist much in Tokyo. We saw a few in Kyoto in Osaka, but neither of us were brave enough to actually try using one...\n* The fruits and vegetables sold in Japanese grocery stores are all beautiful, pristine and usually taste pretty good too. Some of the more “exotic” fruit can be pretty expensive though (I saw a single mango being sold for nearly 3,000 yen!). The individual wrapping of everything definitely didn’t seem too environmentally friendly, but it did keep all the produce super clean.\n* I loved seeing the Gachopon machines everywhere and got quite a few souvenirs from them. There are some stores dedicated to the machines, but you can also find them in train stations and just about everywhere else.\n* Takyubin is super convenient! We took our luggage with us to and from the airport, but used takyubin to get it between our hotels. It's a great service and well-worth the money. There are a lot of coin lockers in Japan and they work fine for backpacks and carry-on suitcases, but if you're lugging around anything larger than that on the trains, you're going to feel pretty silly. Trust me, and use takyubin.\n* A tip: If using booking.com (or another site that offers it), print out your hotel reservations in Japanese and bring the paper copies with you. We used these print outs multiple times when checking in, telling cabs where to go, and showing hotel staff where to send our bags next with takyubin.\n\n**Hotel Reviews**\n\n* Hotel Monterey Akasaka: Friendly staff, clean and nice rooms. Location is just fine, but in return it's cheaper than similar quality hotels in more popular neighborhoods while still being fairly central and accessible.\n* Kasuitei Ooya (Kawaguchiko): Out first ryokan of the trip and really nice. Great views and excellent onsen.\n* Hilton Tokyo Bay: Cheaper than all of the \"official\" Disney hotels, but just as close to the parks as many of them. The rooms are nice and spacious. Can definitely recommend.\n* Yuno Yado Shoei (Kyoto): Our second ryokan and not quite as nice as the first, but still really enjoyable. The onsen were great here too.\n* Liber Hotel at USJ: Far fancier than we thought it would be based on the price tag and the fact that it's a theme park hotel. The rooms are smaller than the Tokyo Bay Hilton's were, but the facilities were quite nice. Enjoyed my last onsen of the trip in this hotel.\n\n**Trip Highlights**\n\n* Harajuku: We went to Harajuku more for my wife who is into fashion, but I really enjoyed it too! Lots of really cute stores and it's also fun seeing people dressed up in some really bold and unique outfits.\n* Lake Kawaguchiko and the Shibazakura Festival: We were fortunate to have amazing weather while we were in Lake Kawaguchiko and the views of both the lake and Fuji-san were spectacular. The Shibazakura festival specifically provided some really breathtaking views. This was probably our favorite part of the whole trip.\n* Tokyo Disney (Disneysea): As a huge Disney fan, I loved seeing the Japanese take on Disney parks. Lots of familiar rides, but lots of unique ones as well. The evening show on the water at DisneySea (\"Believe: Sea of Dreams\") was particularly fantastic.\n* Higashiyama and Gion: The most amazing area in Kyoto. I regret that the we didn't budget more time to spend here. You could definitely spend at least a full day wandering around soaking in the atmosphere and unique architecture.\n* Universal Studios Japan: As a theme park fan, USJ was a real treat. Super Nintendo World was definitely the highlight, but the entire park was fantastic. I might make a post just dedicated to giving some tips for the theme parks at some point.\n\n**Slight Disappointments**\n\nWe enjoyed everything we did in Japan, but I'll just point out two things that didn't quite live up to expectations.\n\n* Akihabara: I'm an anime and video game nerd, so I thought Akihabara would be my heaven, but it was just okay. The arcades were really amazing to walk through and it was fun browsing the video game and figurine stores too, but something about it didn't quite live up to what I had imagined. Maybe just blame it on high expectations?\n* Teamlab Planets: This was definitely a cool and unique experience, but it didn't quite live up to the hype. It felt like the most touristy thing we did in Japan (even moreso than the Tokyo Disney somehow). The exhibits themselves are very cool, but the all the amateur Instagram models posing everywhere kind of ruined the vibe. Really enjoyable, but can definitely be skipped if you're on the fence.\n\nI struggled to list any disappointments whatsoever. We had a really amazing time overall. Not sure when we’ll have a chance to go back, but I hope we get to one day!\n\nEdit: Added some tips related to takyubin. Can't believe I forgot!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Respect for being Kosher, from a Muslim.",
            "score": 2,
            "author": "omaralzz"
        },
        {
            "level": 0,
            "comment": "Sounds like you had a great trip, i will be looking forward for de USJ tips!!",
            "score": 1,
            "author": "AcanthocephalaNo5310"
        },
        {
            "level": 0,
            "comment": "Cool, sounds like you were in Japan the same time my wife and I were! It was an educational read, especially as someone else who follows dietary restrictions. I'm still working on the trip report, but you are right, there were halal options out there! \n\nAkibahara also felt \"mid\" for me, but did you pickup any merch/souvenirs, and if do, what was your favorite?",
            "score": 1,
            "author": "Luxniom",
            "replies": [
                {
                    "level": 1,
                    "comment": "We got a fair amount of souvenirs on the trip, but not too much from Akihabara specifically. I got a set of D&amp;D dice and a few gachopon toys, that was about it. I also spent too much playing some claw games, but didn't end up winning anything...",
                    "score": 1,
                    "author": "Defiance42"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For Yuno Yado Shoei (Kyoto), are the onsens private for each room or shared?\n\n&amp;#x200B;\n\nAlso you bought some of your own food from your home country ? Did you have any issues with customs?",
            "score": 1,
            "author": "qsub",
            "replies": [
                {
                    "level": 1,
                    "comment": "The onsen there are public. \n\nI checked the customs guidelines before we arrived. All the food we brought was packaged and non-perishable. No produce or dairy. Customs didn't give us any trouble.",
                    "score": 1,
                    "author": "Defiance42"
                }
            ]
        }
    ]
}