{
    "id": "13wgz1g",
    "score": 45,
    "title": "Trip Report: 14 days end of spring trip, 9 pax, Tokyo and Hokkaido!",
    "author": "ifailedmaths",
    "date": 1685524032.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/13wgz1g",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'll try to be as brief as I can, otherwise this post will become an essay of me trying to promote Japan as the best vacation destination I have ever been to.\n\nTLDR; Japan is great!\n\n**Background**\n\nThe trip took place from 13 May 2023 to 27 May 2023. 9 people, ages ranging from late 20s to mid 60s, family from both my side and my wife's, took part in this trip. The 4 youngest members, including yours truly, planned for everything in this trip which includes the hotels, places we visits, international flights, domestic flights, meals, routes to take. It also helps that our youngest member is fluent in Japanese, while the rest of the youngsters can understand simple Japanese, thus YMMV.\n\n**Tokyo (13 May - 18 May 2023)**\n\nTokyo was probably the most hated part of our trip as it involves a lot of walking. And the 5 old people were definitely not keen on walking much. So we really had to spend a lot of time looking for places to chill after half an hour of walking, which really slows us down. Even in train stations, we had to look for elevators since they were unable to climb stairs. There were really a lot of stairs in Japan.\n\nAnyway, for the most part, we stayed in Kyobashi in Tokyo. We chose this area as it provides direct access to Haneda Airport via trains. It was also really convenient as every location we went to in Tokyo was accessible from Kyobashi Station, requiring little to no transfers.\n\n**A short review of places we went in Tokyo**\n\nAsakusa - It was crowded on a Sunday. Sensoji was nice to look at. Lots of street food around the area if you explore west of Nakamise Street. Kappabashi Dougu Street sells kitchenware and handmade crockeries, which are slightly pricey but good additions to my dining set. Spent around 5 hours here.\n\nUeno Zoo - Oldest zoo in Japan. Houses many animals that we don't see in Singapore, like the snow monkeys and shoebills. Pandas were definitely the main attraction. We queued for 15 minutes just to see them for 3 minutes. There is a system in place so that panda viewing is not overcrowded. In total, we spent almost 5 hours here.\n\nAmeyoko Street - Shopping street. We just walked through this stretch after Ueno Zoo when everyone was tired. It was quite a touristy place where we did not find it interesting.\n\nMeiji Shrine - Very beautiful shrine. Everybody enjoyed the walk from Harajuku Station to the shrine. The canopy provided shade on a hot day. Coupled with the cool weather, the walk was pleasant. We were also lucky enough to be able to witness a wedding ceremony happening at the shrine while we were there. Get your Omikuji (fortune slip) for JPY200. It comes with English translation.\n\nHarajuku - Very hip shopping street. We were just here for Marion Crepes, nothing else. But if you are into fashion, feel free to spend time shopping here. The clothes are relatively cheaper as compared to places like Uniqlo.\n\nShibuya - A lot of construction projects are happening now at Shibuya, so it was slightly harder to get around. We went to a planetarium, and sat down for a \"show\", which was all voiced in Japanese, no subtitles. Very cool even if you don't understand anything as the start of the show basically placed you right in the heart of Shibuya, and allowed you to see the skyline. The youngsters also had a chance to go to the Pokemon Centre and Disney Store to do some light shopping. Go if you like these kind of things. If not, I would recommend skipping them.\n\nTsukiji Market - A local, slightly more touristy fish market. A lot of fresh seafood to try. Uni (Sea urchin) was in season. The most popular items were the tamagoyaki (rolled egg omelet) and hotate (scallops). We also ate at a local sushi restaurant and I had my first horse meat sushi. The chef even advised me that I should eat it without soy sauce. Very cool experience, probably something I'll never try if I did not go to Japan.\n\nAs you can see from above, we didn't go to many places in Tokyo as the oldies were pretty much restricted by their physical abilities to take long walks. I should also share that eating out is more expensive compared to Singapore (where we are from), with each meal costing around JPY1500 or more per person.\n\n**Hokkaido (18 May - 27 May 2023)**\n\nHokkaido was really the highlight of this trip. It was clear that everyone enjoyed Hokkaido more than Tokyo. For the domestic flights, we flew via Air Do. To get to Hokkaido, we flew from Haneda Airport to Asaikawa Airport. To get back to Tokyo, we flew from Hakodate Airport. In addition, we rented 2 cars to fit 9 people, with 10 medium to large sized luggage. The distance between each city was usually about 2 to 3 hours drive. Essentially, we went from the west of Hokkaido to the east. So.. That definitely took a long while. so I'll break down the locations by cities.\n\n**Monbetsu (18 May - 19 May 2023)**\n\nKamiyubetsu Tulip Park - A tulip park recreated to make you feel as if you were in The Netherlands. Very pretty place especially when all the tulips were in full bloom. We spent about 2 hours here just taking pictures and taking in the view.\n\nTakinoue Shibazakura Park - A park where everything is pink! I have never seen a place so pink. We missed the sakura season in Tokyo but managed to catch the blooming of Shibazakura instead. It is really a sight to behold. In the park, if you are able, I would recommend climbing all the way to the bell to get a stunning view of the whole place. There is also a 3 minutes helicopter ride for JPY600 per person to get an aerial view of the park.\n\nThe tulip park was the reason why we drove 3 hours to the small town of Monbetsu. I think the drive was worth it if you like looking at flowers in full bloom. On a separate note, I have been to Monbetsu on another trip in 2019. There is a crab claw statue, a sea ice musuem and a seal sanctuary to visit. The town is not as boring as one might think.\n\n**Asahikawa (19 May - 20 May 2023)**\n\nRamen Village - Just a place where 8 ramen restaurants set up shop. I highly recommend eating shoyu ramen in Asahikawa since that's what they're famous for.\n\nOtokoyama Sake Brewery and Museum - It's in the name! Go here if you like sake. There's free tasting. The museum portion just showcases equipment used in the brewing process. It even shows how it was brewed in the older eras. There is also a tap where anyone can collect the spring water that they use to brew the sake. So.. BRING YOUR OWN BOTTLE!\n\nTakikawa Canola Festival - We were just in time for the event. Canola (oil?) is the main export of the town of Takikawa. The festival only runs for 2 weekends. We were lucky to have been able to see this. Anyway, the festival was packed with people. So to alleviate overcrowding at the fields, the organisers did not allow people to go to the fields directly. Everybody is required to go to the festival location and take a shuttle bus to the fields. The bus timings were about 10 minutes from the next one, so even if the queue was long, we didn't wait too long. With any festival, there will always be snacks and other merchandise. Feel free to buy them and support the locals.\n\n**Furano (20 May - 21 May 2023)**\n\nNingle Terrace - I think there were a total of 18 small craft shops in the area. Anyway, it's a place where you'll want to go after it turns dark. That's when the fairy lights come on and make it look magical. Personally, I wasn't into the crafts. But I bet they will be good decorations for your office desk or home.\n\nFarm Tomita - A farm famous for lavender. It was raining heavily when we were there. So.. It wasn't a great experience. Coupled with the fact that lavender wasn't really in season, we could only see a small patch of purple. Potatoes here were great though! I would recommend getting some potato wedges or croquettes as snacks.\n\nFurano Cheese Factory - We went there on a weekend. So, there was pretty much no production viewing. But no loss, since we were actually there for the pizza! The whole complex, including a pizza cafe, ice cream shop, factory and museum is nestled in a small woodland area. So you get to enjoy pizza and ice cream in the great outdoors! I highly recommend the pizzas.\n\n**Sapporo (21 May - 23 May 2023)**\n\nTanukikoji Street - Shopping street! There's a Mega Don Quixote if anyone's interested. Otherwise it is really just another shopping street. What's cool about it is that there is also an underground mall that's linked to Susukino Station. So, you can shop above and under ground.\n\nNijo Market - A fish market just like Tsukiji Market but on a smaller scale. It was already past noon when we reached so most shops were closed or closing. The local shopkeepers here were friendlier though.\n\nOdori Park - We took a 15 minutes walk from Sapporo Station to this park. It was not very impressive without sakura blooms or festivals. The iconic Sapporo TV Tower was at the head of the park. We chose not to go up the tower as we went somewhere higher.\n\nJR Tower 36 - I believe this tower is taller than the Sapporo TV Tower. It costs JPY600 per person to ascend the tower. It offers a 360 degrees (more like 90 degrees x 4 sides) view of the city. On a clear day, you might even be able to see Otaru from the tower. You can also see the trains leaving and entering JR Sapporo Station.\n\nMount Moiwa - Unfortunately, it was foggy the night when we wanted to go up the mountain. So, we decided not to go. From what we researched, it offers a very pretty night view of the city.\n\nSo.. In Sapporo, we ditched the car and travelled via trains and legs, like how we did in Tokyo. Parking is expensive in bigger cities. It was a shame that we didn't get to go up to Mount Moiwa as I personally wanted to go up there. But.. There is always an alternative (maybe even better).\n\n**Otaru (23 May - 24 May 2023)**\n\nSakaimachi Street - The biggest shopping street in Otaru. The road is lined with shops of various sizes on both sides. Highlights include a glass warehouse, the Romankan (Romance House) and the windchimes on the river. At the end of the street (or the beginning depends on where you start), is an iconic clock tower. I think it rings and blows steam out of its top every hour. Under the clock tower is my personal favourite, LeTao! Their bestseller, the cheesecakes, is the best! But I love their chocolate biscuits, The Noir, better.\n\nOtaru Canal - You may or may not know that Otaru was a port town. The warehouses that line up beside the canal has since been transformed into shops. According to my wife, it is supposedly a pretty place to go to at night, when lights brighten the canal. But when we were there, it was a sad sight. The lights barely lit up the canal. So.. GO IN FEBRUARY when the snow light path festival is happening! There is also a gondola ride on the canal if anyone's interested. We were not.\n\nSankaku Market - A really small market beside Otaru Station. We had our crab lunch here! 3 crabs totaling 4.6kg for JPY45000. I think that the items sold here are relatively more expensive as this market is catered towards tourists.\n\n**Lake Toya (24 May - 25 May 2023)**\n\nMount Usu - A volcano which last erupted in the year 2000. We took the ropeway up. Trust me! It is worth the trip. There is a terrace right beside the ropeway station where you can enjoy beautiful scenery of the lake and surrounding mountains. The youngsters also managed to climb 320 steps to go closer to the caldera of Mount Usu. While you don't see any lava, you can definitely see some smoke.\n\nMeisui-no-Sato Rest Station - This is not really an attraction. But I wanted to give it a shoutout because it was definitely the most beautiful rest station I have ever seen. A suspension bridge links the rest station to a small forested area. And in that area is a spring! It was unexpected to see everybody enjoying a rest there and drinking spring water directly from the mountains.\n\nThe Lake Ko no Sumika - Our hotel for the night at Lake Toya. This hotel resort is situated right beside the lake. The hotel is also part of the Toya Sun Palace. If you stay in Ko no Sumika, you get access to the onsen and facilities of both hotels. But it doesn't work the other way round. So it definitely feels more exclusive. The Lake Ko no Sumika has the onsen on the 8th level, giving you an unblocked view of the lake and its beyond when you're taking a bath. For those who don't know, from April to October, a fireworks show happens every night between 8.45pm to 9.05pm. The fireworks show takes place on the lake, starting from the pier near The Lake Toya Nonokaze resort, ending in the middle of the lake, right in front of my hotel room. Did I mention that there is a balcony in every room that looks out to the lake? That's where we enjoyed the fireworks show. There is also an onsen bath in every room of the hotel for you to enjoy if you are shy about going nude in the public bath. To summarise, The Lake Ko no Sumika was luxury on another level. I highly recommend this heaven.\n\n**Hakodate (25 May - 27 May 2023)**\n\nOnuma National Park - It's actually a quasi-national park. Not sure what the difference is. But it is a beautiful park where there are bridges that link small little islands together. It'll take around 1 hour to walk the longest route and 15 minutes for the shortest. Honestly, I love this park. It was picturesque and it was also amusing to see young couples (the guy) struggling to row a boat.\n\nMount Hakodate - Boasts the world famous night view. While I agree that the view is beautiful, it is too packed for anyone to enjoy. Everybody is holding up their cameras and crowding near the railings for anyone to take in the scenery. Of course, to counter this, you can always pop by the restaurant or cafe and hope that you'll be assigned a seat by the window so that you can enjoy the view. I recommend that to go right before the sun sets. At the top, you'll have to choose if you want to see the sunset or the night view. Because there is no way that you'll capture both since everybody will crowd to one or the other. It'll always be more crowded when the sky turns dark and everybody is rushing to get off the mountain. So.. Be prepared to wait! Good luck!\n\nHakodate Morning Market - The morning market is awesome. You have access to fresh seafood and other produce. You can even haggle! We spend our 2 mornings there for breakfast. Amazing place to get delicious and slightly cheaper seafood. There is also a stall which lets you catch your own squid and they'll grill it for you. Long queue though. For reference, we had 2 crabs, weighing at 4.2kg in total for JPY37000. They'll lead you to a restaurant where they'll cook the crabs for you, for free! Don't be afraid to haggle and discuss with the shop owners.\n\nGoryokaku - A fort turned into a park! The famous star(?) shaped park is a beautiful place. When we were there, we saw wisterias and fresh green trees. There is also a structure, which I believe was the residence of someone, which you can pay to enter. Nothing to rave about. But if you want to see some architecture in the middle of a park, you can see it here. Come here if you enjoy walking around a big park. If not, give it a miss.\n\nTo sum things up\n\nIt is safe to say that all of us enjoyed our trip to Japan. For my parents, it was their first time in Japan. Our itinerary could have been more optimised to cater to the old folks but we planned what we could. Everything else was pretty much on the fly.\n\nWhile most Japanese don't speak English, they do have some basic understanding if you speak slowly and give them time to process what you said. Alternatively, learn some simple Japanese phrases. It'll make life a lot easier there. For the most part, we relied on Google Maps and Navitime apps to get around Tokyo. We googled for Mapcodes for our drive in Hokkaido.\n\nHope you enjoyed this lengthy trip report!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Thank you for this trip report.  I’ll be going next week to Japan with 8 people, 4 of whom are over 60 years old so I found the Tokyo portion of your report useful.  \n\nWhat were the places you stopped at to chill so the oldies can rest?  We are looking at perhaps stopping at coffee shops since Tokyo doesn’t really have public benches (from what I’ve read).  Any other suggestions?  I’m also thinking that we will do most of our sight seeing with the oldies in the morning and then after lunch they can head back to the hotel to rest while the younger ones can do more sightseeing in the afternoon.  Then we will just meet up for dinner.  \n\nAlso with 9 people, how did you manage eating at restaurants?  Did you split up or did you find restaurants that were able to accommodate your large group?\n\nThank you!",
            "score": 1,
            "author": "Masterpnutz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm glad I'm able to provide some help. \n\nIn Tokyo, I think it's pretty easy to find coffee shops, especially in popular tourist spots. Public benches are indeed few and far between in Tokyo. You can also try to leave the older folks in food courts or fast food restaurants. Buy a drink, and they can be in there for hours. \n\nFor lunches and dinners, we would usually split up and eat at different restaurants since everybody had appetites for different foods. On the few occasions that all 9 of us were eating in the same restaurant, we had to split tables. I believe that most restaurants would only accommodate up to 4 pax per table. It was explicitly stated in some restaurants that if the group was bigger than 4 pax, they'll split the group.\n\nI hope the above helps. Enjoy your trip!",
                    "score": 4,
                    "author": "ifailedmaths"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks OP for sharing! I’m heading to Hokkaido in 2 days, and curious to know what type of crabs (king crab, hairy crab etc) you got at Hakodate and Otaru markets and the pricing? Any stalls to recommend or advice?",
            "score": 1,
            "author": "Ok_Wonder3755",
            "replies": [
                {
                    "level": 1,
                    "comment": "We had king crabs at Hakodate Morning Market. Just order your crab from any vendor. They'll lead you to a restaurant to enjoy the crab. As a courtesy, we ordered extra food from the restaurant. \n\nIn Otaru, we went to Sankaku Market, just beside the train station. We bought the Hamasaki crabs from a vendor at the end of the market. \n\nCrabs are really fresh there. It's OK to haggle a little in the markets. I would highly recommend ordering grilled mackerel fish from the restaurants.",
                    "score": 2,
                    "author": "ifailedmaths",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow surprised that king crabs are cheaper than hanasaki. Thanks again for sharing, excited to try them! :)",
                            "score": 1,
                            "author": "Ok_Wonder3755",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the location is a factor too. Things are generally cheaper at Hakodate compared to Otaru.",
                                    "score": 1,
                                    "author": "ifailedmaths"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know how long it takes from tokyo to sapporo (capital city in hokkaido)? It takes 9 hours by sinkansen/train! And it costs 27,000 yen. If you choose a flight, you can be there within 3-4 hours and price can be half. I don't know anyone who use train to travel to hokkaido and if you accuse of using airplane for envitonment, then they must not travel to Japan by airplane in the first place.",
                    "score": 5,
                    "author": "Comfortable-Show-968",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You missed my point. Why visit Japan and fly when you can fly anywhere? The point is the experience.",
                            "score": -8,
                            "author": "mulierosity"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's true, the trains in Tokyo does bring us everywhere. But for example, Meiji Shrine is a 15 to 20 minutes walk from Harajuku Station. Shibuya itself is a huge place, you  cannot expect that we just take a train and just go to the station, right?\n\nThe reason we flew to Hokkaido is because it is faster and cheaper. If it were up to me, I would want to take the Shinkansen to Hokkaido too. It would be fun crossing the sea in a train. But I wasn't travelling alone. Besides, we have taken the bullet train elsewhere before, which uses the Japanese system. So.. no losses on the experience.",
                    "score": 3,
                    "author": "ifailedmaths"
                },
                {
                    "level": 1,
                    "comment": "People always use the excuse that the plane is cheaper. But who honestly wants to deal with airports?",
                    "score": -6,
                    "author": "khuldrim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone from Singapore, taking domestic flights is a new experience for me because the country is so small! It only takes 1.5 hours to travel east to west by train.\n\nSo yes, I would rather deal with domestic airports, because it is new to me. Also.. if I had no checked bags, I could simply check in to the flight on my phone and just go through security 20 minutes before boarding. \n\nIt is just simply more cost efficient to take the plane as compared to taking the bullet train.",
                            "score": 1,
                            "author": "ifailedmaths"
                        }
                    ]
                }
            ]
        }
    ]
}