{
    "id": "141kptb",
    "score": 3,
    "title": "9 Day Itinerary Check (Tokyo/Kyoto/Osaka/Nara) June 7-15",
    "author": "Mergical",
    "date": 1685983939.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/141kptb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm finally going to Japan after I had booked my trip in 2019 and COVID cancelled it. I'm traveling with my brother and he's only able to get off of work for 10 days, so this is what we have to work with unfortunately. To preface, I know trying to fit all of these cities in is hard but the reasons I wanted to go to Japan were Arashiyama, Fushimi Inari, Tokyo as a whole, &amp; Dotonbori.   \n\n\nOur hotels are at Ueno Eki Minami in Tokyo, then Machiya Kamiumeya in Kyoto for 2 days, 1 day in Cross Hotel Osaka, and the last 2 days in Hotel Gracery Shinjuku. How's this for a first time itinerary?\n\nDay 1 (6/7) - Ueno area #1\n\n* Arrive at HND at 4 PM\n* Bus or train to APA Ueno Eki Minami\n* Get some food maybe at Ameyoko\n\nDay 2 (6/8) - Ginza and Maranouchi\n\n* Tokyo Station   \n* **Imperial Palace Gardens**\n* Kokyo Gaien National Garden    \n* BIQLO\n* **Ginza Art Aquarium**    \n* Shin Maranouchi building for pizza and street view\n\n  \nDay 3 (6/9) - Nakano Broadway &amp; Ikebekuro\n\n* **Nakano Broadway**    \n* Mandarake Annex\n* Daiso    \n* Lashinbang Nakano\n* Gamestation Nakano    \n* Nakano Shrine\n* Ikebekuro Sunshine Mall    \n* **Pokémon Center DX**\n\nDay 4 (6/10) - Ueno area\n\n* Ameyoko    \n* Ueno Park\n* Asakusa Shrine    \n* **Senso-ji**\n\nDay 5 (6/11) - Kyoto\n\n* Nozomi Shinkansen to Kyoto Hotel Machiya Kamiumeya\n* Gion     \n* **Arashiyama**  \n\n\nDay 6 (6/12) - Nara and Kyoto\n\n* **Fushimi Inari first thing in the morning**   \n*  Travel to Nara\n* **Toda-ji**    \n* Nara Park\n* Try melon pan somewhere\n* Go back to Kyoto\n\nDay 7 (6/13) - Osaka\n\n* Travel from Kyoto to Osaka\n* Ajinoya    \n* **Walk around dotonbori**\n* Shinsaibashi shopping street    \n* Osaka castle\n* Kuromon market in the evening maybe if not exhausted\n\nDay 8 - (6/14) Tokyo (Akihabara)\n\n* **Animate**    \n* **K-books**\n* **Kotobukiya**    \n* Train to Harajuku    \n* Kawaii Monster Cafe\n* Yoyogi Park  \n*   **Walk to Shibuya** center street through ometesando for dinner\n\nDay 9 - Fly home after getting ramen\n\n&amp;#x200B;\n\nIs this a doable itinerary? The things in bold are what I REALLY want to do. The rest is just stuff I thought would be fun if I have the time to spare and feel like it. I'd love to get some suggestions and feedback. Thank you for the help!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "You're asking two days before you arrive??\n\nYou have too much stuff every day. Do the bolded stuff and see how much time you have left.",
            "score": 4,
            "author": "mulierosity"
        },
        {
            "level": 0,
            "comment": "Hi!\n\nUnless you live in the same time zone as Japan or a similar time zone, I would put Ikebukuro before Nakano because most stores in Nakano open at noon and Sunshine 60 opens at 10.  You can get two hours or so of shopping in before going to Nakano vs. if you go to Nakano first you're really not getting anything done until noon.\n\nThe Kawaii Monster Cafe closed during Covid 19.  So you are not going there.",
            "score": 3,
            "author": "soldoutraces",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!",
                    "score": 1,
                    "author": "Mergical"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lots of cool plans on here! What is your luggage situation? If you are planning on having large suitcases they are really going to slow you down. I was just in Japan in May and moving hotels between Tokyo and Kyoto/Osaka ate up 1/2 to 2/3 of our travel days with the shinkansen and lugging our big suitcases around on local transit. \n\nYou have a ton you want to do so I'd say make sure to do shrines in the morning because they open early and shop in the afternoons. We found most stores are open 10-7 or even 12-7 (especially in Akihabara) so shopping time is very limited and you have to really plan your days around it. Shrines close early (usually before 6). I would really really recommend reducing how much you want to do though because it will be super rushed. Have a great trip!",
            "score": 1,
            "author": "Gwyn_L",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the advice! I’ll definitely cut back a lot and try to focus on the shrines early.\n\nWe’re carrying one carry-on bag and one backpack each with our clothes and electronics.",
                    "score": 1,
                    "author": "Mergical",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem! With that luggage you should have no problems! Have so much fun! \n\nNara is amazing and arashiyama is beautiful, definitely go to the monkey park. Also (not to add another thing to your list lol) but I see you're interested in Mandarake, my favourite one I went to while I was in Japan was Umeda! It's insane and huge and built like a cave with a big mammoth skeleton in it I think? It was wild lol",
                            "score": 2,
                            "author": "Gwyn_L"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly Dotobori is not the most interesting place during the day.  Maybe go there closer to dusk/night",
            "score": 1,
            "author": "cat58854w7v"
        }
    ]
}