{
    "id": "141t1eh",
    "score": 1,
    "title": "Renting Yukata in Kyoto: Which day's itinerary makes the most sense?",
    "author": "FranklyDarko",
    "date": 1686001634.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/141t1eh",
    "media_urls": [],
    "other_urls": [],
    "postText": "My husband and I are traveling to Japan for two weeks in July! One of the experiences I am most excited about is renting yukata in Kyoto. However, I am struggling to decide on the best time to do this.\n\nWe have four days in Kyoto. We will be traveling from Hakone to Kyoto and are planning a low-key first day because of that. Here is a bare bones version of our itinerary:\n\n**Kyoto Day 1:** Train from Odawara to Kyoto in the morning, explore downtown, visit Fushimi Inari shrine at sunset.\n\n**Kyoto Day 2:** Travel to Kibune to experience kawadoko dining and the Kifune shrine.\n\n**Kyoto Day 3:** Arashiyama: Bamboo Grove, Monkey Park, explore Arashiyama area\n\n**Kyoto Day 4:** Day Trip to Nara! We plan to spend the whole day there, then return to our hotel in Kyoto.\n\n**My question is, which of these days would make the most sense to rent yukata?** \n\nThe first day seems tricky because we're traveling to Kyoto, and I don't want to stress about making an appointment when considering travel time from Hakone to Kyoto, even if we leave as early as possible.\n\nFor the second day, I am wondering how practical it would be to travel to Kibune in yukata. Thoughts? For reference, our hotel is right next to the Gion district.\n\nFor day three, almost everyone recommends visiting the bamboo grove as early as possible--way earlier than yukata rental places open. Seems like it doesn't make sense, but maybe I'm missing something.\n\nOn day four we travel to Nara. Would it make more sense to rent Yukata in Nara instead of Kyoto?\n\nI would appreciate any feedback, including anything I haven't considered. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I rented from a place that had free next day return. They also have options to send your stuff back to your hotel and pick up their stuff next day for 1500 yen. Otherwise, return was 6:30 same day. Let me know if you want to know the place, I’ll PM you. \n\nTakes about an hour to pick out your stuff and get all setup. So plan accordingly. \n\nDefiantly get your hair done. The extra 500-1500 yen is worth it!\n\nMake reservations!\n\nConsider the weather. You might not want to get a really detailed, multilayered setup if it’s hot.",
            "score": 7,
            "author": "Spiffywerks",
            "replies": [
                {
                    "level": 1,
                    "comment": "So I got a lot of requests about where I rented from. I didn’t want to seem like a promotion because there are tons of places to rent kimonos from. However, since so many are asking I rented from Okamoto Kimono (https://www.okamoto-kimono-en.com).\n\nI hope this isn’t against the rules. \n\nThey actually had nicer material kimonos from what we saw others wearing. I don’t think they were the cheapest in town, but they do have a store right outside Kiyomizu-dera temple that made going to the temple dressed up very convenient. The staff was friendly, spoke English, and were pretty quick in getting everyone setup. I really liked I could make a reservation without any deposit.",
                    "score": 2,
                    "author": "Spiffywerks"
                },
                {
                    "level": 1,
                    "comment": "I’d love to know the place you rented from!",
                    "score": 1,
                    "author": "FranklyDarko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sent you a a PM. Kyoto is beautiful. I hope you have a great time!",
                            "score": 2,
                            "author": "Spiffywerks"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could you send me the name of this place as well? I'll be there in November and this sounds convenient!",
                    "score": 1,
                    "author": "Evening_Owl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure thing. Sent you a PM",
                            "score": 1,
                            "author": "Spiffywerks"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can i get the name for the place too please 😊",
                    "score": 1,
                    "author": "d3v1lsblood"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had the same idea, but saw that buying Yukata is very affordable. $50-$60 and can be found anywhere. If renting cost $30+ hassle to return, why not just buy yukata yourself and move on.",
            "score": 5,
            "author": "Ok_Geologist_4767",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a really good point, and definitely one I'll consider! If I go that route I'll make sure I know how to dress in one properly.",
                    "score": 2,
                    "author": "FranklyDarko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I bought a yukata+happi coat at this shop [Mimuro](https://goo.gl/maps/4rau2FPWASXQ3tpE9), definitely recommend em. Great selection and the staff speaks english, will get you set up.",
                            "score": 2,
                            "author": "Atari1977"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I bought a yukata on Teramachi shopping street, ended up being around ¥4000 new but I visited Arashiyama later and noticed they had some secondhand ones starting at ¥2500. There and Gion (where my guesthouse was located) were where I saw the most people wearing them.",
                    "score": 2,
                    "author": "coolbucky"
                },
                {
                    "level": 1,
                    "comment": "I don't know... you still have to get an obi, while with renting u get full set + hair done. Also usually clerks pick up kimonos based on a knowledge you won't have. In my opinion is worth the price.",
                    "score": 1,
                    "author": "Altruistic-Chapter2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I really want the hair styling &amp; expertise…so maybe I’ll rent for the experience &amp; purchase one as a souvenir!",
                            "score": 2,
                            "author": "FranklyDarko"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Nara makes the most sense. You can rent there and just explore and take pics. If it's not comfortable you can always return it and keep exploring Nara.\n\nSecond option would be day 1 and just renting it in the afternoon for a couple of hours.",
            "score": 2,
            "author": "yellowbeehive",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, at this point I'm leaning towards Nara or purchasing a yukata. But maybe a short rental period just for photos on day one would make sense! Thanks!",
                    "score": 1,
                    "author": "FranklyDarko"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I see day 2 as the only feasible day. It would also be nice to eat traditional Japanese food while dressed in Japanese garb.\n\nYukata is traditionally worn with wooden sandals which are not conducive to long distance walking at all, which is what all the days entail. You can sort of think of it as flip flops. For example, day 3 involves walking up a hill (monkey park), day 4 involves lots of walking in Nara Park, I would never do either of these in flip flops. And you are correct that the bamboo after 7:30ish is a terrible experience.",
            "score": 2,
            "author": "tribekat"
        },
        {
            "level": 0,
            "comment": "In July, make sure you pack LOTS of dryfit shirts/pants and potentially a 2nd pair of shoes if you get rained on. Japan's rainy season will be in full swing as well as humdity 70-90% with temps in the upper 80's F. I didn't think much of Japan summer, but if your from Florida for instance, you'll be right at home.\n\nI spent the whole day in Nara as well from Osaka (similar distance from Kyoto) and walked SO MUCH. Depends on how much you want to walk with the Yukata. Nara is more spaced out than Kyoto so keep that in mind.",
            "score": 2,
            "author": "Zefeh"
        },
        {
            "level": 0,
            "comment": "The day that does not rain!  Be flexible with your plan since it may rain on the day of your rental.",
            "score": 2,
            "author": "AlanCityHunter"
        },
        {
            "level": 0,
            "comment": "of those 4 options, nara\n\nday 2 would be great if you dont want to hike the monkey park in a yukata,",
            "score": 2,
            "author": "catwiesel"
        }
    ]
}