{
    "id": "141u7ow",
    "score": 3,
    "title": "Japan 16 day itinerary help! August 2023",
    "author": "Icy_Recipe7153",
    "date": 1686004020.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/141u7ow",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! \n\nWe are a couple from the UK who are visiting Japan for the first time in August. We will both be celebrating our 30th birthday's on the trip. We've travelled a lot on various backpacking trips, but it's been our dream to explore Japan since we started! I understimated how difficult it could be to plan a coherant intinerary for this trip, so any help, suggestions or constructive criticism is definitely welcome! \n\nIn terms of us and what we like, we're massive foodies, my girlfriend is a pescatarian. We love nature, walking / hiking but also love the buzz of cities, nightlife etc. We're keen to immerse ourselves in the culture as much as possible. We're thinking budget to mid-range for this trip. \n\nDoes the following itinerary make sense for the 14 day JR pass? Would the 7 day be better? What other cards / train passes should we be thinking about? \n\nOk, here goes...\n\n30/07 - Arrive into Kobe (UKB) @ 21:45 - train to Osaka \n\n31/07 - Osaka - food, food, food. \n\n01/08 - Osaka - More food, maybe a street / food tour and experience nightlife. \n\n02/03 - Osaka - Day trip to Nara.\n\n03/08 - My birthday! - Osaka to Koyasan for an overnight temple stay. \n\n04/08 - spend morning in Koyasan, do a short trail, see some of the temples. Then somehow get to Hiroshima? Explore peace park and then overnight stay on Miyajima. \n\n05/08 - Miyajima &amp; Hiroshima - explore both a bit more and then train to Kyoto in the evening. \n\n06/08 - Kyoto - wake early to get to Arashiyama Bamboo Grove, then Kinkaku-ji\n\n07/08 - Kyoto - wake early to get to Fushimi Inari Taisha, intending to climb to the top, or would this be better for sunset? Explore Higashiyama / Gion and then Pontocho in the evening. \n\n08/08 - Kyoto - Kiyomizu-dera - explore Higashiyama and Gion more. Any must sees or not so touristy things we could do that I've not thought of? \n\n09/08 - Morning train from Kyoto to Kanzawa - explore Chaya districs, Samurai district and Kenroku-en. Eat lots of sushi. \n\n10/08 - Kanzawa to Takayama - explore the old town. Could we fit in a trip to Kamikochi? Conscious there isn't much hiking in this itinerary yet. \n\n11/08 - Takayama to Tokyo - get our bearings and explore! \n\n12/08 - Tokyo - explore Shinjuku, Shibuya, mieji-jingu\n\n13/07 - Tokyo - early morning to the fish market, TeamLab Planets, senso-ji, Akihabara\n\n14/08 - Girlfriends birthday! Tokyo - day trip to Hakone or Nikko? Need to plan something worthy of a 30th birthday but at a loss currently!\n\n15/08 - Tokyo - late ish train to Kobe for ealy flight home. \n\n16/08 - Fly home - 7:05am from Kobe (UKB)\n\nHopefully this makes some sort of sense, I'm sorry it's so long but I'd be so so grateful of some help. Anything we should change? Any hikes you'd recommend? Any less touristy things we could do? \n\nThanks again!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "For the JR pass there are some calculators online to check if it's worth it. Generally it's only worth it if you are doing a lot of long trips during the period - note that not all trains are included. I don't believe you can use it to go to Koyasan.\n\nI think you have 1 too many stops. The travel time to Hiroshima, Kanazawa and Takayama and then staying 1 night isn't really worth it. I'm not sure what your priorities are but I would skip Hiroshima and add an extra day to Kanazawa/Takayama.",
            "score": 3,
            "author": "yellowbeehive",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!! So I guess if we're having to get back to Kobe from Tokyo or maybe Hakone, we'd probably benefit from the JR Pass? I'll have a look for the calculator online 😊. In terms of other passes we may need for this itinerary, what would you suggest? I'm slightly overwhelmed by the amount of different options!! \n\nI agree with you about the stops as generally we like to stay places a few days, however I kind of considered Hiroshima and Miyajima as must sees, would you not agree? Kanazawa and Takayama I really want to stay on the itinerary, so should I pull some time from elsewhere? What do you think? Thanks again!!",
                    "score": 1,
                    "author": "Icy_Recipe7153",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the rail pass, yes it might be useful for your trip from Tokyo to Kobe, but you won't use it while in Tokyo. It's a tricky one but all you can do is put the details in a calculator and see what works for you.\n\nThe only other rail pass to consider would be for Koyasan as they have a pass for that.\n\nI don't think Hiroshima is a must see. I only consider Tokyo and Kyoto as must sees. If you prefer to go to Hiroshima then you possibly need to drop Kanazawa &amp; Takayama to make it work as there isn't much room to drop things elsewhere. \n\nYou can spend the extra time to see a bit more of Hiroshima and/or go to places like Kurushiki/Okayama, Onomichi or Kinosaki. These aren't too much of a detour.\n\nSomething to think about!",
                            "score": 2,
                            "author": "yellowbeehive",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've been thinking about this a bit more, I feel like we should see Hiroshima but I'd like another day in Kanazawa ideally (or would another day in Takayama be better? I'd like to see Kamikochi if possible) so I'm thinking early get up on one of the days in Osaka and then train down to Hiroshima for the day, do you think that could work? Thanks for all your help so far 😊",
                                    "score": 1,
                                    "author": "Icy_Recipe7153",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hiroshima as a day trip is possible. It's a long day and hard to see both Miyajima and Hiroshima in a day. \n\nIf Hiroshima/Miyajima and Kamikochi are your priorities then the following might work (but will have a lot of travel):\n\n04/08 - Travel to Hiroshima from Koyasan as planned. Note that you will want to stay at Koyasan for the morning prayers and breakfast so you may not leave until 9 or 10. It will probably take 5 hours to go to Hiroshima from there so you will get there 2/3pm. You can spend the arvo exploring Hiroshima a bit.\n\n05/08 - Head to Miyajima early morning. You will probably stay there until after lunch so you might have a couple more hours in the afternoon to see Hiroshima before going to Kyoto.\n\n09/08 - Travel from Kyoto to Takayama. Arrive around lunchtime and spend the afternoon in Takayama.\n\n10/08 - Day trip to Kamikochi from Takayama. \n\n11/08 - Head to Tokyo in morning.\n\nI think it's ok to skip Kanazawa and if your priority is Kamikochi. Kanazawa is like a smaller Kyoto so going from Kyoto to Kanazawa might feel like more of the same. I love Kanazawa but I feel it's better on a subsequent trip when you don't go to Kyoto.",
                                            "score": 1,
                                            "author": "yellowbeehive"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You think you nail most of the things to see!\n\n- You mentioned that you are a foodie - I suppose can't help but recommend some of the Tabelog Silver or Michelin 1* Omakase experience. Omakase.in website has some solid sushi there (Sushi Hashimoto). Tabelog is very comprehensive to check review. Anything over 4 is stellar.\n\n- For your girlfriend's birthday - as nice ending to the trip - you can pick a Ryokan that is on the way back to Kobe. This can be along Izu Peninsula or in Hakone. Inn such as Yagyu No Sho, Sagasawakan. Checkout FlyerTalk Ryokan Post which has some of the best Ryokan!\n\nStaying overnight in either Hakone or elsewhere eliminates your trip back to Tokyo since you are heading east anyway. You may forward all your luggage directly from Tokyo to Kobe. How nice is that?",
            "score": 2,
            "author": "Ok_Geologist_4767",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for this. Some great suggestions. How much would we expect to pay for an Omakase menu at one of the places you mentioned?",
                    "score": 1,
                    "author": "Icy_Recipe7153",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The 1* Michelin starts at 20,000Y+ per person for lunch and 35,000Y per person for dinner. I personally think it is just a little on the high side to shell $400-$700 at a restaurant. I think a reasonable compromise is find a Tabelog restaurant 3.6+ Omakase around 10,000Y-15,000Y for dinner.",
                            "score": 2,
                            "author": "Ok_Geologist_4767"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there any reason you are using Kobe Airport? They don't (currently at least) have international services so it seems you will be transiting through somewhere else in Japan/somewhere more convenient?",
            "score": 2,
            "author": "aucnderutresjp_1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, thanks for commenting! So we're flying ANA from London Heathrow to Tokyo with a 3hr layover there and then another ANA flight to Kobe. Ridiculously it was around £700pp cheaper to do it this way. I did think about just leaving at Tokyo but our bags will go all the way through!",
                    "score": 1,
                    "author": "Icy_Recipe7153",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough, thats a good saving. But actually you will need to collect your bags in Tokyo and transfer them to your Kobe flight. Easy process though. I don't recommend skipping that flight though, as it will automatically void all subsequent flights on your booking.",
                            "score": 2,
                            "author": "aucnderutresjp_1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "14/08: teamlab borderless planet, Tokyo cruise from Odaiba to Asakusa, explore, then chill in Ueno park, rooftop restaurant,  end with helicopter flight by night",
            "score": 2,
            "author": "Fantastic_Sundae3069",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, sounds like a great day! Thanks so much for the suggestions!",
                    "score": 1,
                    "author": "Icy_Recipe7153"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you think we're trying to cram too much in here? I assumed Hiroshima / Miyajima were must sees!",
                    "score": 1,
                    "author": "Icy_Recipe7153"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is a lot to do but a helicopter flight by night is something elsd :)\nI will do mine in July, aill let you know how it goes",
            "score": 1,
            "author": "Fantastic_Sundae3069"
        },
        {
            "level": 0,
            "comment": "Hi all, do you think the 14 day JR pass is worth it for this itinerary? We've decided to skip Hiroshima and spend more time in Kanazawa instead. I can't figure out if it's worth it or not, I've used the calculator but still not sure!!",
            "score": 1,
            "author": "Icy_Recipe7153"
        }
    ]
}