{
    "id": "146aone",
    "score": 1,
    "title": "Itinerary Check - 22 Days in July/August 2023",
    "author": "stonk_in_my_sock",
    "date": 1686430118.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/146aone",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi All -\n\nWe are a couple from Midwest USA who are visiting Japan from July 10th to August 1st. It will be my 2nd time to Japan, and my partner's first. I am including a bit from my first time in Japan, but a lot of new things as well - my first time was over 10 years ago and I was only able to spend a week, so merely scratched the surface compared to this go-around. Our itinerary has been scheduled so that we can hopefully be a part of some celebrations for different festivals going on: Mitama Matsuri in Tokyo, Gion Matsuri in Kyoto, and Tenjin Matsuri in Osaka. I have plotted most of this out on Google maps to form this itinerary that I think should work out, however, I am open to any help/suggestions I can get! One of my main concerns would be having something scheduled on a day it is closed, or having something scheduled on a bad day of the week, too late in the day, etc. and not knowing until we get there. I appreciate any assistance I can get, especially getting as close to our departure date as we are. Here is what I have planned so far (questions at the end):\n\n&amp;#x200B;\n\n* **July 10: Leave from DFW**\n* **July 11, Tokyo:**\n   * Late afternoon arrival\n   * Pick up 21-day JR rail passes at HND\n   * TA-Q-BIN luggage to hotel\n   * Take Keikyu airport line to Higashi-Ginza station\n   * Check into hotel.\n   * Grab dinner around Higashi-Ginza station area\n   * Stop by 100 yen store for a few things\n   * Relax at hotel\n* **July 12, Tokyo:**\n   * Ghibli Museum\n   * Inokashira Park\n* **July 13, Tokyo - Mitama Matsuri:**\n   * Koshikawa Korakuen Gardens\n   * Yasukuni Shrine and surrounding area for Mitama matsuri\n* **July 14, Tokyo&gt;Kyoto:**\n   * Check out &amp; TA-Q-BIN luggage to Kyoto hotel\n   * Shinkansen to Kyoto\n   * Toji temple\n   * Higashi Hongan-ji Temple\n   * Check into hotel in Gojo station area.\n* **July 15, Kyoto - Gion Matsuri:**\n   * Rengeoin Sanjusangendo\n   * Kiyomizu-dera\n   * Hokan-ji\n   * Yasaka Shrine\n   * Gion\n* **July 16, Kyoto - Gion Matsuri:**\n   * Heian Shrine\n   * Ginkakuji\n   * Honen-in\n   * MAYBE Anraku-ji if we think time will permit\n   * MAYBE Reikan-ji if we think time will permit\n   * Eikan-do (Zenrin-ji) Temple\n   * Nanzen-ji Temple\n   * Gion\n* **July 17, Kyoto - Gion Matsuri:**\n   * Shimogamo-jinja Shrine\n   * Kyoto Imperial Palace\n   * Nijo castle\n   * Gion\n* **July 18, Kyoto:**\n   * Kinkaku-ji\n   * Ryoan-ji\n   * Ninna-ji\n   * Kamigamo-jinja MAYBE\n* **July 19, Kyoto:**\n   * Tenryu-ji\n   * Arashiyama bamboo forest\n   * Jojakko-ji Temple\n   * Gio-ji\n   * Daikaku-ji\n* **July 20, Nara/Uji:**\n   * Higashimuki Shopping Street\n   * Kofuku-ji MAYBE\n   * Kasuga-taisha\n   * Nara Park\n   * Todai-ji\n   * Byodoin\n   * Fushimi Inari Taisha\n* **July 21, Kyoto:**\n   * Nothing planned yet\n* **July 22, Kyoto&gt;Hiroshima, Miyajima:**\n   * Check out &amp; TA-Q-BIN luggage to Osaka hotel\n   * Shinkansen to Hiroshima\n   * Atomic Bomb Dome\n   * Peace Memorial Museum &amp; Park\n   * Bell of Peace\n   * Take train to JR West Miyajima Ferry terminal\n   * Ferry to Miyajima Island (Itsukushima)\n   * Check into ryokan and eat dinner at ryokan\n   * Maybe do some light exploring of the island\n* **July 23, Miyajima, Hiroshima&gt;Osaka:**\n   * Eat breakfast and check out of ryokan\n   * Itsukushima Jinja\n   * Itsukushima Floating Tori Gate\n   * Daishoin and some of the other places in this area\n   * Pokemon Center on the way out of Hiroshima\n   * Shinkansen to Osaka\n   * Shinsaibashi-suji Shopping Street\n   * Hozenji Temple\n   * Dotonbori\n   * Check into hotel in Namba area and retreive luggage\n* **July 24, Osaka - Tenjin Matsuri:**\n   * Sennichimae Doguyasuji Shopping street\n   * Samuhara Shrine\n   * Osaka Tenmangu\n   * Pokemon Center Osaka\n* **July 25, Osaka - Tenjin Matsuri:**\n   * Shitennoji\n   * Isshinji Temple\n   * Abeno Harukas\n   * Osaka Tenmangu again?\n* **July 26, Osaka&gt;Tokyo; possibly Nagoya:**\n   * Check out &amp; TA-Q-BIN luggage to Tokyo hotel\n   * Shinkansen to Tokyo\n   * Might stop off at Nagoya – not sure if time will allow/if the short time is worth it. If Nagoya stop happens:\n      * Osu Shopping District\n      * Pokemon Center Nagoya\n      * Toyota Museum\n   * Either do some light shopping in Ginza area, or go to Tsukiji Market – both are near the hotel.\n   * Check into hotel\n* **July 27, Tokyo, Kamakura:**\n   * Hasedera\n   * Kotoku-in\n   * Tsurugaoka Hachiman-gu\n   * Maybe other temples/shrines in the area if there is time? (Sasuke Inari Shrine, Zeniarai Benzaiten Ugafuku Shrine,  Kencho-ji,  Meigetsu-in,  Engaku-ji)\n* **July 28, Tokyo:**\n   * Shinjuku\n   * Tokyo Metropolitan Government Building\n   * Nakano Broadway\n   * Omoide Yokocho\n   * Shopping in Ikebukuro\n   * Pokemon Center Mega Tokyo\n* **July 29, Tokyo:**\n   * Senso-ji\n   * Kappabashi Dougu Street Ueno Park\n   * Pokemon Center Sky Tree\n* **July 30, Tokyo:**\n   * Shibuya\n   * Konno Hachimangu\n   * Shrine Meiji Jingu\n   * Harajuku\n   * Yoyogi Park\n* **July 31, Tokyo**\n   * Akihabara for most of the day\n   * Kanda Myojin Shrine\n   * Pokemon Center Tokyo DX\n   * Pokemon Store Tokyo Station\n   * Tsukiji Market\n* **August 1, Tokyo departure – We will probably have to pay all fares on this day, I think my JR Pass will be done**\n   * Check out from hotel.\n   * If I can TA-Q-BIN checked luggage, might bring carry on backpack with me for any last minute shopping.\n   * Show up to airport a couple hours early for check in\n   * HND&gt;LAX&gt;DFW\n\n&amp;#x200B;\n\n* **Questions:**\n   * Would I receive luggage same day or next in Tokyo on the first leg? (from airport to hotel)\n   * Does Pokemon Center on the way out of Hiroshima on the 23rd make sense, or should I just get this out of the way on the 22nd? If I do it on the 22nd, I assume I should wait until after the museums?\n   * Do I have enough time for the stop off in Nagoya on the 26th? Should I make the effort to do this, or is it not worth it in the grand scheme of things?\n   * Any recommendations for my open day in Kyoto on the 21st?\n   * Do you think I will have enough time for Anraku-ji and Reikan-ji on the 16th? Should I make a great effort to make time for these two?\n   * Do you think I should go to Kamigamo-jinja on the 18th?\n   * Where else would you recommend that I go in Kamakura on the 30th, or do I have a full plate already with the 3 I have listed?\n   * Am I able to TA-Q-BIN luggage to airport too, or do I just need to haul it with me? Good chance of having 2 checked bags each on the way back (4 total).\n   * What days would you say are too packed, and what would you remove from them?\n   * Any other places I should go to maximize my festival experiences? Should I try to devote more times to these areas also, as opposed to the other items on my itinerary for those days?\n   * Any recommendations for doing laundry in Kyoto? It will be the only hotel we're staying at that does not have washer/dryer. A laundry service or something is preferable, we probably won't want to stick around and do laundry.",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Did you already get your tickets for Ghibli Museum? I tried online right when it opened up on 6/10 and couldn’t get it.",
            "score": 2,
            "author": "Saturn212",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t, unfortunately. Looking for other ideas for that day now",
                    "score": 1,
                    "author": "stonk_in_my_sock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Pokemon centre in Hiroshima is in a kids section of a department store, it's really small if you're expecting it to be like the big ones in Tokyo.\nI don't like Pokemon but my boyfriend does and he didn't spend long there so you could do it on your way out.",
            "score": 2,
            "author": "sinkh0000le",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate the info!",
                    "score": 1,
                    "author": "stonk_in_my_sock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; JR pass\n\nI'm confused why you got a 21 day pass; it's not worth it for intra-tokyo travel so at most you need it for 14 days (July 14-26 while you're traveling out/into Tokyo).\n\n&gt; Takkyubin\n\nIs available to the airport (you need to drop it off two days in advance). Generally speaking, assume everything is next day or even the day after delivery.",
            "score": 1,
            "author": "tribekat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I haven’t purchased it yet so can definitely go the 14 day route if that makes more sense. \n\nHmm ok so it would probably be better if we just took our luggage with us to the airport, seeing as we will probably still be shopping the 2 days prior. What would be the best way to get to the airport with luggage on the last day? Taxi probably?",
                    "score": 1,
                    "author": "stonk_in_my_sock"
                }
            ]
        }
    ]
}