{
    "id": "146ksz8",
    "score": 2,
    "title": "Looking for some advice for Kobe day trip",
    "author": "meowhog",
    "date": 1686459088.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/146ksz8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, I'll be visiting Kobe in early August, and I'm stuck in a dilemma. The spots that I want to visit are Nankinmachi, Mount Rokko (Rokkosan Farm, Kikuseidai, etc), and Arimaonsen. \n\nThe problem is I'm not sure if I should do:\n\n1) Nankinmachi &gt; Mount Rokko &gt; Arimaonsen. This way I can explore Nankinmachi in bright day light, then go around Mt Rokko via the Rokko Sanjo Bus, and end the day with a nice bath at Arimaonsen. Then head back to Osaka where I will be staying.\n\n2) Arimaonsen &gt; Mount Rokko &gt; Nankinmachi. I heard Arimaonsen is less crowded in the early morning, which I will appreciate as it will be my first onsen experience. Then go to Mt Rokko, and end the day at Nankinmachi, where there will be nice lights and lanterns to look at while walking around. Also good that it's a shorter way home from here, after a long day of walking. \n\nTo me, both ways sound reasonable. Just not sure if it's better to do onsen in the morning or in the evening. Would be great to hear what you guys think about this. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Nankinmachi is pretty much rammed 11am-2pm, and the stores are closed before that. Ultimately you have to decide if you'd rather have a busy Onsen or a busy shopping/food experience.",
            "score": 2,
            "author": "battlestarvalk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your input!",
                    "score": 1,
                    "author": "meowhog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would say that you make sure to end up at Kobe station in the evening and have an amazing Brasilian BBQ at this restaurant called Brasiliano. Make sure to reserve seats. Good luck.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}