{
    "id": "148s9sz",
    "score": 73,
    "title": "Wells Fargo card won't work with Japan ATM solution",
    "author": "Kitruin",
    "date": 1686697590.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/148s9sz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, hopefully this will save you some tears!   \nSOLUTION: Try using the ATMs at LAWSON convenience stores to withdraw cash!   \nMy issue: ATMs at major airports and train stations WOULD NOT accept my Wells Fargo card. Neither would 7 eleven. I cried my heart out because my boyfriend unfortunately was paying for everything and we lost our booking to a Ryokan.   \nI called my bank several times in tears as they told me nothing was wrong with my card. And that maybe it was a chip malfunction or the ATM.   \nWe even traveled an hour out of the way to visit the Wells Fargo in Tokyo (DO NOT DO THIS). It was a waste of time. They can't help anyone with an overseas Wells Fargo issue! They can only assist Japanese customers.  \nWhat finally worked was withdrawing cash from a LAWSON ATM. I don't know why this worked.   \nI hope this helps someone!",
    "comments": [
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  You can also join our [Discord community](https://discord.gg/3f7KBUMwU4)\n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Glad it all worked out, but had it not worked at Lawson’s, did you have any other cards (credit or debit)? I have 6, but that’s probably overkill.",
            "score": 38,
            "author": "crevettegrise",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Glad it all worked out, but had it not worked at Lawson’s, did you have any other cards (credit or debit)? I have 6, but that’s probably overkill.\n\npulling cash from a credit card is usually a bad idea unless it's ABSOLUTELY necessary since you'll get hit with cash advance fees.",
                    "score": 9,
                    "author": "reaper527",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd rather pay the cash advance fee than totally derail my trip",
                            "score": 30,
                            "author": "Ikontwait4u2leave"
                        },
                        {
                            "level": 2,
                            "comment": "A cash advance is like $5….. that’s not some horrible terrible awful idea to take out the equivalent of several hundred dollars for a $5 fee. In Japan it’s common to have a few to take out money even from your cash card at an ATM anyway",
                            "score": 16,
                            "author": "Mercenarian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "cards charge interest on cash advance immediately don't they?",
                                    "score": 9,
                                    "author": "Bobb_o",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Correct. Even if you were to pay it off immediately it still incurs a day’s worth of interest. I tried this out of curiosity; the rep waived it “as a one-time courtesy”.",
                                            "score": 3,
                                            "author": "buzzkill_aldrin"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There are a few credit unions and banks that reimburse some/all ATM fees (the currency exchange fee is separate from this), for example Schwab Bank and Alliant Credit Union.",
                                    "score": 2,
                                    "author": "buzzkill_aldrin"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d just use Charles schwab debit card. Best card for travel, no foreign transaction fees, and atm fees refunded by the end of the month. Plus best customer service ever. I’d also carry 2 debit cards for travel Incase one gets stolen/lost or similar to your case. Sorry to hear that happened glad you got it.",
            "score": 31,
            "author": "hoodfitness",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second on the Charles Schwab checking account and debit card. I’ve used it for over 10 years for travel and international cash withdrawal and paired with an travel friendly credit card, it’s been perfect.",
                    "score": 7,
                    "author": "makked"
                },
                {
                    "level": 1,
                    "comment": "Plus one. Only downside is it takes a few days for funds to be available, assuming you transfer them there from a different account. Usually when I travel I don't want all my travel funds there for the whole trip just for safety's sake. But it means more planning ahead to put a transfer in a few days before you'll need that money.",
                    "score": 4,
                    "author": "spike021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When you open a Schwab account, you have to also open a brokerage account. If you want to only have a limited number of cash sitting in the checking account for safety reasons, then park the rest of the money in the brokerage account. That money sits as money in what’s called money market. You can transfer that money back into the checking as needed. Since it’s transferring within your account, it’s usually instant during business hours and at worst next day.",
                            "score": 4,
                            "author": "turtleneck360",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Whoa I did not realize this before. Wish I'd known this for my previous trips haha. I'll keep this in mind for my next trip later this year. Thanks for the tip!",
                                    "score": 2,
                                    "author": "spike021"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Schwab is great and works at 7-Eleven :)",
                    "score": 3,
                    "author": "DaemonXI"
                },
                {
                    "level": 1,
                    "comment": "I use a Fidelity debit card instead for withdrawals, and it also reimburses ATM fees. I use credit cards with no foreign transaction fees for purchases for rewards and additional security instead of debit, however.",
                    "score": 1,
                    "author": "steveotron"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use convenience store ATMs, I had no problems with 7-Eleven, Family Mart and Lawson ATMs\n\nJapanese bank ATMs don't accept foreign cards, nor do they operate 24/7 for some reason",
            "score": 13,
            "author": "otherpeoplesknees",
            "replies": [
                {
                    "level": 1,
                    "comment": "The small goblins inside the machines need sleep too, you know. Can't violate the labor law.",
                    "score": 7,
                    "author": "HatsuneShiro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wells Fargo charges 3% foreign transaction fee though?",
            "score": 8,
            "author": "Initial_Daikon_8909",
            "replies": [
                {
                    "level": 1,
                    "comment": "Better than no cash.",
                    "score": 12,
                    "author": "HurricaneHugo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "for sure - just letting people know that find this thread.\n\nI don't know what other people experiences are but I'm going to try CapitalOne and Chase Saphire debit for ATMs next week",
                            "score": 5,
                            "author": "NoSeaworthiness5585",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The cap1 debit works fine. Didn’t even get charged the ¥220 withdrawal fee at 7 bank ATMs, although I did at the post office",
                                    "score": 3,
                                    "author": "agentcarter234"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Next time make sure you also use Wells Fargo currency service.  You can request a foreign currency sent to you before you leave the US.  \nIt takes about 3 days.  And I think it was free or a small fee.\n\nAmex travel services also does this if you have an Amex and have a travel service office in your city.",
            "score": 8,
            "author": "irishgator2",
            "replies": [
                {
                    "level": 1,
                    "comment": " it’s no fee. not sure why people want to use cards in Japan unless they’re staying there for a few months.\n\nalso I wonder if op changed the pin to 4 digits",
                    "score": 1,
                    "author": "patrido86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Japan Post ATM is another great place to try",
            "score": 6,
            "author": "MadDogFenby",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just a note, last I tried, their ATMs didn't allow you to enter a pin longer than 6 digits.  7 Bank ATMs were fine.",
                    "score": 1,
                    "author": "ChefBoyAreWeFucked"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you set your debit card for international use? That is what their website says to do. \nWith my debit card, different bank, I can add a notification of foreign travel to prevent transactions from being denied because I am outside of the US. My wife did not do this on a trip to Italy a few years ago and a purchase was denied. Luckily, she got an immediate text from her bank asking if she made a transaction. She responded yes and got a response to try the purchase again and it worked. She then added the travel to her card and had no issues.",
            "score": 6,
            "author": "jeffprop"
        },
        {
            "level": 0,
            "comment": "I used my Wells Fargo debit card to withdraw from 7-Bank ATMs at Narita , 7/11, and at the Japan Post ATM. No issues. Also, there was no need to notify them of travel.",
            "score": 5,
            "author": "bortoni1"
        },
        {
            "level": 0,
            "comment": "Sorry you went through such an ordeal. What happened with the ryokan? You weren’t able to pay for the stay due to needing cash?\n\nI was surprised to find that our ryokan took credit cards…",
            "score": 3,
            "author": "stayonthecloud"
        },
        {
            "level": 0,
            "comment": "from my similar experience with a capital one card, the issue seems to be area based.\n\nhad  the same exact problem where the card wouldn't work. walked down the street and tried a different convenience store, same problem . 7/11, lawsons, family mart, didn't matter. they were all the same thing. walked a little further, and all of a sudden the card worked there.\n\nregardless, i'd definitely recommend having a few different cards you can try if it all possible. there's a decent number of cards with no foreign transaction fees at this point. (capital one, schwab, etc.)\n\nalso worth noting, it's a good idea to let the bank know you're traveling before you go so they don't freak out over a transaction half way across the world.",
            "score": 3,
            "author": "reaper527"
        },
        {
            "level": 0,
            "comment": "I had a similar issue! My BoFA debit mastercard only works with 7/11 &amp; Lawson ATMs. I tried a FamilyMart and it didn’t accept it. Sorry OP, it can be super stressful with money issues abroad. Hopefully you still had a good time☺️",
            "score": 2,
            "author": "catfoodonmyshelf"
        },
        {
            "level": 0,
            "comment": "This is why I don't risk relying on my card and take a stack of cash with me to exchange.  I know the exchange rate is better with ATMs, but it's so easy to end up in a situation like this.",
            "score": 2,
            "author": "ask-me-about-my-cats",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can also just bring a backup card",
                    "score": 1,
                    "author": "agentcarter234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol I'm way too poor to have multiple cards. But for others that is a good plan.",
                            "score": -1,
                            "author": "ask-me-about-my-cats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not like you need to shove thousands of dollars in all your accounts. Just transfer them over to the other account when you need it",
                                    "score": 2,
                                    "author": "RyuNoKami",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd rather just bring cash than open up a whole other account that I don't really need.",
                                            "score": 2,
                                            "author": "ask-me-about-my-cats"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used my WellsFargo, PayPal and Chase cards with 7/11 and different banks without issue between 2009 all the way up to last year. Sounds like something is wrong with your account.",
            "score": 2,
            "author": "superpj"
        },
        {
            "level": 0,
            "comment": "Why couldn’t you transfer money to your boyfriends account if his card was working fine?",
            "score": 2,
            "author": "littlebetenoire"
        },
        {
            "level": 0,
            "comment": "The ATMs and 7/11 stores also work with American debit cards.  The fees are low too.",
            "score": 2,
            "author": "MikeHoncho2568",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you read the part where OP wrote \"neither would 7 eleven\"",
                    "score": 8,
                    "author": "StarlightSharpshot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then it's something wrong with her card specifically, or she mistook a specific bank ATM for a 7-11 ATM. 7-11 ATMs take foreign cards.",
                            "score": 1,
                            "author": "Pzychotix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "don't take it up with me take it up with OP",
                                    "score": 1,
                                    "author": "StarlightSharpshot"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Something very similar happened with my Canadian debit card. Lawson and FamilyMart ATMs stopped working after my first few days. Luckily 7-Eleven continued to work.",
            "score": 1,
            "author": "PPGN_DM_Exia"
        },
        {
            "level": 0,
            "comment": "Whenever we passed a 7-Eleven we checked to see if we needed to stock up on some cash (Canadian cards here)",
            "score": 1,
            "author": "cnucifera"
        },
        {
            "level": 0,
            "comment": "For one of my friends on my trip last November, some 7-Elevens would arbitrarily not work, but then a different location would. A decade ago, I would have the best luck with the ATMs at post offices, but I don't really have any troubles now.",
            "score": 1,
            "author": "luthyr"
        },
        {
            "level": 0,
            "comment": "next time use the atm in the post office, all american cards work, bets currency change . is better bring all the cash you want,  and exchange in all  japan banks . if you not use, just deposit back in usa. all credit cards i use work fine or just use the suica. and before enter story ask suica ok? credit card ok! i know i had visit japan before and use maybe 80% bills using suica or credit card",
            "score": 1,
            "author": "Niko1777"
        },
        {
            "level": 0,
            "comment": "This is why we take a variety of cards.  My husbands wouldn’t work.",
            "score": 1,
            "author": "kaaikala"
        },
        {
            "level": 0,
            "comment": "Lawsons for the win, worked perfect with my debit card for getting out cash. Once I found a working atm, I just kept going back to the same one since it was next to my hotel.",
            "score": 1,
            "author": "cafemofo"
        },
        {
            "level": 0,
            "comment": "About to go on a trip this Saturday and fully planned on using my Wells Fargo card. Thank you SO MUCH",
            "score": 1,
            "author": "BooPandaa"
        },
        {
            "level": 0,
            "comment": "I’ve been using the 7-11 atm here with no issues with my Wells Fargo card",
            "score": 1,
            "author": "Live_Passage3198"
        },
        {
            "level": 0,
            "comment": "I just returned from a trip where I was able to use a Wells debit card at 7-11. Went to a restaurant that only accepted cash and did not have enough. I was thankful there was a 7-11 nearby. My fault for not confirming the restaurant did not accept cards, but that restaurant and one other were the only merchants we used that didn’t accept cards or Suica. My preferred method of payment was Suica.  loaded my Suica card onto my phone and I was able to add more funds as needed using my Apple Card. I was surprised at how many places accept Suica as payment. It was very convenient and no exchange or transaction fees.",
            "score": 1,
            "author": "hegsandbacon"
        },
        {
            "level": 0,
            "comment": "I feel like the top 2 Japan travel tips are to get proper walking shoes, and to always bring cash.",
            "score": 1,
            "author": "ChaoticxSerenity"
        },
        {
            "level": 0,
            "comment": "My Visa cards wouldn’t work but Mastercards would",
            "score": 1,
            "author": "jonnynachos"
        },
        {
            "level": 0,
            "comment": "Similar with me but U.K. based. The only machine that worked for me was in the post office. Very stressful afternoon one day haha.",
            "score": 1,
            "author": "longboytheeternal"
        },
        {
            "level": 0,
            "comment": "Uh my Wells Fargo card did work in every 7/11 in Tokyo so idk what you have on your card that doesn’t work.",
            "score": 1,
            "author": "sugoiiiidesunee"
        },
        {
            "level": 0,
            "comment": "i dont get how people travel overseas without making sure they have money or will be able to get money. it's literally the #1 thing that matters.",
            "score": 0,
            "author": "doubleUTF",
            "replies": [
                {
                    "level": 1,
                    "comment": "My mom traveled to China a few years back and went the batshit insane route of bringing *only her Discover card*. Because she'd called Discover and the representative assured her it was accepted everywhere (even though it's not even accepted at half the stores in her small town) and she was worried about her other cards getting stolen (because it's not like fraud protection exists). She didn't even bring a debit card, because who needs cash? Nor did she exchange currency before the trip. She did not seek advice from anyone who had ever been to China, even though my brother's wife and in-laws she was meeting there are Chinese and would have been happy to answer her questions. She did not go on any forums or blogs about Chinese travel. She did not even contact her hotel and ask if they accepted Discover.\n\nWhat she *did* do was wait until she got to the hotel and found out they didn't accept Discover. Then she embarrassedly accepted my brother's FIL's offer to pay for everything. It was not the dumbest thing she's ever done, but it was close.",
                    "score": 6,
                    "author": "bat_out_of_heck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember being in Beijing years back and they refused to exchange my cash cause people wrote on the bills. None of the bills I had was accepted. At least my credit cards worked.",
                            "score": 1,
                            "author": "RyuNoKami"
                        },
                        {
                            "level": 2,
                            "comment": "lol that is actually batshit. that's what i would expect from someone who had never travelled before but sounds like that wasn't the case.",
                            "score": 1,
                            "author": "doubleUTF"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's very cool, thank you for your contribution.",
                    "score": 4,
                    "author": "nephelokokkygia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Google pay works great in all places, apple pay also.",
            "score": -2,
            "author": "kingrulerguy"
        }
    ]
}