{
    "id": "bgdsao",
    "score": 430,
    "title": "Michelin Guide List/Map - Tokyo",
    "author": "pjolayres",
    "date": 1556006902.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/bgdsao",
    "media_urls": [],
    "other_urls": [
        "https://gm.gnavi.co.jp/restaurant/list/tokyo/)",
        "https://www.reddit.com/r/JapanTravel/comments/822o3n/michelin_star_map_of_tokyo/)",
        "https://docs.google.com/spreadsheets/d/12Yh4wtLR-L7r2DLmJc_7HJH4QmV4e4rQjJlKybv-K_k/edit?usp=sharing)",
        "https://drive.google.com/open?id=1WwcUA4UyztO77BdMVrtYHmcc7NGtRw5L&amp;usp=sharing)",
        "https://github.com/pjolayres/michelin-guide-crawler)"
    ],
    "postText": "I was planning my Tokyo trip around the cheapest Michelin Guide restaurants. The [official site](https://gm.gnavi.co.jp/restaurant/list/tokyo/) didn't help me much. I saw this very helpful [post](https://www.reddit.com/r/JapanTravel/comments/822o3n/michelin_star_map_of_tokyo/) made a year ago but I wanted more metadata (pricing, rating, amenities), so I ended up creating my own.\n\nI thought it was a good idea to share it with the community to help like-minded travelers.\n\n[Spreadsheet](https://docs.google.com/spreadsheets/d/12Yh4wtLR-L7r2DLmJc_7HJH4QmV4e4rQjJlKybv-K_k/edit?usp=sharing)\n\n[Map](https://drive.google.com/open?id=1WwcUA4UyztO77BdMVrtYHmcc7NGtRw5L&amp;usp=sharing)\n\nThis is the [source code](https://github.com/pjolayres/michelin-guide-crawler) for those of you who are interested.",
    "comments": [
        {
            "level": 0,
            "comment": "I've seriously wanted this for a long time thanks!",
            "score": 15,
            "author": "CornellWest"
        },
        {
            "level": 0,
            "comment": "amazing! And thanks for sharing the code as well!\nHow did you convert it to map? :)",
            "score": 8,
            "author": "slallum",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can import spreadsheets from Google Drive into Google My Maps. You can specify which columns to use for the coordinates. It also adds the rest of the row as metadata for the point of interest.",
                    "score": 25,
                    "author": "pjolayres",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, didn't know that, thanks! :)",
                            "score": 3,
                            "author": "slallum"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't recommend Sosakumenkobo Nakiryu enough. Best bowl of ramen I've ever eaten. We tried Sobahouse Konjikihototogisu this year and we're underwhelmed.",
            "score": 7,
            "author": "flimnit",
            "replies": [
                {
                    "level": 1,
                    "comment": "We used to always go to Ichiran ramen as part of our tradition when going to Tokyo. Will try this ramen house next time around.",
                    "score": 2,
                    "author": "pjolayres",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can also recommend Ginza Kagari Honten for great ramen. We went there based on a recommendation on this sub and it was phenomenal. We'd actually gone to Ichiran the night before, and up to that point it was the best ramen of the trip. Kagari blew it out of the water.\n\nI think it's not on your list because they closed in 2017 and didn't reopen at their new location until late 2018. Also I'm not sure if they technically retained the Michelin star at the new location, but the food was certainly that good!",
                            "score": 4,
                            "author": "runwithpugs"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I went to Nakiryu in January 18. It was good, but either my expectations were a bit too high or Tonkotsu ramen is the only kind I get excited for. \n\nWouldn’t mind going back and trying something different maybe. Prices were good.",
                    "score": 1,
                    "author": "Screaming_Emu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the tantanmen is the thing to get at nakiryu!",
                            "score": 4,
                            "author": "ruminant_mammal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s soo good! I waited 3 hours to eat it haha was questioning if I made the right choice until I sat down",
                    "score": 1,
                    "author": "kingoffish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing work! I am also doing a Michelin Guide trip this time from May 23-Jun 3. I had been going down the list manually.\n\nI wish I had thought of doing this programmatically. If I spot any bugs, I'll toss over a pull request.\n\nAgain, great stuff!",
            "score": 6,
            "author": "wiznaibus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I was in the same boat before and going through the list manually. 30 minutes after I started mapping out the budget restaurants within the vicinity of Yamanote line stations, I just gave up and started coding.",
                    "score": 7,
                    "author": "pjolayres",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't give up and did hours too. But I gotta take ur work and gladly utilize the effort u've provided all of us ！love reddit.",
                            "score": 3,
                            "author": "neigetyro"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome! Definitely going to use this. I think the wife and I are headed back early November and taking advantage of Singapore Air's free stopover.",
            "score": 3,
            "author": "Chas_Tenenbaums_Sock"
        },
        {
            "level": 0,
            "comment": "Thank you for this! I'll keep it for my next trip for sure. The one Michelin starred restaurant that I went to is in there (Marugo), and it was really excellent. I'll try to go to one or two of those next time.",
            "score": 3,
            "author": "Ninjacherry",
            "replies": [
                {
                    "level": 1,
                    "comment": "Went to Marugo once before. Had to wait an hour before I was able to go inside and eat but it was definitely worth it.",
                    "score": 5,
                    "author": "pjolayres",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got really lucky. The day before we had seen the line up and given up. The next day we went there 15 minutes before it was supposed to open (according to the website), stood by the door for a minute and they came out to invite us in - apparently they were already open, the website was off.",
                            "score": 3,
                            "author": "Ninjacherry",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a great tip! Will try that next time. I have to admit that Marugo was the reason I started planning my trip around budget-oriented Michelin restaurants. I used to think \"Michelin = expensive\", this was an eye-opener.",
                                    "score": 3,
                                    "author": "pjolayres",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was staying close to it, and when I saw that price wasn't bad then we made sure to pay a visit. I'm not willing to pay hundreds of dollars per person on a meal, but having had that experience I'm really curious to try other places from the guide -- it's awesome that Tokyo has so many not-super-expensive restaurants on their list.",
                                            "score": 3,
                                            "author": "Ninjacherry",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Agreed. There are literally more than a hundred Michelin-listed restaurants in Tokyo alone that nets you less than 5k yen per person.",
                                                    "score": 3,
                                                    "author": "pjolayres"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you kind sir, I will put it to good use!",
            "score": 2,
            "author": "Blazinapfel"
        },
        {
            "level": 0,
            "comment": "Thank you!",
            "score": 2,
            "author": "casanti00"
        },
        {
            "level": 0,
            "comment": "great stuff!",
            "score": 2,
            "author": "huntayo"
        },
        {
            "level": 0,
            "comment": "Wow, that is a lot of work put into this, thank you for sharing!",
            "score": 2,
            "author": "El_Julais",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are welcome. I admit I spent a lot more effort into this than I initially intended. But all is good in pursuit of good food.",
                    "score": 9,
                    "author": "pjolayres"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This sounds fantastic! However, when I try to view the map I get an Error 400 from Google, \"The requested URL was not found on this server. That’s all we know.\"\n\nAnyone else or is it just me?",
            "score": 2,
            "author": "jobsSchmobs"
        },
        {
            "level": 0,
            "comment": "This is oh so relevant to my interests! My brother and I will be there in 3 weeks!\n\nMy first time to Japan. I’m excited to try all the good food I can.",
            "score": 2,
            "author": "Oddacon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eat, eat, and eat some more. Don't show up with diets and hopefully by the end of your travels you'll enjoy something new you've never had before, or couldn't stomach elsewhere. I cannot recommend enough trying as much as you can aside from any food you might be allergic to. If you don't, you'll be like me at home sad that I'm not in Japan enjoying the amazing food.",
                    "score": 4,
                    "author": "Hookem-Horns",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sage advice that I’ll take with me on my travels.",
                            "score": 3,
                            "author": "Oddacon"
                        },
                        {
                            "level": 2,
                            "comment": "Agreed. I made sure not to get the hotel's breakfast option in my upcoming Tokyo trip. I plan to spend all breakfasts, lunches, and dinners in one of these restaurants. As soon as breakfast is finished, i'll probably be heading out to the next Michelin-listed venue and start walking around the area until I get hungry again for lunch.",
                            "score": 2,
                            "author": "pjolayres"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you! So much to eat, so little time. Also, this is a minor detail, but isn't Hashimoto one star?",
            "score": 1,
            "author": "vannguyen17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe it was demoted in the latest issue? [It's listed as bib gourmand](https://gm.gnavi.co.jp/shop/0115029901/) in the official website.",
                    "score": 1,
                    "author": "pjolayres"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great resource! We are going in October and want to be flexible on our food plans. This will help greatly.",
            "score": 1,
            "author": "Peralton"
        },
        {
            "level": 0,
            "comment": "can u tell me about the 'algorithm'? ie did u have to search and google each place and export it, or?",
            "score": 1,
            "author": "balne",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just crawled the [official list](https://gm.gnavi.co.jp/restaurant/list/tokyo/) using Node.js and [jsdom](https://github.com/jsdom/jsdom). The list is paginated so I had to go through each page to get all the URLs for the restaurant details. Once I had the list, I just processed them in parallel (10 per batch) using jsdom again and fetched the information for each restaurant.\n\nNode.js and jsdom allow you to work with the HTML in a way you would a normal javascript in the browser by using document.querySelectorAll(...).\n\nThere are probably better tools out there purpose-built for crawling websites. But I didn't really want to spend hours learning how to use them if I can spend less time (...probably) coding it myself.",
                    "score": 6,
                    "author": "pjolayres",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "y didnt u go w/ python and beautiful soup?",
                            "score": 1,
                            "author": "balne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There really wasn't a practical reason for it. I am currently in a discovery phase around Node.js and wanted to use it in a practical sense outside the usual work-stuff.",
                                    "score": 1,
                                    "author": "pjolayres",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i see i see. ive been meaning to get into nodejs sometime in the future (starting looking into it soonest in 2 months, and latest in 3/4 months). personally i think it's rather difficult from the brief glimpses ive seen.",
                                            "score": 1,
                                            "author": "balne"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saved! Thank you!!",
            "score": 1,
            "author": "summers_tilly"
        },
        {
            "level": 0,
            "comment": "Perfect timing, we will be back in Tokyo for a couple of days next week. Thanks for sharing!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Thank you!!!",
            "score": 1,
            "author": "beast_mistress"
        },
        {
            "level": 0,
            "comment": "This is awesome. Thank you for all the work and for sharing.",
            "score": 1,
            "author": "justchlyn"
        },
        {
            "level": 0,
            "comment": "You are the champion everyone needs. Thank you so much.",
            "score": 1,
            "author": "theaznrunner"
        },
        {
            "level": 0,
            "comment": "I'm not very familiar with JavaScript, so I'm wondering why you chose it rather than something else like Python or Java? I'm assuming JavaScript has more limitations (like what it you wanted to extend this to keep the list/map auto updated?).\n\nRegardless, very interesting tool!!",
            "score": 1,
            "author": "inappropotamus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Python would've been great, but i'm in a bit of a learning spree around Node.js at the moment so I wanted to to put it into practice.",
                    "score": 2,
                    "author": "pjolayres"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing. thanks for sharing",
            "score": 1,
            "author": "qee"
        },
        {
            "level": 0,
            "comment": "This is awesome! Great work! Could you tell me how you added the Yamanote line to your map? I'd love to add it to mine, but can't figure out how. Thanks!",
            "score": 1,
            "author": "MillionDollarBuddy",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can export the Yamanote line stations and polygon as KML/KMZ and import it to your own map",
                    "score": 1,
                    "author": "pjolayres",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome, thanks!",
                            "score": 1,
                            "author": "MillionDollarBuddy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome!! This will be very helpful",
            "score": 1,
            "author": "contactpaper"
        },
        {
            "level": 0,
            "comment": "Would’ve been so amazing if I saw this before I went! What a great list I’ll have to consult it for next time :)",
            "score": 1,
            "author": "QueenKingston"
        },
        {
            "level": 0,
            "comment": "This is also a great good spreadsheet for sites and food in Japan\n\nhttps://docs.google.com/spreadsheets/d/11iFXBe4d0UX5NILBOCnHgFu5MhSFTsDp64To2ViG6GQ/edit?usp=drivesdk",
            "score": 1,
            "author": "djcurry"
        },
        {
            "level": 0,
            "comment": "How do you make reservations for these Michelin restaurants? I haven't looked much into this, but was wondering about it now that I found your post",
            "score": 1,
            "author": "carolinamcaetano",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are some restaurants that do not accept reservations (walk-in only) like Nakiryu. For the rest, I suggest asking the hotel frontdesk to make the reservation for you",
                    "score": 1,
                    "author": "pjolayres"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just stumbled on this and wanted to say thank you. This is insanely helpful.",
            "score": 1,
            "author": "MrALTOID"
        }
    ]
}