{
    "id": "e1zu2q",
    "score": 496,
    "title": "I spent 18 days in Japan. This is what i ate in Tokyo.",
    "author": "darksoulsisfun",
    "date": 1574783814.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/e1zu2q",
    "media_urls": [
        "https://www.reddit.com/r/JapanTravel/comments/e1zu2q/i_spent_18_days_in_japan_this_is_what_i_ate_in/"
    ],
    "other_urls": [
        "https://tabelog.com/en/tokyo/A1323/A132305/13003777/](https://tabelog.com/en/tokyo/A1323/A132305/13003777/)",
        "https://imgur.com/a/5AY3EnM](https://imgur.com/a/5AY3EnM)",
        "https://tabelog.com/en/tokyo/A1312/A131204/13111737/](https://tabelog.com/en/tokyo/A1312/A131204/13111737/)",
        "https://ramendb.supleks.jp/s/27327.html](https://ramendb.supleks.jp/s/27327.html)",
        "https://imgur.com/a/HuukJCy](https://imgur.com/a/HuukJCy)",
        "https://tabelog.com/en/chiba/A1203/A120302/12000422/](https://tabelog.com/en/chiba/A1203/A120302/12000422/)",
        "https://ramendb.supleks.jp/s/282.html](https://ramendb.supleks.jp/s/282.html)",
        "https://tabelog.com/en/tokyo/A1307/A130701/13037382/](https://tabelog.com/en/tokyo/A1307/A130701/13037382/)",
        "https://imgur.com/a/jFmEebG](https://imgur.com/a/jFmEebG)",
        "https://tabelog.com/en/tokyo/A1321/A132102/13058892/](https://tabelog.com/en/tokyo/A1321/A132102/13058892/)",
        "https://imgur.com/a/5JEBitP](https://imgur.com/a/5JEBitP)",
        "https://tabelog.com/en/tokyo/A1313/A131307/13227096/](https://tabelog.com/en/tokyo/A1313/A131307/13227096/)",
        "https://imgur.com/a/OUlsoW7](https://imgur.com/a/OUlsoW7)",
        "https://tabelog.com/en/tokyo/A1302/A130202/13002285/](https://tabelog.com/en/tokyo/A1302/A130202/13002285/)",
        "https://imgur.com/a/jAFXDnO](https://imgur.com/a/jAFXDnO)",
        "https://tabelog.com/en/tokyo/A1302/A130204/13003059/](https://tabelog.com/en/tokyo/A1302/A130204/13003059/)",
        "https://imgur.com/a/f3pi8ol](https://imgur.com/a/f3pi8ol)",
        "https://tabelog.com/en/tokyo/A1302/A130202/13004105/](https://tabelog.com/en/tokyo/A1302/A130202/13004105/)",
        "https://imgur.com/a/IYJbs2m](https://imgur.com/a/IYJbs2m)",
        "https://tabelog.com/en/tokyo/A1324/A132401/13003509/](https://tabelog.com/en/tokyo/A1324/A132401/13003509/)",
        "https://tabelog.com/en/tokyo/A1305/A130501/13016660/](https://tabelog.com/en/tokyo/A1305/A130501/13016660/)",
        "https://imgur.com/a/Evm7IPQ](https://imgur.com/a/Evm7IPQ)",
        "https://tabelog.com/en/tokyo/A1319/A131905/13236380/](https://tabelog.com/en/tokyo/A1319/A131905/13236380/)",
        "https://imgur.com/a/sk27l24](https://imgur.com/a/sk27l24)"
    ],
    "postText": "For easy reference I will be dividing this review based on cities.\n\n\\#Tokyo\n\n\\- **Sutamina-En ( Yakiniku)** [https://tabelog.com/en/tokyo/A1323/A132305/13003777/](https://tabelog.com/en/tokyo/A1323/A132305/13003777/)\n\nTabelog award silver 2017, gold 2018, silver 2019. It is not the easiest of places to get to. I suggest a taxi straight from the train station and be there at 4pm although it opens at 6pm. Yes 4pm, you read that right. The line gets really long quickly and if you do not get into the first seating you are gonna have a long wait (about 2hours plus).\n\nFood pics - [https://imgur.com/a/5AY3EnM](https://imgur.com/a/5AY3EnM)\n\nThe lady boss is extremely friendly for those that can speak chinese, shes from Taiwan. She took really,really good care of us ie gave us extra side dishes, let us try one of their more expensive sake. Theres also an English menu but I didnt really meet any tourists down there. All locals. The beef that they use here is all A5 wagyu and it makes a big difference. Extremely flavourful, tender,  juicy. Dont even bother to think. Just go. Missing this place during your Japan trip is just criminal. Yakiniku at its finest.\n\n**let me share with you guys one incident on why I rate this place so highly. The first time I reached there at 4:45pm I only made it to the second seating, I only got in close to 8pm.\n\nOn our last day in Tokyo we had an 8pm train to Matsumoto. However we wanted to come back again to also thank the lady boss for being so kind to us. We got there at 4pm, dragging our luggage behind us on a weekend. There was already 20+ people in the queue. We were crushed. However amazingly at 5 plus when their guy came out to take orders we were told that we managed to make in into the 1st seating.\n\nSo we waited until 6pm but as the eager customers were ushered in bit by bit until it finally came to our turn they told us that inside was full. We had to wait for the second seating. So we were disappointed again. We had to weigh the options of hoping to get in around 7pm have a quick bite and rush back for the 8pm train or try our luck on the 9pm train. We decided to wait until 7 to see if anyone would somehow leave early.\n\nHere’s the thing about having yakiniku on a weekend. You go in with ur best buds to have the meat feast of your life. You drink, you eat, you order somemore. One eating session takes about 1.5 to 2 hours. When 7pm came about we sadly informed the staff that we would be forfeiting our queue and we requested to take back our luggage from their store which they kindly help us to store earlier. As I was wearing my bags and taking my luggage, the big boss himself came rushing out and told me to wait for 2 mins. He will get me a table. Apparently the staff told their boss about our situation and the boss managed to get a Japanese couple inside to leave early to accommodate us. As we entered the restaurant amazed we saw the boss and the female boss apologising to those 2 profusely.\n\nThis act really impacted me greatly. They went out of their way to let us dine at their place one last time, made sure our food had first priority over others, apologised to us over the 1st&amp;2nd seating incident ,helped us to order their signatures and lastly got a taxi for us to the train station. We made it for the 8pm train.\n\nI doubt many other places in japan would do that for 2 tourists. Hence this is why I rate this place so highly.\n\nDamage: 13,000-17,000 yen for 2 pax. But for the quality and amount it was certainly worth it imo.I went there twice.\n\nOverall: 5/5\n\n&amp;#x200B;\n\n\\- **Menya Itto (Ramen)** [https://tabelog.com/en/tokyo/A1312/A131204/13111737/](https://tabelog.com/en/tokyo/A1312/A131204/13111737/) /  [https://ramendb.supleks.jp/s/27327.html](https://ramendb.supleks.jp/s/27327.html) \n\nTabelog 2019 Bronze. 3rd ranked Tsukemen on ramendb. I use ramendb and tabelog these 2 websites to source for ramen spots in Japan. Just use google translate to navigate, its a goldmine of ramen shops that you have never heard in your life or from tripadvisor websites. Put in some effort and you will be rewarded. Easily accessible, recommended time to get there is 10am to get a queue ticket as well as to buy your ramen from the ticket machine and hand it over to their guy. Ask for the english menu. Reaching at 10am gets you in the first seating at 10:55 to 11am. The good thing about itto that the queue moves fast. Many Japanese male adults finished slurping their bowl of ramen heaven in less than 10 mins. And here I thought I was a fast eater myself. Choose the 1300 yen special tsukemen or the char siu tsukemen. The former gives seaweed the other gives you more pieces of pork. \n\nFood pics: [https://imgur.com/a/HuukJCy](https://imgur.com/a/HuukJCy)\n\nPeople come here for Tsukemen not for the ramen. My girlfriend had the shio ramen and regretted it.Hence we went 2 times lol. Noodles are bloody chewy, broth is a rich mix of meat and seafood flavor that does not leave you dying of thirst after every slurp, the menma (bamboo shoots)has a firm bite and a really good flavor but I need to give special mention to that egg of menya itto. Ive eaten at a few highly rated ramen shops in Japan but my effing god, no one else even comes close to Itto's egg. The yolk is so well seasoned with what I feel is not just normal soy sauce. Just go try it, and do add an additional egg while you are there. Another one of those \"dont think, just go\" places. Look I wanted to try Tomita ok  [https://tabelog.com/en/chiba/A1203/A120302/12000422/](https://tabelog.com/en/chiba/A1203/A120302/12000422/) /  [https://ramendb.supleks.jp/s/282.html](https://ramendb.supleks.jp/s/282.html) but it was just too far.\n\nDamage: 1,300 yen\n\nOverall: 5/5\n\n&amp;#x200B;\n\n\\- **Toshi Yoroizuka Mid Town (Dessert)** [https://tabelog.com/en/tokyo/A1307/A130701/13037382/](https://tabelog.com/en/tokyo/A1307/A130701/13037382/)\n\nThey have a seating area for dine in customers. Menu was about 5-6 dessert items. Seemed average to me only. Wont return.\n\nFood pics: [https://imgur.com/a/jFmEebG](https://imgur.com/a/jFmEebG)\n\nDamage: 3000+ yen for 2\n\nOverall: 2/5\n\n&amp;#x200B;\n\n\\- **Toricho (Yakitori)**[https://tabelog.com/en/tokyo/A1321/A132102/13058892/](https://tabelog.com/en/tokyo/A1321/A132102/13058892/)\n\nTabelog 2019 Bronze. Wanted to try their foie gras hotpot so made a reservation. But you do not need to make one, restaurant was surprisingly empty. Only 2 other groups were in the restaurant. When we reached we were told that they could not serve as the hotpot as the minimum people required was 4pax. We were really disappointed but agreed to have their omakase menu which was about 10+ dishes? Cant really remember exactly.\n\nFood pics: [https://imgur.com/a/5JEBitP](https://imgur.com/a/5JEBitP)\n\nThey serve chicken sashimi so take note for picky eaters. Wasnt exactly the most delicious thing there but o well I managed to down it with a few glups of beer. Cooked chicken dishes were good. Standout dishes were the fried chicken, chicken thigh skewers as well as the porridge. You can choose for a porridge or noodle to end off the meal. Both were very good. Desert was sweetened tomatoes. Kinda disappointed to be honest. Wasnt really blown away but was just pretty good yakitori that i feel i could have found else where for a fraction of the price. Might return for the foie gras hotpot though.\n\nDamage: 4,500yen for 1\n\nOverall: 2.5/5\n\n&amp;#x200B;\n\n\\- **Sushi Dai (Sushi)** [https://tabelog.com/en/tokyo/A1313/A131307/13227096/](https://tabelog.com/en/tokyo/A1313/A131307/13227096/)\n\nWhats a Tokyo trip without the 4am pilgrimage to the legendary Sushi Dai? My advice is to reach there about 4.15 to 4.30 for 1st seating. And your only option is a taxi or if you drive by car. Public transport won’t open so early so do take note. We reached at 4.20 and there was already a queue of close to 10 people infront. They will come out at around 5 plus to ask for your dietary restrictions as well as your order (everyone went for the omakase). Its about 4500 yen for 11 pieces if i recall correctly.\n\nFood pics: [https://imgur.com/a/OUlsoW7](https://imgur.com/a/OUlsoW7)\n\nSushi for me is pretty much split into 2 camps. Either it tastes freakin great and packs a huge load of flavor or its just pretty bland but chewy stuff. Sushi Dai has a pretty good mix of both but im more inclined towards the former. I mean the flounder, squid, white fish are all ok but to me they are boring. I much prefer the ikura roe, uni, otoro kind of pieces and the good thing about here is that after you finish your course they let you order whatever you like. It was freakin awesome, just go order that piece or pieces that you have always wanted to try dont feel shy. Overall, imo if its your first time in Japan, just wake up, grab a cab go and queue for this. I can safely say you wont regret it. I recommend staying at a hotel near sushi Dai so u can take a short hike over in the morning,etc Hotel Daiwa ( this brand of hotel is really good and quite reasonably priced)\n\n**i know how some people might ask if sushi dai is overrated and this is my opinion. Some sushi pieces will taste good irregardless of the Chef skill since it’s heavily dependent on the freshness of the ingredients. The pieces that come to my mind on my favourite sushi pieces are Uni,otoro, ikura and sweet shrimp. All these taste so much fresher, cleaner and sweeter than those I get back in my home country. At sushi dai you aren’t going to get Super crispy seaweed, red vinegared rice, aged/smoked sushi, or any little tweaks that other chefs might do for their own sushi. What u get is a sushi place that due to its proximity to the Toyosu fish market is able to offer me my fav sushi pieces for a fraction of the price in my home country yet 2 to 3 times the flavour. So I say to you guys who might still be on the fence over visiting this place, just go and have the Omakase. But the real fun begins after it. Go ahead and try what the Sea of Japan can offer you. Pretty sure you won’t regret it.\n\nDamage: 10,300 yen for 2 ( we ordered about 4 extra pieces in total)\n\nOverall: 4/5\n\n&amp;#x200B;\n\n\\- **Hidemi Suguino (Dessert)** [https://tabelog.com/en/tokyo/A1302/A130202/13002285/](https://tabelog.com/en/tokyo/A1302/A130202/13002285/)\n\nTabelog 2019 Bronze. Opens at 11am, get there at 10.40 and you will be fine. Pro tip, choose the cakes towards the left of the counter while facing it ( only those few can be eaten at the shop, do not feel pressured and rush through your selection even though theres a queue behind you of hungry and angry people).  You can choose 2 cakes to eat in so CHOOSE WISELY. Takeaway limit im not sure but we took away 2.Staff will stop you even if you try to take a photo of your own cake while eating it. Too bad i managed to snag one shot ：/ Oh yea you have to order a mandatory drink to go along with your cake so take note of the extra cost for those planning their budgets.\n\nFood pics: [https://imgur.com/a/jAFXDnO](https://imgur.com/a/jAFXDnO)\n\nHow was it? Pretty good yea, one of the better places in Japan. The first piece in my picture link is apparently their signature? and only rumoured to have only 10 a day? Im not too sure on this as Im pretty sure they have more than that. Will i return? Yep\n\nDamage: 4000+ yen for 2 pax\n\nOverall: 3.5/5\n\n&amp;#x200B;\n\n\\- **Ningyocho Imahan (Sukiyaki)** [https://tabelog.com/en/tokyo/A1302/A130204/13003059/](https://tabelog.com/en/tokyo/A1302/A130204/13003059/)\n\n16,000 yen for 3 slices of beef. So 2 pax it came up to 30,000+ yen for 6 slices of beef.\n\nFood pics: [https://imgur.com/a/f3pi8ol](https://imgur.com/a/f3pi8ol)\n\nFor that price I could have gone to Sutamina-En and ate 10 times the amount. Beef was good but I found out it tastes much better grilled ala Yakiniku style. This place really made me feel that Sutamina-En was so much value for money. Rest of the meal was forgettable. Appetizers , filler vegetables &amp; dessert was meh.Wont be returning and I urge people who might want to try this place to stay away.\n\n\\*\\*\\*TAKE NOTE\\*\\*\\* The prices on their website for reservation even after you have listed for 2 people is actually only for 1!!! This was something that pissed me off greatly. I thought it was supposed to be 16,000yen for  2pax. !Beware!\n\nDamage: 30,000+ yen\n\nOverall: 1/5\n\n&amp;#x200B;\n\n\\- **Tempura Fukamachi (Tempura)** [https://tabelog.com/en/tokyo/A1302/A130202/13004105/](https://tabelog.com/en/tokyo/A1302/A130202/13004105/)\n\nTabelog 2019 Silver. I only found 3 dishes that met my expectations. The prawn, the rice dish and the dessert. Dont get my wrong, the batter was really good but vegetables and white fish through the entire course made it so boring that I found myself waiting for the meal to end and go out to the nearest yakitori joint.\n\nFood pics: [https://imgur.com/a/IYJbs2m](https://imgur.com/a/IYJbs2m)\n\nDamage:26,000 yen both pax\n\nOverall:2/5\n\n&amp;#x200B;\n\n\\-Obana (Unagi) [https://tabelog.com/en/tokyo/A1324/A132401/13003509/](https://tabelog.com/en/tokyo/A1324/A132401/13003509/)\n\nTabelog 2019 Bronze. Got there at 10.30 and made it only to 2nd seating. Loads of people in the queue, most of them locals. Had better grilled eel in my own country, extremely disappointed. Large is 6000 yen, medium is 5000 yen if i recall correctly. Not recommended. I wanted to try Kabuto  [https://tabelog.com/en/tokyo/A1305/A130501/13016660/](https://tabelog.com/en/tokyo/A1305/A130501/13016660/)  but couldnt get a reservation there.\n\nFood pics:  [https://imgur.com/a/Evm7IPQ](https://imgur.com/a/Evm7IPQ)\n\nDamage: 11,000+ yen both pax\n\nOverall:2/5\n\n&amp;#x200B;\n\n\\- **Narikura (Tonkatsu)** [https://tabelog.com/en/tokyo/A1319/A131905/13236380/](https://tabelog.com/en/tokyo/A1319/A131905/13236380/)\n\nBit into the pork and the only thought was \"sh\\*t, this tastes so f\\*\\*\\*\\*n good\". Do note I went to the main store which is helped by the original Chef and only takes reservations online via omakase website. They have another outlet which accepts walk-ins helmed by his apprentice. Had both the filet and the loin. The filet （round balls, I had the chateaubriand cut which was one of the most expensive items on the menu due to its rarity） were leaner and had a firmer bite. But I preferred the fatty loin, there was another option that was like special rib loin but it was sold out when I got there at 8pm. So if you are going to this place I strongly recommend you try that special rib loin first . Type of pork just choose tokyo X seems like everyone was choosing it. I only had one Tonkatsu meal in Tokyo but i will wager 10,000yen anytime that this is the absolute best place for tonkatsu in Tokyo hands down. Batter is ethereally light and crunchy and that pork..let me describe it to you. You know how aging beef gives its a stronger flavor? This is how I would describe that pork. Immediately upon sinking my teeth into it I was strucked by the strong yet clean taste of pork. No gaminess whatsoever, its 100% pure pork flavor. The LOIN is such a perfect balance of fat and meat that the mouthfeel is so disgustingly luxurious yet it does not leave an oily or nauseating aftertaste that you get from too much greasy food. And the tonkatsu batter gives it that crunch which makes it all the more addictive. They had a collection of sauces to go with your pork, mustard, worcestershire, seaseme oil, soy sauce eg but whatever you choose to complement your pork, the flavor of the pork still shines strongly through. Thats how flavorful their pork is, its pork cutlet on jap steriods.Take note they open their reservations every month in advance and slots fill up quickly.\n\nFood pics: [https://imgur.com/a/sk27l24](https://imgur.com/a/sk27l24)\n\nDamage: 11,000 yen both pax\n\nOverall:5/5\n\n&amp;#x200B;\n\nThis kinda rounds up what I ate in tokyo. Will do up a further review on more restaurants that I tried during my trip if I have the time. Oh yea, I did try Ichiran. And its f\\*\\*\\*\\*n bullshit ramen. Just skip it and save yourself a valuable dinner slot somewhere else. I’ll like to add on that this is solely my opinion. For starters, my Girlfriend loves it. I do not have any animosity against people who like it.\n\n\\*\\*TL/DR\\*\\* In Tokyo, top 3 places are Sutamina-En(Yakiniku), Itto (Ramen), Narikura (Tonaktsu). Sushi Dai comes in at 4th on my list &amp; Hidemi Sugino for dessert.",
    "comments": [
        {
            "level": 0,
            "comment": "This is a great post! I'm so sorry you had a bad experience with that expensive sukiyaki place. Honestly, sukiyaki is the sort of dish that's awesome done at home gathered around the kotatsu. It sucks you spent like 30k on it...\n\nAlso seems like a logical takeaway from this post is that the Tabelog Bronze/Silver places were not really up to snuff. Has this been anyone else's experience? I always find that the inconvenience that comes with a highly-rated tabelog page is rarely worth it. \n\nYou also seem to have spent quite a lot on some 2/5 meals. Would you do anything different next time?\n\nI also agree Ichiran is overrated and overpriced. And consistency is really NOT an issue. All their food comes pre-made. The staff just heat it up. Japanese people always mention how there's no knives at Ichiran locations. It's not really handmade, lovingly crafted stuff like you'd get at a local shop.",
            "score": 25,
            "author": "Aaeaeama",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Also seems like a logical takeaway from this post is that the Tabelog Bronze/Silver places were not really up to snuff. Has this been anyone else's experience?    \n\nTabelog awards are user generated, there are no critical inputs other than the opinions of customers (and possibly other nefarious gaming), which lends to a confirmation bias/feedback loop.\n\nGranted Tabelog is much more critical than Yelp USA, but you open yourself up to disappointment if you plan food travel strictly around a review site, especially if your tastes run towards rich, fatty foods which make up a small piece in the grand scheme of Japanese cuisine.  I can sympathize with OP being non-plussed by the subtleties of leaner proteins and vegetables when he has his eyes set on a dish like foie gras shabu shabu.",
                    "score": 10,
                    "author": "fogindex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahhha kinda unique though.. can’t find foie gras hotpot anywhere in my country",
                            "score": 1,
                            "author": "darksoulsisfun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I value shops like narikura and itto very highly. Shops that give superb flavour at great value. Gonna try to find more of these places. I realised that the correlation between price paid for a meal and how delicious it was is not really that strong even in Japan itself.",
                    "score": 1,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;  the flounder, squid, white fish are all ok but to me they are boring. I much prefer the ikura roe, uni, otoro kind of pieces \n\nYou prefer fattier &amp; higher cholesterol foods, and there is no shame in that (I live in America, where those flavors also dominate).  \n\nMaybe you were judged by some chefs for having a basic palate but over time and repeated trips to Japan you may start to venture towards more balance flavors.  \n\nI appreciate your reviews, much more effort than what shows up on the typical reddit post.",
            "score": 22,
            "author": "fogindex",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thx! Hope it helped",
                    "score": 1,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You not suppose to take tsukemen \"soup\" undiluted.. It too salty you need clear stock to lower the saltiness.\n\nYou can request for it after your finished your ramen (or you can skip finishing the undiluted sauce totally)",
            "score": 18,
            "author": "Ryugadam",
            "replies": [
                {
                    "level": 1,
                    "comment": "yep. they put the tumbler of stock infront of you actually. Actually I meant noodle slurps haha not actually slurping the dipping sauce itself",
                    "score": 3,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just wondering, what did you not like about Ichiran? I always hear good things. Is it all just hype?",
            "score": 9,
            "author": "227111612",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ichiran is definitely overhyped, it's really just the \"omg the noodles come out from the headless man behind the curtain and I'm in my own little cubicle\" gimmick that makes it popular with foreign tourists. Some people like it because it's more customizable than most ramen places (spice, noodle firmness, garlic, etc.) \n\nThe ramen is OK but definitely not worth waiting in any sort of line for. It's kind of like waiting in line for Burger King or something.",
                    "score": 27,
                    "author": "spilk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a shit ton of Japanese people eating at Ichiran too. It's not some tourist trap - it's just consistently offering the same quality food while being convenient. If you enter a random ramen shop, chances are its either great or terrible. Ichiran is consistently \"okay\", which is better than the risk of having shit ramen.",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Ichiran is consistently \"okay\", which is better than the risk of having shit ramen.\n\nThis. Also, if you wait in line for Ichiran, you're doing it wrong.\n\nI appreciate Ichiran the same way I appreciate McDonald's. It's always around, it's always the same, it's open at 4am, it's salty as fuck and it satisfies an immediate craving for something trashy but good. If I want incredible ramen, I'll go get it somewhere else.",
                                    "score": 7,
                                    "author": "laika_cat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would never wait in line for Ichiran as well. It's literally everywhere. But I will go if I'm craving a warm bowl of noodles at 5am in the morning haha. That's my usual routine after spending all night singing karaoke, eat ramen, go back to the hotel and crash.",
                            "score": 5,
                            "author": "MistyMystery"
                        },
                        {
                            "level": 2,
                            "comment": "This. I have tried so many no-name ramen joints that serve better ramen. Never understood the hype over Ichiran.",
                            "score": 2,
                            "author": "manna4all"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;not worth waiting in any sort of line for\n\nThat's every restaurant in Japan.",
                            "score": -7,
                            "author": "randomhelpfull1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you're gonna have to wait in a long line you may as well go somewhere nicer though, which I think is the point they're making.",
                                    "score": 3,
                                    "author": "lewiitom"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ichiran is what to eat when it’s 4am and you’re drunk and need salt and water and the train isn’t for an hour and a half. And at that point, it’s the most delicious thing in the universe, especially with the lovely cold water tap at your seat. Outside of the beautiful missed train hours ... it’s an overhyped, expensive tourist trap.\n\nI apologize to the pro-ichiran fan club. You're not wrong, I just think it has a time and a place and there are far, far better ramen joints that tend to be closed during the week hours of the morning.",
                    "score": 17,
                    "author": "theodorewilde",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is how I feel about Ichiran. It’s perfectly fine in a lot of situations, but don’t pretend that you can’t do much better with some thought and effort. It’s not even the best among other popular chains, IMO. \n\nBut sometimes it’s just a necessity or craving or fills a deep desire. When I’m home I sometimes like to eat Wendy’s or greasy Chinese food. Doesn’t mean those are the best options, it just means I sometimes indulge my body’s whims or sometimes need food at strange hours or in places with very few other options.",
                            "score": 13,
                            "author": "Himekat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What would you say are some better chains available in Tokyo.  For sushi I like zanmai and midori.  And yes I have a real weak spot for Torikizoku.  But for ramen I've always sought out hyped places like kagari, tsuta, mugi to olive, etc.  \n\nAlways looking for a decent and readily available chain place, if you have some for ramen or other foods, please do tell, thanks!",
                                    "score": 2,
                                    "author": "deleteriousdelirium",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree on Zanmai. It’s my go-to ‘I want cheap sushi right this instant’ place. \n\nI like Ippudo for ramen because I have a soft spot for Hakata-style ramen (which I think Ichiran also is, but they are different from each other). \n\nI also really like Ikinari Steak for a quick and cheap lunch. It’s incredibly consistent between locations and really fast, which is good. \n\nYoshinoya or Matsuya are my middle-of-the-night or early morning breakfast places when I just want some fast food. It’s the best kind of trashy garbage. (:\n\nAnd who doesn’t love some greasy Lawson or Family Mart fried chicken once and a while?",
                                            "score": 8,
                                            "author": "Himekat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh yeah. I love all those. I haven't been to ikinari but have seen many. Thanks for the recs!!",
                                                    "score": 3,
                                                    "author": "deleteriousdelirium"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is positively *nothing* wrong with a food serving this purpose, either. I think it's important to know the distinction. Some of my favorite meals in Japan were not the \"best\" meals, but were meals eaten bleary eyed at 2AM, full of whisky and looking for something with substance to keep me alive.",
                            "score": 8,
                            "author": "FranzAndTheEagle"
                        },
                        {
                            "level": 2,
                            "comment": "aye aye man. 100% agree.",
                            "score": 2,
                            "author": "darksoulsisfun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ichiran is the least tasty ramen I've had in Japan. I'm not saying it's bad, but the rabbit hole goes much, much deeper.",
                    "score": 13,
                    "author": "skl007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think Ichiran is \"safe\". The ramen is just okay, but for many western tourists, it's an approachable experience to just \"having ramen while on vacation in Japan\". I would certainly say the Chashu is sub-par. It reminds me of sliced deli meat vs. unctuous umami pork belly.",
                            "score": 12,
                            "author": "2weekrental"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The best thing about Ichiran is that they have a lot of locations, but not all stores have the consistency.  You really are better off looking for a smaller ramen restaurant.\n\nI understand why people like Ichiran, Saboten, Sukiya, and Coco Ichibanya, but to me they just don't have the consistency or the quality.  If you look harder there are definitely better restaurant, even if they may not be English accessible.",
                    "score": 12,
                    "author": "NaclyPerson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What? People like the chains because they're consistent. Are there better restaurants than CoCo, ichiran or sukiya? Yes there are but there's also a billion worse ones while the chain ones offer the same quality everywhere. \n\nPeople just don't know what truly is \"bad\" because when they're in Japan, they're there for two or three weeks and literally everything tastes great to them, even going as far as to say that the conbini food is \"great\".",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe im in the minority but I absolutely love Ichiran and have been to numerous ramen joints over two visits to Japan.",
                    "score": 8,
                    "author": "pullandbear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People like to be special and say that it isn't good because there's a new picture on Reddit of it everyday",
                            "score": 0,
                            "author": "jimmycfc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it's good, I just think people here over-hype it lots. I've had lots of worse bowls of ramen in Japan, but I've also had plenty of better ones too - I really don't think it's the pinnacle of Ramen like I see some people here say.\n\nI do also agree that some people just like to hate on it because it's popular though, it's by no means bad.",
                                    "score": 3,
                                    "author": "lewiitom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep spot on, it actually is one of my favorites. I just dont like how everyone jumps on the hate train because they tried some back alley Ramen once that nobody else has heard of so Ichiran must be bad",
                                            "score": -1,
                                            "author": "jimmycfc"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ichiran isn't bad, it just isn't good. The broth is solid with a little vinegar added, but everything else is just ok. The pork doesn't have a lot of flavor. The chili sauce is sweet and good, but you don't get much. Personally, I think their thin noodles are garbage. If you're not used to good ramen, it will be great, but you'll be missing out on much better local options.",
                    "score": 5,
                    "author": "Untrained_Monkey"
                },
                {
                    "level": 1,
                    "comment": "Ichiran is fine, but it's nothing special. I'm not really sure why this sub seems to love it so much, it's just a chain restaurant.\n\nIf you fancy some decent ramen and aren't sure where to go, it's a safe bet because there's a load of locations, and I've still enjoyed it when I've been - but I've had much better ramen in Japan.",
                    "score": 5,
                    "author": "lewiitom"
                },
                {
                    "level": 1,
                    "comment": "It's seemingly only hyped up in this sub. No one I know in real life likes it. No \"food people\" or big travelers that I know like it.",
                    "score": 3,
                    "author": "CercleRouge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i would consider myself a food person and am pretty well traveled, i also live in my city's Japantown, and i liked Ichiran! did it blow my mind? no, but i certainly enjoyed it and brought home a few packets. i liked that it was open at all hours too, so it ended up being breakfast a couple times during my trip a few weeks ago.\n\nedited to say that i definitely ate at other ramen restaurants as well! did not limit myself to Ichiran.",
                            "score": 5,
                            "author": "lynxpoint"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s mediocre ramen, plus the wait time is usually long due to its popularity, definitely not worth it.",
                    "score": 2,
                    "author": "Aira_"
                },
                {
                    "level": 1,
                    "comment": "Agreed. Ate here and it was average compared to many other places. It wasn’t horrible, just boring.",
                    "score": 1,
                    "author": "spartacus_nz"
                },
                {
                    "level": 1,
                    "comment": "Noodles are overcooked and have no bite to them. Char Siu is like dried cardboard. Soup is barely passable. Egg is horrendus, just hardboiled with no flavour. all hype.",
                    "score": -1,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As I said above, it's a safe bowl of ramen for a western tourist. No fuss. I do agree the chashu is like sliced deli ham though. There are several ramen shops in any city usually across, up, below, or around the street. So many to try.",
                            "score": 9,
                            "author": "2weekrental"
                        },
                        {
                            "level": 2,
                            "comment": "Wow I'm surprised to hear that. I found their noodles to be the best thing they had :o",
                            "score": 8,
                            "author": "basedBlcktee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "errmm just my humble opinion on ichiran out of many others out there. Its fine if other people like ichiran. my girlfriend enjoyed it tremendously. heh.",
                                    "score": 0,
                                    "author": "darksoulsisfun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like the other person said, with so many stores, quality is gonna be inconsistent. I enjoy Ichiran, but it's more like a late night, spur of the moment 'snack' rather than a dedicated meal sort of thing.",
                                            "score": 5,
                                            "author": "EunjiisGG",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think consistency is an issue as all Ichiran's food comes pre-made. All the staff do is heat the soup+noodles and serve it.  \n\nI agree it's a good and quick late night meal, but I think it isn't very tasty. It's just mass produced ramen with consistency being the goal, not deliciousness.",
                                                    "score": 3,
                                                    "author": "Aaeaeama"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ichiran is fucking amazing, dont listen to all these Japan/Ramen elitists",
                    "score": -2,
                    "author": "jimmycfc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is an amazing post. Just curious, which other cities are you going to \"review\"? I am leaving in a week and this is extremely useful",
            "score": 6,
            "author": "bergen7563",
            "replies": [
                {
                    "level": 1,
                    "comment": "hmm, Kanazawa, toyama, matsumoto, kyoto, osaka,",
                    "score": 3,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Curious to see where you went in Toyama! I live there and could do with a few more food recommendations!",
                            "score": 1,
                            "author": "lewiitom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha don’t get your expectations up. Was only there for 2 days. Good experience though !",
                                    "score": 1,
                                    "author": "darksoulsisfun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly there's not much to see in Toyama so don't blame you for not staying longer!",
                                            "score": 1,
                                            "author": "lewiitom"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you this is awesome!! Going to some of these places next week. Only thing that would be more helpful is adding where in Tokyo these places are (ex. Shinjuku, Shibuya, etc.)",
            "score": 3,
            "author": "umichinsf",
            "replies": [
                {
                    "level": 1,
                    "comment": "will do :D",
                    "score": 2,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fucking awesome list. This is how I like to do it too. 3.6 or higher usually. Always shaking my head reading trip reports in this sub where people had half their meals at 7-11. On my last trip a month ago, I met up with some random friends from my hometown who happened to be in Tokyo at the same time as me, and they brought me to some tourist trap yakitori place. I was kicking myself for the next 2 days because I had wasted one single meal at a crappy place. \n\nMenya-Itto is one of my faves too.",
            "score": 3,
            "author": "CercleRouge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, I would normally totally agree with you in regards to people wasting meals at 7-11 but in this case I dunno... there's some pretty expensive mediocre meals listed. I'll take an onigiri and salad chicken from 7-11 over six slices of beef for 30k.",
                    "score": 24,
                    "author": "Aaeaeama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too. But i didnt know T\\_\\_T",
                            "score": 2,
                            "author": "darksoulsisfun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It happens to everyone! All my favorite meals have been eaten in Japan but I've also eaten a few of my worst in the country as well. \n\nThere's always next time!\n\nAlso, I really appreciate your candor with this post. A lot of people won't admit to being disappointed by hyped up meals.",
                                    "score": 3,
                                    "author": "Aaeaeama"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sometimes you want quick and tasty, and kombini food supplies that.  Sometimes a sushi-go-round is great if you're hankering.",
                    "score": 3,
                    "author": "kvom01"
                },
                {
                    "level": 1,
                    "comment": "I love your comment about wasting \"one single meal\".  When I was in Tokyo this summer, the people I was traveling with twice picked a meal based on just wanting to get something and not wanting to put in minimal wait or effort.  It drove me nuts.  Each meal must be cherished (including Egg Salad at 7-11 for breakfast).",
                    "score": 3,
                    "author": "FreshlyCured"
                },
                {
                    "level": 1,
                    "comment": "I know that feel ya. I mean I can only go on Holiday once a year so I actually did a lot of homework and planning around the restaurants opening period, their off days and distance from tourist spots that I was planning to drop by. Took me about 2months.",
                    "score": 3,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A man spent 18 days in Tokyo, this is what happened to his diet...",
            "score": 4,
            "author": "IamPsauL"
        },
        {
            "level": 0,
            "comment": "Narikura was probably the best meal I’ve ever had. I didn’t know they had more than one location, but the one I went to in January didn’t require a reservation. They did have a waiting list at the door though, so we found a nearby cafe to kill the hour or two. I had the Tokyo X pork in the fattiest cut available, and it was just insanely good. You’ve nailed the description too, somehow it’s a super intense pork flavour without being at all overpowering. God I can’t wait to go back one day.\n\nWe also tried Marugo, which is the other place many people compare it to. It was a great meal too, but maybe a 7 or 8 compared to Narikura’s perfect 10.",
            "score": 3,
            "author": "thfsgn",
            "replies": [
                {
                    "level": 1,
                    "comment": "The one without reservation is helmed by the apprentice. The other is by the original Chef himself.",
                    "score": 2,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah cool, the one I went to didn’t allow photos so next time I’ll try to go to the OG and capture some memories.",
                            "score": 1,
                            "author": "thfsgn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do let me know if the taste differs! Interested to find out for myself",
                                    "score": 1,
                                    "author": "darksoulsisfun"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do you remember the location of each shop? It looks like the original one is near shinjuku iirc. One other question, what site did you reserve on for the original location?",
                            "score": 1,
                            "author": "nayrxx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can only reserve on the Omakase website.\n\nOriginal shop is at Shinjuku. The original Chef is at the new shop.\n\nhttps://omakase.in/en/r/qw473765",
                                    "score": 1,
                                    "author": "darksoulsisfun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the link!",
                                            "score": 1,
                                            "author": "nayrxx"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Narikura was my first ever meal in Japan. Literally unforgettable experience. I like to think it's been a big part of me coming back to Japan three times now. \n\nAlso Menya Itto is up there for me as well.",
            "score": 2,
            "author": "vanillagorilladx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Narikura is absolutely my favorite tonkatsu spot. I make it a point to go every trip to Japan. I need to try their new restaurant with the reservations. Recommend checking out Tonkatsu Hinata as well. \n\nI need to check out Menya Itto.",
                    "score": 2,
                    "author": "FlipMixer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "10000yen for the  tonkatsu is a fucking rort. Last time I went it was not that expensive... maybe if you went with the largest lion and fillet cuts and had 4 beers too...\n\nThough I have eaten that much before myself... haha\n\n Natikura is definitely one of the best. Kappo Katsuzen is also good but it seems dumb doing a fine dining tonkatsu experience\n\nSomewhere like Marugo is much better value for money and what I would recommend most people.\n\nOh man, my mouth is watering.\n\nMenya itto is a good choice. Tsukememmichi and Yakumo  are not all that different. Comes down to noodle and broth preferences only. \n\nSutamina-En is great but I think yakiniku in restaurant settings overrated when I can recreate the culinary experience in more enjoyable environments. Still, you are right about the master, she is great. Service is topnotch.",
            "score": 2,
            "author": "THE_CUNT_SHREDDERR",
            "replies": [
                {
                    "level": 1,
                    "comment": "Word. hey hey i wanted to try Maguro too before i decided on Narikura. How does it compare in terms of flavour only?\n\nSeems like we went for similar places my friend.",
                    "score": 2,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Delicious food and friends are the two main  reasons I keep coming back. Probably like food as much as each other and use Tabelog. I just look for the highest scores in an area if I am not with friends/locals. Or I go out of my way to award places.\n\nHmm flavour only... slight differences in the pork flavour, both as good as each other I think. I want a blind side by side  comparison to be sure haha. \n\nI think texture is better at Narikura but not by much. Batter maybe a little on the heavy side at Marugo too. \n\nThat is comparing it to Narikura so Marugo is  still top tier tonkatsu in every respect and cheaper too!",
                            "score": 1,
                            "author": "THE_CUNT_SHREDDERR"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "wow thx for the comments guys. I will probably try to put in more details when I have the time so you guys can better visualize whats its like for each restaurant.",
            "score": 2,
            "author": "darksoulsisfun"
        },
        {
            "level": 0,
            "comment": "&gt;  Oh yea, I did try Ichiran. And its f****n bullshit ramen. Just skip it and save yourself a valuable dinner slot somewhere else.\n\nIchiran is the McDonald's of ramen. There is a time and a place for it, just like there is with the fanciest and most expensive food. \n\nDoes it claim to be groundbreaking, incredible bowl of ramen made with super special ingredients sourced from some rare or famous outcropping in the mountains somewhere? No, and it shouldn't be regarded as such. Can you get better ramen at a similar price point — sure, but not at 4am!\n\nHopefully you also had a chance to sample some of the less high-end stuff Tokyo has to offer. There is delicious, incredible and affordable food (that isn't a massive chain like Ichiran) to be had in Tokyo — and it's arguably better than a lot of the more expensive, over-hyped stuff out there.",
            "score": 1,
            "author": "laika_cat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. just don’t understand why it’s so hyped up by people to be like the best bowl of ramen they have eaten in their lives. Was kinda under this perception due to reading so many reviews.",
                    "score": 0,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think a lot of people may not have had ramen outside of instant ramen before? Or come from cities where there are no ramen restaurant / really, really bad ramen restaurants?",
                            "score": 1,
                            "author": "laika_cat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for the notes! Definitely saving these tips",
            "score": 1,
            "author": "Tequila-M0ckingbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad it helped",
                    "score": 1,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome write up!\n\nI'll be spending 2+ weeks in Tokyo and will definitely be hitting up some of these!\n\nWould any of these places be particularly difficult to eat at not knowing any Japanese?",
            "score": 1,
            "author": "chop-chop-",
            "replies": [
                {
                    "level": 1,
                    "comment": "All the above was generally fine because Tokyo sees alot of tourists and many restaurants have probably 1 guy who is more well-versed in english. I did not know any japanese but their small command of the english language plus my hand signals were enough to get me through. Many of these places have an english menu though.",
                    "score": 2,
                    "author": "darksoulsisfun"
                },
                {
                    "level": 1,
                    "comment": "If you're going to be in Tokyo, I recommend you also try the tsukamen from Tatsunoya in Shinjuku. I miss that stuff every day.",
                    "score": 1,
                    "author": "Untrained_Monkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Will do!",
                            "score": 2,
                            "author": "chop-chop-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excellent post. Given us some ideas for our trip!  \n\n\nI will delete Ichiran from our plans :(",
            "score": 1,
            "author": "geekything",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should go and experience it at least once!",
                    "score": 5,
                    "author": "Cheehu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay, will add it back in :)",
                            "score": 4,
                            "author": "geekything"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "unless you have a very quick trip, i think it's worth going to Ichiran at least once! it's not going to blow your face off with flavor, but it's a solid bowl of ramen. plus, it's fun and different. my introvert boyfriend loved it, hah.",
                    "score": 4,
                    "author": "lynxpoint",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We're going for 18-days! It's probably better than most of the ramen we get in Canada. The thing that attracted me was the lack of human interaction!",
                            "score": 1,
                            "author": "geekything",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "with 18 days, definitely go! we were there for 14 days and went a couple times. was it the best ramen we had? no. but we enjoyed it, and the fact it's open 24 hours is helpful!",
                                    "score": 2,
                                    "author": "lynxpoint",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Would you say the ramen is good for a 8-year old in terms of taste?",
                                            "score": 1,
                                            "author": "geekything",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "sure! they are customizable in terms of spice, garlic, and add-ons, so you can make it as simple as you'd like. if you like spicy, i'd recommend level 5 or higher. enjoy!",
                                                    "score": 1,
                                                    "author": "lynxpoint"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do yourself a favor and search for Ramen Beast on the App Store or instagram. Just pick any store from their list, it would be better than Ichiran.",
                    "score": 1,
                    "author": "Aira_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did use ramen beast website for some insights too. Great stuff they have going on there",
                            "score": 1,
                            "author": "darksoulsisfun"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great write up.  Thank you.  I'm going to add a few of these places for my next trip.",
            "score": 1,
            "author": "Micalas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thx!",
                    "score": 1,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for this excellent post. I can't believe how poor the presentation for 100€+ food is. And apparently it tasted not great either. Kind of a bummer.",
            "score": 1,
            "author": "jonnyaut",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea..hopefully this can help others make a more informed choice",
                    "score": 1,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Already had Menya Itto on my list for March.  Looking into Narikura now.",
            "score": 1,
            "author": "kvom01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please add in Sutamina-En. I insist. Abit pricey but a Yakiniku experience you wont forget. Just a small space filled with people talking and laughing over the smokiness of grilled meat everywhere. Good stuff.",
                    "score": 1,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just curious, how is that place different from most other yakiniku places that are not chains? I think eating only A5 will be the same price level anywhere (but I don't think most people would enjoy that much fat anyways), so why that specific recommendation.",
                            "score": 1,
                            "author": "Wahrn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the service there. U really feel like you are eating at a friends place and Price wise I think it’s marginally cheaper there too. They also give u a very hot cast iron cooker that cooks the meat within seconds unlike some places which takes forever to cook.",
                                    "score": 1,
                                    "author": "darksoulsisfun"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How far in advance did you have to reserve Narikura?",
            "score": 1,
            "author": "DiscombobulatedTop",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can’t reserve too far in advance as you have to take note of when the window of your intended date opens up for reservations. I reserved it on the morning of the day itself when the window opened usually a month before. I was not able to get any 6-7pm slots already so seats get reserved very quickly. You want the earlier slots to avoid some items being sold out",
                    "score": 2,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see so it's not like it's impossible to book on the day. We might just kit get the time slots we want.\n\nJust checking, I had planned to go to Narikura but at that time it was still near Shinjuku. Now it's moved to Suginami which is the one where you visited.\n\nDo you know if the other one closed or do they have two branches?",
                            "score": 1,
                            "author": "DiscombobulatedTop",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2 branches. You can try your luck on the website but I made my reservation a month in advance. On the morning when they started taking reservations for the upcoming month. Did not manage to get 6-7pm seating.",
                                    "score": 1,
                                    "author": "darksoulsisfun"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really wanted to go to Sutamina-En on my last trip but it’s so far out of the way I just didn’t get to it. Never heard a bad thing about it though, and they seem like such nice people. Will definitely check it out next time. \n\nGreat read.",
            "score": 1,
            "author": "Parrotshake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do try and let me know how it went !",
                    "score": 1,
                    "author": "darksoulsisfun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Next time try Nabezo for sukiyaki and get the Japanese beef. One of the best experiences I had in japan",
            "score": 1,
            "author": "ExShinraSldr",
            "replies": [
                {
                    "level": 1,
                    "comment": "wow thx for this recommendation. Seems good. May I know what’s the pricing like ?",
                    "score": 1,
                    "author": "darksoulsisfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s all you can eat for 90 minutes, 4800 yen per person",
                            "score": 1,
                            "author": "ExShinraSldr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "sounds like a really good deal",
                                    "score": 1,
                                    "author": "darksoulsisfun"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hmmm, did you try the Burger King avocardo and mayonnaise burger?",
            "score": 1,
            "author": "TomodachiMike",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry no :x",
                    "score": 1,
                    "author": "darksoulsisfun"
                }
            ]
        }
    ]
}