{
    "id": "yyi58b",
    "score": 725,
    "title": "When in Rome - an irritated rant",
    "author": "blissiictrl",
    "date": 1668771936.0,
    "url": "https://www.reddit.com/r/JapanTravel/comments/yyi58b",
    "media_urls": [],
    "other_urls": [],
    "postText": "My partner and I (Australian) have been here for almost a week of our three week stint now, and I have to say for the most part, other (obvious) tourists from most countries have been pretty good in respect to wearing a mask in indoor settings, abiding by the general Japanese mindset of being considerate and respectful of others around them etc.\n\nBut for those of you I've noticed on my travels being maskless or with it tucked firmly under your chin, why? The Japanese (especially older generations) were so hesitant to get tourism back to Japan after the pandemic and you are shining examples of why the older Japanese generally don't like western tourists!! Just wear the fucking mask and shut the fuck up! If you don't want to wear it, then don't come here until things ease up. The signs are literally everywhere at shops, trains, whatever. \n\nThe kicker was today my partner and I saw three Aussie tourists, young guys in Kyoto at a tourist destination and one of them was getting irritated because the facility staff were super hesitant to let him in without a mask. Like for fucks sakes mate, how hard can it be to wear it for the hour it took to walk through the castle?\n\nPlease, stop giving the Japanese reasons to dislike tourists and just abide by their requirements while you're here. Masks are like 350 yen for a 4 pack.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm locking it as this type of posts have a tendency to lead to comments, which are untrue, unhelpful or misleading (and I'm sorry OP - your intentions were fine).\n\n**If you are coming to Japan, know that majority of Japanese still wear masks and while there is no mask mandate - it's still recommended to wear masks on public transport and whenever talking or unable to keep the distance.** Please also note that Japanese business are free to refuse service to anyone, who does not accept their rules including wearing masks.",
            "score": 1,
            "author": "mithdraug"
        },
        {
            "level": 0,
            "comment": "I’ll say, when I was in other parts of Japan on my trip these last two weeks (Tokyo, Nagasaki, Hakone, Takayama, etc), most foreigners I saw were wearing masks. But in Kyoto maybe only 1/3 of them were. I would get pissed every time I saw this. Guys, the hell, just wear the damn mask. These people are ruining it for the rest of us and making us look bad.",
            "score": 242,
            "author": "MrBananaLips",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be frank I have ADHD and a hallmark of this is that if we don't understand the rules, we don't tend to want to follow them but if we do, and others don't, we get very irritated with them (generally). But my neurotypical partner is getting just as irritated as me as are others",
                    "score": -146,
                    "author": "blissiictrl"
                },
                {
                    "level": 1,
                    "comment": "Nobody is ruining anything for anyone, other than maybe themselves. And nobody is going to look poorly upon you if you're wearing your mask just because other people aren't.",
                    "score": -167,
                    "author": "tsukamaenai"
                },
                {
                    "level": 1,
                    "comment": "Wearing a mask is not required outdoors and I have seen plenty of Japanese people not wearing them",
                    "score": -177,
                    "author": "Immersion4509"
                },
                {
                    "level": 1,
                    "comment": "Wearing a mask is not required outdoors and I have seen plenty of Japanese people not wearing them",
                    "score": -188,
                    "author": "Immersion4509"
                },
                {
                    "level": 1,
                    "comment": "Wearing a mask is not required outdoors and I have seen plenty of Japanese people not wearing them",
                    "score": -196,
                    "author": "Immersion4509"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm an Australian, and it's always the fucking Australians when it comes to dickhead tourists in Japan. Precovid, bogans quickly started to realise how cheap and accessible Japan is to us and have started treating it like a more upscale version of Bali.",
            "score": 185,
            "author": "OakieDoker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope the cost of flights going up deters the shittier Aussie tourists tbh. It's such a unique country with so much to offer and I feel like Aussie tourists are ruining it for more serious tourists",
                    "score": 43,
                    "author": "blissiictrl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just got back from my 2 week trip and I agree with everything you said. Every time I saw a foreigner not wearing a mask I kinda just shook my head. It literally is baffling. We've been waiting YEARS to come back to Japan how hard is it to just follow how the rest of the society is behaving and play along? \n\nMind you, I did see some Japanese not wearing masks and thats on them. Even a friend of mine (Japanese) didn't wear one when we went out, but being the foreigner myself I still wore mine just out of respect for those around me.",
            "score": 85,
            "author": "Mghart",
            "replies": [
                {
                    "level": 1,
                    "comment": "This has been our mentality. I definitely drop mine if I'm in an uncrowded open space where it feels right to do so but if I'm in the streets or inside it's basically glued to my face. A good example is when we were in Nijo Castle today, the only time it was off was when strolling through the castle grounds and gardens as it was super quiet and sparse with people",
                    "score": 21,
                    "author": "blissiictrl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 56,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you're outdoors and stay outdoors in an uncrowded situation, you're pretty much fine, but that means you'll need to put your mask on/off all the time (entering a shop, taking the subway, etc.)",
                    "score": 25,
                    "author": "Titibu"
                },
                {
                    "level": 1,
                    "comment": "We play it by ear and see what generally seems to be happening",
                    "score": 4,
                    "author": "blissiictrl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was there last year (married to a Japanese person, so I could get a visa), we masked up, and so did most Japanese people - I noticed though, from the masks we bought in the convenience stores, that the masks are just for display. Those masks most people wear are so thin, with relatively \"large\" holes in them that they don't have any effect at all on viruses. You can see through most of them because they are so thin.\n\nWe came to Japan wearing those European hardcore barely breathable FFP2 masks - that we were used to - but since everyone else was wearing the thin \"just for show\" mask, we switched to those as well.\n\nI am going to Japan again in January, and of course I will wear those masks, but... It is sort of a silly show. I respect Japanese culture and do wear the mask, but it is an excellent illustration of one of the not so great parts of Japanese culture.",
            "score": 55,
            "author": "DJpesto"
        },
        {
            "level": 0,
            "comment": "Aussies not respecting Japanese culture????? Who would of thought….",
            "score": 44,
            "author": "Phisheman81"
        },
        {
            "level": 0,
            "comment": "Yes I also noticed that in Kyoto lots of foreigners are not wearing masks. It is quite annoying seeing them like that. I haven't seen this elsewhere.",
            "score": 27,
            "author": "ParticularLivid9201"
        },
        {
            "level": 0,
            "comment": "Wearing a mask is not required outdoors and I have seen plenty of Japanese people not wearing them",
            "score": 27,
            "author": "Immersion4509",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes and no, it's more prevalent than not in my experience and outside isn't required. I'm getting more irritated with the people I've seen not doing it inside where it is still mandatory. Tourists seem to love playing the dumb tourist",
                    "score": 31,
                    "author": "blissiictrl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is literally no mask mandate in Japan.",
                            "score": -44,
                            "author": "AvatarReiko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.mhlw.go.jp/stf/covid-19/mask.html\n\nI stand somewhat corrected although the government states right here in public if you can't social distance to wear one.\n\nWhen we got our clearance for entry it was stated as such so clearly has changed",
                                    "score": 19,
                                    "author": "blissiictrl"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s not mandatory by law anywhere here. The Japanese still believe in personal freedom.",
                            "score": -56,
                            "author": "Taido_Inukai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From what I've read according to the Japanese government that only seems to apply if you're able to fully socially distance and aren't talking, which is quite difficult to do in a lot of places given the sheer density of population.\n\nhttps://www.mhlw.go.jp/stf/covid-19/mask.html\n\nAlso the vast majority of places I've been have required it for entry, so regardless of it being by law it's still a choice of the establishment's owner. When we arrived we were advised to err on the side of wearing one",
                                    "score": 28,
                                    "author": "blissiictrl"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mask is firmly adhered to my face so they can’t see how red with embarrassment I’m turning while I stammer out basic Japanese 🥲\n\nBut uh, actually, any recommendations for places to buy something nicer than the disposable packs of masks?",
            "score": 19,
            "author": "jotapeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "My friend recommended the Victorian brand masks at Matsumoto Kiyoshi (the drug store).",
                    "score": 8,
                    "author": "hey_MrNoTime"
                },
                {
                    "level": 1,
                    "comment": "Honestly I'm actually impressed with the quality of the masks but I have seen less disposable more long term masks at some of the drug stores. We just picked up some fresh ones and they have a really nice soft ear loop, alternatively I found some loop stretchers for masks at don quijote in Tokyo that were a godsend",
                    "score": 5,
                    "author": "blissiictrl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I made a post in a thread a few weeks ago about how I thought 70% of foreigners were wearing masks, but then I started to pay more attention to it. For every 10 foreigners I see, maybe 4 or 5 of them are wearing masks. It also gets pretty annoying when they’re blocking other people’s path or generally being oblivious of other people around them.",
            "score": 19,
            "author": "JollyManufacturer",
            "replies": [
                {
                    "level": 1,
                    "comment": "It pisses me off when I see people blocking paths etc and my partner and I are super aware that if we're side by side holding hands and people are coming we will switch to one behind the other",
                    "score": 7,
                    "author": "blissiictrl"
                },
                {
                    "level": 1,
                    "comment": "What about the Japanese people who not wearing masks? Are you going to the say the same thing to tell?",
                    "score": -18,
                    "author": "AvatarReiko"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This post is so refreshing to see! We've been in Tokyo for three days now and the majority of maskless people we've encountered were foreigners. I don't know if I'm imagining it but every single one of them have a holier-than-thou smug look on their face (like a bed bug). I'll sometimes see just the wife wearing a mask but it's always the husband that refuses to wear one. These are the same people that look at others as NPCs.",
            "score": 9,
            "author": "jedimustafa"
        },
        {
            "level": 0,
            "comment": "**Just a reminder that our FAQ is being updated with more information and you can start** [**here**](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel) **with regards to trip planning if you need tips, or have questions about planning your travel to Japan.**  \n\nThank you!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JapanTravel) if you have any questions or concerns.*",
            "score": -1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Wearing a mask is not required outdoors and I have seen plenty of Japanese people not wearing them. One rule for Japanese people but another for tourist.\n\nModerators should lock this as these types of threads almost always turn nasty",
            "score": -34,
            "author": "AvatarReiko",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I have seen plenty of Japanese people not wearing them\n\nMight be linked to the fact that you see mostly Japanese people anyway...\n\n&gt;Moderators should lock this as these types of threads almost always turn nasty\n\nYep, makes me remember the whiny posts about tourists wishing to enter whatever the price when the country was closed to tourists, even if it meant (gasp) abide to rules and habits.",
                    "score": 8,
                    "author": "Titibu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My point is stop complaining as though foreigners are the only ones not wearing masks. There are plenty of Japanese who also don’t give a fuck. The double standards and hypocrisy are beyond ridiculous at this Japanese.",
                            "score": -14,
                            "author": "AvatarReiko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No problem, I complain about inconsiderate people and I also complain about Japanese not wearing mask indoors, although you won't see that many.\n\nThere are no double standards, you have inconsiderate foreigners and inconsiderate Japanese, but you see more inconsiderate Japanese because you simply see more Japanese, as simple as that.",
                                    "score": 6,
                                    "author": "Titibu"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome to America, friend. If you let us in, learn to adapt your rules. (And we aren’t the only ones, other countries are like this)\n\nI don’t say this for myself. I’d respectfully wear a mask inside and even in crowded streets. However the demographic that largely travels to Japan from the US (largely, the wealthy and ostracized incels) largely deny COVID existed or ever was truly a problem even though it killed people (“So does the flu, snowflake!” is a common thing heard).\n\nThey don’t care if people are offended, they don’t care if people die, and they don’t care about the opinions of anybody, ESPECIALLY those who are not Americans. \n\nThat is where we are at over here. If you want it your government’s way (completely reasonable) and you want to follow protocols and some idealistic approach to lower numbers, simply keep Americans out. \n\nWhat people aren’t saying is that a majority of Americans didn’t last 2 weeks in the pandemic actually following the protocols completely here before someone invented the idea that COVID wasn’t an issue and essentially abandoned those who would die from the bug if they caught it.\n\nFortunately the vaccines are working so well (for now) that this charade can continue here with less damage than we might face otherwise.",
            "score": -55,
            "author": "ClammyHandedFreak",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;\tthe wealthy or ostracized incels\n\nLol what? This isn't true at all.",
                    "score": 24,
                    "author": "tsukamaenai"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -88,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only allowed if you're a fat Aussie dude wearing A bathing ape gear",
                    "score": 16,
                    "author": "blissiictrl"
                },
                {
                    "level": 1,
                    "comment": "Even if there are some areas where it's not required but worn as an habit, there are also -many- places where it's just mandatory (transportation, most stores, etc.). Make a scene all you want....",
                    "score": 15,
                    "author": "Titibu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not mandatory on transit. I don’t wear one on public transit all the time. No one has told me to put one on.",
                            "score": -40,
                            "author": "Taido_Inukai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\\&gt;Not mandatory on transit\n\n[Very first request](https://www.mlit.go.jp/tetudo/tetudo_fr1_000062.html) of the MLIT regarding transportation. So sure, not a \"law\", but a request from MLIT is quite close to something that tourists should very much abide to.\n\nAnd you could go [operator](https://global.jr-central.co.jp/en/onlinebooking/info-coronavirus/) by [operator](https://www.tokyometro.jp/info/207966.html?width=816&amp;height=650) if so you wish.",
                                    "score": 18,
                                    "author": "Titibu"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live here man. No one bats an eye at me for not wearing one. You’ll be fine. Come and enjoy!",
                    "score": -30,
                    "author": "Taido_Inukai"
                }
            ]
        }
    ]
}