{
    "id": "1134ycz",
    "score": 9,
    "title": "The black student experience at Dodge/Chapman?",
    "author": "WhalesFrolicc",
    "date": 1676485840.0,
    "url": "https://www.reddit.com/r/chapmanuniversity/comments/1134ycz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a black female high school student from the east coast, I come from a single parent working class household and I'll be a first generation college freshman in fall 2023. I recently got into Dodge and went to visit last month and while both Dodge and Chapman are beautiful and everyone was extremely welcoming and nice it was impossible not to notice the lack of black students on campus. Coming from a super culturally diverse place where my friends are all a big melting pot both race and sexuality wise I felt sort of intimidated and lonely, like maybe I wouldn't fit in or find friends there? \n\nI also got the impression, but could totally be wrong, that a good chunk of students come from wealthy families. I just don't know if I'd find a group of people who could relate to me. I received a ton of financial aid which is a big reason I'm strongly considering Chapman. I also got into to Emerson, Loyola, DePaul, Wesleyan, which all have (although some just slightly) more diversity than Chapman. I didn't apply to NYU tisch foremost because I didn't think I could get in but more so because I wanted to get out of nyc. But now I'm second guessing things. So I guess my question is minority students how do you like Dodge and or Chapman? Did you find a group of people you connect with? Do you have any regrets?",
    "comments": [
        {
            "level": 0,
            "comment": "They’re there, you just have to find each other. Also supposedly Chapman has just as many students on financial aid as they do paying their way, maybe even more. Wealthy people is always going to be an issue in the middle of Orange County, 20 minutes away from Disneyland. But students are also coming from all over the country/world. I had friends from Guam, Jamaica, and several South American countries. Your time at Chapman is what you make it.",
            "score": 8,
            "author": "Garci368"
        },
        {
            "level": 0,
            "comment": "As a first year Black female student at dodge I will say the diversity is a problem, but it hasn’t hindered me personally in any way. I know other black students who are transferring partly because of the lack of diversity but for me it hasn’t been a problem. I’ve still met very cool people of multiple culture backgrounds and my entire friend group is black with multiple sexualities. One of my close black friends is also from NY! As far as finance a lot of people here are definitely loaded but it shouldn’t cause too much of a disconnect. If having a strong black community is like at the top of your list I would say possibly search elsewhere but at the same time even as a film school dodge is absolutely amazing and you’ll meet amazing people regardless. Take the chance :)",
            "score": 10,
            "author": "Old_Staff_9484",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just logged in to see all the replies. I appreciate all the responses but just wanted to say thank you for giving your perspective and experience as a black student so far! Still undecided but have narrowed it down to two schools, Chapman being one of them. Maybe I'll see you in August!",
                    "score": 1,
                    "author": "WhalesFrolicc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you do decide to come let me know! Id love to be friends!",
                            "score": 1,
                            "author": "Old_Staff_9484"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really glad to see this post and the responses. My daughter and I just got back from a tour of both Dodge and the admitted student Chapman tour. She is biracial and it was one of the first things that stood out to her. She was the only minority on both tours and the Chapman tour was pretty large and had to be broken down into groups. We are also from the east coast ny/nj and I guess I didn't fully realize the demographics of Orange. She loved Dodge and she's pretty set on going but that was one of her biggest concerns truthfully",
            "score": 3,
            "author": "h974974"
        },
        {
            "level": 0,
            "comment": "I’m also from the east coast and the lack of diversity stood out to me when I first started attending. I will say there’s wonderful diversity gender and sexuality-wise, but I just didn’t feel it outside of that much. I’m not in dodge, but I have a ton of dodge friends since we were housed together freshman year! Though I don’t have too many friends of my ethnicity, I didn’t find it hard to make friends and fit in. The students here tend to be very kind and welcoming. I will say that Chapman still has a ways to go and there are ongoing efforts from students and some staff that’re pushing for better support for students of color. There’s a black student Union and a diversity affairs committee.\n\nI personally have no regrets about coming here, it’s a gorgeous campus and I love my classes. However, I’ve heard stories about racist professors. I will say that California in general can be… abrasive compared to the east coast. I’ve felt with a lot more racism and homophobia out here compared to MA, but I’m willing to bet that quite a few places outside of New England are like that :/",
            "score": 2,
            "author": "Etmokih"
        },
        {
            "level": 0,
            "comment": "As a white male who attends Dodge, Chapman has recently made stringent leaps in diversifying its student body and Dodge faculty. Just go observe the newest professors at Dodge and they're likely all minorities and women.",
            "score": 1,
            "author": "amoryblaine0505"
        }
    ]
}