{
    "id": "143hrjn",
    "score": 3,
    "title": "Have anyone received 30k merit scholarship as transfer?",
    "author": "Puzzleheaded-Cry6045",
    "date": 1686155106.0,
    "url": "https://www.reddit.com/r/chapmanuniversity/comments/143hrjn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m going to cc and I really like Chapman. However, the tuition is pretty high. I saw that the merit scholarship is open to both first year and transfer so I’m curious if anyone have ever received it as transfer before? If yes, may you share a little bit about your app and stats?",
    "comments": [
        {
            "level": 0,
            "comment": "I have, I transferred from a CC to Dodge. I have a 3.75, in both my common app and the creative supplement I wrote a lot about my gaps in education and how I ended up here basically. I also included 2 references (the one required, and then another from someone who knew me creatively). Let me know what else you’d like to know!",
            "score": 2,
            "author": "garibromo"
        },
        {
            "level": 0,
            "comment": "30k isn't unusual, but a lot of it is for on campus housing &amp; meal plan so it may depend on if you are living in Chapman provided housing (required for out of area first years) or not.",
            "score": 1,
            "author": "Riptide360"
        },
        {
            "level": 0,
            "comment": "It just spends on which merit scholarship you get. The deans scholarship covers 30 or 40k, and I think there’s one merit scholarship above that called the presidents scholarship. Both require minimum GPA entering and while attending Chapman",
            "score": 1,
            "author": "Garci368",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know what’s the minimum gpa required?",
                    "score": 1,
                    "author": "Puzzleheaded-Cry6045",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got the dean’s scholarship, it covered everything except housing I believe. I had a 3.8 in highschool, and I think I needed to keep a 3.0 after entering but I don’t really remember that part. I knew someone that had the president scholarship, they had a 4.0 in highschool, and had to maintain a 3.5 or 3.75 I believe while enrolled. \n\nBut I do not know the minimum required to obtain the scholarships",
                            "score": 1,
                            "author": "Garci368"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Transfer that got accepted into chapman: My GPA was pretty low 2.7-2.8 but I applied as a Film and TV production major so my portfolio gave me an incredible upper hand. I know that the higher your GPA the more likely you are to get a merit scholarship and there are also other scholarship available to you. Depending on your age you may also request financial aid as an independent. I did and had half of my tuition covered without any scholarships.",
            "score": 1,
            "author": "Kale5537"
        },
        {
            "level": 0,
            "comment": "Was this purely based on FAFSA or you needed to apply for scholarships specifically?",
            "score": 1,
            "author": "slcanman"
        }
    ]
}