{
    "id": "sx6bki",
    "score": 7,
    "title": "School Psych Graduate Program",
    "author": "cancersun_11",
    "date": 1645377922.0,
    "url": "https://www.reddit.com/r/chapmanuniversity/comments/sx6bki",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi y’all! I just received an invitation for an interview to Chapman’s school psychology program! Does anyone have any tips on what I should do to prepare?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi there, just curious to know, how was the application process for this program? In terms of required exams, etc",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The application process was fairly easy! There was no “required” exam for fall 2022 so I’m not entirely sure how that process works:(",
                    "score": 1,
                    "author": "cancersun_11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for your response. Hope you have an awesome interview! I will be applying to Chapman and SD st this year though worried about the commute to these universities from Murrieta/Temecula ☺️",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh no that is a commute :( and thank you! Good luck on your applications let me know if you have any other questions about them! 😊",
            "score": 1,
            "author": "cancersun_11"
        },
        {
            "level": 0,
            "comment": "No tips from me since it’s past the interview day! But, I also went through the interview with Chapman. So, I just wanted to say good luck to you as well! These next two weeks are going to be so nerve wracking 😭",
            "score": 1,
            "author": "gardencia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! These next two weeks are going to pass by so slow while we wait to hear back 😭 did you apply to any other school psych programs?",
                    "score": 1,
                    "author": "cancersun_11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know! I’m like constantly replaying how the interview went 😭 I didn’t apply anywhere else lol because everyone I’ve talked always say that Chapman has one of the best programs! What about you?",
                            "score": 1,
                            "author": "gardencia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes I keep thinking about how it went too and wondering if I said everything I could’ve said. I applied also to CSULB and LMU",
                                    "score": 1,
                                    "author": "cancersun_11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes! I relate to that… I feel like the interviews were too short and happened so fast? That, it was hard to time out what I wanted to say or if I said everything. Oohh! Good luck! Which program are you planning on if you get accepted to them all?",
                                            "score": 1,
                                            "author": "gardencia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I honestly really don’t know! I feel like each program is special in its own way which makes me think about which one would be best for me. I’m really just hoping I get accepted to at least one lol but honestly Chapman is at the top of my list right now!",
                                                    "score": 1,
                                                    "author": "cancersun_11",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That makes sense! I hope all your interviews went well though! It’s so nerve wracking. There’s so many of us too… I think they said they had 61 applying but only take 20??",
                                                            "score": 1,
                                                            "author": "gardencia",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I know I forgot there was a morning and afternoon group interview so I though there were only 31 applicant total lol but that is a lot of people to not accept:(",
                                                                    "score": 1,
                                                                    "author": "cancersun_11",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes! It’s so crazy to think about… even thinking about how many people applied and didn’t get an interview too! Like… it’s selective 😭 Were you in the morning or afternoon?",
                                                                            "score": 1,
                                                                            "author": "gardencia",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yes I knew the program was selective but I don’t think I comprehended how selective it was. And I was in the morning interview. How about you?",
                                                                                    "score": 1,
                                                                                    "author": "cancersun_11",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}