{
    "id": "u8quwc",
    "score": 13,
    "title": "committed for fall 2022",
    "author": "Adorable-Objective-1",
    "date": 1650556720.0,
    "url": "https://www.reddit.com/r/chapmanuniversity/comments/u8quwc",
    "media_urls": [],
    "other_urls": [],
    "postText": "yo i just put the deposit down for chapman and will be attending in fall 2022. can any students give me some real advice and info on the school? what are some things you wish you knew when you started or were a freshman. how is social/campus life/ partying scene.",
    "comments": [
        {
            "level": 0,
            "comment": "Definitely make use of the specific things Chapman offers, it's a big part of why the school is so good. The Career Center / Alumni network are huge and can easily find you an internship or field experience for whatever you're doing. \n\nAlso make it a point to go to academic advising at least once a semester to plan out the next one, even if you don't feel like you need it (sometimes you'll find out something or some opportunity that you would've missed).\n\nThe social life is dependent on what you want out of it. Greek life is huge but not for everyone, and there's a ton of separate nightlife both in the Circle and around OC, I'd definitely recommend getting a group together early and going to try new things.\n\nLastly, if you haven't already heard, the cafeteria food isn't good. If they give you a meal plan choice make sure to take the least amount of \"swipes\" and the most amount of \"panther bucks\".",
            "score": 1,
            "author": "SBLozera"
        },
        {
            "level": 0,
            "comment": "Join clubs, youll have free time and you should use it to socialize. Stay away from greek life",
            "score": 1,
            "author": "diegoturtle90",
            "replies": [
                {
                    "level": 1,
                    "comment": "why stay away from greek life?",
                    "score": 1,
                    "author": "Adorable-Objective-1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Omelet bar is where it’s at. \nCafeteria food has serious potential. Some of their items aren’t the best. Lunch time is definitely the heavy hitter for the Monday to Friday.",
            "score": 0,
            "author": "twotones13"
        }
    ]
}