{
    "id": "yabuw4",
    "score": 4,
    "title": "Dear Chapman Film TV Prod students",
    "author": "KanraDesuyo",
    "date": 1666406143.0,
    "url": "https://www.reddit.com/r/chapmanuniversity/comments/yabuw4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I wanted to ask why did you chose chapman? Like, what does chapman have that other film schools don't?",
    "comments": [
        {
            "level": 0,
            "comment": "I’m a freshman and chose it for the amazing connections. I chose it over UT Austin which has a pretty good film program and then UCSD which is a great school overall. Being here for a few months I definitely see why it’s ranked so highly - the connections are AMAZING and most of the professors are all involved in the industry currently and know what they’re talking about. The people are friendly and very talented and Chapman’s consistently improving their film school. We have Masterclasses with people like the Duffer Bros, Michelle Yeoh, Jeffrey Katzenberg, etc etc. and so many amazing facilities in general. I came here because it seemed like the best place to get me a job post-grad and build my skills in a more hands-on environment versus other schools where you don’t make films until your second or third year. I’ve made three already for class. I think it’s great so far.",
            "score": 3,
            "author": "ktjritter"
        },
        {
            "level": 0,
            "comment": "Most film folks apply Chapman, LMU and USC. Chapman’s film school community is very supportive and the school makes it easy to work on and do your own projects. Even the process for getting equipment, studio time &amp; film permits is streamlined while making you learn the hoops of what it takes. 50% of Hollywood films loose money so I keep hoping Chapman will add an MBA for film financing to help folks get their film projects off the ground.",
            "score": 2,
            "author": "Riptide360"
        }
    ]
}