{
    "id": "13wjig5",
    "score": 59,
    "title": "Was Spartacus: Blood and Sand (2010) worth a watch?",
    "author": "Bettalad",
    "date": 1685532354.0,
    "url": "https://www.reddit.com/r/television/comments/13wjig5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m in the mood for some violence and historic action and maybe some butts. my friend keeps recommending it as a masterpiece but the reviews are absolutely terrible! \n\nHas it aged well? Is the story any good?\nAny male nudity or is it all boobs? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "It's worth watching the whole show. Great dialogue and great villains. I wouldn't go by the first episode of Blood and Sand, it's easily the weakest episode of the whole franchise.\n\nI'd also recommend Gods of the Arena, the 6 episode prequel.",
            "score": 95,
            "author": "visitorzeta",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll start it tonight! Thank you",
                    "score": 4,
                    "author": "Bettalad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would watch it in release order.\n\nSeason 1 *\"Blood and Sand\"*\n\nPrequel Season *\"Gods of the Arena\"*\n\nSeason 2 *\" Vengeance\"*\n\nSeason 3 *\"War of the Damned\"*",
                            "score": 40,
                            "author": "Couch_Licker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Now if it was easy to find \"season 1, season 2....\"\n\n1 Spartacus: Blood and Sand\n2 Spartacus: Gods of the Arena\n3 Spartacus: Vengeance\n4 Spartacus: War of the Damned\n\nI Always get confused and imdb is no help..",
                                    "score": 3,
                                    "author": "DenotheFlintstone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's true, I forget they did that. I watched them as they were released. I updated my comment.",
                                            "score": 2,
                                            "author": "Couch_Licker"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you want violence, historical fiction and ass, there really isn’t a better show. It’s really fun. And it’s way better than it has any right to be. It’s not really a masterpiece though.",
                            "score": 2,
                            "author": "rhino369"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The first four or five episodes are a wee bit rough. But once it hits its stride, the show is fucking awesome.",
                    "score": 3,
                    "author": "Faithless195"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jupiter's cock was it good in that first season.",
            "score": 63,
            "author": "Shotgunsamurai42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Once again gods jam cock in ass!",
                    "score": 20,
                    "author": "bearhoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"See fit to place cock in ass\" as your phrasing wouldn't make sense in Latin",
                            "score": 16,
                            "author": "Fusion_Corp"
                        },
                        {
                            "level": 2,
                            "comment": "Once again, the gods spread cheeks to ram cock in fucking arse!",
                            "score": 12,
                            "author": "IStillLikeBeers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Finally! Somebody got it right.",
                                    "score": 2,
                                    "author": "lordatlas"
                                },
                                {
                                    "level": 3,
                                    "comment": "My most favorite quote, from the man himself: Batiatus",
                                    "score": 2,
                                    "author": "Sayena08"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just clicked this thread to upvote the first Jupiter's cock comment I saw.\n\nMission accomplished.",
                    "score": 6,
                    "author": "Leafs17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha, it certainly grew on me the longer I heard it.",
                            "score": 1,
                            "author": "Shotgunsamurai42"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You ask me to suck the cock that pisses on me!",
                    "score": 3,
                    "author": "jouh55142139"
                }
            ]
        },
        {
            "level": 0,
            "comment": "By Jupiters Cock! Yes it is.  \n\nJohn Hannah is especially good in it.",
            "score": 19,
            "author": "emptysoul365"
        },
        {
            "level": 0,
            "comment": "It's one of my very favorite shows. The season 1 finale contains my favorite moment in all of fiction. So, fuck yeah it's worth a watch.\n\nThe reviews are lousy because the first three episodes suck. That's something you should know if you decide to watch it: it's one of these \"it gets better after a few episodes\" shows.\n\nAnother thing to know is that imdb considers the prequel season *Gods of the Arena* to be a separate show. It's not a spin-off, it's season 2. I say that because many people end up watching it first (because it is a prequel) or last (because of the imdb thing I mentioned earlier). The proper order is *Blood and Sand*,  then *Gods of the Arena*, then *Vengeance*, and *War of the Damned*.",
            "score": 12,
            "author": "Efficient_Paper",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The season 1 finale contains my favorite moment in all of fiction\n\n&gt;!The shield jump!&lt;, I'm guessing?",
                    "score": 4,
                    "author": "Zachariot88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Has to be.  Not only the action piece, but what it meant.  The whole season is leading up to this moment.  Everyone seeing the problem and knowing that individually, they can't do anything. Even those who bought into the system turning.  All the story lines build up to this one moment.  It ends up being practically a painting.",
                            "score": 5,
                            "author": "JeddHampton"
                        },
                        {
                            "level": 2,
                            "comment": "You guessed correctly",
                            "score": 3,
                            "author": "Efficient_Paper"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ahh great info thank you!!",
                    "score": 1,
                    "author": "Bettalad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, but you have to get through the first 4 episodes. The jump in quality is insane.",
            "score": 42,
            "author": "nevereatpears",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. The early eps are primitive CG and as the series progresses it's like they hired an entire new film crew.\n\nAs others mention, plenty of male muscle, junk and butts along with what I thought was some sensual female nudity.\n\nViolent, almost comical at times in a good way. Reminded me of a graphic novel.\n\nI recommend watching the entire series in order.",
                    "score": 14,
                    "author": "iwastherefordisco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think Blood and Sands and Gods of the Arena are the only ones worth watching.\n\nDon't see the point after the two best characters/actors are no longer in the show.",
                            "score": -5,
                            "author": "nevereatpears",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I assume one of those you refer to is Spartacus (the other I'm guessing is John Hannah as Batiatus).  You do know there was a good reason for why Liam replaced Andy, yes?  Andy was diagnosed with cancer.  GotA was made to give him time to hopefully recover.  He sadly did not.  Liam had big shoes to fill, and he did an excellent job IMO.",
                                    "score": 1,
                                    "author": "RogueIslesRefugee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "that’s unusual! Maybe the first 4 were filmed like a pilot? I’ll make sure to stick with it",
                    "score": 2,
                    "author": "Bettalad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The first episode is just about the worst thing I have ever seen. The series as a whole and the spinoff are amazing.",
                            "score": 8,
                            "author": "bumrar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Episode one is like \"what if we made gladiator as a TV series, but made it shit?\"\n\nBut oh boy does it turn.",
                                    "score": 4,
                                    "author": "bearhoon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "More like \"300\" than Gladiator.",
                                            "score": 6,
                                            "author": "RegularGuy815",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, the pilot was very much \"300\" meets student film level production values. It was remarkably awful considering how good the rest of the series was.",
                                                    "score": 1,
                                                    "author": "twbrn"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;The first episode is just about the worst thing I have ever seen.\n\nWhen they made the pilot, it felt like they wanted to take the look and feel of *300* and put it into a Gladiator setting. Then after the first episode, they realized that it didn't work at all and started to scale back on that almost immediately.",
                                    "score": 1,
                                    "author": "WilliamEmmerson"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They didn't have writers or fuck all first 2-3 episodes probably. Episode 4 is The Thing in the Pit and is great.\n\nIn a way this reminds me of The Expanse, episode 4 is CQB and the first incredible episode lol.",
                            "score": 3,
                            "author": "Stemnin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is a massive amount of male nudity. And even when it's not full on, the principal male cast of gladiators are barely clothed throughout. If buff guys showing skin is what you're looking for, this is your show.",
            "score": 26,
            "author": "tetoffens",
            "replies": [
                {
                    "level": 1,
                    "comment": "And Lucy Lawless nudity too.",
                    "score": 41,
                    "author": "FXHNT_Steve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She really amazed me with her ability to go from a buff warrior to a soft and beautiful noble.",
                            "score": 11,
                            "author": "Chuckw44"
                        },
                        {
                            "level": 2,
                            "comment": "Lucy just about poked my eye out in a few of those bathing scenes..\n\nI also liked Viva Bianca! (Her name demands an exclamation point for some reason)",
                            "score": 1,
                            "author": "iwastherefordisco"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s nudity for everyone in that show.",
                    "score": 14,
                    "author": "Earthpig_Johnson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Equal oppor-nudity.",
                            "score": 7,
                            "author": "keving87"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "okay sign me up!",
                    "score": 3,
                    "author": "Bettalad"
                },
                {
                    "level": 1,
                    "comment": "Spartacus is a show made for the bisexual eye, and I am here for it.",
                    "score": 14,
                    "author": "TreyWriter"
                },
                {
                    "level": 1,
                    "comment": "This show is just nudity, regardless of sex. Your post sounds like a homophobe, or a warning for homophobes. \n\n\nThe fact you didn't even mention the massive amount of female nudity is just astonishing.",
                    "score": -6,
                    "author": "pathofdumbasses",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was asking about specific male nudity as I wanted to make sure there was some!",
                            "score": 2,
                            "author": "Bettalad"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe OP is a female and doesn't want to just see tits everywhere",
                            "score": 2,
                            "author": "Macewan20342",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am saying that the user above me is only talking about the male nudity, without mentioning the gratuitous amount of female nudity as well.\n\n\nWhy are they singling out just one type?",
                                    "score": -1,
                                    "author": "pathofdumbasses",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because OP asked if there's \"any male nudity\" so the commenter responded \"there's lots of male nudity\"??????",
                                            "score": 2,
                                            "author": "BadFaithBrian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Any male nudity or is it all boobs? Thanks!\n\nIs exactly what the OP said. The op asked about BOTH and that poster answered only one of the things.",
                                                    "score": -1,
                                                    "author": "pathofdumbasses",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think you are just reading it differently which isn't too crazy since it's text. To me it reads similar to if I asked \"hey man any luck with the job hunt or has it been a dry spell?\" To which they'd most likely reply (if this were their case) \"yeah man I've actually had a ton of good interviews lately! Now is a great time to look around if you are wanting something new\"\n\nSaying there is male nudity also answers the question of \"is it all boobs\" at the same time",
                                                            "score": 3,
                                                            "author": "BadFaithBrian"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a masterpiece but alot of fun to watch.\n\nFor for semi historical drama with violence and butts I would recommend HBO.\n\nDeadwood, Rome, Boardwalk Empire, Carnivale, THE KNICK.",
            "score": 8,
            "author": "Yoblit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dont forget warrior",
                    "score": 3,
                    "author": "jellyfish611",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or 'Oz'.  It was HBO's first big drama series.  Plenty of violence and butts.",
                            "score": 1,
                            "author": "RogueIslesRefugee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Took a couple episodes to get its hooks into me, but the first season was really strong.",
            "score": 8,
            "author": "HopDropNRoll"
        },
        {
            "level": 0,
            "comment": "Very much so.\n\nThe first episode is a bit painful, but it becomes something else. People can thumb their noses at it, but with how visceral the violence can be, it makes the character moments hit much harder.  DeKnight took the meme of Whedon hurting the audience and ran with it. Horrible things will happen to characters you come to care about, and even the ones you hate. There are no happy endings. \n\nThe dialog is a treat, too.",
            "score": 5,
            "author": "Charrbard"
        },
        {
            "level": 0,
            "comment": "I really liked it. I even liked the first episode. I didn't realize I wasn't supposed to like it. Never read any reviews. Just saw it was a show about Spartacus and that was enough to hook me.",
            "score": 5,
            "author": "Showfire"
        },
        {
            "level": 0,
            "comment": "Spartacus is a show that just wasn't meant for reviewers. It's cheesy, excessive nudity and sex, and has lines such as: \n\n\"Once again the gods see fit to spread cheeks apart and force cock in ass!\"\n\n\nDon't go into it expecting some Game of Thrones level of nuanced story telling, but rather just a fun show, and you'll absolutely love it.",
            "score": 5,
            "author": "gsauce8"
        },
        {
            "level": 0,
            "comment": "I loved this show, so very cool",
            "score": 3,
            "author": "Nunchuckz007"
        },
        {
            "level": 0,
            "comment": "It isn't a masterpiece but it's a good show to watch if you are interested by the topic.\n\nIt's very violent, the nudity kind of loses its shocking value anyway, but you can stay for the story.",
            "score": 3,
            "author": "Lyceus_"
        },
        {
            "level": 0,
            "comment": "I tell anyone who will listen about this show. It had possibly the worst pilot ever made, but once it picks up steam it never really lets up. Everything is turned up to 11 -- the violence, the sex, the political scheming, the frames per second... it really is a treat. Anyone I've managed to get to have faith in me and watch ends up surprised by how much they enjoy it and get invested.",
            "score": 2,
            "author": "Zachariot88"
        },
        {
            "level": 0,
            "comment": "It definitely hangs more dong that your average show....or your average 10-15 shows put together.",
            "score": 2,
            "author": "BasicReputations",
            "replies": [
                {
                    "level": 1,
                    "comment": "the more the better!",
                    "score": 2,
                    "author": "Bettalad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's fun with some likable cast members (John Hananh as Batiatus steals the show). A little gratuitous at times but considering what you said you're in the mood for that shouldn't be a huge problem. There is a decent bit of flaccid cock if I recall correctly. \n\nI couldn't get into the other seasons, the show just wasn't the same for me after Andy Whitfield's (Spartacus) tragic passing. No disrespect to the actor who replaced him, I hear he was handpicked by Whitfield and I'm sure he does a commendable job but I couldn't get past it personally. But of course, your mileage may vary, it's definitely worth checking out Blood and Sand and seeing how you get on with it.",
            "score": 2,
            "author": "Lil_Mcgee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imo it wasnt the actor the prob, like s0 was superb,its just the whole premise changed when (spoilerssssssss) they broke out of the ludus",
                    "score": 1,
                    "author": "Elisemidcalis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hell yes, it takes a few episodes to find it's voice, but once it does (And you'll know), it's bloody fantastic.",
            "score": 2,
            "author": "PragmaticKB"
        },
        {
            "level": 0,
            "comment": "Season 1 was just amazing fun.  good story, great fighting, lots of sex...and if you want male dong on your TV, this is the show for it.\n\nThen the lead actor Andy Whitfield was diagnosed with lymphoma and they refused to recast him and instead did a prequel season while Andy was in treatment.  the prequel was pretty good too, it wasn't forced like a lot of prequels are, it told a coherent story on its own.\n\nThen Andy was healthy and back in the gym to train for filming season 2, it all looked great.  Then faster than seemed possible he was gone.  Before he died he expressed his wishes for the show to continue, so the role was recast.\n\nI loved the show, and Andy really worked in the role for me...so I've never gone back to watch the two recast seasons.  I've heard they're good, but I dunno.  it's not the same for me.",
            "score": 2,
            "author": "McFeely_Smackup"
        },
        {
            "level": 0,
            "comment": "The show was good, just don't be thrown off by the recasts. Andy Whitfield was diagnosed with cancer after season 1 and during the delay while he was getting treatment, they did Gods of the Arena prequel, then it came back and he had to leave the show. They also recast Naevia in season 2 (3 if you're counting the prequel).",
            "score": 2,
            "author": "keving87"
        },
        {
            "level": 0,
            "comment": "Ok so I love the show. One of my top favourites. \n\nIt is not fit everyone lol. Has that graphic novel styling (especially in the first half of the first season),  over the top gore, ridiculous sex and nudity.  Still, I fucking love it. \n\nAlso before anyone tells you to watch the prequel first, don't. Watch things in the order they are made for cryyyyying out loud. The story beats, foreshadowing, callbacks, all of it will not land as intended. Just watch it in release order. /soapbox\n\nEdit I see people giving the proper order above,  yay.",
            "score": 2,
            "author": "Queen_Of_InnisLear"
        },
        {
            "level": 0,
            "comment": "It's an excellent show.  I usually see violence as a dull,  fake bullshit time waster in any show.  It's unrealistic and has little consequence.  The violence in Spartacus is meaningful and impacts the characters and plot. It's the only example that I can think of where the show is better for It's inclusion. Absolutely worth watching.\n\nEDIT:  Tons of nudity, men women,  anything that can be nude.  I think it's likely as much about a reflection on the time in history as it is sensationalistic.",
            "score": 4,
            "author": "grump66",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amazing! Gonna give it a watch thanks",
                    "score": 1,
                    "author": "Bettalad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you like the movie 300, you’ll enjoy it with the comic book style writing and viewing. It’s over the top and fun.\n\n\nI’m actually rewatching it now and am on the prequel season Gods of the Arena.",
            "score": 1,
            "author": "DoomerPatrol",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes I’m looking for something flashy and fun! Watched too many dreary shows",
                    "score": 2,
                    "author": "Bettalad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely fantastic series just go in knowing that the lead actor died after season 1 and they had to recast him so Season 2 takes a little bit to get used to the new guy but I thought he was ultimately great.",
            "score": 4,
            "author": "Deakul"
        },
        {
            "level": 0,
            "comment": "Incredibly violent and lots of sex, including male nudity, sometimes gay. All dialogue is semi-Shakespearean. Very worth watching if you can take it.",
            "score": 1,
            "author": "Mormegil1971"
        },
        {
            "level": 0,
            "comment": "Season one is great 9/10, the rest is not as good.",
            "score": 1,
            "author": "MagicienDesDoritos"
        },
        {
            "level": 0,
            "comment": "Wait....there was 4 seasons?! I thought it got stopped after the first season because the main actor died! OMG!!",
            "score": 1,
            "author": "HorribleTrashPerson",
            "replies": [
                {
                    "level": 1,
                    "comment": "They made a season 0 ( God of the Arena) after season 1, waiting a recovery from the actor, then, well, they continued the story with a new actor",
                    "score": 2,
                    "author": "GCGS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s a fun show, and for the record the IMDB episode by reviews are about right IMO.",
            "score": 1,
            "author": "Firestorm238"
        },
        {
            "level": 0,
            "comment": "Not sure if it still holds up but I thought it was great when it released. It’s like a mix of 300 action with a gladiator story.",
            "score": 1,
            "author": "Dirk-D1ggler"
        },
        {
            "level": 0,
            "comment": "The whole series is great, give it a shot",
            "score": 1,
            "author": "Fat-Villante"
        },
        {
            "level": 0,
            "comment": "Every season is amazing, definitely worth a watch!",
            "score": 1,
            "author": "urnialbologna",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah bruv s2-3 suckked s1 and prequel are top notch stuff, the whole outside of the ludus story plot was meh was fuck",
                    "score": 1,
                    "author": "Elisemidcalis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The first few episodes of the show are rough but at the third and fourth and on EVERYTHING is so well done.",
            "score": 1,
            "author": "OnwardTowardTheNorth"
        },
        {
            "level": 0,
            "comment": "&gt; historic action\n\n&gt; masterpiece\n\nLOL I wouldn't call it either. But it's campy fun and I enjoyed the ride. One of my casting nitpicks was the women with breast enlargements. The show didn't need them since that 'tech' didn't exist in the times.\n\nEnjoy the show.",
            "score": 1,
            "author": "DaftPump"
        },
        {
            "level": 0,
            "comment": "Your words fall from mouth like shit from ass!",
            "score": 1,
            "author": "Exact_Raspberry2866"
        },
        {
            "level": 0,
            "comment": "under the ridiculous amount of slow mo sex, giant cocks, pearly tits, orgies, dismemberments and swords being rammed down throats like a reverse magician trick there's a surprisingly good script hiding in it. Excessive but well done, although don't expect historical authenticity\n\nfinal season is by far my favourite",
            "score": 1,
            "author": "anasui1"
        },
        {
            "level": 0,
            "comment": "Yes. There are a lot of blood and nudity in the show.Ignore the reviews and give it a try!",
            "score": 1,
            "author": "trubs12"
        },
        {
            "level": 0,
            "comment": "I love the show, but I have to admit it that the first episode is bad. It's the weakest episode in the entire series. It felt like the show didn't quite now how it wanted to look in the pilot. After that it gets so much better.\n\nUnfortunately the actor who plays Spartacus, Andy Whitfield, passed away after season 1. But his replacement, Liam McIntyre, was just as incredible in the role in my opinion.\n\nAs for your question about nudity, there is tons of male nudity actually.",
            "score": 1,
            "author": "WilliamEmmerson"
        },
        {
            "level": 0,
            "comment": "one of the best series ever made\n\nwould be really hard to recommend anything better for you since you're this far already",
            "score": 1,
            "author": "PavelDatsyuk88"
        },
        {
            "level": 0,
            "comment": "Absolutely worth. All seasons.",
            "score": 1,
            "author": "Uncertn_Laaife"
        },
        {
            "level": 0,
            "comment": "Absolutely. The whole Spartacus series is super fun.",
            "score": 1,
            "author": "MuzirisNeoliberal"
        },
        {
            "level": 0,
            "comment": "“Words fall from mouth as shit from ass. “ Classic!!",
            "score": 1,
            "author": "Tekkizm"
        }
    ]
}