{
    "id": "13xvv22",
    "score": 3,
    "title": "With so many great shows ending recently, what do you think seems like the next top tier TV drama?",
    "author": "ZADDYISAGOD",
    "date": 1685659646.0,
    "url": "https://www.reddit.com/r/television/comments/13xvv22",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m talking about shows of the caliber of Better Call Saul and Succession. Are we looking at any other show’s that have the potential to reach these height in the coming years or maybe have I missed one that has recently? There’s a couple of shows like Andor and The Boys which are excellent but I don’t think they’re quite at that level. What do you think?",
    "comments": [
        {
            "level": 0,
            "comment": "'Severance': An interesting original idea coupled with a great performance by the cast.",
            "score": 27,
            "author": "Neo2199",
            "replies": [
                {
                    "level": 1,
                    "comment": "100% this. Severance is already the next peak tv show.",
                    "score": 3,
                    "author": "craftbeerlink"
                },
                {
                    "level": 1,
                    "comment": "Oh yeah I haven’t watched it yet but I’ve heard great things. Definitely need to watch ASAP.",
                    "score": 1,
                    "author": "ZADDYISAGOD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Something will come along again eventually",
            "score": 3,
            "author": "SkAnKhUnTFoRtYtw",
            "replies": [
                {
                    "level": 1,
                    "comment": "It always does",
                    "score": 1,
                    "author": "ZADDYISAGOD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, I have no idea, but I would like to watch a show that would be like Game of Thrones - full of plot twists, great drama, and politics, a massively popular and cultural juggernaut. HBO has a good chance of making a show like that because of once-a-week episodes that cultivate discussions and connection to a show (Stranger Things gets released, I watch it and then *completely* forget about it until the next season 15 years later), a lot of their content is great and not disposable crap like most of the Netflix stuff, and HBO has a reputation. Apple TV is also good, but it is not available in every country, Hulu also. A lot of streaming services are out there, and a lot of TV shows are available, but GOT's success is going to be hard to replicate (yes, the last season is not good, but it was the most watched s*** in the world).",
            "score": 7,
            "author": "UnluckyStrategy8",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think if they do the Jon Snow Show right, they could recapture that magic. House of the Dragon is fun however you can read the entire Wikipedia, they need to go off book in a big way",
                    "score": 4,
                    "author": "BusinessPurge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read an article yesterday that they're not sold on doing the Jon Snow show yet and there's a good possibility that it doesn't move forward. Don't know how accurate it is, but there's a decent chance it just doesn't happen in favor of their other GoT projects",
                            "score": 5,
                            "author": "imaBEES",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think they need scripts, it’s probably just on…ice, for now",
                                    "score": 2,
                                    "author": "BusinessPurge"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Warrior s3 drops and everyone will jump on. Mark it.",
            "score": 5,
            "author": "lylastermind",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would make me so happy, it’s such a phenomenal show and no one seems to know about it, hopefully they actually advertise it",
                    "score": 4,
                    "author": "horseren0ir"
                },
                {
                    "level": 1,
                    "comment": "This seems like the most promising one right now I hope",
                    "score": 1,
                    "author": "ZADDYISAGOD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hoping it’s silo.",
            "score": 11,
            "author": "DumbestFanBase",
            "replies": [
                {
                    "level": 1,
                    "comment": "You reminded me I need to catch up on this! Only watched the first two so far",
                    "score": 3,
                    "author": "a-hthy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It falls off fairly hard. Won’t say more do to spoilers. Book readers know. That said. I’m still watching. Just hoping they don’t go in a certain direction",
                            "score": 5,
                            "author": "WeDriftEternal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t understand how/why Common keeps getting acting gigs. He’s not good and he’s so utterly distracting in everything I’ve seen him in.",
                    "score": 6,
                    "author": "wittiestphrase"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Severance and The White Lotus. I love Pachinko too, but I don’t think that one is going to ever reach a big audience sadly.",
            "score": 9,
            "author": "Gloomy_Travel7992",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pachinko is the most underrated show that people are sleeping on",
                    "score": 2,
                    "author": "faretheewellennui"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s a lot of great genre stuff now Severence, house of the dragon, last of us, and they’re still really early into their runs so it’s tough to say. I honestly had no idea how good BCS, Succession and Barry would go on to be from their first seasons. \n\nI like The Old Man I think it has a ton of potential and it’s first season was robbed of a proper finale like breaking bad so the 2nd could be really good.\n\nThe White Lotus is pretty great, maybe slightly limited by its anthology nature but that’s also what’s great about it. \n\nI think The Bear is pretty great and it’s already pretty popular(online at least), so it’ll probably have a solid season 2\n\nAlso Warrior is a fantastic show but hardly anyone has heard of it, I’m hoping people find out about it with the premiere of the new season at the end of this month",
            "score": 2,
            "author": "horseren0ir",
            "replies": [
                {
                    "level": 1,
                    "comment": "Severance, HOTD and Warrior all have real promise",
                    "score": 2,
                    "author": "ZADDYISAGOD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**My Brilliant Friend** is the best show right now, but it will end soon because it is going to its last season. It is as good as Succession imo. **The White Lotus** is the second best show right now.\n\n**Pachinko**, **Severance**, **Silo**, **The Last of Us**, **The Bear** are new shows with very high potential.",
            "score": 2,
            "author": "sergiocamposnt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow actually hadnt heard of my brilliant friend, will be adding to the list",
                    "score": 1,
                    "author": "ZADDYISAGOD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Righteous Gemstones is not BCS caliber but goddamnit I love it.",
            "score": 4,
            "author": "aspacelot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do wonder if this is secretly the final season",
                    "score": 2,
                    "author": "BusinessPurge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope so. Just because I want another Danny McBride project. Eastbound season 4 was no good. VP was great and short. His stuff is better in smaller bursts.",
                            "score": 1,
                            "author": "aspacelot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m hoping Netflix’s Three Body Problem turns out well. There is definitely a premium vacuum and I don’t think House of the Dragon will fill it. HBO won’t have a new Succession for two to four years. I don’t think AMC will ever have a Breaking Bad or Better Call Saul ever again. Even FX might be having their own collapse as well. It’s dire!",
            "score": 3,
            "author": "BusinessPurge",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I’m hoping Netflix’s Three Body Problem turns out well\n\nI just finished reading the whole series and I don't see a single way any adaptation will be anything other than complete trash. It feels unfilmable.\n\nLike...there's a part where a bodybuilder jumps into a large cauldron and turns himself into soup. Do you really think the part where the Trisolarians create a CPU using flags will translate well? The whole thing would look so stupid.",
                    "score": 2,
                    "author": "Grand-Pen7946",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They knew to drop Lady Stoneheart, I’m sure without a GRRM involved they can make some changes",
                            "score": 1,
                            "author": "BusinessPurge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Have you read the series?",
                                    "score": 2,
                                    "author": "Grand-Pen7946"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The Chinese adaptation has gotten good reviews.",
                            "score": 1,
                            "author": "Shiva_The-Destroyer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The golden age of TV drama is over.\n\nWe'll likely never see another Sopranos or Breaking Bad or Mad Men again.",
            "score": -2,
            "author": "jcd1974",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sopranos is a different era than Breaking Bad or Mad Men, and Succession and Better Call Saul are yet another era.",
                    "score": 5,
                    "author": "MaskedBandit77"
                },
                {
                    "level": 1,
                    "comment": "You mean, specifically, the golden age of \"people all watching the same thing\". People's interests are now more splintered than they were in the 00s and 10s, but there's still great modern content",
                    "score": 15,
                    "author": "Skavau"
                },
                {
                    "level": 1,
                    "comment": "You really need to watch Severance, White Lotus, Poker Face, Silo… the golden age lives on. Not to mention the 10+ great ones that have came and went since the ones you mentioned",
                    "score": 2,
                    "author": "craftbeerlink"
                },
                {
                    "level": 1,
                    "comment": "Severance will be our lord and saviour",
                    "score": 1,
                    "author": "j_j_a_n_g_g_u"
                },
                {
                    "level": 1,
                    "comment": "What? Game of Thrones ended just four years ago, give it time",
                    "score": 0,
                    "author": "Nodonutsforbaxter44"
                },
                {
                    "level": 1,
                    "comment": "I’d say the peak was over in the early 2000s with the most amount of highest quality series airing at the same time, but we’ve had a greater amount of great shows still coming out with the occasional top tier ones.",
                    "score": 0,
                    "author": "ZADDYISAGOD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Bear",
            "score": 1,
            "author": "crazywalls",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s good but I honestly don’t think it’s that great personally.",
                    "score": 1,
                    "author": "ZADDYISAGOD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Perry Mason** has been fantastic so far.",
            "score": 1,
            "author": "nryc",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve heard mixed things but it’s more due to it not being that accurate to the source material right? Cause it seems to me to have a lot of talent behind it. The",
                    "score": 1,
                    "author": "ZADDYISAGOD"
                }
            ]
        }
    ]
}