{
    "id": "13y1yz2",
    "score": 43,
    "title": "\"Dave\" is a criminally underrated piece of television art.",
    "author": "YaboyWill",
    "date": 1685676913.0,
    "url": "https://www.reddit.com/r/television/comments/13y1yz2",
    "media_urls": [],
    "other_urls": [],
    "postText": "It's honestly so unfortunate to see the severe lack of appreciation this show receives. It's magnificent in almost every way. A super tight production, sound design, direction, characters, and an absolute monolith with guest stars you'd absolutely never expect to see. \n\nIt's a shame even just to search Dave on this subreddit, and see that every post relating to it gets absolutely no attention, just as this one ultimately will, but hey, I'm taking the time regardless because even if just ONE person that would have never watched this show gives it a chance from this post, then totally worth it.",
    "comments": [
        {
            "level": 0,
            "comment": "It was a GREAT season honestly...congrats to everyone involved for making some of the most entertaining tv this year",
            "score": 9,
            "author": "victorisaskeptic"
        },
        {
            "level": 0,
            "comment": "Season 3 finale was so good. Nice appearance by Luke Pitt ;p",
            "score": 28,
            "author": "theusher88"
        },
        {
            "level": 0,
            "comment": "Season 3 is quietly one of the best shows on TV.",
            "score": 49,
            "author": "Mentoman72",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m four episodes in and completely agree. My wife had missed the first three so I rewatched them and episode two actually hit me even harder after I knew where it was going. Loving the tone of season 3.",
                    "score": 17,
                    "author": "ignoresubs"
                },
                {
                    "level": 1,
                    "comment": "Just watched the last 2 episodes and they're truly incredible.  It's amazing how it can be funny, sweet, intense,  up its own ass, genuine, intense, and just plain good all at once.",
                    "score": 4,
                    "author": "AnotherDrZoidberg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely. Accomplished all of it.",
                            "score": 1,
                            "author": "Mentoman72"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I must admit that even though I thought the first part of the second season was a drag, the other half was remarkable and the third season has just been hitting all the right notes so far!",
                    "score": 2,
                    "author": "pvypvMoonFlyer"
                },
                {
                    "level": 1,
                    "comment": "I like season 1 and was ready to give up on the show until I saw season 3 getting great user reviews on IMDB.  I didn't know it was airing but will watch it in a few weeks when work dies down a bit.",
                    "score": 2,
                    "author": "cronedog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fun fact. I'm a middle-aged white guy thats really not that much into music.\n\nBinge watched two and a half seasons before realizing that Dave is actually the real Lil Dicky and um.. that there is a real Lil Dicky.\n\nThe man is a very talented actor and comedian. I had no idea it was all \"real\"(ish).\n\nA very fun series.",
            "score": 21,
            "author": "Cyrano_Knows"
        },
        {
            "level": 0,
            "comment": "That finale was incredible! Luke absolutely slayed in his role.",
            "score": 3,
            "author": "OuterWildsVentures"
        },
        {
            "level": 0,
            "comment": "This weeks episode was just a masterstroke I chuckled at the start when I thought they’d just got bp to cameo but wow what an episode that because I wish more people watched it so I could wax lyrical about it",
            "score": 12,
            "author": "TheCannings",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m about to rewatch the part with Luke “locked in” the booth right now, so funny",
                    "score": 3,
                    "author": "letuceinn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly Lil Dicky has just rubbed me the wrong way ever since he was branding himself as this serious and thoughtful rapper then participated in Chris Brown image rehabilitation",
            "score": 25,
            "author": "Chataboutgames",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;ä he was branding himself as this serious and thoughtful rapper \n\nWhat planet are you living on.",
                    "score": 21,
                    "author": "SuspendedInKarmaMama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The one where a big part of his schtick is being an emotional sadboy and identifying with progressive causes?",
                            "score": 0,
                            "author": "Chataboutgames"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I don't like him either, which has been enough for me to avoid the show.",
                    "score": 4,
                    "author": "Howie-Dowin"
                },
                {
                    "level": 1,
                    "comment": "honestly i kinda feel you on that... but also.... is chris brown just supposed to be forever punished or like, can people like change and get better and deserve better you know? i really dont fw cancel culture",
                    "score": -29,
                    "author": "YaboyWill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The thing is he hasn’t changed one bit and hasn’t faced any consequences for his actions",
                            "score": 20,
                            "author": "Youngandidiotic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hasn't changed??",
                                    "score": -5,
                                    "author": "YaboyWill"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's a difference between being \"cancelled\" and being an abusive piece of shit.",
                            "score": 8,
                            "author": "ScreamingGordita"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; i really dont fw cancel culture\n\nIt's called holding people accountable",
                            "score": 16,
                            "author": "SmokeontheHorizon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of my twitter acquaintances put me on to it during season 1. I loved it from the start but season 2 was emotionally draining. This season was perfect, and I'm so sad because the person who told me to watch it has since passed away, and he would have absolutely loved the finale.",
            "score": 6,
            "author": "Hot-Tie-665",
            "replies": [
                {
                    "level": 1,
                    "comment": "wow im seriously so sorry to hear that wtf",
                    "score": 3,
                    "author": "YaboyWill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, but it is what it is.",
                            "score": 3,
                            "author": "Hot-Tie-665"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a good show and I like it but I wouldn't go nearly as far with the praise as you have. It very much owes a lot to Curb, which makes sense because it was co-created by Jeff Schaffer. Good show, I like the moments when it gets more down to earth with things.",
            "score": 14,
            "author": "WordsAreSomething"
        },
        {
            "level": 0,
            "comment": "its a lesser version, across the board, of Atlanta. I cant tell what the point of the show is, and i really hope they give Dave real character development at some point. so far its just been \"hes neurotic!\" in different forms and variations. I get it, he cant make up his mind about anything, and while it might explain why he hasnt dropped an IRL album in years, makes for a frustrating viewing experience. characters like that arent fun to root for, no matter if thats the point.\n\neven the best bit the show has done so far- the S2 finale with Gata- kinda went nowhere? Dude was in the same exact spot this season, except i guess Nut Haus was the result of that bump? IDK",
            "score": 9,
            "author": "MrBoliNica"
        },
        {
            "level": 0,
            "comment": "Alright I'll watch it",
            "score": 2,
            "author": "BitchAssWaferCookie",
            "replies": [
                {
                    "level": 1,
                    "comment": "if you actually do, come back and let me know what you think!",
                    "score": 1,
                    "author": "YaboyWill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure , will do",
                            "score": 1,
                            "author": "BitchAssWaferCookie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's fine. Takes itself way too seriously for what it is.",
            "score": 5,
            "author": "GdTryBruce"
        },
        {
            "level": 0,
            "comment": "I really liked the first season but the second season was so bad I’m not sure I want to give it another shot.",
            "score": 9,
            "author": "angelus97",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you finish season 2? I feel like the finale made the rest of the season better",
                    "score": 21,
                    "author": "Nodonutsforbaxter44"
                },
                {
                    "level": 1,
                    "comment": "Agreed second season was hard to get through but the last season is much better and worth watching if you liked the first season imo. Tbh you could skip right to it and wouldn’t miss much from s2",
                    "score": 7,
                    "author": "winkkyface",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m a fan but the series swings as wildly as Gata’s moods when he’s not on his meds. It can be jarring.",
                            "score": 10,
                            "author": "TootieSummers"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why didn't you like season 2? I really never understand why this criticism pops up so much. Season 2 was deep, thought-provoking and hilarious.",
                    "score": 4,
                    "author": "nevereatpears"
                },
                {
                    "level": 1,
                    "comment": "I'm in the same boat.  I really liked the first season a lot and was very hyped for the second season.  I made it about two episodes before it completely lost me.",
                    "score": 2,
                    "author": "peanutmanak47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The second half of season two is really good. First half is pretty bad though. Season 3 has been very solid.",
                            "score": 3,
                            "author": "kyh0mpb"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The third season is so good, that it makes you forget how bad season 2 was.",
                    "score": 0,
                    "author": "JKJ420"
                },
                {
                    "level": 1,
                    "comment": "I feel this way about this season. I loved season 2 though",
                    "score": 1,
                    "author": "BrothaBeejus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not quite as good as season 2 IMO, but the latter half really redeemed an otherwise just okay beginning. The last couple of episodes, in particular, were nothing short of brilliant.",
            "score": 2,
            "author": "afteraftersun"
        },
        {
            "level": 0,
            "comment": "Last episode was complete insanity",
            "score": 3,
            "author": "RedditGGGB"
        },
        {
            "level": 0,
            "comment": "Season 1 and 2 of Dave were 2 of my favorite seasons of a show in recent years. Season 3 is a farce. I don't think I enjoyed a single episode this season. It's just a bunch of disjointed nonsense, culminating in the finale which I almost shut off mid way. It completely lacks the heart and humor of the first 2 seasons, and it's super depressing.",
            "score": 1,
            "author": "DirtyProjector"
        },
        {
            "level": 0,
            "comment": "I blame that picture on streaming of Dave sticking out of his tighty whiteys. Just not something I want to click on despite the praise. Literally anything else in the marketing department would have helped.",
            "score": -1,
            "author": "JustAboutAlright"
        },
        {
            "level": 0,
            "comment": "I love the show, but the celebrity cameos bring every episode to a screeching cringy halt, in a way I haven’t seen since The League.",
            "score": -1,
            "author": "BartonFunk99"
        },
        {
            "level": 0,
            "comment": "This show gets better every season. Your title perfectly encapsulates what this show is - television art.",
            "score": 1,
            "author": "mhennessy348"
        },
        {
            "level": 0,
            "comment": "It’s pretty well rated and well watched.",
            "score": 1,
            "author": "gale_force_tuna_wind",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely not well watched but yeah well rated.",
                    "score": 1,
                    "author": "YaboyWill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Season 1 was the most watched FX comedy series in the history of the network.",
                            "score": 1,
                            "author": "gale_force_tuna_wind"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck Dave. He chose to work with Chris brown. He didn't have to. Fuck him.",
            "score": 0,
            "author": "YouWishYouLivedHere",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}