{
    "id": "13yoo9a",
    "score": 5763,
    "title": "Disney to Take $1.5 Billion Content Write-Off Charge in June Quarter After Pulling Dozens of Titles From Streaming Services",
    "author": "DemiFiendRSA",
    "date": 1685738919.0,
    "url": "https://www.reddit.com/r/television/comments/13yoo9a",
    "media_urls": [
        "https://variety.com/2023/digital/news/disney-1-5-billion-content-write-off-charge-streaming-1235631877/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;He also said the company expects to raise the price of Disney+ without ads later this year “to better reflect the value of our content offerings.”\n\nBut... you just reduced the offerings AND said you were going to make less series...",
            "score": 2214,
            "author": "Thomas_JCG",
            "replies": [
                {
                    "level": 1,
                    "comment": "Disney has a big problem.  Their former CEO was attempting to transition the company into Disney+ and was \"cooking the books\" in order to do so.  If a show or movie was older or appeared in movie theaters or was on one of their TV networks, he booked it as having no cost to Disney+.  Which isn't true, it's cost is the lost revenue of selling it to some other streaming service.\n\nThey're starting to realize that a lot of properties that are on Disney+ would make more money being licensed to someone else.  Now that the true cost of programming for Disney+ is public information, the execs at Disney are trying to slash content and raise prices to try and get back to break even on this venture.",
                    "score": 940,
                    "author": "garlicroastedpotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Until Disney’s pivot, I figured their plan was to use Disney+ as a loss leader in the hopes of squeezing out Netflix long term. Now it seems that short-term profitability rather than long-term market share is the order of the day, which is probably good news for Netflix as it makes Disney+ much easier to compete against.",
                            "score": 509,
                            "author": "Sanhen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Disney + was inflated from day one. Bob chapek was going to cut alot of fat at disney with people that were under producing. CFO did a power play claiming he was hiding the numbers ro get Iger back to save her friends. She is now pushing for CEO position once iger steps down. Problem is what they accused chapek doing iger and the CFO were caught fudging the numbers as well. The fall out of film flops are still Igers fault. Iger was pro at buying assets and cannibalizing them. Also why under Iger they made so many more sequels and did very little original new IP. Chapek never got the chance to redirect disney as iger projects were still being process via contracts.",
                                    "score": 15,
                                    "author": "saoyraan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Short term gains for long term losses is the capitalist way. Climate change and the environment, worker compensation and treatment are two examples that highlight how company's approach to shareholder value now is going to ruin them long term",
                                    "score": 215,
                                    "author": "talligan",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Killing the Netflix Marvel relationship was beyond dumb. Allowed them to license content that didn't fit the Disney brand while still having the ability to control and influence the products",
                            "score": 420,
                            "author": "existentialsandwich",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Makes me worried about Daredevil series on D+. They'll make it generic like the other Marvel shows, when it stood out as being the best since Netflix had more freedom. Now with the writer's strike that is ongoing, filming isn't even complete yet, so it's going to cause so much setbacks. At this point, wouldn't be surprised if Disney pulls it and writes it off as well. I hope not, and it looks solid now, but who knows.",
                                    "score": 149,
                                    "author": "ILoveScottishLasses",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are the d+ shows generic? They are playing a lot more in the genre space and taking a lot more risks than the movies do",
                                            "score": 58,
                                            "author": "Chad___Sexington",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "WandaVjsion was so generic I couldn’t distinguish between it and a 1960’s sitcom. /s",
                                                    "score": 39,
                                                    "author": "americanextreme",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Started out very unique, but turned into a generic marvel fight at the end. I still enjoyed it though.",
                                                            "score": 8,
                                                            "author": "Indigocell"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's a mixed bag if you ask me.",
                                                    "score": 57,
                                                    "author": "beefJeRKy-LB"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Imo they start off being really fresh and interesting and then devolve into an energy beam battle like every marvel movie does these days. I'd say wandavision, moon Knight, and shang chi all felt really exciting at the beginning and then veered off into the comfortable generic superhero stuff toward the end.",
                                                    "score": 33,
                                                    "author": "moondaybitch",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I agree. Even if Wandavision wasn't really to my taste, no one could argue it wasn't creative and approving it took balls. Loki as well.\n\nI mean then you have Falcon&amp;WinterSoldier and Hawkeye to compensate (quite generic) but I think overall it's a good balance.",
                                                    "score": 24,
                                                    "author": "guareber",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think Falcon and Winter Soldier was hurt by COVID. It seemed like they had to stop filming, and edit something together with what they had.",
                                                            "score": 10,
                                                            "author": "mdp300",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I think you may be right. I really enjoyed the character scenes from them both, but the plot was a mess.",
                                                                    "score": 10,
                                                                    "author": "guareber"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They also had to cut an entire plot line about the Flag Smashers using vaccines in population control for obvious reasons.",
                                                                    "score": 3,
                                                                    "author": "OceanFrost"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "PG13 rating should have many worried",
                                            "score": 3,
                                            "author": "Zealot_Alec"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They should buy out GoJo",
                            "score": 8,
                            "author": "LarryPeru",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can we have the room?",
                                    "score": 3,
                                    "author": "Pascalica"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Aaaand this is where the money I’ve been happily spending on them gets reallocated to storage space as I once again return to the high seas",
                    "score": 46,
                    "author": "slawnz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My favorite site just closed its doors so that makes it a bit difficult, for me anyway.",
                            "score": 10,
                            "author": "AwesomeJohn01",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I will probably buy the few remaining movies I care about on disc.",
                            "score": 4,
                            "author": "No_Zombie2021",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; He also said the company expects to raise the price of Disney+ without ads later this year “to better reflect the value of our content offerings.” \n\nDisney have said last couple of months that they will make less shows overall, cut costs and hire less people and they have now also started pulling shows to save money yet they somehow think a for a costumer this means a higher value for the service...\n\nMost things go up in price, thats fine i suppose but atleast be honest about it, dont pretend that the service have somehow gotten better so the price should rise.",
            "score": 3310,
            "author": "bannedagainomg",
            "replies": [
                {
                    "level": 1,
                    "comment": "and many of the shows they make specifically for the service are not exactly bangers",
                    "score": 1258,
                    "author": "badger81987",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are hitting the families. Us adults can only handle watching a movie or show twice a year but kids. They’d watch bluey and those shows on repeat for weeks if they could. They know who will renew no matter the cost.",
                            "score": 26,
                            "author": "Borgestown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is 100% right. Their streaming for Bluey, Moana, and a small handful of kid-friendly titles far outpace anything else on their platform. They also, unfortunately, have very little competition. Most of the other platforms have maybe like one or two solid kids titles: Max has Sesame Street, Apple TV+ has Fraggle Rock. Disney has a deep well of the best kids content, and very little competition. \n\nThe path forward for Disney+ in this penny-pinching corporate streaming hell is 100% kids content. They will jettison Marvel &amp; Star Wars properties, because they can make more on licensing to other platforms. Also, it’s undoubtedly painful to spend top dollar to make a critically panned show that tanks with viewers when your only path to recoup costs is raw viewership and subscriptions. If Disney made Mando or Book of Boba for a different platform, massive upfront licensing agreements would cover the lion share of the costs. By comparison, my kids aren’t going to trash Bluey all over Internet forums like it’s their full time job if the creators produce a weak season. Bluey will be played on heavy rotation no matter what.",
                                    "score": 13,
                                    "author": "NC-Slacker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As a parent, you're correct. We only keep Disney + for the kids. The collection of Disney classics and Bluey is a great value. If you're not binging Winnie the Pooh, I cant see how it is worth it though. \n\nAlso, Bluey is the best thing to happen to kids television (for parents).",
                                            "score": 7,
                                            "author": "GonnaDriveuber"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Bluey is good tho",
                                            "score": 3,
                                            "author": "beowulfshady",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Most of them are just Star Wars and Marvel and I've gotten way past burnt out on both if I'm honest.",
                            "score": 1188,
                            "author": "Xonra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Disney has made me feel indifferent about Star Wars. I can never forgive them for that.",
                                    "score": 1240,
                                    "author": "Redditer51",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was going to write off star wars but then Andor was so good.  A little binding force in a galaxy of shit.",
                                            "score": 506,
                                            "author": "fatbaIlerina",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I still find it ironic that the characters the fans wanted shows for (Boba Fett and Obi Wan) ended up not being good compared to the show made for a character from Rogue One that nobody asked for. I legit was surprised how amazing Andor was. Like, where was this magic on the other shows?",
                                                    "score": 111,
                                                    "author": "426763",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I have the same issue with Kenobi and BoBF that I had with Solo - they weren't bad, perse (well, tbh I actually do think BoBF was kind of bad), but the characters they featured stood well enough on their own in the existing movies, and didn't really need a show to flesh out their characters.\n\nContrast that with Mando/Andor, which feature original characters, the writers have a lot more freedom to explore them without conflicting with established canon like Kenobi did. Plus, I frankly enjoy seeing more focus on average people and their struggle to survive.\n\nLike, there's so much galaxy out there. Let's explore more of that please.",
                                                            "score": 42,
                                                            "author": "murshawursha",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I think a lot of the problem stems from Disney's corporate structure.\n\nThe shows that were high profile got more attention (ie: meddling) from the upper executives and had stories that were completely sterilized because they were written by comittee following a fairly strict process to make them as attractive as possible to as wide an audience as possible, while referencing and connecting to as many other products as possible.\n\nThat sort of set up isn't conducive to good story telling or creativity.\n\nTake The Mandalorian for example, season 1 came as a sleeper hit, season 2 was more anticipated, and ended up being worse. Season 3 was clearly a big deal to Disney and ended up the worst one yet.\n\nIt hurts, because Rogue One and Andor were great, but I'm honestly expecting Season 2 to be a mess that tries to plug Andor into too many other productions and has other important characters not previously connected to the story forcibly and awkwardly jammed into the show to make it \"better\".",
                                                                    "score": 28,
                                                                    "author": "Lord_Silverkey",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Season 2 is the only other season Andor is going to get and Tony Gilroy is still running the show. I think he has been given the freedom to do what he wants.\n\nAndor was a huge critical hit, but still not many people have watched it compared to the other Star Wars shows.",
                                                                            "score": 20,
                                                                            "author": "FUMFVR"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Book of Boba Fett was a huge turd sandwich.  I'm going to be a crime lord,  that doesn't commit crimes.  You guys can just pay me from respect,  not fear. And can they quit giving Robert Rodriguez work. Everything ends up looking like a Power Ranges show.",
                                                                    "score": 3,
                                                                    "author": "HandsOffMyDitka"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes but we have a while before that’s back and probably five other SW Disney+ things before then 🫠",
                                                    "score": 131,
                                                    "author": "allumeusend",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Sad thing is with cut backs they’d never risk to make a show like Andor.",
                                                    "score": 15,
                                                    "author": "apple_kicks"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The best thing about Andor and Rogue One is that they make a solid line with the OT.\n\nI can keep my canon as Andor-Rogue One-Original Trilogy and jettison the rest.",
                                                    "score": 51,
                                                    "author": "Overlord1317",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I hate the vespa riding power ranger wannabes from book of Boba Fett. 😠",
                                                            "score": 64,
                                                            "author": "Key-Cry-8570",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Boba Fett was such a let down.",
                                                                    "score": 38,
                                                                    "author": "Shakeyshades",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Boba fett was so bad the writers gave up halfway through and wrote more Mando.",
                                                                            "score": 57,
                                                                            "author": "fullsaildan",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It could be Star Wars Citizen Kane, I just don't give a shit about it anymore.",
                                                    "score": 59,
                                                    "author": "upboatsallaround",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I was born in 76-literally a lifelong SW fan. I ate, slept, and breathed that shit. I had such high hopes when Disney bought Lucas out...in recent years,I have very much wished he was still in charge. Indifferent is the word for it-I just dont care about it anymore. Feels like a death-I know it sounds melodramatic, but they smothered and killed something that meant so much to me for so much of my life. Fuck you forever Disney.",
                                            "score": 43,
                                            "author": "MelmacDaddy",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Right!? \n\nThat shouldn't have been possible for me. Star Wars is, for better or worse, just part of my DNA. \n\nI could give two shits about the \"brand\" at this point.",
                                            "score": 63,
                                            "author": "what_if_Im_dinosaur",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I went from someone who watched every Star Wars release in my lifetime in theaters to someone who couldn't be assed to watch any of the Disney shows. I just don't care anymore.",
                                                    "score": 69,
                                                    "author": "GarlVinland4Astrea",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If they made more shows like Andor then I'd be fine either that. Unfortunately that's not the case.",
                                    "score": 27,
                                    "author": "adamsaidnooooo"
                                },
                                {
                                    "level": 3,
                                    "comment": "The only actually great thing they’ve released is Andor. Everything else is so cheap and badly written it’s actually infuriating how bad there shows are, especially when you realize the budgets they have.",
                                    "score": 112,
                                    "author": "iMajorJohnson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Rogue one is the best of the Disney star wars movies, and even that has a really uneven opening act as they shift between planets and introduce everyone. The final battle is awesome though.",
                                            "score": 88,
                                            "author": "BigLan2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The last hour or so of that movie is fuckin stellar, easily one of the best stretches of any SWs movie imo",
                                                    "score": 47,
                                                    "author": "peanutdakidnappa"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "you know how the movie is going to end before it even starts and it's *still* better than ep VII VIII and IX",
                                                    "score": 33,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m really hoping that Ahsoka turns out more like Andor/Mando seasons 1-2 than Book of Boba Fett/Kenobi",
                                            "score": 28,
                                            "author": "cjm0",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The new Jedi survivor game has revitalized my love of the franchise",
                                    "score": 3,
                                    "author": "Rye_The_Science_Guy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It seems like a lot of them are what’s being taken off.  \n\nWillow \nMighty ducks \nWorld according to Jeff goldblum.  \n\nThese were shows that were meant to get people to sign up.  How willow or ducks even got green lit is beyond me.",
                            "score": 21,
                            "author": "Busy_Moment_7380",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Name recognition and mememberries.",
                                    "score": 17,
                                    "author": "Creski",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mostly use it to watch Modern Family, Bobs Burgers and Futurama.",
                            "score": 18,
                            "author": "Yellow-Eyed-Demon"
                        },
                        {
                            "level": 2,
                            "comment": "Here's looking at you Hocus Pocus 2 and The Santa Clauses. Seriously. HP2 was basically a halloween themed Walgreens ad.",
                            "score": 67,
                            "author": "solohack3r",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Guess that means I’ll be cancelling, to better reflect the value of their content offerings.",
                    "score": 89,
                    "author": "everybodytotheIimit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I felt exactly the same way when the one new non-SW non-MCU franchise they revived that got me excited (Willow) was pulled before i could fit it into my busy schedule and watch more than the first episode.\n\nThis is your NEW CONTENT not legitimately available anywhere else cut before it had a chance to save some bucks for the biggest most bloated entertainment giant in the world. Way to make me want to spend all my stream subscription money on a VPN and go back to pirating everything.",
                            "score": 12,
                            "author": "Futher_Mocker",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm getting real tired of all this bullshit going on with streaming. I already canceled my Netflix cause of their new anti-account sharing policy. And then there's the HBO Discovery disaster. I am so tired of it.\n\nI miss the days when it was simple and all you needed was Netflix and Hulu, and there wasn't all this anti-consumer based decision making.",
                    "score": 267,
                    "author": "Redditer51",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Every media production company thought it would be easy money to stop selling to Netflix and instead, stream directly to the customer.  Easy money, right?  Cut out the middle man!\n\nAnd to get a critical mass of users, they sold subscriptions as cheap as possible and also poured money into production so their service would have a decent amount of content.\n\nThis is the basic formula that social media companies follow: lose money to get market share before beginning to think about profits.\n\nThese media producers are now at the \"thinking about profits\" stage and they're discovering that it was a lot harder to run a profitable streaming service than they thought.\n\nI'm hoping some of them realize this and start selling to Netflix again so we can be back to those old days... \n\n...but ultimately it doesn't matter for me: I've discovered that I don't need instant access to every bit of content in existence, so I rotate subscriptions and my total streaming bill is lower than ever (though at some cost to my convenience).",
                            "score": 109,
                            "author": "gw2master",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Shareholders: \"We want our own streaming service and subscribers to compete Netflix, even if it doesn't make  money!\"\n\nStreaming Company: \"Cool, here you go! Mission Acc-\"\n\nShareholders: \"Ok now turn our streaming service to make less shows, raise the sub price ten fold, show tons of ads (even with ad-free tier), and kill the subscriber base so we can make tons of profits!\"\n\nStreaming Company: \"....\"",
                                    "score": 26,
                                    "author": "ILoveScottishLasses",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They're begging for piracy to become mainstream at the rate this shit is going... honestly.",
                            "score": 186,
                            "author": "codexcdm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think there was a period where Netflix really took a good fight directly to piracy. Like it was just flat out more convenient and sort of had everything on it. So a lot of people stopped pirating, it's like if I can pay 10/20 dollars a month and it seamlessly works on my phone my laptop my TV great I'll pay.  \n\nNow the content is so spread out over so many services, not only is it extremely expensive but it's also really inconvenient to have so many different apps of varying quality on all your devices.\n\nAnd now they are pulling down their own content so literally the only place to get that content is piracy.  It's becoming the better more convienient option again regardless of price.",
                                    "score": 137,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly what happened to myself and no doubt many others here. Been years since I stopped using mIRC.\n\nAll these apps are basically going to lead to a crash... then Cable 2.0.... Though I guess it's already happening with some cable providers offering tidbits of streaming services... or with Prime Video letting users subscribe to channels/services under the Prime umbrella.",
                                            "score": 31,
                                            "author": "codexcdm"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "it wont be long now until streaming resembles cable to a T. imo that is a goal of the industry to get people hooked on the same shitty service/package they were 15+ years ago",
                                            "score": 20,
                                            "author": "EgoDefeator",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And if RSNs die (and they should), cable is basically dead too. You thought cable cutting was already bad? Sports is the main reason people still have cable.",
                                                    "score": 6,
                                                    "author": "Maxpowr9"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I have hulu, netflix, disney+, espn+, hbo max, and apple tv. \n\nThis is insane, I realize, and I'm cancelling a bunch of them this weekend. Most of them I only subscribe to for one or two shows. It has already become cable.",
                                                    "score": 3,
                                                    "author": "GonnaDriveuber"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I get Netflix included with my phone plan otherwise I wouldn’t be paying for dozens of original series that last 2.5 seasons. Aside that, I’m shopping for large hard drives not price tiers with/without ads.",
                                    "score": 22,
                                    "author": "FordBeeblebrox"
                                },
                                {
                                    "level": 3,
                                    "comment": "Also highly recommend collecting physical media if you have the space for it, there's something really nice about having an actual library of the stuff you love",
                                    "score": 21,
                                    "author": "liiiam0707",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You also don’t get automatically downgraded from 4k uhd to 1080p with the hope you won’t notice.",
                                            "score": 17,
                                            "author": "blue_umpire"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pretty much back to pirating between Netflix, Disney, and HBO",
                                    "score": 3,
                                    "author": "APr0N00b"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Look up vudu they have bundles on sale where you can buy every season of game of thrones etc and stream it easily.",
                            "score": 13,
                            "author": "Professional-Dig6481",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think content providers like Vudu are where the money is for studios. They can calculate the profits from licensed products, and will make a larger profit than they would from a subscription-based, studio-owned streaming service.",
                                    "score": 18,
                                    "author": "Fett_Anonymous"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Let me play devils advocate: the service was always underpriced as a loss leader for their brand, now they are trying to get a little money out of it.",
                    "score": 188,
                    "author": "Bonesmash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You got it. The race to grab consumers and grab content is over. Now they have to regulate themselves. The golden age of streaming is over. It was fun while it lasted.",
                            "score": 162,
                            "author": "solohack3r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, on one hand it lasted longer than I expected. On the other hand it kept going on so long I began to think I had severely undershot how long it could stay almost-free. \n\nInterest rates &amp; the pandemic profit bump is what really ended it though.",
                                    "score": 8,
                                    "author": "Dylan33x"
                                },
                                {
                                    "level": 3,
                                    "comment": "not renewing my disney+ thats for sure",
                                    "score": 19,
                                    "author": "Turinggirl",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's a really shitty move for people who acted in some of these shows. No residuals for the Willow folks for example. A lot of actors took those jobs for a certain rate assuming that there would be decent ongoing residuals.",
                                    "score": 3,
                                    "author": "btribble"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Then pulling content is their version of shrink-flation.",
                    "score": 5,
                    "author": "ammobox"
                },
                {
                    "level": 1,
                    "comment": "Guess it's time to pirate bluey",
                    "score": 3,
                    "author": "Drewskidude325",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My best friend just bought my son the first two seasons on Blu-ray at Target for like $20. Over 100 episodes. Good to have as back up any way if we are traveling, app is down, internet goes out, etc.",
                            "score": 3,
                            "author": "myhairsreddit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, streaming remains massively unprofitable (besides Netflix) and the era of large subscriber growth has stopped. They have to do something to start making money",
                    "score": 48,
                    "author": "MrDabollBlueSteppers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Two major streaming services are claiming to be profitable *soon*!\n\n[THR](https://www.hollywoodreporter.com/business/business-news/warner-bros-discovery-earnings-streaming-profitable-subscribers-1235480432/): **Warner Bros. Discovery** Swings to $50M Streaming Profit, **Says U.S. Streaming Business Will Be Profitable for 2023**\n\n[Deadline](https://deadline.com/2023/02/disney-streaming-profit-outlook-bob-iger-1235253673/): **Disney Reaffirms Outlook For Streaming Profitability By 2024**",
                            "score": 28,
                            "author": "Neo2199"
                        },
                        {
                            "level": 2,
                            "comment": "Yea, i don't blame them for it. Doesn't change the fact that once they do it, I'll be adding them to the streaming service carousel where I pay for one month maybe twice a year depending on content releases instead of just keeping the subscription all year long because it's pretty cheap though.",
                            "score": 4,
                            "author": "Matthiasad"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've noticed the price of pirating is not increasing. How does Disney intend to stay competitive?",
                    "score": 17,
                    "author": "getefix",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have Disney+. I’m just realizing I haven’t looked at it in three months or more because all the content sucks. Guess it’s time to cancel. Thanks for the reminder!",
                    "score": 7,
                    "author": "Blewedup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've found the best way to deal with that kind of thing is to immediately unsubscribe whenever I sign up to something.  That way I have it for a month and don't have to worry about paying for something I don't use.",
                            "score": 3,
                            "author": "tunnel-snakes-rule"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I 100% agree with you and understand your point but from what I understand, it's less about just reducing the content but more of reducing the content AND investing that \"savings\" on improving the content that already exists. It seems like Disney+ went for quantity over quality and it definitely shows. I wouldn't mind paying more for some amazing shows but if they think they can just increase the prices and keep the status quo, they are mistaken.....",
                    "score": 3,
                    "author": "Ndrago92"
                },
                {
                    "level": 1,
                    "comment": "They need to stop making Disney plus shows for children, the catalog isn't enough for people to want to stay subscribed who are actually fronting the bill.",
                    "score": 3,
                    "author": "AgonizingSquid",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have the Disney bundle for free with my cell plan. However, Verizon is removing the Disney bundle from all plans. So, I'm looking at a free to me service going paid likely, and everyone is raising their subscription fees. I'm now to the point where I could afford all the services I needed without thinking too much about it, but I'm going to start rotating my subscriptions and I don't think I'm alone. These services may we'll see their revenues falling in the next year.",
                    "score": 3,
                    "author": "PNWoutdoors"
                },
                {
                    "level": 1,
                    "comment": "Came here to say exactly this. It’s wild to think they’re going to be offering less and less content whilst asking for more money to subscribe. How the heck is that good business?",
                    "score": 3,
                    "author": "Matunahelper"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 387,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Disney Vault 2.0",
                    "score": 184,
                    "author": "2ndHandTardis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wouldn't put it past them to make an event out of it... like they used to do in commercials stating they were about to put various classics back into the vault when tapes/DVDs were still a big deal.",
                            "score": 78,
                            "author": "codexcdm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Boy I fell for that hard, like as a teenager I would see they were putting stuff “in the vault” soon so I would beg my parents to go buy stuff on DVD because WHO KNOWS WHEN IT WILL BE OUT AGAIN",
                                    "score": 18,
                                    "author": "trulymadlybigly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And I've purchased half of those \"vaulted\" DVDs at resale stores for around $5 or less over the years.",
                                            "score": 3,
                                            "author": "myhairsreddit"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh no.... I fear you just gave a mediocre exec a bonus worthy idea.",
                                    "score": 31,
                                    "author": "2ndHandTardis"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh, they are definitely gonna put some of the classics back in the Vault.  That is gonna happen.",
                            "score": 23,
                            "author": "allumeusend",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fortunately I know the combination to the vault… \n\nAvast ye mateys!",
                                    "score": 5,
                                    "author": "FictionVent"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Remember when they started selling those tiny little 8 ounce cans of coke and they cost the same amount as the 12 oz cans? It's like that but even more so",
                    "score": 16,
                    "author": "KrispyKremeDiet20",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, my wife and I enjoy Disney+…\n\nBut with this business strategy and their attitude, we will be wrapping up our subscription a month or so. \n\nFinish a couple of shows and that’s that.",
            "score": 44,
            "author": "FlamingTrollz",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s still worth it for me since I’m in Asia where there’s more content, but i fear for the future.",
                    "score": 6,
                    "author": "Dark_Aster566",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We paid for the year a couple of months back, so we'll ride the rest of the subscription out and see what happens. We mainly use it for easy access for our son to things like Spiderman, Bluey, Frozen, Encanto, etc. If it's still that convenient and still has all of his favorite stuff at a decent price, we will probably do another year and see how it goes. I can definitely understand why other people would think twice about continuing, though. Especially if they start losing their favorite titles and the price becomes not worth it.\n\nI'm still an avid collector of physical copies of our favorite films and shows. I watch streaming out of convenience, but if a service starts losing the vast majority of the reason I use it, it becomes no longer convenient, and I cut ties. We'll end up doing the same with Disney+ if our living room shelf starts providing more than the streaming service does.",
                    "score": 3,
                    "author": "myhairsreddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like I’m about to see the unbundling and rebundling of cable tv packages in my lifetime.",
            "score": 351,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Time is a flat circle.",
                    "score": 115,
                    "author": "Smarktalk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jeremy Bearimy strikes again",
                            "score": 62,
                            "author": "IReallyLoveAvocados",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The dot above the i, it broke me",
                                    "score": 18,
                                    "author": "hovdeisfunny"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cable Packages\n\nPiracy\n\nStreaming Services &lt;---- we are here\n\nPiracy \n\nCable Packages\n\nGuess it's about time to set sail!",
                    "score": 71,
                    "author": "realhenrymccoy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This taking things off streamers is gonna be a problem. If the Industry doesn't bring back physical media then certain movies/shows are just going to die. People predominantly watch what is recent to them.",
            "score": 545,
            "author": "BillyThe_Kid97",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plus shows or movies you wanna watch back later.\nI've seen it before both on regular tv and streaming, a great show gets cancelled but still available for streaming for a while but after a couple years you can't even buy the DVD or anything even if you wanted to pay.\nLike Netflix trying to remove arrested development, except for pirating that would just disappear, you can't buy the Netflix seasons on DVD i think so how would you watch it if not for pirating?\nTimes of great shows like taxi or Seinfeld just being available 30-50 years later in box sets are over.",
                    "score": 123,
                    "author": "Welkominspace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Netflix seasons, fair enough, but I'll tell you that if you want a DVD set of the original run, they're practically overflowing at all the used video shops I've been to. They'll probably charge you more if you *don't* take one.",
                            "score": 21,
                            "author": "SuperFLEB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Complete taxi is $27.00, we just got Seinfeld for my dad at Xmas.  Box sets will be at around for a long time,  imo. Eventually might even be a tiny box with a  memstick.",
                                    "score": 8,
                                    "author": "myrddyna"
                                },
                                {
                                    "level": 3,
                                    "comment": "I got the BD collections of \"That 70's Show\" for $35 on Amazon, Community box set for $20 at Best Buy, the  DVD releases of Greek on eBay, and I found the box set of Avatar the Last Airbender at my used bookstore for $5.\n\n\nThese are the shows that I would repeatedly watch on streaming services.\n\nMost of them used to be on Netflix or Hulu, but once they were dropped by both services, I decided to cancel my subscriptions and buy the physical copies",
                                    "score": 13,
                                    "author": "idkalan",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The reality is where I come from the only access to certain content is through piracy. The streamers only have what is new and popular.",
                    "score": 171,
                    "author": "Cantmakeaspell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; The reality is where I come from the only access to certain content is through piracy. The streamers only have what is new and popular.\n\nEven P2P piracy is reliant on the content being popular. So the content that's actually less popular is going to disappear. This is one thing you'd expect not to happen with streaming - it doesn't take much for a large corporation to store every show ever made.",
                            "score": 53,
                            "author": "frostygrin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; This is one thing you'd expect not to happen with streaming - it doesn't take much for a large corporation to store every show ever made.\n\nThey can easily store everything they've ever made... actually getting it to you is the expensive part.\n\n[The BBC planned this in 2000](https://youtu.be/9uED254fWjU?t=1249). 23 years later and they still haven't because of music rights, actors residuals, etc.\n\nIf you work for them you have complete access, it's all digitised and there... they just can't sell.",
                                    "score": 19,
                                    "author": "TIGHazard",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then it's not \"getting it to you\" that's the expensive part, but complying with the intellectual property rights and contracts. It's senseless that selling a few copies or showing the episode a few times is less workable than selling no copies at all. And it's not like it's in the creators' interests either.",
                                            "score": 16,
                                            "author": "frostygrin"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People are also not getting their royalties, another reason why streamers pull movies.",
                    "score": 9,
                    "author": "2Darky"
                },
                {
                    "level": 1,
                    "comment": "My Plex server has all the content I ever want. That’s what Disney is competing with. If it’s easier for me to watch a movie/show on Disney than it is on my Plex, I’ll gladly pay. If not, to the high seas I go.",
                    "score": 59,
                    "author": "Poltras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Between this and Netflix cracking down on account sharing (I no longer have access to the account my parents were paying for, and in turn, they canceled their account cause they think it's too expensive for just them!) i'm just going to buy a NAS and larger hard drives so I can increase my Plex server. This is crazy, and only drives piracy and lower revenue for companies when you are removing stuff all the time and making it more and more expensive!",
                            "score": 32,
                            "author": "Saloncinx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I'm not entirely sure what their argument is - It's like a car dealership trying to drive a hard bargain on the price of a Camry when you can literally walk across the street, snap your fingers and have any car you want in your possession for zero dollars, with only the vague threat that you could potentially get in trouble even though no one you've ever met that does this has ever been punished.",
                                    "score": 18,
                                    "author": "Vinnie_Vegas",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You sound like someone who would download a car.",
                                            "score": 15,
                                            "author": "Exasperated_Sigh"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sadly one of the biggest and best torrent sites just closed down a few days ago.",
                                    "score": 10,
                                    "author": "onyxcaspian",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Already happening. There's a Reggie Watts special that I really enjoyed on Netflix a decade or so back and watched it periodically. I tried last year and it's just....gone. Not on YouTube, not on a stream...just gone.",
                    "score": 4,
                    "author": "PattyIceNY",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s out there, just gotta dig deeper",
                            "score": 3,
                            "author": "Jaysontatumpepnips"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "also no residuals for writters and actors and no media preservation",
                    "score": 5,
                    "author": "Zenkakau"
                },
                {
                    "level": 1,
                    "comment": "We live in the golden age of crowdsourcing. The porn industry had already shown that creators can take control of their content, cut out the big studios and still be able to reach their fans.\n\nMore and more journalists are generating their own income through substack so they can maintain their journalistic integrity and not rely on publications to fund them.\n\nI hope the same thing happens with entertainment and tv shows. Of course it's a lot more complicated than posting thirst videos to get subscribers but I'd be more than happy to sponsor my favourite creators and shows.",
                    "score": 4,
                    "author": "muricabrb",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt;This taking things off streamers is gonna be a problem. If the Industry doesn't bring back physical media then certain movies/shows are just going to die.\n\nThere's still digital media you can buy.",
                    "score": 3,
                    "author": "Wondoorous",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have 0 understanding of how you can write off a show that was already paid for, outside the possible year you could write it off in for the traditional model. That Jeff Goldum show LAUNCHED with the service how tf are they able to write this off in 2023?",
            "score": 23,
            "author": "Powerman293"
        },
        {
            "level": 0,
            "comment": "I wish I could take my own stuff, put whatever price I want on it, put it in my basement, and declare it as a loss on taxes.",
            "score": 693,
            "author": "historycat95",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's not how it works. \n\nThey recognize the cost of production over the run of it being on the streaming service. If it leaves earlier than planned, it's expense recognized at that time. They aren't getting a dollar-for-dollar deduction from their taxes. They're recognizing a portion of a cash outlay from a prior period that they were unable to deduct when they actually paid for it.",
                    "score": 69,
                    "author": "RealAmerik",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; put whatever price I want on it\n\nWell you're not supposed to be able to do that, you're only allowed to put down what you spent.\n\nBut in these cases, they do creative accounting right? Assigning costs to these removed shows that aren't really applicable (or fully attributable) to them.",
                    "score": 130,
                    "author": "hoopaholik91",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You generally cannot do that when reporting financial information to the IRS or preparing financial statements in accordance with GAAP. Hollywood accounting is often used to measure things internally within an organization or calculate profits or losses related to third party arrangements (profit sharing, royalties etc) when standards aren’t well defined in the related underlying agreements.",
                            "score": 61,
                            "author": "EmergencyThing5"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not a loss - it’s called expense and it’s fair and accurate.",
                    "score": 9,
                    "author": "DeansFrenchOnion1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Copyright law needs to change.  If you write off content, you are saying it has no economic value.  It should then automatically become public domain.",
            "score": 1100,
            "author": "podnito",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it's \"of no economic value...\" then it should be free.\n\nLawyer/Exec Reaction: https://imgur.com/faZd4Ww\n\n=(",
                    "score": 378,
                    "author": "codexcdm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's weirdly smooth",
                            "score": 80,
                            "author": "Delicious-Tachyons",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "High frame rate",
                                    "score": 3,
                                    "author": "JimJimmyJimJimJimJim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yeah i know. its... odd",
                                            "score": 3,
                                            "author": "Delicious-Tachyons"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ll go one further than that:\n\nBecause DRM blocks the ability to create legally-appropriate archival qualities, works shouldn’t be entitled to copyright protection if a DRM-free version isn’t also available for sale.",
                    "score": 101,
                    "author": "ascagnel____",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's no way in hell that would happen. The only thing requiring day-1 DRM-free software will accomplish is making pirates' lives a million times easier and ruining the current streaming service model. Depending on how you expand it out it would also completely ruin the movie theater industry and console exclusive video games.\n\nIf you actually care about media archiving, a policy that requires copyright holders to release a DRM-free version of their property *after* they have either removed streaming/download access or when the copyright expires would be more than sufficient.",
                            "score": 30,
                            "author": "MadManMax55",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Kramer: Jerry, all these big companies, they write off everything.](https://youtu.be/Gw4ACM5SjQw?t=45)\n\nEdit: look likes more content will be removed in the coming months \n\n[Deadline](https://deadline.com/2023/06/disney-takes-billion-writedowns-streaming-content-1235399321/):\n\n&gt; A review of remaining streaming fare is continuing. **Disney said it expects more programming to be removed from direct-to-consumer and other platforms, largely during the rest of the company’s fiscal third quarter. About $400 million in further impairment charges will result**, Disney projects.\n\n\n&gt; In addition, the filing goes on to say, “**the company may terminate certain license agreements for the right to use content on its platforms, which would result in the removal of licensed content from its platforms and lead to impairment and/or contract termination charges as well as cash payments.** The company currently expects that **any such charges and payments related to licensed content would be meaningfully less than the impairment charges related to produced content.**”",
            "score": 198,
            "author": "Neo2199",
            "replies": [
                {
                    "level": 1,
                    "comment": "now I’m picturing Iger watching Zazlav and Sarandos how to cancel/write off projects left and right whilst scribbling down notes, a la Kramer when he’s trying to learn how to shower",
                    "score": 39,
                    "author": "riegspsych325",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm glad you posted that clip for me to watch before they pull Seinfeld and write it off.",
                    "score": 10,
                    "author": "ammobox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did all of these companies make their own streaming services when they keep cutting content and raising prices while still claiming it's all not profitable?\n\nDon't they have analysts and accountants?",
            "score": 129,
            "author": "papabeard88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everyone wanted a part of the Netflix pie back in the day. Now we have 35 streaming services instead of 3 or 4 and we're way worse off because of it.",
                    "score": 110,
                    "author": "Saloncinx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And each individual service seems to be trying to be the worst one out there",
                            "score": 25,
                            "author": "hovdeisfunny",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because they don't want to pay royalties to actors, artists and writers!",
                    "score": 40,
                    "author": "2Darky",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All of this could be avoided you hired better writers and made better shows, obi wan should been biggest show of decade and yet one cares because Star Wars has been run into the ground",
            "score": 12,
            "author": "nemxplus"
        },
        {
            "level": 0,
            "comment": "Pirates of the ~~Caribbean~~ Internet",
            "score": 77,
            "author": "taz20075",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahoy, matey!",
                    "score": 4,
                    "author": "HugoRBMarques",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe we shouldn’t just fill our streaming service with shit we can get into theaters.",
            "score": 7,
            "author": "taylorpilot"
        },
        {
            "level": 0,
            "comment": "Instead of banging out shitty shows and movies that are low quality, they need to focus on quality over quantity.",
            "score": 99,
            "author": "solohack3r",
            "replies": [
                {
                    "level": 1,
                    "comment": "The problem with Disney+ is that I don't feel like they're managing either. Netflix is definitely doing quantity over quality because there's always new stuff to watch, even if most of it is terrible. Disney+ actually has very little original content, and it's still mediocre. There's basically either a new Marvel or Star Wars series each month plus a couple of kid programs. Netflix drops more than that in the average week.\n\nThe biggest issue really is that it seems like everything Disney makes seems to cost WAY more than it should. There's no project so small and niche that they can't somehow manage to blow the budget of a blockbuster on it.",
                    "score": 114,
                    "author": "DrocketX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is there even a marvel or Star Wars show every month anymore? We are into the six month of the year and Mando Season 3 is the only one that’s been released so far.",
                            "score": 47,
                            "author": "Perfect-Historian-55",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She-Hulk was the last Marvel show and that finished in October last year",
                                    "score": 24,
                                    "author": "horseren0ir"
                                },
                                {
                                    "level": 3,
                                    "comment": "Star Wars visions came out this year.",
                                    "score": 7,
                                    "author": "Gamerguy230"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, you're right. I could have sworn there was a Marvel series released this year, but there wasn't. It looks like there's 3 Marvel series that should be out this year and 2 more Star Wars series, so basically 1 Marvel/Star Wars series every other month on average. Aside from Marvel/Star Wars series, some children's shows, and a handful of family movies that look roughly Hallmark channel quality, Disney+ has managed to produce...  Um... Willow, which they're going to nuke from orbit, and... well, I guess we can count Turning Red and Soul, even though they were supposed to be theater movies that got bumped due to the pandemic. And... Uh...\n\nSeriously, what in the hell is going on at Disney that they're managing to lose over $1.5 billion a year while producing so little content?",
                                    "score": 15,
                                    "author": "DrocketX",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah marvel stuff has slowed down after they started bombing one after another",
                                    "score": 3,
                                    "author": "Ok_Antelope_1953"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "HBO Max had like 20 new newly added bangers a month when I first subbed. I was actually overwhelmed thinking I wouldn't be able to watch everything I wanted while they were available, and that's despite having a smaller library than Netflix. I'm not that concerned about quantity if the selections are good.\n\nNow it's like 1 or 2 new good movies per month and shit tons reality shows that I'll never watch.  There's a few HBO originals I'm mildly curious about, but I've already watched the ones I was really interested in \n\nEven Pluto is destroying them on new movie content. That's embarrassing. They added a lot of good stuff this month. Too bad their player is broken though",
                            "score": 5,
                            "author": "cbbuntz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The issue is that the lower quantity they are aiming for does not reflect on their prices.",
                    "score": 3,
                    "author": "Thomas_JCG"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At least keep The Mick and My Name Is Earl",
            "score": 19,
            "author": "hannibal_morgan"
        },
        {
            "level": 0,
            "comment": "This reminds me of the late 90's, Disney bought the company I worked for and a year later spun us off as a entity company same as we started but with $2 billion of Disney debt attached.",
            "score": 7,
            "author": "McFeely_Smackup",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Me - Keeps collecting blurays for $1/piece that people discard at the local thrift store.  (shrugs).  I hate digital media and subscriptions.  Physical or no deal.",
            "score": 38,
            "author": "Kuli24",
            "replies": [
                {
                    "level": 1,
                    "comment": "I try and get BluRay in bulk from garage/yard sales, thrift stores and hell even eBay lots some times for the same reason, they're cheap and great quality.\n\nHowever, I also rip the BluRay to my hard drive and I have a Plex server, purely for the convenience.",
                    "score": 14,
                    "author": "Saloncinx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah very nice!  I still prefer the isolation of going offline bluray.",
                            "score": 4,
                            "author": "Kuli24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100% agree with you there! I just have the BR's in totes though, If something happenes to my Plex server for some reason I can just as easily go into the closet and find the disc. But Plex even works when your internet is out so i've literally never had it be an issue. I get not everyone has the know how, and tech knowledge or even resources (a spare laptop, external harddrive, USB bluray reader, and basic understanding of networking) but it works well once it's all set up haha.",
                                    "score": 6,
                                    "author": "Saloncinx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that's another thing.  I could do it with my tech knowledge, but I have thousands of hours of troubleshooting under my belt and I don't want a single hour more XD.",
                                            "score": 6,
                                            "author": "Kuli24"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah I won’t be able to afford these streaming services anymore with the student loan repayment starting",
            "score": 18,
            "author": "Jacksonrr31"
        },
        {
            "level": 0,
            "comment": "I still don't really grasp the function of these moves beyond ending residuals to non-C suite folks. What are the taxes that are actually affected by this?\n\nIf it's on the flat revenue of the service, why would the price of the content affect that? It'd be less profit either way, they've already spent the money producing the content.\n\nIf it's on profit, how would that affect how it's taxed, necessarily? Seems like the effect on stock prices would be more of a concern.",
            "score": 17,
            "author": "EaseofUse",
            "replies": [
                {
                    "level": 1,
                    "comment": "In accounting you recognize an expense over the life of the asset associated with it. So if you paid $1 million to license a show and expect it to be on the platform for 4 years, you would show $250k of expenses in your financials every year. To get more technical, at the start you would have an asset worth $1 million that you would depreciate by $250k each year as you recognize the expenses.\n\nIf you decide to take the content off the platform after 2 years, though, you've only recognized $500k of the expense associated with the show. You still have another $500k asset on your balance sheet that is functionally worthless, so you need to write off the asset and recognize all of the expenses now.\n\nFrom a tax perspective, you will have higher expenses this year which will reduce your taxable income, and therefore lower your tax bill.",
                    "score": 13,
                    "author": "matty_a",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They can say Disney+ is worth less than it did before they removed the content. \n\nBecause their asset lost the amount they  decided it did through their decision, they get to deduct that loss of their taxes.",
                    "score": 16,
                    "author": "historycat95"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The tax write off for removing content should be legislated out of existence.  Cutting content because it's not worth it to them to pay thr royalties is shitty but makes certain business sense. They shouldn't talsknsave on their taxes though.",
            "score": 6,
            "author": "AlanMorlock"
        },
        {
            "level": 0,
            "comment": "So…let me get this right - taxpayers are giving them money to offer less content and raise prices?",
            "score": 15,
            "author": "Educational_Cattle10"
        },
        {
            "level": 0,
            "comment": "Among some of the many demands the writers have is a restructure of the way in which streamed content is paid for, so that it can remain on services such as disney and only be paid for as people view it, rather than disney having to pay so much that it makes more financial sense for them simply not to have it at all.",
            "score": 16,
            "author": "Kahzgul"
        },
        {
            "level": 0,
            "comment": "Trash, 🏴‍☠️ is truly the only way to archive",
            "score": 75,
            "author": "paplbonphanatix",
            "replies": [
                {
                    "level": 1,
                    "comment": "So sad for bougee rar.",
                    "score": 14,
                    "author": "sussywanker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Such brutal timing 💔",
                            "score": 10,
                            "author": "paplbonphanatix"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Price goes up, content goes down.\n\nThis is exactly the kind of thing that drives people to piracy.  Will these companies ever learn?",
            "score": 19,
            "author": "hadesscion",
            "replies": [
                {
                    "level": 1,
                    "comment": "* checks notes for the last few decades, of DRM, region locking, paywalls and licensed to the customer instead of own the product sales model *\n\nNope. They haven't. They just blame piracy.",
                    "score": 9,
                    "author": "What-becomes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "⠀⠀⠀⠀⠀⠀⠀⣀⠀⠤⠴⠶⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠂⠉⡇⠀⠀⠀⢰⣿⣿⣿⣿⣧⠀⠀⢀⣄⣀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢠⣶⣶⣷⠀⠀⠀⠸⠟⠁⠀⡇⠀⠀⠀⠀⠀⢹⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠘⠟⢹⣋⣀⡀⢀⣤⣶⣿⣿⣿⣿⣿⡿⠛⣠⣼⣿⡟⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⣴⣾⣿⣿⣿⣿⢁⣾⣿⣿⣿⣿⣿⣿⡿⢁⣾⣿⣿⣿⠁⠀⠀⠀⠀\n⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⡇⢸⣿⣿⣿⠿⠇⠀⠀⠀⠀\n⠀⠀⠀⠳⣤⣙⠟⠛⢻⠿⣿⠸⣿⣿⣿⣿⣿⣿⣿⣇⠘⠉⠀⢸⠀⢀⣠⠀⠀⠀\n⠀⠀⠀⠀⠈⠻⣷⣦⣼⠀⠀⠀⢻⣿⣿⠿⢿⡿⠿⣿⡄⠀⠀⣼⣷⣿⣿⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣶⣄⡈⠉⠀⠀⢸⡇⠀⠀⠉⠂⠀⣿⣿⣿⣧⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣷⣤⣀⣸⣧⣠⣤⣴⣶⣾⣿⣿⣿⡿⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⠉⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⠉⠉⠉⠉⠀",
            "score": 33,
            "author": "Zoomlight",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So you make it.  Then you “pull” it but still own it for possible future use.  \n\nBut you can write that off as a loss??\n\nSo I’m not sure if this is a fair comparison but here goes.  \n\nA company makes widgets and sell them retail.  What doesn’t sell goes back to the factory (let’s assume it’s high end machinery and not 6 pair of flip flops).\n\nThey still have the asset so it can’t be shown as a loss right?  \n\nDisney still has the assets.  \n\nAnyone?  Beuhler?",
            "score": 4,
            "author": "Smitty8054"
        },
        {
            "level": 0,
            "comment": "Less content and higher prices. Yes, that will totally work. lol.",
            "score": 5,
            "author": "iBoMbY"
        },
        {
            "level": 0,
            "comment": "This is why I buy dvds",
            "score": 6,
            "author": "ireallydespiseyouall"
        },
        {
            "level": 0,
            "comment": "More and more people will go back to pirating tv shows (and movies). First everyone wanted their own streaming service and now they can't make them profitable so they get rid of content and some of it may be gone forever or become very difficult to watch legally.",
            "score": 6,
            "author": "xrnzaaasPL"
        },
        {
            "level": 0,
            "comment": " Gen X warned you to buy physical media, whoever joins a corporation becomes a boomer no   matter their age and embraces the Michael Douglas character in Wall Street:\n\n\"Greed is good\"\n\nIf you like something with no physical media release, immediately copy it to a DVR/hard drive because you can't rely on a corporation to treat their shows with respect.",
            "score": 75,
            "author": "annoyingrelative",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Disney ruined Star Wars for me. And I’m just burnt out on marvel at this point. The willow series was a big disappointment.",
            "score": 38,
            "author": "takotiger22"
        },
        {
            "level": 0,
            "comment": "I went all in on streaming about a decade ago but I've really thought recently getting back into physical media because all these streaming services think they can charge more for less content. I thought that these original shows were basically meant to stay on the platforms permanently but evidently not considering both Disney and HBO are pulling them off and they're basically asking for people to pirate and archive their content because they clearly can't be trusted. \n\nWe've come full circle. Cable companies got greedy, so people began streaming. Now streaming companies are getting greedy and we'll probably begin to once again see a rise in physical media and piracy. At least I don't have to worry about the Disney gestapo coming in and stealing my Blu-rays and DVDs, but who knows it's Disney and they'll find a way.",
            "score": 4,
            "author": "Jewbacca071"
        },
        {
            "level": 0,
            "comment": "...just fire Kathleen Kennedy...I swear...between Disney and the Dallas Cowboys you idiots think your top executive can do no wrong.",
            "score": 4,
            "author": "Supaspex"
        },
        {
            "level": 0,
            "comment": "Why does it cost money to remove content you own from your own streaming service?",
            "score": 16,
            "author": "semihat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I guess it's back to the high seas for me. Streaming was supposed to make more content available, but they fucked that up.",
            "score": 17,
            "author": "JFeth"
        },
        {
            "level": 0,
            "comment": "Amazing. Disney hardly makes any new shows outside of the kid stuff. Like they'll have one 'prestige' show at once and then a two month gap until the next one (or more). They spent god knows how much money on that stupid Willow show too.\n\nSo, why am I paying for Disney plus? do i intend to watch the same 20 marvel movies over and over on an endless loop or what?",
            "score": 8,
            "author": "Delicious-Tachyons"
        },
        {
            "level": 0,
            "comment": "This should be made illegal/this tax incentive removed it is deeply anti consumer.",
            "score": 3,
            "author": "Lespaul42"
        },
        {
            "level": 0,
            "comment": "Revoke the “content cut write off” whatever the hell that is.\n\nI don’t get a tax write off for completing less work",
            "score": 3,
            "author": "BirdLawyer50"
        },
        {
            "level": 0,
            "comment": "A mash up of streaming services, again? They really are just reinventing cable",
            "score": 3,
            "author": "twea15",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So if this is the way of streaming now, what is the sense of subscribing to these services",
            "score": 3,
            "author": "mlsto"
        },
        {
            "level": 0,
            "comment": "If only there was a store you could go rent physical copies of TV shows and movies whenever you want and keep them for at least a few days to a week....",
            "score": 3,
            "author": "BamaFan87"
        }
    ]
}