{
    "id": "13yy6sb",
    "score": 9,
    "title": "CNN’s new COO hire underscores bond between CEO Chris Licht and WBD boss David Zaslav",
    "author": "RightOpportunity7912",
    "date": 1685760165.0,
    "url": "https://www.reddit.com/r/television/comments/13yy6sb",
    "media_urls": [
        "https://www.cnbc.com/2023/06/01/cnn-hires-david-zaslav-confidant-as-new-coo-underscoring-bond.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "They can  split a turd sandwich.",
            "score": 9,
            "author": "sawdustsneeze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, a turd sandwich with maggots on top.",
                    "score": -2,
                    "author": "RightOpportunity7912"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Leavy’s hiring was actually Licht’s idea, not Zaslav’s, according to people familiar with the matter.\n\nSounds like \"don't fire me, make me a full-on puppet and hire this guy to make sure I'm a good one.\"\n\nOn top of everything else, Licht's failures have exposed him as weak, vain, and stupid. \n\nWhich seems to be the only type of person Zaslav is interested in employing.",
            "score": 5,
            "author": "kneeco28",
            "replies": [
                {
                    "level": 1,
                    "comment": "Completely agree.",
                    "score": -1,
                    "author": "RightOpportunity7912"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ooh, this is going to trigger Reddit!",
            "score": -32,
            "author": "VitaLonga",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope so. Because the protests against Zaslav shouldn't be confined to the Boston University graduation. This guy is doing a lot of dark shit.",
                    "score": 19,
                    "author": "RightOpportunity7912",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Dark shit.”\n\nLike cancelling your cartoon on Max?",
                            "score": -23,
                            "author": "gmoneybags101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's hilarious, I wish. No I'm talking about (1) Zaslav's push to put Trump, GOP presidential candidates &amp; all the MAGA Nazi Republicans back on broadcast TV on a regular basis.... (2) Also Zaslav insisted on standing by Ezra Miller after they groomed &amp; abused numerous kids, women, &amp; indigenous people -- so WB could move forward with a successful Flash movie launch, he was instrumental in having Ezra's victims sign NDAs, thereby silencing them from discussing their traumatic experiences. (3) He negotiated a deal to merge Discovery &amp; WB which involved taking on a massive amount of debt that needed to be paid off. So how is he paying off the debt? Shelving tons of projects &amp; firing tons of employees that did nothing wrong. In the meantime, Zaslav receives his compensation in stock options which go UP everytime he lays off more employees. So essentially, he put their jobs on the chopping block the moment he signed the deal. You can argue this is typical of big corporations -- but when you combine all these offenses together...... Ultimately I think his worst offense is pushing the MAGA agenda &amp; putting misinformation back on the air.... But his disregard of abuse victims, empowering predators &amp; glossing over their crimes, and continued resistance to pay writers while taking home a gluttonous salary.... this is the type of person that will destroy the world. THAT IS DARK, is it not?",
                                    "score": 5,
                                    "author": "RightOpportunity7912"
                                },
                                {
                                    "level": 3,
                                    "comment": "Like not paying his writers, sport",
                                    "score": 11,
                                    "author": "MadeByTango",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes precisely.",
                                            "score": 6,
                                            "author": "RightOpportunity7912"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You mean uneconomical writers who don’t produce compelling scripts that generate sufficient return on investment?\n\nThe good writers get paid.\n\nThis is a business, not a charity.",
                                            "score": -17,
                                            "author": "gmoneybags101",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's a crappy way of viewing the creatives who make all these shows possible.",
                                                    "score": 5,
                                                    "author": "RightOpportunity7912"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "LOL, it's why this got posted here in the first place.",
                    "score": -9,
                    "author": "petepro"
                }
            ]
        }
    ]
}