{
    "id": "13zq7q2",
    "score": 3225,
    "title": "Julie Plec and More WGA Members Detail Writers Strike Negotiations, Demand Streamers to Release Ratings: ‘We’re Mad’",
    "author": "Neo2199",
    "date": 1685827668.0,
    "url": "https://www.reddit.com/r/television/comments/13zq7q2",
    "media_urls": [
        "https://variety.com/2023/tv/news/writers-strike-julie-plec-beau-willimon-wga-negotiations-1235632219/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Writer’s Room**\n\n&gt; Clack, the head writer on ABC’s “Station 19,” stated that they’re pushing for more people in the writers room, as one writer shouldn’t be expected to write every episode. “If we don’t have enough people investing into our healthcare system and to our pension plan, that’s going to go away. We need to have people working to buy into that, so that we can keep that flush for our future,” she explained. “The other reason is to have people learn and see the fruits of their labor and to not just be gig workers — which is fine if that’s what you want to do. But I think most of us went into this for a career.”\n\n\n**A.I.**\n\n&gt; Iwinski touched on the rise of A.I. and the worries within the WGA. “The threat of us being replaced is not that they’re going to match our quality, is going to be that our bosses aren’t going to care,” he explained.\n\n\n&gt; “I don’t really understand it, I don’t know where it’s going but it seems really important. And if we don’t get something codified in a language that a human being needs to do our jobs, we will never get that language and we will never have any protections,” Plec said. “I think that’s what other unions are starting to understand as well. So it is truly the clarion call, the mockingjay of this strike.”\n\n\n\n**Streaming Ratings**\n\n&gt; “The streaming era in many ways has screwed you guys,” Iwinski said. “It has cut the audience out of the feedback loop of television. Because in a world where there are no ratings and a show’s success or failure is based off what the numbers team can put out through a press release, in a world where you do not have the ability to permanently buy shows you love on physical media and keep them, in an era where shows are serialized to create cliffhangers but then pulled on Season 2 so you never get the satisfaction of knowing what happens in this world, you guys are being cut out, and it is not working.”\n\n\n&gt; He continued, “We need to push for ratings in television… There are so many shows by people of color, there are so many shows by marginalized communities, that everyone I know in that community is watching and they cancel it [because] ‘No one was watching.’ Prove it. Show it to us.”",
            "score": 513,
            "author": "Neo2199",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; in an era where shows are serialized to create cliffhangers but then pulled on Season 2\n\nYea, I much preferred it when shows got cancelled after 3, 4 episodes, a single short season, or 4 seasons, on a cliffhanger.\n\nIt's true that Netflix has a tendency to cancel shows too fast (if the numbers after the 1st weekend aren't good enough) but pretending shows weren't cancelled all the time, very fast or with cliffhangers, before streaming is just BS.\n\nRatings were always a bad thing. Crappy shows got good ratings and great shows only survived become some execs lover them (Homicide: LOTS and Arrested Development are two examples of shows that would've been cancelled if it was based on ratings alone, Breaking Bad and Seinfeld also didn't do well in their first season).\n\nStreaming services have much better numbers. the WGA should demand visibility for their members on shows they worked on along with the compensation they demand for those shows living on streaming services and not TV/cable networks and physical media",
                    "score": 90,
                    "author": "EShy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;  the WGA should demand visibility for their members on shows they worked on along with the compensation they demand for those shows living on streaming services and not TV/cable networks and physical media\n\nThat's exactly what they're demanding in the section you didn't fully quote. They are demanding that the streaming services release their viewership numbers so that the cast, crew, and creators (and the audience) don't just have to take it on faith when a streaming service claims that nobody was watching it. They want the numbers.\n\nIt isn't an outrageous demand, either. It's the way things used to be before streaming dominated the market.",
                            "score": 178,
                            "author": "buttchuck",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The last strike basically JUST predated the rise of Netflix and streaming.  Which is why they've effectively been fucking over the writers endlessly with streaming.",
                                    "score": 57,
                                    "author": "grubas",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 16,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Which is why we even have ratings in the first place",
                                                    "score": 3,
                                                    "author": "grubas"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Might have more to do with investors getting spooked. If there is transparency in viewership numbers it's harder to manipulate investors things are going well, my understanding is that we might be in the end of the golden age of cheap streaming and that market saturation is heavy now.",
                                                    "score": 12,
                                                    "author": "PM_UR_PIZZA_JOINT",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It makes me wonder if there’s some back door fudging of numbers by streaming services if they’re so unwilling to provide these to writers.\n\nCould there be other plausible reasons streamers are so reluctant to show them?",
                                    "score": 2,
                                    "author": "Funny-Blueberry2573",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol there's front door fudging.\n\n1. Put new show on top banner\n\n2. Autoplay items after 1 second of idle\n\n3. Put new show as first suggestion to all other content when finished playing\n\n4. Autoplay suggestions after 1 second of idle\n\n5. Claim anyone who watched 1 second of your new show, even if it was as their home screen loaded or after they fell asleep watching something they actually liked, is a viewer.",
                                            "score": 3,
                                            "author": "Sir_Auron"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Ratings are especially helpful because you can usually gauge if your show is gonna get picked up or not based on past performance of other shows/compared to other current shows.\n\nLet’s cast, crew, and creatives know how much they need to be looking. For work on another show or not.",
                                    "score": 2,
                                    "author": "aw-un"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Its not that they werent cancelled before, its the frequency.\n\nWe have a boatload of new media coming daily, but also cancellations of a shitload of stuff daily.\n\nIts insane, it got so bad that me and many other dont even start watching a show until it has at least 2+ seasons, but this also creates the problem that many of those shows never get that far because no one is watching them.\n\nIts an infinite loop or a self fulfilling prophecy, because people understandably dont want to waste their time with a show that will be cancelled anyway, but because they dont watch it then gets cancelled...\n\nShows need to be produced with a commitment of at least 2 seasons, anything less is just too high risk to even try it out.",
                            "score": 41,
                            "author": "Vault_Survivor_08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I swear people complaining about Netflix canceling shows have NO IDEA what the tv landscape was before Netflix. The networks canceled shows MUCH MORE often, it can happen before the season even finish airing. When Netflix first started  almost every Netflix show got a 2nd season which was unheard of.",
                                    "score": 20,
                                    "author": "SnooPears2424",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I literally do not understand why people don’t understand this Netflix makes more content than any network , streamer, or cable channel ever hundreds of movies and countless  shows a year at this point probably \n\nit literally just based on common sense means more stuff would be canceled not everything will get good viewership compared to budget, not everything will be finished , and not everything will get watched or seen so of course stuff gets canceled",
                                            "score": 10,
                                            "author": "Dry-Calligrapher4242"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "During broadcast TV there was a feedback loop that writers could see reactions to the show and make changes as they went along. With 22 episodes, episodes premiere while you’re still writing and producing new episodes. Making adjustments and listening to critics, and sometimes even just seeing a product in final form will give writers a chance to adjust and change. Most iconic shows (Parks and Rec, Brooklyn Nine Nine, The Office etc) had lackluster first seasons that improved and hit their grooves starting later in the first seasons or second season. That improvement only happens if you are able to see first hand how people like your product and you can adjust. \n\nWith SVOD, you have an entire season written out and outlined before production even starts. Usually 10 episodes. Then writers aren’t being paid to be on set, and unless they’re a showrunner, they’re probably already on their next project. So any on set issues like continuity, practicality, or even lack of chemistry between leads, the writers arent there to help adjust. when the show premieres and all the episodes drop, 2 years after the show was written, the problems that could have been solved with a writer on set are magnified and the show does poorly due to low production value and then gets cancelled. No opportunity for improvement, no QA to make sure the show is representative of best quality.",
                                            "score": 14,
                                            "author": "xandarthegreat",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Its not that they werent cancelled before, its the frequency.\n\nThey were cancelled in a bigger rate before. People are joking if they believe otherwise or they have grown only during streaming.\n\n\n\n\n\n\n\n&gt;Its an infinite loop or a self fulfilling prophecy, because people understandably dont want to waste their time with a show that will be cancelled anyway, but because they dont watch it then gets cancelled...\n\n&gt;Shows need to be produced with a commitment of at least 2 seasons, anything less is just too high risk to even try it out.\n\nThen Netflix is doing something right since before the rise of streaming no show had guaranteed even a full season and people didn't stop watching.\n\nAt least by getting used to better, the audience can push for more.",
                                    "score": 7,
                                    "author": "Adept-Ju-712",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A network full season of 22 episodes, and if the show got the axe mid-way through, you only got 11 episodes, the same you get from a single season from Netflix.",
                                            "score": 11,
                                            "author": "dragonmp93",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So you're arguing against making ratings available to everyone because shows you liked had worse ratings than shows you didn't like? The streaming networks still have these types of viewing figures and they still determine what gets renewed and cancelled. There's just no transparency.",
                            "score": 7,
                            "author": "Jim_mca",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You can add the Office and It's Sunny to that list. The rule should be, bad ratings= season 2.",
                            "score": 3,
                            "author": "Under_Sensitive",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seinfeld as well.",
                                    "score": 3,
                                    "author": "Gobblewicket"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most network non-comedies(and even comedies sometimes) have cliffhangers.",
                                    "score": 5,
                                    "author": "FUMFVR"
                                },
                                {
                                    "level": 3,
                                    "comment": "Network Television had lots of cliffhangers wdym?\n\nHow many shows were cancelled half season? \n\nPeople aren't that young to have forgotten than Netflix's promise of delivering one season no matter the reception was outlandish and bold ten years ago.",
                                    "score": 20,
                                    "author": "Adept-Ju-712",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "to pretend that a cliffhanger for an episodic tv show (probably a two parter) is the same as a cliffhanger for a completely serialized tv show where the main narrative is being told for like 8 to 13 hours is disingenuous.",
                                            "score": 5,
                                            "author": "Jim_mca",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Eh, Netflix's shows are 8 - 10 episodes per season, that's the same length of a network's half-season shows.",
                                            "score": 6,
                                            "author": "dragonmp93",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They are mostly 45min-1h episodes.\nThat's not the same length of a network's half season.\n\nThey are also tell a season complete story, unlike you know... half a season in Network.",
                                                    "score": 6,
                                                    "author": "Adept-Ju-712",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Netflix has shows of 22-minutes episodes too, you know.\n\n&gt; They are also tell a season complete story\n\nSo did the CW's Arrowverse shows and Riverdale, they had two arcs per season, with the mid-season break being the finale of the first arc.",
                                                            "score": 2,
                                                            "author": "dragonmp93",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So you are really taking the exception and making it norm?\n\n\n\n&gt;So did the CW's Arrowverse shows and Riverdale, they had two arcs per season, with the mid-season break being the finale of the first arc.\n\nDid most networks follow that trend?",
                                                                    "score": 2,
                                                                    "author": "Adept-Ju-712",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well, most of the network programming are episodic sitcoms, episodic procedurals, the Dick Wolf Cinematic Universe (also episodic), and stuff like the NCIS franchise, also episodic.\n\nThe only shows where may run into a cliffhanger are dramas, which also tend to be episodic.",
                                                                            "score": 1,
                                                                            "author": "dragonmp93",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; He continued, “We need to push for ratings in television… There are so many shows by people of color, there are so many shows by marginalized communities, that everyone I know in that community is watching and they cancel it [because] ‘No one was watching.’ Prove it. Show it to us.”\n\nThat sword can cut both ways, of course.",
                    "score": 24,
                    "author": "TheRealDrSarcasmo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeh that's one demand they'll regret getting I think. Companies will do the token support but the bottom line is always the final criteria",
                            "score": 17,
                            "author": "thxpk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, at least, there are going to be actual cold hard data, instead of just \"*trust me, bro*\" statements.",
                                    "score": 22,
                                    "author": "dragonmp93",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Well, at least, there are going to be actual cold hard data, instead of just \"trust me, bro\" statements.\n\nWhat the company does with \"cold hard data\" is still subjective, and this is where you still need to trust them. Or not - but then that's their prerogative and their job.",
                                            "score": 8,
                                            "author": "frostygrin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "At least that would open the door to proving they're unfairly targeting shows from specific groups. You can question why your show with a woman lead got canned while the less well performing male lead show didn't",
                                                    "score": 3,
                                                    "author": "Kostya_M",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's not like this door is closed now - people already question this. But performance is just one part of the picture, so you won't be able to actually judge how unfair it was. Things like the budget, things like other shows, things like the viewership's demographics, things like the show's potential...  So this disclosure will only open the door to making this even more public, and demanding even more data, making it even more of a mess. \n\nLike, what would be the \"fair\" targets for a minority-lead show? The same, in the name of equality? Proportionate to the audience? Proportionate to the population? And if the male-led show performs better, is it enough to cancel the female-led show, or will it only work one way? \n\nHonestly, I think they should make *cancelling* better - most importantly, no cliffhangers. And that's on writers too. There's so much content that we don't really need dozens of shows that go on and on.",
                                                            "score": 4,
                                                            "author": "frostygrin"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What reason is there to not trust the studios when they say a project isn’t making money? You think they’re cancelling profitable stuff for shits and giggles?\n\nThis will just lead to more complaints. “You cancelled our show even though it had so and so ratings!” Still didn’t make money",
                                            "score": 8,
                                            "author": "colinmhayes2"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And people like Zaslav really don't want to get themselves cut with that sword.",
                            "score": 4,
                            "author": "dragonmp93"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;There are so many shows by people of color, there are so many shows by marginalized communities, that everyone I know in that community is watching and they cancel it [because] ‘No one was watching.’ Prove it. Show it to us.” \n\nVeering into conspiracy theories here.",
                    "score": 109,
                    "author": "SuspendedInKarmaMama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’re saying they want them to prove it instead of just saying “trust us.” It’s not a bad thing to want the proof of why you’re getting fired.",
                            "score": 202,
                            "author": "ReservoirDog316",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " it's very fair\n\nif I made something that flopped that I'd put my heart and soul into I'd want every ounce of data to see why it flopped so I can do better",
                                    "score": 35,
                                    "author": "nyanlol",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Except part of their argument is that networks are cancelling shows that *didn’t* flop, but claiming they did to justify pulling the plug. Without proof they can say whatever they want.",
                                            "score": 6,
                                            "author": "_Z_E_R_O",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Which is why they want to see the proof. That's the argument.",
                                                    "score": 10,
                                                    "author": "Pennwisedom"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The proof is that the business doesn’t want to pay for it. If the show was making money why would they want to cut it?",
                                    "score": -6,
                                    "author": "colinmhayes2",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think the argument there isn’t about successful shows being cancelled because people of color or women or LGBTQ people made it, I think they’re saying shows with similar levels of relatively low viewership from non minority creators seem to get more chances to find an audience. If it is viewership they should release that data so there’s no question what their reasoning was.",
                            "score": 239,
                            "author": "RobbyTheRobit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be fair, I don’t think that’s ever going to change as long as minority communities are the minority. Corporations are always going to fish for the bigger fish to get more money. The argument that everyone in minority communities are watching a show and it’s getting cancelled for “low” viewership makes sense when a streamer’s definition of high viewership is more than the total of an entire minority community. \n\nThe real trick is getting people outside the minority community to watch and that’s been a challenge since the dawn of cinema.",
                                    "score": 1,
                                    "author": "Ghost2Eleven"
                                },
                                {
                                    "level": 3,
                                    "comment": "If only a minority of the country can relate to it. Only those people are going to watch it. That won't change.",
                                    "score": -1,
                                    "author": "monchota"
                                },
                                {
                                    "level": 3,
                                    "comment": "But giving a show a second chance involves more than just viewership, it’s also a matter of judgment and experience. That’s where it gets messy. You can’t step in and take over the decision making process. As a writer, you simply aren’t equipped to do that",
                                    "score": 1,
                                    "author": "Sputniki"
                                },
                                {
                                    "level": 3,
                                    "comment": "Based on what though. That kind of claim needs empirical support. Lot's of shows get cancelled, particularly by Netflix, and the thought that those shows created by minorities are cancelled more frequently hasn't been explored before, to the best of my knowledge. Before running with it, it needs to be proven. What we know is a lot of shows people like get cancelled, that data is out there. Whether or not they're being cancelled because the show runner is a minority? That remains to be seen.",
                                    "score": -16,
                                    "author": "TheHighGround99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s why they want the data…. Not sure what’s so hard to grasp.",
                                            "score": 37,
                                            "author": "SlayerXZero"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -10,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Women are still playing catch up for the decades (centuries) where they didn’t have a seat at the table and weren’t considered breadwinners. \n\nMost stories, of all kinds, throughout human history, have been from the male perspective for-basically-ever. \n\nAs we’ve switched from a one-worker household to having women fully in the workforce, specifically in professional careers, we’re dealing with tendrils of bullshit going back basically forever. \n\nI really can’t help but feel like when this country fought for women to have a seat at the table and have careers, the corporations didn’t get the memo that it was supposed to be a choice to have both man and woman working, and the household income was supposed to go up. It wasn’t supposed to be *required* that it now takes a household where both adults work to survive in America. \n\nI feel like the monkey’s paw def curled a bit when we said we want women to be able to have all the career opportunities that men have and now we ended up with a world where a two income household is required to survive and be a homeowner. \n\nTo be clear I’m not complaining about anything with women working. It just feels like we got more than we bargained for and the corporate fucks took advantage by keeping salaries artificially low.",
                                                    "score": 16,
                                                    "author": "8i66ie5ma115"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He may be specifically citing Sense8.\n\nWhen that show was cancelled the show-runners said the numbers and fan interactions seemed fine to them and Netflix was cancelling because of the heavy LGBTQ themes. \n\nNetflix said the numbers didn’t justify the shows budget.\n\nThey eventually allowed a movie to finish things up just to placate the Wachowski’s, but the community as a whole picked up on the idea that the show was cancelled for being “too gay” and ran with it.",
                            "score": 65,
                            "author": "dead_wolf_walkin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah the per-episode budget of sense8 was something like $10m, similar to game of thrones, and it didn't have anywhere near the viewership. i loved it but it was pretty much for a niche audience. if they had kept the costs under control by filming everything at one place, netflix might have let them continue.",
                                    "score": 24,
                                    "author": "Ok_Antelope_1953",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From everything I’ve heard about production the whole thing was a mess and they just pissed money away. \n\nStuff like reshooting almost all of season 2 after firing an actor for personal conflicts. Paying full 2nd unit crews to travel independently and get those quick shots for the opening. Refusing to shoot anywhere but the scripted location, while shooting things in script order….so they just traveled constantly with the entire crew.\n\nPlus a lot of the actors said they were leaving after contracts were up anyway because they hated production, and were lied too several times.",
                                            "score": 17,
                                            "author": "dead_wolf_walkin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "that sounds like a proper nightmare for everyone involved. considering how trippy the show was, i'm not sure what else was left to be explored. maybe differet varieties of orgies? it did have a cult following and wrapping it up with a movie instead of dumping it unceremoniously was the right move imo.",
                                                    "score": 3,
                                                    "author": "Ok_Antelope_1953",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think one of the actors said that the initial endgame was supposed to be an cluster that had seized power.\n\nLike Whispers was allowed to operate so freely because like one cluster had used their talents to rise to power in eight very powerful countries and were backing his work.",
                                                            "score": 2,
                                                            "author": "dead_wolf_walkin"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It might also be a reference to warrior nun, which has LGBTQ leads and was supposedly one of the most watched things on Netflix when it dropped online but then got unceremoniously canceled on a major cliffhanger.",
                                    "score": 37,
                                    "author": "Haltopen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually Netflix release each week the number of hours view of  the top 10 english speaking series, warrior nun season 2 was in there several weeks but with unimpressive numbers.",
                                            "score": 11,
                                            "author": "Vadvadvadd"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I watched the first episode of that show, it sounded cool, but every character was a stereotype dialed up to 11. Completely took me out of the show.",
                                    "score": 30,
                                    "author": "Ninety8Balloons",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It may not have been the best writing, but the stereotypes seemed to be intentional - as the show progressed they chipped away at them and proved the characters to be complex and more 'human'. seemed to happen as the characters learned more and more about each other",
                                            "score": 24,
                                            "author": "speedr123",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s cool and all, but it was really grating initially, so I can see why people dropped it.\n\nI gave it like 2 episodes before I lost interest",
                                                    "score": 3,
                                                    "author": "thecodethinker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Binged season 1, it went to pretty interesting places. Also couldn’t make it past episode 2 or 3 of season 2. They were at a bar having the dumbest fucking conversation and I couldn’t get over it.",
                                                            "score": 3,
                                                            "author": "CTR_Pyongyang"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Right, this is just a conspiracy. Sense8 was cancelled because it was insanely expensive and only barely above average. It did well on social media and coastal elite bubbles because of the inclusivity but not well enough to make up for the budget.",
                                    "score": 4,
                                    "author": "colinmhayes2"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is gonna be one hell of a long strike, isn’t it?",
                            "score": 23,
                            "author": "lee1026",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At least I have baseball right now.  And for the next few months.  \n\n\n\nSAGs contract is up June 30th, they have authorized a strike.  That will basically deadlock the industry completely.",
                                    "score": 13,
                                    "author": "grubas",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Which is funny, because he already got his wish with One Day at a Time, a show Netflix tried like hell to get to work, for three seasons before giving up. So then Pop picked it up after twitter fans lost their minds, and surprise surprise the ratings were dogshit and it was cancelled after a single season. \n\nStreamers try like hell to make shows like this work because 1) it’s good for their ESG rating and 2) they legit do want that audience demo, but too often the shows actually suck and can only be bolstered for too long before the floor drops out of the money pit.",
                            "score": 26,
                            "author": "Cash907",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait what? One day at a time came back? No wonder ot was cancelled. I LOVED that show and had no idea it was picked up somewhere else 😕",
                                    "score": 13,
                                    "author": "crazytacolady",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Well, moving it to Pop wasn't going to work regardless. That network is ranked in almost 70th place and a gundred thousand people watch it. It was going to hardly get any viewers. Can't say if the show wasn't working at all, but having it on Pop wasn't going to magically garner millions of viewers. Maybe if they had taken it to a more popular channel or even broadcast we could have a more fair comparisson",
                                    "score": 15,
                                    "author": "ERSTF",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve never even heard of it lol",
                                            "score": 12,
                                            "author": "The_Running_Free"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Veering into conspiracy theories here.\n\nBy asking for them to prove it? Really?",
                            "score": 45,
                            "author": "Pushmonk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Its a business, if something is successful why wouldn't they continue?",
                                    "score": 12,
                                    "author": "bannedagainomg",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In that case, the failures of *Catwoman* and *Elektra* in quick succession were used in justification.",
                                                    "score": 2,
                                                    "author": "StephenHunterUK"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Who knows? Corporations are bad. Be transparent with the figures so there is some oversight. Without it, no one knows a thing except execs at netflix and the other streamers.",
                                            "score": -3,
                                            "author": "Jim_mca",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Who knows? Corporations are bad. \n\nEverybody knows, they are out to make money off you.\n\nKilling a supposed profitable show is the opposite of that.\n\nIf they were against shows like that they simply wouldnt make them in the first place.\n\n\"everyone i know watches it\" is meaningless, you see it here on reddit all the time how little that means, popular here do not mean its a popular show.",
                                                    "score": 12,
                                                    "author": "bannedagainomg"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I know a thing. Netflix is out to make money. Every decision they make is intended to maximize profit.",
                                                    "score": 0,
                                                    "author": "colinmhayes2"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not really. I would argue that it might even be a SEC violation to not release viewership numbers. \"The company is doing great. We produce the most watched shows\". How are investors going to know? How can you know if an investment is good or bad if the info on how many are watching is totally  obscure? Yes, you know the subscriber numbers, but are people really watching your shows? What is a good investment in a show if I don't know how many people watch? Is investing on Netflix better than WBD just on their subscriber numbers?  A show is ending, how can I know if a sea of people are going to cancel because it's ending? Does Succession's ending mean that I should look elsewhere because it's taking its subscribers with it? Could it be insider trading if the executives have info about viewership numbers they do not disclose to the general public? Maybe you get the viewership numbers for shows in the quarter and notice that people are not watching at all so you sell your stock because the company is about to tank. \n\nAlso for advertisers. Everyone is getting ad versions of their services. How can I know your show is worthy of the sum you're asking? Am I getting shortchanged?",
                            "score": 17,
                            "author": "ERSTF"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, with how costly streaming is corpos don't have much leeway to cancel successful shows. They NEED butts in seats streaming as much as possible. They arent gonna cancel successful shows no matter who makes them (criminals and such other drama excepted)",
                            "score": -3,
                            "author": "nemuri_no_kogoro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not entirely true. The Office was famously on the chopping block for its entire run even when it had high ratings... well high for NBC standards back then. It survived due to an NBC executive who fought to keep it in the air. Many other executives wanted to cancel it because they didn't get the show. They can also cancel successful shows if they deem them too expensive. SWAT got cancelled even with good ratings because Sony and CBS got in a fight over money, so CBS decided to cancel it. Other shows get cancel due to fights with the creators or the producing company. One time Lost and Desperate Housewives were in danger because the executive who approved them got sacked because of that very reason, for approving those shows. When they got crazy successful they kept them. In TV when you change division heads it often happens that projects or shows get cancelled because they don't align with the vision of the new head. Sometimes it happens that they know a show is successful, but they want to maximize profit so they cancel expensive shows even if successful to fill the time slot with a cheaper show because it helps the margin. That's what's happening at Max right now. Successful shows that are too expensive so they cancel them for their cheaply produced crap Discovery is known for.",
                                    "score": 22,
                                    "author": "ERSTF"
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s also the cost to produce the show. The words “a lot of people watching” means nothing when we don’t have actual viewing numbers. Sometimes shows become so expensive to produce they have to an insane number of people watching to make them viable. Also sometimes when an actor in a show career becomes so big it’s not financially viable/possible to pay them there salary with there average viewing numbers.",
                                    "score": 14,
                                    "author": "slam99967",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We are also no longer in the era of broadcast TV - viewers don't directly translate into money. The math is much more complicated, with signups and user retention being the name of the game.",
                                            "score": 15,
                                            "author": "lee1026"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, went off the rails there.",
                            "score": -14,
                            "author": "eightandahalf"
                        },
                        {
                            "level": 2,
                            "comment": "Well, Zaslav canned Batgirl but released the Flash.",
                            "score": -9,
                            "author": "dragonmp93",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not to defend dumbass Zaslav or rapey Miller but The Flash is a much more iconic and well-known character, so it's a safe bet that it would make money as opposed to a solo Batgirl film, especially after the solo Harley Quinn movie didn't do that well.",
                                    "score": 6,
                                    "author": "idkalan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aside from Harley Quinn, films starring batman characters tend to do extremely well at the box office, and occasionally they win oscars. It even had Michael Keaton in it as presumably the same version of batman that shows up in the flashpoint movie.",
                                            "score": 2,
                                            "author": "Haltopen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol homey wants to pretend shows getting shitcanned on cliffhangers and lack of physical media releases is a new thing. \n\nOk dude. I’m STILL waiting for a second season of Space: Above and Beyond, as well as “The John Larroquette Show” on DVD. I agree streamers lying about or completely hiding their viewership numbers is BS, but don’t join the studios in pretending the audience is stupid with this nonsense.",
                    "score": 25,
                    "author": "Cash907",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;  I’m STILL waiting for a second season of Space: Above and Beyond\n\nYou and me both. They really trashed the place in the season one finale though.",
                            "score": 6,
                            "author": "FUMFVR"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I stand with the human writers",
                    "score": 1,
                    "author": "CameoSigma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Showing how many times something has been streamed would be pretty neat.\n\nWould be fun to sort by views, just to see the stuff that’s not being watched.",
            "score": 9,
            "author": "Wrong-Acanthaceae511"
        },
        {
            "level": 0,
            "comment": "Considering it's Plec, she probably negotiated some more love triangles somewhere in some of her shows.",
            "score": 60,
            "author": "idksomuch",
            "replies": [
                {
                    "level": 1,
                    "comment": "i watched the vampire diaries as a teen and liked the initial seasons, but julie plex ran that show to the ground with her asinine writing.",
                    "score": 24,
                    "author": "Ok_Antelope_1953",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well all the actors and main character left so",
                            "score": 1,
                            "author": "Final-Raspberry4859"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She’s a terrible human being in real life.",
                    "score": 3,
                    "author": "whatevskiesyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What she do?",
                            "score": 12,
                            "author": "PhilipSeymourGotham",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "None of what the person responded above is really the issue. She’s a bully on set and very shitty to people she works with. Not a nice person to be around. Writing be damned. This is firsthand knowledge.",
                                    "score": 4,
                                    "author": "whatevskiesyo"
                                },
                                {
                                    "level": 3,
                                    "comment": "Her biggest crime was not writing 1 Black character well years ago. The actress still got paid for 8 seasons including multiple contract renewals which is a godsend these days with shorter episode seasons AND less seasons overall. \n\nBut if you follow anybody who has ever worked with her, you’ll practically see Julie Plec quite often because if there’s one thing Julie knows how to do, it’s keep an industry friend. There are even huge writers reunions with her during the strikes. The hate she gets as a person is just extreme virtue signaling that doesn’t reflect real life.",
                                    "score": 5,
                                    "author": "Juuto",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately I know her in real life, and the hate is actually a reflection of how she treats people behind closed doors. Fans can have issues with writing, and she for sure keeps important visuals and relationships up, but she’s a nightmare on set. Terrorized us.",
                                            "score": 5,
                                            "author": "whatevskiesyo"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "lmao I was thinking if anyone could *almost* make me root against the strike, it's Julie Plec",
                            "score": 3,
                            "author": "tmrtdc3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not sure if I agree on the last point. Media companies are greedy and will extract every dollar they can from their content. If they pull it, it means they don't see a way of making any money from it. Greed works both ways in that respect. \n\nI'm all for transparency in show ratings, but I don't think making the numbers public will suddenly save niche shows. It goes to the fallacy of \"everyone I know watches it so it must be popular\"",
            "score": 161,
            "author": "mileagemayvary11",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Media companies are greedy and will extract every dollar they can from their content. [...] I'm all for transparency in show ratings, but I don't think making the numbers public will suddenly save niche shows. \n\nI think the point is that the media companies *are* greedy and would like to cut costs wherever possible, which is how we have gotten into this mess in the first place. They've cut writing staff sizes down to almost nothing, cut the amount of billable hours, and cut the amount of time writers are able to shadow the crew on-set (which impacts vertical mobility.), all while making record profits. And by keeping viewership numbers confidential, it removes the writer's ability to bargain for better compensation by leveraging the relative success of their work.\n\nThis isn't being presented as a magic bullet solution that's going to save television, but it is one point among many that the WGA is trying to negotiate.",
                    "score": 29,
                    "author": "buttchuck"
                },
                {
                    "level": 1,
                    "comment": "Shows are cancelled for more reasons than bad numbers. I’ve experienced several network shakeups where the new team cancelled everything the previous team had going no matter what the numbers were.",
                    "score": 109,
                    "author": "NothingButAJeepThing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For reputation’s sake, I’d understand at least part of the calculus on a personal level. Seems best to start with a fresh slate then gamble your future on the staying power of someone else’s project on which you’d take the helm",
                            "score": 9,
                            "author": "biggobird"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, transparency on ratings removes the plausible deniability that has raised from the streaming ratings being a black box.\n\nAfter all, if a show was really cancelled only because of ratings, then the releasing the numbers would exonerate them from any ulterior motive.",
                    "score": 120,
                    "author": "dragonmp93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like if they were to release ratings and they ended up being not looking great it would hurt the streamers rep, meaning less investors, and customers which would end up meaning less pay to writers. I think it's a double edged sword or rather there being a chance it could be one",
                            "score": 2,
                            "author": "sleepysnowboarder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The truth is better than lies. Truth can be acted upon and change for  the better made. Most investors would appreciate when the can make informed decisions.",
                                    "score": 0,
                                    "author": "nivjwk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No they wouldn’t, lol. Don’t pretend like investors aren’t famous for stupid short sighted decisions.",
                                            "score": 5,
                                            "author": "TheKingOfBerries",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Even if investors make stupid decisions, they can't make the stupidest decision without proper information.",
                                                    "score": 1,
                                                    "author": "Commercial-Loquat-26"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Media companies are absolutely about ego. Even over money. If someone up top never believed in you, they’ll do absolutely everything in their power to tank you just to prove themselves right even at the cost of making money. \n\nObviously money drives a lot of stuff but things get weird when a rich person doesn’t like you.",
                    "score": 41,
                    "author": "ReservoirDog316"
                },
                {
                    "level": 1,
                    "comment": "If it's not making any money, make it public domain, same as books. \n\nAnd I get that anecdotal evidence isn't anything to go off of, but that implies having other data to go off of.",
                    "score": 1,
                    "author": "InconspicuousRadish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting name to include in the headline considering most of her show’s fan bases hate her.",
            "score": 3,
            "author": "Princess5903"
        },
        {
            "level": 0,
            "comment": "Julie plec is someone who left a bad taste in my mouth. I felt weird seeing her name.",
            "score": 20,
            "author": "deejay_harry1",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’s so mean to the people she works with. It’s ironic she pretends to stand up for the little guy when she made 100k an episode as a Showrunner.",
                    "score": 5,
                    "author": "whatevskiesyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She doesn't even care about the fans and just loves making money off of them, she even blocked some of them on twitter. Not to mention her offensive tweet regarding Black Women. She is nothing, if not performative.",
                            "score": 1,
                            "author": "KC27150"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "they don't want streamers to release ratings",
            "score": 33,
            "author": "anasui1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why not ?\n\nNetflix would finally be vindicated about how their cancellation decisions.",
                    "score": 35,
                    "author": "dragonmp93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because it allows copyright holders to end up charging more for renewing licenses.\n\nWhich is why streamers like Max, Hulu, Netflix, Peacock, etc don't want to share that data",
                            "score": 64,
                            "author": "idkalan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It also gives the production more data points when they want to shop the show to another outlet.",
                                    "score": 38,
                                    "author": "reddig33",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And gives the writers more leverage to bargain for better pay.",
                                            "score": 40,
                                            "author": "zimbacca",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unless the federal government says every private company must share their PNL publicly, this strike won't work. You can't force private companies to share this data, even with internal workers. The writers have no case here.",
                                                    "score": 3,
                                                    "author": "SuprisreDyslxeia",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But the writers can say they won't return to work unless the ratings are made public.  Which is, in part, what they're doing.  The streamers are free to refuse to release that information, but they (in theory) won't get new content if that's what they choose.",
                                                            "score": 2,
                                                            "author": "zimbacca"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Actors and staff get negotiation power. Right now they just say your show is doing good take this raise but if you knew your show was in the top 10? or what if you found out your last stand up special was more watched then someone they paid 3 million to. It is what the friends actors and big bang theory actors did. They knew their worth and knew when they were offered crazy money they were worth double that and got it.",
                            "score": 19,
                            "author": "Kingofthegnome",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Since when shows having bad ratings have stopped fans from complaining about cancellations?\n\nIt'd give the writers some leverage tho, so go all for it",
                            "score": 7,
                            "author": "Adept-Ju-712"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, this is what was always going to happen when we're giving these streaming giants the ability to arbitrarily assign the monetary worth and value of their services (and thus, inevitably, wildly overvalue it) and then letting them withhold the data that they claim they're basing it on.\n\nNetflix's decisionmaking has been set in stone for almost a decade now. As soon as it was clear that they hadn't truly changed the paradigm of content production, they started making moves based on stock value. And now it's just another chair for C-suite musical chairs, the company wouldn't be able to stop cannibalizing itself if it wanted to.\n\nThe only thing more toxic than worthless, greedy Hollywood executives is worthless, greedy, shareholder-beholden headhunters. Writers are only the beginning if collective bargaining action doesn't stop this.",
            "score": 42,
            "author": "EaseofUse",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve read this comment several times and I still have no idea what you’re saying.",
                    "score": 84,
                    "author": "VitaLonga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kendall Roy talk",
                            "score": 27,
                            "author": "TheTruckWashChannel"
                        },
                        {
                            "level": 2,
                            "comment": "His writer is on strike.",
                            "score": 2,
                            "author": "sorenant"
                        },
                        {
                            "level": 2,
                            "comment": "We're giving these corporations a clear runway to chase an IPO and then allow content/service quality to degrade into mediocrity as the executives cut costs, box out creatives, and generally chase short term gains to appease shareholders.\n\nIt's understandable how Netflix got the monopolistic leniency of 'Silicon Valley tech geniuses' from the early 2000's, just based on when their streaming became bigger than mailing DVD's. But it's fucking up a very visible industry with some of the most visible (non-hated) unions in the country. Tech companies overvaluing themselves to chase maximum profit on the IPO is a foregone conclusion and unless there's some intervention to force transparency with the data they claim to use, it'll ruin this arm of the entertainment industry.",
                            "score": 0,
                            "author": "EaseofUse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The proceeds from an IPO are not counted as profits on the balance sheet at all, they're assets from an investment. In fact if the IPO pops (goes up substantially), that means the company lost any money they could've made extra and the underwriting bank gets to keep those instead. It's much better for a company to continue to make money than to hope that an IPO will give them enough money to stay afloat.",
                                    "score": 28,
                                    "author": "zxyzyxz"
                                },
                                {
                                    "level": 3,
                                    "comment": "you could've just said you don't understand anything about how streaming works or wall street",
                                    "score": 8,
                                    "author": "NaRaGaMo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;The company (Netflix) wouldn’t be able to stop cannibalizing itself\n\nCan you expand upon that thought?",
                    "score": 3,
                    "author": "Bronco4bay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who doesn't watch too much tv. Should I care about this? Genuinely asking I never know how to feel about things",
            "score": 4,
            "author": "Staveoffsuicide"
        },
        {
            "level": 0,
            "comment": "Forcing 20 writers in the room for 20 episodes of TV just so healthcare can be paid for. Is not the best reason,  its also never going to fly. Consider the DGA just got a deal that had everything else on the list that the WGA. Had except the high writing room number. Side not: we need single payer healthcare .",
            "score": 4,
            "author": "monchota",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"AI isn't going to match our quality!\" Have you seen the garbage coming out of Hollywood these days?",
            "score": 17,
            "author": "CephusLion404",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you seen the reality shows that are much cheaper to make ?",
                    "score": 5,
                    "author": "dragonmp93"
                },
                {
                    "level": 1,
                    "comment": "Writing first productions on TV and Movies are as goos as they've ever been. You are getting a lot of shit where branding, toys or action is driving production instead of writing but that's been the case since the 80s.",
                    "score": 74,
                    "author": "masoyama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's why it has to be done right (toys and such)\n\nA toy is a tangible reminder of the film they enjoyed, be it getting played with, placed on a shelf lovingly in the original box, etc etc",
                            "score": 1,
                            "author": "LathropWolf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bro out here thinking kids still buy toys. They move onto iPads at 3.",
                                    "score": 3,
                                    "author": "PotHeadSled"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, perhaps if you’re 10 years old",
                                    "score": 7,
                                    "author": "E2819u7281K728_21v-3"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It would be more effective to replace network execs with AI and let the creatives do there job.",
                    "score": 20,
                    "author": "NothingButAJeepThing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's the funny part of all this. Execs are going full steam ahead trying to replace writers/animators/etc. with AI, not realizing that if \"AI\" can write a script it can also do their job.",
                            "score": 7,
                            "author": "helium_farts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe they realize the reality and they're getting ahead of it. They've already got the power, influence, money and legal backing.",
                                    "score": 6,
                                    "author": "ChelseaG12"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; It would be more effective to replace network execs with AI and let the creatives do there job.\n\nSo would you agree if the execs went on strike trying to make writers agree not to work for AI execs?",
                            "score": 0,
                            "author": "frostygrin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "shitty hack joke aside, if you think AI can even get close your delusional.",
                    "score": 36,
                    "author": "pdbone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If allowed, the job of a writer will become a gig worker \"punching up\" scripts originally written by AI.",
                            "score": 29,
                            "author": "drbeeper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Script doctors have been a thing in Hollywood for decades.",
                                    "score": 8,
                                    "author": "spasticity",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah but were they the sole writer?",
                                            "score": 2,
                                            "author": "Kostya_M"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, that's one of the reasons they are currently on strike. That said, this is a concern about the future of writing, not a present issue, current AI is barely able to keep track of which characters are in the room.",
                                    "score": 49,
                                    "author": "Maninhartsford",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Which is why they need to strike *now*, not when AI can make something passable",
                                            "score": 2,
                                            "author": "machado34"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Which would actually mean that the writers write the whole thing, but they get to pay them less because they're officially just punching it up. \n\nHence the strike asking for an agreement they can't do that.",
                                    "score": 18,
                                    "author": "turkeypedal"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You really have no idea what AI is",
                            "score": 0,
                            "author": "thxpk"
                        },
                        {
                            "level": 2,
                            "comment": "It will eventually, just question of time really",
                            "score": -1,
                            "author": "Ewannnn"
                        },
                        {
                            "level": 2,
                            "comment": "Thinking it won't is just wishful thinking.",
                            "score": -2,
                            "author": "MainaC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The only possible way that would be the case is if AI development stopped right here and this is as good as AI is gonna get.\n\nWhich is 100% copium talking",
                                    "score": 5,
                                    "author": "ShowBoobsPls"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Succession? Barry? House of Dragons? Yellowjackets? Severance? Ted Lasso? Beef?\n\nYeah… real trash on tv right now…",
                    "score": 21,
                    "author": "sadaboutbooks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "7 examples out of what several thousand?",
                            "score": 6,
                            "author": "thxpk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, those are several thousands are mostly stuff like Zaslav's realities and the Kardashians clones.",
                                    "score": 5,
                                    "author": "dragonmp93"
                                },
                                {
                                    "level": 3,
                                    "comment": "How many examples would you like?",
                                    "score": 14,
                                    "author": "ActualTaxEvader",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Enough to prove the argument AI wont match current quality wrong\n\nThe most common argument about TV is 99% of it is trash, you really think AI can't match that 99%?",
                                            "score": -1,
                                            "author": "thxpk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m still waiting for evidence that it can. I was told I would be waiting for ten years.",
                                                    "score": 2,
                                                    "author": "ActualTaxEvader",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't think anyone has made the argument it can right now, but tomorrow? I think you would have to be naive in the extreme to think it is not going to happen and happen far sooner than probably most people expect",
                                                            "score": 5,
                                                            "author": "thxpk",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Great, hit me up when an AI script wins an Emmy.",
                                                                    "score": 4,
                                                                    "author": "ActualTaxEvader",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "How do you know it hasn't? you seem very naïve",
                                                                            "score": -1,
                                                                            "author": "thxpk",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’m naive for wanting hard evidence?",
                                                                                    "score": 13,
                                                                                    "author": "ActualTaxEvader",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You know we're in a dry spell when House of Dragons, Yellowjackets, and Ted Lasso are considered prestige TV.",
                            "score": 1,
                            "author": "Onesharpman"
                        },
                        {
                            "level": 2,
                            "comment": "House of the Dragon is an example of a good tv show?",
                            "score": -6,
                            "author": "D3monFight3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Care to elaborate why it isn't?",
                                    "score": 13,
                                    "author": "InconspicuousRadish",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The worst fucking take in every comment section about this strike",
                    "score": 7,
                    "author": "AnxiousMulder"
                },
                {
                    "level": 1,
                    "comment": "A reflection of the audience. \n\nBeen watching a lot of Scorsese movies of late. Guy wasn’t wrong about Marvel movies. \n\nAs I see it the problem is that the big tedious spectacle movies kill off the middle ground stuff that aren’t action romps.",
                    "score": 2,
                    "author": "BoredDanishGuy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Trying to ban AI in the writers room is such a ridiculous stance for them to take. It's inevitable. Learn to work with it to make the best content possible so you don't get replaced by it.",
                    "score": -1,
                    "author": "morfraen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why is it inevitable?",
                            "score": 6,
                            "author": "SatAMBlockParty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because the technology is only going to improve, not go away.",
                                    "score": 7,
                                    "author": "morfraen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Of all the trajectories on which the technology can improve, why is it a given that the path it will take will be writing stories so well that it will be essential to writers? What would that even look like?\n\n70 years ago people thought it was inevitable that every car would be flying right now. Instead the path of technological improvement led to cars that can have heated seats and AM radio activated or disabled wireless by the manufacturer.",
                                            "score": 1,
                                            "author": "SatAMBlockParty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The kind of writing that most of these writers do is very formulaic. Exactly the kind of work that this type of AI can easily assist with.\n\nIt's not going to write an original screenplay but it definitely will be able to make a first pass at something like an episode of a law and order type show.",
                                                    "score": 6,
                                                    "author": "morfraen",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Its not about banning it. Its about it not replacing them and only being used as a supplemental tool.",
                            "score": 1,
                            "author": "freeloz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's not what they're demanding.",
                                    "score": 1,
                                    "author": "morfraen"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Look up the starting wage for this union.\n\n\nThey are not hurting for money.  Could you live on $5k a week?  That doesn't include script bonuses if they sell one.",
                    "score": 1,
                    "author": "chocki305",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not a steady 9-5 job that has them making that money every week of the year. It's precarious and sporadic work, especially lately. Corporations have been shrinking the size of writers' rooms, shortening season orders and increasingly hiring writers as freelance instead of as staffers. They're currently trying to transform it into gig work Uber-style where writers are hired on a day by day basis instead of for weeks/months at a time.",
                            "score": 3,
                            "author": "SatAMBlockParty"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, somehow I’d manage.  Even if I lived in Southern California.",
                            "score": 2,
                            "author": "charlieshammer",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "3 day old account has the worst take in here. Surprise, surprise...",
                    "score": 0,
                    "author": "aeo1us"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think they understand what they're asking for when they say they want ratings released- once you show how few people are really watching any given thing on streaming, once you let that genie out the bottle, the already deflating bubble pops and takes everything with it",
            "score": 2,
            "author": "SeanOuttaCompton"
        },
        {
            "level": 0,
            "comment": "If they make the ratings public then Rings of Power will have to be cancelled instantly. Sending a message is more important than profits.",
            "score": 1,
            "author": "the69boywholived69",
            "replies": [
                {
                    "level": 1,
                    "comment": ".... huh?",
                    "score": 9,
                    "author": "Phokiss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this in reaction to all the first season cancellations of some shows ?",
            "score": 0,
            "author": "Coast_watcher"
        },
        {
            "level": 0,
            "comment": "It's interesting to see a cohort of TV writers who themselves have podcasts that don't pay guests and also don't share their audience numbers demand that of their employers.\n\nTo be clear, I think this should be public knowledge in every case.",
            "score": -17,
            "author": "dkinmn"
        },
        {
            "level": 0,
            "comment": "As hell and they’re not going take it anymore!",
            "score": 1,
            "author": "UnknownInside"
        },
        {
            "level": 0,
            "comment": "Ok honest  question.\n\nWho are they fighting against?  Who is the one on the other side of the table?   Is think its studios.  But it's every studio arguing is own way?  Is there like a overall board? If Warner Brothers doesn't like it can they walk away?",
            "score": 1,
            "author": "justjoshingu",
            "replies": []
        },
        {
            "level": 0,
            "comment": "After the way Julie killed off Klaus and Elijah and Haley at the end of the Originals I wouldn't be sad if she never wrote another show ever again.",
            "score": -17,
            "author": "ExFavillaResurgemos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spoilers maybe? Damn",
                    "score": 1,
                    "author": "carvedmuss8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look at the number of writers and producers this show has.  One writer writing all scripts is just a blatant lie.",
            "score": -10,
            "author": "overitallofit",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's actually happening is that, instead of in the past when a writers room would work together on a season, execs are pushing \"mini rooms,\" where after a few weeks of writing outlines, all but one of the screenwriters is let go, and they're left to write the season from the outlines. It's an artless attempt to hire less people for less time. I hope this explains the \"blatant lie\"",
                    "score": 9,
                    "author": "Maninhartsford",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's not true.  Showrunners make decisions.  This is one new showrunner who has no idea what they're doing getting steamrolled.  Look at any show with an experienced showrunner and there's a shitton of writers.  I've turned down shows that don't have adequate staffing.  These guys accept it and then complain about it.  It's bullshit.",
                            "score": 5,
                            "author": "overitallofit"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Characterizing yourself as the good guy fighting evil instead of one side of a disagreement that has valid points on both sides never works out well. They can stay on strike for a couple years if they want to, but we'll spend that time watching Kdramas and when the strike is finally over all the new writers will be Korean.",
            "score": -48,
            "author": "WalkerSunset",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are the \"valid points\" on that other side?",
                    "score": 37,
                    "author": "joelsola_gv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A SoHo condo, 2 yachts, and a summer cottage that they'll use for a maximum 2 weeks of the year",
                            "score": 23,
                            "author": "Untalented-Host",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man... That's some valid points. They would have to survive with 2 private yats instead of 3. That's the real injustice here.",
                                    "score": 13,
                                    "author": "joelsola_gv"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Characterizing yourself as the good guy fighting evil instead of one side of a disagreement\n\nWe spent the 80s/90s/00s being that kind of respectful and now we have literal Nazis walking around.\n\n\nYeeeah... so at this point, don't want to be called a shit? Don't be a shit. Basic simple math.\n\nBillion dollar studios can afford negotiating fairly, they just won't. Therefore being a shit",
                    "score": 8,
                    "author": "Untalented-Host",
                    "replies": []
                }
            ]
        }
    ]
}