{
    "id": "1402lwu",
    "score": 0,
    "title": "Just started watching Succession...just started Season 2. Should I invest the what free time I have in it.",
    "author": "Gingie_Beard",
    "date": 1685857220.0,
    "url": "https://www.reddit.com/r/television/comments/1402lwu",
    "media_urls": [],
    "other_urls": [],
    "postText": "So far loving it. Those that have watched it, is it worth the time to watch it and does it get better?",
    "comments": [
        {
            "level": 0,
            "comment": "Definitely stop.  You’re loving it so far don’t wanna mess that up!",
            "score": 37,
            "author": "blunun",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s bullshit. The show is bullshit. It’s fucking nothing.",
                    "score": 7,
                    "author": "brainkandy87"
                },
                {
                    "level": 1,
                    "comment": "Lmao so true. Who the fuck asks the internet if they should keep watching a show they are actively enjoying. What happened to making a decision for yourself.",
                    "score": 6,
                    "author": "qpwoeor1235"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes absolutely, and after that pick up the Chinese food I ordered downtown and make sure my order is correct. It should be large Kung Pao Beef and Orange Chicken, also make sure they put right amount of fortune cookies in the bag, last time they skimmed me. Tomorrow, I want you to pick up my suit from the dry cleaners and on your way go to Dunkin Donuts and pick up my usual, you know just how I like it. After that I want you to go watch some more season 2 episodes and text me when you’re feeling lost again, and I’ll tell you exactly what to do next.",
            "score": 19,
            "author": "j_j_a_n_g_g_u"
        },
        {
            "level": 0,
            "comment": "lol what kind of question is that?! You’re watching a show, you’re loving it and you’re asking if you should invest your time in it?!\n\nGoddamn lol yeah, also, we approve of you wasting your time to go to the bathroom take a shit and shower as well",
            "score": 5,
            "author": "zedarecaida"
        },
        {
            "level": 0,
            "comment": "Thinking about watching that one. Probably should watch The Wire first, though...",
            "score": 2,
            "author": "ChipChester",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no doubt",
                    "score": 2,
                    "author": "Lupercus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If you’ve made it then hours into something and you can’t decide for yourself if you should continue, maybe you should see a therapist. I don’t know what exactly is going on in your brain, but you should be able to make this decision for yourself with this kinda data to work with.",
            "score": 2,
            "author": "meowskywalker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I bet you're a blast at parties",
                    "score": -9,
                    "author": "Gingie_Beard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just started watching the first two episodes of the first season  and don't see the appeal. None of the characters are likeable, but willl give it a few more",
            "score": 0,
            "author": "Radun",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you’re looking for likeable characters in the standard sense then this show isn’t for you. The show is about a billionaire family, obviously the characters are going to be unempathetic narcissists. \n\nBut within these people who are all evil you’ll find some that you kinda maybe sorta like a bit more than the others.",
                    "score": 5,
                    "author": "Pilpus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in season 3 and really enjoying it. Season 1 is my favorite so far though",
            "score": 1,
            "author": "HappyGilOHMYGOD"
        },
        {
            "level": 0,
            "comment": "S2 is peak Succ so if it's not working for you then no",
            "score": 1,
            "author": "sudevsen"
        },
        {
            "level": 0,
            "comment": "Yes it absolutely does get better.. both seasons 3 and 4 for me were better than season 2",
            "score": 1,
            "author": "sulu1385"
        }
    ]
}