{
    "id": "1407etb",
    "score": 936,
    "title": "‘Life On Mars’ Creators Announce “With A Heavy Heart” Sequel ‘Lazarus’ Won’t Be Happening",
    "author": "Barry_Brickman",
    "date": 1685870541.0,
    "url": "https://www.reddit.com/r/television/comments/1407etb",
    "media_urls": [
        "https://deadline.com/2023/06/life-on-mars-revival-lazarus-not-happenining-creators-announce-1235399796/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I’m really disappointed to read this.",
            "score": 100,
            "author": "M1ke2345"
        },
        {
            "level": 0,
            "comment": "I've read this like 5 times and every time it reads like Lazarus is a sequel to \"With a Heavy Heart\"",
            "score": 293,
            "author": "BigCannedTuna",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just wish headlines would stop avoiding \"the,\" \"a,\" \"is\" and \"that.\" \n\nWe're not limited to the space on a newspaper. Quit doing it because it just causes confusion.\n\n&gt;‘Life On Mars’ Creators Announce “With A Heavy Heart” [that] Sequel ‘Lazarus’ Won’t Be Happening.\n\nLiterally adding one word fixes the confusion.",
                    "score": 41,
                    "author": "RGB3x3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why waste time say lot word when few word do trick.",
                            "score": 35,
                            "author": "BlinkyMJF",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That point!  Few word not always do trick.",
                                    "score": 10,
                                    "author": "DarkLight72"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The problem is all of these newspapers now have these AI‘s that tell them whether or not the SEO is going to be readable and picked up by the search engines and then gives stupid suggestions on how to fix it. So if your editor sees that you’ve got a D on the SEO analytics they will “fix“ it with these stupid stupid grammatically incorrect changes",
                            "score": 7,
                            "author": "Development-Feisty"
                        },
                        {
                            "level": 2,
                            "comment": "There’s no confusion if you understand the difference between quotation marks",
                            "score": 0,
                            "author": "ILikeMyGrassBlue",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Capitalizing \"With a Heavy Heart\" like a title was an odd choice that probably leads to some confusion.",
                                    "score": 1,
                                    "author": "DUNG_INSPECTOR"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yup",
                    "score": 25,
                    "author": "swistak84"
                },
                {
                    "level": 1,
                    "comment": "Deadline are known for their terrible headlines.",
                    "score": 15,
                    "author": "Neo2199",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And their terrible, typo-filled articles as well.",
                            "score": 5,
                            "author": "TheWretchedSpirit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Single apostrophes are preferred for titles where italics aren’t available. \n\nDoubles for a quote within a quote \n\nIt’s correct :)",
                    "score": 2,
                    "author": "Losingstruggle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not the point :)",
                            "score": -1,
                            "author": "BigCannedTuna"
                        },
                        {
                            "level": 2,
                            "comment": "I don't know about you, but I think it would be neat if you didn't have to remember an obscure grammatical rule you learned in 2nd grade in order for a headline to be readable.",
                            "score": 0,
                            "author": "JoJoJet-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s not a rule lmao; just how British English is usually punctuated. \n\nIt is a clumsy title, but the pedantry is insipid. It’s fine.\n\nIt really doesn’t matter though, just speculating why OP titled as such 👍🏼",
                                    "score": 0,
                                    "author": "Losingstruggle"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here. Was wondering if \"With A Heavy Heart\" was a David Bowie song, and in turn a follow-up to Ashes to Ashes.",
                    "score": 1,
                    "author": "Brainwheeze"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Makes me curious about the story, especially given how *Ashes to Ashes* ended.",
            "score": 99,
            "author": "mattXIX",
            "replies": [
                {
                    "level": 1,
                    "comment": "Flip it around and have Gene get in an accident but wake up in modern day instead, and just sort of gaslight him about whether the truth of the 70's/80's setting was actually the truth all along.",
                    "score": 50,
                    "author": "ComprehensiveBowl476",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But he knew the reality of it in Ashes to Ashes.",
                            "score": 20,
                            "author": "TatteredCarcosa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's the point, have him wake up going \"Actually I'm a guardian angel from the past for police officers who got killed to guide them to the afterlife\" and the rest of the cast obviously think he's just mental or mixing up memories from a coma. Throw in a bit of him clashing with modern culture/behaviour, do 6 episodes, and there you go.\n\nIt probably wouldn't be that good, but it's the only way I can think of continuing the franchise without just going \"now it's the 90's instead!\" with another modern day officer, especially since we know the truth behind it.",
                                    "score": 24,
                                    "author": "ComprehensiveBowl476",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think flipping it would be good but not that way. Have it be the 90s and something like the protagonists of Life on Mars and Ashes to Ashes returning to help Gene finally cross over, or have it be a new cop from modern day but it turns out in the end they are actually there to help Gene finally come to terms with his trauma and accept death.",
                                            "score": 5,
                                            "author": "TatteredCarcosa"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I loved Life on Mars and I had no idea this existed. A bit excited to find it and watch.",
                    "score": 29,
                    "author": "xoomax",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ashes to Ashes is great, really wraps things up as well as one of these big mystery box shows possibly could.",
                            "score": 39,
                            "author": "Deserterdragon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ashes to Ashes is a downgrade in quality, IMHO.\n\nIn the first episode they treat a shootout as comedy, when it was so tense in LoM when guns showed up. Plus Sam Tyler was just more interesting.",
                                    "score": 8,
                                    "author": "Paxona"
                                },
                                {
                                    "level": 3,
                                    "comment": "Are you joking? The ending was the worst thing I’ve ever watched and is basically ‘it was just a dream’ level of ending (no spoilers btw).\n\nI know why they had to use some random other person to play ‘Sam’ but it was just, so bad.",
                                    "score": -7,
                                    "author": "BlackSpinedPlinketto",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It really wasn’t that bad. It wasnt a fantastic ending like some shows, but it was an average (maybe even good) quality ending to a top quality show. Better than having an awful ending like game of thrones. The only problem with Ashes to Ashes ending was it didn’t live up to expectations, but the whole show is still worth a watch.",
                                            "score": 5,
                                            "author": "Bumfuddlediddled"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s sadly not available in a modern transfer. I had to find the DVDs and rip them for posterity but they look like shit yet kinda works since it’s a period piece!",
                            "score": 8,
                            "author": "Sigvard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I haven't tried to view it yet, but Amazon prime is saying I can watch it If I add a Brit box subscription.",
                                    "score": 4,
                                    "author": "xoomax",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haven’t had netflix in a while but it used to be on there. I’d imagine its on bbc iplayer for free for any british viewers.",
                                            "score": 2,
                                            "author": "Bumfuddlediddled"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s good but only if you allow it to be good, if that makes sense. It’s a bit jarring to modern sensibilities but for a reason.",
                            "score": 18,
                            "author": "Red4pex"
                        },
                        {
                            "level": 2,
                            "comment": "I’m watching it right now lol.\nI hadn’t heard of it till a few weeks ago and downloaded both the US and the UK version, thought they would be very different like “Ghosts” but they aren’t, just about word for word in places.\nI prefer the original UK one.",
                            "score": 1,
                            "author": "entotheenth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the US Life on Mars has a *really* stupid twist that isn't in the UK version.",
                                    "score": 16,
                                    "author": "Deserterdragon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh, I only made it to the 3rd episode I think, seen 5 of the uk one.",
                                            "score": 2,
                                            "author": "entotheenth"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "that final episode excepted - and i read the show's creators wrote it as a reaction to being cancelled - the u.s. version of **life on mars** is very entertaining.",
                                            "score": 1,
                                            "author": "tvlover44"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For the full experience, download a couple of episodes of 'The Sweeney'",
                                    "score": 1,
                                    "author": "allcretansareliars",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m over 60. “The Sweeney” was required viewing with the whole family.",
                                            "score": 1,
                                            "author": "entotheenth"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I wonder if there are any better remakes of British to USA shows? Most I have seen are not better although arguably the USA The Office has had wider success than the British version.",
                                    "score": 1,
                                    "author": "Monkeyspazum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I haven’t watched more than a couple episodes of either Office. Not my thing. I do prefer Ricky to Steve though. Watching US “Ghosts” right now and I think the 2 are similar in comedic levels, neither is particularly good really :)\n\nI’m Aussie but was born in the UK and I was brought up on pommy comedy, Monty python, The Goons etc are hard to compete with.\n\nFound a list https://en.m.wikipedia.org/wiki/List_of_American_television_series_based_on_British_television_series\n\nNot sure if there is a page of uk series based on us ones.\n\nCan’t say I have seen that many of both versions, threes company and robins nest I preferred threes company. I have both Utopias but not watched either through yet.",
                                            "score": 1,
                                            "author": "entotheenth"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Honestly, Ashes to Ashes is awful. I wouldn't even bother. You'll see how cheesy and flanserised the plots and characters are just by the first episode.",
                            "score": -3,
                            "author": "nevereatpears"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How did it end?",
                    "score": 4,
                    "author": "horseren0ir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;!basically all the lore details/mystery stuff gets explained, the setting of the show is revealed to be limbo, with the characters being former police officers who've either died or fallen into a coma, and ultimately making the choice to go to heaven when they're ready!&lt;",
                            "score": 31,
                            "author": "Deserterdragon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "sounds like it renders all drama or danger absolutely pointless",
                                    "score": 1,
                                    "author": "Delicious-Tachyons"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lazarus is dead?\n\nthere are so many opportunities for better headlines here.",
            "score": 144,
            "author": "smesch83",
            "replies": [
                {
                    "level": 1,
                    "comment": "Especially since I read that and assumed *Lazarus* was a sequel to *With A Heavy Heart*",
                    "score": 43,
                    "author": "G_Liddell"
                },
                {
                    "level": 1,
                    "comment": "Is it just me or have headlines gotten significantly more unbearable since the popularity of ChatGPT? It’s almost every single one now.",
                    "score": 3,
                    "author": "OpeningBear1826",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is not just you",
                            "score": 2,
                            "author": "NotYourGa1Friday"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's a shame \n\nThere's a show on now where the guy who plays Gene Hunt is the cop on a case that's dated back to the 70s and has flashbacks. To me the young version of him looks more like Ray Carling!",
            "score": 29,
            "author": "Dennyisthepisslord",
            "replies": [
                {
                    "level": 1,
                    "comment": "Steeltown Murders btw, for anyone who wants to check it out.",
                    "score": 12,
                    "author": "djtodd242"
                },
                {
                    "level": 1,
                    "comment": "Cheers, I'll check it out. Love Cold Case shows.",
                    "score": 5,
                    "author": "SuspendedInKarmaMama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve seen cheers a few times, unless I’m *really* missing something I don’t believe it’s a true crime show",
                            "score": 1,
                            "author": "SIumptGod",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cheers is a way of saying thanks, lol.",
                                    "score": 7,
                                    "author": "SuspendedInKarmaMama"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Life on Mars was such a banger of a show! Guess I'll just have to wait longer...\n\n*Tiiime...is on my siiide....*",
            "score": 43,
            "author": "glasseyepatch"
        },
        {
            "level": 0,
            "comment": "Damn... Not even a hope of Netflix swinging in these days to pick up projects like this either.",
            "score": 12,
            "author": "lazzzym",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be fair, you wouldn’t want Netflix to. They’d squander it with shit writing.",
                    "score": 5,
                    "author": "CoziestGhost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also very true.",
                            "score": 1,
                            "author": "lazzzym"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have never heard of this show, but there are a lot of Bowie song titles in this thread…Life on Mars, Lazarus, Ashes to Ashes…is there a significance to that or is this just a coincidence?",
            "score": 52,
            "author": "maybe_a_frog",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s significant to the story",
                    "score": 90,
                    "author": "WhiteGirlSays"
                },
                {
                    "level": 1,
                    "comment": "They were the names of the series and used the Bowie songs as the themes.  They were also set in the time period of their respective songs.",
                    "score": 61,
                    "author": "ImperialSeal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a god-awful small affair.",
                            "score": 17,
                            "author": "NeedsToShutUp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you by any chance a girl with mousy hair?",
                                    "score": 9,
                                    "author": "roentgen85"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Interesting. Good to know! Maybe I’ll check it out! Im a sucker for Bowie.",
                            "score": 17,
                            "author": "maybe_a_frog"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just make sure you avoid the shitty American remake",
                    "score": 17,
                    "author": "SlayerXZero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The American version introduced me to the original, so it was worth it for that.",
                            "score": 6,
                            "author": "mosfunky"
                        },
                        {
                            "level": 2,
                            "comment": "I’ve never seen a shittier American remake of a good UK show in my entire life. Like…wtf were they thinking?",
                            "score": 0,
                            "author": "I_aim_to_sneeze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I presume they test screened it and a bunch of idiots where like “mars is in the title. There should be more space things.”",
                                    "score": 1,
                                    "author": "NoWayJoseMou"
                                },
                                {
                                    "level": 3,
                                    "comment": "You've obviously not seen their version of The Inbetweeners.",
                                    "score": 0,
                                    "author": "D0wnInAlbion"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "TBH, I thought the end of Ashes brought the whole story to a solid, dignified ending.",
            "score": 12,
            "author": "draxenato"
        },
        {
            "level": 0,
            "comment": "Gutted. Loved the show. Gene Genie is one of my favourite characters ever.",
            "score": 8,
            "author": "RobTheMonk"
        },
        {
            "level": 0,
            "comment": "Glad to see they were sticking with the Bowie song titles, at least",
            "score": 8,
            "author": "dubblix"
        },
        {
            "level": 0,
            "comment": "All rather vague on *why* it's been killed, going to assume they couldn't get anyone to comission it?",
            "score": 16,
            "author": "mrhelmand",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ashes to Ashes ended in 2009.\n\nI’d guess it was simply down to the fact that while a small niche of fans would have liked to see it, there’s probably not much hunger to a show that ended 14 years ago and would have needed you to have watched the original to follow the plot (which had been rather complicated by the end, and also pretty much wrapped up). BBC and the likes would probably just rather put resources into a show that could attract a new audience and possibly have wider potential to grow.",
                    "score": 39,
                    "author": "DaveShadow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still seems a bit odd. Keeley Hawes has become really succesful since AtA so that would get some eyeballs and it feels like John Simm is the lead in a new show every year that no one really watches.",
                            "score": 22,
                            "author": "SuspendedInKarmaMama",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Keeley Hawes was already a name before that via *Spooks* and *Tipping the Velvet*. Her *Line of Duty* turn was very well received. She's also voiced Lara Croft in more games than anyone else. \n\nHer husband is Matthew Macfayden, recently of *Succession*. \n\nSimm turned up in a major role in *Doctor Who* straight after *Life on Mars* and has never really looked back.",
                                    "score": 13,
                                    "author": "StephenHunterUK",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Simms was a big name in the UK already too, he was excellent in Human Traffic (film about the UK club life)",
                                            "score": 1,
                                            "author": "Monkeyspazum"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Grace is pretty good. But fair play, I think I’m the only person who watches it.",
                                    "score": 6,
                                    "author": "vondafkossum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is that the one set in Brighton? It's incredibly funny as someone as lived there my entire life, just the most boring depiction of the city imaginable.",
                                            "score": 5,
                                            "author": "Deserterdragon"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah, Grace is the one of his that I like. But even then, the mysteries are nothing compared to other contemporary shows. McDonald and Dodds, while not great, has more interesting writing to me.",
                                            "score": 3,
                                            "author": "SuspendedInKarmaMama"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah that makes sense",
                            "score": 1,
                            "author": "mrhelmand"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not even that fucking hard to make this headline work with some basic restructuring.\n\nWith a heavy heart, 'Life on Mars' creators announce that sequel 'Lazarus' won't be happening. \n\nJesus Christ, people get paid for this shit and here I am, barely making it in retail.",
            "score": 7,
            "author": "ICSL"
        },
        {
            "level": 0,
            "comment": "Bummer. Really pleasant and fun shows. Although the title Lazarus is rather forbidding.",
            "score": 4,
            "author": "mekonsrevenge"
        },
        {
            "level": 0,
            "comment": "Noooooooooooooo\n\nEdit: damn financial. So it’s written and maybe there is a chance for it one day",
            "score": 8,
            "author": "sixtus_clegane119"
        },
        {
            "level": 0,
            "comment": "This is such a bummer.",
            "score": 3,
            "author": "CharlesNapalm"
        },
        {
            "level": 0,
            "comment": "Going by the precedent set by life on Mars and ashes to ashes being set in the decade the song came out Lazarus would have to be about a police officer that wakes up in the 2010s",
            "score": 3,
            "author": "rorzri"
        },
        {
            "level": 0,
            "comment": "Proper gutted about this. I don’t believe it was ever announced who had commissioned it either. Didn’t seem like it was bbc like the original. Life on Mars (and ashes) are two of the most unique and creative shows I’ve ever seen. I was so looking forward to a new chapter",
            "score": 3,
            "author": "a-hthy"
        },
        {
            "level": 0,
            "comment": "Not really sure where they would’ve gone with the show. Ashes to Ashes tied things up (relatively) nicely.\n\nWas it going to be set between the two other series?\n\nAll in all, at least we still got a complete story.",
            "score": 6,
            "author": "NiceColdPint",
            "replies": [
                {
                    "level": 1,
                    "comment": "The story I read a few months back was they wanted to bring back Sam and Alex, and have it set over a few timelines in the 70s, 80s and modern time.",
                    "score": 7,
                    "author": "DaveShadow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought Ashes to Ashes was already the sequel to Life on Mars…",
            "score": 6,
            "author": "Sitadulip"
        },
        {
            "level": 0,
            "comment": "Damn, I had no idea this was even a thing. That's sad. I watched Life on Mars years ago and really loved it. Such a strange show and yet it was so well written and acted, it was really good.",
            "score": 2,
            "author": "AtraposJM"
        },
        {
            "level": 0,
            "comment": "So sad. Loved Life on Mars.",
            "score": 2,
            "author": "greenmustang65"
        },
        {
            "level": 0,
            "comment": "lmao I read this title AND whole thread thinking that this was about *Fired* on Mars and was really upset because I loved that show and really want season 2 to happen. sorry for the loss of whatever this was that y’all were wanting",
            "score": 2,
            "author": "KuciMane"
        },
        {
            "level": 0,
            "comment": "I really liked the American version of the show. But it was quickly cancelled and given a weird ending as a result.",
            "score": 4,
            "author": "BarKnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I saw LoM US first. \n\nI enjoyed it... until the ending retroactively ruined the whole show for me.\n\nThen I saw the original UK version, and that was that for US.\n\nBut for the first 16 episodes, I did enjoy it.",
                            "score": 2,
                            "author": "ElectricPeterTork"
                        },
                        {
                            "level": 2,
                            "comment": "It had a great cast. I think if they had removed the sci-fi part of it (which was pretty insignificant anyways) it would have done better.",
                            "score": 2,
                            "author": "BarKnight"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I saw it after the OG and liked it for what it was, especially as a fan of Jason O’Mara, way back from Monarch of the Glen.",
                    "score": 1,
                    "author": "CarlySimonSays"
                }
            ]
        },
        {
            "level": 0,
            "comment": "wasn't Ashes to Ashes a sequel already? Way better show too, in my opinion, the first finale with the revelation about the Clown was one of the best I've seen",
            "score": 4,
            "author": "anasui1"
        },
        {
            "level": 0,
            "comment": "On the downside, no Life on Mars sequel.  \nOn the upside, no Ashes to Ashes sequel.",
            "score": 3,
            "author": "Jozer99"
        },
        {
            "level": 0,
            "comment": "Ashes was so disapointing coming from Life on Mars, which was fantastic for the most part.\n\nThe purgatory explanation become obvious, and didn't need to go into crazy teritory that the end of Ashes did. LoM had a perfect ending.",
            "score": 1,
            "author": "DOOMed_Space_Marine",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cannot disagree more. Life on Mars didn't address the actual mystery at all. Ashes to Ashes did and did it incredibly well. The villain was great and the back story of Gene Hunt was very well done.",
                    "score": 12,
                    "author": "TatteredCarcosa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Krillin is also fond of a resurrection how about him?",
                    "score": 1,
                    "author": "Ronburgundy2099"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always thought a series about the younger Gene Hunt would be great and set in the 60's before he ... eh-hem \"assumes his current role\". \n( trying hard not to spoil for anyone who hasn't seen Ashes yet",
            "score": 1,
            "author": "drewbrewski",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it was the 50s, and I believe there was only a very short career before he fulfilled his current role?",
                    "score": 2,
                    "author": "dixons-57",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You may be correct, it's been that long since I watched it,",
                            "score": 1,
                            "author": "drewbrewski"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loved Life on Mars, I liked Ashes to Ashes, but really there was no need for this story to continue.",
            "score": 1,
            "author": "Dangerous_Dac"
        },
        {
            "level": 0,
            "comment": "I was really confused because there’s a new show called project? Lazarus coming out soon and I thought this was then canceling before it even premiered despite all the ads I’m seeing. \n\nI wonder if the similar name is part of the issue at all",
            "score": 1,
            "author": "mazzicc"
        },
        {
            "level": 0,
            "comment": "So this isn’t a David Bowie rockumentary?",
            "score": 1,
            "author": "insufficient_nvram"
        },
        {
            "level": 0,
            "comment": "Oh I was so disappointed because I thought this was about fired on mars",
            "score": 1,
            "author": "Keokuk37"
        },
        {
            "level": 0,
            "comment": "After reading the comments I have discovered that this is not about David Bowie",
            "score": 1,
            "author": "ShaolinRiot"
        },
        {
            "level": 0,
            "comment": "I am both just learning of this, and disappointed that it isn’t happening. There HAS to be a German word for that!",
            "score": 1,
            "author": "chpr1jp",
            "replies": [
                {
                    "level": 1,
                    "comment": "teeveeshowencancelfraun",
                    "score": 2,
                    "author": "Delicious-Tachyons"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Y'know, I really enjoyed the American remake (except for the last 5 minutes, like everyone.) I bet the original is probably much better, that's usually how it goes. Worth a watch?",
            "score": 1,
            "author": "Maninhartsford",
            "replies": [
                {
                    "level": 1,
                    "comment": "I still need to watch the og.  Loved the american one.",
                    "score": 1,
                    "author": "meutogenesis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have no idea what this show is but how much does it have to do with David Bowie? Is it just a title thing because they are British or does it go deeper?",
            "score": 1,
            "author": "UncertaintyLich"
        },
        {
            "level": 0,
            "comment": "Should have seen this coming after the years of no news. True shame.",
            "score": 1,
            "author": "JebusJM"
        },
        {
            "level": 0,
            "comment": "Well shit.",
            "score": 1,
            "author": "seamus_quigley"
        },
        {
            "level": 0,
            "comment": "**Life on Mars** is still my most favorite show ever. During the twitter rewatch in 2020 they had already anounced trying to re-new it. Adding another chapter. Philip Glenister and John Simm would have been on board even. \n\nI was on the fence with the idea, because let's be honest, they could only make it worse. However, seeing Sam and Gene work together again did intrigue me. But when nothing happened for almost three years, I knew it wouldn't come together.\n\nI do feel a bit disppointed, now, however. David Tennant gets another shot at the Doctor, so it would have been nice to see John Simm and Philip Glenister to also get another shot at portraying Sam Tyler and Gene Hunt.",
            "score": 1,
            "author": "Takato185"
        },
        {
            "level": 0,
            "comment": "I'm sad to read this, but on the plus side, I never knew there was an Ashes to Ashes series, so I guess I still gained a new series today?",
            "score": 1,
            "author": "e_dan_k"
        },
        {
            "level": 0,
            "comment": "Life on Mars was so good that even the American version was decent.",
            "score": 1,
            "author": "chewie_33"
        },
        {
            "level": 0,
            "comment": "I loved Life on Mars and I had no idea this existed. A bit excited to find it and watch.",
            "score": 1,
            "author": "Waste_Beautiful_7874"
        },
        {
            "level": 0,
            "comment": "The game sucks. Besides creating and exploring there’s nothing worthwhile",
            "score": -2,
            "author": "Flaky-Ad-7832"
        }
    ]
}