{
    "id": "140zgb5",
    "score": 3766,
    "title": "[Meta] r/Television should join the Reddit Blackout on June 12th to stand up to the API changes for 3rd party apps.",
    "author": "AlmostComedic",
    "date": 1685932606.0,
    "url": "https://www.reddit.com/r/television/comments/140zgb5",
    "media_urls": [],
    "other_urls": [
        "https://old.reddit.com/r/apolloapp/comments/13ws4w3/had\\_a\\_call\\_with\\_reddit\\_to\\_discuss\\_pricing\\_bad/](https://old.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/)",
        "https://old.reddit.com/r/modnews/comments/13wshdp/api\\_update\\_continued\\_access\\_to\\_our\\_api\\_for/](https://old.reddit.com/r/modnews/comments/13wshdp/api_update_continued_access_to_our_api_for/)",
        "https://old.reddit.com/r/ModCoord/comments/13zbf3n/reddit\\_to\\_the\\_visually\\_impaired\\_you\\_no\\_longer/](https://old.reddit.com/r/ModCoord/comments/13zbf3n/reddit_to_the_visually_impaired_you_no_longer/)",
        "https://old.reddit.com/r/ModCoord/comments/1401qw5/incomplete\\_and\\_growing\\_list\\_of\\_participating/](https://old.reddit.com/r/ModCoord/comments/1401qw5/incomplete_and_growing_list_of_participating/)"
    ],
    "postText": "I am not sure how many people have been following the recent news with Reddit and how they have decided to begin charging for API access for 3rd party apps.  \nI am also not sure how the majority of you access Reddit whether it is on the official app, Apollo (the iPhone Reddit app and largest 3rd party app), RedditIsFun (known as RIF which is an Android Reddit app) or any of the pushshift based sites like Unddit and Reveddit. This change also cripples most moderator sites and addons that many moderators use to help handle the huge amount of comments and posts they deal with on a daily basis.  \nI will provide some links below that explain the issues better since it would take a very long post to cover everything.\n\n  \nHere is the post from 4 days ago that was made by the developer of Apollo.  \n[https://old.reddit.com/r/apolloapp/comments/13ws4w3/had\\_a\\_call\\_with\\_reddit\\_to\\_discuss\\_pricing\\_bad/](https://old.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/)\n\n  \nMore info from the ModNews sub.  \n[https://old.reddit.com/r/modnews/comments/13wshdp/api\\_update\\_continued\\_access\\_to\\_our\\_api\\_for/](https://old.reddit.com/r/modnews/comments/13wshdp/api_update_continued_access_to_our_api_for/)\n\n  \nHow these changes affect any visually impaired Reddit users.  \n[https://old.reddit.com/r/ModCoord/comments/13zbf3n/reddit\\_to\\_the\\_visually\\_impaired\\_you\\_no\\_longer/](https://old.reddit.com/r/ModCoord/comments/13zbf3n/reddit_to_the_visually_impaired_you_no_longer/)\n\n  \nAnd the current list of subs participating in the proposed blackout.  \n[https://old.reddit.com/r/ModCoord/comments/1401qw5/incomplete\\_and\\_growing\\_list\\_of\\_participating/](https://old.reddit.com/r/ModCoord/comments/1401qw5/incomplete_and_growing_list_of_participating/)\n\n  \nI think that for any users here who moderate any other subs, or who have not see this information in other subs you use regularly please spread the word and get other subs to participate. Feel free to copy and past this post or just reuse the links provided.\n\n  \nSpread the word.",
    "comments": [
        {
            "level": 0,
            "comment": "This problem affects Reddit as a whole, _every_ sub should get on board. I _also_ think it should be a week long blackout.",
            "score": 670,
            "author": "A_Wild_VelociFaptor",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you give an end date to a protest it doesn't do much good",
                    "score": 197,
                    "author": "Stennick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeh the whole 48 hour thing is ridic, it might as well be a non starter. Two days is nothing, in fact it is so feeble that I can't help but wonder if it's reddit admins doing damage control and trying to throw the users a bone before it becomes larger blow back.  \n\nAlso what, if anything, is going to stop reddit from just removing the mods and reopening a sub and replacing the mods with more sympathetic people? \nr/videos is huge, no way the investors would let that sit locked and at the end of the day it's their property, not some mod.",
                            "score": 97,
                            "author": "ROGER_CHOCS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the 48 hours thing is supposed to be more of a first salvo.  A lot of the subreddits I've seen post this have also said they're prepared to go longer if necessary.  For instance /r/guildwars2 has said they're planning on [locking the subreddit on July 1st](https://www.reddit.com/r/Guildwars2/comments/13znkn2/reddit_is_going_to_kill_3rd_party_mobile_app/) unless the changes are abandoned.\n\n&gt;Also what, if anything, is going to stop reddit from just removing the mods and reopening a sub and replacing the mods with more sympathetic people? \n\nNothing really, I suppose, but I doubt it'd go in the way they hope.  Anyone that is eager to take over an established subreddit whose mods have been there for years is likely not someone you want running a subreddit.  I have to think that would just add to the backlash, and hopefully Reddit is smart enough to realize that (though, I can't say I'm exactly confident that's the case).",
                                    "score": 56,
                                    "author": "DisturbedNocturne",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ultimately I think shutting down certain subreddits is going to anger corporations who rely on Reddit to spread word about what they’re selling. \n\nI mean, if I’m Disney and some of the main places where my new show or movie is promoted and discussed is locked down, I’m going to be pissed. And I’d be pulling my advertising to demonstrate that. \n\nI also think we have to consider that major subreddits going on “strike” is going to hurt Reddit in the minds of investors and damage their chances at a good IPO. It demonstrates that the people in charge are not in control, and are out of touch with their users.",
                                            "score": 31,
                                            "author": "AmishAvenger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If I'm Disney and haven't already co-opted the subs with my name in them and control them already, the fuckup happened way before this",
                                                    "score": 20,
                                                    "author": "robotzor"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\n&gt;It demonstrates that the people in charge are not in control, and are out of touch with their users.\n\nSo business as usual then. The admins haven't had a grip for a long time now. Management need to replace the lot of them with people who understand about community engagement.\n\nI don't know how the current lot got asking in the interview but I can only assume that the questions were along the lines of \"do you know what a computer is\" and if they could point in the general direction of a laptop they get hired.",
                                                    "score": 1,
                                                    "author": "wedontlikespaces"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Reddit may just allow all these mods to be removed to prove a point: you can’t make demands about multimillion dollar deals. There’s a real power struggle here, and I have no doubt Reddit does not want to give the mods a lever to control corporate level decisions. So they’d rather have shitty and compliant mods and assume users will drive the content anyway.",
                                            "score": 2,
                                            "author": "HotpieTargaryen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What's the end game there though? Reddit relies on unpaid moderators to function, part of their whole business proposition is that their model is designed to not have to pay for moderators.\n\nIf a significant portion of mods leave because their tools don't work or they are kicked, the site's ability to function degrades sharply.",
                                                    "score": 2,
                                                    "author": "Zalack"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "good lord.. dev was instabanned of an alternative. Predictable? Imo yeah. Good for the situation - I don't think so https://www.reddit.com/r/Save3rdPartyApps/comments/142c6se/developer_of_a_replacement_api_for_moderation/",
                                                    "score": 2,
                                                    "author": "djdltori"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "it is definitely a good idea to remove mods from ones that censor out everything to more legitimate. this: https://www.reddit.com/r/Save3rdPartyApps/comments/142dp1d/reddit_has_banned_someone_for_promoting_free_and/ is not a right way to develop the situation",
                                    "score": 4,
                                    "author": "chenlei19880109"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Also what, if anything, is going to stop reddit from just removing the mods\n\nBecause this site would instantly become Digg v2.",
                                    "score": 6,
                                    "author": "SmellyTanookiFarts",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Large corporation weighs-up making a shitload of cash and sacking some mods Vs backtracking and losing money.\n\nIf they're thinking about an IPO, they'll go with the first option eventually.\n\nThis ain't the fuzzy little platform it once was.",
                                    "score": 4,
                                    "author": "Hostillian"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah absolutely I agree.",
                                    "score": 1,
                                    "author": "Stennick"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; I can't help but wonder if it's reddit admins doing damage control\n\nIt's absolutely Reddit admins doing damage control. They could care less if some small sub goes dark indefinitely, but there is zero chance they would let subs like r/television, r/pics, or r/videos stay dark for more than a couple of days.",
                                    "score": 1,
                                    "author": "DUNG_INSPECTOR"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Also what, if anything, is going to stop reddit from just removing the mods and reopening a sub and replacing the mods with more sympathetic people?\n\nNothing. They already have admins as mods there and will have no problem finding new unpaid volunteer ones that won't protest.",
                                    "score": 1,
                                    "author": "FPL_Harry"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That depends on the context. There is no Universal with Protests, it's not a hard science, it's social artform.\n\nReddit has literally all the leverage on this, they already won with Redesign and Official app (90% of reddit users use 2 Official Apps, all the 3rd party apps combined fall under 10%).\n\n10% can't sabotage the entire platform indefinitely when they are such a gross minority. This Protest (whatever duration) will affect users (the hyper majority) who already use Official app &amp; are fine with it.\n\nMeaning this act is a Symbolic Protest to generate mainstream news coverage and attention to what Reddit is doing (hard balling).\n\nIt can't be perpetual/indefinite protest because IF one is serious about this they need to account for who has what leverage and how to go about making changes.\n\nReddit could just remove Mods and place new ones in their places. Mods are the ones who make Reddit work, they can't behave without plans (like indefinitely shutting down subreddits) and then expect things to change in their favor.\n\nThere is an art form to protests.\n\nReddit wouldn't even have bothered with doing what they are doing if the metrics of App users were reversed. They're doing this because they know they won years back, this is just covering the edges.",
                            "score": 6,
                            "author": "iVarun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is not how many will leave or protest, but who those people are. 10% or less of users are responsible for almost all content, and a micro fraction of users moderate places making sure they are not filled with spam. There is a subreddit that i used to watch that got banned for being unmoderated and it was painful. Half of the posts were fake Instagram spam and this was already a place that was getting fewer than 20 posts a week after spam, so it was incredibly noticeable and i am not surprised it got banned for that reason. A significant slice of moderators use 3rd party tools and have publicly stated they will leave when the tools break, and most people are not willing to spend their free time moderating an internet forum for a very specific interest.",
                                    "score": 8,
                                    "author": "account_destroyed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Which 10% one is talking point matters in this debate.\n\nThere is no credibility to the claim that the 10% of Reddit users who use 3rd party mobile apps ARE the same ones in the 90:9:1 principle of content generation &amp; consumption.\n\nMods are the entire reason Reddit was and is what it is. Without Mods there is literally no Reddit. However Reddit leadership's priorities currently are aligned in a way that is clear. Mods are not priority for them. However if Mods pick a fight with Reddit leadership the latter isn't just going to roll over, PRECISELY because of the now underlying numbers which are different to how it was 5-10 years ago.\n\nHence for a Symbolic Protest to be successful (since that is the logical objective), one needs to have clear structure to the protest, it can't be nonsensical indefinite strike. That is just moronic. \n\nRedesign won, every Modteam on reddit knows this (since sub-traffic metrics are now visible to Mods-only).  \n2 Official Apps (Android-iOS) won.\n\nReddit as a company will have no qualms getting rid of Mods given that the Scale of Reddit now is big enough that those 90% have enough to sustain it. Just because it will be lower quality is trivial question since Reddit leaders aren't bothered with that aspect to being with anyway. Their priorities in the short-medium term are different and losing 10% of 3rd party mobile app users is not a big deal.\n\nBesides it's already non-credible claim that ALL of those 10% will just leave Reddit. Like, seriously?\n\nThe user shedding will be fraction from that already minnority fraction.\nAnd there will be no Digg Moment because there is no pre-existing Reddit Alternative of note (this being relevant since it can't just be anyone. Reddit is not Twitter, it's platform design and type of content it generates, sustain is different because it's platform structure is different).",
                                            "score": -2,
                                            "author": "iVarun",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Mods are the entire reason Reddit was and is what it is.\n\nExactly. And if moderating becomes too hard/less effective it's going to cause customer abrasion which will lead to people leaving.",
                                                    "score": 4,
                                                    "author": "Leskral",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "These lockdowns will end up hurting several of the subreddit communities, but won't hurt others.\n\nSome mods will be replaced during the protest, some after, some not at all.",
                                    "score": 2,
                                    "author": "N64ExpansionPack"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It does. It’s a warning. That is why you announce you are going to go on a strike before actually doing it.",
                            "score": 2,
                            "author": "Dragon_yum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But you don't announce you're striking for two days. You announce you're striking until shit changes. You don't say \"shit has to change, its not so I'm going on strike for two days'.",
                                    "score": 3,
                                    "author": "Stennick"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "/r/videos have said they are \"continuing [the blackout] until more reasonable terms are offered\". So there is a possibility of it being longer then a few days/week. /r/television and all subs should follow the same.",
                    "score": 80,
                    "author": "OperativeIvory"
                },
                {
                    "level": 1,
                    "comment": "*We* should also not use Reddit for the week",
                    "score": 11,
                    "author": "THIESN123"
                },
                {
                    "level": 1,
                    "comment": "Blackout until changed.\n\n\nThey want to kill reddit.. we can do that for them.\n\n\nPower to the users!",
                    "score": 8,
                    "author": "chocki305",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "for sure. Given how mods are now banning not only devs that are deciding to act. Censorship went downhill - https://www.reddit.com/r/Save3rdPartyApps/comments/142dp1d/reddit_has_banned_someone_for_promoting_free_and/",
                    "score": 3,
                    "author": "bballplayr1010"
                },
                {
                    "level": 1,
                    "comment": "I think the blackout shouldn't have an end date. It should last until Reddit walks back their new API pricing.",
                    "score": 2,
                    "author": "beefcat_"
                },
                {
                    "level": 1,
                    "comment": "Better than a blackout would be to stop all third party links just how they stop all third party apps",
                    "score": 1,
                    "author": "FunkoXday"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I use the Reddit is fun app as its so much better. Once it's blocked I probably won't return as I find the office app so much worse",
            "score": 60,
            "author": "Dennyisthepisslord",
            "replies": [
                {
                    "level": 1,
                    "comment": "I use https://old.reddit.com exclusively because new reddit is bullshit.  What features does the app give that people like so much?   Never used an app with reddit.",
                    "score": 27,
                    "author": "SlapunowSlapulater",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You would rapidly recognize RIF and Apollo as reddit while using them whereas the official app will come across as some horrific amalgamation of reddit, instagram and tiktok\n\nIt’s not that they offered full fledged features(even before this reddit restricted their API for certain things), it’s that they have a clean interface, are designed well for use with touchscreens, and present an experience very much in line with old.reddit. The mobile site or official app in comparison are cluttered and user unfriendly",
                            "score": 37,
                            "author": "GrabtharsHammer-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aside from not being user friendly, it would be a different story if the official app worked flawlessly, but it constantly crashes and the chat is horrible. Plenty of times where it malfunctions or straight up doesn't work.",
                                    "score": 6,
                                    "author": "The_PontiacBandit_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;the chat is horrible\n\nWho even ever asked for chat?",
                                            "score": 5,
                                            "author": "breakingcups"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just looks better easier to get around. \n\nNo point trying it now as it's about to be killed off",
                            "score": 5,
                            "author": "Dennyisthepisslord"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;What features does the app give that people like so much? Never used an app with reddit.\n\nFor me it's just speed of use, jumping in and out of comments doesn't involve reloading a page, moving around the UI involves simple quick swipes, content is presented in a way that's easier to read than old.reddit (for me at least).\n\nIt's just faster and comfier for my use.",
                            "score": 3,
                            "author": "IISuperSlothII"
                        },
                        {
                            "level": 2,
                            "comment": "Only issue with old is it's so hard to search with",
                            "score": 2,
                            "author": "FunkoXday"
                        },
                        {
                            "level": 2,
                            "comment": "Reddit is Fun is like an app version of old.reddit.com where it's minimalist in design and you don't see stuff like followers or profile pics. And then has useful filtering options to block based on subreddit, titles, URL domains, and flairs. Even do per subreddit filtering.",
                            "score": 2,
                            "author": "StructureScroll"
                        },
                        {
                            "level": 2,
                            "comment": "Even the mediocre official app is 10x easier to navigate on mobile than old Reddit in the browser",
                            "score": -6,
                            "author": "badgarok725"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The official reddit app is so terrible compared to almost every 3rd party app there is.",
                    "score": 4,
                    "author": "Xonra"
                }
            ]
        },
        {
            "level": 0,
            "comment": "48 hours isn't enough. Should be indefinite until they reverse course.",
            "score": 87,
            "author": "MaltySines",
            "replies": [
                {
                    "level": 1,
                    "comment": "The problem is, if the mods said it was ongoing, users would say oh wait no…. We need our Reddit content….. 2 days is enough but after that it’s to much. \n\nThe admins will go oh great so people will come back, people want their Reddit and won’t let the subs stay closed for a few weeks,  so we can wait a few months and push this through. Just goes to show how much tokenism is involved in these protests. \n\nI mean even the mod system is insane.  Hundred of people working entirely for free. They are just getting laughed at by Reddit admins. I just keep thinking of bane saying oh you shut down the subs…. Do you think this gives you power.",
                    "score": 20,
                    "author": "Busy_Moment_7380",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is exactly it, but no one wants to hear it so they’d just rather yell at and downvote mods that say it",
                            "score": 6,
                            "author": "badgarok725"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\n&gt;But hey folks occupied wallstreet for awhile and stopped all capitalism in its tracks so anything is poss….. oh wait.\n\nThat's a daft comparison.\n\nOccupy was never going to work because what they wanted was literally impossible and they were completely unprepared to negotiate. But what we want from Reddit is for them to have a sensible API charging fee, it's clear and concise.\n\nAlso wall Street could just ignore ignore the occupy movement. But if users stop coming to the site Reddit is kinda dead.",
                                    "score": 11,
                                    "author": "wedontlikespaces",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Occupy was never going to work because what they wanted was literally impossible and they were completely unprepared to negotiate.\n\nYou are *this close* to a moment of self-awareness, here.\n\nAnd before you start in, I'm someone who uses 3rd party mobile apps, I'm going to be affected by this. This isn't a fight that blackouts are going to win. It's not a fight that 3rd party app users are going to win.",
                                            "score": -1,
                                            "author": "SituationSoap",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You don't know that, and that's the point. There *is* a possibility to win here, your nihilism not withstanding.\n\nYour attitude and the above peoples attitude, is not helpful.",
                                                    "score": 1,
                                                    "author": "wedontlikespaces",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; There is a possibility to win here\n\nNo there isn't. Boycotts don't work. This one won't, either.",
                                                            "score": 2,
                                                            "author": "SituationSoap"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If what Reddit wanted was to make a reasonable amount of money from API access it might be possible to come to a compromise. \n\nIt's not what they want, though. What they want is to set the fees high enough to kill off third party apps entirely, because third party apps don't give them the end to end tracking of users that they want. That's why the price they're setting is so high, it's a \"fuck off\" quote.",
                                            "score": 1,
                                            "author": "nolo_me"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I really think the attitude to this stuff should be \"was fun while it lasted\" rather than throwing a temper tantrum\n\nReddit has been hosting these API's for free for so long and the apps bypass their monetisation\n\nIf I were reddit I would just prevent the mods of subreddits from closing them down and/or remove them as a mod if they tried",
                            "score": -16,
                            "author": "Glum-Figure-8848",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Reddit has been hosting these API's for free for so long and the apps bypass their monetisation\n\nThat's a fair take I guess, and one could argue that the API should cost money, that's not the problem. The problem is that even by very optimistic calculations, API access for one average user costs multiple times as much as reddit could ever possibly make per user.\n\nThere is a calculation [in this thread](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) that favors reddits position *a lot* and it is still ridiculous. While reddit roughly makes $0.12 per user and month, they ask for $2.50 for the equivalent of API access. So they try to make 20x the money through the API. That's straight up bullying.\n\nAnd calculations like that don't even cover other aspects. E.g. an API user is cheaper for reddit than a regular user. Or if the API would not be usable, people would go back to web scrapers for building 3rd party services which put much heavier strain on their servers and therefore create more costs.",
                                    "score": 7,
                                    "author": "fntd"
                                },
                                {
                                    "level": 3,
                                    "comment": "No one would be complaining about this if their first party app and new mobile site weren't total dogshit for their entire existence.",
                                    "score": 2,
                                    "author": "MaltySines"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a question. I only use Boost to read Reddit because I thought the Reddit app was atrocious. Will anything change for me?",
            "score": 45,
            "author": "FatGeologist",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 158,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is Reddit planning an IPO or something?",
                            "score": 31,
                            "author": "PetyrDayne",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Forgive the ignorance, what’s IPO?",
                                    "score": 10,
                                    "author": "thc216",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Nothing to ask forgiveness for. Investopedia page on the topic](https://www.investopedia.com/terms/i/ipo.asp)",
                                            "score": 31,
                                            "author": "PetyrDayne"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Reddit will become a publicly traded company, and the current owners will make a boatload of money.",
                                            "score": 12,
                                            "author": "captainhaddock"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "One of the final stages of the enshittification of a platform.",
                                            "score": 8,
                                            "author": "that_baddest_dude"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Initial Public Offering. They will stop being a private company and will be on the stock market for public to buy their shares.\n\nThis means the owners can sell their shares and get money for it (higher the share prices end up being in the market more the money they will make from selling their shares).",
                                            "score": 3,
                                            "author": "_batteryacid925"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s probably more to capitalize on the explosion of data mining for training large language models.\nOpenAI will need to pay Reddit a fortune to keep improving GPT.\n\nKilling 3rd party apps is a happy side effect for Reddit investors",
                            "score": 6,
                            "author": "thecodethinker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Either Boost will shut down, or you'll have to pay a pretty pricy subscription to keep using it. More likely the former since gaining any real margin after paying API fees and Google's 30% cut is nearly impossible without it being more expensive than most would pay.",
                    "score": 29,
                    "author": "ColonelSanders21"
                },
                {
                    "level": 1,
                    "comment": "Fellow Boost user here, everything will affect us too.",
                    "score": 22,
                    "author": "johnppd"
                },
                {
                    "level": 1,
                    "comment": "Yes but only everything will change",
                    "score": 6,
                    "author": "ghx16"
                },
                {
                    "level": 1,
                    "comment": "I believe reddit will be charging third party apps to access their API. In addition will also not allow NSFW content will be allowed on third party apps. A lot of users will be impacted",
                    "score": 16,
                    "author": "RedWings00",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\n&gt;In addition will also not allow NSFW content will be allowed on third party apps.\n\nIs it such a weird one because the pricing basically guarantees that won't be any third-party apps anyway, so why lump that one in there as well?\n\nI'm thinking they're going to go the way of Tumblr and ban NSFW content. Which would basically kill the site.",
                            "score": 5,
                            "author": "wedontlikespaces"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes. All third party apps are affected.",
                    "score": 7,
                    "author": "Jackie_Mitchell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 36,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds good to me",
                    "score": 2,
                    "author": "use_vpn_orlozeacount"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mods, if you actually care about this userbase, you will do it.",
            "score": 107,
            "author": "r4tzt4r",
            "replies": [
                {
                    "level": 1,
                    "comment": "Users can also join the boycott. Don't use reddit for however long you want to protest. Don't post, comment, vote, login, or even visit.",
                    "score": 15,
                    "author": "AlphaTangoFoxtrt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, of course I'm doing that. Still would be good if subs joined in!",
                            "score": 4,
                            "author": "HappyAndProud",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, the \"official\" strike starts on the 12th so that's when I'll start the boycott to make it absolutely clear that it's a part of that.",
                                            "score": 3,
                                            "author": "HappyAndProud",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "it’s kinda pointless to be one person and leave if nobody else has given the indication that they’re leaving too",
                                                            "score": 3,
                                                            "author": "astronxxt",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 0,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "no, that’s not what i said at all. anyone who would think that sucks at reading or is being willfully ignorant.",
                                                                            "score": 2,
                                                                            "author": "astronxxt"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's about sending a message and quitting when everyone else does, does that the best imo",
                                                            "score": 2,
                                                            "author": "HappyAndProud"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Well, of course I'm doing that.\n\nThen who wrote this comment?",
                                    "score": -2,
                                    "author": "DUNG_INSPECTOR",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The mass boycott starts on the 12th",
                                            "score": 4,
                                            "author": "HappyAndProud"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The only thing the main moderator here cares about it adding even more TV subs to his collection of 9,282. Imagine having your life revolve around being a moderator of so many subs. It's simultaneously sad and amusing.\n\nhttps://i.imgur.com/rR4qaC5.png",
                    "score": 133,
                    "author": "Ninja-President",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "JFC. How would anyone have the time to moderate that many subs? No social life combined with no actual job? Also, is this the same guy as that Turtle person that everyone complains about?",
                            "score": 28,
                            "author": "LayneInVane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s a money making scheme/business\n\nThey’re not gonna bite the hand that feeds them here. They *just* started getting money from Lionsgate.",
                                    "score": 3,
                                    "author": "MadeByTango"
                                },
                                {
                                    "level": 3,
                                    "comment": "No that's /awkwardtheturtle iirc. \n\nAs another user pointed out, it is a lot of subs, but a lot of shows' subs go inactive once the show ends. So they don't need that much maintenance.",
                                    "score": 12,
                                    "author": "mleibowitz97"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As a former mod of this sub, I have my issues with Nick, but the subs he mods isn't really something to look at negatively. The majority of those subs are inactive since the shows are over or dead. Once that happens, a sub goes into maintenance mode and really doesn't need much other than the mod queue cleared of spammers every few days. \n\nWith that said, you most likely won't get anywhere with this petition. Getting Nick to do anything is like pulling teeth. Your best bet is to hope /u/prax150 or /u/PhoOhThree sees this.",
                            "score": 81,
                            "author": "2th",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's more weird that they claim them and then sit on them forever.  What are they getting out of that",
                                    "score": 17,
                                    "author": "GhostlyRuse",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They do worse than that. If you create the sub for the show before they do (e.g. in pre-production) and you have the show name as the sub name and you mod it and have subscribers and it is a functioning subreddit, they will create their own new subreddit for the show and put their empty sub in the /r/television premiere post about the show so that they siphon off the users from the original sub, and new users assume it is the main sub for the show. \n\nThey did it to me on an old account when I set up a sub for a show I was very excited about.\n\n\nWithout being specific, it's like if you set up /r/TheWire and then the night the show premieres you see they pin a link to a new sub they set up called /r/TheWireHBO",
                                            "score": 36,
                                            "author": "FPL_Harry",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, it's about control.  The other guy is defending it like it's just them taking up the burden when really it's about not wanting to give up the power. \n\nI get wanting to mod a sub and cultivate a good community. Totally on board with moderation as a necessary part of that.  But there's a limit.",
                                                    "score": 14,
                                                    "author": "GhostlyRuse",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah. I'm a mod of a couple of subs on another account (small ones, the biggest is a sub for a band, that has 5000 subscribers), and it's been a great community for the last 10 years, especially in the early days.\n\nBut I don't care about \"power\". All I do is remove spam and change the pinned thread whenever there is a new album release or tour announcement. Wanting to mod a thousand subreddits is pathological behaviour. That person is not right in the head.\n\nIt would be shit if they suddenly gained global popularity and some supermod made a new sub and our sub (with years of discussion, jokes, content, sharing unreleased material, etc.) was left empty.",
                                                            "score": 11,
                                                            "author": "FPL_Harry",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I mod too on different accounts and find even 1 sub tiring to manage. I like having a good place to discuss stuff and that needs moderation, but you can't tell me modding more than like 5 subs is anything but a power trip.  Especially if you're just sitting on old inactive subs.",
                                                                    "score": 0,
                                                                    "author": "GhostlyRuse"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It isn't about control. It is about having a place that you can enjoy discussion of a topic you enjoy. When someone else does a shitty job, may as well do it right yourself. \n\nAnd given people like you complain without actually wanting to put in the work to keep a sub spam free, on topic, or clear of assholes and trolls, you need mods who will. \n\nSo suck it up, and be the change you want. But we both know you will never volunteer to do the internet janitorial work because you feel it is beneath you.",
                                                            "score": -7,
                                                            "author": "2th",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dude, you need to log off",
                                                                    "score": 7,
                                                                    "author": "GhostlyRuse",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They control the subs for the studios; that’s their gig, reputation management",
                                                    "score": 0,
                                                    "author": "MadeByTango"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's not weird at all. If you look at his list you'll see a bunch of shows that have ended. The community isn't really going to grow without some weird external stimulus, so modding those subs becomes even more rote work of checking the mod queue, seeing spam, and removing it. The alternative is to abandon the sub and leave it for the spammers and scammers to prey on and any innocent user that happens to wander in can be a victim.\n\nHell, even I have subs like that. For example, /r/TheStrain ended in 2017 and I'm still mod there because every now and then a spammer shows up and I ban them and report them to the admins. No one else will do that job, and it takes minimal effort from me, so why not be a nice person and help out. It's like cleaning up garbage along a walking path because you want it clean. If no one else is going to do it, then I may as well.\n\nAlso, Nick is an exceptional internet janitor. When I modded this place he would even beat out Automod for mod actions on the sub. If there were 1000 (not the real number, just using this as an example) mod actions in a month, Nick would be like 350 of them, Automod would be 300, I'd be around 200, and the remaining 150 would be between the rest. And yes, I'm fully aware being a mod is just being an internet janitor.  It's not a glorious job, but it's a necessary one. That's why I stick with communities I actually enjoy these days.",
                                            "score": -6,
                                            "author": "2th",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not saying moderation isn't necessary. But claiming subs like Thanos and hoarding them forever is weird.",
                                                    "score": 9,
                                                    "author": "GhostlyRuse",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Once again, look at the subs he has. That means click them. See how many users they have. See how active they are. See where he is on the mod list. Get the full picture before you comment. Nick has a ton of subs but a lot of them are either not active (so just even more rote internet janitorial work), test subs (look at /r/westworld_css), redirects, or just hold overs from waiting for TV shows. \n\nHell, even I have stuff like /r/damagecontrol and /r/pietyfx for shows that never materialized. They were announced then died. Why do I keep them? Because the topic is still something I'm interested in and should anything ever happen, I'd be there to run the community. It hurts no one by me having those subs. So why even complain? It's just bitching for the sake of \"MODS AREBAD!!!! 111!!\"\n\nNow, should something legitimate come around that uses the names for those sub, I'd be more than happy to  discuss handing things over.",
                                                            "score": -7,
                                                            "author": "2th",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I feel like you need to defend this behaviour because you do the same thing and don't want to think about how weird it is. \n\nYou want to run the community.  All of them. Why?  You're showing it's just you tending them like your own private garden. It's weird.  I agree, moderation is a good thing. But you're not falling on a sword here, you're squatting.",
                                                                    "score": 9,
                                                                    "author": "GhostlyRuse",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; I feel like you need to \n\nThere's the problem. You are operating on your emotions instead of using your brain. I have given you logical, and reasonable reasons for why someone would mod a lot of subs. You have not provided a single reason for your dislike other than your \"feels.\" And let's get personal here, name one bad thing happening by me sitting on subs. Name one. And to be perfectly honest, I don't expect you to because I do not believe you can. Feel free to prove me wrong.",
                                                                            "score": -1,
                                                                            "author": "2th",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No, you've said why you've collected subs and why you feel the need to keep them.  It's not logical, it's what you want. How could I prove you don't want to retain the power by keeping dead subs.",
                                                                                    "score": 9,
                                                                                    "author": "GhostlyRuse",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh hey 2th. Same. Nick is a really committed guy and pretty pivotal to the television communities on here at large, but he sorta does his own thing. \n\nSame reason why we never did anything for April Fools.",
                                    "score": 3,
                                    "author": "your_mind_aches",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How do you pronounce \"2th\"? Secondth or twoth?",
                                            "score": 2,
                                            "author": "OneGoodRib",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tooth",
                                                    "score": 2,
                                                    "author": "your_mind_aches"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your point being... Shut up and lick Reddit balls?",
                            "score": -3,
                            "author": "r4tzt4r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "reddit is a private business.  They can do whatever they want with their API.  If you would like to protest that your option is to stop using the site.  Pretty simple.   But that doesnt get you social media points.",
                                    "score": 6,
                                    "author": "MrSh0wtime3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; a private business.\n\n\nThat relies on users creating content for free and mods working also for free. Fuck your social media points, there are subs that are actually helpful, with great communities. \"Stop using it then\" is a \"solution\" sure, but a very stupid one.",
                                            "score": 3,
                                            "author": "r4tzt4r",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;You are so outraged by this move they made that you are here contributing to their traffic daily.\n\n\nI don't think you actually understand this situation. The point is not \"stop using Reddit to show them\". That we all like the site here is a fact, that some also *need* to use it for one or more reason is a fact. That's what should be taking into account. But sure, let's be stupid and say \"lol you achieve nothing and here you are lol\".",
                                                            "score": -1,
                                                            "author": "r4tzt4r",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For someone who mostly uses Reddit on my phone when you look at it at all, this definitely means I'll likely be using much less Reddit. I use 3rd party apps because bluntly the official reddit app on Android is garbage with random hangs, just deciding \"no you don't get to post, oh wait no you just triple posted lawl\", just getting like 20 posts down and randomly stops and refuses to load anything else.\n\nIt's so friggin bad.",
            "score": 3,
            "author": "Xonra",
            "replies": [
                {
                    "level": 1,
                    "comment": "On mobile I was using reddit's .compact interface for years, but they discontinued a few months ago. Now I'm just on old.reddit.com which is very difficult on mobile but still better than their regular interface. I don't know how anyone puts with that, it's so bad.",
                    "score": 1,
                    "author": "preppytarg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "u/NicholasCajun u/DasHuhn u/Prax150 u/PhoOhThree u/LoretiTV\n\nIs this sub onboard? If so or if not, care to sticky a comment with a response?",
            "score": 3,
            "author": "baltinerdist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just FYI, if you mention more than 3 users in a comment, none of them get notified.",
                    "score": 2,
                    "author": "The_King_of_Okay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do the 3rd party apps do that the android app doesn't? I have always used the normal app but then I don't use Reddit that much other than for an hour browsing while on my lunch break or porn subs now and then.",
            "score": 12,
            "author": "Monkeyspazum",
            "replies": [
                {
                    "level": 1,
                    "comment": "They show less ads, have a UI thats way easier on the eyes, usually don't have the typical tiktok/fb 'feed' UI, don't spam you with noticifactions and shit, no clutter due to not showing reddit profile images and avatars, no reddit awards either.\n\nSo it's mostly that the 3rd party apps have 'less', which makes it basically look and function like old-reddit. \n\n'Less is more' has never been more true than when you compare the official app to 3rd party apps\n\nAlso during my short time of using the official app I constantly received notifications for subs/posts I don't follow, and also had difficulties with the inbox/chat, as messages rarely showed up in the official app but did show up on my pc or 3rd party RIF app",
                    "score": 30,
                    "author": "SoundofGlaciers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah right fair enough. I don't really get any notifications as I have turned them all off but yes there are adverts here and there but I don't really notice them. I am a very casual user of Reddit though so maybe that is why the app doesn't really bother me. I might try one of the third party apps though to see what its like, I wasn't aware there were 3rd party apps until I saw these type of threads.",
                            "score": 3,
                            "author": "Monkeyspazum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There can also be extra features, not included in the core functionality of Reddit.\n\nI am using Sync for Reddit, and the app includes:\n\n* Customizable colors, I can either manually select the colors of the different UI elements, or use Android's Metarial You to automatically set them up from my current wallpaper\n* Link previews, so I can see the thumbnail of a link before clicking on it (this might have been added to Reddit, I don't know)\n* Embedded YouTube player for videos\n* User and/or subreddit filter: I can hide content I am not interested in\n* Rick roll alert: the app will warn me if I am to click the most common urls associated with the video\n* User tags: I can add custom description to individual users to be able to mark memorable users\n* Ability to \"download\" whole threads to read comments while I have no internet\n* Automatically mark accounts younger than 3 months\n* And some more\n\nBy subscribing to Sync ultra, the apps paid features become available (well, more or less, there are bugs):\n\n* I can translate comments and post to my phone's default language (in this case, English)\n* I can restore deleted/removed comments\n* I can back up my Sync settings to the cloud\n\nIn short, a 3rd party Reddit client can enhance your user experience by providing not officially supported functions, making official functions more efficient, and can produce you with greater customization.\n\nThey also act as motivation to improve the official Reddit client's functionality.\n\nYet, Reddit decided it's more profitable to kill them all.",
                                    "score": 2,
                                    "author": "Sydius"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The 3rd apps are far far far far better than reddit's own shitty app.",
                    "score": 8,
                    "author": "iphone4Suser"
                },
                {
                    "level": 1,
                    "comment": "Mostly customization. I use boost and tried to make it look as close to old reddit as I could.",
                    "score": 2,
                    "author": "shogunreaper"
                },
                {
                    "level": 1,
                    "comment": "Think of it as the difference between new.reddit.com and old.reddit.com. Or Android running on Samsung vs Android running on Pixel.\n\nSame content, but different UI and interfaces that people like. It's why among just third party reddit apps there isn't like a consensus on which is the best due to people having preferences when it comes to visuals, layout, and interacting. \n\nThen there's stuff like filtering where apps like Reddit is Fun let you block based on subreddit, titles, URL domains, and flairs. Even do per subreddit filtering. Filtering is the most valuable for me if I ever venture into /r/all or want to avoid spoilers from a show or game, etc.",
                    "score": 1,
                    "author": "StructureScroll",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes that would be good actually, I sometimes see animal videos where an animal is being killed or abused, I would rather not see that sort of thing.",
                            "score": 1,
                            "author": "Monkeyspazum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, it makes curation much easier. If you aren't already you should use /r/Enhancement too for browsing on a desktop. That browser extension has more customizable filter options. \n\nHad seen some people talk about doom scrolling on reddit with all the stuff that pops up on /r/all, so the third party filter options really help to cut out content you don't want to see.",
                                    "score": 1,
                                    "author": "StructureScroll"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck Reddit.",
            "score": 14,
            "author": "PussyExtension"
        },
        {
            "level": 0,
            "comment": "I'm glad this is happening. It's the push I need to quit this toxic site",
            "score": 5,
            "author": "1Bot2BotRedBotBluBot"
        },
        {
            "level": 0,
            "comment": "Yes 100% please join",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "warning - reddit admins are banning now people for upvoting blackout https://www.reddit.com/r/Save3rdPartyApps/comments/142dp1d/reddit_has_banned_someone_for_promoting_free_and/",
            "score": 2,
            "author": "udt89"
        },
        {
            "level": 0,
            "comment": "This subreddit is heavily astroturfed. Corporate interests will prevent this sub from joining the blackout",
            "score": 6,
            "author": "goomahmarone"
        },
        {
            "level": 0,
            "comment": "These blackouts have never done what they were intended for on reddit. In the past, you all cried and whined, and blacked out.\n\nAnnnnddd Reddit didn't back down and management did what they wanted to anyway.",
            "score": 2,
            "author": "UniversalMonkArtist",
            "replies": [
                {
                    "level": 1,
                    "comment": "They must be permanent to be effective (permanent private status until changes made). Many subreddits are doing this, but sadly I doubt the big ones will. Unless you get most of the frontpage subreddits to get on board with a permanent blackout then it probably won't work.",
                    "score": 2,
                    "author": "laserinlove"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please consider shutting down longer than 48 hours. We as mods will loos a lot of useful tools. We need to make a bigger impact than just 48 hours we should be shutting down until this horrible decision will be reversed.",
            "score": 4,
            "author": "djdeforte",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes no 48 hours...it needs to be far more.",
                    "score": 0,
                    "author": "iphone4Suser"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you build a business around another business this can happen.  You control nothing and deserve nothing.   The Apollo dev made millions of dollars.  Good for him.  \n\nIf you want to protest just sign off and quit the site.   But we know you wont do that.  It actually requires a tiny bit of effort and personal dedication.  Who wants that?  ew.  The much better idea is to black out the site for the vast majority of users who dont use 3rd party apps at all.",
            "score": 1,
            "author": "MrSh0wtime3"
        },
        {
            "level": 0,
            "comment": "Nah don’t give a shit tbh",
            "score": 1,
            "author": "Billy_Madison69"
        },
        {
            "level": 0,
            "comment": "Please don't. There is absolutely nothing wrong with what Reddit is doing. It's their business, their platform. Allowing freeloader 3rd party apps until now was the grace period. \n\nIf you don't want to see ads, pay for premium. I do. I would even pay for Facebook without ads. If it's a service that's very useful for you and helps in your life a lot, why not pay for it?",
            "score": -17,
            "author": "gs_work",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those \"freeloader\" apps are widely responsible for Reddit's own popularity. There was no official Reddit app for the longest time. 3rd party apps were carrying this place for years.",
                    "score": 14,
                    "author": "MeatTornado25"
                },
                {
                    "level": 1,
                    "comment": "Congratulations, you have a strong opinion on a topic where you didn't even understand what the problem is about.",
                    "score": -5,
                    "author": "fntd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What do you mean? Asking $20m/year is all this is about. Seems like most of the people angry about this change don't understand how capitalism works. \n\nYou have a product, you sell it. You may or may not allow others to use it outside of strictly defined constraints. \n\nThat's all this is about. A company, completely legally and in advance is changing its pricing model. Anyone not interested in it, can decide to leave. \n\nIf the value of the company drops or goes belly up due to their incompetence, that's also part of capitalism. Sometimes stupid decisions lead to inevitable downfall.",
                            "score": -3,
                            "author": "gs_work",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;You have a product, you sell it. You may or may not allow others to use it outside of strictly defined constraints. That's all this is about.\n\n\"Ignore your customers\" is amazing business advice. They don't matter, only your product. You are a damn genius.",
                                    "score": -2,
                                    "author": "No-Text-3698",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Users are not customers, we are the product.",
                                            "score": 2,
                                            "author": "FPL_Harry",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Please don't. There is absolutely nothing wrong with what Reddit is doing.\n\nlmfao please daddy smack me harder. Who generates all the content on reddit? Oh, that's right, the users. Don't listen to them tho, you're a big strong business who don't need to listen to anyone.",
                    "score": 2,
                    "author": "No-Text-3698"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a question. I only use Boost to read Reddit because I thought the Reddit app was atrocious. Will anything change for me?",
            "score": 0,
            "author": "Illegal_Sir",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boost and every other third party app will have to pay millions yearly to keep access to the API, so once it goes live unless the boost dev pays it will stop working.",
                    "score": 2,
                    "author": "Hakul"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is getting cringe now. You're starting to sound like whiny babies. No one listens to whiny babies",
            "score": -17,
            "author": "SodHawk",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; You're starting to sound like whiny babies. No one listens to whiny babies\n\nI agree. Stop posting, crybaby. So cringe.",
                    "score": 0,
                    "author": "No-Text-3698"
                },
                {
                    "level": 1,
                    "comment": "I listen to whiny babies.",
                    "score": -3,
                    "author": "fpij"
                }
            ]
        },
        {
            "level": 0,
            "comment": "do vanity protests ever get boring to you guys?   Seems like volunteering at the soup kitchen would do more for the world than these endless vanity protests over nonsense.\n\nWhats strange is watching the poor Gen Zers always wanting to protest in the name of rich people.   First the writers.   Now we are protesting so Apollo devs can continue to make millions a year off the back of a site they didnt create and have no say over?\n\nStrange ass times.",
            "score": -2,
            "author": "MrSh0wtime3"
        },
        {
            "level": 0,
            "comment": "Sounds like we're going on a Reddit vacation, boss! See you all in a week!",
            "score": -1,
            "author": "Thin-Relation29"
        },
        {
            "level": 0,
            "comment": "uh. why don't you just block the freeway during rush hour to \"raise awareness\"?",
            "score": -15,
            "author": "unkle_FAHRTKNUCKLE",
            "replies": [
                {
                    "level": 1,
                    "comment": "That'd be a good tactic if the freeway was turning toll road at the end of the month.",
                    "score": 8,
                    "author": "Zarathustra30"
                },
                {
                    "level": 1,
                    "comment": "uh. why don't you just wear a ribbon to \"raise awareness\"?",
                    "score": 1,
                    "author": "No-Text-3698",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wearing a ribbon does not damage the productivity of thousands of innocent commuters and bring out the news helicopters.",
                            "score": 1,
                            "author": "unkle_FAHRTKNUCKLE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Neither does blacking out a bunch of subreddits.\n\nIs this just you wanting to murder the liberal stereotypes that gay dance around your brain? Therapy won’t bring out the news helicopters either. Just sayin.",
                                    "score": 1,
                                    "author": "No-Text-3698",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh! Its a [GOOD THING](https://www.youtube.com/watch?v=zANvYB93u2g) you were here for THAT!....&lt;whew&gt;.....or I would still be sittin here thinking that freeway blockages really happened at MULTIPLE places and in MULTIPLE times :    \n[1989](https://www.latimes.com/archives/la-xpm-1989-01-31-mn-1493-story.html)   \n[2003](https://en.wikipedia.org/wiki/20_March_2003_anti-war_protest)   \n[2016](https://abc7news.com/twenty-five-protesters-were-arrested-chaining-themselves-together-and-blocking-all-westbound-lanes-of-the-bay-bridge-martin-luther-king-jr-day/1164394/)   \n[2020](https://www.youtube.com/watch?v=oLWbNJxh_j4)   \n[2020](https://www.google.com/search?q=Bay+bridge+blocked+by+protesters&amp;newwindow=1&amp;source=hp&amp;ei=FXp-ZM-mD4ul0PEPgc-BgAM&amp;iflsig=AOEireoAAAAAZH6IJYIlMkDlfu6BwmTnNTl-SZvWufGg&amp;ved=0ahUKEwiPhduSrq3_AhWLEjQIHYFnADAQ4dUDCAs&amp;uact=5&amp;oq=Bay+bridge+blocked+by+protesters&amp;gs_lcp=Cgdnd3Mtd2l6EAMyCAghEKABEIsDOhEILhCABBCxAxCDARDHARDRAzoICAAQgAQQsQM6CwgAEIAEELEDEIMBOhQILhCABBCxAxCDARDHARDRAxDUAjoOCC4QgAQQsQMQxwEQ0QM6CwguEIAEEMcBENEDOgsILhCABBCxAxCDAToFCAAQgAQ6CwguEIoFELEDEIMBOggILhCxAxCABDoFCC4QgAQ6CwgAEIoFELEDEIMBOgsILhDUAhCxAxCABDoUCC4QgAQQxwEQrwEQmAUQngUQmQU6CAgAEIoFELEDOhEILhCKBRCxAxCDARDHARDRAzoOCC4QrwEQxwEQsQMQgAQ6CAguEIAEELEDOgQIABADOgcIABCABBAKOhEILhCABBCxAxCDARDHARCvAToLCC4QgAQQxwEQrwE6EQguEIAEELEDEMcBEK8BENQCOgsILhCvARDHARCABDoGCAAQFhAeOggIABAWEB4QDzoICAAQigUQhgM6BQghEKABOgUIIRCrAjoICCEQFhAeEB06CAghEKsCEIsDOgsIIRAWEB4QHRCLA1C0EFichwFgoI0BaAFwAHgAgAGsAYgB4xiSAQUxOC4xNJgBAKABAbABALgBAw&amp;sclient=gws-wiz)   \nfor far less important concerns.   \nSo yeah. you did NOT invent this shit and a lot of people are tired of it.   \nBut yeah, good on you for defending that shit and straightening ME out. Ok?   \nI think the abject selfishness exhibited by those that think their issues and feelings are the most important thing *evar* to the detriment to the innocent community that has to use that infrastructure just to get by, tend to their families, and maintain attendance at jobs, that selfishness that denies these people that for even one single minute is where the REAL mental illness is.   \nOh yeah, and this outrage at reddit is lame AF and totally tiny violins, man.",
                                            "score": 1,
                                            "author": "unkle_FAHRTKNUCKLE"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So why didn’t we do a blackout in support of the writer’s strike that’s happening? The thing where people are actually trying to get paid fairly and feed their families. Something that directly impacts discussions on this sub.\n\nBut “wahhh I don’t like a layout” is what has us up in arms?",
            "score": -20,
            "author": "horsewitnoname",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean I don't really know why Netflix/Amazon would care if r/television went dark. This at least directly relates to Reddit.",
                    "score": 14,
                    "author": "Skavau",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reddit doesn’t care if a sub “goes dark” for two days either… \n\nMy point is one is a real issue that affects people trying to feed their kids and the other is adults whining about layouts on a free app.",
                            "score": -6,
                            "author": "horsewitnoname",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe, although blackouts have caused reddit to remove site admins before. And in this instance, it would be most major subreddits - not just r/television.\n\nBut Netflix really doesn't care if r/television goes dark and wouldn't even notice.",
                                    "score": 4,
                                    "author": "Skavau",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A site moderator didn’t impact revenue. \n\nReddit is trying to go public. They have to protect their revenue stream. This will not reverse.",
                                            "score": 2,
                                            "author": "horsewitnoname"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is a Reddit strike hurting Netflix’s revenue?",
                    "score": 3,
                    "author": "DeaconoftheStreets",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you really want to make a difference stop using Reddit until they reverse their decision.",
                            "score": 1,
                            "author": "horsewitnoname"
                        },
                        {
                            "level": 2,
                            "comment": "This isn’t a “strike” and it won’t be hurting Reddit’s revenue at all.",
                            "score": 0,
                            "author": "horsewitnoname"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because that has nothing to do with Reddit, and I can't see why anyone at say, Netflix would even notice let alone care about a subreddit going dark. That doesn't impact them in any way.",
                    "score": 2,
                    "author": "Xonra"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I fully support.",
            "score": 1,
            "author": "iphone4Suser"
        },
        {
            "level": 0,
            "comment": "obv every major sub should do this  \n\n\nedit: I don't even use reddit on my phone - but this is as wrong as it gets",
            "score": 1,
            "author": "pjhalsli1"
        },
        {
            "level": 0,
            "comment": "Good luck with this. Reddit is home to way too many people who's only purpose is posting on Reddit for internet points. They can't go more then a few minutes without posting, yet alone hours or days.",
            "score": 1,
            "author": "Suyneej"
        },
        {
            "level": 0,
            "comment": "I salute r/AttackOnTitties for participating in the blackout. 👏🏻👏🏻👏🏻",
            "score": 1,
            "author": "Jim-Lahey-Sunnyvale"
        },
        {
            "level": 0,
            "comment": "Not like the mods do anything here anyway lol",
            "score": 1,
            "author": "WikusVanDev"
        },
        {
            "level": 0,
            "comment": "Am I completely out of this loop because I use old reddit from a pc and never access from a tablet or phone?",
            "score": 1,
            "author": "JorgeXMcKie"
        },
        {
            "level": 0,
            "comment": "commenting to boost this post",
            "score": 1,
            "author": "shyguy99o"
        },
        {
            "level": 0,
            "comment": "yes ^^^ this!!!",
            "score": 1,
            "author": "shyguy99o"
        }
    ]
}