{
    "id": "141nkx6",
    "score": 161,
    "title": "‘Law &amp; Order Toronto: Criminal Intent’ Spinoff a Go",
    "author": "Chemical-Ad-2694",
    "date": 1685989695.0,
    "url": "https://www.reddit.com/r/television/comments/141nkx6",
    "media_urls": [
        "https://www.hollywoodreporter.com/tv/tv-news/law-order-toronto-criminal-intent-canada-1235507503/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\"yo fam if you could juss like turn yourself in that would be super bless\"",
            "score": 41,
            "author": "Based_Ment"
        },
        {
            "level": 0,
            "comment": "Highly doubt it'll ever capture what Vincent D'Onofrio brought to the OG Criminal Intent but hell, I'll watch this anyway even if it's getting cancelled after a season.",
            "score": 73,
            "author": "mug3n",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it's a squad with Rick Moranis and Robyn Sparkles then I'm all in.",
                    "score": 23,
                    "author": "PointOfFingers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, it will be Robin Daggers. Gritty and edgy.",
                            "score": 6,
                            "author": "Jawnwood"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You mean Detective “Immatouchallyourstuff” Goren?",
                    "score": 5,
                    "author": "wallyslambanger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NCIS: Sydney and now L&amp;O: Toronto, what's next, Chicago UK?",
            "score": 55,
            "author": "Yellow-Eyed-Demon",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it's any consolation, there was a Law &amp; Order: UK about a decade ago https://en.wikipedia.org/wiki/Law_%26_Order:_UK",
                    "score": 53,
                    "author": "Zorkel567",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There was also a Law &amp; Order Criminal Intent: Paris, where they just adapted the scripts of the first 3 seasons of Criminal Intent.",
                            "score": 11,
                            "author": "rtseel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OOOH QUI QUI",
                                    "score": 6,
                                    "author": "AustinBennettWriter"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "L&amp;O: UK was an excellent series.  They just looked at the \"best\" stories that L&amp;O did and put a britsh spin on it.   By far my favourite L&amp;O spin off to rewatch.",
                            "score": 30,
                            "author": "Kusatteiru",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Personally I liked L&amp;O LA.  It had probably what was the most stacked cast of any L&amp;O in any season.  Alana de la Garza, Corey Stoll, Alfred Molina, Terrence Howard as mains, that'll never happen again.  Thought it was a shame that it only got one season.",
                                    "score": 4,
                                    "author": "mug3n"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ya, something about that show just 'worked'. Through the whole run. \n\nNot much ramp up or ramp down. I guess doing short seasons helped.",
                                    "score": 1,
                                    "author": "Deducticon"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "911: 999",
                    "score": 24,
                    "author": "craig1818",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "911: 0118 999 881 999 119 725 3*",
                            "score": 17,
                            "author": "CharlesNapalm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; 0118 999 881 999 119 725 3*\n\n[IT Crowd S01E02](https://www.youtube.com/watch?v=HWc3WY3fuZU).",
                                    "score": 1,
                                    "author": "throw0101a"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Chicago UK\n\nChuckled out loud at this one. Never seen an episode of any of them, but I do enjoy referring to the franchise as the \"Chicago Cinematic Universe\" whenever I see an ad for one of them.",
                    "score": 7,
                    "author": "1Land_1Keep"
                },
                {
                    "level": 1,
                    "comment": "There's an Aussie NCIS now? Wild.",
                    "score": 1,
                    "author": "CrabsolutelyBullshit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm waiting for scenes of the detectives in line at a Tim Hortons.\n\nOr whatever detectives are called in Toronto since it varies wildly across Canada, with RCMP using their Inspectors for some reason that I have no idea what the fuck they do since i've only ever talked to one in my life and his job tasks were classified.",
            "score": 29,
            "author": "Delicious-Tachyons",
            "replies": [
                {
                    "level": 1,
                    "comment": "According to the [Toronto Police](https://www.tps.ca/organizational-chart/specialized-operations-command/detective-operations/investigative-services/homicide/current-investigations/) website, Homicide Investigators appears to be their official title, although this falls under the Detective umbrella, along with all other criminal investigations.",
                    "score": 12,
                    "author": "Varekai79",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "canada is a little different from the US in that they have one federal police agency that handles all federal law enforcement duties, where agencies gain a legal mandate over specific sections of the law, like the mail, or drugs, or taxes, and extends that to also not making a distinction from a national detective agency (like the FBI) and a national police force (hence why many RCMPs are strictly patrol cops)",
                            "score": 2,
                            "author": "clain4671",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the real reason that a lot of RCMP are patrol cops is because they function as local police in small communities that don't have local police, and as provincial police in every province except Ontario and Quebec.",
                                    "score": 7,
                                    "author": "sndhllcrn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "its not just smaller communities there are bigger places that still use them",
                                            "score": 1,
                                            "author": "mike10dude"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In case that wasn’t a random non-question:\n\nWhere there are local policing agencies (say OPP and Toronto) the RCMP are still there for federal policing duties.\n\nThe broad Federal Policing mandate is to:\n\n- Enforce federal laws, secure Canada’s borders between ports of entry, collect criminal intelligence, and ensure the safety of critical infrastructure, internationally protected persons and other designated persons;\n- Investigate serious and organized crime, financial crime and criminal activity related to national security;\n- Conduct international law enforcement capacity-building, support Canadian international peace operations and advance domestic police operations through enhanced visibility, reach and influence abroad.\n\n&gt; O Division resources are optimally placed for successful and efficient delivery of our operations and services, which are categorized into five distinct areas: Financial Crime, Serious and Organized Crime, Cybercrime, National Security, and Protective Policing.\n\nSo if they do a show in Toronto, they’ll probably ignore all of that and pretend it’s just like NY.",
                    "score": 4,
                    "author": "MadDjinn"
                },
                {
                    "level": 1,
                    "comment": "I would like all the cops to be wearing Dudley Do-right Mountie uniforms and all the judges to wear horsehair wigs.",
                    "score": 1,
                    "author": "atomkidd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It'll be nice to see a show filmed in Toronto that is actually set in Toronto. Plus lawyers wearing robes in court!",
            "score": 50,
            "author": "Varekai79",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe they'll film it in Hamilton and/or Mississauga",
                    "score": 12,
                    "author": "NoCleverIDName",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Star Trek: Strange New Worlds is filmed mostly in Mississauga, which I always find amusing.",
                            "score": 3,
                            "author": "Varekai79",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well that world is strange and relatively new",
                                    "score": 4,
                                    "author": "Quartzcat42"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was Orphan Black shot in Toronto?",
                    "score": 11,
                    "author": "Not_Cleaver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, that's one of them!",
                            "score": 5,
                            "author": "Varekai79"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Flashpoint was pretty much this and is fantastic if you haven't seen it.",
                    "score": 18,
                    "author": "LORD_PUNN87",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For those of you of a certain age, Flashpoint co-stars Amy Jo Johnson and sometimes she's in her underwear.\n\nYou're welcome.",
                            "score": 9,
                            "author": "radda",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah the pink ranger",
                                    "score": 2,
                                    "author": "gendabenda"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is this still on any streaming services in US? I'd love to be able to watch it again",
                            "score": 2,
                            "author": "orangemaroon25"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think there’s a rule against filming where the show is based, this will be filmed in Australia. /s",
                    "score": 12,
                    "author": "cptho"
                },
                {
                    "level": 1,
                    "comment": "An older one to check out would be \"Forever Knight\"",
                    "score": 3,
                    "author": "MulciberTenebras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Expanse and Handsmaid Tale are also from Toronto.",
                            "score": 5,
                            "author": "IamRasters"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As long as it isn’t Vancouver I’m happy.",
                    "score": 2,
                    "author": "bluebottled"
                }
            ]
        },
        {
            "level": 0,
            "comment": "L&amp;O: Paid Suspension Unit",
            "score": 23,
            "author": "mybadalternate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Might actually be interesting. Every episode the investigate an officer involved in a situation or facing an accusation, watching every step of the process with us not finding out if their guilty or not until near the end (or maybe not at all, to let us make our own minds).\n\nDone right it could be really good. But it will probably never happen.",
                    "score": 7,
                    "author": "MGD109",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Each episode spans the three to fifteen years of the “investigation” before they declare no wrongdoing.",
                            "score": 11,
                            "author": "mybadalternate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course, we're just have the cast wear make up for those scenes. Save on hiring to many actors.",
                                    "score": 3,
                                    "author": "MGD109"
                                },
                                {
                                    "level": 3,
                                    "comment": "to be fair, this is what an accurate timespan of any cop show would look like. these guys will stumble into a complex fraud scheme and have a full jury trial over a couple days!",
                                    "score": 3,
                                    "author": "clain4671"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Toronto police, how are you now?”\n\n“Good ‘n you?”\n\n“Not so bad. Can you tell me where you were last Friday night ‘round 9?”\n\n“Christ, give your balls a tug officer.”\n\n“Hard no.”\n\ndun dun",
            "score": 41,
            "author": "Pvt_Wierzbowski",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my experience with calling Toronto police, they just don't show up, so there isn't any conversation at all.",
                    "score": 16,
                    "author": "TuvixWillNotBeMissed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unlike the Ottawa PD, they actually showed up to turn away/arrest the terrorist convoy when they tried to start shit in Toronto.",
                            "score": 1,
                            "author": "MulciberTenebras",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Buddy, you're just not mentally equipped to even have this conversation.",
                                            "score": 0,
                                            "author": "triangulumnova",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean he's not wrong, they're annoying as fuck but to call them terrorists is just incorrect.",
                                                    "score": 0,
                                                    "author": "LovingTurtle69"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would love  criminal Intent to come back, and Vincent has been wanting one for years. It was my favorite Law and Order.",
            "score": 12,
            "author": "BitterEditor22",
            "replies": [
                {
                    "level": 1,
                    "comment": "We need a crossover episode with Letterkenny.",
                    "score": 2,
                    "author": "grenamier"
                },
                {
                    "level": 1,
                    "comment": "I have always thought the way to bring back OG Law and Order Criminal Intent is to have a one season arc where Goran becomes a bit of a Dexter. Kind of like his old mentor, or Nicole. Have Eames and Jeff Goldblume slowly realize over a season long arc that Goran snapped.",
                    "score": 1,
                    "author": "Dangerous_Nitwit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So who’s writing this? What an odd announcement amongst a strike.",
            "score": 4,
            "author": "LiveStreamRevolution",
            "replies": [
                {
                    "level": 1,
                    "comment": "its a Canadian show probably has a different union",
                    "score": 8,
                    "author": "mike10dude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This will depend entirely on who they cast as the lead, since Criminal Intent is just a showcase for a ham.",
            "score": 8,
            "author": "staedtler2018",
            "replies": [
                {
                    "level": 1,
                    "comment": "Enrico Colantoni as his Flashpoint character after leaving command of the field team",
                    "score": 8,
                    "author": "orangemaroon25",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Better yet, just have a Flashpoint sequel series where he's now the top banana. That show is incredibly underrated.",
                            "score": 3,
                            "author": "hankjmoody",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man I miss Flashpoint.  Probably one of the best police shows that Canada has ever produced.",
                                    "score": 2,
                                    "author": "mug3n",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Only similar programs I'd put above, or on par with it, were *19-2* (fucking miles above in terms of quality) and *Motive*, which was a neat new take on the *Columbo* style of mystery storytelling (show the crime and perp first, then use the episode to show how they're caught).",
                                            "score": 1,
                                            "author": "hankjmoody"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "as much as I like it, he was like a SWAT commander. how does he become a detective and likely a high ranking one?",
                            "score": 2,
                            "author": "intecknicolour",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Make him the Lieutenant/Captain/whatever the Cragen character from L&amp;O is.",
                                    "score": 1,
                                    "author": "orangemaroon25"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Henry Czerny was born to be one of the lawyers on this show.",
                    "score": 3,
                    "author": "Varekai79"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wonder if they’ll just repurpose/adapt scripts from all the L&amp;O shows like L&amp;O: UK did?",
            "score": 3,
            "author": "dww75",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, *Criminal Intent* in the US was a little different than the flagship and *SVU*.  It's possible that they could re-use scripts from *L&amp;O:CI* since it's been so long since it's been on...",
                    "score": 4,
                    "author": "AmnesiaInnocent"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want to live long enough for \"Law And Order San Antonio: Cholo Intent\"",
            "score": 3,
            "author": "otcconan"
        },
        {
            "level": 0,
            "comment": "I’m sorry",
            "score": 3,
            "author": "never_stirred"
        },
        {
            "level": 0,
            "comment": "Benson: Shooting?\n\nStabler: No, sorry, this is Canada.\n\nBenson: Health insurance fraud?\n\nStabler: No, sorry, this is Canada. \n\nBenson: What then?\n\nStabler: Some sicko bastard on Yonge Street is shorting customers on Timbits.",
            "score": 9,
            "author": "44035"
        },
        {
            "level": 0,
            "comment": "Wonder if they’ll just repurpose/adapt scripts from all the L&amp;O shows like L&amp;O: UK did?",
            "score": 6,
            "author": "dww75",
            "replies": [
                {
                    "level": 1,
                    "comment": "Toronto does have plenty of its high profile cases too that they could adapt. There was a wacky gold robbery at the airport a couple months back. A few years ago, a very high profile millionaire and his wife were murdered in their home and the case is still unsolved with no good leads.",
                    "score": 14,
                    "author": "Varekai79",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know it was in Quebec, but I’d watch a 2-parter of their take on the Maple Syrup Heist",
                            "score": 5,
                            "author": "SamuelTurn"
                        },
                        {
                            "level": 2,
                            "comment": "Oh no, they're going to do the killer who put victims in potted plants.",
                            "score": 4,
                            "author": "Deducticon"
                        },
                        {
                            "level": 2,
                            "comment": "Pearson not Bishop right?",
                            "score": 1,
                            "author": "comped",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, Pearson. Looked like an inside job and something straight out of a movie or something.",
                                    "score": 3,
                                    "author": "Varekai79"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this for the Canadian market or will it store in the US too?",
            "score": 2,
            "author": "8i66ie5ma115"
        },
        {
            "level": 0,
            "comment": "I used to enjoy the Law and Order series till I found out just how bad they are. They really present a badly skewed view of reality. I'll pass.",
            "score": 2,
            "author": "MasterOdd"
        },
        {
            "level": 0,
            "comment": "heh, do Law &amp; Order Quebec",
            "score": 2,
            "author": "Sil369"
        },
        {
            "level": 0,
            "comment": "We're back in the 2000s again where the three main Law and Order shows were airing. Strange timeline to be in, when both the original Law and Order and now Criminal Intent get revived after a decade off the air.",
            "score": 2,
            "author": "mcfluffy0451"
        },
        {
            "level": 0,
            "comment": "Toronto? Really?\n\nThe whole system is different in Canada, I wonder if this show will still work the same way.",
            "score": 3,
            "author": "orangemaroon25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Canadian writers aren't on strike so they have that going for them.",
                    "score": 9,
                    "author": "PointOfFingers"
                },
                {
                    "level": 1,
                    "comment": "Closer to UK and that L&amp;O show worked.",
                    "score": 3,
                    "author": "Deducticon"
                },
                {
                    "level": 1,
                    "comment": "Well murder is illegal here too so I think it'll be just fine.",
                    "score": 6,
                    "author": "TuvixWillNotBeMissed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Source?",
                            "score": 2,
                            "author": "VitaminTea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://laws-lois.justice.gc.ca/eng/acts/C-46/section-222.html",
                                    "score": 3,
                                    "author": "TuvixWillNotBeMissed"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's closer to the UK, but neither system is that different than the US. It's not like France or Thailand, or Japan, which all have fairly baffling criminal justice systems.",
                    "score": 2,
                    "author": "Abba_Fiskbullar"
                },
                {
                    "level": 1,
                    "comment": "It worked in France for 3 seasons, with an even more different criminal system.",
                    "score": 1,
                    "author": "rtseel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stabler's Inquest",
            "score": 3,
            "author": "grandmofftalkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad I’m not the only one who remembers DaVinci’s Inquest. Great show!",
                    "score": 2,
                    "author": "ethan-bubblegum-tate"
                },
                {
                    "level": 1,
                    "comment": "Stabler was never on L&amp;O:CI.",
                    "score": 1,
                    "author": "qtx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey sorry buddy- Hope you don’t intend to criminalize that wall with some graffiti.",
            "score": 2,
            "author": "mrbrick"
        },
        {
            "level": 0,
            "comment": "Jesus Christ are people not tired of these police propaganda shows",
            "score": -7,
            "author": "MasterTeacher123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kinda hilarious considering how much alt right trolls hate Law and Order and ESPECIALLY  Svu. \n\nPlease don’t comment on things you have no idea about lol",
                    "score": -2,
                    "author": "QueasyStress0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How long until The CW picks this up?",
            "score": 1,
            "author": "DCAbloob",
            "replies": [
                {
                    "level": 1,
                    "comment": "peacock or usa network might be more likely",
                    "score": 2,
                    "author": "rcasiothroaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was just making a joking reference to The CW’s recent penchant for picking up Canadian shows to fill out its lineup. I don’t expect The CW to actually pick up this program.",
                            "score": 1,
                            "author": "DCAbloob"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's next, Law &amp; Order: NCIS: Monowi: Special Victim Unit?",
            "score": 1,
            "author": "Maleficent-Relation5"
        },
        {
            "level": 0,
            "comment": "I, for one, am excited to see Toronto mans show up on TV, so people that aren't from Toronto, London or the Caribbean can be utterly confused by the slang",
            "score": 1,
            "author": "ipeefreeli"
        },
        {
            "level": 0,
            "comment": "Really hoping they lean into the Canadianness of it all and make a ton of maple syrup quips.",
            "score": 0,
            "author": "christinasays"
        },
        {
            "level": 0,
            "comment": "I want an internal affairs police procedural. We already have too many copaganda shows:\n\n* https://en.wikipedia.org/wiki/Copaganda",
            "score": -5,
            "author": "throw0101a",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was The Wire copaganda?",
                    "score": 1,
                    "author": "Deducticon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Apparently Justified would fall under that umbrella and if it means we don't get shows like that then this guy can fuck himself",
                            "score": 1,
                            "author": "LovingTurtle69"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First episode, who stole the maple syrup",
            "score": 0,
            "author": "henningknows",
            "replies": [
                {
                    "level": 1,
                    "comment": "In case you didn't know. That was a real heist.",
                    "score": 4,
                    "author": "Deducticon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Police- did you do it? Perp - Oh yeah, SAH-ree bud. Police - oh yeah, but did you do it bud?",
            "score": 0,
            "author": "aymichie"
        },
        {
            "level": 0,
            "comment": "Like people are gonna believe there is crime in Canada.",
            "score": -7,
            "author": "WeDriftEternal",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean according to Murdoch Mysteries, there was a murder every week in 1890s Toronto. Surely it's more than double that now!",
                    "score": 5,
                    "author": "bravetailor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh no, you just got that obnoxious opening music stuck in my head",
                            "score": 1,
                            "author": "STRIpEdBill"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want it based entirely off cases found on the ScanBC twitter account",
            "score": 1,
            "author": "MyRottingBrain"
        },
        {
            "level": 0,
            "comment": "I don’t know how he qualified to be a lawyer not to talk of SAN .. something is not right",
            "score": 1,
            "author": "Alannot"
        },
        {
            "level": 0,
            "comment": "Atiku isn't a presidential material has no credibility, but he's right to call Keyamo's law degree \"useless\", cos Keyamo doesn't talk or bahave like one with a law degree, he's not representing lawyers well. Honestly speaking, it's embarrassing at this point. No offense.",
            "score": 1,
            "author": "Amielda"
        },
        {
            "level": 0,
            "comment": "It looks like someone stole a doughnut",
            "score": 1,
            "author": "wolfiepraetor"
        },
        {
            "level": 0,
            "comment": "Can't wait for \"Law &amp; Order Toronto: Criminal Intent: SVU\"",
            "score": 1,
            "author": "GaryTheCabalGuy"
        },
        {
            "level": 0,
            "comment": "Oh f yeah spread it",
            "score": 1,
            "author": "rundmz8668"
        },
        {
            "level": 0,
            "comment": "What the… how many words do we need?",
            "score": 1,
            "author": "CatsLikeCuddles"
        },
        {
            "level": 0,
            "comment": "The suspect will be wearing a Roughriders jersey. Last seen on Boxing Day, fleeing a Tim Hortons in an Acura EL.",
            "score": 1,
            "author": "ethan-bubblegum-tate"
        },
        {
            "level": 0,
            "comment": "Still stocks me this show is a thing.\nI watched reruns of the first two, maybe three seasons and I don't know why people kept going after Stone left.\n\nFew characters are more perfectly executed.",
            "score": 1,
            "author": "Steupz"
        },
        {
            "level": 0,
            "comment": "I wonder how many episodes a season they are going to do. There were 27 murders in the city of Toronto last year.",
            "score": 1,
            "author": "ishtar_the_move"
        },
        {
            "level": 0,
            "comment": "There's crime in Toronto?",
            "score": -2,
            "author": "Chuck006"
        },
        {
            "level": 0,
            "comment": "This is Fargo lite",
            "score": -1,
            "author": "mitchlhoover"
        },
        {
            "level": 0,
            "comment": "NOOOOO..........no more Law &amp; Order spin offs please! Stop cheapening the franchise and come up with something new for a change.",
            "score": -1,
            "author": "Century22nd",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a new system of laws. Like the UK show was.",
                    "score": 2,
                    "author": "Deducticon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought the Canadians were supposed to be nice.",
            "score": -1,
            "author": "AustinBennettWriter"
        },
        {
            "level": 0,
            "comment": "Trash tv",
            "score": -1,
            "author": "ZootedFlaybish"
        },
        {
            "level": 0,
            "comment": "Wonder if they’ll just repurpose/adapt scripts from all the L&amp;O shows like L&amp;O: UK did?",
            "score": 0,
            "author": "dww75"
        },
        {
            "level": 0,
            "comment": "“Malhuney why are you late “ \n\n“ don’t be a hoser there eh , line at Timmies was out to the road ya know and the debit machine was down too , had to drive to an atm first to get my morning coffee”",
            "score": 0,
            "author": "Omnizoom"
        },
        {
            "level": 0,
            "comment": "Nothing happens in Canada.",
            "score": 0,
            "author": "mikeweasy"
        },
        {
            "level": 0,
            "comment": "Mike Myers gonna be in it right? The guy doesn't stop talking about Toronto",
            "score": 0,
            "author": "anasui1"
        }
    ]
}