{
    "id": "141uh55",
    "score": 53,
    "title": "‘Extreme Makeover: Home Edition’ Reboot In The Works At ABC With The Home Edit Stars Clea Shearer and Joanna Teplin",
    "author": "marvinocjr14",
    "date": 1686004551.0,
    "url": "https://www.reddit.com/r/television/comments/141uh55",
    "media_urls": [
        "https://deadline.com/2023/06/extreme-makeover-home-edition-reboot-in-works-at-abc-the-home-edit-1235408883/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I just hope they make sure the family can pay for the eventual property taxes long-term.",
            "score": 86,
            "author": "Greedy_Switch_6991",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did they not do that with the original? I always wondered how the families were doing 5-10 years after the show",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, they did pay off a lot of stuff, including college for the kids, and left them with financial advisors. Some couldn't afford to keep the new homes, though, especially when the recession hit.",
                            "score": 26,
                            "author": "Greedy_Switch_6991",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A family near me had their home redone. They were living in a small shack- I swear it was a 2 bed 1 bath for 4 kids &amp; parents. Their new home was massive. Gorgeous new place with a room for each kid. The only issue: the family now had to cover utilities for a much larger home.\n\nLighting &amp; Heating a 5 bedroom home is muuuuuch more than a 2 bed. On top of that, their property taxes also increased tenfold. They sold a few years after the makeover- A) because of the increased expenses, and B) their daughter passed of cancer, and they felt as though staying in the house was preventing their ability to grieve &amp; move on.",
                                    "score": 27,
                                    "author": "Tlr321",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That sounds terrible. I'm sorry to hear that.",
                                            "score": 11,
                                            "author": "Greedy_Switch_6991"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Young and dumb here. Why does improving your house increase property tax? Square footage or something? I thought it would be based on lot size",
                                            "score": 3,
                                            "author": "CoochieSnotSlurper",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Property tax is based on an assessed value of your home &amp; property. If your value goes up, as does your tax. Some municipalities have rules on a flat percentage. My city says 1% of total assessed value. Others have a certain amount per $1,000. The city I just moved from had a rate of $17ish per $1,000 of assessed property value.\n\nA lot of folks on this show had very small, bare bones homes, and were gifted massive McMansion style homes. While it’s certainly nice that they have a much nicer home to live in, their property is now worth a hell of a lot more in the eyes of the state.",
                                                    "score": 6,
                                                    "author": "Tlr321",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Municipality sends a property assessor to evaluate your house?",
                                                            "score": 1,
                                                            "author": "NoPriorThreat",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Occasionally. I think it’s every few years or so; but as far as I know, legally, they can’t go inside or in your back yard. So the assessment tends to be via front of the house or with something like Google Earth.",
                                                                    "score": 3,
                                                                    "author": "Tlr321",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Havent had that happen to me, not sure what the laws in my city are, or if they even do that. What I do know is my house is roughly 40% more expensive according to Zillow, and I’m pretty sure they gather that information based on other houses that have sold in my area. If my house is officially reassessed I might be priced out of my neighborhood lol no wonder everyone here is double income no kids, or old people who have lived here for 40 years",
                                                                            "score": 1,
                                                                            "author": "Fudge89",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I think it’s a lot harder if the upgrades are “stealthy.” \n\nMy step dad has been slowly remodeling his home over the last 5 years. It looks largely the same from the front yard &amp; outside as it did 20 years ago. Now inside, it’s much nicer &amp; he’s done a lot of upgrades- finished the basement, gutted &amp; remodeled the kitchen, new floors, central AC, new heating system. But, the only thing you’d be able to tell from the front &amp; outside is a new roof &amp; solar panels. \n\nThis, plus the fact that he’s been the only owner of it since the 90s, it’s extremely hard to tell. It really helps that he doesn’t live in a super nice area. It’s not unsafe, but it’s a block away from a freeway, behind a grocery store, and the schools aren’t very good. He doesn’t plan on selling, so he’s sitting happy. I’m sure if he does sell, he’d probably get double or triple what he payed for the home.",
                                                                                    "score": 2,
                                                                                    "author": "Tlr321"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yup , but when they ask if they can come inside you tell them to fuck off",
                                                                    "score": 2,
                                                                    "author": "G0PACKGO"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They did not.",
                            "score": 2,
                            "author": "FlamingTrollz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And also that they don't excessively theme the bedrooms around children's hobbies. There's that joke that's like \"We heard you liked horses, so we designed your bedroom to look like a stable and we're going to pay for surgery for you to BECOME A HORSE\".\n\nI like the idea of charitably building new houses for people in need, but it was absolutely insane what they did on the original - just these fucking MANSIONS. Like, if you already have to work two jobs alongside your husband who works three jobs in order to afford to keep your 5 disabled children living in a shack, how exactly are you going to find the time to clean the 20-room mansion that they built, let alone find a way to pay for the increased heating/cooling/electric costs? \n\nI saw one episode a bit ago where the overall size and layout of the house was basically fine, the only real problem was that the construction was terrible and moldy and rotting away. So those people would've been fine with basically the exact same house blueprints, just built better, but no they get a gigantic-ass house.",
                    "score": 7,
                    "author": "OneGoodRib",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "IIRC, in the first season, they did renovations not the unholy love child of a British country estate and American enthusiasm.",
                            "score": 2,
                            "author": "Nadamir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're right--in the earlier episodes, the renovations were much more grounded.",
                                    "score": 1,
                                    "author": "CryptidGrimnoir"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully the new families [keep their kids](https://nypost.com/2016/11/16/foster-kids-say-couple-ditched-them-after-getting-extreme-makeover-digs/) after getting the makeovers",
            "score": 18,
            "author": "Kogie13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol that’s f’d up. Article is seven years old. Makes me want to do a little digging to see if there’s a follow up.",
                    "score": 4,
                    "author": "envision83"
                },
                {
                    "level": 1,
                    "comment": "I feel so bad that I laughed, but the first line of that article got me.",
                    "score": 1,
                    "author": "Fudge89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll only watch if the Philly crew is in charge 😉\nGood morning Juarez family!!!",
            "score": 22,
            "author": "veddhead83"
        },
        {
            "level": 0,
            "comment": "I'm here for it, I like how outlandish some of the things they did were.",
            "score": 14,
            "author": "WordsAreSomething",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! Also, the kid in me is screaming because I remember watching this ALL the time as a kid. I’d love to watch this, and wipeout especially in the Christmas/Halloween seasons after school when commercials were still fun.\n\nI hope they keep the formula super intact to the OG. The HGTV one just didn’t do it for me. But I have faith in ABC!",
                    "score": 11,
                    "author": "marvinocjr14"
                },
                {
                    "level": 1,
                    "comment": "They should just go full pimp my ride crazy. Oh you like cotton candy? Well here's a room full of cotton candy. We're talking cotton candy machine in the middle and walls made of nothing but cotton candy, with a clown hiding in the cotton candy mountain that will pop out at night to offer you more cotton candy",
                    "score": 5,
                    "author": "AmeriToast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dig up a show called Monster House where they do just that",
                            "score": 1,
                            "author": "coyotezamora",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for this. I didn't know about it, already on the fourth episode lol. They have all the episodes on YouTube.",
                                    "score": 1,
                                    "author": "AmeriToast"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Building mansions for struggling families was near-sighted at best, and it was detrimental in some cases. \n\nAdditionally, I can’t help but wonder how this show would fare in a time where most people are struggling with *rent* hikes. A charitable effort that focuses on homeowners seems like a non-starter today but that’s just speculation.\n\nI don’t want to discourage charity but this seems like a weird choice for a reboot, that show was notoriously problematic.",
            "score": 2,
            "author": "bizzaro321"
        },
        {
            "level": 0,
            "comment": "I’d watch if the original crew came back just for nostalgia reasons",
            "score": 8,
            "author": "PleaseHurryIHave2Pee"
        },
        {
            "level": 0,
            "comment": "As long as it’s not one long commercial for the products they use, it’s a good idea. If they start where they left off, don’t bother. It turned into a product placement infomercial at the end.",
            "score": 7,
            "author": "LPthewise",
            "replies": [
                {
                    "level": 1,
                    "comment": "Extreme Makeover: Home ^(Depot) Edition",
                    "score": 8,
                    "author": "ilikemycoffeealatte"
                },
                {
                    "level": 1,
                    "comment": "Those product placements are how the show works. The production company isn't just going to spend hundreds of thousands of dollars building per episode to build a new house. The cost gets offset, probably not completely but mostly, by getting materials and labor in exchange for product placement.",
                    "score": 2,
                    "author": "HotsauceMcGuyver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure, we all know that though. Commercials already get roughly 1/3rd of the hour long slot. Let’s not pretend this is a charity based show either, sure the family gets a hell of a house, but the network still makes money off their often tragic story even after “giving” them a new house.",
                            "score": 2,
                            "author": "LPthewise"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's 1000% going to be that. The question is are they going to advertise their Walmart or their more expensive Container Store line?",
                    "score": 1,
                    "author": "IronicSunshine83"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Bring back Monster House](https://youtu.be/V7gPweNbmCY?t=2835)",
            "score": 3,
            "author": "Beaver420"
        },
        {
            "level": 0,
            "comment": "Are they going to bring back the psychological torture?",
            "score": 3,
            "author": "40WAPSun"
        },
        {
            "level": 0,
            "comment": "They better have Ty Pennington or it’s a nope for me.\n\nNo? Hmmm.\n\nLooks up Home Edit’s Clea Shearer and Joanna Teplin…\n\nEw. No. Absolutely not.",
            "score": 3,
            "author": "FlamingTrollz"
        },
        {
            "level": 0,
            "comment": "They're going to move so much clear plastic at Walmart!\n\nKidding but not really. I would kill to submit my family back home for this.",
            "score": 2,
            "author": "IronicSunshine83"
        },
        {
            "level": 0,
            "comment": "Oh goody. I was just thinking about how there aren’t enough poor people in foreclosure.",
            "score": 1,
            "author": "weed-n64"
        },
        {
            "level": 0,
            "comment": "Change the premise of the show towards housing less fortunate people - that’s a show worth watching!",
            "score": 1,
            "author": "PooCutterz"
        },
        {
            "level": 0,
            "comment": "Oh great let’s bring in the people who organize things by color for instagram photos but have zero functional value… \n\nThe home edit core values are good but their execution is dumb.",
            "score": 1,
            "author": "weatherbeknown"
        },
        {
            "level": 0,
            "comment": "I appreciate the well meaning of this show, however, there was one of these done in central Indiana when I was barely a teenager and the family that was being gifted the makeover hid all of their Harley’s and shit like that in an effort to not look too fortunate and undeserving of the makeover. Ever since I heard that I looked at not only the family, but the show as well differently",
            "score": 1,
            "author": "2x4caster"
        },
        {
            "level": 0,
            "comment": "My cousins were on this show. Here's a link to their episode\n\nhttps://www.youtube.com/watch?v=KhNzUB8lbHY",
            "score": 1,
            "author": "coyotezamora"
        },
        {
            "level": 0,
            "comment": "Yes, I loved watching this when I was younger. Hopefully it comes to the UK 🇬🇧 via Netflix or otherwise so I can watch it as well.",
            "score": 1,
            "author": "Soulburn79"
        }
    ]
}