{
    "id": "142mf2f",
    "score": 159,
    "title": "‘Sleepy Hollow’ Created an “Us Against Her” Environment for Star Nicole Beharie, ‘Burn It Down’ Book Claims",
    "author": "verissimoallan",
    "date": 1686071094.0,
    "url": "https://www.reddit.com/r/television/comments/142mf2f",
    "media_urls": [
        "https://www.hollywoodreporter.com/tv/tv-news/sleepy-hollow-set-hellish-nicole-beharie-burn-it-down-1235508051/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "that show really did fall apart with season 2. was a shame.",
            "score": 161,
            "author": "urgasmic",
            "replies": [
                {
                    "level": 1,
                    "comment": "The show was so utterly ridiculous yet they made it work in Season 1. It's pretty remarkable how badly they fumbled after that &amp; still managed another two seasons.",
                    "score": 102,
                    "author": "KneeHighMischief",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Season 1 worked because it was a fun time-traveling \"fish-out-of-water\" story.  I think if they'd continued to maintain that as the focus, the show could have been a fun, but dumb, show that kept audiences enthralled.  The best parts of Sleepy Hollow were the moments where Abbie introduced some piece of modern culture to Ichabod and he interacted with it.  A particularly memorable scene from the first season was when Ichabod goes on the tour and keeps correcting the tour guide.  But after season two, it was such a bizarre twist where Ichabod and Abbie have to go war with his son, and then it just spiraled after that.  They focused too much on the lore, which to be honest, wasn't that compelling.",
                            "score": 33,
                            "author": "Maelstrom52",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I remember a scene where Ichabod is talking to the Onstar lady about how he loved and lost Katrina? Simultaneously touching and funny.",
                                    "score": 9,
                                    "author": "minneapple79"
                                },
                                {
                                    "level": 3,
                                    "comment": "I remember a scene where he was trying to open a gadget or something in a hard plastic package and he got pissed off and said “what is this impenetrable barrier”. Still randomly say that whenever I’m opening something! Miss that show",
                                    "score": 11,
                                    "author": "Lord_Rooster"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Season 1 being good was probably just dumb luck. The biggest mistake in season 2 was how they handled the headless horseman. He was a very memorable villain in season 1. In season 2, they decided to humanize him. Which wouldn't necessarily be bad if he were at least cool or interesting as a human. But he wasn't. He was a bland and milquetoast character, with a lame motivation.\n\nThey also drastically cut down the roles of certain characters (like Orlando Jones' character), and introduced some new guy no one liked. Ichabod's wife kind of got shafted too.\n\nI never finished the show.",
                            "score": 95,
                            "author": "Turqoise-Planet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I think your well on the money.\n\nIn season one the Headless horseman was an unstoppable nightmarish horror, that whenever he appeared it was a sign things had gotten really bad and lot of people were about to die.\n\nIn season two he was just a miserable lovestuck teenager pinning after a woman who clearly wasn't interested in him and couldn't accomplish anything.\n\nI did actually watch the series to the end, but its telling that later seasons tried their absolute best to pretend season two's characterisation never happened.\n\n&gt;  Ichabod's wife kind of got shafted too.\n\nOh that was really annoying. After all the build up, the two rarely interacted in season two. And she got virtually no development or impressive moments (despite being built up as a powerful witch), until the very end when the writers realised they had no idea what to do with her, so they had her randomly turn evil then die and get forgotten about.\n\nSo you not only downplayed fan favourites in front of someone else, but you also made it so despite all their screen time, they're was virtually no reason to care about her.\n\nI really want to know how they got season two so wrong.",
                                    "score": 32,
                                    "author": "MGD109"
                                },
                                {
                                    "level": 3,
                                    "comment": "Dumb luck and the leads chemistry. They were seriously awesome together.",
                                    "score": 9,
                                    "author": "Tatis_Chief"
                                },
                                {
                                    "level": 3,
                                    "comment": "Article does mention the switch up in the writers room, which actually would explain so much. Season 1 had a more diverse room, Season 2 legit was all white guys. Season 1 seemed more willing to swing into the crazy, which easily could be explained be a more diverse room with a lot more to prove. Season 2 went back to standard TV tropes, which did not mesh well with the foundation laid\n\nNo matter what your personal opinions on diversity initiatives may be, broad perspectives help keep things interesting. Narrowing that was likely a mistake",
                                    "score": 47,
                                    "author": "whichwitch9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But every character got shafted, specially the very white witch.",
                                            "score": 12,
                                            "author": "Thomas_JCG",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Diversity is more than just character writing- different perspectives add layers and help find different angles to write from. You want a variety of writers- not necessarily just marginalized groups, but at least coming from different backgrounds and experiences; that's how you avoid falling into old, tired tropes like it seemed season 2 seemed to do. They couldn't just let the boogeyman be the boogeyman- he had to have a sympathetic backstory, for example, something you see a lot in TV. Add in minority writers have more of a reason right now to take risks and distinguish themselves, and you really have a better room by making sure you have different backgrounds and experiences. Finding something unique is how you create a show people remember, and that first season really had that magic. The second season seems like it replaced them with more \"experienced\" writers- which meant a bunch of similar guys retreading what they had experienced as working in the past, not thinking outside the box. At least, that's what the end product suggested",
                                                    "score": 19,
                                                    "author": "whichwitch9",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is SO true! The more diversity, the more perspectives, the more life experiences—-&gt; better jokes, better drama, better character development….",
                                                            "score": 7,
                                                            "author": "makeitmorenordicnoir"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Well with her, I get the feeling it was simply the writers honestly had no idea what to do with her.\n\nDespite appearing quite a bit more, she honestly contributed less when free than she did whilst she was imprisoned.",
                                                    "score": 12,
                                                    "author": "MGD109"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It had three seasons after that - it had a reboot season in DC with Jeremy Davies",
                            "score": 1,
                            "author": "bros402"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Season 1 finale was legit one of the best cliffhangers I've seen. The disappointment that followed was truly immesurable and ruined not just my day, but the whole series.",
                    "score": 23,
                    "author": "Thomas_JCG"
                },
                {
                    "level": 1,
                    "comment": "The thing I can never get over was this show had a crossover with Bones.",
                    "score": 11,
                    "author": "PutMindless6789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It made it so Bones existed in a world with a hologram of Thomas Jefferson and magic, which made it hilarious",
                            "score": 7,
                            "author": "bros402",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My mother was a huge fan of Bones and she found Hodgkin's antics about ghosts and big foot really funny after watching the crossover, because they all treat him like an idiot, but he is right. Monsters and ghosts are real. Hilarious.",
                                    "score": 7,
                                    "author": "PutMindless6789",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yuuuup.",
                                            "score": 2,
                                            "author": "bros402"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Such a shame. That show started off so good, it could have been great.\n\nIts a real shame how badly Nicole Beharie's career has gone since she left.\n\nI hope she finds another role that lets her put all this behind her.",
            "score": 42,
            "author": "MGD109",
            "replies": [
                {
                    "level": 1,
                    "comment": "She has been a bit more active since 2019, and has appeared in couple shows and indie movies.",
                    "score": 26,
                    "author": "Neo2199",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah that's good to hear. Hopefully things are getting back on track then.",
                            "score": 15,
                            "author": "MGD109"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn't even bother to watch season 3 when they moved  out of Sleepy Hollow\n\nAlso, that crossover with Bones was just weird",
            "score": 26,
            "author": "singleguy79",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was actually season 4. Ironically it was probably the best season they did since season 1 (although that was mostly cause it felt like a different show that just happened to have a few of the same characters), but it still wasn't as good as it had been and yeah completely understandable after how season three went.\n\nAnd yeah that was really weird. Of all the shows to crossover with, why that one?",
                    "score": 10,
                    "author": "MGD109"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When the show debuted, the freshness and originality were striking, and the tapping into U.S. history was new. (They made Benjamin Franklin an insufferable know-it-all, and that was always worth a laugh). The thorniness of the leads and their differences in height and their  differences in acting styles all added to keeping the show wonderfully off-kilter in the first season. \n\nWe have seen and heard this sort of thing before. In Moonlighting, with Shepherd &amp; Willis, in Remington Steele, with Zimbalist &amp; Brosnan, and on X Files with Anderson and Duchovny, the tensions between the leads pulling off an hourlong show week after week led to huge onset drama. If the book was well-researched and thorough, perhaps it would bring these examples up to contrast and compare before making bold assertions without context.",
            "score": 14,
            "author": "Volcano_Tequila"
        },
        {
            "level": 0,
            "comment": "So, this book doesn't talk to either star and either will comment on the article?\n\nokaaaaaaay",
            "score": 3,
            "author": "bros402"
        },
        {
            "level": 0,
            "comment": "Having read the article, I am not seeing a lot of corroborating evidence for anything, aside from the fact that production was chaotic.",
            "score": 54,
            "author": "Morgus_Magnificent",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s excerpts and a brief overview of just a part of a new, longer book about the industry. It apparently has many interviews and sources. It’s journalism expose so it’s not about the type of evidence you’d get in a court.",
                    "score": 47,
                    "author": "LilSliceRevolution",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, of course. \n\nBut even so, the article is like \"Well, something bad happened. You would think that means that the whole production was flawed. But since Ms Beharie is a black woman, we have to assume she was mistreated. Nobody with firsthand knowledge has confirmed this. \"\n\nThat's a bit weak in my opinion.",
                            "score": -2,
                            "author": "Morgus_Magnificent",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are direct quotes from sources that imply they think some of the difficulties on set had to do with racial dynamics though. The article is just reporting that.\n\nI haven’t read this book but I’m just not sure why you seem so resistant when you haven’t read it either.",
                                    "score": 52,
                                    "author": "LilSliceRevolution",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I guess I'm uncomfortable with ruining people's reputations when the alleged victim hasn't even made a single allegation.",
                                            "score": -17,
                                            "author": "Morgus_Magnificent",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I guess I'm uncomfortable with ruining people's reputations when the alleged victim hasn't even made a single allegation.\n\nshe did tho:\n\n&gt; “My costar and I were both sick at the same time but I don’t believe that we were treated equally,” said Beharie. “He was allowed to go back to England for a month [to recover while] I was given Episode 9 to shoot on my own. So I pushed through it and then by the end of that episode I was in urgent care. And all the doctors, including the doctors that the studio was sending, were all confirming, ‘Hey, she can’t work right now.’”\n\nhttps://www.latimes.com/entertainment-arts/movies/story/2020-06-19/nicole-beharie-miss-juneteenth",
                                                    "score": 12,
                                                    "author": "visionaryredditor",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And this is a very specific form of racism, and one that’s inadequately discussed. That black people have nigh-supernatural physical strength and durability. It was used as justification in the Ferguson, Missouri case, and I’ve unfortunately heard it parroted in a few of the Secret White Guy Conversations I’ve had. (There’s probably a bit of “soft Englishman” bias going on as well.)",
                                                            "score": -3,
                                                            "author": "bshaddo"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Seems like an overreaction to me based on what’s in this article. And I think people who worked on the show are entitled to talk about what they experienced and what they think it means. There isn’t even really a “victim” in the narrative of the article, but some of the people involved feel that Beharie was notably treated differently.",
                                                    "score": 35,
                                                    "author": "LilSliceRevolution"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Regardless, their reputation deserves to be ruined for the fact the show was such a disaster behind the scenes for everyone. It doesn't even seem like their \"white male lead/star\" even had a good time. \n\nBut yeah, I totally agree. The racism accusations are just not concrete enough and when things were as bad as they were, maybe a bit of racism and microaggression was the least of their worries at that point. Nobody seemed to be having a good time.",
                                                    "score": -20,
                                                    "author": "Juuto"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That comes across more as an editorial annotation from the author than anything else.  There are TONS of examples of actors and actresses from all racial and ethnic backgrounds who have had run-ins with TV and film execs.  Jumping to a conclusion of \"racism\" based on the identity of the actor or actress is a careless and irresponsible assumption to make, especially when there's nothing to point to that would draw one to make that distinction.  Accusing someone of being racist is a pretty damning claim, and shouldn't be done lightly.",
                                            "score": -13,
                                            "author": "Maelstrom52",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There are at least 2 sources quoted in the article that aren’t the author of the book bringing up race explicitly. I am not going to assume these are accusations made lightly. I would think that the experienced reporter who spoke to multiple sources with first hand experience has a better grasp of the situation than I do off of one article about her book.",
                                                    "score": 14,
                                                    "author": "LilSliceRevolution",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Feel free to quote the section you're referring to, but from I read, it was mostly things like this:\n\n&gt;These incidents and others were among a pattern within the show’s changing creative leadership, Ryan suggests. Including Campbell becoming “unproductively” emotional and defensive at times when Black writers made suggestions around elements of the scripts, potential unconscious bias being addressed by HR in terms of script assignments and fans criticizing the show for its treatment of Beharie’s character.\n\nAnd this:\n\n&gt;It was a “double standard” as co-star Orlando Jones described it, with another source sensing she felt alone. “Especially if that person is a woman and a woman of color — those are two groups that already have challenges to begin with,” that same source told Ryan.\n\nBoth of these are examples of jumping to a conclusion that racism played a role when there's no reason to think that this had anything to do with race.  This was both from Maureen Ryan (the author of the book that the article is based off of) and another \"unnamed source\" claiming that the \"racism\" was due to challenges that are innate aspects of being a \"woman of color,\" and I'm guessing this person isn't a sociologist and is just coming to this conclusion based on nothing more than their own opinion. Maureen Ryan wrote the book after she had already come to the conclusion that the industry treats women of color differently (which isn't how anyone studying racism would actually approach the subject), and yet the best she can come up with is people who \"assume\" the poor treatment was due to race/racism, but it sounds like everyone was having a bad time on the set.  This piece just seems to focus on how it was bad for Nicole Beharie, and Beharie doesn't even corroborate it!  It's an unbelievably thin argument to make.",
                                                            "score": -7,
                                                            "author": "Maelstrom52",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Read your second example again. It pivots from Jones who spoke on the record to another source quoted as speaking to Ryan, the author.\n\nThen there is this:\n\n“When a bunch of white guys say a person of color is difficult, I tend to assume that there’s a lot more to that story,” one source said. “I found her to be pleasant, extremely talented, and an actor who was adjusting to being a lead. There are growing pains with that. In the time I was there, where the discrepancy came in was how their growing pains were viewed and handled.”\n\nI said that there are sources. It’s far more than some random commenters who have decided from an article detailing a small snippet of a book that the author is completely full of it. Like I said, she definitely knows better than anyone commenting here.\n\nAlso, whether or not someone is a sociologist has nothing to do with their ability to comment on some basic social dynamics they feel they’ve experienced.",
                                                                    "score": 13,
                                                                    "author": "LilSliceRevolution",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah, read yours again:\n\n&gt;When a bunch of white guys say a person of color is difficult, **I tend to assume that there’s a lot more to that story,**” one source said.\n\nI mean, this is hardly evidence of anything more than a person's opinion about general societal trends. How this qualifies as journalism is beyond me. Imagine if someone just quoted a racist saying something like, \"You know when a bunch a Jews are around, I tend to think something nefarious is happening.\" Would that constitute any sort of reliable discourse to include in a piece about working on Hollywood?  It's not like the \"source\" can even cite a specific instance, where something racist was uttered or inferred. They're just saying that they think anytime white people say someone of color is difficult, then racism is implied. That is patently insane. I shouldn't have to make this point. It's obvious on its face.",
                                                                            "score": -9,
                                                                            "author": "Maelstrom52"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; and Beharie doesn't even corroborate it\n\nyou're wrong!\n\n&gt;  “My costar and I were both sick at the same time but I don’t believe that we were treated equally,” said Beharie. “He was allowed to go back to England for a month [to recover while] I was given Episode 9 to shoot on my own. So I pushed through it and then by the end of that episode I was in urgent care. And all the doctors, including the doctors that the studio was sending, were all confirming, ‘Hey, she can’t work right now.’”\n\nhttps://www.latimes.com/entertainment-arts/movies/story/2020-06-19/nicole-beharie-miss-juneteenth",
                                                                    "score": 7,
                                                                    "author": "visionaryredditor"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "redditor doubts black person mistreated, news at 11.",
                                    "score": 22,
                                    "author": "dmun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Listen. Unless the people acting with racial bias have written up an official company memo outlining how their actions were because of their racism, it isn’t real.\n\n/s I hope obviously",
                                            "score": 2,
                                            "author": "LilSliceRevolution"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I tend to just ignore the stuff where it's one lone crew member making noise, but I think the article does make the case that it was a rather amateurish set that was riddled with issues.",
                    "score": 9,
                    "author": "Maelstrom52"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At lot of allegations without getting any comment from Beharie herself.",
            "score": 30,
            "author": "ManOnNoMission",
            "replies": [
                {
                    "level": 1,
                    "comment": "she talked about it before\n\n&gt; “My costar and I were both sick at the same time but I don’t believe that we were treated equally,” said Beharie. “He was allowed to go back to England for a month [to recover while] I was given Episode 9 to shoot on my own. So I pushed through it and then by the end of that episode I was in urgent care. And all the doctors, including the doctors that the studio was sending, were all confirming, ‘Hey, she can’t work right now.’”\n\nhttps://www.latimes.com/entertainment-arts/movies/story/2020-06-19/nicole-beharie-miss-juneteenth",
                    "score": 21,
                    "author": "visionaryredditor"
                },
                {
                    "level": 1,
                    "comment": "She left the show before it was canceled, so I assume it all tracks.",
                    "score": 24,
                    "author": "Couldnotbehelpd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; allegedly resulting in Mison’s character’s famous “courtly” bow, because the co-stars did not want to hug each other.\n\nYeah I’m having trouble buying that. I feel like this was tacked-on.",
            "score": 9,
            "author": "superanth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, that seems a bit... much. I could see if they had hugged for the first few episodes, then he started to bow - but yeaaaaaaah",
                    "score": 3,
                    "author": "bros402"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most of the article seems very circumstantial.",
            "score": 3,
            "author": "skyturnedred"
        },
        {
            "level": 0,
            "comment": "&gt; Ryan details how one of Fox’s most popular and promising shows of 2013 fell apart, and allegedly created a hostile work environment for one of its stars amid creative mismanagement tensions and turnover between producers, creators, showrunners and Fox executives. **Part of that, the book alleges, was driven by the happenings within the writers room, which Ryan notes had three people of color in season one, but had returned for season two with an all-white male team outside a “sole woman of color.”**\n\n&gt; Multiple sources told Ryan that **people with power on the show claimed from early on they did not have “a good experience with Nicole,” but then spread that to others, including writers who had not worked with her.** It was a “double standard” as co-star Orlando Jones described it, with another source sensing she felt alone. **“Especially if that person is a woman and a woman of color — those are two groups that already have challenges to begin with,”** that same source told Ryan. “It created a very us-against-her environment from day one.”\n\n&gt; “**When a bunch of white guys say a person of color is difficult, I tend to assume that there’s a lot more to that story,**” one source said.\n\n&gt; According to sources who worked on the show, some of whom used their first or full names, **Beharie showed a trepidation about the role, a massive and potentially multiyear undertaking.** (Ryan likens this to James Gandolfini on the set of The Sopranos, as detailed in Difficult Men.) **But both she and Mison showed difficulty adjusting to being the leads of the show, with co-star Jones telling Ryan that both were “out of their depths” and “no one was helping them.”**\n\n\n&gt; These incidents and others were among a pattern within the show’s changing creative leadership, Ryan suggests. **Including Campbell becoming “unproductively” emotional and defensive at times when Black writers made suggestions around elements of the scripts, potential unconscious bias being addressed by HR in terms of script assignments** and fans criticizing the show for its treatment of Beharie’s character.\n\n\n&gt; **Neither Beharie nor Mison commented for the book.**\n\n\n‘Burn It Down’ is an apt title for a book that’s portraying the majority of white male writers as racists &amp; sexist.",
            "score": -13,
            "author": "Neo2199",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t really get that from this blurb at all - I got “this pattern of behavior from the predominantly-male, predominantly-white writers room drew our suspicions.”",
                    "score": 22,
                    "author": "godsanchez"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There doesn't seem to be that much substantial here. The writer is obviously trying to make woke people like her and desperately looking for any possible racism she can find. If she heard any real stories about Beharie being genuinely difficult she would most likely wouldn't admit it. She knows the readers of this book are only interested in one narrative.",
            "score": -14,
            "author": "RusevReigns"
        },
        {
            "level": 0,
            "comment": "It's great that there are so many people here ready to defend men.",
            "score": -52,
            "author": "burnbunner",
            "replies": [
                {
                    "level": 1,
                    "comment": "What",
                    "score": 11,
                    "author": "armchairwarrior69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember being excited for this show. Then I remember being really bored by this show.",
            "score": 1,
            "author": "LeoLaDawg"
        },
        {
            "level": 0,
            "comment": "at the end of the day Nicole ruined the series not the writers she was miserable on set at levels not dissimilar to Clayne Crawford on Lethal Weapon",
            "score": -13,
            "author": "birthdaythrowaway127"
        },
        {
            "level": 0,
            "comment": "Does this really count as journalism?  It’s more like uncorroborated gossip.  \nThey didn’t talk to either of the stars there are no interviews here at all.  It’s all rumor",
            "score": -1,
            "author": "smd33333"
        }
    ]
}