{
    "id": "143cx81",
    "score": 0,
    "title": "Rob Delaney's freak out on The Man Who Fell to Earth doesn't seem so insane...",
    "author": "InfiniteBaker6972",
    "date": 1686143473.0,
    "url": "https://www.reddit.com/r/television/comments/143cx81",
    "media_urls": [],
    "other_urls": [],
    "postText": "There's an episode of the woefully under appreciated TV series 'The Man Who Fell to Earth' that has Hatch Flood (Rob Delaney) vocalising a panic attack brought on by the realisation that the 'Quantum Fusion' power source will change the landscape of the world. It's very dramatic, very well written and brilliantly delivered by Delaney.\n\nThis morning I read the statement that the Statement on the risks of AI that the Centre for AI Safety released and that speech popped right on into my head.",
    "comments": [
        {
            "level": 0,
            "comment": "AI is “scary” in the sense that morons who don’t understand what currency is might try to replace all human employees with robots and yet still expect the economy to continue even when ever human too poor to own the means of production is unemployed.  \n\nBut the other stuff. Ridiculous. “What if we tell an AI to make paper clips but we forget to tell if that human life is more valuable than paper clips so it kills all the humans to make paper clips?!”  Well.  Don’t forget to tell it human life is more valuable than paper clips. Asimov made sure his robots all new first and foremost new that protecting human life was the most important law to follow, and I don’t know if the phrase artificial intelligence had been coined when we was writing those stories.",
            "score": 4,
            "author": "meowskywalker",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Don’t forget to tell it human life is more valuable than paper clips. \n\nIt doesn't know what a human life is.\n\nAsimov's Laws only work if your artifical intelligence is, in fact, intelligent. What we're calling AI isn't, and it wouldn't know how to define human life except in the approximate midpoint between how everyone else in its dataset defines it. \n\nMany definitions of human life are simply impossible to reconcile, in the same way as there's no such thing as a little-bit-pregnant. How does it choose between one human life and another? Or one way of how life is defined vs another. Is it going to run past a packed burning school bus to save an IVF clinic's freezers? Maybe. How do we stop it doing that? Well... we'd have to specifically outline a new exceptional rule for that scenario, which will go just swimmingly when religious fruitloops find out about it.\n\nEating junk food or drinking booze harms me, is it going to stop me doing that? How do we tell it not to? Those are just some random examples, but there are millions of others. Even Asimov didn't think his rules were a perfected answer to the questions here, his stories are full of problems caused by conflicts between the three.",
                    "score": 3,
                    "author": "Archamasse"
                }
            ]
        }
    ]
}