{
    "id": "143e2sr",
    "score": 1575,
    "title": "Good Omens | Season 2 Official Trailer | July 28 on Prime Video",
    "author": "MarvelsGrantMan136",
    "date": 1686146420.0,
    "url": "https://www.reddit.com/r/television/comments/143e2sr",
    "media_urls": [
        "https://www.youtube.com/watch?v=Xgl06nszfSE&amp;embeds_referring_euri=https%3A%2F%2Fvariety.com%2F&amp;source_ve_path=Mjg2NjY&amp;feature=emb_logo"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Just a short 4 years between seasons",
            "score": 306,
            "author": "Dartser",
            "replies": [
                {
                    "level": 1,
                    "comment": "British series gonna British series.",
                    "score": 190,
                    "author": "Arinoch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Other than my beloved Sherlock (which drank the fanservice koolaid and OD'd into barely passable mediocrity by it's end) despite the long pauses the shows usually return just as good, if not better. Excited about this one too. Also gives one an excuse to reacquaint with the previous eps.",
                            "score": 35,
                            "author": "Daniiiiii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Anything after and including the Reichenbach Fall is real rough",
                                    "score": 13,
                                    "author": "Doctor_Philgood",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed. Don't know why it's the highest rated episode.",
                                            "score": 5,
                                            "author": "notonetojudge"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "*Taboo has entered the chat*",
                    "score": 45,
                    "author": "phatelectribe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Second series is riiiiight around the corner. Any day now",
                            "score": 9,
                            "author": "Smirnoffico",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have it on pretty good authority that it's actually never going to happen.",
                                    "score": 3,
                                    "author": "phatelectribe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tom is that you?",
                                            "score": 4,
                                            "author": "Smirnoffico",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Definitely not. I wouldn’t be posting on Reddit if I was. I’d be enjoying my shockingly massive bank balance.",
                                                    "score": 6,
                                                    "author": "phatelectribe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Honestly if I have a shockingly massive bank account i would be shitposting on reddit non-stop",
                                                            "score": 11,
                                                            "author": "Smirnoffico"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*Venture Bros has entered the chat*",
                            "score": 26,
                            "author": "jesternarf"
                        },
                        {
                            "level": 2,
                            "comment": "I’ve given up. Season 1 is on Freevee now, mail is in the coffin. I heard Hardy was considering like some fast forward future hop into the present? And I thought he is just toying with us. And if he isn’t? How can that possibly get green lit?",
                            "score": 3,
                            "author": "hhhdies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sort of drops the show right into the supernatural, which was only played on in the first season.  He could take on Nestle this time.",
                                    "score": 1,
                                    "author": "UncannyPoint"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Omg yes! I need more James Kaziah  Delaney and his “ I have a use for you”",
                            "score": 3,
                            "author": "onihr1"
                        },
                        {
                            "level": 2,
                            "comment": "Is it not already cancelled?",
                            "score": 2,
                            "author": "zouhair"
                        },
                        {
                            "level": 2,
                            "comment": "I thought that was a limited series? Ended like it was, with everything tied up neatly in a bow.",
                            "score": 1,
                            "author": "Fallcious"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fawlty Towers had the same gap",
                    "score": 11,
                    "author": "listyraesder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "MANUEL!",
                            "score": 9,
                            "author": "rtopps43",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Basil!!",
                                    "score": 5,
                                    "author": "stupidillusion"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I sure do miss the days when there was only a 3 month gap between seasons.",
                    "score": 38,
                    "author": "RedRaiderATX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "sure but now there are more and more special effect, it just take more time to produce",
                            "score": 2,
                            "author": "Alastor3"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Holy hell has it really been that long??",
                    "score": 9,
                    "author": "emf3rd31495"
                },
                {
                    "level": 1,
                    "comment": "No, 4 years? Don't tell me that, I would have believed 2",
                    "score": 5,
                    "author": "PeopleEatingPeople"
                },
                {
                    "level": 1,
                    "comment": "That’s like 4 months in British TV time. You should be grateful.",
                    "score": 3,
                    "author": "whiskymusty"
                },
                {
                    "level": 1,
                    "comment": "Laughs in Venture Brothers",
                    "score": 3,
                    "author": "ACardAttack"
                },
                {
                    "level": 1,
                    "comment": "Well this one is from scratch right? Of course it’ll take longer",
                    "score": 1,
                    "author": "MJBotte1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i'm in love with his car",
            "score": 87,
            "author": "stonyrill",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm in love with cheese.",
                    "score": 11,
                    "author": "lynivvinyl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love lamp!",
                            "score": 13,
                            "author": "Drucifer416",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you just looking at things in the office and saying that you love them?",
                                    "score": 12,
                                    "author": "rowin-owen"
                                },
                                {
                                    "level": 3,
                                    "comment": "Brick, where did you get a hand grenade?",
                                    "score": 1,
                                    "author": "barriekansai"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "so is Crowley",
                    "score": 4,
                    "author": "trainercatlady",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "and roger taylor!",
                            "score": 8,
                            "author": "stonyrill"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I'm not a car guy, but that's a bad ass car!",
                    "score": 1,
                    "author": "ensalys"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The chemistry between David Tennant and Michael Sheen in this series is just perfection. I know some people felt like a second season wasn't necessary, but I'm just so happy we get more of these two together again.",
            "score": 323,
            "author": "Gato1980",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the people saying a second season wasn't necessary are basing that on the first season basically covering the book. \n\nExcept, that's what makes this season so interesting. It's apparently based on plans and scraps and conversations that Neil Gaiman and Terry Pratchett had before Terry's death, that were for a second book which they never got to make. \n\nThis is going to be new material we've never seen before, some of it from Terry Pratchett posthumously too.",
                    "score": 140,
                    "author": "GrinningPariah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Throw in that Neil Gaiman is helming this project in large part as a farewell tribute to his collaborator and friend, and I’m looking forward to the second season.",
                            "score": 99,
                            "author": "DaoFerret",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh for sure, and also that he's directly writing the screenplay, like he did with the first season. I'm really excited",
                                    "score": 23,
                                    "author": "GrinningPariah"
                                },
                                {
                                    "level": 3,
                                    "comment": "having John Finnemore attached certainly doesn't hurt.",
                                    "score": 10,
                                    "author": "trainercatlady"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I went to a Neil Gaiman reading by him, and he answered questions afterwards, and one of them was about this. He specifically said that he had conversations with Terry about what the next book would be, but THAT material would be season **3**, but season 2 is what bridges that gap, storywise.",
                            "score": 32,
                            "author": "Nik_Tesla"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Have you watched Staged? Covid production, plenty of good banter between them.",
                    "score": 20,
                    "author": "nagdamnit"
                },
                {
                    "level": 1,
                    "comment": "Their quarantine team-up \"Staged\" (currently on BritBox) is fun, too.",
                    "score": 52,
                    "author": "LysdexicGinger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Staged is one of the best, most creative pieces of television ever created.\n\nEach season came back and twisted the premise on its head and I loved it.",
                            "score": 3,
                            "author": "FotographicFrenchFry"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As someone who hasn't read the book, I remember thinking after the first season that I could watch another 100 episodes of those 2 together (provided there's no more plots centered around bad child actors).",
                    "score": 25,
                    "author": "Kim-Jong_Bundy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The book is FABULOUS!!!!!",
                            "score": 5,
                            "author": "hhhdies"
                        },
                        {
                            "level": 2,
                            "comment": "I thought most of the kid acting was okay in the context of the type of storytelling it was. Like they were sort of kid stereotypes being used in a parable. The mistaken Antichrist kid and Adam were pretty genuinely bad though, even looking at it that way.",
                            "score": 3,
                            "author": "wesailtheharderships"
                        },
                        {
                            "level": 2,
                            "comment": "If you haven't already, watch the lockdown show 'Staged'. They are both fantastic in it.",
                            "score": 1,
                            "author": "SqueakySniper"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can heartedly recommend the show “Staged” with them both in it.. playing actors stuck at home during Covid and the producer calls them to say it would be a great idea to rehearse over zoom..",
                    "score": 4,
                    "author": "Happydenial"
                },
                {
                    "level": 1,
                    "comment": "Please. If you have no t seen “Staged”? Enjoy the F out of it!!!",
                    "score": 3,
                    "author": "hhhdies"
                },
                {
                    "level": 1,
                    "comment": "&gt; The chemistry between David Tennant and Michael Sheen in this series is just perfection. I\n\nIn anything they do together is perfect.  They were great in Staged, and also David did a podcast during the pandemic and his episode with Michael was fantastic",
                    "score": 2,
                    "author": "ACardAttack"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These two absolutely own these roles. Worth the watch for Sheen and Tennant alone",
            "score": 56,
            "author": "moneymoneymoneymonay"
        },
        {
            "level": 0,
            "comment": "Can't wait for this.  Really liked season 1, and especially loved the main duo.  I'm also excited to see what Jon Hamm brings to the table, since it looks like he'll play a central role as well.  Looks like a lot of fun overall.",
            "score": 28,
            "author": "donuteater111",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was in 5 of 6 episodes the first season.",
                    "score": 3,
                    "author": "muad_dibs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah, I know.  It just looks like they'll be using him a bit more this season based on this trailer, which I'm happy about (though trailers can be a bit misleading sometimes).",
                            "score": 5,
                            "author": "donuteater111",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t find him overly funny in the first season, but something about the way he was yelling “pornography” in the book shop got me every time. I’m really hoping that “fish out of water” humor is where he stays for this season.",
                                    "score": 2,
                                    "author": "Jammyhobgoblin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He was perfect in the Fletch reboot.",
                                            "score": 1,
                                            "author": "1koolspud"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really enjoyed season one. Hope I like the second season as well",
            "score": 59,
            "author": "Salt_Laugh",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean .. it's got the best Doctor in it. How can it not be great?",
                    "score": 21,
                    "author": "Rondaru",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd watch three seasons of Tennant and Sheen having a zoom call. Wait, I actually did.",
                            "score": 51,
                            "author": "tin_dog"
                        },
                        {
                            "level": 2,
                            "comment": "Wait, I didnt know Peter Capaldi had a role in it, must have missed it.",
                            "score": 35,
                            "author": "Triskan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely based.",
                                    "score": 14,
                                    "author": "In_My_Own_Image"
                                },
                                {
                                    "level": 3,
                                    "comment": "All the Capaldi love I see years after his regeneration brings a tear to my eye.",
                                    "score": 7,
                                    "author": "Aggressive-Produce54",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*Laugh hard... Run fast... Be kind.*",
                                            "score": 1,
                                            "author": "smoha96"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Naaaa Tennant is best, but I still loved capaldi.",
                                    "score": 2,
                                    "author": "UrbanGhost114"
                                },
                                {
                                    "level": 3,
                                    "comment": "Eccleston :P",
                                    "score": 1,
                                    "author": "ACardAttack"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Tom Baker is in this?",
                            "score": 9,
                            "author": "sirbissel"
                        },
                        {
                            "level": 2,
                            "comment": "Capaldi is in this‽",
                            "score": 9,
                            "author": "JayRedEye",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh come on ... Capaldi wasn't bad as a Boomer-Doctor, but the man totally overacted most of the time.",
                                    "score": -18,
                                    "author": "Rondaru"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Permission to squeeee!](https://media1.giphy.com/media/lqXkZVDbMABDW/giphy.gif?cid=ecf05e478pqtkasxwgxeo7uvw3z4frqe2sa4pklj67ozl0lw&amp;ep=v1_gifs_search&amp;rid=giphy.gif&amp;ct=g)",
            "score": 16,
            "author": "Citizen_Kong"
        },
        {
            "level": 0,
            "comment": "John Finnemore has a writing credit too, and everything he does is great, so I’m extra excited.",
            "score": 15,
            "author": "sjhwilkes",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've been saying this since S2 was announced two years ago- if JF weren't attached I'd be SIGNIFICANTLY less excited. But he is, and I am, because he is so good and I trust him.",
                    "score": 3,
                    "author": "hannahstohelit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hamm is so underrated as a comedic actor. But he always killed it when he was on SNL. He looks like he is going to fun here. I loved him in the little bits he had in the first Good Omens season. \n\nSheen is just so adorable as Aziraphale. He has such a little kid charm about him. You just want to hug him. \n\nAnd, YAY, Miranda Richardson is in this as well! She is such a hidden gem, herself. \n\nI can't wait to see this!",
            "score": 20,
            "author": "inksmudgedhands"
        },
        {
            "level": 0,
            "comment": "NGL - I've watched season 1 like, five times.",
            "score": 7,
            "author": "TheRootofSomeEvil",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you read the book? It's really good.",
                    "score": 3,
                    "author": "frozenfade"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Surrender the Angle!",
            "score": 6,
            "author": "stupidillusion"
        },
        {
            "level": 0,
            "comment": "Is that the Wrexham tune I hear? But I didn’t realize they were producing season 2, feels like it’s been forever since the last season. I remember the big ass demon and antichrist at the end, also David Tennant was excellent.",
            "score": 5,
            "author": "j_j_a_n_g_g_u",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha, Wrexham also made me a fan of Buddy Holly's Everyday. It was a perfect opening, except for the two times they used The Times They Are a-Changin' instead.",
                    "score": 5,
                    "author": "Kyriio"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad it’s back! It was a good show",
            "score": 3,
            "author": "antsinmypants3"
        },
        {
            "level": 0,
            "comment": "Finally",
            "score": 3,
            "author": "DieCompany"
        },
        {
            "level": 0,
            "comment": "It’s just gonna be “Staged” in fancier costumes, and I’m here for that!!",
            "score": 3,
            "author": "Tohu_va_Vohu"
        },
        {
            "level": 0,
            "comment": "I'm excited but I don't think this is necessary.  Season 1 was perfect as a mini series.",
            "score": 78,
            "author": "ArchDucky",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gaiman and Pratchett had plans for a sequel before Pratchett died, and this story is based off a outline they had made. So a sequel was in the works back in the day.",
                    "score": 219,
                    "author": "AMontyPython",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This exactly, and I believe Gaiman was heavily involved in this season as well.\n\nEdit: typo",
                            "score": 40,
                            "author": "daydreamerrme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, he's written it, as he did the first season. That's pretty heavily involved, I reckon.",
                                    "score": 64,
                                    "author": "Citizen_Kong"
                                },
                                {
                                    "level": 3,
                                    "comment": "When Gaiman is actually involved it turns out great (Good Omens, Stardust, The Sandman).\n\nWhen he's not... well you get *Lucifer* or *American Gods*",
                                    "score": 37,
                                    "author": "MulciberTenebras",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "American Gods season 1 was great.\n\nSeason 2 was meh.\n\nI forgot to watch Season 3.",
                                            "score": 26,
                                            "author": "nabrok",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gaiman and Bryan Fuller weren't around after the first season.\n\nAnd the new showrunner was a racist.",
                                                    "score": 18,
                                                    "author": "MulciberTenebras",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "seriously how do you look at the gold Orlando Jones gave us with Anansi and say \"no, I don't want more of that\"??",
                                                            "score": 6,
                                                            "author": "trainercatlady",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"I know what Black people are actually thinking. And they shouldn't be so angry, it makes us feel uneasy!\" - Jesse Alexander",
                                                                    "score": 4,
                                                                    "author": "MulciberTenebras",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "maybe it was a bad idea to give him a show with a deliberately mixed-race lead",
                                                                            "score": 3,
                                                                            "author": "trainercatlady"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "At least Lucifer was fun. Silly, but self-consciously and enjoyably so. Well, except Season 3.",
                                            "score": 20,
                                            "author": "Porrick"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes! I had such high hopes for *American Gods*. So disappointing. And *Lucifer*… well, if it wasn’t for Tom Ellis’s pretty face, I wouldn’t have even gotten through it. \n\n*Sandman* was perfection, IMHO, and *Stardust* is one of my favorites. If Neil is involved, it’s either spot on, or the diversions are still done well.",
                                            "score": 13,
                                            "author": "peepster_1973"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ok, well that makes it a little better.",
                            "score": 53,
                            "author": "ArchDucky"
                        },
                        {
                            "level": 2,
                            "comment": "That's heartening, although sadly the nature of Pratchett's illness had a depressing effect on his work in the last years. The last few Discworld novels read like a poor imitation of his work.",
                            "score": 8,
                            "author": "Porrick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not exactly the same but I started reading one of the newer Jack Reacher's the other day and I keep getting the same vibe.  Doesn't feel right.  I know his son took over and I am starting to think he might have done it before he was credited.",
                                    "score": 5,
                                    "author": "ArchDucky"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes. At that point he was reading out his narrative to an assistant and he was desperately trying to tie up a few loose ends. He managed to end the Tiffany Aching saga very well and got Ankh Morpork into the steam age, so he left his storyworld characters in a good place.",
                                    "score": 1,
                                    "author": "Fallcious",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unseen Academicals really made me sad, though. So much of his work is the skewering of literary tropes, and that one spent its entire buildup complaining about fake soccer tropes - only to end in the tropiest bullshit game of soccer I've ever read. I can't remember if I read it before or after learning of his diagnosis, but I could tell something was deeply wrong.",
                                            "score": 3,
                                            "author": "Porrick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Was that the one that introduced goblins for the first time?",
                                                    "score": 1,
                                                    "author": "Fallcious",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think it was orcs, but you might be right. It was a while ago now.",
                                                            "score": 2,
                                                            "author": "Porrick"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah but the best parts of the book were clearly done by Pratchett, it makes me worried how good the sequel will be without his direct input.\n\nIt was already kind of evident in the show, which I still enjoyed, but was not as good as the book and had some weird focus and pacing issues.",
                            "score": 0,
                            "author": "TheLastDesperado"
                        },
                        {
                            "level": 2,
                            "comment": "That’s a relief. I’m glad they’re not just gonna be phoning it in and making stuff up just for a second season. I can’t wait!",
                            "score": 1,
                            "author": "prodigy1367"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, my hope is since Neil Gaiman was personally involved it’ll come out well.  He wrote all of the episodes with John Finnemore, that’s very promising.",
                    "score": 6,
                    "author": "bigsquirrel"
                },
                {
                    "level": 1,
                    "comment": "\"Necessary? Is it necessary for me to drink my own urine? No, but I do it anyway because it's sterile and I like the taste.\"\n\nSure, it might not be necessary, but it might be good TV!",
                    "score": 2,
                    "author": "UndyingShadow"
                },
                {
                    "level": 1,
                    "comment": "I feel the same way. It’s okay for shows to conclude",
                    "score": 4,
                    "author": "thesagaconts"
                },
                {
                    "level": 1,
                    "comment": "I'm going to watch this pretending it is a completely different show.  It is the only way it won't be ruined for me.",
                    "score": -3,
                    "author": "byllz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've forgotten the entire first season by now",
            "score": 8,
            "author": "Turi5150",
            "replies": [
                {
                    "level": 1,
                    "comment": "all the more reason to watch it again",
                    "score": 12,
                    "author": "trainercatlady",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Facts! NGL I enjoyed it otherwise I'd of skipped the rest of it.",
                            "score": 1,
                            "author": "Turi5150"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Haven’t you watched it once a month like we all did? I thought everybody did that.",
                    "score": 5,
                    "author": "nsfwtttt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You son of a bitch; I’m in!",
            "score": 3,
            "author": "phaedronn"
        },
        {
            "level": 0,
            "comment": "https://www.reddit.com/r/television/comments/erhejx/i_just_finished_good_omens_while_im_glad_it_was_a/\n\nim glad it came true lol",
            "score": 2,
            "author": "SKTT1Nimmo"
        },
        {
            "level": 0,
            "comment": "Staged, series 4 ;)",
            "score": 2,
            "author": "KamiNoItte"
        },
        {
            "level": 0,
            "comment": "OMG YES finally some good news. A tiny ray of light shining through this dystopia we’re living in. \n\nI needed this.",
            "score": 2,
            "author": "nsfwtttt"
        },
        {
            "level": 0,
            "comment": "Season 1 was terrific, so I hope season 2 lives up to its excellence.",
            "score": 2,
            "author": "izzyduude"
        },
        {
            "level": 0,
            "comment": "pleasebegoodpleasebegoodpleasebegoodpleasebegoodpleasebegood",
            "score": 2,
            "author": "zouhair"
        },
        {
            "level": 0,
            "comment": "While we waiting if anyone still didn't watch [Staged](https://www.imdb.com/title/tt12369754/?ref_=adv_li_tt) yet, the fuck you doing?",
            "score": 2,
            "author": "zouhair"
        },
        {
            "level": 0,
            "comment": "Always happy to see more of Jon Hamm",
            "score": 4,
            "author": "BlizBlitz"
        },
        {
            "level": 0,
            "comment": "I remember when Neil said he had no plans for a season 2 lol",
            "score": 1,
            "author": "upstatedreaming3816",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I've pieced the timeline together correctly, in August 2019 he was saying he wasn't sure, in December 2019 he and John Finnemore (the cowriter) were starting to meet about it and were interrupted by COVID, and somewhere in between there he started lying about how there weren't any plans in place for a S2 lol",
                    "score": 4,
                    "author": "hannahstohelit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The sandman was divisive because it got the attention of a lot of people that hate LGBTQ people.\n\nThe Sandman was true to its roots.  It has nothing to answer for.  Those people are bigots.\n\nedit - They also hate minorities too.  I forgot about the Death swap.\n\nHow could I forget about that...\n\nOh wait, the actress was utterly fantastic and the root of these characters are that they are not human but only representations of humans so we can interact with them.\n\nAnyways, I don't hate minorities, LGBTQ people bring value to my existence and I understood the material when I read it 30 years ago.  Yeah, that is why I forgot.",
                    "score": 37,
                    "author": "SuperZapper_Recharge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sandman was as close to 1:1 as an adaptation could be imo. It was terrific for me.",
                            "score": 25,
                            "author": "nick281051",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Poor Joe is deleting all his comments as fast as he wrote them.",
                                    "score": 6,
                                    "author": "SuperZapper_Recharge"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -15,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;many people who just simply didn't like it for many other reasons.\n\nSuch as?\n\n&gt;Why didn't he originally envision a more diverse cast, and why did he give them such distinct looks if \"it doesn't matter\n\nAh, there we have it.",
                                    "score": 9,
                                    "author": "kerriazes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;why is it that even the question of why they don't look the way it's expected, dismissed as this horrible attitude\n\n**Because their ethnicities, genders, or sexualities aren't in most cases the reason people fell in love with the characters.**",
                                                    "score": 10,
                                                    "author": "kerriazes"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;As for it being \"true to its roots\"\n\nNeil Gaiman was literally the writer for the original source comic of Sandman, it doesn't get much truer to its roots than having him directly involved.\n\nSure you can take exception to this adaption, just like you could have reasons to taking exception to any particular story in the comics.  But regardless of whatever reasons you disliked the adaption, it was definitely true to it's roots.",
                                    "score": 13,
                                    "author": "pipboy_warrior",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think when Gaiman dismissed criticism, it was directly meant for people who were disliking it for all the wrong reasons.  Like when he's responding to the racists and sexists who were criticizing the show, why would you think those responses included you?  Did at some point Gaiman say that everyone who hates the show must be a racist or something?",
                                                    "score": 9,
                                                    "author": "pipboy_warrior",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You were lobbed in with the racists because your objection to the show is \"the character's didn't look like in the original comic\" and I highly doubt you were talking about Burgess not being fat in the adaptation.\n\nBut go ahead, which characters' looks did you specifically have a problem with, and why?",
                                                                    "score": 6,
                                                                    "author": "kerriazes",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "ohhh you know the ones",
                                                                            "score": 1,
                                                                            "author": "trainercatlady"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; Is it really fair for Gaiman to call a person racist just for asking why e.g. Death doesn't look like a pale, Caucasian goth girl, since he was the one that put that image in the reader's head? Or why doesn't Lucifer look more like David Bowie because that's how he was imagined?\n\nWas Neil responding to everyone who asked about changes with the characters?  Or was he responding specifically to the people saying that those changes were only there for woke representation?  It might help to know the exact situation here where you think Neil Gaiman accused you of being some kind of bigot.\n\n&gt; I mean, like I already asked, why didn't he envision a diverse cast of characters in terms of gender and ethnicity back when he wrote it?\n\nEver think that maybe when he wrote these characters, he didn't think their identities were that strictly tied to their race or gender?\n\nAnd again I can't stress this enough, Gaiman is the creator.  It's like you're trying to tell the guy who wrote this in the first place that he's wrong about his own characters.",
                                                                    "score": 6,
                                                                    "author": "pipboy_warrior"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Of course you view it this way.  You are one of the people I was talking about.",
                                    "score": 10,
                                    "author": "SuperZapper_Recharge",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -4,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apocalypse 2? Just do something new. It was great, it’s over move on.",
            "score": 0,
            "author": "FunkyFr3d"
        },
        {
            "level": 0,
            "comment": "Meh",
            "score": -1,
            "author": "Hertje73"
        },
        {
            "level": 0,
            "comment": "This is amazing!!",
            "score": 1,
            "author": "SiWeyNoWay"
        },
        {
            "level": 0,
            "comment": "yessss",
            "score": 1,
            "author": "bros402"
        },
        {
            "level": 0,
            "comment": "This I’m here for",
            "score": 1,
            "author": "Toanimeornot"
        },
        {
            "level": 0,
            "comment": "⌚️👀😐",
            "score": 1,
            "author": "PoloniusPunk"
        },
        {
            "level": 0,
            "comment": "Looks great! Would have loved it like 2 years ago. Now I have to rewatch season 1 because I can’t remember half of what I originally watched",
            "score": 1,
            "author": "AlesusRex"
        },
        {
            "level": 0,
            "comment": "Why the hell did it take so long.",
            "score": 1,
            "author": "darrylthedudeWayne"
        },
        {
            "level": 0,
            "comment": "It’s been over 30 years why did I take so long",
            "score": 1,
            "author": "Funny-Company4274"
        },
        {
            "level": 0,
            "comment": "Lots of questions",
            "score": 1,
            "author": "ThAllBlack"
        },
        {
            "level": 0,
            "comment": "Oh cool! I liked this show!",
            "score": 1,
            "author": "cpancoast"
        },
        {
            "level": 0,
            "comment": "I should have not watched that, so I could be more surprised while watching",
            "score": 1,
            "author": "Pacify_"
        },
        {
            "level": 0,
            "comment": "Netflix is a bunch of f'n lairs they said they would never make another season of this show. I can't believe it.",
            "score": 1,
            "author": "SaveTheAles"
        },
        {
            "level": 0,
            "comment": "I watched several scenes on Tiktok and loved it.Then I watched two full episodes of season1 and was totally disappointed. Never again.",
            "score": -9,
            "author": "jens-2420"
        },
        {
            "level": 0,
            "comment": "after the insane boredom that was season one this will have to be incredibly amazing in order to warrant a watch from me",
            "score": -9,
            "author": "anasui1"
        },
        {
            "level": 0,
            "comment": "How the hell did an error like “everyday” being used in place of “every day” make it into *the first five seconds* of a trailer for something this big?\n\nThe writers’ strike is *really* doing a number on the world, huh?",
            "score": -3,
            "author": "RamsesThePigeon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gaiman already talked about that, it’s a quote. https://www.tumblr.com/neil-gaiman/717144135645216768/well-youre-right-but-youre-wrong-its-a",
                    "score": 4,
                    "author": "We_re_All_Mad_Here",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Speaking on behalf of the pedants, we're more irritated by the writing error than we would have been by an alteration to the song (which had *the same error*).\n\nIn any case, that line doesn't even appear in the song's lyrics, so Gaiman is mistaken... and yes, I know that I'm inviting wrath by saying as much.",
                            "score": 0,
                            "author": "RamsesThePigeon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It appears as the first line of the first verse.  \n\n\nIt's even in the quote linked to above.  \n\n\nGaiman's right.",
                                    "score": 2,
                                    "author": "Eborcurean",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, it does not.\n\nThe text in the trailer reads “Everyday it’s a gettin’ closer.”\n\nThe text in the lyrics reads “Everyday, it’s a-gettin’ closer.” There is a comma and a hyphen.\n\nIf the intention was to match the lyrics, those punctuation marks would have been essential. Each instance misuses “everyday,” but the text in the trailer is even worse.\n\nGaiman is wrong.",
                                            "score": 2,
                                            "author": "RamsesThePigeon"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The book is amazing. Season 2 won’t be based on anything the original authors wrote. Not sure how I feel about it.",
            "score": -25,
            "author": "DGD1411",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uh, yeah it is.\n\nGaiman and Pratchett wrote an outline for a sequel before Pratchett died. This season is based on that outline.",
                    "score": 19,
                    "author": "Majestic87"
                },
                {
                    "level": 1,
                    "comment": "Gaiman and Pratchett had an outline for a sequel. Gaiman is involved and is a credited writer for season 2. Supposedly this season will be inspired by that outline.",
                    "score": 12,
                    "author": "TravelerSearcher",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anyone have a copy of that outline?",
                            "score": -6,
                            "author": "DGD1411",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I doubt one is public.\n\nFrom wikipedia:\n\nIn 1989, a year before the completed novel was published, Gaiman and Pratchett visited the US for the World Fantasy Convention in Seattle, and shared a hotel room to save money. Unable to sleep at night due to jet lag, and not having anything else to talk about, they started plotting out the sequel to Good Omens.[13] 668—The Neighbour of the Beast was slated as the sequel's title, but after Gaiman moved to the United States, Pratchett expressed doubt that a sequel would be written.[8] Gaiman later affirmed this in one of his essays, titled Terry Pratchett: An Appreciation. Pratchett died in 2015. In 2017, Gaiman revealed – as part of the filming of the television series based on the book – that he and Pratchett had done some plotting for the sequel, including that \"[t]here would have been a lot of angels in the sequel\", one of whom was Gabriel, who was only briefly mentioned in Good Omens but was to figure more prominently in the television series.[14] When asked if Neil had any plans on releasing a sequel to Good Omens or maintaining its status as a standalone work, Gaiman stated that there was a plot for one that Pratchett wanted to be told, but that whether or not it would be made would depend on certain factors.[15]",
                                    "score": 6,
                                    "author": "TravelerSearcher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cool, thanks for the info.",
                                            "score": 0,
                                            "author": "DGD1411"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's what I want to know. The first season messed with some really important parts of the published novel with Gaiman's blessing - I don't know that I trust him at this point.",
                                    "score": -3,
                                    "author": "preaching-to-pervert",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How dare an adaptation…. Adapt",
                                            "score": 7,
                                            "author": "listyraesder"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"With Gaiman's blessing\" in that he wrote it?",
                                            "score": 3,
                                            "author": "CarryThe2"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Atrocious thumbnail",
            "score": -4,
            "author": "TheHadalZone",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're right. Looks like a youtube reaction video.",
                    "score": 3,
                    "author": "SageOfTheWise"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nope!!, Without Sir P's full involvement it should not be!",
            "score": -4,
            "author": "boingti"
        },
        {
            "level": 0,
            "comment": "What? This shit is still on?!",
            "score": -3,
            "author": "Other_Waffer"
        },
        {
            "level": 0,
            "comment": "I audibly gasped and cheered at this",
            "score": 0,
            "author": "enroxorz"
        },
        {
            "level": 0,
            "comment": "Oh fk u half a decade later",
            "score": 0,
            "author": "LandAmbitious4073"
        }
    ]
}