{
    "id": "144h3pm",
    "score": 93,
    "title": "Nielsen Streaming Top 10: ‘Citadel’ Struggles to Find an Audience",
    "author": "Chemical-Ad-2694",
    "date": 1686249180.0,
    "url": "https://www.reddit.com/r/television/comments/144h3pm",
    "media_urls": [
        "https://variety.com/2023/tv/news/citadel-ratings-nielsen-viewership-low-1235637650/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I wonder if Amazon would invest a lot in a franchise with at least 3 spin off series if the first one is already lackluster. The only ones smiling are the Russo brothers.",
            "score": 76,
            "author": "SilverCarbon",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Russo brothers have completely fallen off  after their work with Marvel. They went from making some of the most celebrated blockbusters of the past decade, to some really generic straight-to-streaming movies. I’m starting to think Kevin Feige was the only key to their success.",
                    "score": 74,
                    "author": "Paolo94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Marvel’s a factory, they work well in that system but it’s wild that they ever managed to position themselves as anything but, like, the John Glen of the 2010s. Him directing a bunch of Bond movies never meant that Aces: Iron Eagle III was gonna win Best Picture.",
                            "score": 32,
                            "author": "Aragola"
                        },
                        {
                            "level": 2,
                            "comment": "Lol except for their production of EEAAO",
                            "score": 2,
                            "author": "LamarMillerMVP"
                        },
                        {
                            "level": 2,
                            "comment": "Their company co-produced Everything Everywhere all at once. That’s a huge one for them.\n\nEdit: And Gray Man which they wrote and directed was a big success. Most watched movie in 84 countries when it came out on Netflix.",
                            "score": 6,
                            "author": "Aggressive_Height345",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gray Man was one of the most forgettable movies I’ve seen in ages. It was enjoyable to watch, but I couldn’t tell you much of what happened other than some vague setup of some scenes.",
                                    "score": 42,
                                    "author": "Auran82",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve no intentions of watching it, I get that feel from the trailer. Regardless, it was a big hit and one of Netflixes best performers.",
                                            "score": 12,
                                            "author": "Aggressive_Height345",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m in the minority literally and figuratively but I really enjoyed it.  Actually saw it twice.",
                                                    "score": 11,
                                                    "author": "Maleficent-Stuff-858"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Got to be bad at one point. :(",
                                            "score": 1,
                                            "author": "almo2001"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean their marvel stuff wasnt great either",
                            "score": -1,
                            "author": "Levonorgestrelfairy1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Captain America winter soldier wasn't great? It's considered one of the best of the marvels...",
                                    "score": 12,
                                    "author": "Ihaveafordquestion",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Great compared to what? Other slick MCU films? That’s damning by faint praise.",
                                            "score": 11,
                                            "author": "VulcanVulcanVulcan"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Best of the marvels wowee",
                                            "score": 0,
                                            "author": "hurdygurdyyy"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Its hot garbage.\n\nWidow and Fury and dumbed down the entire time, the scene with the Zola missle is laughably ridiculous. \n\nHell they couldent even keep track of Sam's suit, it magically appears on the bridge fight",
                                            "score": -13,
                                            "author": "Levonorgestrelfairy1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bait! Get ya bait here!",
                                                    "score": 6,
                                                    "author": "HotTubTimeMachine88",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean everything I said was true.",
                                                            "score": -4,
                                                            "author": "Levonorgestrelfairy1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm with you. It's definitely not the worst marvel film, but it's aggressively mediocore and highly overrated.",
                                                                    "score": 1,
                                                                    "author": "CoffeeandTeaBreak13",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's a political thriller for people who don't watch political thrillers because they dislike the genre.",
                                                                            "score": 0,
                                                                            "author": "FrameworkisDigimon"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's kind of funny that you even still watch them lol",
                                                    "score": 2,
                                                    "author": "obvious-but-profound"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If a dogshit is called the best dogshit when its compared to other shit its still a god damned dog shit",
                                            "score": -1,
                                            "author": "yaegerino"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You are high lol. All four of their marvel projects are top 10 in the franchise.",
                                    "score": 1,
                                    "author": "HotTubTimeMachine88",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think that is saying much at all.",
                                            "score": 0,
                                            "author": "VulcanVulcanVulcan"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Kevin seems to know how to squeeze greatness out of great directors.",
                            "score": 1,
                            "author": "goliathfasa"
                        },
                        {
                            "level": 2,
                            "comment": "Infinity War and Endgame are style over substance.\n\nThe basic trick of the films is to first pretend that they're separate movies, instead of Part One and Part Two of the same thing.\n\nOnce you get through that trick, what you see is that they systematically dismantled the Thor storyline in order to gaslight the audience into ignoring that what Thor does in Infinity War is the exact same shit that made him unworthy in Thor. This would be fine if they commit to the bit. But they don't. So, instead of Thor's getting a speech about how worthiness is a crock of shit and not taking Mjolnir, Thor gets the speech and still takes it. Endgame sort of gets away with it, but Thor Love and Thunder had to deal with the mess and it turns out they couldn't manage to reconcile the bizarre storytelling.\n\nSimilarly, let's talk about Hulk. Or, rather, let's talk about the increasingly delusional interviews the Russos have given about these movies. Like, these guys are literally saying Marvel's equivalents of \"wizards used to shit on the floor\" and no-one really noticed, except people who were already complaining about how they tried to tell basically a whole Hulk movie offscreen. Like, most of these problems are really writing complaints (as is the case with 99% of criticisms about films), but the Russos were in charge of directing the film and it's the direction that created the impression Hulk was scared.\n\nBut the thing is that these criticisms are actually visible in their other MCU work. Have you ever heard the idea that Whedon doesn't get Captain America? Honestly, I think that's a delusional take... Captain America is not Superman, even the main continuity isn't *actually* a paragon character (read an X-Men or a Runaways comic). However, the main thing is that people who say this claim that the Russos \"fixed\" MCU Cap. What this actually means is that they ignored prior characterisation (like they did with Thor and Hulk, and Loki) and substituted what they wanted to do instead.\n\nWhat we're looking at is a body of work by a creative team (the Russos, Markus and McFeely) who have routinely demonstrated a tendency to make bad choices, that just so happened to work out. People who have bad ideas will generally tend to keep having bad ideas. I prefer to blame M&amp;M, but maybe the evidence is suggesting they were good little soldiers implementing poor takes by the Russos.",
                            "score": -2,
                            "author": "FrameworkisDigimon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; a tendency to make bad choices, that just so happened to work out. \n\nSo if someone has a history of making 'bad choices' that turn out to be correct you still consider them bad choices?",
                                    "score": 1,
                                    "author": "GnarlyBear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They didn't turn out to be correct. People just ignored them.",
                                            "score": 1,
                                            "author": "FrameworkisDigimon"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Let's not shit completely on the Russos. They haven't fallen off. They're just showing their weekness and instead Kevin Feige's strength: creativity and storytelling. The Russo bros are great directors, they just suck at the writing/creative part of the job. Their Marvel movies were great cause Marvel literally has a parliament of people whose sole job is to worry about crafting the best story possible ans making it fit within the larger frame of the MCU. Now that the Russos are out on their own, they no longer have this creative support system..and it shows.",
                            "score": 1,
                            "author": "BillyThe_Kid97"
                        },
                        {
                            "level": 2,
                            "comment": "And Citadel is just SHIELD vs Hydra.",
                            "score": 1,
                            "author": "KrzysztofKietzman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're definitely going ahead with season 2 but contracts were already signed and show renewed even before the series aired.",
                    "score": 3,
                    "author": "purpledreign"
                },
                {
                    "level": 1,
                    "comment": "I strongly suspect that the other spin-offs will never get made. Just consign them to development hell.",
                    "score": 1,
                    "author": "VulcanVulcanVulcan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oof Amazon probably regretting the cheques they wrote for this show.",
            "score": 11,
            "author": "crazywalls"
        },
        {
            "level": 0,
            "comment": "Man, I was really high on Richard Madden after The Bodyguard. Like, the first 10-15min of that series was absolutely electric. As I remember, it was mostly just RM looking worried, and then trying to **not** look worried in front of the kids he was with, *and then* getting more and more worried as shit was going south, but trying to keep it together for the kids...\n\nAnd I was totally mesmerized - terrific performance, with a lot of vulnerability and compassion, and an amazing showcase for dude's talents. I found the rest of the series pretty \"meh\" but I was left with the distinct impression that Richard Madden was **The Real Deal** and a bona fide star, and he that was destined for bigger/better things.\n\nI (mostly) watched Citadel and... It's kind of hard to remember what it was that I liked about Richard Madden.\n\nI was *aware* of who Priyanka Chopra-Jonas is, but Citadel was my first time *really* seeing her in something, so I was kind of looking forward to assessing her acting ability/star-power... And... I was not particularly impressed - I have no idea how/why she got to be where she is today. She wasn't *bad*, exactly... just ... there, I guess?\n\nIn sports terms, I feel like this has got to be bad coaching. I think Richard Madden has talent, I'm assuming Priyanka does too... I feel like these are talented stars who are being misused in a scheme that doesn't play to their strengths.\n\nAlso, the material just isn't that good. There isn't a whole lot there for them to work with.\n\nAnyway, I hope Richard Madden finds the right project... Something that plays to his strengths, and makes him into a big star. Not because he seems like a nice guy or anything, but because I want to be proven correct as an evaluator of talent/star-power LOL.",
            "score": 48,
            "author": "Addtrack",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the American accent really affected his performance. He mentioned struggling with it in interviews",
                    "score": 29,
                    "author": "Valiantheart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fucking christ, why wouldn't they just let him use his accent. I hear it coming in and out in the show. It keeps making me second guess stuff.",
                            "score": 37,
                            "author": "HotTubTimeMachine88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Especially when they're supposed to be part of some sort of international spy organisation.",
                                    "score": 18,
                                    "author": "TheIllusiveGuy"
                                },
                                {
                                    "level": 3,
                                    "comment": "American viewers are very comfortable with British secret agents. Baffling decision.",
                                    "score": 1,
                                    "author": "VulcanVulcanVulcan"
                                },
                                {
                                    "level": 3,
                                    "comment": "We find out why in the finale.",
                                    "score": 1,
                                    "author": "North_Carpenter6844",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm probably not going to watch it for a while. So, I'm not concerned if you spoil it. Was he a triple brain erased agent?",
                                            "score": 2,
                                            "author": "HotTubTimeMachine88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;!Evil British lady in the beginning of the series is his mom who abandoned him and he hid his accent the whole time out of resentment lmao !&lt;",
                                                    "score": 6,
                                                    "author": "bootybounce212"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Richard Madden is a terrific actor tho, any good actor has stinkers it happens but his career have been pretty solid.",
                    "score": 18,
                    "author": "frenin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean he’s fine, but he’s not my go to for dramatic chops",
                            "score": 0,
                            "author": "1204Sparta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's had his fair share of dramatic roles.",
                                    "score": 2,
                                    "author": "frenin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He’s done them sure and he was fineeee",
                                            "score": 1,
                                            "author": "1204Sparta"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I thought The Bodyguard was great for most of its run but the ending was not so good.",
                    "score": 3,
                    "author": "RItoGeorgia"
                },
                {
                    "level": 1,
                    "comment": "It was a terrible screenplay. She had nothing to work with.",
                    "score": 1,
                    "author": "almo2001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They lost me when buddy forgot-his-training drops 2 of 3 bad guys point blank with headshots and lets the bosslady run literally 100m to get into the building without a shot.\n\nWe're talking WB's The Flash levels of letting the bad girl get away BS.",
            "score": 8,
            "author": "Burstar1"
        },
        {
            "level": 0,
            "comment": "Shit like this getting made boggles the mind tbh",
            "score": 26,
            "author": "MrConor212"
        },
        {
            "level": 0,
            "comment": "They're really trying hard to make Priyanka Chopra a star. But everything she's in seems dull as dirt.",
            "score": 9,
            "author": "44035"
        },
        {
            "level": 0,
            "comment": "I couldn't make it past episode 2. And even those first 2 episodes were not enjoyable for me.",
            "score": 6,
            "author": "Juan-Claudio",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't get past the first convo between Colin and Priyanka. It was so bad.",
                    "score": 2,
                    "author": "almo2001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s struggling to find an audience because it’s one of the worst shows on TV, full of baffling decisions like why Richard Madden had to have a (bad) American accent—American viewers are very comfortable with British secret agents! And why despite spending $300 million or whatever, it looks absolutely terrible, like a show from the 90s.",
            "score": 4,
            "author": "VulcanVulcanVulcan"
        },
        {
            "level": 0,
            "comment": "Jenny Salke probably be using a tablecloth to wipe that sweat off of that important sized forehead of hers",
            "score": 10,
            "author": "anasui1"
        },
        {
            "level": 0,
            "comment": "The citadel spin-off sneak peak at the end of the last episode already looks much better than this",
            "score": 6,
            "author": "mkmichael001",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m pretty sure that Italian spin-off is being made by some of the production companies behind Zero Zero Zero!",
                    "score": 7,
                    "author": "lightsongtheold",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Such a good show.",
                            "score": 1,
                            "author": "PoorThin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile Netflix keeps dominating Nielsen Top 10 while reddit acting like Netflix is dying. Also Nielsen covers only US so Netflix having more subscribers worldwide has nothing to with this.",
            "score": 19,
            "author": "16meursault",
            "replies": [
                {
                    "level": 1,
                    "comment": "Netflix also has more subscribers in the US or do you deny this? Amazon looks like it is close because it counts all Prime subscribers who use the service for packages and who might never actually watch a Prime show in their lives.",
                    "score": -2,
                    "author": "VitaLonga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Netflix also has more subscribers in the US or do you deny this?\n\nIsn't that a compliment to its strength?",
                            "score": 13,
                            "author": "frenin"
                        },
                        {
                            "level": 2,
                            "comment": "Comparing to worldwide subscriber numbers the difference in US is far less so Netflix dominating Nielsen Top is a succes on their behalf, especially while there is Netflix dying circlejerk. Also Netflix has more subcribers and is still increasing their subcriber numbers because their shows get attention from all kind of people so their subscriber number isn't just reason of this list but also it is result of it.",
                            "score": 9,
                            "author": "16meursault"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazon: we use Hollywood to money launder, which is why we blow so much money on crap.",
            "score": 2,
            "author": "CatsLikeCuddles"
        },
        {
            "level": 0,
            "comment": "I want to watch this, but my backlog of shows is huge.",
            "score": 7,
            "author": "CrassDemon",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I want to watch this\n\nbut why",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It looks like a fun, buddy, action, thriller show.",
                            "score": 2,
                            "author": "CrassDemon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You’ll have plenty of time to catch up with the writers strike kicking in. Gonna be a desert of new programming in six months or so.",
                    "score": 7,
                    "author": "reddig33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very true.",
                            "score": 3,
                            "author": "CrassDemon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Go ahead and watch.  It's good popcorn tv",
                    "score": 2,
                    "author": "inabed"
                },
                {
                    "level": 1,
                    "comment": "You're not missing anything",
                    "score": 4,
                    "author": "im_a_dick_head"
                },
                {
                    "level": 1,
                    "comment": "No you don’t.",
                    "score": 3,
                    "author": "StuffonBookshelfs"
                },
                {
                    "level": 1,
                    "comment": "Don't bother.",
                    "score": 1,
                    "author": "almo2001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find it hilarious that both Citadel and RoP are being outperformed by Jury Duty, a show that cost maybe 1/100th as much and received no promotion.",
            "score": 7,
            "author": "ImperialSympathizer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jury Duty absolutely doesn't have more views than ROP lol",
                    "score": 11,
                    "author": "Chilis1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let him dream bro.",
                            "score": 2,
                            "author": "frenin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do I feel like this show was supposed to launch Richard Madden into action star territory for future projects? Clearly someone wants to make him happen, and I do too, so it’s sad this project flopped.",
            "score": 4,
            "author": "CeaseFireForever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bodyguard already did that. But between Eternals and Citadel, his two big swings since then have both been spectacular misfires.",
                    "score": 2,
                    "author": "NeoNoireWerewolf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact that they didn't want to pay for the final 3 seasons of The Expanse and would prefer to make this garbage or RoP boggles the mind.",
            "score": 3,
            "author": "Jonny_Be_Good",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Expanse is super niche, and after wrapping up the Marco storyline the series jumps into the future in the books, and it would probably take a recast.",
                    "score": 2,
                    "author": "KurtisMayfield"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It never had a shot at the top 10 because its run time is so low… being awful was just a bonus.",
            "score": 2,
            "author": "VitaLonga",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely worth noting that the whole runtime for the series is just around 4 hours. That will absolutely impact on its chances of making the Nielsen charts while viewing minutes remains the basic metric. I wish Neilson and Netflix would switch to equivalent complete viewings as the standard metric. It allows for better direct comparisons.",
                    "score": 5,
                    "author": "lightsongtheold"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazon usually makes good shows but recently they've been really missing the ball",
            "score": 2,
            "author": "im_a_dick_head",
            "replies": [
                {
                    "level": 1,
                    "comment": "They've been inconsistent too. I love vox machina",
                    "score": 10,
                    "author": "WittyPerception3683",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "New seasons are good but I mean New shows. But yeah I guess vix machina is kinda recent",
                            "score": 1,
                            "author": "im_a_dick_head"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Usually? Citadel, Wheel of Time, Rings of Power?",
                    "score": -1,
                    "author": "Valiantheart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you miss the word \"recently\"?",
                            "score": 4,
                            "author": "im_a_dick_head",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Before these most of the Amazon shows were made by others and sold to them like Bosch or the Expanse.\n\nThey don't even make the Boys themselves",
                                    "score": 4,
                                    "author": "Valiantheart"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You named 3 shows out of 50+ Amazon originals",
                            "score": 1,
                            "author": "Petya415z"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll watch it if it has a beginning, middle and end rather than simply a beginning, meander and cancelled.",
            "score": 1,
            "author": "The_Lone_Apple"
        },
        {
            "level": 0,
            "comment": "Surprised it was renewed",
            "score": 1,
            "author": "Orangie87"
        },
        {
            "level": 0,
            "comment": "Watching the first like 10 minutes I thought this was gonna be pretty great... then I couldn't make it past episode 2, not sure how that happens.",
            "score": 1,
            "author": "TheElusiveFox"
        },
        {
            "level": 0,
            "comment": "Call me dumb but I love everything the russos touch... Except everything everywhere all at once.",
            "score": 1,
            "author": "donutdong"
        },
        {
            "level": 0,
            "comment": "This looks dumb. Plus, if there's not a second season I will not watch it (unless it's limited series). Too many times I get to like a show and no season 2. No more!!",
            "score": 1,
            "author": "queentracy62"
        },
        {
            "level": 0,
            "comment": "Well, the dialogue in Citadel is absolutely terrible. The worst of TV writing where they try to make everything \"nice\". It's just so painfully dull. They spent too much money to take any risks with it. It's Disney-style comfortable spectacle. :(",
            "score": 1,
            "author": "almo2001"
        },
        {
            "level": 0,
            "comment": "For something like this to work, the stars need to sizzle with one another. They have to have that indefinable chemistry that can lift so-so material to the heights. The Citadel cast two industry up-and-comers who don't seem to connect, and don't even seem to be particularly exciting individually. In a way, the series proves that even today, combustible stars are necessary even in the flimsiest of vehicles.",
            "score": 1,
            "author": "Volcano_Tequila"
        },
        {
            "level": 0,
            "comment": "Good thing they cancelled the expanse and didn’t finish the last couple seasons…",
            "score": 1,
            "author": "mbn8807"
        },
        {
            "level": 0,
            "comment": "I wonder if it has something to do with the show being a mediocre pile of crap?",
            "score": 1,
            "author": "DopeAbsurdity"
        },
        {
            "level": 0,
            "comment": "Amazon is guilty of creating a world in which they are no longer special. \n\nLike Howard Stern did with Shock Jocks.",
            "score": 1,
            "author": "bobbyOrrMan"
        },
        {
            "level": 0,
            "comment": "\nWheel of Time\n\nRings of Power\n\nCitadel\n\nAll combined for over 1.5bn budget I believe.\n\nGood fucking luck getting that money back",
            "score": 1,
            "author": "bloodydingbat"
        },
        {
            "level": 0,
            "comment": "I couldn't bring myself to watch the last episode. Boring and by the numbers.",
            "score": 1,
            "author": "FunTimeComplain"
        },
        {
            "level": 0,
            "comment": "Why do I feel like this show was supposed to launch Richard Madden into action star territory for future projects? Clearly someone wants to make him happen, and I do too, so it’s sad this project flopped.",
            "score": -7,
            "author": "CeaseFireForever"
        },
        {
            "level": 0,
            "comment": "Why do I feel like this show was supposed to launch Richard Madden into action star territory for future projects? Clearly someone wants to make him happen, and I do too, so it’s sad this project flopped.",
            "score": -6,
            "author": "CeaseFireForever"
        }
    ]
}