{
    "id": "144qwij",
    "score": 13,
    "title": "The Crowded Room - Series Premiere Discussion",
    "author": "LoretiTV",
    "date": 1686272556.0,
    "url": "https://www.reddit.com/r/television/comments/144qwij",
    "media_urls": [
        "https://www.reddit.com/r/television/comments/144qwij/the_crowded_room_series_premiere_discussion/"
    ],
    "other_urls": [
        "https://tv.apple.com/us/show/the-crowded-room/umc.cmc.495pmjg441gg3j70j3x2yufx9)",
        "https://www.metacritic.com/tv/the-crowded-room/season-1)]",
        "https://www.metacritic.com/about-metascores))",
        "https://m.imdb.com/title/tt14417718/)",
        "https://en.m.wikipedia.org/wiki/The_Crowded_Room)",
        "https://youtu.be/4w1xZA7pX2c)"
    ],
    "postText": "#**The Crowded Room**\n\n**Premise:** In Manhattan in the summer of 1979, a young man is arrested for a shocking crime, and an unlikely investigator must solve the mystery behind it before the true criminal strikes again.\n\n**Subreddit(s)**: | **Platform:** | **Metacritic:** | **Genre(s)**\n:--:|:--:|:--:|:--:|:--:|\n**r/TheCrowdedRoom** | [Apple TV+](https://tv.apple.com/us/show/the-crowded-room/umc.cmc.495pmjg441gg3j70j3x2yufx9) | [[49/100](https://www.metacritic.com/tv/the-crowded-room/season-1)] ([score guide](https://www.metacritic.com/about-metascores))| Drama, Psychological thriller\n\n**Links:**\n\n* [IMDb](https://m.imdb.com/title/tt14417718/)\n* [Wikipedia](https://en.m.wikipedia.org/wiki/The_Crowded_Room)\n* [Trailer](https://youtu.be/4w1xZA7pX2c)",
    "comments": [
        {
            "level": 0,
            "comment": "I've liked the first 3 episodes overall, definitely slow at times. I've seen enough reviews that say it's only slow for the first 5 episodes and then gets a lot better the back half of the series. The production quality is good, Apple shows usually are though. I think the acting and cinematography have been good so far, the writing isn't the strongest but episode 3 was the best out of them. I also know nothing about what the show is based on, so I can understand the criticism some people have said about knowing what the mystery is and then the show being too slow to get there, which apperantly happens in episode 6. But as someone who doesn't know it's probably a bit more enjoyable.\n\nStill not sure if I'll watch weekly or just binge it when it's all done.",
            "score": 1,
            "author": "KeeperofOrder"
        },
        {
            "level": 0,
            "comment": "How many episodes did release and what's the schedule?",
            "score": 2,
            "author": "MrZeral",
            "replies": [
                {
                    "level": 1,
                    "comment": "The first 3 got released and then 1 episode every Friday, 10 episodes total for the show.",
                    "score": 1,
                    "author": "KeeperofOrder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly like it, the storyline is interesting, I also enjoy most of the actors.",
            "score": 3,
            "author": "SprinklesCharming382"
        },
        {
            "level": 0,
            "comment": "I'm enjoying it so far. I think the show does a great job of building up a sense of hopelessness for Danny. The pacing of this in the early episodes is just right -- on the brink of feeling overwhelming, but not completely defeating. Something comes through for him at the very last minute. I also enjoy that Danny is an unreliable narrator, and I think that justifies some of the fast transitions / cuts in the storytelling.\n\nI also like the stark contrast between general awareness of mental health in 70s and now, when it feels like there is less stigma with talking it than ever. \n\nThe show feels like a work of literary fiction put on screen and I think the dialogue + acting could be better, but it's not *that* bad. I don't see what many people seem to not like about it.",
            "score": 2,
            "author": "thoughthrottle"
        },
        {
            "level": 0,
            "comment": "I had to start over and still lost interest. I'll wait for the season to be over to see if the consensus changes.",
            "score": 2,
            "author": "KingKingsons"
        },
        {
            "level": 0,
            "comment": "You'll either get aggressively ok or trash from Akiva Goldsman. This is the latter. \n\nTom Holland needs to fire his agent.",
            "score": 4,
            "author": "NachoMarx",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Tom Holland needs to fire his agent.\n\nFor real. Cherry and Crowded Room (I only finished Ep1) makes it clear that Holland simply can't play these roles.",
                    "score": 4,
                    "author": "Su_Impact",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "how so?",
                            "score": 0,
                            "author": "MrZeral"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ya its bad",
            "score": 4,
            "author": "Rare-Purpose-7426"
        },
        {
            "level": 0,
            "comment": "What else do you expect from akiva goldsman",
            "score": 4,
            "author": "Vidhu23"
        },
        {
            "level": 0,
            "comment": "Couple episodes in... It's not great? Maybe just one too many things are 'off' in a way, acting, pacing, score, like it's hard to pinpoint why it's not totally working. I might continue watching at some point down the line",
            "score": 10,
            "author": "neosEngorgedPhallus"
        },
        {
            "level": 0,
            "comment": "this is a strangely bad show, in terms of acting. it feels so stilted, some of Tom's lines (especially in the first scene) are delivered like a rock\n\nthe dialogue has some misses, which is a shame because the plot seems ok generally speaking. Apparently the pilot is the weakest episode, but poor acting doesn't really get fixed so easily. \n\nI'm usually easy to please, but I am gonna stop midway throw the pilot and call it quits",
            "score": 12,
            "author": "magkruppe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm 3 episodes in and I gotta disagree with the acting. Tom is playing a strange, anxiety ridden, scared boy. His lines are delivered in such a manner. Atleast, that's just my opinion. I'm no expert, but I thought he was acting the part very well in the episodes I've watched. \n\nI really like the show overall. Episodes 2 and 3 are definitely better than the 1st, but I didn't hate the first either. \n\nAlso, glad to see more Emma Laird. She was great in Mayor of Kingstown.",
                    "score": 6,
                    "author": "CosmicLars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I also feel like Tom's stiltedness is intentional -- there's something 'off' about him, but it just reads as part of the character. \n\nEveryone's split reactions are so interesting. I've read so many critiques on the first three episodes about things that I'm just not seeing -- makes me curious as to how the rest of the season goes.",
                            "score": 2,
                            "author": "FlyingButtocks"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It gets better, but there’s just something wrong about it, like nobody gave a shit about what they’re making. Sometimes it’s tragically bad, like intentionally bad. I felt like I was finally getting interested by the end of episode three, but knowing the twist, it just makes everything senseless.",
                    "score": 6,
                    "author": "itchybitchybitch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ah, this is the show that explains that ugly long hair Holland was rocking for almost an entire year lol",
            "score": 17,
            "author": "MrBoliNica"
        },
        {
            "level": 0,
            "comment": "I have really enjoyed the first 3 episodes so far",
            "score": 21,
            "author": "Effective-Celery8053"
        },
        {
            "level": 0,
            "comment": "Watching Tom Holland's hair go back and forth between Paul Dano hair and Timothée Chalamet hair.\n\nPilot was bad, releasing the first 3 episodes was probably a good idea.\n\nYes, I know the 'twist' and the source material.\n\nEdit: this series is really, really bad. I'd quit acting for a while if I were involved in this, too.",
            "score": 11,
            "author": "ddbaxte",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was disappointed that paying attention to the credits gives away the twist.",
                    "score": 7,
                    "author": "pnmartini",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What twist really? It’s literally been promoted as “inspired by Billy Milligan”. Hard to “give away the twist” if the twist has been talked about in all the show’s promotion.",
                            "score": 2,
                            "author": "itchybitchybitch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Imagine if you will that someone hasn’t seen the promotions, or know anything about Billy Milligan….hard to believe, I know.\n\nIn that case, this someone might be disappointed by a major plot point being spoiled.",
                                    "score": 8,
                                    "author": "pnmartini",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well yeah, I can totally believe that, but in case someone knows nothing about the show and haven’t even seen trailers, why would they want to watch it? \n\nAlso I don’t know how you can actually be spoiled by credits, if you mean opening credits. It’s basically an animation that would say nothing to you if you didn’t know the twist beforehand.",
                                            "score": 1,
                                            "author": "itchybitchybitch",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well, I watched it because it was new, and I was bored. What the credits do is &gt;!mention the title of the book *The Minds of Billy Milligan*. This foreshadows the main character having dissociative personality disorder!&lt;",
                                                    "score": 4,
                                                    "author": "pnmartini",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Agreed. As someone who didn’t know of Billy Milligan, seeing this book title in the opening sequence also spoiled the “twist” for me. \n\nAlso, the only promo I’d heard about this series was that the character caused Tom to explore some new-to-him, mentally-taxing, emotional depths and that’s what drove him to want to take a year off. That seemed convincing enough for me to give it a try.",
                                                            "score": 5,
                                                            "author": "Lucky-Sort2269"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s not a good score",
            "score": 16,
            "author": "blunun",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also a bad score",
                    "score": 8,
                    "author": "super_sayanything"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had no idea this was releasing today.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}