{
    "id": "146k09i",
    "score": 26,
    "title": "Has a talk show host ever been attacked by an animal during an interview?",
    "author": "Groundbreaking_Pea61",
    "date": 1686456433.0,
    "url": "https://www.reddit.com/r/television/comments/146k09i",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was just wondering has a late night talk show host ever been bitten or attacked by an animal during an interview ?",
    "comments": [
        {
            "level": 0,
            "comment": "Johnny Carson got a ferret stuck on his finger.",
            "score": 49,
            "author": "JtheBrut54",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also a marmoset (or something) took a whiz during an appearance.",
                    "score": 7,
                    "author": "NoOneShallPassHassan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "On his head too! If I recall correctly.",
                            "score": 4,
                            "author": "xoomax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Now why do they call this a 'urine' monkey?\"",
                                    "score": 3,
                                    "author": "AlfredosSauce"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How has nobody posted this it’s the best one\n\nhttps://youtu.be/BTuBBhvSD2Q",
                    "score": 6,
                    "author": "TheBrainwasher14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty sure it happened once to Brian Fellows",
            "score": 35,
            "author": "tittiesfarting",
            "replies": [
                {
                    "level": 1,
                    "comment": "That bird is a liar!",
                    "score": 14,
                    "author": "ymcameron"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the host specifically, but I remember a hawk once raised hell on the revamped merv griffin show when some idiot brought a squirrel on set",
            "score": 28,
            "author": "nowadaysyouth"
        },
        {
            "level": 0,
            "comment": "Didn't a bear attack somebody once? I remember seeing it on a blooper show",
            "score": 11,
            "author": "Solidsnakeerection",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was a Russian talk show I think. I saw that.",
                    "score": 9,
                    "author": "gumyrocks22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The video is here:\n\nhttps://youtu.be/lgPjlroothk\n\nThe idiots running the show told a woman to sit down next to a bear when the bear wasn’t looking. Then, when the bear turned around and saw her pop out of nowhere, it instinctively attacked. The trainer also deserves blame, for not being knowledgeable or attentive enough to prevent it.",
                            "score": 12,
                            "author": "Gorf_the_Magnificent"
                        },
                        {
                            "level": 2,
                            "comment": "Was it the one where a guy in a gi comes out and starts karate chopping the bear?",
                            "score": 1,
                            "author": "Solidsnakeerection",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t remember that 😂😂",
                                    "score": 1,
                                    "author": "gumyrocks22"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Conan used to use that clip a lot back in the day. I remember a throwaway bit where he said he had the latest scene from the new Lord of the Rings movie, and it was just that bear clip with a cheap dub saying \"gimme that ring!\" I laughed so hard.",
                    "score": 3,
                    "author": "44problems"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. [Monkeys attacked David Letterman](https://www.youtube.com/watch?v=0MVA6Spl7PQ) throughout a segment with a lady that trained them - just not very well.",
            "score": 10,
            "author": "deviousmajik"
        },
        {
            "level": 0,
            "comment": "Krusty for sure got attacked by animals on his show",
            "score": 10,
            "author": "FromDwight",
            "replies": [
                {
                    "level": 1,
                    "comment": "LOUD!? That’s our secret word of the day!",
                    "score": 6,
                    "author": "Pvt_Wierzbowski"
                },
                {
                    "level": 1,
                    "comment": "Somebody shoot it!",
                    "score": 3,
                    "author": "ElderCunningham"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Crispin Glover tried to roundhouse kick Letterman once!",
            "score": 9,
            "author": "miseenplastique"
        },
        {
            "level": 0,
            "comment": "Anyone who dared interview Emu",
            "score": 8,
            "author": "listyraesder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cassowaries are way worse. Emus win wars. Cassowaries commit war-crimes.",
                    "score": 2,
                    "author": "AnAussiebum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not an Emu, but *the Emu.*",
                            "score": 3,
                            "author": "Havok-303",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\\*The\\* Emu in polite conversation with Jonny Carson and Richard Pryor.\n\n[https://www.youtube.com/watch?v=Rij98IEtl\\_E](https://www.youtube.com/watch?v=Rij98IEtl_E)\n\nEmu wins.",
                                    "score": 2,
                                    "author": "draxenato",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's top mate. Never saw this before, just made my day.",
                                            "score": 1,
                                            "author": "Havok-303"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does it count if the animal is the host? Because there was that time Ben the Bear attacked one of his handlers before collapsing on the audience injuring some.",
            "score": 4,
            "author": "sellyourselfshort",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ben, no!",
                    "score": 3,
                    "author": "Pvt_Wierzbowski"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the host, but a kinkajou pissed all over Jack Hanna (on Letterman, I think). Jack was not amused *at all* and took it out on the keepers/handlers off screen. \n\nSource: I know one of said keepers",
            "score": 6,
            "author": "itwillmakesenselater"
        },
        {
            "level": 0,
            "comment": "Conan used to have a running bit on his OG talk show where he had this young animal expert/zoologist on his show named Jarod Miller who would always bring some random exotic creature or whatever, and every time the animal would act a fool and Conan would freak out and the animal would react by acting wilder and Conan would berate Jarod and Jarod would look exasperated and inexperienced and unable to control the creature. \n\n[This reddit post has links in the top comment to a bunch of videos of the shenanigans.](https://www.reddit.com/r/videos/comments/1duzyb/hilarious_conan_vs_jarod_miller_the_inexperienced/)\n\n[Also, there’s a very famous example from the 90’s where the host wasn’t necessarily attacked, but another (surprise) guest was seemingly ravaged by a bird of prey…](https://youtu.be/p6BekOnLx9c)\n\nThe legend himself, Cosmo Kramer, hosted a short lived avant-garde experimental talk show out of his apartment and one episode featured Jim Fowler from Wild Kingdom, appearing with a hawk. \n\nWhile Jim was waiting for his segment on the stage, noted multi-hyphenate hero marine biologist and architect Art Vandelay crashed the show in an unscheduled appearance with a squirrel he had just rescued from the clutches of certain death. \n\nFowler quickly informed Art, the rest of the panel, and the audience, “hawks and squirrels don’t get along together,” that in fact “hawks eat squirrels.”\n\nAnd sure enough, right on cue the Hawk attacked both Dr. Vandelay and the squirrel, though the director censored whatever happened on that stage in that one bedroom New York apartment and quickly cut to the credits, ending the episode prematurely. \n\nWe never do find out how badly Vandelay or his pet squirrel fared when the Hawk swooped on them. The only thing observed was the audio of a couple seconds of some screams of terror emanating from Vandelay and a blink-and-you’ll-miss-it shot of a gleeful sociopathic postal worker who served as Kramer’s cohost reacting before the credits rolled over the feminine shrieks of the short, stocky, bald marine biologist who apparently slept through all the zoology classes that focused on the animals that spend their lives on land or in the air.",
            "score": 26,
            "author": "8i66ie5ma115",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember one clip Jarod brought out a kangaroo that started to attack him and Conan picked him up like a small child to get him out of the way. Around 7:00 https://www.youtube.com/watch?v=ry1S21B139s they both get attacked by a few animals in that video, a rattlesnake strikes both at Jarod and Conan, Conan gets nipped by a lion cub",
                    "score": 5,
                    "author": "Truethrowawaychest1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, there was an anchor for 9News in Colorado that was bitten by a dog live on the air a few years ago.",
            "score": 5,
            "author": "SkyfallCamaro"
        },
        {
            "level": 0,
            "comment": "Does this count ?\n\n[https://www.bbc.co.uk/archive/rod-hull-and-emu-on-parkinson/zh7tjhv](https://www.bbc.co.uk/archive/rod-hull-and-emu-on-parkinson/zh7tjhv)",
            "score": 8,
            "author": "draxenato",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was gonna post this, I'll have to get up a lot earlier next time.",
                    "score": 1,
                    "author": "Havok-303"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A bald eagle snapped at the president on TV. Does that count?",
            "score": 7,
            "author": "trite_post"
        },
        {
            "level": 0,
            "comment": "Close enough at 5:44 and 7:10 (but watch the whole thing for the build up): https://www.youtube.com/watch?v=0MVA6Spl7PQ",
            "score": 3,
            "author": "CableCoShow"
        },
        {
            "level": 0,
            "comment": "A couple of amazing ones on Australian television:\n\n[Marty Monster vs Kangaroo](https://youtu.be/JUz93v_s18A)\n\n[And then there's this](https://youtu.be/FU2UHcqatkA)",
            "score": 3,
            "author": "sofewcharacters"
        },
        {
            "level": 0,
            "comment": "I'm pretty sure Emu fucked up every talk show host he met while Rod Hull just let it happen.",
            "score": 3,
            "author": "hugehand"
        },
        {
            "level": 0,
            "comment": "That animal Hulk Hogan ~~have~~gave Richard Belzar a concussion.",
            "score": 4,
            "author": "Hollow_Rant",
            "replies": [
                {
                    "level": 1,
                    "comment": "Belzar was the one incisting Hogan do it despite David Schultz slapping the shit out of John Stossel years earlier. \n\nDon't challenge professional wrestlers about it not being real. At least if it's the 80s or 90s. They have anger issues and are all on the drugs.",
                    "score": 1,
                    "author": "Solidsnakeerection",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those two incidents happened within a couple months of each other.  Belzer said he bought a house with the settlement he got from the thing with Hogan.",
                            "score": 3,
                            "author": "CJTus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are correct. The Hogan lawsuit was resolved a few years later and I was mistaken about the timeline",
                                    "score": 1,
                                    "author": "Solidsnakeerection"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gentle Ben",
            "score": 2,
            "author": "BigEvil621"
        },
        {
            "level": 0,
            "comment": "Idk about late night hosts but Steve Irwin once got bit by a venomous snake on air and played it off like it was nothing",
            "score": 2,
            "author": "RoscoeSantangelo"
        },
        {
            "level": 0,
            "comment": "There was that time a drop bear nearly went for a Scottish reporter - https://youtu.be/KCGUNpzjD6M",
            "score": 1,
            "author": "PloppyTheSpaceship"
        }
    ]
}