{
    "id": "c3s9yv",
    "score": 2,
    "title": "This subreddit is shit",
    "author": "DickDieselDaddy1",
    "date": 1561223842.0,
    "url": "https://www.reddit.com/r/HendersonState/comments/c3s9yv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Seriously, if you’re just going to abandon it, then disband it and take it down. It’s a bad look for the school.",
    "comments": [
        {
            "level": 0,
            "comment": "I know people on the inside. Their web guy quit cause he was underpaid and they never replaced him.",
            "score": 2,
            "author": "traugdor",
            "replies": [
                {
                    "level": 1,
                    "comment": "You don’t need a “web guy” to have a subreddit. Any moron could do it? They should delete this bullshit. It makes them look like the school that don’t give a fuck.",
                    "score": 1,
                    "author": "DickDieselDaddy1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well their web guy started messing with it before he quit. I asked him about it before posting this. He said there was too much red tape from administration. He wasn't paid enough to do more than he was asked and administration didn't care about anything outside of the school's official website.",
                            "score": 2,
                            "author": "traugdor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well you need to copy and paste this and tell the president, it LOOKS LIKE SHIT! Reddit is a real forum and it is THE HENDERSON STATE subreddit. Idk if an email to Reddit could get it taken down, but this is a bad look. I’m a graduate and nobody knows Henderson State, so I searched it and what I found is appalling. Mail order colleges have better subreddits. Take it the fuck down or use it. You could assign a fucking GA to do it every semester, it’s an easy fix.",
                                    "score": 1,
                                    "author": "DickDieselDaddy1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This dude has a small dick ^",
                                            "score": 4,
                                            "author": "scottstotts1992"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have absolutely no interest in the university now that I've graduated.. honestly I should just unsubscribe from this subreddit. you can do it if you care that much about it.",
                                            "score": 2,
                                            "author": "traugdor",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t subscribe to it, and I don’t give a fuck about the school, just the football team.",
                                                    "score": 1,
                                                    "author": "DickDieselDaddy1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Then why are we even here? Lol",
                                                            "score": 2,
                                                            "author": "traugdor",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I told you, you dumbass, I’m on Reddit and I searched for my fucking Alma mater and I found this shit show.",
                                                                    "score": 1,
                                                                    "author": "DickDieselDaddy1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This dude has a small dick ^",
                                                                            "score": 3,
                                                                            "author": "scottstotts1992"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}