{
    "id": "10e78pu",
    "score": 1,
    "title": "Obtaining a OneCard",
    "author": "Va1eraine",
    "date": 1673944743.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/10e78pu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, all. I have already registered for classes at Hunter College for the Spring 2023 semester. My only remaining task is to acquire a OneCard, which I am having difficulties doing. As to why, I currently do not have a valid state ID or passport that can be used to prove my identity; the latter expired six years ago. I already made an appointment to get an expedited passport at my local Post Office this Saturday, and I should have it in 3 to 5 weeks.\n\nIn the meantime, what should I do? Should I request that my professors provide a live stream of our in-person classes? Can I use my CCNY Student ID card to obtain day passes at the Visitor's Center Services? Is there a way to sneak into the West Building?\n\nI will greatly appreciate any advice you may send about.",
    "comments": [
        {
            "level": 0,
            "comment": "I believe if you go every time to the Visitor’s Center and say your situation and just provide your CCNY ID Card, they should give you a Visitor’s Pass.",
            "score": 2,
            "author": "LeonZheng646",
            "replies": [
                {
                    "level": 1,
                    "comment": "OK. Thanks for the advice and putting my mind at ease! :-)",
                    "score": 1,
                    "author": "Va1eraine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For the proving my identity part, I just used my high school id and it worked when i was signing up for my one card online. Try using your high school id or CCNY student ID online to see if it works",
            "score": 2,
            "author": "Able-Profession-8786",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Va1eraine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Thank you!\n\nYou're welcome!",
                            "score": 1,
                            "author": "exclaim_bot"
                        }
                    ]
                }
            ]
        }
    ]
}