{
    "id": "10ewnj3",
    "score": 3,
    "title": "STATS 113",
    "author": "Waste-Mastodon-9218",
    "date": 1674012376.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/10ewnj3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm taking Stats 113 in the spring semester, and I'm kinda nervous since I'm hearing professors are just in the background and you're working independently. Can someone share what it's like taking Stats (I'm taking it online), and how you do the writing in stats for your projects?",
    "comments": [
        {
            "level": 0,
            "comment": "In my case, you're always working independently while the professor is just there to take attendance and answer questions if you need help. Ngl, it's been a struggle because the professor isn't teaching. You are responsible for learning all the content by yourself which is hard when it comes down to topics that is so confusing. As long as you are doing the modules  on time, using other sources to help you in completing the modules and studying for the tests, you should be fine. For data days (which are like mini project assignments) you use the programming language \"R\" which the professor will teach you. Sometimes its easy to understand, sometimes not lol.",
            "score": 2,
            "author": "voidsrnx",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you",
                    "score": 1,
                    "author": "Waste-Mastodon-9218"
                },
                {
                    "level": 1,
                    "comment": "just to piggyback off this comment but data days are usually explained a week before in class and idk how other profs did it but ours eventually let us use our notes like the steps for the project during class as we were starting to forget and mess up but don’t be absent or late!! and always get a classmate’s # bc if you miss the explanation of the data days you are doomed",
                    "score": 1,
                    "author": "dustycheetofingerss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stats 113 is literally the worst class I've ever taken my entire life. It doesn't matter who you get as a professor since the way the course works is that you use a website called \"Aleks\" to do all your homework AND learning stuff. My professor basically never taught in class, attendance wasn't mandatory. You have to do \"modules\" on the Aleks website which will teach you how to do certain topics and you have to answer questions based on that.\n\nBeware that you need to get all of the answers correctly IN A ROW for you to move on to the next topic or for you to have to marked as \"complete\". It takes a lot of time and if you're struggling on understanding the material, your professor can't help you because they don't know anything about the website but you have to use the website because it's a requirement from the stats department. There are tutors available though. \n\nThere's also a really big project you can do towards the end. It's like a data research paper. It's NOT required. But it is required if you want an A/A+. What this means is that, the research paper is NOT graded. BUT if you have a 97 average on the class and you don't do the research paper, then you will get an A- on your grade instead of the A+. If that makes sense.\n\nOverall, the worst experience of my life. I've cried so many times when I took this class. My class average was a 95 but I got A- because I didn't do the research project since I needed to do other things for my other classes. Mind you, the research project is a 30+ page paper you need to write based on a data table your professor gives you. I ended up logging in 96 hours worth of homework time on the Aleks website (since it shows you the stats on how long you study/etc).\n\ntldr; it's the worst class I've ever taken my entire life",
            "score": 2,
            "author": "Hyoukai_"
        },
        {
            "level": 0,
            "comment": "I took prof Liang for stats 113 last semester and all i can say is you better be ready to work really hard. My professor strongly stressed that she does not and will not do lectures as they’re not helpful. We all logged onto the computers and worked all period of course she was there to answer questions but that’s about it. I absolutely hate math and cannot do it for the life of me and I got an A in the course :) it’s really not that bad. You have a module to complete every week or so and the topics aren’t too bad. The website you will be i using aleks which tracks your progress and really helps you learn in my opinion just make sure to do them on time bc there are a lot of topics!!",
            "score": 1,
            "author": "dustycheetofingerss"
        }
    ]
}