{
    "id": "12tgjfi",
    "score": 1,
    "title": "Transfer Credits",
    "author": "glovebom",
    "date": 1682027820.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/12tgjfi",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just recently saw my transfer credit report and some of the courses that are required for my major (general chemistry 1 and 2) are showing as electives. Does that mean i have to retake them? or is there a way to fix this? Please I need help.",
    "comments": [
        {
            "level": 0,
            "comment": "You come in as undeclared also where are you seeing how the credits are being applied I got my transfer credits too it just shows the report and the credits",
            "score": 1,
            "author": "Koran21",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not sure if this helps but there is a column that says equivalent course and requirement designation",
                    "score": 1,
                    "author": "glovebom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh that's not for you're credits those are just general also you come in as undeclared you only take general courses",
                            "score": 1,
                            "author": "Koran21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This isn't related with you're major or minor",
                                    "score": 2,
                                    "author": "Koran21"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are right to be concerned. Yes, talk with your department chair. If you think you are being given elective credit when you should be given credit for courses that will count towards your major, and speaking with the chair doesn't help, then you can appeal those credit decisions. The appeal process is described [here](https://www.cuny.edu/about/administration/offices/undergraduate-studies/pathways/rightsandresponsibilities/student-appeals-process/).",
            "score": 1,
            "author": "lexalogue",
            "replies": [
                {
                    "level": 1,
                    "comment": "To talk to the department chair, should I send them an email?",
                    "score": 1,
                    "author": "glovebom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Different departments will be different about this. If you can, I would suggest finding out who the chair's assistant (staff person, not a faculty member) is and ask that person (by email or in person) how you should communicate with the chair concerning this issue (should you send an email or make an appointment with the chair or show up during the chair's office hours or what). If you can, the way to ensure you get an answer to *this* question might be to go to the department in person during regular work hours and see what you can find out. You probably won't get someone to answer your credit transfer question right then, but you would find out what the process is and hopefully make face-to-face contact with a staff person who can help guide you--then and perhaps in the future. Hope this helps at least give you some ideas about how to proceed. (I'm trying to help you avoid the situation where you email the chair and then for weeks don't get an answer.)",
                            "score": 2,
                            "author": "lexalogue",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You could also phone and/or email the department and ask the procedure. You may need to try all of these strategies simultaneously.",
                                    "score": 2,
                                    "author": "lexalogue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you. I'll try them",
                                            "score": 1,
                                            "author": "glovebom"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}