{
    "id": "1347qer",
    "score": 12,
    "title": "new hunter graduate student fall 2023",
    "author": "lexfre",
    "date": 1682900979.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/1347qer",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi!! i just enrolled in the school counseling ma program at hunter and have a few questions for those who are currently in the same program or just a current grad student at hunter\n1) which building(s) are most of the school counseling classes held in? \n2) for those who dont live in the city, do you commute or did you find an apt in the city to live instead?\n3) do grad students live on campus or is housing available for grad students? \n\nthank you!!!",
    "comments": [
        {
            "level": 0,
            "comment": "Hey, i just came across this post. I’ve been in the same program for 2 years now and am expected to graduate next year so I may be able to answer some of your questions. 1. Most of the school counseling classes are held in the main building by Lexington and some classes are all the way by 94st at the campus school but there are some classes that you need to take in the beginning of the program that are still being offered online. Also, summer classes are still being offered online it seems. 2. I live in Brooklyn, so I just commute to school. 3. I know the school has dorms away from Hunter but I don’t know a lot about how the dorms are set up for students. \nFeel free to reach out if you have anymore questions :)",
            "score": 2,
            "author": "The_NightOwl_83",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much for your response! if you wouldn’t mind answering more questions, im curious to know whether you’re a full tike student and if you managed to work a job during semesters? i want to complete my degree as quickly as possible which i know is about 2.5 years if you’re a full time student, but im worried about the workload being too much for me to also work a paying job. im coming straight from completing my undergrad so im still trying to build my savings and just find the uncertainty of what my student workload will be very intimidating",
                    "score": 1,
                    "author": "lexfre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve been going to school part time and working part time since I started and I do feel like the first classes I took the first few semesters did feel a little less heavy compared to the workload I got this spring semester which was also when I completed practicum so I think that also had to do with the heavier workload. But if you can, also try to take some summer classes so that by the time you do your practicum and internship, you don’t have to take that many classes, I think that’s more manageable. I would also suggest working as much as you can now since by the time internship comes you may not have enough time to work as many hours since for internship you need to go in for at least 3 days a week to complete the 300 hours needed each semester of internship and for classes you may also have to go in 3 days a week depending on how many classes you take and what days they’re scheduled.",
                            "score": 1,
                            "author": "The_NightOwl_83",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "this is all super helpful, thank you so much!",
                                    "score": 1,
                                    "author": "lexfre",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Np! Let me know if any other questions come up :)",
                                            "score": 2,
                                            "author": "The_NightOwl_83"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t answer any of your questions. But I’m also going to be starting the same program in fall 2023!",
            "score": 1,
            "author": "throwawayqueen1568"
        }
    ]
}