{
    "id": "13kjkkt",
    "score": 3,
    "title": "e permit physics or just take it at hunter",
    "author": "Tiny_Perspective_206",
    "date": 1684370718.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/13kjkkt",
    "media_urls": [],
    "other_urls": [],
    "postText": "so i have a dilemma, i need a year physics for the dental school i’d like to go to. if there are any professors that are not relatively bad, lmk but if not, would it be a good idea to e-permit ? i heard that it is looked down upon since it’s as if you cannot handle the load at hunter (even if the professors are questionable)",
    "comments": [
        {
            "level": 0,
            "comment": "I am currently taking Physics 1 with Y.H Chu. Lab is easy 100 if you have nice TA (I had Tan Lee as my lab instructor, and she was a nice grader). Homework is easy 100 too. The hard part is the exam. As long as you understand the concepts and know how to apply it, you are good. He also give a review of what’s going to be in the exam.\n\nhttps://preview.redd.it/k9rut2cesj0b1.png?width=934&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b0938950c500e80c61dcad38bc86efcda358b26d",
            "score": 6,
            "author": "LUCY365gaming"
        },
        {
            "level": 0,
            "comment": "It’s not looked down upon, I got into dental school and ePermited like 10 classes. The admissions committee of dental schools don’t even know what ePermit is, just explain that the count system is an amalgamation of different public universities in New York City and say that the system allowed you to take classes at other campuses without restrictions, and you picked the classes that worked for your schedule or that hunter didn’t have enough space. \n\nI don’t even recall sending in another transcript because the ePermit courses showed on my hunter transcript. Obviously don’t have like 7 different colleges to be safe but if you stay with the same 1-2 ePermit colleges, it should be fine. I literally ePermit like 10 classes from Brooklyn college.",
            "score": 4,
            "author": "donkey_xotei",
            "replies": [
                {
                    "level": 1,
                    "comment": "so for let’s say, ochem and physics would it be okay to do so? i believe for biology i can’t . i just finished my first semester of gen chem i got a b and it’s only one way and it’s up from there. if i can do bio at a different college, lmk because i did enroll for the summer but idk !",
                    "score": 1,
                    "author": "Tiny_Perspective_206",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Believe it or not, I found oChem to not be that bad at Hunter. Physics was OK, but I think I got a B+ in both. The biology classes are trash, I  don't know if you can do biology at another CUNY, but the upper courses you should be able to, like microbiology, genetics, anatomy, etc, it just probably won't count towards your major (don't know about this part). Of course things have changed in the last 5 years so ask them, or better yet just try.",
                            "score": 3,
                            "author": "donkey_xotei"
                        },
                        {
                            "level": 2,
                            "comment": "because i know some of the pre health advisors are a very …. harsh i should say, and i just hope they don’t look at me crazy for e permitting saying it will hinder my app?",
                            "score": 1,
                            "author": "Tiny_Perspective_206"
                        }
                    ]
                }
            ]
        }
    ]
}