{
    "id": "13n966u",
    "score": 2,
    "title": "Query",
    "author": "anotherlost-one",
    "date": 1684616888.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/13n966u",
    "media_urls": [],
    "other_urls": [],
    "postText": "What happens I dicide to drop from a class right now \n\n&amp;#x200B;\n\nwould I get a grade of WU ?",
    "comments": [
        {
            "level": 0,
            "comment": "i’m fairly sure it’s not possible to drop a class. the deadline to drop a class and receive a W is the day of classes before finals start, being this last tuesday. i don’t think you have any other options than to just get your class grade.",
            "score": 6,
            "author": "greenshyguy8",
            "replies": [
                {
                    "level": 1,
                    "comment": "ok \n\n&amp;#x200B;\n\nthx",
                    "score": 2,
                    "author": "anotherlost-one",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "if you haven’t shown up to class, haven’t done your work, and haven’t completed your final exam, the instructor may give you a WU grade, but those are in certain cases.",
                            "score": 1,
                            "author": "greenshyguy8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have done everything \n\nand gotten 100's on everything other than the midterm \n\nonly one score of 90 on the first part of a project\n\nI am just afraid to flunk \n\neven though I did every thing in my power to do good",
                                    "score": 3,
                                    "author": "anotherlost-one",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "just stressing to dam much",
                                            "score": 2,
                                            "author": "anotherlost-one"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "it sounds like you are stressing too much! does the professors syllabus say how heavily the midterm is weighted? look up a grading calculator and plug in the percentages and your grades and they can help you get a general idea of what grade to expect. depending on if the professor knows you by name (because you sound like a fine student!), it could help to email them and just ask your current standing, maybe mention exams weren’t your strongest part, etc. most professors recognize effort!",
                                            "score": 2,
                                            "author": "greenshyguy8",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "15%\n\nthe project is 50%\n\nhence the stress",
                                                    "score": 1,
                                                    "author": "anotherlost-one"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "and we all as a class struggled in her first part because she is nit picky  \n\n\nBut for the second part she didn't even give us the opportunity to have feedback from her\n\nsoo :'''(",
                                                    "score": 1,
                                                    "author": "anotherlost-one"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "She did say that after finally 8 versions that my stuff was much better\n\nBut IDK\n\ni know i am crazy",
                                                    "score": 1,
                                                    "author": "anotherlost-one"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}