{
    "id": "abnmyj",
    "score": 12,
    "title": "How many of you here are Computer Science majors?",
    "author": "choose_it_",
    "date": 1546387502.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/abnmyj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Would any of you be interested in any subreddit specific to Hunter College Comp Sci majors? \n\nThere's already a FB group but I don't use it for multiple reasons (privacy concerns, mostly useless, hardly ethical business model, etc) . There has been occasions  in which (unfortunately) I've had to create a FB throwaway account to ask a quick question (e.g., *Does anyone have Prof. X' syllabus*, *How was your experience with Prof. X*, etc) and have it locked down in less than a day because I don't submit a face picture.\n\nThis probably won't take off since most FB users seems to like the path of least resistance  which is a shame especially coming from Comp Sci students. Regardless I'd like to hear your opinion on why this might not work.\n\nThanks and Happy New Year!",
    "comments": [
        {
            "level": 0,
            "comment": "I'd be interested in said subreddit. I also feel like the fb group is more of a resource page and gateway to \"cool tech news\", not really quick questions or discussions. Also the anonymity would let you ask questions judge free.",
            "score": 3,
            "author": "K_05",
            "replies": [
                {
                    "level": 1,
                    "comment": "I could probably create one but 1) I have zero experience doing sub moderation and 2) a sub without users isn't that much of a thing. It might be considered catch-22 situation: Users don't post to it because it doesn't exist and it doesn't exist because there are not users many posting to it ;-)!\n\n&gt; I also feel like the fb group is more of a resource page and gateway to \"cool tech news\", not really quick questions or discussions.\n\nYou're right on this. I recently logged in (with a fake FB account not less*) and scrolled down up to mid 2018 and aside from a few questions about professors/classes recommendation, most posts were just tech news links. On top of this, FB-like posts are not the most suitable medium when you want to ask questions, discuss something or even post code snippets.\n\n&gt; Also the anonymity would let you ask questions judge free.\n\nI find it odd that with roughly 1.2k users one doesn't find many CS questions that confounded everyone at one point or another. I think the fact that people (especially people new to the major) might be judged or thought stupid for asking questions that might seem trivial to others might be playing a role. \n\n---\n\n* The account was unsurprisingly locked down.",
                    "score": 2,
                    "author": "choose_it_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Join the Discord! ",
            "score": 2,
            "author": "Thats_a_lotta_fish",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[https://discordapp.com/invite/w4KHjnu](https://discordapp.com/invite/w4KHjnu)",
                            "score": 2,
                            "author": "robbyoconnor"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[https://www.reddit.com/r/CompSciHC/](https://www.reddit.com/r/CompSciHC/)",
            "score": 1,
            "author": "robbyoconnor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, I didn't know this. Was it always here?!",
                    "score": 2,
                    "author": "choose_it_"
                },
                {
                    "level": 1,
                    "comment": "Yeah I'd rather just have a new subreddit with some active users.",
                    "score": 1,
                    "author": "flameohotmein"
                },
                {
                    "level": 1,
                    "comment": "I just created it yesterday. ",
                    "score": 0,
                    "author": "robbyoconnor"
                }
            ]
        }
    ]
}