{
    "id": "qzb0oq",
    "score": 3,
    "title": "Acceptance decisions for Spring 2022",
    "author": "RAD-iance",
    "date": 1637548834.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/qzb0oq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied for grad program at hunter, specifically mental health counseling in the school of education but haven’t heard back yet since applying oct 15 deadline. Anyone hear back or in the same boat as me and waiting?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi, I’m a current CCNY Undergrad student and I applied to Hunter too and got in(And i’m going next spring), and I applied way after the deadline for undergrad, and I heard back I want to say a few days ago.I know it’s different for grad school, but I heard somewhere that they’re getting some kind of influx of applications that right now, so I would just say to wait a little while, hopefully you should get your response soon.",
            "score": 2,
            "author": "naypto",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you don’t mind me asking, why didn’t you stick to ccny? I’m curious since that’s my other option for grad school if I don’t get into hunter.",
                    "score": 1,
                    "author": "RAD-iance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi I applied to this same program. I called a couple weeks ago and they said I should expect a decision around the first week of Dec!",
            "score": 2,
            "author": "Dramatic-Berry-1449",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! I was getting nervous",
                    "score": 1,
                    "author": "RAD-iance"
                },
                {
                    "level": 1,
                    "comment": "I just received my decision I didn’t get in :(",
                    "score": 1,
                    "author": "RAD-iance",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sorry to hear that! There’s something better for you out there then. Keep pushing on! You got this",
                            "score": 2,
                            "author": "Dramatic-Berry-1449",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!! :)",
                                    "score": 1,
                                    "author": "RAD-iance"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}