{
    "id": "r7g060",
    "score": 1,
    "title": "Why are there so few accounting courses at hunter?",
    "author": "Recent-Sky3311",
    "date": 1638475576.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/r7g060",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am an incoming transfer student registering for spring 2022. I have to take intermediate 1 next semester but there’s only like 2 class sections for it. I also noticed that a professor that teaches intermediate 1 &amp; 2, also teaches cost. It seems like that professor is the only accounting professor at the school, because I didn’t see options for different professors that teach cost.",
    "comments": [
        {
            "level": 0,
            "comment": "People go to Baruch for accounting.",
            "score": 7,
            "author": "PhonyPapi"
        },
        {
            "level": 0,
            "comment": "There aren't as many students that are majoring in accounting to have multiple sections. There isn't a wide variety of professors if there isn't as large a demand. Well at least compared to the sciences which make up the majority of Hunter. Good luck though, I was an accounting major Hunter grad.",
            "score": 3,
            "author": "devilsrolldice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you recommend the accounting major at hunter college? How were the professors? I’m trying to decide between hunter and queens college tbh.",
                    "score": 1,
                    "author": "Recent-Sky3311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd say in terms of the accounting major, the material is the same wherever you learn from. I chose to stay at Hunter, instead of transferring to Baruch (like many students opt to do), because I preferred the smaller classrooms getting to know the people/professors in the classes because we climb each requisite together. I don't know much about Queens College, I'm assuming it's also a smaller program there. Either way, I'm sure it'll be okay. I'm an auditor for a big4 now so I did fine.",
                            "score": 2,
                            "author": "devilsrolldice",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Were you in the accounting society club at hunter college? Also did you have a good gpa during your undergrad?",
                                    "score": 1,
                                    "author": "Recent-Sky3311",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, I was a member and involved in a committee as well. I believe had a 3.6+ overall GPA, closer to 3.75+ for the major. Feel free to PM me if you have any questions it's been a minute since I finished in December 2019 , but I can try to answer them if I know.",
                                            "score": 2,
                                            "author": "devilsrolldice"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How were the professors in the accounting program? Did they do a good job teaching the materials? Did you sit for the CPA exam upon graduation, how did it go?",
                    "score": 1,
                    "author": "cutebaby667"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The program isn’t big tbh. Most professors you take you will also have again in higher level courses",
            "score": 2,
            "author": "Quick_Discipline_149"
        }
    ]
}