{
    "id": "s4q4cf",
    "score": 6,
    "title": "Incoming transfer but haven't been assigned any advisor or had any holds removed... oh boy",
    "author": "Salad_Dressing__",
    "date": 1642269771.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/s4q4cf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Any suggestions for that? Submitted the vax requirements for meningitis as soon as I could and the hold is still on. Emailed health a week or two ago, nothing.\n\nAlso got assigned no advisor. And it seems to have un-declared my major for me on the basis of \"missing major entry criteria\", in addition to \"advising required\" except... I have no advisor assigned. So I can't register for classes either. Emailed them weeks ago. Coming up on the third time now (albeit to a separate address, so hopefully this actually comes up with something)\n\nTried to submit a major declaration form a week or two ago. Nothing yet on that either. I've noticed horrid communication is a constant here based on the subreddit feedback. How do I break this though? Semester's coming up and it's getting me worried.",
    "comments": [
        {
            "level": 0,
            "comment": "hunter is horrible with transfers, sorry about that. i don’t have experience with transferring but the trick with other bureaucratic stuff was to call in addition to emailing. i know it sucks and you’ll end up on hold but you may get through to someone quicker than by emailing. hunter will literally reply to my emails weeks/months later with their proposed “solution” when by that time it’s already resolved itself or i figured it out on my own lol",
            "score": 3,
            "author": "ohthemoon",
            "replies": [
                {
                    "level": 1,
                    "comment": "With offices closed and emails unresponsive i was dreading having to wait on hold... but yeah that definitely seems sound, thanks for the input",
                    "score": 1,
                    "author": "Salad_Dressing__"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glad to hear I'm not going nuts on this one alone at least lol",
                    "score": 1,
                    "author": "Salad_Dressing__"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, I was a transfer student in Spring 2019 so maybe I can help.\n\nFor me, I remember I got an email that asked me to make an appointment with my advisor around this time (January). You can try to make an appointment here by emailing or via Navigate [http://www.hunter.cuny.edu/advising/](http://www.hunter.cuny.edu/advising/) \n\nHere is the Hunter Directory -- you can go to department and head to 'department of advising'. Then you will be able to see all the emails of the people in the advising department, I would email and cc' all of them. [http://www.hunter.cuny.edu/directory](http://www.hunter.cuny.edu/directory)\n\nI hope you can hear back this week as the Spring semester is approaching. Feel free to dm me if you have any questions.",
            "score": 2,
            "author": "rosieareposie",
            "replies": [
                {
                    "level": 1,
                    "comment": "The first option hasn't been fruitful so far I'm afraid but I'll definitely give the directory a shot - thank you very much!",
                    "score": 1,
                    "author": "Salad_Dressing__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good luck, I hope someone will be able to reply to you! :)",
                            "score": 1,
                            "author": "rosieareposie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;And it seems to have un-declared my major for me on the basis of \"missing major entry criteria\"\n\nSome majors you may not declare on your own. [They are listed at the bottom of this page.](https://ww2.hunter.cuny.edu/students/academic-planning/majors-minors-and-certificates/declare-a-major-or-minor/)",
            "score": 1,
            "author": "magicbeansmatchbox"
        },
        {
            "level": 0,
            "comment": "just email whoever put the hold on your account and ask them if they can remove it. It might be the bursars office.  they put a hold on my account freshman year for no reason and they removed it as soon as I emailed them.\n\nfor declaring your major u should talk to the department that you want to declare a major with. I don't think the advisor has anything to do with that anyways",
            "score": 1,
            "author": "Critical-Ad-319"
        },
        {
            "level": 0,
            "comment": "Hey currently in a similar situation. Any update on your end?",
            "score": 1,
            "author": "yimb0slice",
            "replies": [
                {
                    "level": 1,
                    "comment": "I finally got assigned to an advisor. There are holds on my account that don't actually count towards preventing me from registering from classes it seems.\n\nThe major declaration and the required advising holds are the ones that are still on my account. I can enroll for classes now. The one that was keeping me was the meningitis one. It turns out my form documenting my most recent shot of it was soon about to expire (almost 5 years) but I was told that I can simply do the meningitis form and decline to receive it. (The three options for the acknowledgement are, yes I read about it and I have it, yes I read about it and I will get it, or yes I read about it but I won't get it) and the third one is perfectly valid.\n\nAfter I got rid of that I was able to register for classes. The major declaration will be processed later but it isn't keeping me, and the advisor recommended registering for classes first and using the advisement to revise it (there's still a period between the semester start and a day to continuously add or drop other classes)\n\nGood luck and let me know if there's any more you need answered!",
                    "score": 1,
                    "author": "Salad_Dressing__"
                }
            ]
        }
    ]
}