{
    "id": "scpbo2",
    "score": 3,
    "title": "opinions on prof Tiziana Ligorio?",
    "author": "naypto",
    "date": 1643148644.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/scpbo2",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi, i’m a freshman taking CSCI 127 with professor Tiziana Ligorio(she was my only choice) and a lot, and i mean a LOT of the reviews on ratemyprofessor were really bad. some were good, but a vast majority were straight 1’s. is she really that bad for an in person class? is there anything i can do to prepare myself or any tips you have? anything would be greatly appreciated, thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "hii, i've taken her before for csi 127. she wasn't that bad, but i recommend going to your TA's because they are pretty helpful. The course work is a lot, especially for a 100 lvl course. Also, try to make friends in that course, that way you can help each other with the assignments.",
            "score": 3,
            "author": "rosieareposie",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the advice!",
                    "score": 1,
                    "author": "naypto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "np! good luck, and i am sure you will do well! :)",
                            "score": 1,
                            "author": "rosieareposie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "CS at hunter is essentially self study. You ignore the professor (except saad lol) and just do the assignment on time. Make sure to look through the slides and do the quiz and code assignment on time. Good luck!",
            "score": 5,
            "author": "H-encore",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you! yeah i just plan to do the assignments on time and make the most of it.",
                    "score": 2,
                    "author": "naypto"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "LOL thank you! i dont really have a choice this semester unfortunately. thank you!",
                    "score": 1,
                    "author": "naypto"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also taking Tiziana, I believe what you CAN do is just count on the TAs to carry you. If you’re a freshman you should probably look into the other kinds of professors with college now attributes and such. \n\nIts going to be an uphill battle for sure, theres weekly quizzes, biweekly coding reviews (oral reviews you need to explain), program assignments daily pretty much, oh and final exam that will FAIL YOUR ASS IF YOU DON’T PASS IT LMAO.\n\nBest of luck, I’m attending the section on Tuesday. Why theres only 10 sections for computer science is beyond me. \n\nBest of luck!",
            "score": 4,
            "author": "Theprofessionalist",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah im a second semester freshman so i dont really think i have many options afaik. that whole policy about the final im my honest opinion seems pretty dumb but theres nothing i can do about it but work through it. thanks for the advice!",
                    "score": 1,
                    "author": "naypto"
                }
            ]
        },
        {
            "level": 0,
            "comment": "taking her too! was immediately overwhelmed by the syllabus",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "right? that syllabus seems like a lot. i heard though that the coding assignments aren't all too crazy or take incredibly long(idk if thats true), but yeah that syllabus is definitely polarizing.",
                    "score": 1,
                    "author": "naypto"
                }
            ]
        }
    ]
}