{
    "id": "tlzzsu",
    "score": 2,
    "title": "BSW Program",
    "author": "purplejawbreaker",
    "date": 1648105480.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/tlzzsu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\n\nI got accepted to Hunter College, but I am waiting to hear something from the BSW Hunter Program. I heard there is a interview you got to go through apparently? Is it true?  And if it is, any tips? \n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! Congrats on getting into Hunter. I'm a BSW student myself.  If you're seriously considered for the program, you'll get an invite for a group interview. I had my interview at the beginning of May and didn't get a response until the middle of June. \n\nThe group interview is fairly simple. A professor will ask questions about what social work means to you, etc. Afterwards, everyone will receive a writing prompt to answer and send back. My advice when answering any client-based questions is to focus on the client, not only on their immediate needs but to treat them as a person and not as a case. Everyone's nervous and everyone rambles when they're speaking, so the writing prompt is your opportunity to really showcase your understanding and skills. Best of luck!",
            "score": 3,
            "author": "shyawatt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the information, seriously! How is the program so far for you? And if any questions, can I DM you anytime?",
                    "score": 1,
                    "author": "purplejawbreaker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes you can absolutely DM me! The program so far is definitely challenging, and it's extremely difficult if you have other commitments like work or a family. Your biggest strength is yourself and your cohorts. Just bear in mind that every school has its pros and cons, but at the end of the day, you're there to get your degree and make a difference after graduation.",
                            "score": 2,
                            "author": "shyawatt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are right, thank you! Do you have to take your electives at the main campus or at the Silberman?",
                                    "score": 1,
                                    "author": "purplejawbreaker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You have to take your electives at the main campus. The social work classes are held on Mondays and Wednesdays (at least for first-year students). In the fall, I took an online class and my language class was held at the main campus. This semester, both of my electives are at the main campus. It totally depends on your schedule and your preference, but I opted to bulk all of my classes together on Mondays and Wednesdays in order to lessen my trips back and forth. I recommend trying to knock out as many electives as possible before your second year, because the second year is a lot more time-consuming.",
                                            "score": 1,
                                            "author": "shyawatt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What about as an Junior? Getting my associate degree at BCC in May/June :)",
                                                    "score": 1,
                                                    "author": "purplejawbreaker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Aww, congrats! I transferred after getting my Associate's from BMCC last year, and I'm technically considered to be a junior at Hunter now, so I believe you'd be the same. When I said second-year, I meant the second-year of the BSW program- because not only will you have two days of classes but also two required full-days for your internship. In the first year, we only have one 7-hour day required in order to earn 200 hours by the end of May. Second year, it's two 7-hour days to earn 400 hours. You're not allowed to intern on the weekends, so the requirements definitely eat at your schedule.",
                                                            "score": 3,
                                                            "author": "shyawatt",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Gotcha! Make sense! Thank you fot answering all of my questions. I am still slow to thia Reddit thing, so I don't know if there is a \"add a friend\" option here. I'll figure it out and if any questions come up, I'll message you! Again, thank you :)",
                                                                    "score": 2,
                                                                    "author": "purplejawbreaker"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}