{
    "id": "udvtu5",
    "score": 1,
    "title": "Urgent Question About SEEK program?",
    "author": "AdministrativeCap314",
    "date": 1651154818.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/udvtu5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve got accepted into the Hunter SEEK program. But I did not fill out the TAP application. What happens if I don’t fill it out? Cause May 1st is approaching and I still haven’t committed to a school yet. I’m kinda nervous.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey, I also got accepted and filled my TAP super late. The deadline isn’t here yet so i recommend getting it done as soon as possible. as long and you completed ur fafsa you’ll be fine",
            "score": 1,
            "author": "BatPure5896",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey did you submit your immunization records? Do you actually have to go to the school and give them a physical copy? Or did you send it online? If you did where did you send it though?",
                    "score": 1,
                    "author": "AdministrativeCap314",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey I’m in the process of doing it. Log into CUNY first and just submit everything on there. No need to go in person",
                            "score": 1,
                            "author": "BatPure5896",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok I’m which section do I go?",
                                    "score": 1,
                                    "author": "AdministrativeCap314",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "go to the “to do “ part. it should be there as one of the tasks u have to complete",
                                            "score": 1,
                                            "author": "BatPure5896",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nah yeah I’m on there but it just shows the Meningitis Acknowledgement response form. Also it says I gotta go do Academic advising.",
                                                    "score": 1,
                                                    "author": "AdministrativeCap314",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hmm. I don’t know about that. I’ll probably call them to figure out how to submit it all.",
                                                            "score": 1,
                                                            "author": "BatPure5896",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ok one last question did you make a hunter account? Because i was trying to make an appointment to do the academic advising hold I got on my account but it said I gotta have a hunter college account to have access to make an appointment. Also thank you",
                                                                    "score": 1,
                                                                    "author": "AdministrativeCap314",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What hunter account? Do you mean a hunter e-mail? I don’t have a hunter account. Also I don’t know what an academic advisor hold is because it’s not on my cuny first. I recommend calling them or getting on a virtual meeting and sorting it all out. Good luck !",
                                                                            "score": 1,
                                                                            "author": "BatPure5896"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}