{
    "id": "ul6zhb",
    "score": 3,
    "title": "Advice choosing courses",
    "author": "Low_Upstairs_5691",
    "date": 1652031826.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/ul6zhb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys! I'm currently an incoming freshman at Hunter. I was wondering if anyone could advise me on what classes to take my first year to graduate within 4 years and maintain a 4.0? I'm entirely set on attending med school and don't know how to set up my schedule. I'd like to major in either psychology or biology, right now I have biology down. I'd like to take some of my easier classes first so I can have a better gpa to set me up for future years. I'd really appreciate any help y'all could provide. Thanks! :)",
    "comments": [
        {
            "level": 0,
            "comment": "First sem freshmens dont get to pick your own courses. Youll be given block schedules to choose from based off learning community.\nAlso hunter intro sciences are weed out classes so you should be mentally prepared.\nIf you want to look ahead though, google hunter college degreemaps 2019 and select your major to see what courses youll need.",
            "score": 8,
            "author": "winneh7",
            "replies": [
                {
                    "level": 1,
                    "comment": "No it differs because irrc theres over 10 block schedules to choose from. The diff would be different common core courses. But first sem sci class would\nBe chem 102. \nFreshmens dont have majors. What you out on application would not matter when you come until you officially declare it.",
                    "score": 5,
                    "author": "winneh7"
                },
                {
                    "level": 1,
                    "comment": "thanks! do all pre meds have the same block schedule regardless of major?",
                    "score": 1,
                    "author": "Low_Upstairs_5691"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Major in psych if you want a higher GPA. Bio majors benefit from having a lot of pre-reqs count for their major requirements, but theres usually a slight cost to their GPA bc of how hard the classes are. I’m majoring in psych myself and the classes have been a breeze. There’s many easy A classes you can take in the winter and summer as well, and you’ll also have a guaranteed opportunity to TA for a course later on if you get an A- in psych 248. Overall the psych dept is pretty supportive as well. \n\nAlso don’t take all your easiest classes first. In the event you don’t have such a great semester, it’s better for this to happen early so you can still show improvement later on. Let’s say you don’t do well in sophomore year, those easy classes will give you some breathing room bc you can still demonstrate an upward trend in your junior and senior years. Having a bad semester or two is no big deal as long as you show upward trend, but a downward trend can potentially be a red flag. But also don’t take all your hard classes all at once either, try to keep things balanced. \n\nHope this helps, feel free to pm me if you need any advice",
            "score": 1,
            "author": "-MantisTobogganMD"
        }
    ]
}