{
    "id": "wfdhf1",
    "score": 2,
    "title": "Accelerated nursing programs",
    "author": "tickennuggiez",
    "date": 1659549767.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/wfdhf1",
    "media_urls": [],
    "other_urls": [],
    "postText": "In spring 2023, I will be completing my BA in human Bio at Hunter college. \n\nBy fall I want to attend an accelerated nursing program but I need advice!\n\nWhat are good accelerated nursing programs in New York City/Westchester?\n\nI’m going to apply for Hunter’s A2D nursing program but I need backups. \n\nAdditionally, what is the deadline to take the PAX? Does that depend on different programs or is there one set date?",
    "comments": [
        {
            "level": 0,
            "comment": "PAX-RN’s deadline depends on the college you’re applying to. For Hunter, students need to take the exam by the end of February for admission into the Nursing School in the Fall term. \n\nThe best nursing school among the CUNY system would be Hunter. SUNY would be Binghamton or Farmingdale. For privates, there’s a few. I would say NYU, Pace, and Hofstra. But they’re very expensive, so there’re many aspects to consider for private schools.\n\nI hope this is helpful!",
            "score": 3,
            "author": "LeonZheng646",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!!!",
                    "score": 1,
                    "author": "tickennuggiez"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey I’m a Human Biology major as well in my second year, congrats on completing it!!! I’ve been researching accelerated nursing programs for a while and my #1 is Pace University, they don’t require much and it’s an 11-month program, the catch is how much it costs, it’s around 70k but it does not require the PAX \nHere’s the link! ~ https://www.pace.edu/college-health-professions/departments/nursing/programs/admission-requirements-intructions/nursing-accelerated-bs",
            "score": 1,
            "author": "badchnge",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking that as well!! I reached out to them and I have pretty good chances of getting in so that’s Deff going on my list :)",
                    "score": 1,
                    "author": "tickennuggiez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes that’s amazing!",
                            "score": 1,
                            "author": "badchnge"
                        }
                    ]
                }
            ]
        }
    ]
}