{
    "id": "wpa2hg",
    "score": 1,
    "title": "How do I know if I'm actually enrolled in a class?",
    "author": "BisexualADHDWeeb",
    "date": 1660595493.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/wpa2hg",
    "media_urls": [],
    "other_urls": [],
    "postText": "There was a class that I signed up for that told me it was full so I opted to get put on the waitlist. I just remembered about it so I'm checking schedule builder and it says I'm enrolled in all my courses and on cunyfirst when I go to view my class schedule says the same. But what I'm confused about it that it says \"wait listed\" next to the class I'm signed up for. Additionally it says that for two other classes that I know I signed up for in time so I shouldn't be waitilisted for those. Is that just letting me know the class I'm signed up for has a wait list or is it telling me I'm on the waitlist? \n\nOne more question if you can help with this. I signed up for course that would satisfy my pluralism and diversity groups a,b,&amp;c but when I go to degree works it's only showing two groups. So that means I only need two courses to satisfy that requirement right? If I wanted to drop the class I picked up for group c, will it then show me the classes I picked up for a and b?",
    "comments": [
        {
            "level": 0,
            "comment": "If on schedule builder you see the word enrolled in a blue box next to the course name you are enrolled. If you see it says waitlisted next to the section number in smaller font it means anyone else trying to register for that class will be placed on the waiting list. If youre waitlisted for a course schedule builder will also show the pos you are in line. Im a little confused about your second question regarding degreeworks. You need to complete groups abcd (one course each) to complete the requirement to graduate. W the exception that youre not a transfer and did not take bio100/102 af hunter. Do you mean you signed up for 3 plualism n diversity courses but only see 2 being applied towards that requirement? Are you sure the last course fulfills the req for group c?",
            "score": 1,
            "author": "winneh7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the info! I am a transfer student. \n\nThat's exactly it. I see only two being applied towards that requirement. When I signed up for those courses, I was using degree works to pick my classes. Pluralism and diversity had those three groups and I signed up for a course from each one. Group A course was the one I was waitlisted for while the courses I picked from B and C were available. Now on degreeworks it shows only groups B and C as fulfillment for that part while the class I picked for group A isn't showing up as a requirement anymore.\n\nI wanted to drop the class I picked for group C since it's inconvenient to my schedule, I wanted to know if I drop that one, will the one I took for group A just move to fit that requirement since i dropped group C?",
                    "score": 1,
                    "author": "BisexualADHDWeeb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "wait ima pm you instead",
                            "score": 2,
                            "author": "winneh7"
                        }
                    ]
                }
            ]
        }
    ]
}