{
    "id": "wu4yyq",
    "score": 9,
    "title": "Tips for transfer students?",
    "author": "bittyroe",
    "date": 1661102538.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/wu4yyq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Coming in as a transfer student to finish my undergrad at Hunter. I know it’s a lot different then coming in as a Freshman but I don’t have an orientation or anything. Any tips for a new transfer?",
    "comments": [
        {
            "level": 0,
            "comment": "I didn't know this when I transferred also but Hunter has (I believe) three buildings. Main campus at Park Ave, Brookdale downtown and Silberman uptown. Check your classes to see if you have any classes on a different building. If you're taking science class that have a lab, they will most likely be at the Brookdale campus. I didn't know this and I was late during the first week since I had to travel half an hour from the main campus to Brookdale campus lol",
            "score": 5,
            "author": "Hyoukai_",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Most labs are at main campus in the north building, only nursing labs, MLS labs, and pre med's A&amp;P labs are at Brookdale.lab, they will most likely be at the Brookdale campus. I didn't know this and I was late during the first wee\n\nMost labs are at main campus in the north building, only nursing labs, MLS labs and pre med's A&amp;P labs are at Brookdale.",
                    "score": 3,
                    "author": "winneh7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check your degreeworks to make sure your transfer credits are applied appropriately - you may have to go to each department advisor (you can make appointments with them through Navigate) with the syllabi of courses you took in order for them to be applied properly, else they'll just be \"wasted\" as elective credits. It may take more than one follow up email/meeting with various people to work things out which can be frustrating, but ultimately being polite to whoever's helping you out goes a long way.\n\nGenerally I've found department advisors more helpful than general academic advisors, but you should still plan to meet your academic advisor once a semester, especially since you're building your class schedule on your own from your first sem (freshmen get their first schedule made for them), so I like to run my schedule by my advisor before the term starts just in case.",
            "score": 4,
            "author": "ClockRevolutionary84"
        },
        {
            "level": 0,
            "comment": "Transfer student here, about to start my first year as well. Hound them. Constantly. Be up their ass about everything because they were basically like “Welcome to Hunter! Go fuck yourself!” Prepare a list of very specific questions because it’ll be a miracle when you talk to someone and god knows when it’ll happen again. Also make sure your Degreeworks lists all your exemptions and substitutions.",
            "score": 7,
            "author": "bebebotanica"
        },
        {
            "level": 0,
            "comment": "Following! I’m going to be applying for Hunter Transfer Fall 2023 and need some tips.",
            "score": 3,
            "author": "YepImAFeminist07",
            "replies": [
                {
                    "level": 1,
                    "comment": "So am I and all I see is the same issues. I may have to rethink my options.",
                    "score": 1,
                    "author": "Historical-Beach-343"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a Premed and Ive heard that hunter’s Premed advisement is not supportive, puts you down and discouraging, So Im like do I apply or not?",
            "score": 1,
            "author": "YepImAFeminist07",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you've heard that then that's a red flag. I have family that are Physicians and Nurses. Everyone went to SUNY Downstate, SUNY Stonybrook and Brooklyn College. Even the ones that are in research. It's well known these are the best schools and most affordable.",
                    "score": 1,
                    "author": "Historical-Beach-343"
                }
            ]
        }
    ]
}