{
    "id": "ypbts7",
    "score": 8,
    "title": "Prof recommendation",
    "author": "LeonZheng646",
    "date": 1667883947.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/ypbts7",
    "media_urls": [],
    "other_urls": [],
    "postText": "What professors would you guys recommend for Psych 150, Engl 220, Chem 121, and Chem 120 recitation? \n\nI’m also debating which one to take - Asian 210 (Meera Lee in person or Mitchel Wu online asynchronous) or CLA 101…",
    "comments": [
        {
            "level": 0,
            "comment": "I’m not sure if she still teaches but Carol Rial was a good eng 220 professor. I think I got a B? And is psych 150 child development bc if it is I recommend Joseph Lao. He uses a lot of real world examples (mainly his son when he was young) and he’s very interesting to listen to.",
            "score": 4,
            "author": "prettyrecklesssoul",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I heard that Professor Lao talks extremely low and it’s very hard to hear him even if you sit close. Was this a problem with you? Also, FYI Psych 150 is Human Development 🙃",
                    "score": 5,
                    "author": "LeonZheng646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah he’s very soft spoken but I took him virtually so it wasn’t a problem. Well, I was close with the development part lol. But he is still a good professor bc he knows his stuff and how to teach. I just got a C bc I was a lazy student",
                            "score": 2,
                            "author": "prettyrecklesssoul",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol yeah, many people mix up child development and human development and got me confused initially on what I have to take, but it’s all good now. \n\nIf it was virtual, I think I would love to take him, but since it’s in person and since he’s soft spoken, I’m afraid I wouldn’t be able to hear anything and suffer in the class 🥲",
                                    "score": 2,
                                    "author": "LeonZheng646",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s most likely gonna be in an auditorium type of class since it is a 100-level class so I would recommend sitting near the front. He might have a microphone though so that could help",
                                            "score": 2,
                                            "author": "prettyrecklesssoul"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "CLA 101 is a great class.\n\nProtip: whenever possible, look for courses in your major that fit Pluralism and Diversity (if that's still required) -- two birds, one stone.",
            "score": 4,
            "author": "LeotasNephew",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that allowed? I got so confused at times because I thought if the course goes towards one requirement, it can’t go to the other, so I’m confused… \n\nCurrently, I’m undeclared because I’m a prospective nursing student, so I’m not 100% sure what are my requirements for the Pluralism and Diversity section.",
                    "score": 1,
                    "author": "LeonZheng646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unless they changed it (which I can't imagine why they would), you should be able to use P&amp;D courses that also fulfill major or basic requirements.\n\nWhen I was there, Groups 1 &amp; 4 had a lot of courses in each list that were also in the other (eg, CLA 101 should be in List 1 AND List 4).  Group 2 was Ethnic Studies, and Group 3 was Women's Studies.\n\nWhen I was looking for a Group 2 course to take, nothing seemed all that interesting until I saw that Native American Lit was in the list, and it was a 300-level English course, which I needed for my major.  I checked with the English department, and they said I could do that for my Group 2 requirement and that it would also fulfill a 300-level course requirement for English.\n\nBasically, if it's how it was when I was there, you need one course from each group, but you can't use one course that's in more than one P&amp;D group list to fulfill two P&amp;D requirements (eg, you couldn't use CLA 101 for both Group 1 and Group 4).\n\nGroups 1 and 4 had tons of 101 or basic courses.\n\nThe course catalog should give instructions on how P&amp;D works, but even though you're prospective for nursing only, you can go to that department and ask them about P&amp;D.  Someone there should know.",
                            "score": 1,
                            "author": "LeotasNephew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for your detailed response and all these information! I think you’re right since P&amp;D requirements are different from Core/Flexible Core requirements. \n\nI think it’s their note of focus study and core requirements that got me confused with picking the course and making me think that I couldn’t take 1 course to fulfill 2 areas.",
                                    "score": 2,
                                    "author": "LeonZheng646"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "psych 150, hunter kincaid! literally like only 3 exams for the class but the study guides are exactly the exam, and no hw except like maybe 2 but takes 20 min to complete nothing crazy!",
            "score": 3,
            "author": "anonymousgirl_25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg I heard great things about him, but it looks like he’s not teaching Psych 150 for the spring semester!!! 😭",
                    "score": 2,
                    "author": "LeonZheng646"
                }
            ]
        },
        {
            "level": 0,
            "comment": "for psych 150 take Brianda Hickey, literally BEST professor there is! 4 exams, 1 is dropped, if the class average is below a certain amount she gives multiple extra credit options per exam, you don’t have to attend in person to learn + creates her own quizziz and the slides are accurate and precise. Sweet lady- actually wants you to pass.",
            "score": 2,
            "author": "Divine18_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow! She sounds amazing! I love the fact that professors dropped the lowest exam. When they do that, they’re the gold profs 🙏 I’ll definitely keep her name in mind!",
                    "score": 1,
                    "author": "LeonZheng646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She's nice but in my opinion, but if you want an easy A, take a different professor. Like what other people are commenting, most psych 150 professors offer take-home exams and open-book or online exams. Brianda's exams are in person. They are multiple choice though. However, she uses her own questions and they can be tricky. Class average for the 2nd exam was around 70%.\n\n&amp;#x200B;\n\nYes, shes nice. Drops the lowest grade and gives extra credit opportunities but I would prefer a different professor that provides take-home exams and open-book exams so I don't have to stress memorizing the topics and I can instead focus on understanding them. Not an easy A and you have to work a little harder in this class compared to other professors teaching the same course.",
                            "score": 2,
                            "author": "Hyoukai_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for this insight!! This is like my current Psych 100 prof. But she doesn’t even drop the lowest one or curve. She’s like if this is what you get, it’s what you get 😭",
                                    "score": 1,
                                    "author": "LeonZheng646"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Psych 150- Robert E Ball there’s 3 exams and all the exams are open book and online, you don’t have to take them in the class, can take them at home😩! He’s pretty cool, attendance it’s not mandatory and he gives extra credit in class if you answer his questions!",
            "score": 2,
            "author": "Sugawaraisbaby"
        },
        {
            "level": 0,
            "comment": "For ENGL 220, Francois Kiper! He’s one of the coolest and most chill professors I’ve had! Very lenient with due dates (you can always ask him for an extension beforehand!) and his grading is quite simple/not strict",
            "score": 2,
            "author": "ShowMeMoeMane"
        },
        {
            "level": 0,
            "comment": "Is Chem 120 recitation the lecture?? I saw another person say recitation and idk what it means",
            "score": 1,
            "author": "Kindahappytobehere",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, it’s not the lecture. They’re different. Recitation is a smaller class that’s used for practice of questions on what you learned or will learn in lecture.",
                    "score": 2,
                    "author": "LeonZheng646"
                }
            ]
        },
        {
            "level": 0,
            "comment": "not sure if he’s offering it this semester but i took CLA 101 with Lawrence Kowerski and his TA: EXTREMELY easy. I took it pre covid so it might be different but in my experience, modules are light reading and a quiz every week. There’s also a some discussion board posts. offers extra credit and allows you to do missed modules as long as it’s done before the midterm.",
            "score": 1,
            "author": "sou13aters"
        }
    ]
}