{
    "id": "z5ip3j",
    "score": 4,
    "title": "To do or not to do ~",
    "author": "LetterheadOld9472",
    "date": 1669498644.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/z5ip3j",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im taking Chen 102 currently and I'm thinking about taking Intro to Bio, which I need to ace for Dental School. Should I take 104 in the spring while the Chemistry material is still fresh or should I take it in the summer with Chem lab. All this while doing a full time job. \n\nWhich option would provide me with a higher success rate? How difficult is Chem 104 lab? Should I bite the bullet and do all three this spring?",
    "comments": [
        {
            "level": 0,
            "comment": "Chem 106 (gen chem lab) is easy A w the right TA. \nI think it depends on how much time you can put into studying. Chem 104 imo isnt too difficult but hunter bio took a lot of time. A full time job + bio sounds difficult. You can ask the prehealth server for more opinion for bio.",
            "score": 2,
            "author": "winneh7"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you both. \n\nu/VisitingPrivileged, you're completely right about the significant differential and about squeaking by. I guess what you're suggesting is on par with what I was thinking as far as just doing  Bio solely to hone in on it. I just despise the idea of just doing 1 class per semester when all I want to do is wrap it up and move on with my life.\n\nThe thing with Chem is that it's annoying and I've never liked it. I was in AP Bio in high school and idk seems a bit more tolerable than valence electrons and mole. Maybe i can take those in the summer. Either way you've been very insightful.",
                    "score": 1,
                    "author": "LetterheadOld9472"
                }
            ]
        }
    ]
}