{
    "id": "z9geyb",
    "score": 1,
    "title": "Study options for CLA 110? + Withdrawing From Classes",
    "author": "Twinkieee42",
    "date": 1669875288.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/z9geyb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been struggling with Greek and Latin Roots this semester. If I don’t pass the next test then I basically failed the class so is there any study options for the class offered in Hunter? If not, any way I can study?\n\nAdditionally, if it comes to it, does withdrawing from the class effect my financial aid at all? Without that class, I’d still have 12 credits this semester + I have transfer credits from AP exams \n\nLastly, I applied for the excelsior scholarship and I need 30 credits by my first year to continue receiving. Does my transfer credits count towards those 30 or does it only count credits you complete in Hunter? \n\nSorry if it’s a lot, im a freshman and it’s my first semester so im new to all this info",
    "comments": [
        {
            "level": 0,
            "comment": "You can check if there’s a study group for the class (and any other class you’re enrolled in) on [Hunter navigate](https://hunter.cuny.edu/navigate/students/). I know the 7th floor in the library has various tutoring options but mainly for math, science and writing, so navigate might be your best bet.\n \nThe only way withdrawing would effect your financial aid is your credits. Your 12 will keep you afloat since you need to be a full time student (especially for excelsior) so you’ll totally be fine in that regard. \n\nAs for the 30 credit goal. You have next semester to make it up as well as winter and summer sessions (not covered by financial aid). Your AP credits can be counted but excelsior/TAP office will need to apply it and those credits can only be applied once. So if you have 9 credits transferred from AP and your missing 3 credits, you’ll lose out on the 6 credits being applied to your excelsior goal (Sucks I know, it happened to me last year). \n\nI hope this helps! And definitely take the W on your transcript if you don’t think you’ll pass the class. A W won’t effect your GPA and you can always bounce back from it.",
            "score": 2,
            "author": "Lower-Boysenberry-33",
            "replies": [
                {
                    "level": 1,
                    "comment": "Withdrawing sounds like the best option, I don’t feel confident enough even with studying that I’ll pass the class at all (and failing that one class could drop my GPA from an estimated 3.7 to a 2.6 so definitely not).\n\nHow would I got about withdrawing? I know you can do it through CUNYFirst but is there a whole larger process to it? Like submitting a form or smt to say I’m officially withdrawing? \n\nAlso for the 30 credit goal thing, would it be best to submit them now before spring semester starts? And if I do, will all the credits I take in spring semester be counted towards the 30 credit goal (meaning could I exceed 30 credits in the first year via excelsior)?\n\nThank you for all the info thus far! I’d meet with an advisor but tbh I don’t think I even know who my academic advisor is (thanks Hunter for not telling me) so I’ve just been occasionally asking the Office of Advising",
                    "score": 1,
                    "author": "Twinkieee42"
                }
            ]
        }
    ]
}