{
    "id": "zlk3pe",
    "score": 0,
    "title": "Will an F ruin my chances of transferring?",
    "author": "beatnikbarbie",
    "date": 1671000773.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/zlk3pe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm currently trying to transfer to Hunter College (majoring in Art History and Italian), but I'm worried that an F grade will affect my chances. My first semester I received 3 B's, an A and a C. The next semester I received straight A's. I haven't gotten my grades for this semester yet, but I'm pretty sure I'm going to receive 3 A's, one B, and an F (in math). I think my GPA will be about a 3.4. I've gotten all A's for classes related to my majors. I have a letter of recommendation from Art History professor, a club and two job for my extracurriculars, and I'm working on the optional essay. How likely is it that I'll be accepted despite the F?",
    "comments": [
        {
            "level": 0,
            "comment": "Transfer student here. I was able to get into Hunter with an F from an intro class and another F from a seminar that were on my transcript. They weren’t related to my major (Studio Art) so I believe that helped. I didn’t do any extracurricular activities nor the optional essay and got accepted to CCNY &amp; Brooklyn College as well before committing to Hunter. I spent a solid 3 semesters at my previous school before I transferred to Hunter and my GPA ended up being a 2.7 so I honestly believe you’ll have a better chance.",
            "score": 3,
            "author": "neromaiden"
        },
        {
            "level": 0,
            "comment": "I think it's better if you withdraw the class instead of taking that F",
            "score": 3,
            "author": "Hyoukai_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would, but it's already too late to withdraw from classes",
                    "score": 2,
                    "author": "beatnikbarbie"
                }
            ]
        }
    ]
}