{
    "id": "zxjd9e",
    "score": 1,
    "title": "Is LIBR100 easy? Would you recommend it?",
    "author": "prettyrecklesssoul",
    "date": 1672257761.0,
    "url": "https://www.reddit.com/r/HunterCollege/comments/zxjd9e",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to take it to hopefully boost my average up a little. I’m gonna be taking five 300-level psych classes. Am I too ambitious? The psych classes in question are clinical psych, developmental psychopathology, adolescence, memory and attention, and sensation and perception.",
    "comments": [
        {
            "level": 0,
            "comment": "From what I’ve heard it’s an easy one credit course, and with all the psych 300s you’re taking, it should help boost it in the end. Are you taking two of these 300s to fulfill the psych electives? I’d imagine most people pick from the 200s which are a bit lighter to fulfill this (I’m also a psych major).",
            "score": 3,
            "author": "Pineapple125426",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to fulfill the two 300-level requirement and also have to take 15 more credits to finish my degree so I decided to take the other 300-level classes just to learn more lol",
                    "score": 1,
                    "author": "prettyrecklesssoul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just an fyi sensation and perception is a HARD course. I would just stick to adolescence and memory and attention for ur 300 levels since you only need two and supplement the last course with something like personality!",
                            "score": 2,
                            "author": "lolno-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh Jesus. I’ve already taken like 99% of the psych courses 😭 Is it similar to neuroscience?",
                                    "score": 1,
                                    "author": "prettyrecklesssoul",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I took neuroscience too and while it is kind of similar in regards to the biology information it’s still way more intense and confusing. I got an A in the course but I would’ve never taken it had I known.",
                                            "score": 1,
                                            "author": "lolno-",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Aw geez. I only added it bc it’s one of the few psych classes that fits with my schedule. I’m not a morning bird and the rest of the classes are early morning :/",
                                                    "score": 1,
                                                    "author": "prettyrecklesssoul"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The most useful course I ever took st hunter. I still use the stuff they taught about search engines when I look for stuff now.",
            "score": 3,
            "author": "ChukoBleot"
        },
        {
            "level": 0,
            "comment": "It’s easy but as a 1-credit course it will have very minimal impact on GPA.",
            "score": 2,
            "author": "xlrak",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn really?",
                    "score": 2,
                    "author": "prettyrecklesssoul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup",
                            "score": 2,
                            "author": "H-encore"
                        }
                    ]
                }
            ]
        }
    ]
}