{
    "id": "12cd1rm",
    "score": 3,
    "title": "Graduate Housing",
    "author": "Leminator3",
    "date": 1680682484.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/12cd1rm",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, I’m probably going to take my place at Dartmouth MEM starting Fall 2023. I am an international from Greece, and I cannot figure out housing. Where do graduates stay? What are your opinion on Sachem Village and Summit on Juniper (which I read terrible stuff about). Any help is more than welcome. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "I moved here for work at the hospital, so I don't know about the graduate school culture specifically. But Summit Juniper is less than a year old, so at least you know everything will be in brand new condition. I imagine the biggest complaint about it is distance -- it is probably 2 miles from campus. Its a beautiful and easy bike ride in the warm weather, but for 6 months you'll be stuck driving or taking a bus. \n    \nSachem village is a weird little suburban neighborhood stuck between sports fields and beautiful 10 sq. mile forest. It is also a mile or so from campus. My impression has been that it is very family-oriented. \n \nFor hospital workers, most new people end up in Timberwood commons. Super boring apartment complex -- its right across the street from Summit Juniper and a fine last resort.\n\nDid you look here: https://realestate.dartmouth.edu/dartmouth-rentals? Finding a rental apartment in town is probably your best bet",
            "score": 2,
            "author": "PEE_GOO",
            "replies": [
                {
                    "level": 1,
                    "comment": "For complaints about Summit Juniper, the bronze would go to the a month of no heat in the dead of winter.  Silver would be shared by  the insulting responses by the property management company (\"here, have a single space heater!\") AND Dartmouth (who lacked any conviction or urgency until the grad union flexed).  But the gold would be the lease terms, where [you are on the hook for a whole year if you have to break your lease.](https://www.reddit.com/r/dartmouth/comments/11i18v7/summit_on_jupiter/jax591b/)",
                    "score": 1,
                    "author": "Bicoidprime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "holy moly that is horrible. i hope someone is being held accountable. how does that happen in a brand new building…",
                            "score": 2,
                            "author": "PEE_GOO"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is a very stressful process, especially if you don't have a car. Make sure to post on facebook groups at Thayer. There are incoming students like you, who would want to partner up and be roommates. Also check dartlist out: https://sites.dartmouth.edu/dartlist/category/housing/",
            "score": 2,
            "author": "haybindalgakiran",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve had some stressful and overall bad roommate experiences during my undergrad years so I’d like to avoid that for the time being. Thank you for your help!",
                    "score": 1,
                    "author": "Leminator3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live (waaay) off-campus now, but when I started I moved into a Dartmouth grad student apartment 2 minutes from the Green. There are a few available right now here, so you can see what you'd be getting into: [https://realestate.dartmouth.edu/dartmouth-rentals](https://realestate.dartmouth.edu/dartmouth-rentals)\n\nA lot of my friends live or used to live in Sachem Village. It's fine. Expensive for what you get, but that's everything in the area. There's a bus to campus during the week and it's close enough that you can walk in a pinch. If you want to save money it should be pretty easy to find someone to share a two-bedroom apartment with. Other grad students tend to be too busy to cause trouble, but I totally get wanting to have your own space.",
            "score": 2,
            "author": "irabonus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve checked these out. I don’t get why those have such a short lease period. Very strange. \nSo sachem village is not only for families or anything, right?",
                    "score": 1,
                    "author": "Leminator3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Huh, I hadn't noticed that. I always had one year leases from August to August with the option to renew. I stayed in the same apartment for three years. Maybe they want to renovate those or something like that.\n\nAnd yes, Sachem is for all grad students.",
                            "score": 2,
                            "author": "irabonus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And what is your opinion on Summit on Juniper, have you heard anything about those apartments? They seem very nice.",
                                    "score": 1,
                                    "author": "Leminator3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't know anyone who lives there personally, but it seems like the company that manages them is a shit show (no heat for months, bad lease terms, bad communication, etc.) They're also really expensive, especially if you want to live on your own.",
                                            "score": 2,
                                            "author": "irabonus"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, I have checked everything. In-town rentals are very limited and usually short-term leases, which is bad. Where else could I check? Zillow? Thank you for your help, anyway!!",
            "score": 1,
            "author": "Leminator3"
        }
    ]
}