{
    "id": "12drldg",
    "score": 5,
    "title": "Dartmouth CS program",
    "author": "hasib5679",
    "date": 1680802464.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/12drldg",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got accepted to Dartmouth College in RD round and I intended to do major in CS. I will get 4 months to get ready for the class. Which kinds of stuff or course should be ready (might be helpful) prior to starting my entering class of 2027?",
    "comments": [
        {
            "level": 0,
            "comment": "Are you starting in COSC1 or COSC10?",
            "score": 3,
            "author": "PrimalVortechs",
            "replies": [
                {
                    "level": 1,
                    "comment": "not OP, but I'll be starting (hopefully) in COSC 10. Do you have any useful advice?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "COSC 10 (at least when I took it with Pierson) doesn't really take time to review or teach Java and jumps straight into teaching new concepts. If you just came from AP CS you'll be completely fine, but if you're like me at had no prior Java experience, the course can be very rough for the first week or two and you can fall behind easily.",
                            "score": 2,
                            "author": "PrimalVortechs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool, that sounds good, thank you so much for your help! I have about a school year's worth of Java experience so from the sound of it I'll be ok. None of it is particularly complex, but I have a good sense of primitive data types, while and for loops, nested for loops, some knowledge of classes and objects, arrays, ArrayList, 2d arrays, and some understanding of inheritance. Is there anything I should brush up on over the summer before giving the class a go?",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}