{
    "id": "3t23m9",
    "score": 74,
    "title": "#BlackLivesMatter Protesters Disrupt Students in Library: ‘F*ck You, You Filthy White F*cks!’",
    "author": "philbob84",
    "date": 1447702764.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/3t23m9",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "A white student would be expelled for this",
            "score": 84,
            "author": "philbob84",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would be one of the top stories on nearly every talk show as well",
                    "score": 17,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Were these students?\n\nBecause to be honest, if you are a black Dartmouth student  and you did this...fuck you.\n\nYour poor downtrodden struggle ridden ass, boo-hoo poor you. How horrible your life was to be able to be end up at an Ivy league school. The horror.\n\nIf you want to see how bad it is swing by, I'll take you to the hood you care so much about. See if you last an hour. \n",
            "score": 55,
            "author": "PaperPhoneBox",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who grew up in the projects, had shit kicked in by a couple of thugs who wanted to mug me, friends and neighbors getting punched for no apparent reason, old people who fucking marched on Washington during the civil rights movement and got their shit vandalized by a couple of thugs. I just want to say that these fuckers are stupid as fuck. ",
                    "score": 13,
                    "author": "edgegripsubz"
                },
                {
                    "level": 1,
                    "comment": "As someone who had 2 people killed within 4 blocks of where he lives yesterday, I sure am enjoying my white privilege. The sun hadn't even set and there were at least 20 rounds fired between my place and the main road.",
                    "score": 15,
                    "author": "smookykins"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I go to school in West Philly, and let me tell you, *that's* a real [hood.](https://www.youtube.com/watch?v=0znNiN0lYAQ)",
                    "score": 5,
                    "author": "downsouthcountry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "born and raised?",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In the playground is where you spend most of your days?",
                                    "score": 3,
                                    "author": "BuzzMowgli",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Chilling out, maxing, relaxing all cool?",
                                            "score": 2,
                                            "author": "Captain_Unremarkable"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ayy I'm also redditing from PA!",
                            "score": 1,
                            "author": "Captain_Unremarkable"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any student involved in this needs to be expelled or, at the minimum, be disciplined in a harsh way.  \n\nI thank these BlackLIESMatter protesters, though.  I thank them because, the more they protest, the more they will unravel their own fruitless, racist, hypocritical crusade to the masses.  It is imploding itself because a bunch of mediocre people don't have enough integrity to keep a legitimate movement going.  It will fizzle into nothingness.  See the OCCUPY movement... ",
            "score": 22,
            "author": "The_Genre",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, just got my posts removed and comments hidden in BlackLivesMatter sub for posting this link.\n\nedit: someone is seeking out links to this video and the comments and mass downvoting them.",
                    "score": 14,
                    "author": "smookykins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*BlackLiesMatter",
                            "score": 11,
                            "author": "The_Genre",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[It exists!](/r/BlackLiesMatter)",
                                    "score": 3,
                                    "author": "smookykins"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They did the same thing to me, they want to control all Facts in that sub. You should check and see if you were banned from all of their friend of blacklivesmatter sites. I was banned from all for posting one link that did not fit their idea of proper racism.",
                            "score": 2,
                            "author": "mortarmaggot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "they should at least be banned from the library because they disrupted the library. I'm sure there was some sort of clause in the university agreement they signed that no one reads",
                    "score": 13,
                    "author": "techfronic"
                },
                {
                    "level": 1,
                    "comment": "Yeah right, WHO is going to dare expel a bunch of minority students",
                    "score": 7,
                    "author": "aakksshhaayy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read this as World Health Organization and got decently confused for a few seconds.",
                            "score": 2,
                            "author": "Captain_Unremarkable"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And not a goddamn thing will happen to them because they're black.",
            "score": 21,
            "author": "FozzieBear29",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only because Whites don't do anything about it.  Fortunately that is changing with the Alt Right....\nhttps://www.youtube.com/watch?v=ckpW10YS37E",
                    "score": -4,
                    "author": "buckmurdock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "White privilege is being held responsible for the actions of your ancestors by people who accept no responsibility for the actions of their children. ",
            "score": 13,
            "author": "Stayskal",
            "replies": [
                {
                    "level": 1,
                    "comment": " The funny thing is, they are use a broad brush to paint anyone with white skin as an offender of some sorts yet there's a whole lot of people like myself whose families moved here fairly recently, whose parents didn't even have the advantage of speaking English or having a college education.  I take no responsibility for anything that happened decades and centuries before my family even came to the U.S. \n\nThis movement has gone from advocating justice and better policing to all-out racial supremacist rhetoric.   They are discrediting themselves.  ",
                    "score": 8,
                    "author": "JessumB"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "has the administration or faculty made any official statement about this incident?",
            "score": 7,
            "author": "DMTryp",
            "replies": [
                {
                    "level": 1,
                    "comment": "President Hanlon sent out a limp-wristed email last Friday but other than that, official word has been slim to none.  ",
                    "score": 7,
                    "author": "Threadbare70",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's possible they're reading things like this thread first to gauge what an appropriate reaction would be.",
                            "score": 2,
                            "author": "Captain_Unremarkable"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nope but if we agitate for it they will be forced to. Frankly white students need to start arming themselves for protection.",
                    "score": -13,
                    "author": "philbob84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you fucking serious? You idiot...",
                            "score": 15,
                            "author": "yale_alum15"
                        },
                        {
                            "level": 2,
                            "comment": "You don't go to Dartmouth. What the hell are you talking about? Arming themselves? Fuck off",
                            "score": 6,
                            "author": "ridingseahorses"
                        },
                        {
                            "level": 2,
                            "comment": "I mostly agree. I mean it's not like anyone's life was endangered at Dartmouth, but people should be able to arm themselves if they want to. ",
                            "score": 2,
                            "author": "I_wear_suits_daily"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you read the article or see the protest? It wasn't about racism by whites against blacks, like at Yale and Mizzou, it was about harassment by blacks against whites.  Doesn't seem to parallel well enough to make the admins a 'laughing stock.'",
                    "score": 2,
                    "author": "fieldhockey44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yale and Mizzou is largely black groups harassing white administrators as well for being \"racist\" when in reality they merely had differing opinions or \"didn't do enough\" to stop people from being racist on campus in the case of Mizzou ",
                            "score": 6,
                            "author": "Theige"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " http://i.imgur.com/vvfVpBy.jpg ",
            "score": 5,
            "author": "DroneIginla",
            "replies": [
                {
                    "level": 1,
                    "comment": "mark twain never had to deal with BLM activists",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hmm... if white people have privilege, and the best place to find white people is the library, then maybe the best use of your time might be spending more of it studying in the library...\n\nI mean, you're already at Dartmouth. Why not make the most of it?",
            "score": 4,
            "author": "pullthegoalie"
        },
        {
            "level": 0,
            "comment": "At Texas A&amp;M a White student was beaten to death by Blacks and the University, which always panders to \"diversity\" didn't say A SINGLE THING ABOUT IT!  Denton Ward.\nhttp://www.americanthinker.com/articles/2014/08/beaten_to_death_at_mcdonalds.html",
            "score": 3,
            "author": "buckmurdock"
        },
        {
            "level": 0,
            "comment": "Black lives matter? Maybe you should start by reinforcing that idea with all the black people who are shooting each other over extremely important issues like their JAWDINZ getting stepped on, somebody selling drugs where they wanted to sell drugs, or somebody eating the last chicken wing that they wanted.",
            "score": 4,
            "author": "2dicks1pussy"
        },
        {
            "level": 0,
            "comment": "Let's not rush to assume these are Dartmouth students.  Does anyone actually recognize any of them?",
            "score": 3,
            "author": "Kittens4Brunch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I recognize them",
                    "score": 18,
                    "author": "Dartmouth17"
                },
                {
                    "level": 1,
                    "comment": "They're absolutely Dartmouth students.  I recognize several and also the surroundings.  LOL",
                    "score": 8,
                    "author": "Threadbare70"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was born and raised in New Hampshire, a 92% white and conservative state (I don’t know how many out-of-staters are here). This is quite bold for that.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is like the Redditor's (neckbeard's) wet dream...  Not only does this give them an opportunity to blame affirmative action for their failures but also a chance for them to shit on the Ivy League that they failed to get into. ",
            "score": -17,
            "author": "yale_alum15"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow you aren't racist at all... /s",
                    "score": 1,
                    "author": "yale_alum15"
                }
            ]
        }
    ]
}