{
    "id": "9tr60i",
    "score": 31,
    "title": "The shooting- what we’ve heard",
    "author": "Bendragonpants",
    "date": 1541217359.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/9tr60i",
    "media_urls": [],
    "other_urls": [],
    "postText": "TL;DR on Friday there was an incident near the college that prompted a shelter-in-place.\n\nHere’s what I’ve heard:\n\n-around 9:50 on Friday, a person took a shot near the Christian Science Reading room (near Sigma Delta), grazing a non-Dartmouth student \n\n-There were reports of unconfirmed shots at collis, and around tuck drive, but these were false. These reports nonetheless prompted extensive police response from the area\n\n-One “non-Dartmouth student” was grazed, but was taken to the hospital and is ok. I’ve been told he was a student from Providence college up to visit a friend \n\n-Police arrested two suspects around 11:30 in Lebanon after a short car chase. They were driving a black Ford Fusion, which they crashed at the end of the chase. Both male, one was 17 years old, and the other was 22 years old. Unclear if they were connected to the events on campus \n\n-the shelter in place lasted around two hours \n\nI’d like to say that Dartmouth is a very safe campus and that HPD and Campus Security did an excellent job of providing information and keeping people safe. \n\nFeel free to ask any questions and I’ll try to update this thread as I learn more. ",
    "comments": [
        {
            "level": 0,
            "comment": "Last reported shots were 7 minutes ago. Seem to be moving away from campus. That being said, please stay indoors. ",
            "score": 5,
            "author": "eurasianspice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Link to listen to local police radio:\n\nhttps://www.broadcastify.com/listen/feed/6169/web",
                    "score": 6,
                    "author": "eurasianspice"
                }
            ]
        }
    ]
}