{
    "id": "mm6fmi",
    "score": 31,
    "title": "Just been accepted, have a bunch of questions!",
    "author": "sydthecoderkid",
    "date": 1617814258.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/mm6fmi",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I was just accepted to the class of 2025, and I have... So many questions. I thought it might be best to post here and get some advice. I hope this post isn't too long, and I'm going to try and make it as cohesive as possible!\n\n1. What's it like there for URMs? Dartmouth seems a liiittle scary, and I don't want to get there and find myself out of my element with people who will act weird towards me.\n2. Are the academics totally crippling? I come from a pretty big high school where my counselors don't even know my name, and the classes aren't super difficult(at least in my opinion) because our school didn't really have the resources to make them challenging. I don't want that to come off like \"I'm a genius who never had to study in high school\", I'm more asking like \"I'm not from a school that specifically charters kids from the womb to ivies, and I'm worried I'm going to get on campus and be immediately folded by an intro to calculus class.\"\n3. What's the cold like? I'm from around DC, and it gets cold sometimes, but it's mostly pretty warm down here. Is the cold system shocking? I don't mind snow, but I've never really had more than a few inches of it lol.\n4. Is there an overwhelming presence of greek life? I personally don't want to rush a sorority, so I'm hoping I won't feel out of place.\n5. My last question- How's the dining hall? A little bit more lighthearted, but I'm curious!",
    "comments": [
        {
            "level": 0,
            "comment": "First off Congrats! I’m a freshman and I’ll try my best to give you my take on these questions.\n1) I’m a 2nd gen mixed URM, I’ve yet to encounter anybody who treats me weird because of it. It’ll probably give you something to talk about to new friends, and you get to hear about them too. I’m sure others have had worse experiences, but you’re gonna find plenty of groups who treat you good.\n2) I came from a mid sized public school, but I understand everyone’s hs experience is different. You will take placement tests or take your ap credits to place you, they’re not gonna let you take a class you’re not prepared for. That being said some of the intro classes for your major are gonna be tough, chem and calc in particular from what I took/hear. You’ll get through it though! Everything comes together.\n3) If you’re from DC, the change shouldn’t be THAT shocking, you’ll probably need an extra layer, or to bring gloves and a hat when you typically wouldn’t expect one. Also bring good boots for winter.\n4) Greek life is commonplace but not overwhelming. You may have lots of your friends partying or chilling at frats, but you can still be invited or do something else with your time, there’s plenty to do. Also, not every frat is intense. Plenty of students don’t rush, I think at least 3/10? Someone else can back up that number or correct it I’m sure.\n5) Dining hall is alright, most of the cafes have been closed due to covid so foco is the main place people go. There is lots of options, but the vegetarian ones are less varied, from what my friends say. The food is pretty good, but every weekend is brunch until dinner, so if you like eggs and pancakes at 2:00pm that’s cool. The hall itself is nice enough, but people like to eat outside and all over campus.\n\nAgain congrats, hope this puts to rest some of your worries and questions!",
            "score": 8,
            "author": "absolute_snaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconded! Was also someone who didn't rush a fraternity, but ironically ended up spending lots of time hanging out with friends at frats/sororities.  Trust me, there's PLENTY to do aside from Greek life! \n\nDining might have been meh this year because of covid, but I found it to be spectacular when I was a student! There are 3 main dining areas (Collis, foco, hop), and each has different types of food. Collis pasta is great, and if you like the grill, the Hop has amazing options. Foco is great for pretty much everything and is \"all you can eat\" style.\n\nI was also from a mid sized public school and found the workload to be totally manageable. Just ask upperclassmen about classes ahead of time so you don't overload yourself with three hard classes in a term!\n\nYou'll come to love the snow, makes the campus look beautiful :) and if you do end up at darty, definitely take advantage of our skii slopes! Super cheap prices and lessons are available for your PE requirement. \n\nAgain, congrats on your acceptance and feel free to PM me with any other Qs!",
                    "score": 6,
                    "author": "sh97drt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Graduated a few years ago, but I still miss chicken bowl thursday and the chicken tender bob from the Hop",
                            "score": 1,
                            "author": "wondernever"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First, congrats on getting in! I'll take a stab at these, but I'm only one person so don't take my word as gospel.\n\n1. I'm extremely white so I can't speak to this.\n\n2. They're certainly not crippling but they are quite hard. I went to a similar high school to you, was never really challenged in high school so Dartmouth took some getting used to. It took me about a year to really get into the swing of things before I started performing up to the level I wanted to. But this will depend on which courses you take, etc.\n\n3. I moved to DC after being at Dartmouth for 4 years and it feels like I'm in a different country in terms of climate. It is considerably colder in Hanover than DC, by a lot. You get used to it over time, but it's a bit of a shock your first year. I am originally from New England and even I thought Hanover was colder than where I grew up.\n\n4. Greek life is definitely the biggest component of social life at Dartmouth, though they have been trying to change this for as long as I can remember. I think 60% of eligible students end up joining a house and almost all of the parties occur at frat houses. But this doesn't mean that you will be missing out by not joining a Greek house (I wasn't in one). There are plenty of things to do that aren't frat parties and while you may feel FOMO your sophomore fall as others are rushing, most people quickly get over that feeling.\n\n5. I loved the main food hall (foco) and went every day all four years. However, most people get sick of going to foco every day their freshman year and end up going to Collis or the Hop more regularly, both of which have great food.",
            "score": 6,
            "author": "bc12392"
        },
        {
            "level": 0,
            "comment": "Congrats and welcome to the family!  I can't speak to point 1, but I can cover you for 2-5!  I'll try not to be too wordy.\n\n2: They can be, but you're certainly in good company for your background.  But getting folded by an intro calculus class is part of college! (*glares at Math 008 intensify*) I was a pre-med engineer, and a couple of the intro courses definitely pushed me around, some of them are designed to weed kids out of majors/tracks.  The key is to not take it personally. You're learning how to work and study at a higher level.  Just follow your curiosity and don't sweat the intro stuff too much.\n\n3: It's cold. Real cold. I'm from the NYC area and thought I knew winter. The cold is shocking, but I also loved it.  I'm a winter person at heart, and my main extracurricular was skiing-related.  But if it really really isn't for you, then you can figure out how to make your winters off or abroad terms.  Just have a good jacket and a good fracket!\n\n4: It's not overwhelming but it's definitely a presence that's hard to ignore.  I thought I wouldn't want to rush when I got in. I actually ended up joining a house and it was one of the best things I did in college (the house was/is a bastion of URMs and is a fantastic safe space in that respect)! My time in the house has also really positively changed my post-college life as well, gave me some of my best college friends.  As with most things in Hanover, I'd say just keep an open mind and see what there is to see.  Then you can make your decision.  No one can really prepare you for greek life at the College, you just have see it for yourself.\n\n5: Foco is decent, it gets the job done.  Sunday brunch is definitely a high point! The Hop was my favorite, with Collis stir fry a close second (huge shoutouts to Brett, Falcon, Stephen, and all the other folks that make that place such a gem).  That said, being a Hop regular might take years off your life (get a General's Bob Marley at some point, thank me later) and I'm sure I'll regret those decisions later.  Overall, campus dining can feel a little claustrophobic at times, but there are some good options in town to break up the monotony once in a while, and there are some amazing places around the upper valley if you can hitch a ride with friends.\n\n6: Feel free to ask any other questions or DM me!\n\nEDIT: typo correction",
            "score": 6,
            "author": "leadbunny"
        },
        {
            "level": 0,
            "comment": "Congratulations! I'm way too old to answer most of your questions, but I can answer #3. I'm from DC. You need a good parka, gloves, a hat, a scarf, and a pair of LL Bean duck shoes for the mud and slush, and you'll be fine. Maybe long underwear for the coldest days if you get chilled easily. Depending on how heavy your parka is, maybe a down vest to layer up. Just check out [llbean.com](https://llbean.com). They're a New England company. They have an outlet at Rehoboth. Or REI.\n\nWhen it's really cold, like below 15, it's a dry cold and the wind is usually still. Just cover your face and you'll be fine. \"Mud season\" is harder than winter. It's what they have instead of DC's wonderful spring. Cold, rainy, gray, and endless. The unbelievably beautiful falls make up for it. And winter is nice, if you're properly dressed.",
            "score": 3,
            "author": "tyinsf"
        },
        {
            "level": 0,
            "comment": "Congrats!! You've gotten a lot of good info. I try to add some new perspectives.\n\n1. I'm white so can speak to that.\n2. The Qtr system is fast, but academics are not crippling for most. People still do tons of extracurriculars--clubs, sports and of course partying. You'll have to find your own balance. One thing I recommend is that you take advantage of the group tutoring sessions if you do STEM classes, esp freshman year. They are weekly and free and can really help you figure out how to approach the work, problem sets, exams etc. However, academics are hard, but you'll tough it out like everyone else.\n3. Cold? I'm a skiing fanatic so can't really comment on that. Winter is my favorite season. However, I was sick with colds so much in my frosh year (pre-covid). Awful. I would love to keep wearing masks if we could avoid the college dorm plagues.\n4. Apply to live in an LLC or farther away from the frat house if you want less exposure to Greek partying. There is a frat ban for your first qtr, but if you are living next to the frat houses, it's kind of hard to avoid. Participation in Greek life is very high, but few live in the houses. So even if someone is in a frat, they'll have a life outside of that too. Personally, I was open to joining a frat, at least I wanted to check it out, but then I got deep into the crunchy, granola DOC side of Dartmouth. My social time is full with those friends + clubs and activities at DOC off-campus houses, so I wouldn't be able to fit in frat commitments. However the once a qtr big party weekends (pre-covid sniff) were a blast. \n5. Fine but I'm not that picky and I like to eat a lot.\n\nLastly, one thing that took me a back at first was all the clubs that required tryouts and applications. I applied for many and then didn't get in. That was kind of a shock after being good at everything (in my mind) in HS. In my first qtr, I had a bit of FOMO from that. But it was all good in the end as it made me reflect on what I really enjoyed and who I wanted to hang out with. That led to my involvement with the DOC clubs.",
            "score": 1,
            "author": "seatto2023"
        }
    ]
}