{
    "id": "rz0r7r",
    "score": 95,
    "title": "What I wish I did differently at Dartmouth",
    "author": "BenSamuel200",
    "date": 1641651237.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/rz0r7r",
    "media_urls": [
        "https://www.reddit.com/r/dartmouth/comments/rz0r7r/what_i_wish_i_did_differently_at_dartmouth/"
    ],
    "other_urls": [
        "https://news.harvard.edu/gazette/story/2017/04/over-nearly-80-years-harvard-study-has-been-showing-how-to-live-a-healthy-and-happy-life/](https://news.harvard.edu/gazette/story/2017/04/over-nearly-80-years-harvard-study-has-been-showing-how-to-live-a-healthy-and-happy-life/)).",
        "https://www.youtube.com/channel/UC1KbedtKa3d5dleFR6OjQMg0](https://www.youtube.com/channel/UC1KbedtKa3d5dleFR6OjQMg0)",
        "https://80000hours.org/articles/money-and-happiness/](https://80000hours.org/articles/money-and-happiness/).",
        "https://80000hours.org/career-guide/job-satisfaction/](https://80000hours.org/career-guide/job-satisfaction/).",
        "https://www.axon.com/careers/ldp](https://www.axon.com/careers/ldp))"
    ],
    "postText": "**Introduction**\n\nI remember the day my family dropped me off at Dartmouth for the first day of orientation.  It was a bright sunny summer day.  I was so excited to make great friends, succeed academically, and position myself to lead a profitable career.  What followed were four years that looked great on paper - I got good grades and solid internships - but were a pretty mediocre experience.  During college, I was frequently lonely, going multiple days without speaking to anyone except the Foco employees as I said “thank you” when they swiped my ID.\n\nWhat I will try to do in this post is convey all of the recommendations I would have made to myself 4 years ago based on what I know now.  For background, I am currently an alum several years out of Dartmouth.  I should preface everything by saying that the recommendations in this post are just the thoughts of one person who is fairly un-informed about many of the topics he is discussing.  Additionally, I am still uncertain about a lot of recommendations I make in this guide - I’m not even super confident that I would have been better off if I followed some of the recommendations.  Finally, much of the recommendations I provide are probably totally unhelpful to people with different backgrounds. The commentary on dating/hookup culture is most likely only useful to heterosexual guys and the social life guidance is probably only useful to shy students.\n\nMy friend and fellow alum also had a similar experience to me and agrees with much of the ideas here.  He interned at several top financial firms, but experienced loneliness and social anxiety during much of his college years.  He said if he could have been given all the knowledge he has now about how to succeed at Dartmouth before starting, he’d pay a lot for the advice - $10,000.\n\n*Please feel free to critique any of the ideas here or offer your own reflections on what you would have done differently in the comments!*\n\n**Take easier classes**\n\nEdit: Let me preface this section by saying that I definitely think there is value in taking hard classes in many situations, I just doubt that many of the hard classes I took will actually prove useful in my career.\n\nDuring my freshman year, I wish I made establishing a social life my primary focus.  I remember the administration recommended taking easy classes for your freshman fall.  I completely disregarded this recommendation and took Math 8,  Econ 21, and CS 10.  While I performed well in the classes, I missed out on time to explore extracurriculars and otherwise spend time with classmates.  I wish I took easier classes throughout freshman year and spent the extra time trying to make friends.  During freshman year I think students tend to be more interested in making new friends as they haven’t formed friend groups yet.  Also students probably had more free time during freshman year before many of them committed to Greek houses.  I continued to take fairly difficult course loads until my junior winter.  At that point, I was upset about how bad of a social life I had and took two easy terms to work on the problem.  But by that point, it seemed like many potential friends were too busy to hang out.\n\nI would go as far to say, that it might make sense to take “layups” - classes where the median grade is high but the coursework isn’t heavy - for most of your college classes.  Throughout college, I had the belief that taking difficult classes (e.g. difficult CS, philosophy, econ classes) would improve my thinking ability and therefore allow myself to perform better in my career.  In the years following college I increasingly don’t believe this.  A good portion of the most ambitious people I knew in college took a number of layups.  I also suspect that most of the skills you build in classes aren’t that useful.  For example, taking more advanced CS classes in college might make you be a bit better of software engineer out of the gait when you start your first job.  But I speculate that someone of the same IQ who hadn’t taken the harder classes will probably catch up to you quickly.  Of course, taking hard classes won’t increase your IQ.   That said, while I am skeptical about whether harder classes can help in many careers, this is just my speculation and I’m sure it doesn’t apply in many cases.\n\nTwo classes I’d recommend taking during freshman year are ENGS 12 and THEA 30 (Acting 1).  Both classes have heavy workloads, but provide solid opportunities to make friends.  ENGS 12 has intensive group projects\n\nAlso on the social front, I wish I made a concerted effort on joining a Greek house freshman year, which I’ll describe more in the next section (Not that I think Greek Life is a good institution).\n\nAs far as what classes I would take, apart from taking distribs and major requirements, I would have taken classes that would have allowed me to get internships that use different skill sets to allow me to identify a career path that is a great fit (elaborated more in the “Try out research and internships” section).   For example, I could have taken the minimal number of psychology classes to get involved in psychology research, the minimum number of computer science classes to get a product management internship, etc.\n\n**Allocate more time to finding extracurricular(s) where you can make friends**\n\nDuring freshman year I was really motivated to make friends.  I viewed Greek Life and partying as a bad use of time.  I only went out once freshman year.  So, I avoided Greek Life and tried out lots of non-Greek Life clubs.  I went to a few meetings at a ton of clubs - the DEN, the Dartmouth Outing Club (Cabin and Trail specifically), Dartmouth Formula Racing, Dartmouth Robotics, an entrepreneurship club at the Rockefeller Center, etc.   But after going to a few meetings at these clubs and even after going to a lot of meetings at the DEN and the Dartmouth Outing Club, I made no friends.  I did not enjoy most of the conversations I had with people in the clubs and hoped to not see members of the clubs on campus out of fear of awkward encounters.  As my workload picked up and as I got involved in a startup projects in the second half of my freshman year, I became much less involved in the clubs.\n\nDuring sophomore year, when it came time to rush a Greek house I decided not to join.   As my sophomore year rolled around my social life never really developed.  I made one close friend from collaborating with him on a startup side project and I began to form a friend group with this friend and a few other weaker friendships, but when I left in my sophomore spring to do an off term, the group crumbled.  (As a side note, I wish I took my off term during my junior winter, as that is when most people do their off term, so I would have likely missed the fewest friends during the off term).\n\nI started drinking and going out.  When I went out, I saw other guys “hookup” with girls and I began to hear stories from friends about hooking up.  Like many of my male classmates, I became very interested in doing this activity.   I began to go out almost every weekend.  When I was intoxicated I was a totally different person.  I felt so refreshed to be free of the oppressive forces of shyness and academic stress that held me down day after day.  However, while drunk I did a poor job controlling myself and I did a few things I regret.\n\nI began to realize that being a brother at a fraternity could aid me in meeting girls, with a fraternity’s private parties with sororities.  I also heard that fraternities could be great places to make friends.  In my junior fall, I attended fraternity recruiting events and went through the fraternity rush process.  Unfortunately, I was not given a bid to the frats I rushed.  I don’t blame the Greek House’s for denying me access - who wants to admit a brother who isn’t able to control themselves when drinking?  However, as a side note, I know of several friends who did far more minor things than I did and were still unable to get into most or in some cases all fraternities.  So word to the wise - be very careful what you do when drinking (E.g. black out, injure yourself, get into a fight, talk to a girl inappropriately, annoy a brother, etc) - the campus is small and word will spread.  When you rush a frat at Dartmouth (at least this is true of several frats when I rushed), they hold a meeting where the brothers will bring up any bad things they heard about the PNM (potential new member) and then they will vote whether or not to admit the PNM.  I’ve seen PNMs be denied admission for offenses as small as being too socially awkward when talking to a few brothers.\n\nI ended up being able to join a small Greek House later on in my Junior year.   I really hoped that joining this fraternity would massively improve my social life.  I became very involved in the frat, serving in different officer roles during my time there.   Unfortunately, I had difficulty making friends in the frat.   Since the frat was so small we had few parties and virtually no brotherhood events.  Also, most of the brothers were pretty shy people and I think I have a harder time making friends with other shy people like me.   There may have been a self-selection process at work - shier people like me might have been less attuned to the advantages of joining a frat, invested much less time into the rush process, and then were only able to get into what was probably the least desirable Greek house at the time.\n\nDuring my senior year, we merged with another frat that had been permanently shut down, took a big rush class, and my frat changed tremendously.   Many of the new members were very social and I had an easier time talking to them.  We started having more parties and brotherhood events (e.g. weekend road trip to Montreal) that were a great way to bond with brothers.  I made my second close friend at Dartmouth during this time.  Had I joined this type of fraternity in my sophomore year, I might have had a much better social life throughout college and thereby a much more enjoyable college experience.\n\nHowever, while being a member in a social Greek House was the extracurricular that ended up being the best environment for me to make friends on campus, I am no supporter of Greek Life.  I suspect that Dartmouth would better serve its students if the college had no Greek Life.  I think Greek Life’s dominance of Dartmouth’s culture drains students from more wholesome extracurriculars and suppresses intellectual discussions, among other harms\n\nI am not even convinced that I should have worked hard to join a social Greek House.  Maybe some of the other extracurriculars I tried could have worked out as well.  Why wasn’t I able to make friends in the other extracurriculars?   Ultimately, I don’t know.  But I have several hypothesis:\n\n1. I think that my shyness was a huge barrier in making friends in the extracurriculars.  If you are so uncomfortable around people that you dislike most conversations, you will likely have a hard time making friends.  If I could do college again, as I’ll elaborate on in the shyness section, I would have invested a huge amount of time early in college to treat my condition.\n2. After doing an initial survey of extracurriculars, I should have tried harder to get involved in the clubs I found most promising.  I did attend the DEN and the Rockefeller entrepreneurship club events many times throughout freshman fall, but I did not get involved in leadership roles or continue my involvement for a longer period of time.  I didn’t do this largely because of my increasing academic workload and startup side projects, but I could and possibly should have reduced these time commitments to free up the necessary time.  As a side note, at least when I was in Hanover, the DEN and Rockefeller entrepreneurship club had few consistent attendees and limited leadership roles - so I don't think they were great places to make friends.  Also, I had an unhealthy obsession with startups throughout much of college that robbed me of many hours that I could have used to treat my shyness or make friends in extracurriculars.  So I probably should have chosen to invest my time in clubs that were not entrepreneurship focused to avoid feeding the startup obsession further.\n3. I wonder if non-Greek Life extracurriculars tend to be attended by less social people at Dartmouth, on average, than Greek Life organizations (of course there are tons of exceptions).  I imagine social people are more conformist and are therefore more drawn to Greek Life.  As I mentioned previously, I think I have a harder time making friends with shier people like me, so this could have been part of the reason I struggled to make friends in non-Greek Life clubs.  Of course, this is just my unsubstantiated speculation.\n\n**Get a girlfriend**\n\nI should preface this section by saying that the perspective about hookups may be offensive to women.  I apologize if anyone is offended, but I still think it’s worth surfacing this unfiltered male perspective.  From what I gathered, hooking up happens at Dartmouth a fair amount.  My friend in college went through periods where he would hookup with a different girl every week or two.  At first, I thought I had the potential to hookup just like him.  I felt like I was of a similar physical attractiveness to him, so shouldn’t I have an equal shot?   In reality, I later learned girls place a high value on how confident a guy is.   When I would approach girls, even after many drinks I was still too nervous to smile and make eye contact.   I “performed” far worse at hooking up with girls than my friend.  Seeing attractive, seductively dressed girls every night I went out and being mostly unable to hookup with with them while my friend was able to so almost every week filled me with an intense lust, jealousy, and frustration that was a defining feature of my Dartmouth experience.\n\nIn retrospect, I wish I didn’t try to hookup with girls.  With my social anxiety induced awkwardness and average looks, I had little chance of success in this activity on Dartmouth’s campus (where the average male who goes out has quite a high level of attractiveness).  I kept thinking that drinking lots of alcohol would make me less shy and increase my likelihood of success - it took me way too long to learn that alcohol didn’t help.   As a side note, I wish I consumed far less alcohol.  For most Dartmouth students, our IQ is our most valuable asset, why risk damaging it with excessive alcohol consumption?   Also, was “success” in hooking up really that conducive to flourishing at Dartmouth or life in general?   I think that the best Dartmouth experience for a guy may be to be in a committed relationship.  My evidence for this is weak and anecdotal.  Most of the guys who I knew who were the happiest had girlfriends.   When you are hooking up, even if you are a “player” who is able to frequently hook up, you could go a few weeks without hooking up which will make you feel let down.  I imagine being in a relationship almost totally takes your mind away from hooking up (and feeling bad about not being able to hookup).  Also, being in a committed relationship adds another close relationship to your life and as the famous Harvard relationship study supports, relationships are key to happiness ([https://news.harvard.edu/gazette/story/2017/04/over-nearly-80-years-harvard-study-has-been-showing-how-to-live-a-healthy-and-happy-life/](https://news.harvard.edu/gazette/story/2017/04/over-nearly-80-years-harvard-study-has-been-showing-how-to-live-a-healthy-and-happy-life/)).\n\nOf course there is a tradeoff, with relationships you have to deal with breakups, which can be miserable.  Two close family members of mine, whose opinions I respect about a lot of matters, strongly recommended against getting into a committed relationship in college.  They said that college is a stressful period even in good circumstances, having a breakup during college could make the experience intolerable. So while I’d definitely recommend myself trying hard to find a girlfriend early in college, like with the fraternity section, I am not super confident in this recommendation.\n\nTo the end of getting into a relationship in college, I probably should have:\n\n1. Tried to make lots of progress on my shyness.  Whether trying to hookup or date, I think it’s critical for a guy for a guy to not appear nervous, awkward, weird and/or creepy (all of which is how I think my shyness safety behaviors made me appear).  Please see my “shyness” section for my thoughts on how to do this.\n2. Improved my physical attractiveness.  While I certainly spent time on this during college, I focused just on dressing and hair.  There are a lot of dimensions to attractiveness - facial hair, teeth, muscularity etc. which I mostly ignored.  I had somewhat crooked teeth and they could have easily been improved with braces.  (I eventually got braces after college).  In any case, I think the shyness was far more of a limiting factor for me (and probably most shy guys) in meeting girls than attractiveness.  For working on attractiveness, there are tons of great YouTubers - alpha m is a good example:[ https://www.youtube.com/channel/UC1KbedtKa3d5dleFR6OjQMg0](https://www.youtube.com/channel/UC1KbedtKa3d5dleFR6OjQMg0)\n3. Tried to make a lot of platonic female friendships.  At least when I was at Dartmouth few years ago, dating apps were almost useless in Hanover. One of my friend’s from college who was successful in dating on campus had a ton of female platonic friends and went out with them or otherwise hung out with them on a weekly a basis.  He said this was the best way to meet a potential girlfriend at Dartmouth.   Of course, since I was struggling to make male friends, I probably needed to work on shyness before working on finding platonic female friends.\n\n**Treat Shyness Aggressively**\n\nI think the biggest thing holding me back at Dartmouth was shyness.   Part of my issue was not finding an extracurricular where I could spend time with a consistent group of sociable students - whether that be a fraternity or club.  But I think the larger issue was that I failed to make friends in whatever extracurricular I was a part of because I was a robot in conversations.  I did not make jokes, smile or make eye contact with almost everyone on campus except for a few friends.  When other people were talking I spent a portion of brain power listening to them and another portion “scripting” what I planned to say next to avoid any scary pauses in the convo.  If I ever thought of a joke to tell, I would make sure not to say it to avoid the risk of making a bad joke.  Whenever I would run into other people on campus, even people I semi-considered friends, I would be afraid.  Apart from a handful of people on campus, for the most part, I hoped to not run into any of my other “friends”.\n\nDuring psychotherapy I later learned my robotic behaviors in social interactions are called “safety behaviors” and are common among shy people. I began doing psychotherapy near the end of college for my shyness, but I wish I started much earlier.  I also learned there are a lot of other ways of treating shyness.  Here are what I think are the top methods and how I’d implement them in college if I could redo Dartmouth:\n\n* Improv\n   * I think this may be one of the best activities for overcoming shyness.  I saw improv brought up as a treatment for shyness several times on reddit threads and YouTube and I began doing it recently.  During covid I did remote improv, which I think is a lot less scary and thereby a lot less effective.  Right now I’m doing in person improv and it seems like it has a lot of potential.  My improv instructor said that he saw many of his students do improv for the purpose of overcoming their shyness and succeed in their goal\n   * When I was at Dartmouth there was a college improv club.  Unfortunately, the club held tryouts, so joining probably won’t be easy for a shy person.  I would still really try to get into this club - maybe try to be as nice as persuasive as possible to the club members about asking to join.  Maybe it would be possible to join without actually performing?  You could also take THEA 30 (Acting 1) which I read on layuplist does a ton of improv activities.   You could do improv at a local theater during an internship during an off term in a city (e.g. NYC/Boston/SF/etc).\n* Psychotherapy (CBT)\n   * I’ve read online from many sources that of all forms of psychotherapy, CBT is the form that has the most evidence behind it of helping patients successfully treat their social anxiety.\n   * I’ve done psychotherapy for several months in college through Hanover Psychiatry and more after college.  The therapy helped me somewhat to uncover my safety behaviors and helped me work to eliminate them.\n* Volunteering\n   * I’ve also read online that volunteering can be a great way to treat shyness.  I haven’t tried out this solution much in the past, but I recently started being a career mentor to a first generation lower income college student.  I plan to try out volunteering, especially in person volunteering, a lot more in the near future.\n   * Anecdotally, I remember being very social during many of few volunteering activities I’ve done in my life.  During high school I did a volunteer trail maintenance program, where I’d spend a week repairing trails with other high school students in the middle of nowhere.  I was a different person during those weeks, making more friends during during the short program than during the rest of high school.\n   * I haven’t researched what opportunities to exist at Dartmouth to volunteer.   My guess is there are a ton of opportunities, but the opportunities may vary greatly in their usefulness for overcoming shyness.   I think the ideal volunteering opportunity would occur on a regular basis (e.g. weekly) with some of the same people each week.\n\nThere are also a lot of other interventions you can take to work on shyness.  After my hours of researching on the internet, these don’t seem like as strong of bets as these first few, so I haven’t invested much time with them:\n\n* Other forms of psychotherapy (ACT, talk therapy, etc.)\n* Meditation\n* Medication\n* Getting a part time job where you are forced to interact a lot with people (e.g. waiter)\n\nHonestly, if I could have done college over again, I would have taken a gap year after high school and moved to a major city and focused all of my time on treating shyness.  I would have gotten an unskilled job where I was forced to interacted with people a lot, worked with a great psychologist who I had a strong connection with, signed up for multiple improv classes, etc. and cured this problem once and for all.  While I could have done all of these activities during college, I'm not sure I would have had enough time to invest in these activities to make substantial progress on my shyness while still being able to meet my academic/career goals.\n\n**Don’t be so focused on amassing wealth**\n\nLike many male students at Dartmouth, my top goal in my career was to become very wealthy.  For many students, finance was their path to making a lot of money.  For a smaller group, startups were their path. Some students fell into both groups.  I fell pretty solidly into the startup group.  I spent much of my free time during my freshman year brainstorming startup ideas.When thinking about my career, I thought little about which career would be satisfying / rewarding and thought mostly about how to be as financially successful as possible.\n\nShortly after graduating Dartmouth, I discovered 80,000 Hours career advice articles.  Reading their articles totally altered my plans.  80,000 Hours is a UK based non-profit organization dedicated to providing career advice to help promising students and early career professionals maximize their impact on humanity.  Founded and run by Oxford grads and launched through the startup accelerator Y Combinator, 80,000 Hours provides the most detailed and evidence-based career advice content I’ve been able to find in my many hours of searching the internet.\n\n80,000 Hours made an article summarizing the research about the relationship between money and happiness / life satisfaction: [https://80000hours.org/articles/money-and-happiness/](https://80000hours.org/articles/money-and-happiness/).  After reading the article, I was persuaded that I should focus far less on optimizing wealth with my career plans.  This quote from the article sums it up well:\n\n&gt;A lot of the research on \\[the question of whether more wealth brings more happiness\\]  is of remarkably low quality. But there have been some recent major studies in economics that allow us to make progress. In particular, we now finally have survey data from hundreds of thousands of people all around the world. We’ve sifted through the best studies available to figure out what’s really going on. The truth seems to lie in the middle: money does make you happy, but only a little. And this has many important implications about trade-offs you face in your life and career\n\n**Try out research and intern in different roles to find a satisfying career**\n\nI found the 80,000 Hours article on finding satisfying work even more impactful:  [https://80000hours.org/career-guide/job-satisfaction/](https://80000hours.org/career-guide/job-satisfaction/).   According to the article, which aggregated research from 60 studies on job satisfaction, there are several factors to what makes a job satisfying.  But the most important factor is how good you are at the job.  When you are better at a job, you have more leverage with employers to get all of the other factors to your liking (feeling like you’re helping other people, working with coworkers you like, avoiding major negatives like under-compensation or long commutes).   Also, according to 80,000 Hours, even if your goal is just to maximize success (as opposed to job satisfaction or social impact), you will usually be best off working in a career that closely aligns with your strengths.\n\n80,000 Hours states that the best way to find a career that aligns with your strengths is to identify your strengths by doing different types of work - quick ways of determining strengths like strengths assessment or self-reflection aren’t effective.  The organization advises people to take short work assignments to test different skill sets (e.g. internships, volunteering, side projects etc.).\n\nWhile at Dartmouth, I did virtually no career exploration.  I did three internships in the same role at different companies during my off terms.  I did no research.  Unsurprisingly, I currently work in the same role as I interned for three times.  After reading the 80,000 Hours article however, I am now trying to do work assignments in several other roles. For the last four months I have been taking on another role’s responsibilities at my company and hope to fully transition to the role in a few more months.  After that, I plan to use side projects or transition into a third role to test additional skills, before settling on a career path that best aligns with my strengths.\n\nI missed a big opportunity by not trying out roles in college.  As an early career professional, trying out a role involves working in one role for at least 1-1.5 years before transitioning.  While in college I could have easily done 3 month internships in different roles.  Also, you can easily try out research while in college.  If I could do Dartmouth over I would try to test out different skill sets through internships:\n\n* communication careers: management consulting, product management, writing for a Dartmouth newspaper\n* problem solving careers: software engineering, analyst at a financial firm, data scientist, electrical engineering, etc.\n* research oriented careers: do research with a professor\n* creative careers: UX design, creative writing, product management\n* entrepreneurial careers: try doing a startup\n\nI also wish I positioned myself to pursue an opportunity after graduating college that would have allowed me to test out a few different skillsets.  I think the best option would have been some sort of cross-functional rotational program (e.g.[ https://www.axon.com/careers/ldp](https://www.axon.com/careers/ldp))  Alternatively, I think working in management consulting could be a great opportunity to do different sorts of work and identify strengths.  In this profession, I’ve heard you have the opportunity to work on different types of projects (E.g. research/analytical based, communication based, doing product management on internal tools, etc.).  You also tend to get lots of performance feedback which could better help you identify strengths.\n\n**Conclusion**\n\nThank you for reading.  If you found this perspective useful, please share with your network.  Please feel free to critique any of the ideas here or offer your own reflections on what you would have done differently.  If you want to chat, please feel free to DM me.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 50,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;But, Greek Life remains not for everyone, and you even said at the end that you knew happy unaffiliated people. I think the main issue here is that you really didn’t find a whole lot of spaces at Dartmouth in your first couple years to make friends because you felt too shy, and left out because the whole social scene revolves around Greek Life (which it does).\n\nI think one mistake a lot of guys make is thinking about how to get into the house with the \"most social status\" that they can as opposed to being in a house that they have connections with and would enjoy. The ideal situation is that you meet older kids through clubs, sports, classes, whatever, and are comfortable enough around each other that you'd want to be in a house with them and vice versa.",
                    "score": 11,
                    "author": "imsoawesome11223344",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "u/imsoawesome11223344 I agree with that perspective.  When choosing a frat to rush, I can totally see how it may be useful to look at other factors besides just social status (e.g. how well do you click with the brothers, what other extracurriculars do you have in common with the brothers, etc.).  In my case, I joined the only frat I was able to, which was low social status and small.  As I mention in the post, many of the brothers were shy and I think I have more difficulty making friends with shy people like me.   Most of the brothers were not friends with each other and did not spend much time in the house.  Most of the brothers were not career-focused, while I was very focused around my career.  Had I joined a Greek House with a larger more outgoing brotherhood, I suspect I would have made more friends.",
                            "score": 3,
                            "author": "BenSamuel200"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "DrToadley, I think you make some great points. Let me address each paragraph in turn:\n\nFirst: Is it worth taking hard classes? Sure, I totally see the value in taking hard classes in some cases.  I’m not well informed about career paths that require grad school, but I could imagine that taking hard classes could be useful in that case (e.g. get a more rigorous looking transcript, see how heavy of an academic workload you can handle, etc.).  As far as taking hard classes because you are interested in learning the material, it certainly seems plausible to me that there are cases where this is a good idea.  I do wonder whether a lot of people “want” to learn material because they think it will be helpful in their careers, when in reality a lot of the material will be not particularly relevant on the job and/or forgotten.\n\nSecond:  I agree with your perspective that Greek Life is bad: I suspect Dartmouth would probably better serve its students if there was no Greek Life.  I meant to include this thinking in my original post, but in order to get the post out quickly I omitted it.  Also, I agree with your conclusion that the Greek Life section of my post, as currently written, acts as one more conformist pressure on students on a campus already stricken with conformity.   I remember that during my sophomore year, Bill Deresiewicz, the author of Excellent Sheep (a book about how elite colleges have for a long time encouraged conformist thinking over free thinking) gave a talk at Dartmouth and made the point that Dartmouth was the most conformist of all the Ivys.   I don’t want to be part of the conformist forces.  I will edit the Greek Life section of the post to not push so much for joining Greek Life.\n\nYou stated that it is okay to be shy and be yourself.  Do you think that shy people shouldn’t invest lots of time and effort to fix their shyness?  I’m not sure you mean this and I don’t want to put words in your mouth.  In any case, I feel that shyness is a huge issue that holds so many people back - it prevents people from developing friendships and succeeding in their careers.  There is also some research that supporting that shy people are arguably more likely to develop various mental disorders.\n\nThird: I am not familiar with “incel” culture and do not wish to dive into that at the moment :), so I won’t comment on your incel sentence.  I definitely agree that there are probably a number of shy guys who do well with girls (I imagine in relationships, not hookups).  I think it all has to do with how you manifest your shyness and your degree of shyness.  For me, I manifested my shyness through “safety behaviors” - behaviors that some shy people exhibit to lower their anxiety levels.  I generally avoided eye contact, expressing emotions (e.g. smiling), and moving my body when around people.  So when I’d approach guys or girls and chat with them, I would not appear normal and would probably be somewhat uncomfortable to talk to.  In my case and I imagine in many guys case, the shyness was a huge issue to developing relationships with girls (short and long term).  Also it’s hard to be yourself when you are very shy.  So many people have given me advice to just be myself - I wish it was that easy.  I really do.",
                    "score": 5,
                    "author": "BenSamuel200"
                },
                {
                    "level": 1,
                    "comment": "Thank you for sharing your thoughtful perspective.  I will plan to share a well thoughtful reply this evening.",
                    "score": 5,
                    "author": "BenSamuel200"
                },
                {
                    "level": 1,
                    "comment": "I agree with what you mention in your third paragraph, but would point out that the mentality you describe partially comes about due to the environment and conditions themselves, and arguably isn’t a character trait itself.",
                    "score": 2,
                    "author": "sfmonke6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I totally agree with this perspective!  In high school, I never measured myself by how \"well\" I did with girls.  I measured my success largely based on academic performance (which is not necessarily great either, but that's another discussion).  But when I went to Dartmouth, with with its social life dominated by Greek Life and many male conversations (at least among my friends) focusing on \"getting with\" girls, I think I began to feel a powerful competitive urge to do better in this area.",
                            "score": 3,
                            "author": "BenSamuel200"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i'm a female '23 (currently in hanover) and i have big hangups with greek life. i'd like to expound on what u/DrToadley said about it, because it factors so much into your post and i feel so strongly about it.\n\ni do believe it's a system that enables... well... bad behavior. although this isn't a dartmouth-specific thing, i don't think it's healthy for frat brothers to see women going to their parties as some kind of commodity to prove to the school that they're cool and can pull. like -- who cares?\n\nany environment where a bunch of 18-22 year olds are getting hammered and high all the time is bound to have issues and to attract creeps. duh. the problem starts when we allow frats to define the entire social space of dartmouth. and that's exactly what they do. i'm super lucky to have a group of friends who are way more outgoing than me, because otherwise i'd be totally in the lurch because i can't afford to rush nor do i care to. \n\ninstead of our drinking scene being dominated by regulated, adult-run bars and clubs, held to the standards of the law and with money on the line for their fuck-ups, we have frats. anyone who's seen SNS (campus police) walk through a frat knows what a joke they are, and knows there is next to no regulation (except regarding fire hazards. for some reason they are uptight about those). entrance to a frat, even though it's much easier here at dartmouth than at state schools, is still determined by stuff like who you're friends with, if you're a hot girl or an annoying frosh, etc. at this point, i've begun to get in people's faces if they make comments like \"of course you can get into frats easier, you're a girl.\" maybe this'll come off a bit radical feminist of me, but i'm not commoditizing my body. who they choose to let in is on them, and i don't doubt being a girl helps, and i kind of wish that wasn't the case, because the implications of that are stomach turning. more women in the house = more sexual currency. i can't say i love that. i know it's just a part of life, but i do feel frats perpetuate the woman-as-sexual-currency thing.\n\nbased on that, you might think i looooove sororities and coed frats. i don't. OP, i don't know when you graduated, but we now have coed houses along with our sororities, all of which pride themselves on being especially LGBT and woman friendly and safe etc. and guess what? they also get sexual assault cases brought up against them. again, alcohol and drugs ruin some people's decision making processes and make others especially vulnerable, which is why even at these \"progressive\" houses, there are so many cases like this. it's a group of students, run by students, overseen by students, and that would be awesome if it was a school newspaper, but it's essentially a very unregulated, very dark bar.\n\nfinally, there is power in the group. fraternities and sororities are, ultimately, groups, and their purpose is to exclude others. that's fine. but their incredible amount of power on campus, especially in regards to the social scene, makes this unfair. let me give an example of why i think this is really toxic. one of the sororities here is very progressive. i used to like the place a lot, and go there often with my friends and my boyfriend. a few of the girls at that sorority found my boyfriend annoying and got him blacklisted from there. i know that sounds bad, but 1) i was by his side all the time we were there and know nothing happened, and 2) their complaints were based on overheard conversations that they misunderstood. with no proof, no due process, and no warnings, he was not allowed back. fine, again, their right. but then they started telling other people on campus he was a bad person and had been blacklisted, and people understandably assumed he'd raped someone. this is dangerous. this is not an empowering social setup. i'm sure you can tell already, but i'm very disillusioned with greek life at dartmouth, even and especially with those houses which claim to be \"changing the system from the inside.\" you can't do that. we should just have bars. i'll happily pay to not deal with social clout-ing my way through the snow to see if a sig nu brother will let me into tails if i namedrop enough.",
            "score": 15,
            "author": "shorterversion",
            "replies": [
                {
                    "level": 1,
                    "comment": "u/shorterversion, thank you for your thoughtful post.  Overall I totally agree with your main argument, which I take to be that most Dartmouth students would be better off without Greek Life.  I updated the Greek Life section of my post last night to highlight that I am no fan of these organizations.  Let me respond to each of what I think are your major points:\n\n*Greek Life’s domination of Dartmouth social scene leads to the following harms:*\n\n*Elevated levels of sexual assault*  \nI would be surprised if this wasn’t true.  As you say, having a campus social scene where tons of students get hammered and/or high and go to very unregulated, dark bars to party is going to lead to some bad behavior.  You also made the point that the coed Greek Houses aren’t much better (maybe just as bad).  There were several of them when I was on campus.  When I was a student, it seemed like these houses were small and tight nit and did not engage in much intensive partying.  Maybe that has changed in the years since I graduated?  In any case, it makes sense to me that these houses could be just as bad as gendered houses.\n\n*Objectifying women as sexual objects/currency*  \nAs a male who knows little about “sexual objectification”, I do not have much of a perspective on this.  But Greek Life has certainly been harmful in other areas, so maybe it is harmful here as well.\n\n*Unreasonably excluding some students from campus social life*  \nI saw a decent amount of this when I was a student.  I had a friend who was falsely accused of sexual assault.  The rumors spread all over campus.  When it came time to rush sophomore year, every house he rushed did not give him a bid.  He was very close to getting into one of the houses, and the brothers told him they would love to have him and they have no doubt that he was innocent, but they could not take the repetitional risk of bringing him in - sororities might start boycotting the house’s tails.  I also know a lot of guys who weren’t able to get into most or all frats for stupid reasons.  One of my friends blacked out one night at a frat during freshman year and this prevented him from getting into most frats.  Another one of my friends tried to rush my frat.  During rush deliberations two brothers brought up that he was socially awkward.  I said that he's just socially anxious and I was sure he would improve.  Another brother said - \"But do we really want someone who is socially anxious?\".  Shy people may stand the most to benefit to be part of a structured extracurricular with regular opportunities to do activities with a consistent group of people, but many Greek Houses may shut their doors on these people.",
                    "score": 3,
                    "author": "BenSamuel200",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hey, thanks for responding. i hope my initial post didn't come off as rude -- my frustrations lie with greek life, not with you! you actually had some pretty good advice in your post in my opinion.\n\ni've also heard of people not getting into houses because they were awkward, socially anxious, or socially unaware. i'm sad to hear that's been happening for longer than i've been here.\n\nsome of our coed houses do not throw parties. some of them do, and the intensity of those parties varies from house to house.\n\ni hope you look back on your time at dartmouth with fondness. i love being here, personally, but i know so many people struggling right now, and all they want to do is drop out. i hope it does get better for their sake.",
                            "score": 3,
                            "author": "shorterversion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No problem!  Your post didn't come off as rude to me.\n\nI can't say that I look back at college with fondness.  That said, it wasn't a bad time either.   Overall, I had a decent time in college.  The average day could be pretty lonely and work filled, but most trimesters had plenty of fun times - DOC hikes, Habitat for Humanity builds, hanging out with my 2 close friends, etc.",
                                    "score": 3,
                                    "author": "BenSamuel200"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for this, I agree 100%.",
                    "score": 1,
                    "author": "deniro289"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Would you say taking off sophomore spring is really that bad? I’m doing the same but I suppose it really is very uncommon",
            "score": 3,
            "author": "gimandchee",
            "replies": [
                {
                    "level": 1,
                    "comment": "not OP but it's all really about what you make of every situation, if that makes sense. i took off my sophomore spring and i was fine",
                    "score": 3,
                    "author": "shorterversion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "makes sense - I am kinda worried about FOMO since friends are staying behind, but I’m seeing family for the first time in years and finding opportunities which hopefully will be fulfilling \nThanks for the response.",
                            "score": 2,
                            "author": "gimandchee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're probably going to feel a degree of fomo during any off-term. I wouldn't overthink it, enjoy the opportunities and family time!!",
                                    "score": 3,
                                    "author": "haplessandhopeful",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you! Hopefully I’ll find an internship or research position soon enough and then it’ll be perfect :)",
                                            "score": 2,
                                            "author": "gimandchee"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "u/gimandchee, I think taking off sophomore spring may have been somewhat damaging to my social life, but as u/shorterversion said it really depends on your situation.  In my case, I had a burgeoning friend group and I was struggling socially, so it may have been valuable for me to stay behind during my sophomore spring to nurture these relationships.  I did get to live with my family during the off term, but I saw them frequently because they only lived a few hours from campus.  Also the internship was not a useful one and I would have been none-the worse off without it I suspect.  I ended up doing three internships in the same role, and the one I did during my sophomore spring had the weakest brand name and learning value I suspect.",
                    "score": 1,
                    "author": "BenSamuel200"
                }
            ]
        }
    ]
}