{
    "id": "tyvdpb",
    "score": 11,
    "title": "Stuck between two schools.... help!",
    "author": "hlsassy",
    "date": 1649392230.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/tyvdpb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I got into Dartmouth and UIUC- both in MCB PhD programs- and I am stuck between the two with the acceptance deadline looming. Ive done several pros and cons lists and both are coming up pretty even. Any advice or input would be appreciated!\n\nFor context:\n\n- I'm interested in micro- specifically either microbiome, microbe-microbe interactions, or host-microbe interactions\n- UIUC is closer to home\n- Living situation is important to me- looking for safety + pet friendly",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great advice here. The only thing I'd add is to contact the professors you're interested in and see if they're taking students this coming cycle. Some only take a student every 2 years. You don't want to be stuck scrambling for rotations you didn't want. That could solidify your decision of where to go.",
                    "score": 4,
                    "author": "Hopeful_Optimism"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm only a first year PhD and in CS, so maybe not the most helpful for your situation. But I'll share some thoughts about the community! \n\nImo the grad lifestyle here is good to great, depending what you're looking for. Good if you want a lot of activities, great if you want a slower scene. My department tries hard to have socials and since there aren't a ton of us, everyone knows everyone and it's pretty fun. You'll see friendly faces every day, which is a big deal. The Upper Valley is super safe and very pet friendly. A ton of people have dogs and there are lots of parks/trails/walking paths. TONS of nature stuff if you're into that.\n\nOn the flip side of it being a close-knit place, it's a very small area. There are practically 0 restaurants or even grocery stores open late, and it's at least 1.5 hours to the closest mall (though Boston and all the fun stuff there is only 2 hours, so it's doable if there's like a concert or game or something you want to do). Being far from family can be hard (I'm from the west coast so I'm home once or twice a year), especially while living a research lifestyle where you're basically working alone all day (maybe it's different in a bio program lol all I do is read write and code). I'll also add that I live with my partner who moved out here with me and that makes living a quiet lifestyle in a small community a lot more fun/doable. :) \n\nBoth are great schools! I wish you the best of luck!",
            "score": 3,
            "author": "pkseeg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!! I appreciate your insight!!!",
                    "score": 2,
                    "author": "hlsassy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thats really great advice! Thank you!!",
            "score": 2,
            "author": "hlsassy"
        }
    ]
}