{
    "id": "tz9jts",
    "score": 15,
    "title": "Dartmouth vs Cornell for CS",
    "author": "PrimalVortechs",
    "date": 1649441224.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/tz9jts",
    "media_urls": [],
    "other_urls": [],
    "postText": "Really torn between these 2 options for CS. Cornell seems to have an objectively better program, at least in the eyes of employers with Dartmouth being somewhat of a no-name outside of the biggest tech companies and far less recognizable than Cornell. That and Cornell is much closer to home to the point where on long weekends I could come home; due to the distance of Dartmouth I realistically could only come in for summer and Christmas. Outside of that though I prefer Dartmouth in almost every other aspect, from what I've seen the campus is much nicer than Cornell, there's more to do to avoid boredom, it's $5k cheaper per year, and student life seems miles better at Dartmouth. Haven't visited the campus in person yet but I've done virtual tours and will be heading down at the end of this month for Discover Dartmouth.",
    "comments": [
        {
            "level": 0,
            "comment": "Cornell has a better cs department but I would still pick Dartmouth because of the smaller class sizes and d plan\n\nAlso, your uni does not matter for comp science at least compared to fields like consulting/IB",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't it pretty important for your first job though? Also, what exactly about the D-Plan makes Dartmouth more advantageous?",
                    "score": 2,
                    "author": "PrimalVortechs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It matters for your first internships but Dartmouth is literally a top school regardless or it’s CS rankings so it would be fine. Also, Cornell is a very good choice but it’s also more stressful.",
                            "score": 8,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "D-Plan allows you to do internships out of summer season, so Fall/Winter/Spring is also open for internships. This makes it easier to land a good internship.",
                            "score": 4,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Good to dispel this illusion early. My husband has an engineering degree from a top 10 engineering school, postgrad from another elite institution, and works for dudes with degrees from Tennessee Tech, can't use Excel, and haven't done math for 50 years. Where you go to undergrad really doesn't matter.",
                            "score": 4,
                            "author": "jayblurd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; with Dartmouth being somewhat of a no-name outside of the biggest tech companies and far less recognizable than Cornell\n\nI don't know where you're forming this impression, but I think you're way off base. Any hiring manager that has formed an opinion on Cornell will also be very familiar with Dartmouth. \n\nWRT program strength, I'd say it really probably doesn't matter nearly as much as any interships/etc that you do, with the _possible_ exception of the case where you want to go straight from undergrad into grad school. But otherwise I think you'll be fine.",
            "score": 13,
            "author": "amos_burton",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second this. Obv biased as a Dartmouth CS student but there is practically no difference between the two in terms of hiring, or even grad school admissions. \n\nIn a lot of ways I'd pick for your research interests, of which Cornell probably has more diversity if you're not sure. But if you're interested in health computing, mobile computing, or security, there are lots of options at Dartmouth. Plus Dartmouth cares a LOT about undergraduate research - not true everywhere (can't speak for Cornell specifically).",
                    "score": 6,
                    "author": "pkseeg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "D Plan and DALI are huge, and honestly give you a big leg up (as it did for me).",
            "score": 6,
            "author": "muffinner",
            "replies": [
                {
                    "level": 1,
                    "comment": "And research for undergrads is so easy to get. I did paid software research for a stem prof during my first term as a freshmen for example. Just took a cold email and a 20 minute chat about my interests and the current projects they had in their lab. If you put in the effort to reach out, Dartmouth profs will give you a chance. This is one of the main benefits of doing CS at a small school like Dartmouth. A whole lot of the departments' resources is going to just a few majors.",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I've heard of D-Plan but what's DALI?",
                    "score": 3,
                    "author": "PrimalVortechs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "its hard to sum up quickly but it’s a student run software development group and you can learn how to develop production-tier applications and get good work experience along the way. look it up on google if you want to learn a bit more",
                            "score": 3,
                            "author": "muffinner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "can any student join or is it restricted to older students with more experience ?",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People of all years join. A big focus of DALI is mentorship and growth, so you don’t have to be an experienced developer/designer to join and be impactful. If you think DALI might be for you, I’d encourage applying right away and building out some of their suggested demo apps, because even if you don’t get in for a few terms, the demo projects are great for building your skills.",
                                            "score": 1,
                                            "author": "muffinner",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m thinking of either majoring or minoring in CS and I don’t have any experience so I thought that by joining the DALI lab, I could learn new skills. However, it seems so competitive so that is holding me back but I will surely think about it more once I get to campus! Also, where do you find the demo projects? Do you have to apply to do them or are they available for anyone to do?",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Here’s the demo app challenges: https://github.com/dali-lab/dali-challenges/blob/master/README.md",
                                                            "score": 1,
                                                            "author": "muffinner"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "DALI is a professor-led student tech consultant firm. Gives students great experience",
                            "score": 1,
                            "author": "dartmouthrowaway"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i too, had narrowed down my choices to dartmouth and cornell. for reference: i’m looking to do some sort of environmental engineering (i’ll probably double in env studies). \n\nundoubtedly, engineering is more highly ranked at cornell, but i chose dartmouth for the flexibility of d plan, small class sizes, and accessibility of research&amp;impact groups. if you look at grad statistics, there’s almost no difference in career outcomes between the schools. \n\ndartmouth aligns with what i want to do, so i chose dartmouth. do what’s right for u:)",
            "score": 5,
            "author": "No_Mushroom8159"
        },
        {
            "level": 0,
            "comment": "Seems like you’ve already made your mind up tbh. Just try touring with an open mind, you never know what you’ll find!",
            "score": 2,
            "author": "greeneggsandham20",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm absolutely leaning towards Dartmouth but it just feels wrong passing up a school with an objectively better department for my major",
                    "score": 1,
                    "author": "PrimalVortechs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The major difference between Cornell CS and Dartmouth is there is more research coverage at Cornell, with many labs and researchers. Dartmouth is a smaller department, still with great and accomplished profs btw, but less researchers. We do have coverage overall in most major fields just not most subfields. So yes there are several ML profs but there might not be one that is an expert at a specific subfield of ML. This might affect you as a grad student a lot if you are needing a PI who has strength in the topic you are writing your dissertation about. But, for undergraduate.. you will be fine career-wise going to either school. CS alums here do very well in recruiting. Congrats on your acceptances and good luck!",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I recruited for tech last fall I found Dartmouth alumni or connections to people I met through Dartmouth at literally every single company I considered. Our network is insane.",
                    "score": 7,
                    "author": "mabrera",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is true. I've done software and fintech internships. Alums everywhere at top companies.. who are also very encouraging on LinkedIn regarding advice and referrals. I've sent like 20 cold messages to Dartmouth alums during my time here. All but 2 responded and more than 10 offered referrals within a few chat messages.",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}