{
    "id": "u47eec",
    "score": 8,
    "title": "Will I get rescinded if I get two Cs ?",
    "author": "anonymous062904",
    "date": 1650027216.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/u47eec",
    "media_urls": [],
    "other_urls": [],
    "postText": "They said\n\n“Our offer of admission is made with the expectation that you will maintain the level of scholarship and personal excellence that characterized your candidacy. Accordingly, we will carefully review your performance during the remainder of your senior year…if you enroll we ask that your final transcript shall be forwarded to the Office of Admissions",
    "comments": [
        {
            "level": 0,
            "comment": "We can't tell you. If any of us had been rescinded we wouldn't be here.",
            "score": 9,
            "author": "biggreen10"
        },
        {
            "level": 0,
            "comment": "Depends on a lot of factors. If you had straight As all through high school and that was a high point in your application, admissions might have some concerns about grades dropping in multiple classes. Dartmouth cares a lot about “intellectual curiosity” and senioritis is sorta antithetical to that premise. I would avoid getting Cs if at all possible. Bs most likely wouldn’t be an issue.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "i got a bunch of Cs and a D or 2 my senior year and wasn’t rescinded.",
            "score": 1,
            "author": "Cool-Sock7807",
            "replies": [
                {
                    "level": 1,
                    "comment": "same",
                    "score": 1,
                    "author": "cerberusd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "idk about you but i basically got a letter in august that said “we accepted you based off your original grades, make sure you don’t fall behind at dartmouth and ask for help”",
                            "score": 1,
                            "author": "Cool-Sock7807"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got a C+ and a few B’s my senior year, got an email that suggested I use the academic resources on campus once I got to Dartmouth but they didn’t actually say anything about rescinding me",
            "score": 1,
            "author": "throwaway270921"
        }
    ]
}