{
    "id": "udac36",
    "score": 4,
    "title": "Parking on Campus/Upper-Valley Housing",
    "author": "mrqkc22",
    "date": 1651084175.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/udac36",
    "media_urls": [],
    "other_urls": [
        "https://www.dartmouth.edu/transportation/parking/cost_information/gradstudentcommunication8262021.pdf)"
    ],
    "postText": "Hi everyone, I am an incoming grad student and had a few questions about living near Hanover. \n\nIt seems as though Hanover and the surrounding areas are in a bit of a housing crunch (as is the rest of the country). Due to this, I expect to live in a nearby town (most likely Lebanon, Wilder, or Hartford). I've found a handful of potential places using Dartlist, Zillow, Craigslist, etc., but are there other resources should I use? Would it be worth it to use a realty firm? Furthermore, if you have experience with living well-off-campus, I'd love to hear what you have to say (I am coming from a *very* walkable campus city). \n\nWhich leads me to my next question: how is parking on-campus? I noticed [this](https://www.dartmouth.edu/transportation/parking/cost_information/gradstudentcommunication8262021.pdf) announcement which states that grad students won't be charged a parking fee for fall-term parking. That is great, but is on-campus parking competitive? How likely is it that I get a parking spot? I am fully open to using public transportation, but there are likely to be many days where I get to campus early and leave late. \n\nP.S. I'm from Northern Minnesota, so I'm fine with winter driving :) thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "The Dartmouth Real Estate site has a community list: https://realestate.dartmouth.edu/rental-property/upper-valley-rentals and a faculty/staff/grad student list: https://realestate.dartmouth.edu/rental-property/dartmouth-rental-housing/graduate-rentals\n\nI’m not sure if sharing a specific landlord name here is acceptable or not but if you’re looking in Orford, I’m happy to warn you away from a landlord there via private message. She’s left a string of wronged tenants, including at least one that won a case against her in small claims court. We found out too late. She lists on the community list so I like to mention this whenever I share the list.",
            "score": 3,
            "author": "Wrenold"
        },
        {
            "level": 0,
            "comment": "Parking here isn't a problem - almost all the graduate students I know commute, yet the lot I use gets at most halfway full during the week. Also parking passes have been free for graduate students the entire time I've been here - not sure if that'll continue, but I'd assume yes. Hanover public street parking is free after 5pm and rarely full. The area is small enough that there's hardly any traffic, even at 9am or 5pm.",
            "score": 2,
            "author": "pkseeg"
        },
        {
            "level": 0,
            "comment": "Parking is free for Guarini students in Dewey lot. Thayer students get Ledyard, Lewiston and Dewey for free. If you work in the new CECS building, then you get all 3 for free as well. This is until at least the coming June. Hopefully it continues being free.\n\nDewey is not competitive at all — lots of free space. But ledyard is competitive at times. Lewiston is also mostly free. Thayer staffs (such as research assistants) use it since they don’t get ledyard parking.",
            "score": 2,
            "author": "voxclamantisundique"
        },
        {
            "level": 0,
            "comment": "Random point, but the spaces in Dewey are about a foot more narrow than NH guidelines, so be aware you are going to pick up A LOT of door dings.  Smaller spaces is how Dartmouth fits more cars in a lot.",
            "score": 1,
            "author": "Bicoidprime"
        }
    ]
}