{
    "id": "v12lqm",
    "score": 12,
    "title": "Laptop recs?",
    "author": "Ok-Spinach6637",
    "date": 1653924243.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/v12lqm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey! Incoming 26 wondering what the best type of laptop is for BME? I’ve read that there’s some sort of stigma against macs but what do you guys think? Anyone have any recommendations?",
    "comments": [
        {
            "level": 0,
            "comment": "You will have no regrets if you get a 14 inch MacBook Pro",
            "score": 9,
            "author": "18houston2"
        },
        {
            "level": 0,
            "comment": "As a CS Major, Mac is super helpful. Half the profs (even non CS) don’t even know how to use windows",
            "score": 5,
            "author": "jkshitij77"
        },
        {
            "level": 0,
            "comment": "yeah very curious about this. im a qss major so ill have to take a fair amount of computing/stats classes, wondering what computer would be best",
            "score": 3,
            "author": "Dolphintan",
            "replies": [
                {
                    "level": 1,
                    "comment": "A Mac. No clue about BME, but I’m a qss major and you’re going to want a Mac.",
                    "score": 6,
                    "author": "duckyduckdog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm thinking about qss and geog and in the same position as op could you say why Mac?",
                            "score": 1,
                            "author": "Jdubssssss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most seamless operating system. Vast majority of students and professors here (not just Qss) use macs. Therefore, they’re going to assume you have one. Not to say that windows won’t work, but they’re going to have to go out of their way to figure out things for your computer. It’s just better to have a Mac. Trust. \n\nAlso, not saying that you can’t do it, but be prepared to think about your majors and your plan. Because QSS is interdisciplinary, it’s course intensive meaning that there might not be enough space for you to double major. That’s just my experience. Most Qss minor in Cs or double\nMajor in gov/Econ only because of how much overlap there is. It’s definitely possible, just not sure if it’s realistic. Take classes in both though. Not telling you this to squander your dreams, just wish someone had told me this when I was a freshman",
                                    "score": 2,
                                    "author": "duckyduckdog",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the response this is super helpful! And the double major advice is helpful too, I'll probably choose between the two to keep room to explore or minor in something more useful.",
                                            "score": 1,
                                            "author": "Jdubssssss"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}