{
    "id": "w5sxrj",
    "score": 14,
    "title": "Question about someone?",
    "author": "Financial_Pool_9273",
    "date": 1658544877.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/w5sxrj",
    "media_urls": [],
    "other_urls": [],
    "postText": "So there is this popular left wing influencer (anyone’s politics have no effect on who is a predator or not, I’m just describing him) who has been accused by multiple people on Reddit and on chat apps of sexually assaulting 8 people on campus.\n\nNow, I personally am not a part of the school, but I am interested in ethically partaking in political content and I did watch him until I found out about these claims, and that strikes me as disturbing.\n\nHowever, most Twitter accounts attacking him and calling him out, seem like right wing  bot accounts so I’m also a tiny bit suspicious as to the veracity of these claims. Plus, there seems to be no official reporting on this, and based on the tiny level of info about these claims It’s unlikely that the people who work with him or watch him know about these allegations.\n\nMy question here, is that student-influencer really known around campus for being a predator, and/or has many allegations against him, or is this an online bot attack? What are the thoughts of actual people on campus? \n\nShould this be taken with a grain of salt?",
    "comments": [
        {
            "level": 0,
            "comment": "I haven't even been on campus yet and I know who you are talking about and have heard people warn others about him. Apparently he is transferring too. So yeah idk, it seems legit",
            "score": 16,
            "author": "GodisLvng"
        },
        {
            "level": 0,
            "comment": "Everyone knows this dude and he’s blacklisted from every social space.",
            "score": 11,
            "author": "Kovine921"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Keep digging!!!!",
                    "score": 1,
                    "author": "Karmas-a-beotch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Late on this but just wanted to add: this became a topic of conversation around campus (both in-person and on Librex) far before it was picked up by anyone on Twitter (think the first time I heard about it was Dec. 21?). In fact, I remember it being pretty infuriating at the time that there was zero mention of this on Twitter while this guy was spam posting.\n\nI don't know anyone who made an allegation personally, and I can't even really give an opinion or not on whether or not the allegations can be substantiated (I have no exposure to the Title IX process), but these claims did not start on Twitter, they started on campus, and it was a well-known thing on campus well before it was picked up by anyone on Twitter.",
            "score": 1,
            "author": "MindlessPhilosopher0"
        }
    ]
}