{
    "id": "wduew3",
    "score": 7,
    "title": "Any advice to stand out as a transfer for Fall 2023?",
    "author": "BlackStallion657",
    "date": 1659392720.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/wduew3",
    "media_urls": [],
    "other_urls": [],
    "postText": "2 years ago I dropped out of university due to my severe depression and mental disabilities that caused me to do not so well in college with a 2.7 GPA. Now that I am now mentally stable, I am planning on returning to community college in a couple of weeks. I know that my chances are very slim, however I do believe that I can achieve a 4.0 GPA this year in CC. With my old university and CC, by the time I apply next spring I should have over 60 credit hours. I’m joining 2-3 clubs this year and volunteering every weekend at the food bank. I am also working full time job. Do any of you have any other advice that I can use to help me stand out as a transfer?",
    "comments": [
        {
            "level": 0,
            "comment": "First, why Dartmouth? It’s the very first question on the application. What is something unique about your position that would contribute to the college? How has going through this hardship in your life shaped the way you see the world and why will that be good fit with the student body? What do you hope to get out of an education at Dartmouth that isn’t possible at your CC or another institution? \n\nThese are the kinds of questions you’ll need to have good answers for in order to be considered. Dartmouth accepts, like, 5 transfers a year. Way harder to get in as a transfer than through normal application.",
            "score": 4,
            "author": "Wrigleyville2016",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your input! I will definitely think long and hard about these questions to give out the best answer! \n\nDo you mind if I DM you a few more questions?",
                    "score": 2,
                    "author": "BlackStallion657",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please do",
                            "score": 1,
                            "author": "Wrigleyville2016"
                        }
                    ]
                }
            ]
        }
    ]
}