{
    "id": "wk7laf",
    "score": 6,
    "title": "How can I prepare for COSC1 with no prior coding experience?",
    "author": "Specialist-Bit7578",
    "date": 1660062131.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/wk7laf",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m an incoming freshman and I’m torn between a few majors but all of the majors I am considering have COSC1 as a common prerequisite. However, I had no coding experience in high school and am worried this class will be extremely difficult for me because of that. How can I get some exposure to coding so I can be prepared to take this class sometime this year?",
    "comments": [
        {
            "level": 0,
            "comment": "Freecodecamp python",
            "score": 5,
            "author": "7059043"
        },
        {
            "level": 0,
            "comment": "This is also a source of great anxiety for me, thanks to those who replied to this post.",
            "score": 3,
            "author": "Tyrannus_ignus"
        },
        {
            "level": 0,
            "comment": "the course is based on [project python](http://projectpython.net/chapter00/index.html) (created by dartmouth profs), work your way through the first few chapters on your own before starting the class to get a sense of what it’ll be like and a head start",
            "score": 3,
            "author": "windroidian"
        },
        {
            "level": 0,
            "comment": "Seconding using projectpython to code since that’s exactly what they use in the class! You can also try out the assignments and material on the [course website](https://cs.dartmouth.edu/~kvasanta/cs1/schedule/index.html) which is basically the same every year. If you’re feeling extra anxious, try looking at or even doing some of the assignments ahead of time!\n\nThe key thing with learning programming is you need to actually practice out writing the code and running it and getting it to work. Fortunately projectpython allows you to run code directly on the site in each section so you can see where you get stuck.",
            "score": 1,
            "author": "tasukete_onegai"
        }
    ]
}