{
    "id": "wytqhj",
    "score": 14,
    "title": "Grocery Shopping in Hanover",
    "author": "Lopsided_Use_5297",
    "date": 1661575262.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/wytqhj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a ‘26 and a little confused about groceries and general shopping in the Hanover area. I understand that there is a Co-op in Hanover for basic groceries, but if I wanted to access the Walmart/Home Depot or maybe the fast food in West Leb is there any form of transportation to get me there? Is delivery available in Hanover?",
    "comments": [
        {
            "level": 0,
            "comment": "The AT (advance transit) can take you to west Leb, where the target/Walmart are. But almost nobody grocery shops as food is accessible on campus.",
            "score": 17,
            "author": "duckyduckdog"
        },
        {
            "level": 0,
            "comment": "I'm a huge fan of the AT! With that being said their hours can be tough to work around, especially if you're on a tight schedule. Idk since I haven't been a student for a little while, but there used to be a zip car on campus available to rent. \n\nAs a '26, though, you'll have a full meal plan for the first term at the very least. There are actually a good variety of food options, especially compared to other schools' offerings. Most people don't grocery shop that much in the beginning. When I was a student, if you had a lot of DBA you could buy things (like a whole carton of almond milk) from Collis. I used to buy a \"salad\" and just loaded my bowl with the veggies I wanted/needed, then took them home to my dorm to use as I pleased. That was my version of grocery shopping sometimes (haha).",
            "score": 9,
            "author": "haplessandhopeful"
        },
        {
            "level": 0,
            "comment": "Bus",
            "score": 6,
            "author": "Even_Prior_3924"
        },
        {
            "level": 0,
            "comment": "as others have said, you generally don’t need to go off campus for food and there’s a CVS in hanover (plus the coop is a big store and there are two of them). if you really need something from west leb and can’t work with the AT schedule you can also look into getting a zipcar but that can get expensive quickly and they often have limited availability. it also helps to make friends with people who have cars.",
            "score": 4,
            "author": "embossykitty"
        },
        {
            "level": 0,
            "comment": "You can take the bus to the stripmall area in West Leb, but then walking from the bus stop to the store that you want to visit is kind of demoralizing because it's just giant parking lots.  One possibility is that the AT buses have bike racks on them.  Biking on the main road down there is a little sketchy, but there are cut throughs between a lot of parking lots so you can get around down there that way.\n\nBut in practice, what most people do is order stuff online to be delivered to campus, if it's something you can't get in town.  That or get a ride with a friend who has a car.",
            "score": 3,
            "author": "EWheelock"
        },
        {
            "level": 0,
            "comment": "hii! advance transit (they have an app...google maps works sometimes, too, but can be inaccurate in times)! they only operate on weekdays, though, and the last bus to dartmouth is at 5-6pm ish, so you def would need to go before then. plan for it to take 30 mins each way. \n\nco-op in hanover is easily accessible. walking distance from east wheelock, tri house, some campus apartments...other locations may require the use of a bike or advance transit \n\ndelivery from this co-op is available from what i know, but personally have never tried it.\n\nyour best bet is to take advantage of green to-go and fill it up with whatever your heart pleases...dining plans are expensive. fern also uses disposable boxes as does collis, and there are some great breakfast options (think pastries at fern, smoothies, acai bowls). \n\nalternatively, you can use DBA (250$ refilled each term on ivy unlimited) at collis or the hop and buy yogurt, fresh fruits (strawberries, watermelon), parfaits, gas station type sushi, etc\n\nthings get EXPENSIVE FAST! budget your money wisely and make use of your DBA when needed. save your hard earned money for something more expansive down the road...something i struggled with a lot with my paychecks when i started working on campus",
            "score": 3,
            "author": "NoEstablishment4289"
        },
        {
            "level": 0,
            "comment": "if you need things besides fresh food etc amazon/online shopping is your bestie",
            "score": 1,
            "author": "NoEstablishment4289"
        },
        {
            "level": 0,
            "comment": "I would say take a bus to target, but no bus during weekends, so if really need to go shopping on weekends, just zipcar",
            "score": 1,
            "author": "Even_Prior_3924"
        },
        {
            "level": 0,
            "comment": "Grubhub delivers if you really need that spicy nuggets kick from Wendy’s! Also Instacart delivers as well. Found these out on a winter term where I was feeling especially lazy and cold.",
            "score": 1,
            "author": "tasukete_onegai"
        }
    ]
}