{
    "id": "zf0jj4",
    "score": 6,
    "title": "Dartmouth ED Financial Aid Myth!!",
    "author": "Sad_Investigator_220",
    "date": 1670417948.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/zf0jj4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Guys I have received the email regarding Fin Aid too and looking through all the threads even one from 2009. it seems like there is enough evidence to suggest that there is a strong correlation between receiving the email and getting in, a pretty STRONG one!. \n\nI know that some people argue that it might just be a coincidence and there isnt enough data on people who did receive the email and still got rejected, it doesnt make sense bcz I believe every and every single student out there count and take everything they receive from any admissions office via email or otherwise SERIOUSLY. the first thing I did when I received the generic email( although I had submitted all the necessary documents prior and they were ticked too), I jumped on google and typed in what I had received. I think everyone who received the email would have shared their outcomes both positive and negative. and we can see from all the past and present threads that the overwhelming majority have cited the strong correlation. \n\nplease everyone share your thoughts on this!!\n\nI am hoping for the best for every single one of you!! may we all earn what we deserve",
    "comments": [
        {
            "level": 0,
            "comment": "My son received the email—first generic but also a specific follow-up question. I don't think it means anything. I read all the earlier threads, but what's missing are the people that got rejected and received an email. If you are denied, you move on with your life and most likely don't want to post about getting rejected. For the good of future applicants, one should consider posting if there is a rejection after email.",
            "score": 12,
            "author": "Kat1836"
        },
        {
            "level": 0,
            "comment": "Did you differentiate between RD and ED? RD I’d  e inclined to agree. ED I haven’t seen many emails until this year.",
            "score": 3,
            "author": "cookiesandsteam",
            "replies": [
                {
                    "level": 1,
                    "comment": "well, I think its just more plausible that the email thing applies to both. I have seen ED of previous years too though",
                    "score": -1,
                    "author": "Sad_Investigator_220"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What documents did u submit previously and what were required now after the email? Did you submit the ISFAA or CSS?",
            "score": 2,
            "author": "UChicagoSimp31415",
            "replies": [
                {
                    "level": 1,
                    "comment": "I submitted ISFAA on 24th and it approved and ticked by 28th. After the email i checked and tax returns were missing which i submitted right after.",
                    "score": 0,
                    "author": "Sad_Investigator_220",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And now they ask you to submit some others docs? (Not tax returns?)",
                            "score": 1,
                            "author": "tanya19_05",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, they havent contacted me eversince.",
                                    "score": 1,
                                    "author": "Sad_Investigator_220"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I submitted the ISFAA and both my parents' Employer statements back in 31st of October and two days ago my portal updated. It now includes the employer statements of both my parents and the Signed Custodial Parents' 2021 Income Tax Return being waived since my country doesn't file taxes.  Then all the dates changed to 12/07. Is it a good sign similar to the email? I haven't received any email but I think it's because I submitted everything correctly.",
                            "score": 1,
                            "author": "UChicagoSimp31415"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When did you receive?",
            "score": 0,
            "author": "AsadbekZu",
            "replies": [
                {
                    "level": 1,
                    "comment": "a week ago",
                    "score": 1,
                    "author": "Sad_Investigator_220",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nice",
                            "score": 0,
                            "author": "AsadbekZu"
                        }
                    ]
                }
            ]
        }
    ]
}