{
    "id": "zrfghy",
    "score": 5,
    "title": "Using AP Credit to Skip Classes",
    "author": "ThoughtLow2294",
    "date": 1671614532.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/zrfghy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, an incoming freshman here,  \n\n\nThis question is for current students/alum: How would you advise someone who wants to skip math &amp; econ classes with AP credit? My math is decent and with a little study, I believe that I can recall most of  calculus/micro/macro. Is it worth it to skip the intro courses? Why/ why not? Thank you!!!",
    "comments": [
        {
            "level": 0,
            "comment": "Yes. There are much more exciting classes than ECON1 and Math 3/8. I’d advise revising the material a bit and exploring during freshman year.",
            "score": 6,
            "author": "Ulquiohime",
            "replies": [
                {
                    "level": 1,
                    "comment": "If u skip most of the ap equivalent classes, how many course units can you allocate to courses that are not related to your major? I'm thinking of doing a modified major but I also want to take some language, humanities courses outside of my requirements.",
                    "score": 3,
                    "author": "xanthin16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AP exams only place you out of classes, they don't give you credit towards graduation, so it wouldn't really change what you're asking about.",
                            "score": 11,
                            "author": "biggreen10"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Skip. Intro classes are notoriously terrible, like econ 1.",
            "score": 2,
            "author": "Kovine921"
        },
        {
            "level": 0,
            "comment": "Definitely skip. I took a lot of Math in high school and I'm so grateful that I don't have to take intro classes. I haven't heard a good thing about any of them. I'm '26 working through all the placement exams this break, they're not too bad and I was able to pass with a little revision.",
            "score": 1,
            "author": "slytherin71"
        }
    ]
}