{
    "id": "zupk3n",
    "score": 8,
    "title": "Boot question",
    "author": "QueryYourTheory",
    "date": 1671938769.0,
    "url": "https://www.reddit.com/r/dartmouth/comments/zupk3n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Sorry for all the questions lately!!! I was looking to get some boots and from what I’m seeing timberlands and L L bean are the best ones (I think the duck LL beans I’m particularly?) and I was wondering which is better! I want to wear these year round.",
    "comments": [
        {
            "level": 0,
            "comment": "Blundstones! You’ll find them all over campus lol. But seriously, most comfy, easy boot ever",
            "score": 6,
            "author": "duckyduckdog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the rec! J curious, what would you say are the most common boots on campus?",
                    "score": 1,
                    "author": "QueryYourTheory"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorel boots get my vote. Warm, last forever, good traction.",
            "score": 3,
            "author": "justcurious12345",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was looking through these! They’re very cute. Is there any style you recommend?",
                    "score": 1,
                    "author": "QueryYourTheory",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I personally prefer the ones that go up higher. I hate getting snow in my shoes and it's nice to be able to tuck jeans in so they don't drag around and get wet.",
                            "score": 1,
                            "author": "justcurious12345"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i asked this earlier too! Once i saw how the duck boots from LL looked, I instantly knew I was getting timberlands.",
            "score": 1,
            "author": "Popular-Ad2918",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve heard the LL ones are more functionalll… def don’t wanna fall on my butt cuz of the ice lol",
                    "score": 1,
                    "author": "QueryYourTheory",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Timbs nor LL Beans claim to be slip resistant I don’t think. There’s another brand that’s really good for slip resistance, but they are ugly as well :( lol",
                            "score": 1,
                            "author": "Popular-Ad2918",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great 😭 I agree that the timbs are really nice looking, they just had a massive sale too!",
                                    "score": 1,
                                    "author": "QueryYourTheory",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have a pair of timbs that are the premium « shock resistant » waterproof ones. They somehow are cheaper than the original, i think because they’re not ad much of a fashion statement. They look exactly as the original tan ones just with a thicker sole bc it was originally made for construction workers. I got them for &lt;$200 last year  from a specialty shoe store but you might be able to find them online. Personally i recommend timbs but not the normal ones in terms of waterproofing and snow etc",
                                            "score": 2,
                                            "author": "No-Childhood1262",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Do you ever feel like they’re too slippy",
                                                    "score": 1,
                                                    "author": "QueryYourTheory"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I LOVE the black ones! Wish Nike made a boot or something similar to it.",
                                            "score": 1,
                                            "author": "Popular-Ad2918",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or like an all around boot that wasn’t 400 dollars",
                                                    "score": 2,
                                                    "author": "QueryYourTheory"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im from NH and I’d say Timbs are the best",
            "score": 1,
            "author": "moose7860"
        }
    ]
}