{
    "id": "145xzov",
    "score": 395,
    "title": "What did queer people do to y’all?",
    "author": "PinkPixelPanda",
    "date": 1686396969.0,
    "url": "https://www.reddit.com/r/Vent/comments/145xzov",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a gay transgender man. The scrutiny I face just existing is unbearable. I’ve been mocked, surrounded, pushed, harassed, and more just at my school. I live in a small town in the rural midwest of the US. I’ve been told so many hurtful things by my family alone. \n\nI always have these feelings but the reason I’m just blowing up and venting now is because I was just scrolling on tik tok and an ad for an AIDS prevention foundation came up (think it’s the Elton John Foundation but not sure). I went to the comments to show support and got I regret it. A bunch of people commenting things like “Stop grooming our children!” And “Nope.” And just stupid shit like that. The ad had nothing to do with children. Didn’t show anyone like that.\n\nQueer people aren’t trying to fucking groom people idk how people just started think that but it isn’t true. We’re hates just cause we’re queer. I’m tired of being bullied, outcasted, etc. I think every queer person can back me up when I say LEAVE US THE FUCK ALONE!!!\n\nAny striaght allies out there, thank you for everything ya’ll done. It does truly help.",
    "comments": [
        {
            "level": 0,
            "comment": "Locking due to arguments, slap fights and uncivil comments",
            "score": 1,
            "author": "Vent-ModTeam"
        },
        {
            "level": 0,
            "comment": "At the end of the day, a lot of it is about scapegoating.\n\nIt's because life can be scary and all of us regardless of where we are born, our racial identity, our sexual identity, or our gender identity, will consistently face struggles in our lives that oftentimes are very abstract and very difficult to properly mounted defense towards in any kind of meaningful way.\n\nAs a result, there are people that will instead of trying to deal with the actual issues will instead find a more anthropomorphized and tangible target for their fears. Because in their mind if they can defeat the transgender or queer menace then they won't be afraid anymore in the world will be perfect, when the reality is that they'll just move on to the next target of their ignorance and bigotry.\n\nThere's a reason all of the exact same people that were against women Getting the right to vote were also against the civil rights movement and were also against immigration and same sex marriage. It's all the exact same small people that are afraid of their own insignificance in the greater world and as a result they scream and cry and make a fuss because they don't know what to do. They don't want to lose the completely artificial place of power that has been provided to them simply by virtue of being cisgender or heterosexual or a man for that matter.\n\nThe good news is, A lot of this bullshit is starting to fade in younger generations. Yes, there is still ignorance in younger generations, but it is a different type of ignorance that is ironically more accepting of certain groups than past generations.\n\nSo yeah, there may be racists or misogynists in Gen Z, but they may be more welcoming of queer people. Or they may even be openly queer themselves. It's not perfect, kind of a step in the right ish direction in terms of a word that has a greater diversity of opinions?\n\nEDIT: as demonstrated in some of the comments here, there are even transphobic queer people.",
            "score": 105,
            "author": "apollo151"
        },
        {
            "level": 0,
            "comment": "I could never understand this hatred. Never. The hatred and suffocation I feel for just harmlessly being myself is unreasonable. Life is too short. Just live and let live please.",
            "score": 71,
            "author": "huesforme"
        },
        {
            "level": 0,
            "comment": "I am sorry you are going through this. I have often wondered the same thing. I also live in a rural area. I'm not lgbt but I have seen how rural people treat lgbt, black, non religious,  liberals and it is horrible.  I would suggest for your mental health to move to a bigger area and find a better community.  Not just other lgbt people but other allies.",
            "score": 37,
            "author": "ElectionProper8172"
        },
        {
            "level": 0,
            "comment": "Aaaaand you get more transphobia in the comments plus some politically illiterate horseshoe theory nonsense. Stunning.\n\nI'm trans too, OP. Nonbinary specifically (any pronouns fine), and yeah it's exhausting in the UK too. Please take care of yourself x  \n\n\nEdit: if you're looking for solutions, it's only a band aid but it's worth mentioning that queer people cluster for a reason, and you might find some peace looking for others like us in your area.",
            "score": 47,
            "author": "TheEnvenomed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Non binary isnt trans?",
                    "score": -28,
                    "author": "One_Entertainment781",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"I'm trans too&gt;nonbinary specifically\" implies that nonbinary people are a subset of trans people. Not saying that every nonbinary person considers themself trans, to be clear, but I do in my case.  \n\n\nI hope that clears things up.",
                            "score": 31,
                            "author": "TheEnvenomed"
                        },
                        {
                            "level": 2,
                            "comment": "It falls under the shared category of gender expressions that are not cisgender (gender is the same as the biological sex).\n\nTransgender is about TRANSitioning from one gender to another. This may involve surgery or just altering their fashion and how they present themselves in the world.\n\nNon-binary is more about existing in a middle ground where they are able to express themselves however they feel, without necessarily ascribing to traditional gender norms tied to traditional ideals of masculine or feminine.",
                            "score": 9,
                            "author": "apollo151",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sooooo next time dont say trans bc its a slap in the face to people who seriously struggle with body dysphoria. Hope that \"clears things up\". Just say ur queer n move on",
                                    "score": -47,
                                    "author": "One_Entertainment781",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Would you care to elaborate or are you just going to throw out something antagonistic and then pretend like you're the good guy?",
                                            "score": 17,
                                            "author": "apollo151",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The comment was self explanatory, have a good day.",
                                                    "score": -31,
                                                    "author": "One_Entertainment781",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The fact that I asked for you to elaborate to better explain what it is you were trying to communicate demonstrates that it was not self-explanatory.\n\nAnd your response again demonstrates that you're just wanting to throw out antagonistic nonsense rather than any kind of mature dialogue.\n\nAdditionally: I'm pretty sure you're responding to the wrong person.",
                                                            "score": 18,
                                                            "author": "apollo151",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Are you thick my friend? Im saying u cannot consider yourself trans if your \"non binary\" since u have no desire to actually transition or live the life of thw opposite gender, there is no middle ground your either boi or gurl unfortunately. I feel as if its just labels for thw sake of labels. How can one feel something youve never felt? You cannot. I wholeheartedly support trans people but non binary is a huge slap in the face, it take away from the debilitating struggle of body dysphoria and people who wake up in the wrong body everyday. Again i hope this better explains my point so it can get through that skull :)",
                                                                    "score": -14,
                                                                    "author": "One_Entertainment781",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Genius: You are responding to the wrong person. I did not say I was trans or non-binary. \n\nAnd also: your gatekeeping bullshit is wildly unnecessary. Because to be clear, You are setting up pointless divisions that only serve to further weaken the collective queer community trying to defend itself from the bigoted bullshit of the various ignorant people out in the world.\n\nYou are falling into the exact trap that those transphobes are setting for you by turning against potential allies all because of nonsense identity politics.",
                                                                            "score": 23,
                                                                            "author": "apollo151"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't see any reason to believe that. The fact that one subset of Trans people typically experiences more gender dysphoria than the other (which I'm not sure is true, but let's assume your premise is correct) doesn't in any way prohibit us from being Trans.  \n\n\nTrans is a descriptor. It means \"Your gender is different than the one assigned at birth\". Stolen valor arguments miss the point entirely.",
                                            "score": 11,
                                            "author": "TheEnvenomed",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bruh there is no subset. Your either trans or u aint",
                                                    "score": -19,
                                                    "author": "One_Entertainment781"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Republicans have just been programmed to think all gay and trans people are groomers now. The leaders of the conservative movement have said it over and over again, and now it's just an article of faith.\n\nIt's like how they believe Trump actually won the 2020 election. It's just a pillar of their weird cult and they believe it with a lot of conviction, without question.\n\nSorry you have to put up with this. It's really not fair that the entire conservative movement is just a bunch of bullies with no agenda other than to make marginalized people in their own country miserable. Wish more of them would wake up and realize the whole thing is just a hate-based grift.",
            "score": 50,
            "author": "PowermanFriendship",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well put.",
                    "score": 4,
                    "author": "TheEnvenomed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So sorry you've been hurt. There are people who do support you!",
            "score": 9,
            "author": "Ok_Analysis3604"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I totally agree. So much extremism has come from both sides. I resent the gays in my school that give us a bad name by being extreme and saying that straights need to die and all.",
                    "score": 8,
                    "author": "PinkPixelPanda",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes things are wild these days I think most are somewhere in between. The extremes from both sides get all the spot light. Politics are the same way, I hate both sides right now for their own reasons lol.",
                            "score": 2,
                            "author": "ybarracuda71"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree, I also don't care for it being shoved in my face every where I go now. I don't care about who you want to screw or be. Also being labeled a transphobe because I'm not attracted to trans women. Sorry I'm not attracted to penis and even if you chop it off I want the real thing and the feminine features that come with. Thankfully I'm married so I don't really worry about these things too much lol.",
                    "score": 0,
                    "author": "ybarracuda71"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t have a problem with it, but in my experience some LGBTQ+ people have made their sexuality or gender their *entire* personality and it’s all they’ll talk about. I’m not saying all of you are like that, and some of my closest friends are gay or bi but the very select few have ruined it for me. Hell, I was called homophobic for punching a dude at a club because he tried to force himself on me even though I told him several times that I’m straight and wasn’t interested. Only thing that saved me were a bunch of witnesses to the whole thing who backed me up when the security guards and even the cops came so I was allowed to go. That experience alone has given me some sort of PTSD to the point that unless I’ve known you for a long time and trust you, I don’t want anything to do with you because of what’s happened to me.",
            "score": 21,
            "author": "DirtyRanga12"
        },
        {
            "level": 0,
            "comment": "Yeah they are just pos. People will always find a reason to bully. Best is to accept that world is full of stupid people and not giving them any credit, who cares what they think ? It's start to matter when you care, don't care, let them die alone and forgotten. Me I'm neither an ally neither an enemy, I genuinely don't give a f. Everybody does what they want as long as they don't come to eat my bread or hurt my family idc",
            "score": 3,
            "author": "Competitive_Let_1310"
        },
        {
            "level": 0,
            "comment": "I’m all for you being who you want to be as long as your happy and not hurting yourself or others. \n\nMy issue is the erasure of biological women. It’s as if our space and our safety doesn’t matter anymore as long as trans people “feel comfortable”. Meaning womens safety comes second to trans feelings. \n\nI’m not saying all but In my own personal life and friends, there have been instances where someone talked about their sibling getting their ass beat by a trans woman in the bathroom. One of which was a  little 5 foot 14 year old biological girl got her ass beat by a 6 foot trans women and was put into the hospital. Guess who got suspended? The biological girl, even though she was hospitalized and the reasoning was emotional threat to the trans women… \n\nAgain, I’m not saying all trans are like this nor am I saying it’s common but, there is an entitlement running rampant within the community and it’s scary to see how much they can get away with. \n\nI’ve heard more trans people saying how “cis” people should die than cis people saying trans should die. \n\nI keep hearing Obi Wan Kenobi telling Anakin “you’ve become the very thing you seek to destroy” which pertains to the hatred of cis people from trans people and their movement. \n\nAgain, I’m all for trans people living their life how they see fit and having the freedom to do so, but to ignore the normalization of hatred by trans people towards cisnpeople is getting out of hand and ruins what the movement was originally about. \n\nAlso the forced language. Changing definitions of things can lead to a very dark road into the future that ultimately doesn’t benefit anyone and will cause resistance.",
            "score": -23,
            "author": "SwampGoddess95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your story of a grown adult kicking the ass of a child in a bathroom feels like it's missing a lot of key details.\n\nI would be willing to bet that the actual situation falls into one of a couple of categories: the teenager was being an ignorant asshole that created a situation where the trans person then felt they had to defend themselves, which based off of some of the other stuff you are saying seems likely, or the person in question may have been using drugs, which while unfortunate is not an exclusively trans thing. Drugs based violence is a global problem regardless of gender.\n\nBiological women are not going to be erased. That is just stupid to be honest. By virtue of how reproduction works, cisgender women are not going anywhere anytime soon. Unless we as a society, all the sudden develop the technology where we can reproduce without sex, cisgender women are here to stay. Especially since your \"oppressors\" or whatever constitute a fraction of a percentage of the global population.\n\nYou are more likely to be oppressed and eliminated by heterosexual cisgendered men repeatedly trying to deny you basic rights and freedoms than you are to be oppressed by a transgendered person. And that's not just based off feelings, scientifically speaking the numbers say you are most likely to be assaulted, murdered, or just plain attacked by a white straight male then literally ANY other demographic in the world.",
                    "score": 15,
                    "author": "apollo151"
                },
                {
                    "level": 1,
                    "comment": "- The erasure of biological women can't (and won't) happen. Biological women will always exist. Transgender women will always exist. The two will never be mutually exclusive, and you can in fact live together harmoniously. \n\n- Transgender people tend to be sweet. They can also be mean. This is because they are normal human beings, with a range of personalities. They are no more likely to beat your children than the average person. Listing ancedotes of supposed violence means nothing if you can't back it up with statistics. \n\n- No definitions are being changed. Gender and sex have always been different terms in the medical sphere. People who fall outside of the \"norm\" have always been here. See: unisex people. These terms are just coming to light more often as we modernize. The internet spreads information at light-speed. \n\nFor the record, I think your claim that there are more transgender people encouraging cis gender death is bullshit. \n\nWhy? \n\nBecause transgender people are several times more likely to be beaten, molested, murdered, and extorted than cisgender people. I have also never met a transgender person who genuinely believed cisgender people should die, even in my years-long tenure in the community. Grow your perspective. &lt;3",
                    "score": 26,
                    "author": "Severe_Painter_6646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have the right to feel the way you feel and so do I (: have a good day.",
                            "score": -22,
                            "author": "SwampGoddess95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Indeed. Have a good one.",
                                    "score": 3,
                                    "author": "Severe_Painter_6646"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The transgender population in the world is maybe a fraction of a percent.\n\nIt is understandable to have some discomfort or confusion about your place in the world as the world changes around you, But if you think that your gender is being erased just because another seat has been added to the table, Then that is entirely imagined by you. It is not some kind of a conspiracy set up by the transgender mafia to come get the biological women.\n\nIt's you. It's whatever baggage you have causing you to associate transgender people with negative feelings. And that is something that you should potentially examine and try and dissect why it is. You are feeling that way. Because to be clear, It is not the rest of the world's responsibility to hide itself just to make you comfortable, and you, as a fellow queer person should recognize the sheer hypocrisy of trying to force something like that onto other people.",
                    "score": 18,
                    "author": "apollo151"
                },
                {
                    "level": 1,
                    "comment": "A transgender woman is just another type of woman. And so are you. Both can coexist in harmony, don't you think? Nobody is erasing you just by expressing themselves. Nor do I think that's their intention at all. Just like you being gay isn't erasing straight people. \n\nBy the way, \"cis gender\" just means someone who isn't transgender. It isn't meant to be a slur or anything derogatory, just a neutral descriptor word. Even scientists use it.",
                    "score": 12,
                    "author": "Severe_Painter_6646"
                },
                {
                    "level": 1,
                    "comment": "My wife feels the same way. Sports is a good example of this. I feel trans women don't belong in women's sports. As much as they believe they're women, they will always have an unfair biological advantage.",
                    "score": 7,
                    "author": "ybarracuda71",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Michael Phelps has an unfair biological advantage when it comes to swimming, last I checked transphobic people weren't trying to ban him from the sport for his biological advantages.\n\nThe simple science of it is: Yes, certain people will have certain biological advantages over other people in stuff like sports. But that is not 100% tied biological sex. If it were, Then men of any level would consistently outperform females, when that is plainly not true in any capacity.\n\nAnd it is incredibly patronizing that people act like they need to protect the dignity of female athletes, when female athletes in their respective sports are consistently stating that they do not care if they compete against transgender women.\n\nIt is blatantly arbitrary bullshit to try and apply science to this particular thing, when on any other given issue, those same people are completely willing to ignore the science in favor of whatever their belief system tells them to believe.\n\nIf you have an issue with transgender people, That is fine. Be honest and own that. And either educate yourself so you no longer holds your bigoted views, or just be honest with the world and be a front that you don't like a certain demographic of people. Yeah, people might not like you as a result, But that is the consequence of ignorance.",
                            "score": -8,
                            "author": "apollo151",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The very reason women have their own sports categories is because of the blatant, effortless, advantages that geneticaly male persons have over women. Faster, stronger, taller. having a genetic male compete against a genetic female is unfair. Even going through surgeries and using steroid blockers does not diminish the inherited  advantage of the genetic male.",
                                    "score": 16,
                                    "author": "alcohall183"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What a sad statement.",
                    "score": 2,
                    "author": "The_B0FH"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the question that I’ve kept on and ON answering! Ultimately, (and I’m really sad and sorry to say this), I think much of this problem comes from WITHIN the percentage of gay or queer folks. Bear with me.\n\nThere has been research done into people who say they are “very homophobic”, and the evidence shows that many of them are queer themselves. It seems there is a loop-a vicious circle-where some elements of society promote the idea that being gay is the *worst* thing they can be (and in order to maintain this very strange narrative, they have to invent widespread pedophilia). \n\nThis leads to fear and self-hatred amongst those in the community who are gay (or in some way queer), which leads to a kind of “arms race” of hatred, where people turn their darkest fears outward, whilst trying to maintain their “straitness” by insisting on their homophobia.\n\nWe really should automatically look on the most severe homophobes as queer people-albeit very oppressed (by their communities-and by themselves) damaged and closeted. I can’t help but feel that, if we emphasise this ALWAYS when dealing with severe homophobes, we may make SOME progress towards making some of them think again and step back.",
            "score": -12,
            "author": "Plumb789"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 5,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 0,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 0,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 4,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 4,
                                                                    "author": "[deleted]"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 2,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": -1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 2,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 0,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 4,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 3,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 2,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 0,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 2,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 0,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 2,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}