{
    "id": "146g8fh",
    "score": 1,
    "title": "I hate when teachers try to make things \"fun\"",
    "author": "tobiiam",
    "date": 1686444740.0,
    "url": "https://www.reddit.com/r/Vent/comments/146g8fh",
    "media_urls": [],
    "other_urls": [],
    "postText": "First off, I want to preface this by saying I know I'll sound like a privileged ass here, so I want to say: please hear me out. I was very good at school growing up, and then it caught up to me and I was nowhere near my previous skill. These marks I will reference here are NOT BAD MARKS, but this class gave me back my faith in myself!\n\n&amp;#x200B;\n\nOkay, so basically, in English this year, I was doing really well. My first assignment: 93%. My second assignment: 97%, told about early and praised by my teacher, and she asked to keep it. Third assignment: 94%. After those three, we got our midterm marks, and I was at a 94%, which she said was the highest mark in my class. I drank in the praise.\n\nI have gotten really good marks like this before, but recently I've not been doing so hot between untreated ADHD finally hurting me in high school, depression, and just poor learning skills catching up to me. This class made me feel good about myself again. \"Wow, EVERY assignment I got was over 90%, AND I'm the highest student in my class!\" \n\nWe had two more assignments. The fourth hasn't been marked yet, but she gave us back our fifth and final assignment, which I got an 85% on. I was disappointed. I did this assignment in six hours after my last one fell apart literally the night before the due date. Why did it fall apart? Because of the \"fun\" and \"creative\" aspect of it. We had to make it in a video. Do a little skit, show off our topic in an engaging and fun way.\n\nI got my mark back, and the ONLY feedback was on the video! She praised my topic and my write up explanation of it. My choice of literary elements was good, my presentation skills were strong and confident. It was all great! Except she said that my video was a little confusing. Yeah, it was. I KNOW it was. It was a terrible video. I do not have artistic skills whatsoever, and I knew that going in, but I tried my best, and I've fallen because of that.\n\nThe worst part about this is potentially the pettiest thing I've been upset about. With this added mark, my final mark has fallen for to a 92%, which is still good. I am happy to get above a 90% as my final course mark. However, I have a friend who was at a 93% in midterms, which was one percent behind me. She is good at everything. Literally everything. Anything that I want to be good at, she is so much better at, EXCEPT for English. This includes art stuff, which means I am almost guarantee that her video was great (I was away for her presentation, so I haven't seen it) so her mark probably went up.\n\nThat means that the one thing that I am better at, SHE is now most likely better at — potentially even the best in the class, if I'm out of the way now — which means I've got nothing on her. \n\nI did the math. I need to get a 103% on that one unmarked assignment in order to get back there. I literally cannot do that. If I get 100% on that assignment — which I know I won't do. I'm sure it'll be pretty good as I think I did well on that, but definitely not perfect — the highest mark I can get is a 93%, which brings me to where she was. I can at best be equal with her, which is unlikely because I'm sure she's going to go up.\n\nI love her, man, but being her friend while I'm me is painful.",
    "comments": []
}