{
    "id": "146hq1c",
    "score": 1,
    "title": "Just read an old journal entry, old me had valid ideas....",
    "author": "Guilty_Apple8297",
    "date": 1686449183.0,
    "url": "https://www.reddit.com/r/Vent/comments/146hq1c",
    "media_urls": [],
    "other_urls": [],
    "postText": " just read an old journal entry about how I was seriously considering going/being mute. Honestly at the time I Learned a lot about mutism... and it would've been selective mustism had I decided to do what I wrote about. \nI honestly get picked up into so much drama, over the dumbest and pettiest things, that I figured if I never talked at work I couldn't possibly be picked up/dragged through drama. After re-reading this entry I realize I was so blinded by anger and hurt that at the time i didnt realize that my 3rd situation/point for possibly being selectively mute wouldn't have made a difference anyway. Because I got pulled into that whole situation without saying a word.... but maybe if I never talk around those people then maybe they'd be like \"there's no way it could've been her (me)\" and not belive the people spreading rumors.... it makes me think again.",
    "comments": [
        {
            "level": 0,
            "comment": "Selective mutism isn’t a choice… it’s an anxiety disorder. People with it can feel physically unable to speak in those specific situations because of the freeze response. So like, it wouldn’t have been SM had you chosen not to talk.",
            "score": 1,
            "author": "SilentAssassin_92",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for explaining that. That's kind of what was happening; it wasn't like \"I'm just not going to talk at work today\" I was so fearful and frustrated it was more like being driven into a fear of talking, which is how I understood Selective mutism.",
                    "score": 1,
                    "author": "Guilty_Apple8297"
                }
            ]
        }
    ]
}