{
    "id": "146mz84",
    "score": 0,
    "title": "Is there something wrong with me?",
    "author": "Brief-Dragonfly-646",
    "date": 1686466656.0,
    "url": "https://www.reddit.com/r/Vent/comments/146mz84",
    "media_urls": [],
    "other_urls": [],
    "postText": "I personally believe I am better than everyone why? Just because \nIt’s probably a god complex\n\nI have mood changes like SUPER HYPER AND THEN no energy\n\nI have little to no empathy\n\nI lie a lot and deceive others and manipulate others \n\nI can’t love anyone like I literally can’t not even my mother \n\nNow I have came up with my own theory why and my best one is my dad used to hit me a lot and made me live in a constant state of fear and he used to hit me for crying so yeah",
    "comments": [
        {
            "level": 0,
            "comment": "Dude, go to a psychiatrist. Not reddit. Stop reading what these guys are saying. Most of these guys post shit on Reddit asking: Is this haircut good for me?",
            "score": 4,
            "author": "Prms_7"
        },
        {
            "level": 0,
            "comment": "Well, physical abuse is a problem that should not be overlooked.\n\nOf course, if you have a problem with lying and manipulating, is it possible you have been lying to and manipulating yourself?",
            "score": 3,
            "author": "Terrible-Fig-1446",
            "replies": [
                {
                    "level": 1,
                    "comment": "What you mean?",
                    "score": 0,
                    "author": "Brief-Dragonfly-646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perhaps you have been telling yourself things that are untrue as a form of self preservation. Manipulating the facts inside of your mind to make them more manageable for you.\n\nI am not saying that is what you are doing, just that you consider the possibility.",
                            "score": 2,
                            "author": "Terrible-Fig-1446",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well I’m not lying or manipulating myself",
                                    "score": -1,
                                    "author": "Brief-Dragonfly-646",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What concerns me is how dismissively you mentioned your father hitting you and making you live in fear. Like \"oh yeah, he hit me, I was scared, no big deal\".\n\nSo, I ask again, are you sure you are being honest with yourself?",
                                            "score": 3,
                                            "author": "Terrible-Fig-1446",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I’m pretty sure..",
                                                    "score": 1,
                                                    "author": "Brief-Dragonfly-646",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Then I am sorry to hear you have these problems. It sounds like you need some serious help. I hope you are able to find it.",
                                                            "score": 3,
                                                            "author": "Terrible-Fig-1446",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you",
                                                                    "score": 2,
                                                                    "author": "Brief-Dragonfly-646"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like something that should probably be brought up to a psychiatrist. I mean I could list all the things that I thought of reading this but I’m literally just some dude and I don’t know you. \n\nI mean technically as long as ur not a danger to urself or others you can just go on as is, but you seem to realize that this isn’t normal. If you’re bothered or interested or just curious about it I’d suggest seeing someone who is actually trained to understand this kind of stuff.",
            "score": 2,
            "author": "MellifluousSussura",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh I did and she was really useful basically told me she doesn’t believe me so yeah great and before you hate on her I should mention I asked her if she believed me or not but still if I was king I would have her hung",
                    "score": 1,
                    "author": "Brief-Dragonfly-646",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like a really shitty psychiatrist. That sucks, but it happens sometimes. I wouldn’t go back to her.\n\nEither way I can def say that these things aren’t normal for most people. I don’t think most anything is inherently “wrong” except in how you act on them. That is to say: you don’t *have* to have things like empathy or love for certain people so long as you still treat them decently.\n\nThe lying and manipulating is maybe not as good, but I don’t live your life, you know? Not my business. \n\nIf ur wanting like, a diagnosis or whatever you should probably try a different dr. You can also just to research on ur own and kinda see what fits. I mean there’s like a handful of things I thought about reading your post but I’m not a dr or anything so I don’t want to throw random guesses/accusations out.\n\nAt the end of the day your brain is your business, your actions I think are what matter\n\n(Sorry I get rambly when I get tired and it is late! I hope this all makes sense)",
                            "score": 3,
                            "author": "MellifluousSussura",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks",
                                    "score": 1,
                                    "author": "Brief-Dragonfly-646"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}