{
    "id": "146nx3r",
    "score": 4,
    "title": "I hate myself so much",
    "author": "yesaroobuckaroo",
    "date": 1686470088.0,
    "url": "https://www.reddit.com/r/Vent/comments/146nx3r",
    "media_urls": [],
    "other_urls": [],
    "postText": "I wish I was likeable, interesting. But no, I'm one of the most unlikeable and boring people on earth.\n\ni wish people wanted to be friends with me :(\nI wish people didn't just ghost and ignore me, even my own bestfriend unadded me and is ignoring me on everything :/ \n\ni hate myself so much and i just wish people liked me, enjoyed having me around.",
    "comments": [
        {
            "level": 0,
            "comment": "This happened to me a lot, everyone loves my dad, which he's awesome, but I really don't know what happened with me. I think some people are just luckier than others when it comes to finding their people. Your friend sounds like they're taking the easy way out instead of being up front, definitely not a real friend if they can't communicate their problems to you. I definitely lost a lot of friends similarly and I wanted to end things. I'm still here though, the world still sucks and so do people but the best thing I learned was that I would rather be happy alone and not have to rely on others to do what makes me happy when I can do it on my own. It's awkward at first but start doing stuff on your own, I find adventures through insta pages that post events in my area. I've honestly made more friends doing things on my own for myself and have more peace it my life because of it. One of my only friends I still talk to from high school, I met her because I left the table when I heard my friends were talking about me behind my back calling me \"princess\" and whatnot bc I did pageants and modeling which made me miss school a lot, so I asked them about it face to face and when they lied I found an empty table and sat there for a month until she transferred to my school and didn't know where to sit so I invited her to my table. The right people will not find you boring if you put yourself out there and you'll find the right people by doing things for yourself like protecting your peace. Take care of yourself and give yourself some grace/leeway, no one is perfect that is why non of us are exactly the same otherwise it would be some weir society like the one in A Wrinkle in Time.",
            "score": 1,
            "author": "Dazzling-Afternoon76"
        }
    ]
}