{
    "id": "146q41t",
    "score": 1,
    "title": "Boy Best Friend",
    "author": "Throwaway737775",
    "date": 1686478003.0,
    "url": "https://www.reddit.com/r/Vent/comments/146q41t",
    "media_urls": [],
    "other_urls": [],
    "postText": "I buried the feelings so deep I try to be the best friend that she sees me as and then we go out drinking dancing and it feels like we're more than what we are, the looks we give eachother the dancing and the conversations. The trust she puts in me to keep her safe. \n\nWe were out and she brought her situationship along which I was fine with but then the drunker we all got tho more I just started to resent him watching his moves and his actions. He was making her uncomfortable and getting way to touchy and she looks at me and i just can't shake it, it wasn't just help it felt like more but I don't know. Either way I get her away from him and she thanks me guides me to our favourite chill spot in this club and we just talk have a drink and she goes to fix her make up which she doesn't know that I know means cry or throw up in the meantime her situationship has been thrown out of the club and I'm trying my hardest not to say anything not to do anything and I didn't I want her to be happy and idk what they have she hid from me for the most part. So she comes back I explain he's been kicked out so we leave and I said I was planning to split and head home mostly cause I couldn't take it anymore seeing them and him he just makes my blood boil and I said to my friend if she needs a place to go or a hotel I've got you but she said she was fine going back to his so that's that. She introduces me again as her best friend and the guy really didn't take any notice he was too drunk and staring at another girl to care. \n\nWe hugged and that's what got me she held onto me it was a proper hug and she said thank you and I don't know what for but she thanked me and we hugged a couple more times before I left and I stayed up worried till about 4am when she messaged me she got home safe but situationship decided to lie in the road and went a bit crazy. I'm worried for her and like personal feelings aside I'm worried. I hate to be that I am so much better than this new guy but I am. I know what she's been through and I just appreciate what no one else does I want her not her body not the sex just her and everytime we're drunk it feels like she wants me too but idek maybe it's drunken delusion. I just worry about her cause she doesn't need more hurt and her heart is so good and pure. I just don't really know and I have no one to talk to about it either.",
    "comments": []
}