{
    "id": "146tqaw",
    "score": 1,
    "title": "Racist Dad",
    "author": "Limp-Rate8278",
    "date": 1686489440.0,
    "url": "https://www.reddit.com/r/Vent/comments/146tqaw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m tired of my dad constantly being such a life sucker. By that I mean someone that just drains all the damn happiness and light out of you. He doesn’t like that you stood up for yourself and telling him he did something wrong? Well, he turns off all my Wi-Fi and doesn’t matter if I have homework due. He thinks he’s being funny with the racist remarks, but it’s just so wrong. My mom does nothing about it. She’s fine with it. I hate that about them. \n\nFor some context, my family and I are Asians. We are Filipino. I typically talk about how my day goes. I’d tell them about new friends I made being I’m a very lonely person and used to have no friends until recently. My family makes fun of me a lot by saying I’m too sensitive and need to stop taking things so seriously. Even my brother too.\n\nToday one of my friends have tested positive for Covid and I was near them. Thankfully I am vaccinated so if anything were to happen, it won’t be as bad as I first had Covid since I was near her a few days ago. \n\nI have one Chinese friend (A), 1 white friend (B), and 1 Korean friend (C)Their ethnicity does not matter, but for the contest of this vent it does. When I bring up about new friends I make my dad always asks what their ethnicity is. \n\nAnyways, this is how my conversation went\nMe: One of my friends tested positive\nMom: Oh no, are they vaccinated?\nMe: Yes, but I think because she’s always working with people in a close space\nDad: Is it the Chinese one?\nMe: Why do you think it’s A?\nDad: I’m just asking. Ching ching china \nMe: Dad you can’t be saying that. It’s racist.\nDad: Ching Chong china. So was it her?\nMe: No! WTH dad. What’s wrong with you? It was B! \nDad: Is he Chinese? \nMe: No. Just because A is Chinese and originally from Wuhan doesn’t mean she’s the one getting Covid. She already went through a lot because of it.\nDad: Ching ching china *laughs*\n\nI wish I could say so much more to my dad. The only time I really stuck up for myself was when I was younger and called him stupid for another racist remark. He ended up banning all internet and Wi-Fi use for a month and I ended up almost failing since a lot of our homework is online. \n\nI have a vivid memory of when a classmate said Ching Ching Chong to my teacher who was part Chinese and spoke Chinese. How my teacher said it hurts her as it reminded her of when she was little with the racism and bullying for being Asian, specifically being Chinese. I knew it was bad, but didn’t know how bad. \n\nI wish my mom was a better mom than being a bystander and allowing it. I wish my dad wasn’t fucking stupid. \n\nI’ve never told anyone about my parents being racist as it brings so much shame and disappointment that it’s seemed “acceptable” in my household. But I guess this is my first on a Reddit community. I think I’m gonna tell my friend too about it. But maybe not as she might no longer want to speak with me.",
    "comments": []
}