{
    "id": "146uwpw",
    "score": 1,
    "title": "My doctor just quit on me",
    "author": "Kitten0006",
    "date": 1686492618.0,
    "url": "https://www.reddit.com/r/Vent/comments/146uwpw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I threatened malpractice if she wouldn’t prescribe my Atavan for my anxiety/sleep and she basically quit on me. She told me to go elsewhere for services. I just want someone able to prescribe my stupid medication. I need some serious prayer right now. I’m so sick of this. I take three fucking meds that work well together. Latuda. Atavan.  Dyanavel XR. It’s like night and day. I have a fucking personality disorder. I just can’t fucking win. I just started a new job and these doctors in this area want to make my life a breathing hell. Ever since I met my spouse I’ve had a difficult time getting access to my medication. I cannot take this anymore. My mental health is finally doing actually good and she does this to me? It’s unfair. She should realize my friend just passed away and let it the fuck go. I don’t even know what malpractice is I just want the lady to give me a break and perscribe my fucking medication. I didn’t know the dates because I didn’t bother going to the pharmacy. I heard I couldn’t get it refilled and that was basically it for me. I’m sick of this fucking shit. When am I going to catch a break? I have a stable therapist finally at least. Nobody can take that one away from me. I scheduled a meeting with a provider through my health insurance and I’m praying they just be a nice dude and give me my meds I need. She wouldn’t even write my diagnosis correctly after I went to three different hospitals. Three. They put borderline. Like fuck you lady. I clearly anyone can see this have BPD. It dosent take a rocket scientist. I can’t not take medication because then I’m insane with delusions and my BPD is that much worse. I honestly blame my spouse for causing all these fucking problems in my life to begin with. I wish I could just make enough money to leave! I had these issues before I met him but not this bad! Doctors have always eventually quit on me. PCPS. (Not my current thankfully). It’s not even like me to threaten malpractice I don’t even know what the fuck that is and I didn’t do it for real. I don’t know why she’s so terrified of being accused of it in the first place. If she did nothing wrong she has nothing to be afraid of. She completely abandoned me in a severe time of need and I don’t know what to do. Not to mention my friend just passed away and I need work accommodations done Immediately. So now I’m completely left up shits creek without a paddle. Without a doctor. Abandoned. Without medication. Now it is malpractice. Im so screwed. She’s not even trying to find someone else for me. I am thinking maybe I should report her for it after I leave her practice because she abandoned me like this and caused me such damages! My friend just passed and she abandons me when I need a psychiatrist? Are you fucking kidding me? And when I just started new meds and have all these insurance issues and stresses the bitch leaves. I’m so pissed off!",
    "comments": []
}