{
    "id": "147qvwf",
    "score": 3,
    "title": "I broke down at work last week.",
    "author": "Pinky_92",
    "date": 1686586618.0,
    "url": "https://www.reddit.com/r/Vent/comments/147qvwf",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a doctor, early in my career and I have to finish a scientific paper before I can get my degree and go on to specialize. The deadline is approaching for the paper and I know it has to happen soon but I haven't had the time or energy. Meanwhile, I work at a clinic where my schedule and workload is higher than I can manage. I feel like a worthless doctor when my patients don't get the follow-up they need because I don't have the time, energy or mental capacity for documentation. I've even been written up for it.\n\nI'm also moving in with my boyfriend right now and there are dozens of things to figure out, my parents were here this weekend to help out so I had to be there. My parents are also selling our old family estate, and I haven't been able to grieve that properly.\n\nLast week was crazy at work, I even got yelled at for something that wasn't my fault. I didn't know what to do. I tried asking others for help with the extra things but they basically said \"you'll manage this\". On friday, one of the nurses grabbed me and asked how I was feeling, so we talked and I just broke down crying because I was so overwhelmed. I got help with one of the more pressing things. Then I went home, knowing how much I had to get done this week instead.\n\nI actually have very little memories of last week and this weekend. I know that we were supposed to have dinner with my sister on saturday but I told my mom to drop me off at home instead, then I went to bed and slept for hours. I know that I called my other sister (who's burned out) , but don't really remember what we said. I have a lot of notes at my desk from calls I've gotten, but I don't really remember.\n\nI'm supposed to be on the ward this week, and I texted my senior colleague yesterday to see if I could get a break today but didn't get an answer. So I went to work this morning anyway, we had our usual morning meeting and then I told my temporary boss that this isn't working. He had seen it on me as well, so they fixed the schedule for today and said that we'll talk again tomorrow.\n\nI don't sleep well. I get hungry but have no appetite. I get restless sitting down so I took around 4-5 walks today, even though I should be working. My resting pulse is around 130-140. I can read the same sentence 10 times but I can't comprehend it. My hands shake so much that I don't recognize my own hand writing. Everything scares me, like ordering an x-ray, putting the TV up for sale or calling the vet about my cats medicine.\n\nI feel ashamed for how I feel, and I worry about how this will affect my future career. I worry about how my boyfriend and my family sees me. I had a colleague prescribe a mild sedative, and I have a doctors appointment scheduled on thursday.",
    "comments": []
}