{
    "id": "147q4rp",
    "score": 2,
    "title": "Unbearable heatwave my rented house isn't designed for. My bedroom is 30+°c and I'm barely surviving.",
    "author": "taehyungtoofs",
    "date": 1686584646.0,
    "url": "https://www.reddit.com/r/Vent/comments/147q4rp",
    "media_urls": [],
    "other_urls": [],
    "postText": "We've had temperatures pushing 30°c for three days and my bedroom is suffocating. It accumulates heat and is way hotter than outside, probably 35°c in here.\n\nLast year we had a heatwave hitting 40 for the first time but thankfully I lived in a cooler home. I genuinely think a 40°c heatwave in this house would decease me, because that means my heat-trapping bedroom is 45°c.\n\nI can't afford fans. They use up the electricity.\n\nI don't have icepacks and we've no space in the freezer for them.\n\nCold water on my 4rms only soothes me for 10 minutes.\n\nI use the cool setting on my hair dryer but it doesn't make movement any easier because the room is baking.\n\nMy bedroom window is always covered, so direct sunlight isn't an issue.\n\nI tried laying on the kitchen floor out of desperation but it's painfully hard and I've run out of clean sheets to lay down on.\n\nI'm a spoonie. My b0dy can't handle heat. I barely sweat and I have chronically low bl00d pressure, so heat lowers it dangerously. It drains all the energy out of me so that I can barely move without feeling like I'm going to p4ss out. My chore capacity has dropped to zero. Dirty dishes piling up.\n\nMy bedroom is the hottest place in the house but as a spoonie I need to be laid on my bed a lot. Sitting downstairs isn't feasible. My housemate uses the lounge.\n\nI sleep in the suffocating heat and have vivid dreams. I wake up exhausted, unable to recharge because my b0dy is fighting the heat as I sleep. I haven't used bedsheets in days because they're suffocating. I usually need sheets for pressure but the heat is unbearable otherwise.\n\nI can't think. I can't focus on anything. I am constantly confused and distracted by the sensory experience. It's making my mental disabilities worse.\n\nAnd worst of all, there's no end in sight. We have another week of heat that is barely any better. The house never has a chance to cool down. We have long days, daylight from 4am to 9:30pm.\n\nThree days into this heatwave and I'm already beginning to feel ins4ne. It's only June. I fear the height of summer and future years, when climate change is even worse.",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;I can't afford fans. They use up the electricity.\n\nAnd then\n\n&gt;I use the cool setting on my hair dryer but it doesn't make movement any easier because the room is baking.\n\nWith in mind - \n\n&gt;I don't have icepacks and **we've no space in the freezer for them**.\n\nSo take the eggos out of the freezer and freeze some water bro. Or better yet turn your freezer down to the lowest setting saving a metric fuck ton on your electric and turn a fan on. \n\nKeeping in mind that A simple box fan uses about 52 KWH per month for 24 hour use on high and the average cost of energy is about 23 Cents per KWH (($11.96 per month for 24 hour use on high), ***if your freezer is too full to fit an ice pack you can spare the ten bucks***. Ironically, it costs about as much as running an ice maker annually. (cheaper in UK btw)\n\n&gt;I'm a spoonie. My b0dy can't handle heat. I barely sweat and I have chronically low bl00d pressure, so heat lowers it dangerously. It drains all the energy out of me so that I can barely move without feeling like I'm going to p4ss out. My chore capacity has dropped to zero. Dirty dishes piling up.\r  \n\r  \nMy bedroom is the hottest place in the house but as a spoonie I need to be laid on my bed a lot. Sitting downstairs isn't feasible. My housemate uses the lounge.\n\nYour housemate *using the lounge* does not present a barrier forcing you to *death* in the room upstairs. \n\n&gt;\r  \nI sleep in the suffocating heat and have vivid dreams. I wake up exhausted, unable to recharge because my b0dy is fighting the heat as I sleep. I haven't used bedsheets in days because they're suffocating. I usually need sheets for pressure but the heat is unbearable otherwise.\n\nHave someone move your bed downstairs. Or just the mattress. To the basement, where its nice and cool and not as close to the sun as possible while still being inside. Like damn. By all appearances you are *actively making this harder on yourself than it has any right to be*. \n\nYou can make this a lot easier on yourself.",
            "score": 1,
            "author": "ComradeBoxer29"
        }
    ]
}