{
    "id": "147vz2p",
    "score": 1,
    "title": "I need to put this somewhere or i'll go insane",
    "author": "devynrob567",
    "date": 1686599646.0,
    "url": "https://www.reddit.com/r/Vent/comments/147vz2p",
    "media_urls": [],
    "other_urls": [],
    "postText": "Me (f22) and this girl (f21) have been coworkers for the last 6 months. At first, we hit it off, texting at night and having a fun dynamic at work. I opened up to them about my mom passing recently because I had just moved, and I hadn't told anyone at work yet. I felt like I could trust this person. Then one day at work, they made a \"joke\". I was talking with them about my reluctance to go on a double date, and they had the idea of telling these people that my mom died as an excuse not to go. They didn't remember what I had shared with them, so I just stared blankly at them for a beat because I was mortified and in shock by what just happened. This was said in front of my other coworkers, and I just felt awful. As soon as it hit them, they erupted into apologies, but it didn't take away the damage that was done. Death isn't a joke to me, but to them, it was. I decided to distance myself from them after that interaction. It was awkward working together again at first, but as time went on, the tension dissipated. Today was a different story, however. They used a slur in reference to a coworker and I. This slur made me and my coworker very uncomfortable. Me being nice, I texted them letting them know how I felt before involving management. They apologized at first, but then doubled down on it. I texted my manager about a meeting between all of us to settle it, but they'll be gone until next Wednesday. A part of me wishes I never said anything in the first place because I hate drama, especially at work. I work with them the rest of the week, and I am fighting not calling out. I wish we could have come to an understanding. I'm just kinda at a loss rn. I would only use that word with friends and family, not coworkers on in the workplace. A customer could have heard.",
    "comments": []
}