{
    "id": "147vtg3",
    "score": 1,
    "title": "My mind is trapped in my body and I don't know what to do.",
    "author": "Z3ta--",
    "date": 1686599251.0,
    "url": "https://www.reddit.com/r/Vent/comments/147vtg3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Today I was on the train with my friends, they were talking and I started zoning out, which I do fairly often so I didn't think anything of it.\n\nBut after a while I realised I wasn't snapping out of it.\nI wanted to move and join the conversation, but I couldn't to anything but stare at the stupid white scratch on the train seat that I had been looking at when I was zoning out.\n\nI've had this experience a few times before of not being able to move how i want, look away or talk.\nI just fixate on one spot and breathe.\n\nI wanted to talk and I tried to move, but it just feels like there's a thin barrier that won't allow me to.\nIt doesn't feel heavy, it feels almost too lightweight, it should be easy to move but no matter how hard I try the most I get is some slight movement in my hands.\n\nMy mind just rambles, circling through thousands of thoughts each second, and I feel this dread and anxiety. \nI want to cry, but I can't.\nI keep thinking I'm just faking it for attention, but I can't move, I can't talk, I can't even look where I want to.\n\nMy friends tried to nudge me, but my body didn't react, even though I usually flinch whenever someone touches me.\nThey tried several times but my body was still not doing anything.\n\nI could hear them mixed in with my thoughts, and everything felt so weird.\n\nMy body was going on autopilot, walking when i was supposed to get off the train, walking to the bus, sitting down.\nIt felt almost robotic.\nThe only amount of control I had was that I sometimes was able to open and close the cap of my water bottle when I wanted. \nBut even that came in waves.\n\nThis continued even after I got home. \nI went to my mom's room and got in her bed and just laid there staring at the ceiling feeling more numb and powerless than I've ever felt before.\nAfter a while I just started bawling, I called my mom and she came home and I had a panic attack that lasted almost 2 hours. \n\nBest way I can describe how my body felt is catatonic.\n\nAll and all this lasted for about 5 hours. (3h of complete lack of control and 2h of panic attacks and uncontrollable sobbing.)\n\nNow I'm just tired.\nMy eyes sting and my face is still slightly tingling.\nI have no idea why this happens to me or what it is.\nI'm going to talk to my therapist about it on our session in a few weeks.\n\nUnsure if I should book an emergency appointment or not.\n\nAlso, I accidentally buttdialed 911 today. ;-;",
    "comments": []
}