{
    "id": "1480n1w",
    "score": 0,
    "title": "Crazy babysitter trying to rip my fursuit",
    "author": "DylanVRSucksAtPavlov",
    "date": 1686612097.0,
    "url": "https://www.reddit.com/r/Vent/comments/1480n1w",
    "media_urls": [],
    "other_urls": [],
    "postText": "This story begins, well, yesterday. Basically, big halal mode characters\n\nMe: 14, got weird ADHD and is a stoner\nLB: Little brother, is 9\nLS: little sister, 3 years old\nOB: moved out older brother ( not involved but I miss him )\nHB: Hellish babysitter\nM: mother\nF: father figure\nPDG: Pizza Delivery Guy\n\n\"LES DO IT NOW IM GETTING BORED\"\n\nSo my dad, works mostly on our holiday home in France, and my mom works night shifts, and your boy is a fursuit maker plus is making his own fursuit, ANYWAY, so my mom hires this babysitter, FROM HELL. And when my mom is there, she acted all noice, and when my mom left, she just said, \"Ok, go to your rooms and do whatever.\" I thought, oh this babysitter is sweet! Haha, [dead name] you idiot. So I went to work on my fursuit and some commissions. So I crack open a Rockstar, and got to work. An hour later, she came to check on us. I heard screaming and crashing in my younger siblings rooms, so it really ticked my anxiety off. When I heard my door open, I'm not fucking joking, I couldn't breathe. The suit I'm making for me is a full suit so I have a ton of clutter, I couldn't even put my vr headset anywhere and my pc keyboard was covered in sweat and blood, and when the babysitter saw it, my god she flipped, she fucking grabbed me, threw me and then ripped my fursuit and also threw it against the wall, i never mention she had kids, and let her small kids run around my room, and I spotted my siblings toys in their hands, once the babysitter left, I swear, out of pure anxiety, anger issues and just fear, I grabbed the little fucking runts by the scruff of the neck, and I fucking threw the little brats in the bathtub, and just left, the damage to the suit wasn't major, but she ripped a part where the glue hadn't dried so I just had to re glue it. Then she said\nHB: I'm ordering a pizza, but you guys aren't getting anything! \nMe: that's ok, I've got my own food, yeah sure I have a fully stocked mini fridge but I only get drinks out of it, i barely go down for meal times, and I don't really eat, but I knew my siblings would have been hungry, so I decided to give them the food from my mini fridge, it wasn't healthy and they had nothing to drink except energy drink, but it was all we could eat, but I didn't eat anything. I always want to put my siblings first, and since I'm basically the only older one in the house, I'm like a parent, a sheild to them, sorry, I just really lovse my younger siblings, but the pizza guy came, and I heard them come upstairs, and the babysitter said: \" cmon I got c0nd0ms.\"\nThe guy came into my room instead and whispered: PDG: you ok? Me: yeah I'm ok, I guess,\n\n\nPT. 2 soon",
    "comments": [
        {
            "level": 0,
            "comment": "P. T. 2\n\nOk now I thought nothing of it, because they're only human after all. But then I heard some, devious noises from the bathroom, very devious. I thought nothing of it and made a picture that I thought was funny, it was lyrics to levitating by Dua Lipa it was \"get ketchup, put some cheese on it\", with cheese, well, on ketchup. But then I thought about playing some rec room, in the body, and fursuit paws because I finished those first, just the head to finish, I played paintball, hung out in a private rec center, committed war crimes in jumbotron. Then I heard a bang. Like a door. CUE THE SUSPENSEFUL MUSIC! I carefully approach the door that had been slammed shut. My sister's room. I kicked that door open and btw I had my Airsoft gun in my hands so it felt like call of duty. I stopped. The babysitter was beating my sister. This. Means. Death. She chose death. *Click click* shit i forgot bullets oh well I'm dead.",
            "score": 1,
            "author": "DylanVRSucksAtPavlov"
        }
    ]
}