{
    "id": "1485tl9",
    "score": 3,
    "title": "I’m dreading Wednesday",
    "author": "Ok-Consideration2676",
    "date": 1686628574.0,
    "url": "https://www.reddit.com/r/Vent/comments/1485tl9",
    "media_urls": [],
    "other_urls": [],
    "postText": "CW FOR PET LOSS\n\nOur (family dog) Snoopy is 15 years old, well over 100 in dog years. We got him as a rescue when he was about 2 or 3 years old, and he’s a good dog. He had a stroke a few years ago, and despite that he still was kickin’! In the last year, even the last few months, his age has caught up to him; he can hardly stand up without help, he doesn’t eat, he is incredibly skinny, and he would rather lay down than anything else. We took him to the vet this morning for a Quality of Life check, and, as you all assumed, the vet advised it would be best to put him down. We could try medication for his arthritis and pain, but it would only prolong it. So… on Wednesday… our beloved old man will be laid to rest and join his brother in dog-heaven. I’m very upset about his passing, as anyone would be of course, but I know it’s what’s best for him. He had a good life, and was happy for all of it. I love him so…",
    "comments": [
        {
            "level": 0,
            "comment": "Im so sorry thats so hard. Thankfully he’s old and has been loved",
            "score": 2,
            "author": "Earthdaybaby422",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, like I said it’s been quite a long time coming… doesn’t make it easier yk",
                    "score": 1,
                    "author": "Ok-Consideration2676",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. Hes been your buddy for a long time. My parents never let us keep a pet til they were old enough to pass on. My dog now is 6.5. Hes my tether and reason i stay alive. It’s gonna be hard if i outlive him for sure",
                            "score": 2,
                            "author": "Earthdaybaby422"
                        }
                    ]
                }
            ]
        }
    ]
}