{
    "id": "1486884",
    "score": 0,
    "title": "Teenage boy vents about a girl",
    "author": "Big-Abbreviations298",
    "date": 1686629911.0,
    "url": "https://www.reddit.com/r/Vent/comments/1486884",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve written a whole post before that just randomly got deleted so sorry if this feels rushed. Anyways, there’s a girl who I kinda have a crush on. She’s best friends with one of my good female friends and is the girl everyone in the school wants. She moved out of the us mid last (school) year but before that we only messaged a few times over Instagram. She is aware I am interested in her as our mutual friend seems to be trying to wing man me and quite frankly is bad with secrets. I wanted to think I wasn’t really into this girl but my friend would send me videos of her saying hi to me (to tease me) and I find myself watching them over and over before I click off. My friend FaceTimed me as the girl is back in the US momentarily and we had a very awkward conversation (if you can even call it that). In the end she invited to to a party next Monday, a pool party. This is conflicting as Idk if I wanna start something with another girl, not after last time. I also think I have no chance, but if I had no chance why would my friend try to wing man me? Idk what to think. Along with that, I am pretty skinny but have an unfortunate case of man boobs, so being shirtless infront of my crush and a bunch of random people from my school (mostly girls) does not seem like a good time. I was told one of my best friends was invited so I do have someone to hang with if all goes poorly but I’m not sure what to do. I only have about half a week to think on this so I’m very stressed. I am going to message my friend who called me for help, half hoping the girl is still over (they were having a sleepover) so she can also see the messages. I’m not sure what this will accomplish but it can’t hurt. Anyways I could write a Harvard acceptance letter about this but it’s late and I’m very overwhelmed right now, feel free to validate or tear me down in the replies, I’m not picky.",
    "comments": [
        {
            "level": 0,
            "comment": "Just learned she plans to move out of the US permanently and I don’t think I can get something going within the next month that would last over continents so that sucks. Prolly still gonna go to the party tho, why not",
            "score": 0,
            "author": "Big-Abbreviations298"
        }
    ]
}