{
    "id": "1489e2z",
    "score": 2,
    "title": "I miss my friends",
    "author": "Icy_Flamingo3970",
    "date": 1686641414.0,
    "url": "https://www.reddit.com/r/Vent/comments/1489e2z",
    "media_urls": [],
    "other_urls": [],
    "postText": "All my best friends that I’ve made in my life are gone. They’ve all betrayed me and I’ve been telling myself it’s for my own good I left them but I just listen to a song that reminded me of them and I can’t take it anymore. Summer’s here and all I do is mindlessly play games all day and I miss watching movies with them and playing games with them. I miss talking about stupid shit about anything and making up the hilarious make believe scenarios. I keep trying to make the best of my life now but it’s hard to ignore the fact my social life is totally fucked now. It’s just the fact I could be having so much more fun right now but I’m not because I don’t have friends anymore. I also keep comparing last summer to this summer and it’s not really helping either.\n\nWhenever I think of them I tell myself to get mad and to not get mopey and sad about them because if I do they’ll get their way with hurting me and I’m stupid for getting hurt by them. I know I never think of the good things that happened between us because I’ll miss them and that’s stupid because they hurt me, and why would you miss someone that hurt you. But really thinking about life right now I really fucking miss them. But at the same time it feels like every memory I made with them is lies and I just hate everything. Well, not everything, but fuck it is miserable right now. I just wished they never lied to me and betrayed me. I wish they were who I thought they were.\n\nJust wanted to get my thoughts out since I literally have no one to talk to. And sorry if my grammar’s shit, its 2am right now and I’m tired.",
    "comments": [
        {
            "level": 0,
            "comment": "I am no longer talking to my best friend we been friends since we was kids I love and miss her but she was never there for me when I needed her but was always available for men and it hurt me to the point I cut her off I wanted to end my life and she wouldn’t even come talk to me but went to sleep with some dude but I get wanting affection but I needed and she didn’t show up yes I’m lonely but I’d rather be lonely than deal with all the stuff she does to hurt me",
            "score": 2,
            "author": "Lovelessjay1234",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had some friends like that too. They only talk to me when something happens between them and their partners. It was draining supporting them and knowing they’re only talking to me because their #1 is gone. My childhood best friend basically left me for someone she knew for 3 months and its a long story but it basically traumatized me. I wish you luck in finding some people that treat you well cuz that’s awful.",
                    "score": 2,
                    "author": "Icy_Flamingo3970"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully you can meet someone that is good for you I hope I do too",
            "score": 2,
            "author": "Lovelessjay1234",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah thanks, you too dude.",
                    "score": 1,
                    "author": "Icy_Flamingo3970"
                }
            ]
        }
    ]
}