{
    "id": "148c8w9",
    "score": 4,
    "title": "I think my dad might’ve looked through my phone and now I am paranoid.",
    "author": "ActualIyCameron",
    "date": 1686652435.0,
    "url": "https://www.reddit.com/r/Vent/comments/148c8w9",
    "media_urls": [],
    "other_urls": [],
    "postText": "okay, so..\nI don’t use my phone a lot, at least not during the day.\nWhenever I don’t use it I ALWAYS put it on my nightstand so it’s charging.\n\nI’m very obsessed with my phone battery, I’m not sure why, if it’s below 50% I get really anxious and scared it’ll randomly die and never recharge or something.\n\nme and my dad share a computer inside his room, I don’t have my own so I use it whenever I play video games.\nAlso my dads room is at the end of the hall and my room is to the left at the end of the hall.\n\nand as I am playing my dad walks up to me with my phone and tells me my cousins called me, but the weird thing is he came from (what looked like) the end of the hallway and not my room.\n\nI had my phone is my room, I’m 100% certain. And when I looked at my phone it had lost a slight bit of battery.\n\nMaybe I’m paranoid, maybe I somehow forgot that I brought it to the living room, maybe he went through my phone.\n\nI don’t know, it’s bugging me.\nI also don’t understand why’d he go through my phone? I don’t do weird shit online (except using this app) and I don’t understand what I could’ve done to make him feel the need to go through my phone.\n\nAm I just being paranoid? I feel like if I mention it to him he’ll get even more suspicious and if he hasn’t already looked at my phone he probably would then.",
    "comments": [
        {
            "level": 0,
            "comment": "I live by a motto that I have nothing to hide, life works better that way. Having an open communication platform with your parents is important. Both good and bad, don’t filter anything. How would they know if you’re struggling worse case? I use to hide weed from my family, eventually i told them about my pot usage in high school, they ended up supporting me but wouldn’t give me money for it. That made me more responsible and more controlled. Your family will always love you, that’s what they’re for. Ask your dad if he went through your phone, it may lead to something worth talking over",
            "score": 4,
            "author": "DearVeterinarian7699",
            "replies": [
                {
                    "level": 1,
                    "comment": "I talk quite a lot of shit about my dad though, case he’s kind of an asshole 🤨\n\nhopefully (if he does go through my stuff) he doesn’t find that",
                    "score": 1,
                    "author": "ActualIyCameron"
                },
                {
                    "level": 1,
                    "comment": "People have a right to privacy. It’s great you have nothing to hide but that’s not relevant here.",
                    "score": 1,
                    "author": "Accurate_Prompt_2271"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is nothing, don't worry if you don't have naked pictures of yourself on there or saved up on some porn, you'll be fine. The real scare is when they find your toys. I keep mine in a backpack under my desk neatly hidden in a corner. I have so many of them, whatever you think of. My mother was cleaning one day and i saw it taken out and it was put against the wall. To this day i still hope she didn't have a look on what's inside it.",
            "score": 2,
            "author": "flameodude",
            "replies": [
                {
                    "level": 1,
                    "comment": "Still find it so odd that girls have so many. But it's weird AF for a dude to have one.",
                    "score": 1,
                    "author": "zackman115",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh cmon I was lonely and needed something to stimulate me...",
                            "score": 1,
                            "author": "flameodude"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ask him",
            "score": 1,
            "author": "Accurate_Prompt_2271"
        }
    ]
}