{
    "id": "148dd9x",
    "score": 3,
    "title": "So damn nosey",
    "author": "7he_1_Y0u_4G0t",
    "date": 1686656364.0,
    "url": "https://www.reddit.com/r/Vent/comments/148dd9x",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nGrab a glass. \nPour yourself some water and drink until you cannot anymore.\n\nFor when the “amount” of your stomach, is filled. \nTake a bit to ponder and wander, in the thoughts to come over/after reading.\n\nSome, will or may. Be accustom to there ways of displaying their own eyes for all to see through. By a show of attuned fractals following a “verbal boxing match.”\nKind of like…\n\nIt’s like uhh…\n\nLike a *film reel*\n\nOf all these overwhelming [secret] 🤫 consequential unnecessary brain r**ing torture mechanisms, take a toll. It happens to play a role. Being that, of a *voodoo symphony* packed with great discernment of a procession. And it’s cause for effect; to affect, nonetheless. Results are sadly irreparable.\nIt is called, elimination.\n\nWhile withstanding all of that and unknowingly knowing, it goes further beyond most peoples backs. \n\nA lot further, than it ever was suppose to get. \n\nFar from ever being as to how it now is. \nAnd it gives a(n) outstanding position which happens to(o.) overload(disrupt) the deep state of sneaking suspicion. With a plethora of subjugated composition(ing) quantifiers that gave birth, to a(my) newfound intuitvism(status).\nNow it’s totaling my (quids)inheritance for quo, through a promulgated hypothesis, that I. Had made not so long ago. \n\nAnd what a strange! \nType like epithet to have of this sense.\nThe epitome of a hypothalamic controlled substantial being, just has a *”ring”* to it now, doesn’t it?\n\nJust to get subtly mistreated with no mistaken reprimands, to reprise for while approaching the *point*[amount].\nBy a sheer pleasurable litigious easement for themselves; to oneself. &amp; then on and unto others,\n(not myself). to benefit the overall doubts towards my wits… Expanding into a disorder, then a disastrous physical altercation combined. Make for a conglomeration of un(mis)fortunate events to let be and watch happen.\n\nIt’s all through a cause and the effect. {Here’s a scratch of the affects put to words of that it had on myself.}\nIt’s neuropsychological warfare of ones egocentrism, that lies beneath the self-forgetfulness stage of a battle between. Both sides of the brain. \n\nAnd being alone…\n\nWithout that other blessed mind…\nNext to your critical conditioned experienced mind…\n(Being able to commiserate with them freely, is a gift.)\n\nWith that of which you happen to be stuck in th(is)e momentous momentum, of a rhythmic life. \nLet it be recycled by a contemplated pause for posting such haste, on a goodbye.\n\nThe(ir) existence is of something great! \n\nAnd for what I wrote above \n\n“It’ll come to you.” And for when it does. *Smile*\n\nMay you understand that being; alone. Unacknowledged and dismayed, into dispelling your love for pain &amp; suffering.\n\n-Thats just it- but of polar opposites that don’t push away, both will create?\n*”Happiness”* - As it happens to arise from those moments that are to be filled, once again.\n- [ ] \n\n#Attempt-To-Rescript-For-Book",
    "comments": []
}