{
    "id": "148nekq",
    "score": 1,
    "title": "I always want what i don’t have",
    "author": "EntertainmentMean482",
    "date": 1686684323.0,
    "url": "https://www.reddit.com/r/Vent/comments/148nekq",
    "media_urls": [],
    "other_urls": [],
    "postText": "For context i was dating my boyfriend (D) for about a year before i met this other guy (K) I immediately was enthralled with K and wanted to be with him and get to know him, at this time i was also starting to loose feelings for D, D and K were really good friends so you can see why this is complicated, me and K slowly started to get closer until i eventually broke up with D and started to date K, we had sex, went on dates i mean we were really close, and then one day, i relized i was missing D and that i was an awful person for breaking up with him and fucking his best friend, so me and D got back together and K and I are no longer on good terms because i broke up with K very cowardly and i was awful to him, now me and D are back together, theres stability and joy but i am starting to miss K again just like with what happened before when i was with K and started to miss D, it feels like i only really truely want what i cant have and its an awful place to be in, i dont want to hurt anymore people or tell them that ill be there for them forever because i just dont know anymore. i feel like theres no stability or trust in myself and i just dont know what to do, any suggestions?",
    "comments": [
        {
            "level": 0,
            "comment": "Leave them alone. This isn't love, it's loneliness and attraction. It's not fair to them or yourself to continue screwing with everyone's emotions.",
            "score": 1,
            "author": "Ashley4645",
            "replies": [
                {
                    "level": 1,
                    "comment": "i really want to be there for someone yk i feel like i can really do some good and i’ve learned from my mistakes i just dont know if enduring the stints of my drifting is miss guided or if i should just give up and submit yk",
                    "score": 1,
                    "author": "EntertainmentMean482",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who just wants to love, I get it. But it's immoral to use your needs as an excuse to get what you want while hurting others. There's someone out there that you actually love. This isn't it.",
                            "score": 1,
                            "author": "Ashley4645"
                        }
                    ]
                }
            ]
        }
    ]
}