{
    "id": "148qaho",
    "score": 1,
    "title": "Ex single handedly ruined my life (sortof)",
    "author": "the_celtic_warrior_",
    "date": 1686692107.0,
    "url": "https://www.reddit.com/r/Vent/comments/148qaho",
    "media_urls": [],
    "other_urls": [],
    "postText": "I understand some of the issues in this sub are far worse than what I’m facing, but this has been weighing on me for about 2 years and I have nowhere else to go, so why not semi-anonymously on the internet? If you take the time to hear my groaning, thankyou truly. \nI had a long relationship (2+ years) end close to three years ago now. I broke it off because I felt we were growing apart and I was beginning college and didn’t need the extra stress. She didn’t take it well, but we broke on fairly good terms. We were both planning to attend the same college however, which later became an issue. Within the next month, she had a boyfriend (didn’t bother me any). For the first 5 months or so, we actual continued to have somewhat civil conversations, until one day, I spotted her on a dating app I use. The first thing I did was check her socials to check if she was still with her boyfriend (she was). I naturally swiped left only to see the message “you missed a potential match”. This account had liked mine. I immediately texted her giving her the benefit of the doubt “hey, I think somebodies pretending to be you on bumble”. Her response? “Oh you swiped left on me?🥺”. I immediately called her (which she ignored), so I just blocked her. Not five minutes later, her BOYFRIEND TEXTS ME. He asks me to unblock HIS girlfriend because she needs CLOSURE. I couldn’t make this up if I tried. But this is just the start. After I curved her attempt to cheat on her boyfriend with me, I start hearing from all my “friends” that my ex is going around spreading heinous rumors about me to anyone that’ll listen, including, but not limited to (he physically assaulted me, he sexually assaulted me, he’s a pedophile) on and on and on. So I make an attempt to contact her and eventually I do, I had to know for sure she was saying these things herself. She all but confirmed she WAS in fact spreading false rumors because she was mad I wouldn’t sleep with her. The result of these rumors? My “best friend” believes I screwed around with his younger sister (minor) and blocked me without even so much as consulting me despite the only “evidence” being my ex said so, every one of my “friends” also believes her stories and haven’t spoken to me in over a year, I constantly get death threats from people in my hometown etc. She also likes to find out anyone I’m talking to romantically so she can fill them in on her bs. Mentally and emotionally I’m so fucked, I’m living far from my hometown now, I had to drop out of college and get a job I hate just to survive, I have no friends, no SO, not much family. I’ve contemplated ending it more than I’d like to admit. I’ve attempted to seek counsel, but given the absurdity of my story, not even my counselor believes me. Not a soul believes me and it’s a more terrible loneliness than I could have ever imagined. Never before have I truly hated a person, but I’m not sure what I would do if I ever saw her again. She ruined my life.",
    "comments": []
}