{
    "id": "148ur8x",
    "score": 1,
    "title": "im incredibly anxious and feel left out",
    "author": "scrinklebop",
    "date": 1686705176.0,
    "url": "https://www.reddit.com/r/Vent/comments/148ur8x",
    "media_urls": [],
    "other_urls": [],
    "postText": "im a highschooler, i have autism and i feel so different from everyone because of it. i have a hard time socializing, and catching small things people do in conversation, and it seems like people already clock me as weird before i even speak. like they can just tell im different and weird before i even do anything. i can barely hold a conversation sometimes, and i feel looked over. i always feel left out of convos even when talking with close friends, and i have a hard time speaking up and knowing what to say. ive gotten better at not seeming as anxious on the outside, but i still get so worried. \nanytime im talking w more than one person i feel like im not even apart of the conversation. i feel like im watching the two people from an outside perspective, like im a ghost. even if im speaking, im not contributing anything.",
    "comments": [
        {
            "level": 0,
            "comment": "Troll",
            "score": 1,
            "author": "Particular_Living398",
            "replies": [
                {
                    "level": 1,
                    "comment": "?? sorry im not sure what you mean. are you saying im a troll for this post???",
                    "score": 1,
                    "author": "scrinklebop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're generalizing autism. I have aspergers. Either this is a troll post or you are actually ignorant",
                            "score": 1,
                            "author": "Particular_Living398",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "im not saying this is exactly what autism is. im saying i believe i feel this way because of my autism, and often miss out on a lot of things happening socially because of it aswell. obviously this isnt what autism is, just a trait of it, and not every autistic person will experience this. also why are u commenting stuff like this on a subreddit for people venting abt struggles. if someones venting, you saying stuff like this isnt going to help in the slightest. i genuinely dont understand how this makes me ignorant, if you could explain thatd be nice. i dont mean to be ignorant i just feel as thought youre misunderstanding.",
                                    "score": 1,
                                    "author": "scrinklebop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As I mentioned before,  I don't care.  You diagnosing yourself doesn't mean anything.  Just because you feel autistic,  doesn't mean you are. It could mean you're just fucking weird.",
                                            "score": 1,
                                            "author": "Particular_Living398",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "you dont know if i diagnosed myself or was diagnosed by a doctor. im venting about issues i have socially, im not trolling what so ever. im struggling and i just needed someone to talk to. \nme putting one small detail on my post does not warrant you to be making these comments, you know nothing about my life.",
                                                    "score": 1,
                                                    "author": "scrinklebop",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It does when other people with that diagnosis are struggling.",
                                                            "score": 1,
                                                            "author": "Particular_Living398",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "how do you know im not also struggling.",
                                                                    "score": 1,
                                                                    "author": "scrinklebop",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't care.  Without proof, it means nothing.  I'm 25. You're not going to convince me.  If you have to convince,  you're not it.",
                                                                            "score": 1,
                                                                            "author": "Particular_Living398",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "i have a question, what do you get out of commenting on a teenagers post telling them that their struggles arent real. does this make u feel better abt urself or smth. i just dont understand the whole point of this whole conversation if you wont even listen to me. im not even rlly trying to convince you, more just understand why you think im lying or \"trolling\".",
                                                                                    "score": 1,
                                                                                    "author": "scrinklebop",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not one specific event.",
                            "score": 1,
                            "author": "Particular_Living398",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what do you mean by this?",
                                    "score": 1,
                                    "author": "scrinklebop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly what I said . Stop trying to troll on 2 posts goofy.",
                                            "score": 1,
                                            "author": "Particular_Living398",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "stop trying to troll on 2 posts? what other post?",
                                                    "score": 1,
                                                    "author": "scrinklebop",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Bye goofy.",
                                                            "score": 1,
                                                            "author": "Particular_Living398"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}