{
    "id": "148xbsm",
    "score": 1,
    "title": "Im in so much emotional pain i dont understand",
    "author": "Strawberrybunnie--",
    "date": 1686713389.0,
    "url": "https://www.reddit.com/r/Vent/comments/148xbsm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I try to be a really nice person to everyone but it feels like every where i go im extremely liked to the point of popularity but extremely disrespected and judged. \n\nA bit ago i liked this guy and he was white while im African American and while i dont notice its the first thing people noticed\n\nI got racially harrassed and even this girl told me how guys would never like a black girl like me and i should give up on finding love.\nMaybe shes right because it feels like no one wants to date me while all my other friends are able to get a chance with *someone*\n\nMy emotions are disrespected and invalidated and no one takes me seriously. Not even people at home. I cant take this anymore. I cant. It hurts so bad im not safe anywhere. \n\nI honestly just really want to find love. Love that isnt abusive or neglectful. Maybe that will make feel good enough.\n\nI always compare myself to other girls. Especially brunette white girls. I dont even know why specifically brunette. Probably because people compared me my crushes previous crush and told me id never have a chance because i wasnt exactly like her.\n\nIm sitting here just realizing how bad the ridicule was at my high school. How badly i was compared, how badly i was insulted disrespected and hurt.\n\nPeople making small comments that now are the reason for my non existent confidence. The racism.\n\nI just want to at least have a chance at love\nIm moving schools because i couldnt take it anymore. \nIf being popular and having all these different friends and being well liked meant being treated like shit then fuck it\n\nI dont care anymore all those people were so mean and i didnt even know some of the people who hated me. Why were people who i didnt even talk to jealous of me??? Why?? I dont get the need??\n\nIm not respected and now i cant respect myself because i dont know what it's like\n\nAll i want right now though is just a chance at finding someone who wants me romanticly. Someone that i also really want. I want to be liked back and for it to be easy\nI dont know what im doing to deserve being treated like this\nI seriously dont know \nIs it karma for something bad i did?\nIf so then please let me fix it because it wasnt intentional\n\nThe hardest part of my day is waking up\nI cant do this anymore \nLife is meaningless and stressful theres nothing good in this world \n\nThe pain is getting worse.",
    "comments": []
}