{
    "id": "148xsoo",
    "score": 1,
    "title": "Our company is moving locations and laying off hundreds for “better talent pool”",
    "author": "FlamingInferno3",
    "date": 1686714951.0,
    "url": "https://www.reddit.com/r/Vent/comments/148xsoo",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don’t even know if this is venting. At the moment, I feel empty inside and usually venting requires anger or something but I just feel dead inside.\n\nHow many of you love LEGO? \nHow many of you have ever had a piece missing from a set or broken?\nHow many of you ever had to call customer service for literally anything?\n\nThat’s my job. I am LEGO customer service. I’ve been with the company only a few years but it’s been a good few years, especially since I was at Walmart for a decade before that. The work environment was night and day, honestly and it took me a while to even relax enough to accept “this is a good company who legit cares” especially since so many employees kept telling me that. They kept telling me to stop waiting for the other shoe to drop, because this ain’t that type of company but here we are.\n\nCurrently, LEGO in North America has been in Enfield, CT for many years. It’s the only place it’s ever been for the US, actually. Apparently, when the company’s owners visited this area, they said it felt very similar to their home in Denmark so that’s why they chose it. If you didn’t know that, there is your fun fact for the day.\n\nEarlier this year, they suddenly dropped the bomb on us only an hour before they released it to the media. Everyone who isn’t customer service was moving to Boston, but we were in limbo. Obviously we were going to be moving somewhere also but there was no idea as to where. Customer service is all done over the phone/computer and there is no NEED to be in an actual office. When the world collapsed because of Covid, they finally opened up the world to “remote” workers and realized just how easy and more efficient it was for us all. Hundreds of remote workers from all over the country were hired, the business has been at an all time high in terms of sales and customer satisfaction due to this. No more waiting hours on hold, or days for an email reply. What’s not to love?\n\nApparently, the company believes in a strict office environment regardless of how well the company has been doing outside of that. It’s “tradition” to be in office, and they want to keep it that way. Screw the actual data proving that it’s not necessary. Screw how happy being remote has made the workers and customers alike. Screw all the jobs it created for those not from the CT and MA areas… \n\nToday, we were finally told where our office is moving to. Atlanta and Phoenix. Far far far away from the New England area, and as my title explained, this is due to the “talent pool” over there. You know where the biggest talent pool actually is? All over the country, with us being remote. But that’s too logical, my apologies.\n\nYes, let’s try to force families to up root to move super far away for a CUSTOMER SERVICE JOB. That’s really family friendly.\nYes, let’s put many parents out of a job just because “tradition”.\nYes, let’s go back to those long queues for loyal fans to wait in because a big city sounds great.\nThis “grass is greener” mentally is sickening, and I’m disappointed. I don’t even know if disappointed is even really the word. It’s just so ass backwards for a company who used to really treasure their workers to do this. \n\nAll of our moral is at an all time low, and has been since the news was initially announced in like… February? I know it doesn’t show in our performance because we still have a job to do, and honestly 90% of the customers I talk with are super awesome, so it’s easy to enjoy the job. Going into office is beyond depressing though, and I’m so tired of them gaslighting us with how “fun and exciting” this move will be. For who? Not the hundreds of people I know who can’t follow. Not the hundreds of remote workers who will be out of a job. It’s disgusting. \n\nThis has devastated so many of us who loved this company and planned to retire here. And me? I’m just back to being jaded. The other shoe wasn’t gonna drop, right? Sure, Jan.",
    "comments": []
}