{
    "id": "148xh92",
    "score": 3,
    "title": "Is it wrong to game as an adult when there are kids in some of the games? Is this grooming?",
    "author": "pizzaonmykneecaps",
    "date": 1686713886.0,
    "url": "https://www.reddit.com/r/Vent/comments/148xh92",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a straight female adult and today I was told it was weird and creepy that I join video game matches that have kids (I'm an adult).\n\nI join games I don't have the choice in who I play with I just click match and it puts you on a team. Some are  adults but some are kids. How do I avoid kids in games? I can't avoid them they're in all games. Is it weird I added some to my in game friends because they're good players? I don't talk to them outside of playing the video game but I was told even gaming with teens is weird if you're over 20. \n\nLet me know if this is okay or not because I was called a groomer by two adults for doing this and its grossing me out and making me feel crap because I'm against grooming myself and I didn't think this was wrong awkward sometimes sure because they act silly but I didn't know it was wrong.",
    "comments": [
        {
            "level": 0,
            "comment": "it’s not weird it’s completely normal. many adults play video games and it would only be considered grooming if you built an inappropriate relationship with one or more of the children with a sexual intent.",
            "score": 4,
            "author": "g4yspiderman",
            "replies": [
                {
                    "level": 1,
                    "comment": "psa: grooming isn’t always sexual ofc but most times it is and that’s the typical kind that happens between children and adults online.",
                    "score": 3,
                    "author": "g4yspiderman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not weird at all, not frowned upon, not considered grooming.",
            "score": 2,
            "author": "Prettythicc_420"
        },
        {
            "level": 0,
            "comment": "Totally not bad! Most certainly NOT grooming. Thats how video games work, kids play and adults play the same game. As long as adults aren't being inappropriate ( swearing is fine just no slurs depending on how old u think they are) is not bad.\n\nIf you played a irl game like tag with a child is that grooming? Nope, same goes for video games. Hope this helped, and dont take others bs &lt;3",
            "score": 1,
            "author": "Tacticalpizzamann"
        },
        {
            "level": 0,
            "comment": "Whoever told you that is an actual moron and deserves zero respect.  Clearly they don't understand how online gaming works.  Next time, tell that individual to fuck right off.",
            "score": 1,
            "author": "JonnyHereHey"
        },
        {
            "level": 0,
            "comment": "No, it’s not the same",
            "score": 1,
            "author": "throwawayAC33"
        },
        {
            "level": 0,
            "comment": "whattt i don’t think it’s weird at all. i’m also 20. like queueing with kids maybe but we can’t help who we run into",
            "score": 1,
            "author": "Sad-Character4424"
        },
        {
            "level": 0,
            "comment": "I have many opinions. But It's not wrong at all. Video games are an easy way for predators to have access to children.  So we need more adults playing on games. I play on Roblox and the stuff I have seen is horrifying. Makes my skin crawl. But I'm there recording and reporting.  We must make online spaces as safe as we possibly can for children and those that have lower mental capacity. I am a babysitter. Naturally the kids want me to play certain games with them. I've seen whole families play together. It was so sweet to see.  Games are distressing no matter the age. They help grow and practice skills. Give us a creative outlet that we can't get anywhere else. Nor do we have the finances to do so. As an adult those needs don't stop.  How do they really expect us to be? Read newspapers and squint our eyes to every tomfoolery that goes on around us, with a disapproving eye. So I think it's far from creepy if you're just there innocently enjoying the game. It really feels gruesome once your past a certain age. they expect you to just not have any more fun.like were all just ready for our deaths to come. Pass the age of 30 or so.  It's just so odd. But Leaving kids with kids in an online space that does include games. Is asking for abuse and for them to be introduced to things that are very harmful detrimental. Too many parents let the internet be the babysitter. I don't even think I can post some of the stuff I have witnessed when predators think adults aren't around.  Heck I look and sound much younger than I am. I have been mistaken for someone under the age. (14-16.)  Even games on your phone are not safe. If there is any texting or voice. Even Yahtzee app isn't safe.",
            "score": 1,
            "author": "cheekychurroz"
        }
    ]
}