{
    "id": "k01mxk",
    "score": 614,
    "title": "Stop referring pedophiles as maps and dont add them to the LGBTQ+ community",
    "author": "Hi1mKai",
    "date": 1606208782.0,
    "url": "https://www.reddit.com/r/Vent/comments/k01mxk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Being a pedophile is not okay in anyway. There is nothing good about being a pedophile and if you are one and trying to show that it is okay, stop. Pedophiles dont belong in any communities, especially not the LGBTQ+ community. Being part of the community is attraction to same sex, not wanting sex, not having a select gender, being your authentic self. It's not showing attraction to a child. That's disgusting. If anyone thinks it is okay please don't talk to me, find help and dont try to hide that with a community that is all about pride. There is no pride in being a pedophile. If people are trying to accept it in LGBTQ then might as well add attraction to animals. It wont happen cause it's wrong just like pedophilia. The LGBTQ community has it hard enough in this world as it is, we dont want to be associated with pedophilia. No one does. Again if you have thought of children in a sexual manner, find help. That is not normal. Dont normalize it. There are laws set in place to prevent sexual acts against children for a reason. So it is absolutely wrong to think that way\n\n\nEdit: I want to say that everyone's comments are very good. I want to thank the survivors in the comments that had enough courage to talk about this hard subject. I understand that pedophilia is considered a disease to some and I think it is to. Yet it doesn't feel right to place them in the LGBTQIA community. Pedophilia is an attraction to a range of ages. Many of you have compared therapy for a pedophile to conversion therapy and that truly shouldn't be compared. There is only one thing that is similar between the two. It sometimes has no affect or doesnt work for long. I understand that can control it but either way they come to someone and tell them there is more of a chance they will never talk to them again. It is a big lose lose for them. \n\n\nThank you for so many upvotes. It's the most I've ever gotten. Hope you all have a good day and happy holidays",
    "comments": [
        {
            "level": 0,
            "comment": "Part of what Pride means to me is, no matter how weird someone may think I am, or how hard they find it to relate to some of what's seen in my community, it is *all* consensual. \n\nPedophiles don't belong here.",
            "score": 124,
            "author": "soberyogini",
            "replies": [
                {
                    "level": 1,
                    "comment": "Especially since I do believe the lgbt community is supposed to be all that is LEGAL ..pedophilia is not legal. Nor will it ever be",
                    "score": 27,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really don't understand how could a person do such things to innocent children",
                            "score": 11,
                            "author": "Your-time-has-come"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "THIS. Consent is at our core",
                    "score": 6,
                    "author": "findyourhappy401"
                }
            ]
        },
        {
            "level": 0,
            "comment": " yes, they aren't a part of the LGBTQ+ community and never will be. \n\n\nBut it's not their fault they're pedophiles, they need help. If they see that there's something wrong with them, want to get better,  and don't diddle kids they should be fine (if they do get help that is) and should be treated like normal people. \n\nBut the ones that do traumatise children, and know what the fuck they're doing is bad and still do it deserve worse than death. They deserve to get locked up somewhere and get tortured until they fucking die.\n\nAlso I'm really fucking angry that female pedophiles get away with raping a fucking child just because they're women and \"the kid should've enjoyed it\". Total fucking bullshit.",
            "score": 15,
            "author": "cowardlygryffindor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your last paragraph needs more attention. That issue is a poison that’s ingrained into our culture (assuming you’re also from the US—apologies if I’m wrong) and it’s sickening.",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not from the US, but the amount of cases I've seen that a female teacher has slept with a young student is honestly disgusting. They always get like a year or less in prison and some don't even go.",
                            "score": 3,
                            "author": "cowardlygryffindor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“It just means he’s becoming a man!” No, it means that woman is a pedophile who got off easy because she has a vagina.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I am aware lmao \n\nI am a sick hateful fuck but at least I wouldn't traumatise a  child that hasn't done anything wrong.",
                            "score": 2,
                            "author": "cowardlygryffindor"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "agreed\n\ndude there are even kids trying to impose \"mAp PrIdE\" like it's something normal. and i repeat, \n\n# KIDS\n\nyeah you read that right",
            "score": 28,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "WHAT",
                    "score": 5,
                    "author": "MEF227"
                },
                {
                    "level": 1,
                    "comment": "Reference?",
                    "score": 2,
                    "author": "unknown_user0531A087",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "have you heard of gacha?\nif you did, you will know what im talking about",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No I have never heard of it until you brought it up. However I googled \"gatcha  pedophile\" and  now I see what your talking about. \nShit is crazy.",
                                    "score": 2,
                                    "author": "unknown_user0531A087",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yes. yes it is :')\n\nhelp",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "P R E A C H!\n\nBeing a pedo is not a damned sexuality!",
            "score": 11,
            "author": "VicianTheGreat"
        },
        {
            "level": 0,
            "comment": "I agree, but they need psychological help. It’s not their fault they are pedophiles. As long as they don’t consume cp and want to be rehabilitated.  People need to know how to differ the crime and the “disease” so innocent ppl won’t be called monsters randomly.",
            "score": 79,
            "author": "Coffee_Jelly_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with you completely, anyone can change with the right help. But if they hide behind a label in the LGBTQ community, normalize it, and decline help then they dont deserve to be helped. This can turn into children normalize sexual behavior with an adult.",
                    "score": 53,
                    "author": "Hi1mKai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pedos can get treated but not cured, so while it's DEFINITELY possible to stop harming kids, it's not possible to \"change\" completely. But they absolutely don't belong in the lgbtq community",
                            "score": 42,
                            "author": "Ukacelody",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Change does not equal cure. Not sure why you're trying to draw that parallel",
                                    "score": 1,
                                    "author": "Melia2005",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "To me it just sounded like op thought they could completely do a 180 and get a new life. Depends to what degree you mean change",
                                            "score": 1,
                                            "author": "Ukacelody"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\nYou can't \"change\" or stop the the true nature of what a person is naturally attracted to. No matter how much therapy.\n\nDo you honestly believe that therapy could change how you naturally feel about people that YOU are attracted to? Even if you wanted to change?",
                            "score": 8,
                            "author": "unknown_user0531A087",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is a huge difference between liking the same gender and liking a age range.",
                                    "score": 13,
                                    "author": "Hi1mKai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I never said that there is no difference in being attracted to the same gender and being attracted to a specific age group.\n\nNot sure how you gathered that based of what I said..",
                                            "score": 7,
                                            "author": "unknown_user0531A087",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"Do you honestly believe that therapy could change how you naturally feel about people that YOU are attracted to? Even if you wanted to change?\"\n\nThe difference between me and a pedophile is that my love and attraction is legal. Theirs are not. So to be put through therapy to be forced to be straight is wrong cause it is accepted in society, going through therapy to take away the thoughts of touching a child is good cause they know it's wrong and it shouldn't be happening. \n\nSo, finding attraction in the same sex is okay and conversion therapy is terrible. Attraction in an age group is bad a d therapy is good.",
                                                    "score": 2,
                                                    "author": "Hi1mKai",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Your taking what I said completely out of context and failed to grasp my point.",
                                                            "score": 3,
                                                            "author": "unknown_user0531A087",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't believe I did. You compared conversion therapy for gays and conversion therapy for pedophiles. You can't compare those two things. You're implying that suppressing pedophilia (a mental illness) is the same as suppressing gay attraction. Therapy for pedophilia for the person is hard and awful for them but I would imagine it is harder to live with the thought of themselves being pedophiles. The best they could do is find help with the thoughts. If a gay person on the the other hand went to therapy for being gay would be hard and awful for them but they would feel better to not be in therapy and express their feelings cause it is socially acceptable and okay.",
                                                                    "score": 2,
                                                                    "author": "Hi1mKai"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "A person has to actually want to change for any type of therapy to work",
                                                                    "score": 1,
                                                                    "author": "unknown_user0531A087"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "U misunderstood homie",
                                            "score": 2,
                                            "author": "TheDonger_"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think what they're getting at is something like how schizophrenics can change with proper treatment. They're not cured of schizophrenia, but their behaviour definitely changes",
                                    "score": 2,
                                    "author": "Melia2005"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's the same shit people used to say about homosexuality. But pedophilism isn't a choice per se, but a sexuality in most cases. I agree that practicing it is horrible, but looking at statistics those people only amount to a small number of them. \n\nA large part of the population choose abstinence or medical neutering. I think that it shouldn't be normalised, absolutely. But I have respect for people willing to forego their natural inclinations to not harm others.",
                            "score": 9,
                            "author": "aloic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The term \"sexuality\" here refers to two or more _consenting_ adults who are into a certain gender (or specifically not, ie. ace or aro). LGBTQ+ just covers those outside of the hetero-normative. \n\nThe important take away here is: __Queer or not, sexuality refers to gender. Pedophilia refers to age.__ \n\nAs soon as the child ages, a pedophile won't feel the same attraction anymore. It's a preference, at most. __A preference isn't a sexuality__ - just as being into blondes isn't a sexuality. \n\nAlso: A pedophile isn't \"into\" the child as a person. As a survivor - your personality, your experiences, your interests etc. don't matter. You barely had time to collect all those things that make you up, which an adult has a lifetime to do. A child isn't a whole person yet and we need to stop pretending like pedophiles care to meet a partner on their level.\n\nYou can have respect for people who chose to get help _and_ not condone pedophilia nonetheless. You can acknowledge the fact that most child molesters aren't necessarily pedophilic without claiming it would be a \"sexuality\". It's not mutually exclusive. \n\nYou say you don't want to normalize pedophilia - yet you do. Blurring the lines like you are trying to do here can be potentially dangerous.",
                                    "score": 9,
                                    "author": "ilumyo"
                                },
                                {
                                    "level": 3,
                                    "comment": "I know there are people like that but if they do that children will still see it as normal. Taking pedophilia and putting it as a sexuality will normalize it and put a whole new look on the LGBTQ community as a community that will take in illegal sexual behaviors. I know it's not a choice but it can be helped to suppress the feelings they have.\n\n\nBut comparing the things that gay people gone through, and still go through, to what people with pedophilic thoughts want to be apart of shouldn't be a thing. This \"map sexuality\" has been leaked into politics and Trump was going to limit adoption to same sex couples cause he associated \"maps\" with the rest of the LGBTQ community. Being gay has nothing to do with being attracted to children. LGBTQ community are still fighting for trans rights and if someone is curious about helping, they will research LGBTQ community and they will see pedophilia in that a completely change their mind. \n\n\nTo me if it is normalized in anyway then it will effect childrens thought on an adult touching them and effect people's view of the LGBTQ community. There still isn't alot of rights for the community and if \"maps\" keep associating with the community, we may never get the rights. \n\n\nIf it isn't normalized then less people will feel the urges. Also the population and crimes of pedophilia will go down. There won't be anything to slow down new support for the LGBTQ community and will no children will question whether it is wrong or not that an adult is touching them",
                                    "score": 6,
                                    "author": "Hi1mKai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tbh a lot of the things that I have seen from the map movement disgust me. If this is about that, I agree on what I've seen from that on reddit. However I think its important to make sure that non practicing pedophiles do not go into a social isolation, as it's then more likely for them to think that they have nothing to lose, with all the possibly horrible consequences.",
                                            "score": 6,
                                            "author": "aloic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If people are publicly say that they are attracted to children the they need to stop especially if they try to associate as a part of the community. If they keep it to themselves then find, no one will know. I honestly made this post about \"maps\" as a whole and I saw a video of a man trying to normalize the attraction to children.",
                                                    "score": 3,
                                                    "author": "Hi1mKai",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dude, so you expect them to lie their entire fucking life? Im closeted LGBTQIA and it fucking sucks having to lie. Being mad at them for acting on their sexuality as a pedophile is okay, it's terrible that pedophiles do that, but if they are just open and honest about it, that's okay. They can't help who they are attracted to. They can help how they act, but not how they think.",
                                                            "score": 4,
                                                            "author": "Parksrox",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I know how it is to be closeted myself. I was closeted my whole live until junior year. But there is a complete difference between liking a gender, being nonbinary, trans, unconfirming gender etc. and liking a age range between 4 to 16. I know they cant help it but there is no good in being a pedophile. You tell someone they hate, if you doing you live with it until you can stand it any long and you act on it",
                                                                    "score": 2,
                                                                    "author": "Hi1mKai"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "1. I do not believe that pedophilia is a good thing to practice in any way, shape or form, but like others have said, they can't control who they like. I'm sure you can relate, because I am sure that bad people in your life have ridiculed you for being LGBTQIA(They call it that now, lesbian gay bisexual transgender queer intersex asexual) even though it was not your choice in any way. I have felt this from telling friends to the point that I'm not even going to tell my parents. 2. They most likely would want to be not a pedophile, because they would have a hard time with  sexual stuff, and they would probably not want to engage in sexual activity with a child. 3. Correct me if I'm wrong, I don't know a ton about this, but isn't LGBTQIA just anyone that is not heterosexual? If so, then, by definition, they would be LGBTQIA. Again, this is coming from a mostly closeted kind of bisexual,(I like women and men but will only have sexual activity with women) so I am not going to be saying this as an F you to the LGBTQIA community.",
                                            "score": -4,
                                            "author": "Parksrox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The LGBTQIA community is non heterosexual people yes, but I dont think heterosexuality has anything to do with children. Cause of the fact the pedophilia is a range of age instead of being a range of gender, nonconforming genders, etc. I know they dont want to be one and it is hard to talk about this since I'm not a survivor but many people see it as having control instead of being with a child. Some have it cause they can control it, I get that. When I came out I felt relief and I was happier with who I was. If someone came out as \"map\" I dont think people would like that and they would feel even worse about their situation. I have been ridiculed for being nonbinary and pan yes, but not as much as a \"map\" would if someone knew about them. Pedophilia gives of a uneasy feeling and makes everyone think the person has or tried to touch a child.",
                                                    "score": 4,
                                                    "author": "Hi1mKai",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But shouldn't they still have the right to tell the truth?",
                                                            "score": -4,
                                                            "author": "Parksrox",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They can but either way it won't be good for them. If they tell there is a big chance the people they tells dont want to be around them or they dont tell and keep it in until the act on it",
                                                                    "score": 2,
                                                                    "author": "Hi1mKai",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "But acting on same sex relationships isn't the same as acting on a relationship with a child. You aren't seeing the big picture. Back then yes being gay was socially not acceptable and now it is cause it's two adults in a consenting relationship. Back then and now pedophilia isn't acceptable cause it is a non consenting relationship between a adult and a child",
                                                                                    "score": 1,
                                                                                    "author": "Hi1mKai",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NEWS FLASH TO ALL WHO DEFEND/VALIDATE MAPS\n\n*CHILDREN ARE NOT A GENDER*",
            "score": 18,
            "author": "Indigo-Winged-Wolf"
        },
        {
            "level": 0,
            "comment": "I don't know a single LGBT person who's willing to accept them into the community. You don't have to worry about that part. They literally get kicked out of Pride if they show up. The LGBT community is about legal and consenting love, pedophiles don't fit any of that.",
            "score": 14,
            "author": "IstgUsernamesSuck"
        },
        {
            "level": 0,
            "comment": "Being a pedophile isn’t a choice. But being a RAPIST and a child molester IS a choice. Pedophilia should NEVER be accepted or normalised, but we should do more to help non-offending pedophiles, because by lumping them in with child rapists we’re condemning them for something that they can’t change. Which I’m sure members of the LGBT+ community know about all too well.",
            "score": 12,
            "author": "FisherPrice_Hair",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see these types of posts all too often and not enough people clarifying the reality, just demonizing people who’ve done nothing wrong alongside those who have. It’s nice to know there’s some common decency still out there.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nobody in the LGBTQ community is trying to accept pedophiles. That's harmful rhetoric meant to make us look like predators and deviants, not reality.",
            "score": 11,
            "author": "bluecrowned"
        },
        {
            "level": 0,
            "comment": "pedophiles are taking the innocence of young children\n\nthe LGBTQ community promotes *consensual*, happy relationships regardless of gender. \n\ni cant believe some people genuinely believe that being a pedophile is some sort of sexuality that should be respected. its not. its a fucking crime. its illegal. its disgusting.",
            "score": 8,
            "author": "goatlover49"
        },
        {
            "level": 0,
            "comment": "Preach ❤️",
            "score": 16,
            "author": "Hayleypomps",
            "replies": [
                {
                    "level": 1,
                    "comment": "First comment hype",
                    "score": 2,
                    "author": "Hi1mKai"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I give this my straight seal of approval.\n\nAnything consensual is fine. Children cannot consent.",
            "score": 7,
            "author": "Utterlybored"
        },
        {
            "level": 0,
            "comment": "I keep hearing that pedophiles are trying to be included in the lgbtq community for a while now and that makes me extremely angry 😡",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It all started on 4Chan of all places. As a joke, they were trying to create a \"politically correct\" way to say pedophile and came up with MAPs. It caught on in the pedophile community.",
                    "score": 3,
                    "author": "FriggenSweetLois",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What does maps mean in this context? I've never seen this before",
                            "score": 1,
                            "author": "Melia2005",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah, thank you",
                                            "score": 1,
                                            "author": "Melia2005"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[The only community where pedophiles belong.](https://www.ethos3.com/wp-content/uploads/2013/11/graveyard.jpg)",
            "score": 9,
            "author": "1960sCampVillain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm dying!!!!!💀💀💀💀💀💀",
                    "score": 7,
                    "author": "Hi1mKai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I'm dying!!!!!💀💀💀💀💀💀\n\nWhat I wish all pedophiles would say.",
                            "score": 8,
                            "author": "1960sCampVillain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ur a meme lord",
                                    "score": 7,
                                    "author": "Hi1mKai"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah i think it fits under the \"it contain sexuallized content of minors\"",
                            "score": 1,
                            "author": "dr_Kfromchanged"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "pedophiles are. like why the fuck do they exist who said “y’know what’s a great idea for humanity? CHILD TRAUMATIZERS” like 🤮🤮🤮",
            "score": 5,
            "author": "redwolftrash",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "also pedophiles are. NOWHERE near comparable to the lgbt community??? \n\nand i’ll definitely think of myself above gross people who wanna molest KIDS for their sickening sexual desires.",
                            "score": 2,
                            "author": "redwolftrash",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "pedophiles don’t hurt when they’re grooming children online or irl to take and spread sexual content of them.\n\nthe 23 year old man who groomed me when i was 13 was only hurt when i realized he was a sickening creep USING ME, a MINOR, for his own sick pleasure and ghosted him. he wasn’t upset that he scarred me for years afterward, he just missed getting his dick wet to a 13 year old and orgasming in his fucking bathroom sink.",
                                            "score": 1,
                                            "author": "redwolftrash",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "“hate won’t fix it” it literally has. hating pedophiles keeps them from normalizing their urge to traumatize children and use them as objects.\n\nbeing a pedophile isn’t a “noble reason for hurting”, its a sexual disorder that’s a scourge on society.\n\ni’ll keep my empathy for people who aren’t criminals abusing children.",
                                                            "score": 2,
                                                            "author": "redwolftrash",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 0,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "thank god the pedo defender stopped responding. tired of traumatized kids literally developing SEVERAL mental disorders from abuse and someone going “it’s okay the dudes who raped them are victims too 🤕🤕🤕”",
                                                                            "score": 1,
                                                                            "author": "redwolftrash"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": -1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "good job victim blaming btw, makes you look SUPER suspicious.\n\nalso me being lgbt doesn’t mean i’m a fucking pedophile. again, no sources and more disgusting lgbtphobic rhetoric.\n\nalso nazis are nowhere near comparable to pedophiles??? wtf???",
                                                                            "score": 1,
                                                                            "author": "redwolftrash"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;How do you not see how disgusting a belief that is? You do realize they were born with a similarly arranged brain as you. And therefore, there is a certain set of stimuli to which you could have been subjected to for which you become a shitty human being in all kinds of ways. \n\nThat doenst justify anything, like what? \"As a mammal, my brain is genetically predisposed for murder and rape, it is therefore perfectly ok and moral if i kill a children and then ride his corpse\" is not an excuse",
                                                                            "score": 1,
                                                                            "author": "dr_Kfromchanged",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 1,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "found the pedophile 🤮",
                            "score": 1,
                            "author": "redwolftrash"
                        },
                        {
                            "level": 2,
                            "comment": "also you sound like you have some weird ass superiority complex bc i refuse to normalize pedophilia what the actual fuck is with you",
                            "score": 1,
                            "author": "redwolftrash",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "me objecting to a blatant fucking CRIME that HURTS PEOPLE isn’t a superiority complex. what degen values do you have to ever get that mixed up?",
                                            "score": 1,
                                            "author": "redwolftrash"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah wich sexuality of the LGBT community? Let me guess? Pear? MAP?",
                            "score": 1,
                            "author": "dr_Kfromchanged"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pedos deserve the death penalty.",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would argue that they deserve support if they are willing to get help and acknowledge the problem without harming anyone. Child molesters and people trying to normalize that should definitely rot in jail though.",
                    "score": 6,
                    "author": "ilumyo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah. Im not here to debate my opinion. If you have sick ass thoughts on raping children, you deserve to die. Idgaf about helping pedos.",
                            "score": -3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, you're entitled to your opinion, but I don't think we should kill people who haven't done any harm. I'm not about to defend pedophilia, but I think holding up democracy and its values is still important.",
                                    "score": 7,
                                    "author": "ilumyo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you are having sexual thoughts involving children, youre harming them. Sexualizing children is harmful in and of itself. Point blank period. The specialization of children 100% harms kids, and if you cant NOT sexualize children, youre a sick fuck who deserves death. And as a CSA survivor id appreciate if y'all would stop defending pedos under my comment, y'all disgust me. Fucking enablers.",
                                            "score": -2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm a survivor, too, and I would never try to minimize your suffering. I just think it's a concept you're talking about that's very hard to realistically exercise, especially in light of the fact that every human being has very questionable thoughts from time to time. I understand what you've been through and I'm extremely sorry for that. I don't ask you to forgive, just to try and still uphold justice for everyone.",
                                                    "score": 3,
                                                    "author": "ilumyo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I uphold justice for the children being sexualized. Full stop. Not the pedos.",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think pedophiles are disgusting but I know a person can change with the right help. If they refuse the help then they dont deserve it. No one deserves death but it happens to everyone. So I would say that pedophiles or maps need to reevaluate their behavior before this becomes a normal to children and they think it is okay for them to be touched by a adult",
                    "score": 15,
                    "author": "Hi1mKai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pedos do not change. Go look up how many people have been \"cured\" of their pedophilic behaviors... The answer is none. There is no way to treat them other than therapy and meds, even when you use chemical castration, they still will rape kids with objects and other methods. Im not here to debate shit. They ALLLLLLLLL deserve to die. Bloop",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I honestly hate when people say this. my brother molested me for 4 years and after I came out about it, he decided to go to therapy and work on whatever was wrong with him. maybe the thoughts don't go away, but he shows through his action he has changed. and I fucking love him! he's my brother! he doesn't deserve death. he's worked on himself and is now working on our relationship, rebuilding it in a healthy way.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good for you and your brother. I honestly dont care. If my brother molested me know what i wouldnt do? Have a relationship with him. I dont keep rapists around me. Family or not. Once you rape or molest a person, thats it. Byeeeeeeeee. I dont enable rapists and molesters.",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Once again, you are a fucking moron who has no idea what genocide actually is. Words. Have. Meanings.",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wow nice wiki that also says genocide is the destruction of an ethnic group in a nation. Good job. Thanks for proving me right. Being a pedo isnt an ethnicity. Try harder neck beard.",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 0,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Nah its really not but im tired of your wiki philosophy lessons when im actually Native and my people EXPERIENCE GENOCIDE DAILY. Try harder. You are a pedo enabling dumpster. Bye now",
                                                                            "score": 1,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Weird because most pedos were once molested kids so... should we also kill the victims of molesters too so we don’t get more pedos? No. Because that’s stupid as hell. They need therapy.",
                    "score": 5,
                    "author": "Energy4Kaiser",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not an excuse. Disgusting. Stop enabling pedos you fucking creep. Idgaf id you were victimized, its not any justification to victimize more children. I am a child sexual assault survivor. Know what i dont do? Rape kids. Shut the fuck up sick ass.",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's not genocide. Pedos are not a race or ethnicity. They are not culturally connected to each other. They are not a nation. Words have meanings. And I will NEVER have empathy for pedos. Yall some sickos lol.",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah, they don't.   \n\n\n Even death doesn't want them.",
                    "score": 9,
                    "author": "Firestar_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not the death penalty, for repeated rapist or even just one time pedophile/zoophile the chemical castration should be an applicable sentence",
                    "score": 1,
                    "author": "dr_Kfromchanged",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Castration has repeatedly shown it does nothing to stop rapists or pedos from raping again. You can look that up. I stand by what I said. They deserve the guillotine.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pedophiles should be just called pedophiles. They shouldn’t be called Maps because it is more commonly used as a short term for multi animated project by the animation community before pedos stole it for their own twisted reasons.\n\nIf your a paedophile, what is wrong with you?",
            "score": 3,
            "author": "TheAlmandineWriter"
        },
        {
            "level": 0,
            "comment": "I agree with your sentiment. I think the normalization that some industries are doing is downright disgusting, and pedophiles in general - are disgusting.\n\nHowever, let me correct you on one thing.\n\n&amp;#x200B;\n\nThere is no \"help\" for a pedophile. They cannot simply see a therapist. It's too nerve-wracking and could lead to legal troubles. Have you met a therapist that is able to tolerate a pedophile? To listen to their sick obsessions? Their sexual fantasies with a minor? There is not a single one. They cannot simply 'let go' of these feelings, either.\n\n&amp;#x200B;\n\nA pedophile finds it acceptable to have a sexual attraction to children. Why?\n\nThe ones I've met are usually desperate men who lack communication skills. They tried their luck with girls over the age of 18 to no avail. The constant rejection, neglect and abuse that they may have endured in their life is what led them to their decision to have sexual relations with a minor.\n\nAlternatively, they could have a porn addiction, and continue to seek out more vile and dangerous things to meet their sexual desires. This is unfortunately a more common reason, and thus, I truly despise the porn industry for it enabling this behavior. The loli H-anime industry does not help either.\n\n&amp;#x200B;\n\nTheir relationship with a minor would start with someone that's a little younger than 18, probably 15-17. Then, they eventually grow deeper into their obsession.\n\nMales tend to like someone younger than them. Females tend to like someone older. That's the way life is.\n\nEventually, that pedophile ends up becoming more abusive with his power. Somewhat of a \"fuck it\" moment, as they're already doing something illegal to begin with.\n\nThey move to an even lower age. An age to where they can easily manipulate them to do whatever they please. Someone under 13.\n\nThat addiction continues, and continues, and eventually turns into a full blown case of \"this dude is extremely dangerous to children\".\n\n&amp;#x200B;\n\nThat is where kidnapping starts, then rape, then murder.\n\nThen they're either arrested or end up killing themselves.\n\nAnd thus, the cycle of a pedophile is complete.\n\nA vile, sickening cycle.\n\n&amp;#x200B;\n\nIt is very sad that we can't help these people for their sickening fantasies. It does not help that we now live in a society where young girls are pressured through social media to look 'fleek' or 'beautiful' or what-have-you.\n\nIt's scary. Truly haunting, even.\n\nIt's a dangerous world out there.\n\nPlease protect your children. They're far more prevalent than you're lead on to believe.",
            "score": 3,
            "author": "kalanawi"
        },
        {
            "level": 0,
            "comment": "I didn’t even know pedos were being associated with the LGBTQ+ community...I- 👁👄👁",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, its disgusting. They call themselves MAPS for some reason. I have seen a Twitter account name I'm the MAP and it's a pedophile with the map from Dora as his picture",
                    "score": 5,
                    "author": "Hi1mKai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sometimes I wonder why people exist",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To wonder why people exist.",
                                    "score": 3,
                                    "author": "LackIsotopeLithium7"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They aren't.",
                    "score": 2,
                    "author": "bluecrowned",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well yea ik, It supposed to mean how I didn't know people actually associated pedos with the LGBTQ+ community",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "all pedophiles should get the death penalty honestly",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, chemical castration is better.",
                    "score": 0,
                    "author": "dr_Kfromchanged",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Obviously I disagree so I don’t know why you’re replying to me. Pedos are so disgusting that I think they don’t deserve to live a semi comfortable or normal life after raping a child. It should be the death penalty, especially for pedos who rape infants. They just don’t deserve to be alive after that.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah but death penalty is bad for the economy, and can cause prosecution against the government, werea with chemical castration you keep the individual alive while being sure he wont do s-it",
                                    "score": 0,
                                    "author": "dr_Kfromchanged",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t give a fuck about the economy when it comes to pedophiles. Money is money they print more everyday, there’s billions and billions of dollars out there. Pedophiles literally rape babies and you want to keep them around? For what, some money? That’s disgusting dude. Chemical castration doesn’t always work, there is no guarantee that they “won’t do shit.” They still have hands even if their dick won’t stand up. There are female pedophiles that use their hands and objects. There are reoffenders after chemical castration. There are pedophiles living more than comfortable lives right now and they don’t deserve all the chances that the government gives them. I don’t know why you’re defending them. This makes you look like a pedophile sympathizer. Especially because this post is 160 days old. So stop trying to convince me that pedophile lives are worth something or worth reforming. You’re wrong. They are the absolute scum of the earth and should be put to death. The world would be a better place if they weren’t around. Probably would be a better place because less infants would be raped.",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I didnt sympathize them, and trust me i dont think their life are worth something. Chemical castration can if done by certain way, assure to completely erase all libido and sex drive",
                                                    "score": 0,
                                                    "author": "dr_Kfromchanged",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[There are reoffenders after castration ](http://jaapl.org/content/33/1/16)",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Not true and releasing sex offenders back into their communities after castration is just a guarantee that more kids will get raped and be victims. It might be less kids because they are castrated but there will still be some victims.",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In case my writing is going to invite misunderstanding, I'd like to emphasize that my point being that I want to help rehabilitate non-acting pedophiles and at the same time I fully support prosecuting child rapists and molestors to the full extend of the law.\n\nNow, I'd like to begin with the problem that I see in this pedophile problem.\n\nPedophiles are not the same as Child Molestors\n---------------------------------------------------------------------------\n1) Pedophiles are mentally ill people who have sexual attraction to minors.\n\n2) Child rapists / molestors are people who act on their sexual attraction on minors.\n\nPedophilia is an illness. And \"pedophiles\" are people with said illness. And the non-acting ones? they need help.\n\nThe people who have pedophilia and then act on their sexual desires, on the other hand, should be called the real name of what they should be called - \"child rapists\" and \"child molestors\".\n\nMedical Problem and Moral Problem\n------------------------------------------------------------------\nI feel that this distinction is important. Because if a person suffers pedophilia and let the medical experts know (because they know something is wrong with them and they are seeking help), they will be medically labeled as \"pedophiles\" and identified as such. And if we then demonize them, it makes us less human and condoning injustice.\n\nThe pedophiles - and I mean the non-acting ones are most likely quite aware that there is something wrong with them. But try searching up any help on the net, there's very little help offered to aid them to keep this demon under control. But there are a lot of people want them dead.\n\nI feel that as a human community, we should help these non-acting ones that are brave enough to come out to seek help - help them rehabilitate, provide proposals in how to help them stay away from children but still function in the society, and etc.\n\nPedophilia is a medical problem, not a moral one. And we should approach it as such.\n\nBut Child Rapists? They are a moral problem.\n\nThey knew they have issues. They didn't try to seek help to solve it. Instead, they go for the illegal means to do it. In other words, they had a choice to not act on it; and yet, they still do it anyway.\n\nTherefore, to deal with these ones, we should approach it as a moral problem. These ones, who pillaged and destroyed children's lives, should face the full consequences the law could dish on them. \n\nPedophiles Do Not Belong In LGBTQIA\n------------------------------------------------------------------\nAnd yes, keeping pedophilia out of LGBTQIA community is important. \n\nBecause pedophilia is an illness. Not a sexuality. And normalizing pedophilic notions shouldn't be the way we deal with it. Instead, we should deal with this by ensuring treatment is properly carried out.\n\nIndeed, there's the argument that so far our current medical tech is not capable of fully curing these people, so it's hopeless in trying to treat these people. \n\nBut as fellow compassionate human beings, I'd like to extend these questions to you all - if a patient with terminal stage cancer asked us to help him, do we opt to not give him treatment because \"it is almost impossible to cure him\"? Do we forfeit the life of an AIDS patient who still has the will to live? Do we give up and let Covid-19 kills us all? \n\nI hope your answer is \"No, we won't give up a human who needs and seeks help from us\". \n\nIMPORTANT\n----------------------------------------------------------------\nIn case my point gets missed from the long post, I'd like to stress again that I'm proposing help for Pedophiles (patients), *not for Child Rapists (criminals)*. So, if you feel that I'm defending these criminals, be assured that I am not and will never do so.",
            "score": 2,
            "author": "leon555005",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well said👏👏👏👏",
                    "score": 1,
                    "author": "Hi1mKai"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yep. I hope everyone who is willing to get help and doesn't harm anyone (ie. by consuming cp or hurting a child) receives the help they need BUT pedophiles need to stop hiding behind the LGBTQ+ labels. Don't normalize diddling kids, do not put us all into your mess. You are not welcome.",
            "score": 2,
            "author": "ilumyo"
        },
        {
            "level": 0,
            "comment": "The whole MAP Pride thing started on 4chan as a joke/anti-LGBT thing but ended up getting used by actual pedophiles. The only people that think they are a part of the community are pedophiles that want to be accepted and LGBT haters. They're never going to be a part of the community matter how hard they try. If a person with those urges gets mental help so they don't act on it then that's great and they're not a total monster, but once they actually act on it or make plans to and get caught...no sympathy. Life in jail is what they deserve but they always get out so soon and do it again.",
            "score": 2,
            "author": "Just-A-Small-Rabbit"
        },
        {
            "level": 0,
            "comment": "Pedophiles should be put down to prevent them from harming children, even if they say they won't do it or are \"non offending\" just the urge or thought is disgusting and they can't be productive members of society that way",
            "score": 2,
            "author": "natetheboneman"
        },
        {
            "level": 0,
            "comment": "I feel pity for anyone who feels attracted to a mid but if you dont isolate and get therapy for it you lose any sympathy i have. Pedos dont deserve teeth",
            "score": 1,
            "author": "mangababe"
        },
        {
            "level": 0,
            "comment": "It's common sense they shouldn't be in the LGBTQ+",
            "score": 1,
            "author": "Kobiyeet"
        },
        {
            "level": 0,
            "comment": "I guess all that granny porn is for the old men out there",
            "score": 1,
            "author": "theidiot8D"
        },
        {
            "level": 0,
            "comment": "Agreed, a guy at my work violently defends paedophiles  and it makes me feel ill listening to him.\n\nIt's baffling to know people defend them in that way. They need help but they shouldn't be part of the LGBTQ+, children are not a sexuality.",
            "score": 1,
            "author": "mumble_bee_15"
        },
        {
            "level": 0,
            "comment": "The fact people even refer to them as maps makes me worried for the future since people are so quick to be respectful to pedophiles",
            "score": 1,
            "author": "falsemc"
        },
        {
            "level": 0,
            "comment": "Twitter is full of these people and it's scary.\n\n I get some people have adult content on twitter, but I unfortunately stumbled across under 18 sexual content of MINORS. These minors literally think the sexual content they post is only being seen by other minors... It makes me sad",
            "score": 1,
            "author": "hiroshimasfoot"
        },
        {
            "level": 0,
            "comment": "Honestly the only people trying to involve pedophiles in the LGBTQ+ community are other pedophiles.\n\nThis whole idea was just some sick joke started on 4chan and was used as a weapon for homophobes to justify their hate for lgbt people in other ways.",
            "score": 1,
            "author": "BeachPeachMcgee"
        },
        {
            "level": 0,
            "comment": "So this isn’t related to the rant, but... I’ve never seen LGBTQIA before only LGBTQ. Can someone tell me what the “IA” stands for? I just want to try to stay educated so I won’t be ignorant to friends/family.",
            "score": 1,
            "author": "Hades1115",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 1,
                            "author": "Hades1115"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree. Pedophiles are NOT normal people. It’s a mental illness and most of them have antisocial personality disorder.",
            "score": 1,
            "author": "Nearby_Ad_355"
        },
        {
            "level": 0,
            "comment": "I don't think anyone in their right mind is trying to associate the LGBTQ2S+ community with pedophilia. I know there were some fake social media images advocating for the addition and acceptance making it LGBTGP+ ... but those were created by anti-LGBTQ2S+ groups to cause more hate towards people in those groups. Which is sad. It was the same BS that went its rounds on social media with photos of posters supposedly created by Muslims in a suburban area asking people to please get rid of their pet dogs because they were offensive to members of the Muslim community - the goal there being to make more people hate Muslims.   \nSome people just have way to much time on their hands.",
            "score": 1,
            "author": "CantChooseAFandom69"
        },
        {
            "level": 0,
            "comment": "Most pedophiles are gay",
            "score": 1,
            "author": "raskolnikov196"
        },
        {
            "level": 0,
            "comment": "EW MAPS ARE DISGUSTING I WILL NEVER SAY THEIR VALID THEY ARE P3DOS",
            "score": 1,
            "author": "Genocidde--"
        },
        {
            "level": 0,
            "comment": "Whatever sweetie your a 🧚‍♂️✨MAP PHOBE🧚‍♂️✨",
            "score": 1,
            "author": "nann3887"
        },
        {
            "level": 0,
            "comment": "I think “MAPs” get more attention by people complaining about them rather than actual MAP people. I’ve never seen a single one or a single article about them normalizing it but I’ve seen dozens of posts complaining about them.",
            "score": 1,
            "author": "Energy4Kaiser"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What would be the motive the report the comment? No reason fit in saying pédophilia is good",
                    "score": 1,
                    "author": "dr_Kfromchanged"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Um there are plenty of them in nature, I agree it is bad, but you can't disregard what studies there are. \n\nShould the have a place in LGBTQ, absolutely not, they are a separate group. If the LGBTQ starts to include ALL different sexual identities then we'll send up with a 'clusterfuck' .",
            "score": -3,
            "author": "JDreams89",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know people have the thoughts and know most dont act on it. I know the studies and I dont disregard it but to say you have attraction to children isnt something you should say.",
                    "score": 11,
                    "author": "Hi1mKai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree, especially as a survivor of sexual abuse throughout the first few years of her life. I will be honest, it is very hard for me to be sympathetic. I think if it’s truly something that can’t be helped, then their shit out of luck because they have to live their lives finding ways to not act upon it; however, I do believe that therapy can damn near cure them.\n\nIn my childhood, I had to reconcile and learn not to engage in that behavior as a perpetrator. Not all the abuse was painful or immediately traumatizing. When I was a toddler, I would try and be sexual with other kids. I did not know that it wasn’t normal. So, with that experience and then being counseled for it in my later teen years, I learned a lot about the self.\n\nPedophiles were abused themselves, they learned to get satisfaction and a thrill from children. Therapy and really unpacking their own traumas and abuse will mostly likely reveal that children are a surrogate. They may spend the rest of their life being able to picture a child sexually, but that won’t be a desire any longer considering they gain nothing. Because truly sexually abusing a child gives you nothing.",
                            "score": 4,
                            "author": "phunnymaat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "TW for my response, I don’t wanna trigger you into any bad thoughts, so please take care while reading this. It’s not meant to be a malicious correction either— just an overall response.\n\n\nI’m sorry, but not all pedophiles were abused themselves. There’s a chunk that have been, but those folks can helped via therapy, through methods to help them reconcile their past with their feelings and to learn not to hurt kids.\n\nBut there’s also a chunk of pedophiles who aren’t doing it because of a misguided attraction they learned as a child. There’s a chunk who are doing it because it gives them power over something smaller, more dependent, and entirely less capable than they are. More often than not, it’s entirely based off of /just/ that, it’s the power trip that does it for them— not the kid themselves.\n\nThis was one of the things I had to learn as a survivor. It wasn’t me and was never me, because someone had decided that I, a child, was the perfect target. Not an attraction, not genuinely wanting to be with me— which is still a crime nonetheless— but because they wanted to hurt and harm me to feel like they were better. There’s multiple forms of offending pedophiles and this is one of the major ones. Otherwise, it’s down to how their brain chemistry is wired, in which case they should quite frankly be chemically/medically castrated.",
                                    "score": 4,
                                    "author": "RogueApollo01",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you for your compassion and trigger warning. I appreciate your comment, I definitely haven’t ever looked up much research on pedophilia.\n\nYou are right. I understand the power dynamic, that’s what I was referring to with children being surrogates. Because regardless, the child is meant to give them something. Thrill, power, whatever they feel they need to be validated in someway.\n\nI think it should be seen as a mental disease through and through. Mostly because it’s just dangerous. And pedophiles are all different, and are the way they are for different reasons. I just don’t want any more children to be hurt than they already are. Because it’s so common and rampant, and I genuinely think it should be seen as a disease. Because to me it is.",
                                            "score": 2,
                                            "author": "phunnymaat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I definitely agree that it should be seen as a mental illness, but unfortunately the push for it to be seen as a sexuality is so rampant that it’s actually quite hard to advocate for these people to get help. They sit in echo-chambers saying the entire world is against them (because, for the most part, no sane person thinks it’s normal or acceptable), and then are more likely to offend because they each convince one another that what they’re doing is fine. Quite honestly, I just personally believe that there needs to be some kind of way to remove these people from the vicinity of children. There are offenders on my street and one street away— previously convicted— who live within 3 blocks of a school, a library with a playground, and on a street with at least 5 families of children on them. \n\nOur system is meant to favor them, especially because their sentencings are never all that harsh.",
                                                    "score": 3,
                                                    "author": "RogueApollo01",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wow, seriously thanks for sharing. I am going to do more research. I have healed a lot from my past, and I kind of left it all behind because you’re right, sane people don’t fuck with that. And I feel like I’ve kind of forgotten about this side of life ya know. Truly, I appreciate it. It’s giving me a call to action, and with shit like this we all need to come together. Because they definitely are and will.",
                                                            "score": 2,
                                                            "author": "phunnymaat",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just make sure you take care of yourself also. Don’t over expose yourself to stuff that could be bad for your mental health, and be kind to yourself. You are already a survivor, you deserve reprieve from dealing with all this.",
                                                                    "score": 2,
                                                                    "author": "RogueApollo01",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thank you. I do enjoy stepping away, but I will practice mindfulness. 🤍",
                                                                            "score": 1,
                                                                            "author": "phunnymaat"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sexuality is based around sex and gender, which is perfectly fine because anyone of any sex or gender can consent to almost anything because they are adults. Anything not involving sex or gender is considered a fetish, and the fetish around children is considered disgusting because children can't consent. It is genuinely identical to the difference between sex and rape, you absolute shitbag.",
                    "score": 3,
                    "author": "onewingedangel3"
                },
                {
                    "level": 1,
                    "comment": "Ur out here defending pedos dude",
                    "score": 8,
                    "author": "bluecrowned",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No it's not, this is literally about pedophiles my man. Pick your battles",
                                    "score": 1,
                                    "author": "bluecrowned",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're against them, I never said you weren't, but you're trying to defend them against being called disgusting and calling us hypocrites. Do you not understand how bad that looks?",
                                                    "score": 1,
                                                    "author": "bluecrowned"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Being a pedophile isn't a sexual preference?  There's a huge difference between CONSENTING adults and an adult preying on a child?  How could you even make this comment and not be absolutely void of common sense or how people would react to it?\n\nLGBTQ+ isn't a community that \"revolves around whining\".  Its support for people who want to be around others who share their gender/sexual views and feelings.  For people who have had sometimes traumatic experiences because of their gender identity or sexuality.  \n\nHAVING CHILDREN AS A SEXUAL PREFERENCE IS DISGUSTING.  It doesn't make anyone hypocritical to say that.  Pedophiles are disgusting.",
                    "score": 1,
                    "author": "CokeinUphurrkut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not agreeing with the other person, nor agreeing with your emotional arguments, but Pedophilia is very similar, scientifically, to sexual orientation. That doesn’t mean it’s okay or valid, it’s just a definition used in science to understand where these feelings come from.",
                            "score": 1,
                            "author": "Energy4Kaiser",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I get that, but calling people hypocrites over this issue is ridiculous when fundamentally there's a world of difference between consenting adults and an adult with a child.  Especially when we're talking about people who are trying to normalize pedophilia.  \n\nTrigger warning for the rest of my comment here:\n\nAnd it is a topic I'm emotional about, I think it's a topic that many people are.  But personally, I have an older half brother who was in prison most of my life for sexually molesting a child.  I read the transcripts of what he did to a girl who was the same age as me at the time.  Like, not even ten years old and the things he did to her were terrible.  It could have been me, but he was 12 years older than me and didn't live with us for other reasons.  I hate pedophiles and am disgusted by them.  Maybe some of them are decent people who never act out on their urges and work to control them, fine whatever.  But these people who are trying to normalize it are monsters, in my opinion.",
                                    "score": 1,
                                    "author": "CokeinUphurrkut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Again, don’t agree with his “hypocrite” crap, just pointing out the scientific similarities.",
                                            "score": 1,
                                            "author": "Energy4Kaiser"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sexuality is just that: about biological sex. There's also romantic attraction which focuses more on someone's gender identity, but any sort of attraction outside of sex and gender is nothing more than a fetish.",
            "score": -1,
            "author": "onewingedangel3"
        },
        {
            "level": 0,
            "comment": "I haven’t met a single person who thinks maps should be part of the lgbtqia community (even with me being trans and meeting a lot more lgbtqia people than most people) I’ve only seen stuff on Twitter and holy shit when I see posts made by those fucking pedophiles I think it’s the most I’ve ever wanted to just fucking punch someone in the nose",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Cannot agree more. LGBTQ+ is about consensual, fully informed, and fully developed partners. A child cannot consent as they don't know what's happening. They are NOT fully informed. And they are NOT fully developed! There are fully grown adults out there who cannot bear children because a pedophile destroyed any chance of that happening when they were children!\nFuck pedophiles, and fuck rapists.",
            "score": 1,
            "author": "Winter-Seat5248"
        },
        {
            "level": 0,
            "comment": "These sicko create othe names to disguise, such as pears (Pro expression anti repression? My a-s, more like pro-rape antt consent) and intentionally make their flags look a lot like other flags",
            "score": 1,
            "author": "dr_Kfromchanged"
        },
        {
            "level": 0,
            "comment": "Also zoophile also tried to insert themselve in the lgbt community, calling themselve \"zoo\"",
            "score": 1,
            "author": "dr_Kfromchanged"
        }
    ]
}