{
    "id": "se7xyr",
    "score": 602,
    "title": "it's weird that Euphoria frequently and graphically and repeatedly shows underage people fucking!!",
    "author": "[deleted]",
    "date": 1643315636.0,
    "url": "https://www.reddit.com/r/Vent/comments/se7xyr",
    "media_urls": [],
    "other_urls": [],
    "postText": "and even nude so frequently. i understand teenagers have sex, i understand that it's an important part of the show's story, blah blah blah. \n\nmy issue is the frequency and the intensity of the sex scenes. loooong graphic scenes. they showed a completely nude 15 year old after sex. they don't have to show all that... they never do. there are ways to imply sex definitely happened without that degree of graphic. there are ways to discuss nudity in the show without showing a bunch of 16-17 yr olds dicks flopping around. \n\nwhen i post about this on the Euphoria subreddit, people defend the show and are annoyed i would bring it up.. okay then. thats why i am venting here. it's concerning as fuck. the media seems focused on the drug use in the show and im like... WE ARENT GONNA TALK ABOUT THE UNDERAGE PEOPLE FUCKING CONSTANTLY?? OKAY!",
    "comments": [
        {
            "level": 0,
            "comment": "Because sex sells, honestly that's the only reason.",
            "score": 265,
            "author": "Waste-Win",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah, it’s because sex is a big part of high school life for some people, and particularly for the characters that are being explored in the show. To omit or censor sex would be a dishonest portrayal of the story that is trying to be told. Sex does sell but it also can have a purpose in art beyond just being used for attention.",
                    "score": 50,
                    "author": "exceptionallysweaty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So what doesn’t mean you have to show it like we all know it happens in high school that doesn’t mean you should be showing kids fucking",
                            "score": 56,
                            "author": "VoreWhoreUwU",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "we all know drug use happens too, should they stop showing that?",
                                    "score": 1,
                                    "author": "huntersace"
                                },
                                {
                                    "level": 3,
                                    "comment": "First of all they’re are not kids, the actors who are nude are all of age. Second, as I mentioned in my original comment, omitting these parts specifically because people are afraid to see sex is an unfaithful telling of the story that was originally trying to be told. If you don’t want to see sex then don’t watch it 🤷‍♂️, but it is explored in a very emotionally intelligent and interesting way throughout the show and should not be discounted just because “we all know it happens”. We all know drugs happen, friendships happen, love happens, but all good stories show how these phenomena can deeply effect the people involved.",
                                    "score": 1,
                                    "author": "exceptionallysweaty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No people just don’t like watching kids fuck",
                                            "score": 1,
                                            "author": "VoreWhoreUwU",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They’re not kids, they play teenagers but they’re all adults consenting to the use of the footage in the show.",
                                                    "score": 1,
                                                    "author": "exceptionallysweaty",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s concerning you can’t see why people don’t like it",
                                                            "score": 1,
                                                            "author": "VoreWhoreUwU",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I can understand why people don’t like it, however I think it is a misguided view that could lead to censorship of important stories.",
                                                                    "score": 1,
                                                                    "author": "exceptionallysweaty"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Literally everyone watching understands that all the actors are 30+. We get it man, you're having uncomfortable visions in your head, but that doesn't mean everyone else is and the world doesn't revolve around you 🤷🏽‍♂️",
                                                    "score": 1,
                                                    "author": "pyroclasm1"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So I can assume you believe rape scenes are necessary because it may be needed because it could correctly show the situation compared to if you were to imply it happening?",
                                            "score": 1,
                                            "author": "oldrabidhobo24",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sometimes it is necessary to show the deeply traumatic experience for the audience to understand how horrific it can be, a prime example would be “The Last Duel” directed by Ridley Scott. This movie has a rape scene that is necessary to the plot. If you don’t want to see these things then don’t watch the media, but it is still a part of life and therefore should be explored in art.",
                                                    "score": 1,
                                                    "author": "exceptionallysweaty"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; sex is a big part of high school life for some people\n\nWhat high school did these people go to?",
                            "score": 48,
                            "author": "sunshinelink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Literally I didn’t have sex until college (spoiler alert it was bad the first time) and I hear my friends brother hooking up with someone as a freshman in high school and by the way he said it made it seem like he was doing it in middle school…in high school I did theater and had a secret gf that was about it",
                                    "score": 27,
                                    "author": "rinafanthom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 24,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Take some life advice from a now college drop out. If you do hookups, do it with a friend not some random hot person. Or don’t at all even. You’re still young and enjoying college go stay up late, ask out a girl or guy you may like enjoy prom. I missed out on a lot of that and went to college only to make up for it. High school is stressful but worth the memories",
                                                    "score": 11,
                                                    "author": "rinafanthom",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I forget about other cultures being in america haha. But ofc! Take it from someone with a traumatic four years in high school from home and mental health life just enjoy being a kid. Adulting is shitty",
                                                                    "score": 5,
                                                                    "author": "rinafanthom",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 5,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Adulting as in I’m in so much debt because I did college out of state to escape my old household and now I have to be responsible and work on paying it back, getting my license and a car, therapy, ugh. It’s not much fun out here.\n\nAnd how is high school where you are? Do you have any parties similar to prom at all? Im so curious by other countries and it ranges from regions.",
                                                                                    "score": 2,
                                                                                    "author": "rinafanthom",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "India?",
                                                                    "score": 1,
                                                                    "author": "savorie"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The charakters are mostly 17-years old. Most people in western countries have sex for the first time between 15 and 19.",
                                    "score": 2,
                                    "author": "SpecialMitra",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is immensely incorrect.",
                                            "score": 0,
                                            "author": "sunshinelink",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "While not Between 15 and 19. the Average age is 17.4 Years old in America meaning if the characters are indeed 17 they are at the average age for Americans.",
                                                    "score": 3,
                                                    "author": "Build_A_B3ar"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I lost my v card in 8th grade",
                                    "score": 1,
                                    "author": "Thecrayonbandit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I must've missed out on a lot in high school. I never had sex in high school. I guess I never really thought people had sex in high school, but I should've known. I've always been the weird autistic quiet skinny kid that doesn't talk much. \"Why are you so quiet?\", \"why are you so skinny?\" \"Do you eat? Lmao.\" \"Omg, he's soooooo skinny.\" \"You only weigh 65 lbs in 8th grade? What's your secret to staying so skinny?\" Guess what my answer was to all of that? Nothing. I ignored it. I tried my best to not let it bother me. Little did those people know, I'm autistic. Little did those people know, I have gastrointestinal issues which is very common in autistic people. Little did those people know, I want to gain weight so bad, but my low appetite and gastrointestinal problems make it extremely difficult. Oh well, I was a virgin loser in high school. I'm like that skinny loser virgin nerd kid in those high school movies. I'm still a loser. 21 year old male virgin who's never even kissed a girl. But don't worry guys, I don't hate anyone. I'm a forgiving person, but forgiving those people didn't raise my self esteem. I still have low self esteem to this day. I would love to find ways to raise my self esteem, but I don't know how. Anyone have any tips? To the person I commented this to, sorry for bothering you. You don't have to respond if you don't want to.",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey bud, I’m sorry to hear about all that, it sounds really rough. High school kids don’t understand the impact they can have on the people around them. Just remember it’s okay to feel how you’re feeling and it’s a learned defense mechanism. You’re young and the more time that goes by the better you’ll be able to deal with the conditioning that developed from these experiences. The only thing I can recommend is finding someone in real life that you can be completely open about your feelings to and allow them to try and help you, whether it be a parent, a friend, a teacher, or a therapist.",
                                    "score": 1,
                                    "author": "exceptionallysweaty"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This why I rather watch sex education though. Euphoria does talk about stuff like this. But it's often pushed out as this overdrive standard.",
                            "score": 7,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Lmao @ all the “I didn’t have sex till college and it wasn’t good” people. You’re active on Reddit, that is assumed",
                            "score": -4,
                            "author": "ImNotYourGoogle"
                        },
                        {
                            "level": 2,
                            "comment": "Is the show something they \"just need to do\"?  Like 13 reasons, was that an important and honest portrayal?  What difference would it make if they left it out?  Do they show characters being really bad at it and coping with how that goes so they can be honest about it or is it just HBO bs?",
                            "score": 1,
                            "author": "strumenle"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah but it doesn’t have any artistic purpose or function here. It’s just exaggeration. Nobody had or has 5 fuck buddies in high school.",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "I get that teenagers are exploring and sex is part of the experience growing up but the constant graphic portrayal of people who are meant to be underaged does not sit right. I'm a very sex positive person and I'm so for people having the space age freedom to explore themselves in a safe and supportive environment but euphoria is not that. Also this is a very common thing in shows to get people who are over the age as actors to play younger people so that they can have detailed sex scenes.",
                            "score": 1,
                            "author": "OkCicada9373"
                        },
                        {
                            "level": 2,
                            "comment": "You can absolutely have an implied, off screen, or even a partial nude scene(s)",
                            "score": 1,
                            "author": "eccentric-assassin"
                        },
                        {
                            "level": 2,
                            "comment": "Eating fast food is a big part of high school life for some people but I don't see a whole lot of Euphoria taking place at Burger King. The dishonest portrayal continues.",
                            "score": 1,
                            "author": "officerkondo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel you honestly. \nI’m 22F &amp; my sister is 20F, not a big age difference ofc. but shes super into this show &amp; wants me to get into it with her. I watched a couple episodes &amp; just can’t. I feel like the age range of this show is anywhere from like 16 &amp; up, &amp; I just feel like all the glorified drug use &amp; nudity is too much to see even as an adult lol. It also doesn’t help that as soon as my younger sister &amp; her boyfriend stared watching this show, they both instantly were waaaaay more interested in experimenting with new drugs.. to the point where her boyfriend had to go to the hospital from ‘experimenting’ with some harder stuff. Obviously not what an older sibling wants to see happen to their baby sister.",
            "score": 52,
            "author": "No_Finding_9441",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with everything except the glorified drug use. Rue really struggles with rehab, anxiety and does really dumb things when she’s on drugs. She ruins her relationships and says how much she hates it and how badly she wants to be clean",
                    "score": 2,
                    "author": "roachincalzone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is absolutely glorified. The amount of time focused on the bad is minimal compared to the time focused on how good drugs make her feel. \n\nEuphoria to me is an American, sexed out version of Skins (U.K. show from years ago). Skins caused a lot of damage to a lot of young people because of glorified smoking, eating disorders and sex, but it was nowhere near as graphic as euphoria. \n\nI usually don’t care much about how graphic shows are, but this is the type of show I genuinely wouldn’t want young people to see simply from how they make drugs look.",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How bad does drug use need to be portrayed to satisfy you? ALL her friends and family are furious at her drug use, she nearly dies multiple times, gets caught up in bad drug deals, almost gets killed by Mouse ECT. \n\nThe only way they \"glorify\" it is by Rue admitting drugs feel great, which is just the truth, and if anything makes the show feel more genuine and not like some over the top DARE PSA. They're not gonna have Rue just instantly OD the first episode.",
                                    "score": 1,
                                    "author": "pr0_sc0p3z_pwn_n0obz"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Man zoomers really are boomers come again.",
                    "score": 1,
                    "author": "MelisandredeMedici",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What lmao",
                            "score": 0,
                            "author": "No_Finding_9441"
                        },
                        {
                            "level": 2,
                            "comment": "Because I don’t like the show I’m a boomer? I’m confused 🤣 whatever though",
                            "score": 0,
                            "author": "No_Finding_9441",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your reasonings sound like Tippy Gore at the senate hearing for parental advisory stickers. \n\nIdc if you like anything. Your reasonings are the issue.",
                                    "score": 0,
                                    "author": "MelisandredeMedici",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cry about it",
                                            "score": 0,
                                            "author": "No_Finding_9441",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what annoys is that a lot of people will say things like “it’s an adult show!! it’s 18+!! it’s not for kids!!!”\n\nso you’re just pushing a show so adults can watch depicted teenagers have sex? doesn’t really sound to great.\nlike they’re depicting characters having sex and doing drugs that aren’t even old enough to watch the show according to them.\n\ni don’t know if people understand what i mean but the entire show just weirds me out",
            "score": 37,
            "author": "spxcedoubt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I haven't seen the second season yet but I'm gonna play devil's advocate here and a lot of people are gonna hate me.\n\nYes, as you say, it isn't a show for kids and it does depict a lot more than just adults depicting teen sex.\nBut, what makes this any worse than any other form of glorification out there? If you're so vehemently against this shouldn't you also be against shows and movies that show high levels of drug use like scarface, the wolf of wall street and pineapple express.\nWhat about shows and movies that glorify killing? RED, John wick, James Bond.\nWhat about movies that glorify torture? Savages, Saw, human centipede.\nWhat about movies that encourage massacres? Movies like world war z, resident evil, even Zombieland.\n\nWhy do you draw the line at only depictions of teen sex?\n\nWe know it's wrong, just like we know that torture is wrong, murder is wrong, drug smuggling is wrong, rape is wrong. But you choose to pick one small thing and forget the rest.\n\nIt is media, I'm pretty sure there are warnings in the intro or outro somewhere and no underage people are actually used for the explicit scenes.\n\nJust like movies that depict suicide, self harm, depression and many other mental health disorders. They have warnings.\n\nIf you're going to have an issue with one of these things, have an issue with all of them.",
                    "score": 1,
                    "author": "Bubbly_Ad_3633",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you have brain worms",
                            "score": 6,
                            "author": "fuckchickfila",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "U telling me I'm wrong?",
                                    "score": 1,
                                    "author": "Bubbly_Ad_3633"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "yeah i had this issue with riverdale too. except there the plot and writing started becoming bad too. so at a certain point i was only watching cause the actors were hot, and then i remembered they were all playing teenage characters and even though i was a teenager at the time i still felt kinda weird about it and stopped watching",
            "score": 27,
            "author": "AV8ORboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "You just exactly described my relationship with riverdale lol. Or well, ex relationship🤣",
                    "score": 2,
                    "author": "PsychologicalSpac3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have a point because I just saw a scene of Sydney Sweeny (24) and Jacob Elordi (24) and I was admittedly hot, bothered and confused. I’m telling myself “wait ew they are teenagers” but also “damn that’s so hot”.\n\nI think if they looked like actual teenagers (awkward, brace faced, baby faces) then I would be disgusted. But the fact that they look my age, I feel shame for finding them attractive because they are teens in the story…but adults in real life?¿¿?\n\n\nI can confidently say tho I never see real life teens nude and the thought of it makes me disgusted.",
            "score": 24,
            "author": "unitedstatesofLABIA",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's my problem with shows like that too. I've never seen euphoria but we should all be acutely aware in those shows that have teenagers having sex that if those \"teenagers\" really looked like teenagers it would be way weirder and more uncomfortable to watch. And most of the time those shows don't even require them to be in high school. Just bump them up to college so every time a sex scene happens I don't have to feel like a creep for seeing actors my own age pretend to have sex.",
                    "score": 3,
                    "author": "IstgUsernamesSuck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How extremely freaking odd I was having the same conversation with my bf today &amp; I completely agree. For major plot drivers to include ‘child porn is illegal ill report u to police and ruin your life’ it’s weird they depict teens having sex, which is content that kind of almost qualifies as cp, it’s just that it seems ‘okay’ because the actors are adults… it was really unnecessary also, still pretty creepy",
            "score": 67,
            "author": "Shoegarlace"
        },
        {
            "level": 0,
            "comment": "Everyone wants to say the actors are adults, but the characters aren’t. That’s the point. \n\nEven though we have adults acting as children that are acting like adults, we don’t need graphic sex scenes implying two characters who are CHILDREN had sex.",
            "score": 156,
            "author": "Throwaway56536367777",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is my big problem and why I refuse to watch. I don’t care if the actors are adults, if I’m watching a show or a movie and a character is supposed to be a teenager, then they are a teenager. Isn’t the point to not think about the actor and believe this character exists? Anyway, the characters are teenagers and it’s really fucking uncomfortable to see these teenagers nude or having graphic sex scenes. It’s the same reason Twin Peaks Fire Walk With Me left a really bad taste in my mouth, Laura and her friend are teenagers and they have a nude scene. It’s weird as fuck. I thought we as an American society look down on child pornography? So why is it ok to depict these kinds of things in TVs in movies? These characters are teens.",
                    "score": 11,
                    "author": "DopewiththeMost"
                },
                {
                    "level": 1,
                    "comment": "*Yes exactly.* Like what the hell?! How is this okay?! It doesn't matter if the actors are adults, a pedophile can now pay youtube or Hulu for professionally produced child porn and they won't get in trouble for it. Let that sink in.",
                    "score": 10,
                    "author": "possitive-ion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Look up the definition of a pedophile",
                            "score": 1,
                            "author": "Xboxone1997"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh thank Christ I thought it was another worse cuties situation. Still fucked up but this time is ppl who are adults irl. I've not seen the show but from what I'm reading/hearing I'm glad I don't watch it.",
                    "score": 5,
                    "author": "terratrooper96"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean at least it’s on a subscription channel and not on regular tv like Riverdale. It’s like every episode with that show now.",
            "score": 9,
            "author": "hippiejo"
        },
        {
            "level": 0,
            "comment": "Conditioning to make the sexualisation of children easier to bring about.",
            "score": 123,
            "author": "Lazarus_Steel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bingo",
                    "score": 28,
                    "author": "Capn_crunch49",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bongo",
                            "score": 13,
                            "author": "mindmisconception",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "bango",
                                    "score": 8,
                                    "author": "throwaway70357",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bungo",
                                            "score": 2,
                                            "author": "PsychologicalSpac3",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I dont want to leave the congo",
                                                    "score": 2,
                                                    "author": "Capn_crunch49"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i stopped watching halfway through the first episode for this exact reason lmao",
            "score": 8,
            "author": "hellokittybathsalts"
        },
        {
            "level": 0,
            "comment": "Probably because they know it’ll sell and the people behind the show are massive fucking perverts trying to make softcore porn. Like I don’t mind seeing tiddies or a dick, but now it’s just like really you’re making porn for the sake of making porn in that situation. it’s not making the show a better show and then iirc some of the people behind the show were * shocked * when Zendaya’s contract had a no nudity clause bc they know her having some naked part of her body on camera will bring in so much more money and they can try to further justify nudity to the actors",
            "score": 7,
            "author": "OnionMesh"
        },
        {
            "level": 0,
            "comment": "Most of the top shows are like this now",
            "score": 35,
            "author": "Due-Sock-4156",
            "replies": [
                {
                    "level": 1,
                    "comment": "200,000 years of human evolution, and this is where we stand........I don't even wanna think about the following generations-",
                    "score": 9,
                    "author": "SpaceMarauder4953"
                },
                {
                    "level": 1,
                    "comment": "&gt;i dont watch tv like ever so i wouldnt know :( that's gross to hear.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree! I’ve never seen the show but I’ve seen this in a couple other things and thought it was bizarre. Even if the actors are over the age of consent, we’re supposed to be viewing them as kids, so…why are we seeing them naked and fucking? I don’t get it either. I’m guessing it’s for ratings but ew.",
            "score": 17,
            "author": "lettucecropchilds"
        },
        {
            "level": 0,
            "comment": "Yes but if you say this you’re an SJW 🤦🏾‍♀️",
            "score": 17,
            "author": "noexqses"
        },
        {
            "level": 0,
            "comment": "From what ive seen it definitely shouldve been set in college, but you can't look at Alexa Demie tits and tell me that its \"basically child porn\" because shes playing a 17 year old",
            "score": 29,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah my friend and I spoke about it, like why didn’t they just set it in college?\nMaybe because the Jewels storyline would be the only sub plot that doesn’t fit in a college context?",
                    "score": 16,
                    "author": "unitedstatesofLABIA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "she couldve been a 17 year old in college or in dual enrollment i guess. being a minor is the only part relevant to her storyline i think",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No she has to be 15 for the shock value. Unfortunately some people can still reason away why it would be okay for a 17 year old “bEcAusE thEy’Re aLmOsT 18”.\n\nShe could have been the only minor tho, like someone’s sister or something.",
                                    "score": 3,
                                    "author": "unitedstatesofLABIA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i mean, it isnt \"sexualizing children\" to show a  17 year old played by a 20 year old in a tv show having sex.... guess what, 17 year olds fuck. the scene with jules and that old guy also even supposed to be hot or provoactive it was supposed to be unsettling. \n\ni dont think the majority of people watching euphoria are old guys thinking wow i love watching these little teenagers have sex. i imagine its mostly teens and young adults. it aint the biggest problem in the world",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it's not just tits they have graphic sex constantly :| and the frequency of the nudity is worrying.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think I stopped watching The Heathers for this exact reason",
                    "score": 6,
                    "author": "unitedstatesofLABIA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m guessing the actors aren’t really that age?! At least I sure as hell hope not.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, most of them are in their mid 20's. All of them 18 or older.",
                    "score": 3,
                    "author": "ShotCaller_OG",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, just as I thought.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never seen or even heard of this show. What in the actual fuck is wrong with them?",
            "score": 5,
            "author": "Dream0tcm"
        },
        {
            "level": 0,
            "comment": "It’s honestly about showing the power dynamics in the relationship, I’ve seen the show and the scenes aren’t that long, they are very extreme tho but tbh it’s about physical story telling that’s how they decided to portray those themes and it doesnt have to be that way but it is art",
            "score": 5,
            "author": "Significant_Bell582"
        },
        {
            "level": 0,
            "comment": "These same people then attack anime for the same reason",
            "score": 4,
            "author": "VoreWhoreUwU"
        },
        {
            "level": 0,
            "comment": "I like the show but I’d find it more “believable” if the characters weren’t 16. I don’t get why they couldn’t age them up",
            "score": 5,
            "author": "Kit0550"
        },
        {
            "level": 0,
            "comment": "Yes like what is this obsession",
            "score": 25,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "See… I may be a degenerate but when you say Euphoria I am thinking of a certain animated show and I don’t think this is what is being discussed here and I am both confused and afraid",
            "score": 14,
            "author": "Sazbadashie",
            "replies": [
                {
                    "level": 1,
                    "comment": "euphoria on hbo",
                    "score": 7,
                    "author": "AV8ORboi"
                },
                {
                    "level": 1,
                    "comment": "Bonk",
                    "score": 4,
                    "author": "2dGoob"
                },
                {
                    "level": 1,
                    "comment": "this entire post read very confusingly as ive only watched the wrong one but know the other exists by name only\n\nthis reads like a live action adaptation.... ono",
                    "score": 4,
                    "author": "polaropossum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did the searching for you... it is not, it's a drama of sorts on HBO from what I gathered.",
                            "score": 1,
                            "author": "Sazbadashie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is the reason i can’t get into the show. even if the actors ain’t minors, its still super gross and uncomfortable for me to have characters that are supposed to be minors depicted that way. like you said, there’s so many ways to show someone has had sex with graphicness. unfortunately sex sells",
            "score": 3,
            "author": "javanoose"
        },
        {
            "level": 0,
            "comment": "Not to mention the glorification of drug and party and sex culture in teenagers... I haven't watched the show but I have heard a lot about it and especially on TikTok - which has a large youth posting. I don't have much to say because I don't want to say anything disrespectful to any groups and above all else I'm a huge fan of harm reduction and people experimenting safely with various things in their life but 100% I don't think that this show is a good influence in a lot of people's lives. Especially young women and girls.",
            "score": 11,
            "author": "chanceywhatever13",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to say out of all the shows about drugs that are out there, in my opinion Euphoria does a good job of showing that being an addict is not glamorous and fun. It’s not “just” weed, it also leads to many life threatening events. Ruins lives and has a lot of shame. I think the show at least does a good job of showing that compared to US rappers that make drugs sound like a normal thing to do and a good time. Example: trap music, future’s song “Mask off”",
                    "score": 14,
                    "author": "unitedstatesofLABIA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like this take. A large subplot of the show is Rue's struggle with addiction. I'm not saying that drugs *aren't glamorized in the show, but it definitely does a better job of showing the other half of the coin than a lot of other media.",
                            "score": 4,
                            "author": "notjordansime"
                        },
                        {
                            "level": 2,
                            "comment": "I'm glad to hear that perspective. Like I said, I haven't watched it. But- I have seen loads of young girls comparing themselves to characters and dressing up like them and reenacting scenes and stuff. It just doesn't seem right to me but I was interested in some toxic media when I was younger, it's how we all learn. I probably shouldn't have read 13 Reasons Why at like, 8, or watched the show at like, 14, either. Things happen, I just hope these kids grow up okay.",
                            "score": 2,
                            "author": "chanceywhatever13"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, sex sells. It’s sad that they portray literal kids (not the actors themselves but the characters they’re portraying) like this, but honestly what can you do about it? People will do this shit for money, it’s life.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah it’s strange. As a 25 year old I find myself and my friends talking about how it makes us somewhat uncomfortable but at the same time for me and a looooooooooooooot of kids I went to high school with/young adults I met in college this was pretty close to our experience. It’s raw, it’s real, and it makes some people uncomfortable because they would *never* imagine their kids doing anything close to what these kids in the show do. \n\n\nThat being said of course this is far from many peoples high school experiences but I appreciate it because it was close to mine.",
            "score": 5,
            "author": "Dwn2MarsGirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. I'm not saying that I'm not conflicted by some aspects of the show, but a lot of it was oddly relatable. I liked how you put it, raw, real, and I'd also add jarring. It goes out of its way to make you feel uncomfortable because *that's* what the teenage experience is in a way; discomfort with your current situation.",
                    "score": 4,
                    "author": "notjordansime"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ew gross! i haven't seen this show but i've seen movies and shows where there is teenage sex and masturbation and nudity and stuff, and I feel like its gross. unless there is some real need for it plot-wise, why do it? what is the purpose? of course its because sex sells, but gross. i've literally turned movies off because of it",
            "score": 5,
            "author": "pandaappleblossom"
        },
        {
            "level": 0,
            "comment": "Agreed with every word. Honestly I don’t see the point of any sex scene, I never have, I usually skip through them. The Vampire Diaries was one of the worst ones, I loved that show when I was in high school but the amount of sex scenes were actually absurd. For me, it’s uncomfortable to watch and implying it is so easy I can only think of two reasons why its shown so commonly;\n\n1. Creepy ass directors and producers\n2. Filler to extend watch time \n\nI don’t think I’ve ever heard anyone rave about how much they loved a sex scene, not online or irl. As a viewer, it has no value to me and the actors don’t like it either. That’s why top earning actors usually have a no nudity clause in their contract. Even if they’re shown as nude on screen, it’s probably a body double. \n\nSo, it’s exploitative as all hell cause then the auditions available to lower earning actors will often REQUIRE nudity. Which leaves few options other than be uncomfortable - or even traumatized - just to get paycheck and “exposure” or “experience”. All that just because they can’t afford a legal team and management to protect them. \n\nThen add in the fact that the characters are fresh out the womb and I’m truly nauseated. I didn’t even finish the first episode of euphoria which bums me out a bit.  Most of it looks so interesting and Zendaya is one of favorite actresses but I just couldn’t sit through the scene of the blonde girl in the motel. Stories of grooming do not ever NEED to be portrayed that way.",
            "score": 2,
            "author": "ramenupmy----"
        },
        {
            "level": 0,
            "comment": "It's to normalize sexuality of children and pedophilia like many other things being shown in media today.",
            "score": 2,
            "author": "firstorbit"
        },
        {
            "level": 0,
            "comment": "Bro this show is made entirely to cater to the crowd of high school kids that think it’s cool and edgy to do drugs and have sex. In a year, this shows views will plummet because they’re all gonna move on to the next hype train.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I really love the cinematography and the whole aesthetic and vibe with costumes, makeup and that is enough for me to kind of ignore some of the mediocre acting and a strange plot but the nudity and hypersexulity in this show is so unnecessary and too much for me. I literally have to skip those scenes.",
            "score": 2,
            "author": "bobalka"
        },
        {
            "level": 0,
            "comment": "I’ve been saying this for a while 👆",
            "score": 2,
            "author": "Apple_Soda"
        },
        {
            "level": 0,
            "comment": "Because the actors are adults acting in a tv show about teenagers",
            "score": 13,
            "author": "chefmelinhell"
        },
        {
            "level": 0,
            "comment": "As a teenager, I do love euphoria. But it's very exaggerated. Like sex is a normal part of teenage life, but it's not every day though. Usually, it's very awkward and usually, you're pressured to do it. Season 2 is ok so far. I've lost interest in the series though. Idk why. \n\n\nI rather watch sex education honestly. Lol",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That might be how teenage sex has been for you, but that’s not to say it’s like that for everyone all the time.  Many many people have amazing, kinky, naughty, FUN sex as teenagers.  With multiple people.  Even with multiple people AT THE SAME TIME.  Because they want to and they like it and it’s not awkward and the haven’t been pressured into it.  Mind blowing I know, that not everyone’s experience is the same.",
                    "score": 1,
                    "author": "Health_Love_Life",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's true. Lol I guess I feel like I've been missing out but everyone experience is different. :)",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yea definitely fucking weird",
            "score": 1,
            "author": "neonx18"
        },
        {
            "level": 0,
            "comment": "I doubt you want to hear this but...\n\nALL of the actors who do nude &amp; sexual scenes are ADULTS. No minors are getting naked. That's definitely ILLEGAL. I don't know how old you are, but sex amongst teenagers is actually a thing in real life. Most of the adults I know started having sex around age 15. As a member of that sub, it is annoying when people complain about the nudity &amp; sex because people that complain about it act as if these people aren't fully grown adults who are simply playing the role of a teenager. \n\nYou're not being forced to watch the show &amp; there are multiple warnings right before the show starts. It's a rated R show on HBO for goodness sake. This isn't a new trend for HBO, its been this way for decades. Why continue to watch something you have such an issue with? That sub is for fans of the show. There's nothing wrong with criticism, but seeing people constantly complaining about a show they're choosing to watch in a sub dedicated to said show, is pretty irritating when you can simply not watch it, move on with your life, &amp; just let those who enjoy it, do so in peace.",
            "score": -18,
            "author": "_TestTubeBaby_",
            "replies": [
                {
                    "level": 1,
                    "comment": "the point is that the CHARACTERS are minors and that’s what makes it wrong. we all know teens are having sex. they can just imply that they are in the show instead of it being a full on soft core porn video. the sex/nude scenes are unnecessary anyway most of the time, they throw them in for shock value",
                    "score": 26,
                    "author": "nikeelitesbelike",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The point is, no actual minors are nude in the show yet OP is acting as if they are. Downvote me all you people want but I stand by what I said and I'll say it again. It's ridiculous to go onto a sub dedicated to a show, just to complain about the nudity in that R-rated show that literally warns you that there will be nudity before it begins and then complain about people on the sub being annoyed over your complaints. Simply don't watch the show. That's like me not liking the color blue yet I continue to buy &amp; wear clothes that are blue. It makes no sense.\n\n The majority of us don't  watch the show, see a nude scene and think \"oh they're showing minors naked!\" Because we know it's a SHOW &amp; the actors are adults. The show is about teens abusing drugs, alcohol,  being promiscuous and all of the issues it causes, so it shows those exact things. It isn't a show about implying those things. If they wanted to imply, they wouldn't have it on a channel you have to pay for a subscription to watch.",
                            "score": -12,
                            "author": "_TestTubeBaby_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i get that OP didn’t explicitly state that the characters are minors, NOT the actors. \n\noh my goddd we know we don’t have to watch the show, but that doesn’t mean we need to turn a blind eye to the real issue here 😭what is the problem with implication anyway? does a sex scene REALLY add that much value to anything? like is it truly necessary…. when they could literally get the point across by implying that the characters are fucking…. there are literal outlets like pornhub lmao why are you going so hard for HBO Max",
                                    "score": 6,
                                    "author": "nikeelitesbelike",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "HBO has been doing this for decades. Why would they stop just because it makes some people uncomfortable? People like the OP who literally have the word \"horny\" in their username? People pick the weirdest shit to get offended over.",
                                            "score": -12,
                                            "author": "_TestTubeBaby_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You know there are some serial killers that have been murdering for decades, why should they stop just because a cop found out and they got angry about it?\n\n\nDo you see your argument?\n\n\nDo you see how stupid your argument is?",
                                                    "score": 6,
                                                    "author": "NakedBaconSalad",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "they don’t 😭",
                                                            "score": 2,
                                                            "author": "nikeelitesbelike",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You know slavery happened for more than a few decades\n\n\n\nWhat you think to some people disagreed with its slavery would just stop?\n\n\nCivil war? That never happened.\n\n\nI'm just saying the argument of something that has happened for decades so it's not going to stop is a stupid argument",
                                                                    "score": 0,
                                                                    "author": "NakedBaconSalad",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Are you kidding me right now? First murder, now slavery? Something is fundamentally wrong with you.",
                                                                            "score": -1,
                                                                            "author": "_TestTubeBaby_",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You don't actually understand the point\n\n\n\nAnd that's extremely sad\n\n\nPeople like you are completely fine with pedophiles having jack off material and eventually being bold enough to go out and assault people.\n\n\nPeople will start thinking it's fine to view underage people in this light if things like this are completely normalized\n\n\nYou're probably one of those people that think MAPs should be accepted into the LGBTQ+ community",
                                                                                    "score": 2,
                                                                                    "author": "NakedBaconSalad",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You're comparing MURDER to a TELEVISION NETWORK  you don't HAVE to purchase and watch... I'm pretty certain that murder victims don't volunteer to be murder victims. \n\nDo you see your comparison?\n\nDo you see how stupid your comparison is?",
                                                            "score": 1,
                                                            "author": "_TestTubeBaby_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It wasn't a comparison\n\n\nIt was to illustrate just because someone has been doing something for a long time does not make it any less horrible than if they just started doing it yesterday.\n\n\nYou cannot justify things so you pick and choose to straw man arguments that I am not proposing.",
                                                                    "score": 1,
                                                                    "author": "NakedBaconSalad",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It most definitely is a comparison. You don't know what a comparison is?",
                                                                            "score": 0,
                                                                            "author": "_TestTubeBaby_"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How is it wrong? Like explain",
                            "score": 1,
                            "author": "Xboxone1997"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You shouldn't have characters having sex that aren't in the universe canonically old enough to watch the show....\n\nIf they are supposed to be 15 years old and having sex but it hasn't R rating which means anyone under 18 shouldn't watch it....\n\n\nDO YOU SEE HOW STUPID THAT SOUNDS????",
                    "score": 6,
                    "author": "NakedBaconSalad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's a SHOW. The characters don't actually exist. Are you insane?",
                            "score": -1,
                            "author": "_TestTubeBaby_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love how you don't try to refute my argument because you can't.\n\n\nYou just throw ad hominems \"are you insane?\"\n\n\nNo they don't exist but they represent something that does exist.\n\n\nIn horror movies people don't actually die but you also don't want a 5-year-old watching a woman be beaten to death in a movie.",
                                    "score": 2,
                                    "author": "NakedBaconSalad",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You don't have a valid argument to refute. You asked a stupid question which I chose to ignore.",
                                            "score": -1,
                                            "author": "_TestTubeBaby_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "ignorance is bliss i suppose",
                                                    "score": 2,
                                                    "author": "nikeelitesbelike",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Then you must be blissful.",
                                                            "score": 0,
                                                            "author": "_TestTubeBaby_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "okay test tube baby 🤞",
                                                                    "score": 1,
                                                                    "author": "nikeelitesbelike",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm glad you can read?",
                                                                            "score": 0,
                                                                            "author": "_TestTubeBaby_"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You get it they be working and teenagers be fucking",
                    "score": -13,
                    "author": "chefmelinhell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's so ridiculous to get upset over a show on a network known for its R-rated shows, because fictional characters played by grown adults are naked, then to complain because the people on the sub dedicated to that same show are over people complaining about it. Don't like it, don't watch it. Simple solution to a ridiculous \"problem\".",
                            "score": -5,
                            "author": "_TestTubeBaby_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "id honestly not waste time arguing with OP. i get vibes that they themselves are a minor and want to feel like they’re making a difference, as a lot of teenagers do now",
                                    "score": -8,
                                    "author": "YungNeroNero"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "THANK YOU!! I said this to my friends with shows like Chilling Adventures of Sabrina and they just said “lol yeah but the ACTORS aren’t really teenagers 🙄” and like, yeah sure, but they were casted as teens for a reason!! They look like teens, they’re portraying teens. \nEuphoria is on another level though. It’s weird watching a show about teenagers that I don’t feel like is meant to be watched by teenagers.. I’ve also heard no one but me say a thing about all the graphic teen sex either. And when others ask me about the show and if they should watch it, I always tell them to watch it alone to avoid being uncomfortable.",
            "score": 1,
            "author": "hailzing"
        },
        {
            "level": 0,
            "comment": "sex isnt disgusting. sex can be so beautiful and portraying it in cinema as euphoria does can be so amazing. teenagers have sex, and if the actors were underage it would be a problem but theyre not so i don't see exactly what the issue is?",
            "score": 1,
            "author": "relatingtoneilperry"
        },
        {
            "level": 0,
            "comment": "Do you guys think 17 year olds don't have sex?",
            "score": 1,
            "author": "andrecinno",
            "replies": [
                {
                    "level": 1,
                    "comment": "did you read the second sentence of this post?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did, and it doesn't really matter, because it's adult actors... Whether you show it or not, it doesn't change much. At least to me.",
                            "score": 1,
                            "author": "andrecinno"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "umm.. well frankly I'm good with underaged people fucking.  Sex happens.    \n\n\nI am however... seriously not good with it being on TV.  That's fucked up.",
            "score": -2,
            "author": "Beasagdeux"
        },
        {
            "level": 0,
            "comment": "Haven't heard of this show but let me guess, Netflix? It's weird how liberal platforms always end up going the CP route 🥴 first Cuties now this",
            "score": -2,
            "author": "Leviathan_Lovecraft"
        },
        {
            "level": 0,
            "comment": "They are just fictional characters played by grown adults\n\nGet over it.",
            "score": -2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Euphoria literally made me as a 17 year old want to seek out sex with older men. So I did 🤷🏽‍♀️\n\nEdit: I wanted to do it anyways so Euphoria gave me the courage. Imagine being downvoted for sharing your experience 🙄",
            "score": -15,
            "author": "frozen_milk03",
            "replies": [
                {
                    "level": 1,
                    "comment": "Word of advice: DON’T.\nThere’s a reason those men aren’t married at their age, and it’s not because they’re great people.",
                    "score": 17,
                    "author": "sharkprincefishstick"
                },
                {
                    "level": 1,
                    "comment": "Watching a show can’t make you do anything.  Take responsibility for your own choices.",
                    "score": 6,
                    "author": "Health_Love_Life",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s over and done with now so oh well",
                            "score": 1,
                            "author": "frozen_milk03"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "seek help instead",
                    "score": 2,
                    "author": "10580-"
                },
                {
                    "level": 1,
                    "comment": "i'm sorry you got downvoted :(  ive heard that this show has had a real-life impact on teenagers and it's sad...",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Change the channel?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "People rly pick and choose Ive heard nothing abt them being underage bc Ive not watched the show... but ppl \"cancel\" other shows for the same thing, mainly bc ppl like this show. Doesnt it also show them doing drugs all the time?? I dont rly care much abt that but that is one thing ppl have cancelled other shows for. Double standards, lol",
            "score": 1,
            "author": "FitParsley139"
        },
        {
            "level": 0,
            "comment": "Which charakter in Euphoria is 15-years old? They are around 17-years old.",
            "score": 1,
            "author": "SpecialMitra",
            "replies": [
                {
                    "level": 1,
                    "comment": "when rue is talking about the first time she had sex. i believe she specified she was 15 so i would assume the guy was around that same age.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But this scene was absolutely not sexualized and there was no nudity. This makes no sense to me.\n\nEDIT: I am sure you speaking about the \"sex on xanax and three beers\"-scene?",
                            "score": 1,
                            "author": "SpecialMitra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "idk whats not sexual about a nude boy laying completely in view of camera after having sex, obviously a sexual situation.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, I feel like that's why I haven't wasted my time to watch it. When I watch TV I want it to have substance and a plot worth something, not just softcore porn every 5 minutes and the fact that it takes place in a high school setting definitely puts the icing on the cake.\n\nWhy can't we have shows like Degrassi anymore!?!?",
            "score": 1,
            "author": "LovelyM97"
        },
        {
            "level": 0,
            "comment": "Uh oh, the anime is leaking into western media again.",
            "score": 1,
            "author": "PvtSmuffler"
        },
        {
            "level": 0,
            "comment": "It took me reading through half of the comment section until I noticed you weren't talking about the Visual Novel \"Euphoria\" there lmao. I was llike \"Ehm, you do notice you're playing an extremely messed up Eroge right? And out of all the taboos in there, nude teenagers are your biggest concern?\". Don't look up the game or Hentai adaptation by the way if you want to keep your eyesight... No amount of bleach or holy water to the eye will make you unsee that shit!\n\nThe post makes a lot more sense now that I know that there's a normal show with the same name haha",
            "score": 1,
            "author": "eihcirapus"
        },
        {
            "level": 0,
            "comment": "I hate how they do this to EVERY show now.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Underage people have always fucked and always will.",
            "score": 1,
            "author": "TheMSRadclyffe"
        },
        {
            "level": 0,
            "comment": "I’m confused on the show’s target demographic… like who’s the audience. As an adult, even though the actors are all adults, like you said, it’s weird watching “teenagers” have sex.",
            "score": 1,
            "author": "hellojellotrello1"
        },
        {
            "level": 0,
            "comment": "As someone that loves the show I do agree they show unnecessary amounts of graphic nudity but its HBO what do you expect",
            "score": 1,
            "author": "aquariuslovingya"
        },
        {
            "level": 0,
            "comment": "I mean, if at least the actors are over 18 y.o. and playing a 15 y.o. character, I would be KINDA ok with it..? Not that i support it, but it would be at least a bit more understandable. \n\nHowever, when I was a teenager, I was really naive and diagnosed with many mental-illnesses, and I have to say, no matter how much these shows wanted to show how bad it is to take drugs, do sex, etc., it was still \"cool\" enough to make me want to do it more. I ended up being an alcoholic at age of 16 and even attempted to kill myself two times - what inspired me a lot and romanticized the subject was a show \"13 reasons why\", and I think it kinda falls into the same category of shows as Euphoria. It doesn't matter that somewhere in the show there were hints that \"kill yourself is bad don't do it\", as a child I saw only the romanticized subject of two lovers and suicide and it really did made a big impact on my mental health. I'm not saying I wasn't suicidal before watching the show, I was fucked up my whole childhood, but these things were encouraging me to do and try these things more, end of the story. :-(",
            "score": 1,
            "author": "Buffalo_Beautiful"
        },
        {
            "level": 0,
            "comment": "If all the show does is have sex scenes, like more than one in every show I assume there’s no plot and they are filling space. It’s like all they have to show is tits. Which are cool but obviously the plot is lacking if it’s every show multiple times.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I LIKE THE SHOW ✔️✔️",
            "score": 1,
            "author": "Witty_Bit6779"
        },
        {
            "level": 0,
            "comment": "Every actor in the show is well over 18.\n\nEdit: Never seen or heard of the show before today. Just looked up the cast.",
            "score": 1,
            "author": "Noctus_Grimm"
        },
        {
            "level": 0,
            "comment": "What??? What fucking show is this?!",
            "score": 1,
            "author": "Lord_Zahkrosis"
        },
        {
            "level": 0,
            "comment": "So I heavily debated on watching it cause I hate sex scenes in general (they aren’t important at all in movies except Friday the 13th). And this just tells me not to bother with it… which sucks because most tv shows now have sex scenes… \n\nAside from that, society has now accepted sex in media as normal (which I’m not saying it isn’t) but they’re making it easily accessible to children. Yes parents should watch what their kids watch but at the same time when I was younger porn wasn’t even that accessible unless we knew the sites or the channels and that’s if they weren’t parent control blocked. Now we just have to watch any pg13/pg14 show and there it is…",
            "score": 1,
            "author": "Jaebear_1996"
        },
        {
            "level": 0,
            "comment": "Exactly why I refuse to get into the show. A friend of mine played a few episodes when I went over to visit and I just couldn't help but cringe seeing a high school character hypersexualized. I expressed my opinion on it and was told that I was a prude. I'm a grown ass adult and I can see why younger audiences are into it but it's just personally not my cup of tea.",
            "score": 1,
            "author": "TheTurfMonster"
        },
        {
            "level": 0,
            "comment": "The show is basically legal cp directed for adults to enjoy",
            "score": 1,
            "author": "pinkbonemarrow"
        },
        {
            "level": 0,
            "comment": "Even weirder that adults are making memes of how they love the nudity of what’s supposed to be teenagers",
            "score": 1,
            "author": "kssmyassh"
        },
        {
            "level": 0,
            "comment": "Omg! I thought I was the only one weirded out by the graphicness of characters who are meant to be underage... It's concerning and it makes me so uncomfortable.",
            "score": 1,
            "author": "OkCicada9373"
        },
        {
            "level": 0,
            "comment": "I know all the actors are 18+ but it was pretty upsetting to me having them depict teenagers having such graphic sex. And not one, or two of the characters, but nearly every single one of the main female cast. Not ALL teenagers are like that and I think that's what the show misses.  \nI know its a drama, but a lot of teenagers will watch this and attach to a character they like. I hate to think they need to go through this stuff because that's what character x did.\n\nAnd I'm sure I'll get a lot of hate. I know a lot of people are die hard fans of the show.",
            "score": 1,
            "author": "eccentric-assassin"
        },
        {
            "level": 0,
            "comment": "I understand your point. I’m not bothered by it because all of the actors are over 18, so there is no actual child nudity. The characters sex lives are a huge part of their stories, and it’s needed for character development. And ofc as you stated teens do have sex quite a bit. But i totally understand where you’re coming from, there are a lot of dicks flopping around lmfaoo",
            "score": 1,
            "author": "Professional-Rub-437"
        },
        {
            "level": 0,
            "comment": "If you don't like that amount of nudity that's fair enough but .. you know none of the people are actually underage right?",
            "score": 1,
            "author": "TheseConversations",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I kinda agree. Makes me wonder if there's a small minority out there watching the show purely for that (sex scenes,etc) and not for the actual plot :/",
            "score": 1,
            "author": "BrittyBirb",
            "replies": [
                {
                    "level": 1,
                    "comment": "my big worry is that it's actually someone on the production team. and yea obv creeps are watching",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sex is normal don't see the issue at all but eh",
            "score": 1,
            "author": "Xboxone1997"
        },
        {
            "level": 0,
            "comment": "It's because drake is an executive producer",
            "score": 1,
            "author": "thestylishpirate"
        },
        {
            "level": 0,
            "comment": "You know those are actors and they are actually grown.... Right???",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Euphoria was made in Japan and the age of consent in Japan is 13 so they’re 2 years older than the required limit in Japan",
            "score": -7,
            "author": "Huge-Chicken-8745",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you think the age of consent in Japan is 13 years old.... You've been watching way too much disgusting back door hentai....\n\n\n\nJust because there are 22-year-old women in Japan that do porn pretending they are 13 doesn't mean that that's the age of consent....",
                    "score": 13,
                    "author": "NakedBaconSalad"
                },
                {
                    "level": 1,
                    "comment": "that's weird bro i think they should increase it",
                    "score": 7,
                    "author": "TheAncientPoop"
                },
                {
                    "level": 1,
                    "comment": "iirc that’s actually not true! the age of consent in japan is 17-18. (not trying to be a dick i’m just unsure)",
                    "score": 6,
                    "author": "Starberry_draws",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then wtf google thing me",
                            "score": 1,
                            "author": "Huge-Chicken-8745"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because you don’t have to be a pedophile to be into age play",
            "score": -12,
            "author": "BearCoreXP",
            "replies": [
                {
                    "level": 1,
                    "comment": "its not age play its acting. its a show, not porn",
                    "score": 4,
                    "author": "VolcanicRexYT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same rules apply, technically they’re both films",
                            "score": -3,
                            "author": "BearCoreXP",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's like saying Jurassic world and the land before time are the same because they both have sauropods in them.",
                                    "score": 2,
                                    "author": "VolcanicRexYT"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The actors are adults. \n\nAnd pretending teens don’t have sex is ridiculous. Clutch your pearls in the QAnon Pizza Gate Reddit’s.",
            "score": -1,
            "author": "MelisandredeMedici"
        }
    ]
}