{
    "id": "uxl0js",
    "score": 731,
    "title": "Fuck your thoughts and prayers. They didn't stop this one, and they won't stop the next one",
    "author": "GeoffreyTaucer",
    "date": 1653495709.0,
    "url": "https://www.reddit.com/r/Vent/comments/uxl0js",
    "media_urls": [],
    "other_urls": [],
    "postText": "Fuck your moments of silence. Your silence is what got us here.\n\n\"This happened because we don't have enough Jesus in schools\"\nIf your god lets kids die because we don't pray to him enough, then fuck your god and fuck you for worshipping him.\n\n\"The problem isn't guns, it's people.\"\nThen how about we stop giving the problem unfettered access to guns, hm?\n\n\"We don't have a problem with guns, we have a problem with-\"\nWhatever the problem is, it's uniquely American. Which means it's not poverty, or mental illness, or whatever other bullshit you were gonna finish that sentence with. The problem is uniquely American, so unless whatever you're about to blame it on is also uniquely American, you can fuck right off.\n\nFuck your thoughts. Fuck your prayers. Fuck your silence.",
    "comments": [
        {
            "level": 0,
            "comment": "Locked for Rules 3 and 5.",
            "score": 1,
            "author": "PowerOfGamers01"
        },
        {
            "level": 0,
            "comment": "It's okay, they ban abortions, atleast we will have enough kids to get shot up and still continue to have a rising population.",
            "score": 80,
            "author": "Agitated-Pen1239",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean... It all makes sense now.",
                    "score": 20,
                    "author": "ls920",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Somehow he made it make sense…",
                            "score": 17,
                            "author": "SeniorBaker4"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They should just change the name \"school\" to uterus and then maybe politicians will care about what's inside them.",
                    "score": 21,
                    "author": "megopolis12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Fuck your moments of silence. Your silence is what got us here.\r  \n\r\n\nWell said",
            "score": 125,
            "author": "Grand-Mall2191"
        },
        {
            "level": 0,
            "comment": "Exactly and they act like saying #amen on a Facebook post is doing anything no one cares about anything unless they are effected that’s why there’s so many 911 or holocaust jokes no one cares cause no one making the jokes is effected",
            "score": 12,
            "author": "Wowjustwow1234"
        },
        {
            "level": 0,
            "comment": "You can’t rent a car til you’re 25.",
            "score": 89,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can't buy a pack of smokes or a beer til you're 21. But you can buy a gun at 16! Fuck",
                    "score": 77,
                    "author": "pixeequeen84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Rifles at 18, 21 for Hand guns. Had to correct you",
                            "score": 32,
                            "author": "superwert",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And you also have to pass a backround check too (in all states)",
                                    "score": 7,
                                    "author": "FinnMan316",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, sure. With all of the shootings that happen in the US, I doubt a background check is really done, or done thoroughly enough...",
                                            "score": 10,
                                            "author": "TheBestChocolate",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My personal experience can attest to this being at least somewhat true.  Not to mention private sale laws in the south.",
                                                    "score": 8,
                                                    "author": "NarrowPlankton1151"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's harder to buy a phone than to buy a gun.",
                                                    "score": 16,
                                                    "author": "Netbr0ke"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Background check? You can do all the background check you want. There is no background check in the black market.",
                                                    "score": 2,
                                                    "author": "jukenaye",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "True and yet every gun used in a school shooting was either owned legally or stolen from a kids parent who owned it legally.",
                                                            "score": 3,
                                                            "author": "Liberty6000",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yup. Unfortunately.",
                                                                    "score": 2,
                                                                    "author": "jukenaye"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Teens can’t “ruin their lives” by smoking and drinking but apparently they can end others.",
                            "score": 5,
                            "author": "hotlass2003"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish the government would care about issues like these, instead of banning abortions and making life harder for others.\nFuck who turns a blind eye to it.",
            "score": 53,
            "author": "deadflowers1",
            "replies": [
                {
                    "level": 1,
                    "comment": "It makes no sense to ban abortions but not have more strict gun control. I guess they stop caring about people once they're born.",
                    "score": 38,
                    "author": "1985throwaway85",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This hits the nail on the head. They don't care about life; they care about control. It has nothing to do with unborn babies and everything to do with mandating the womb that carries it.",
                            "score": 21,
                            "author": "dareallyrealz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bingo.",
                                    "score": 10,
                                    "author": "1985throwaway85"
                                },
                                {
                                    "level": 3,
                                    "comment": "It really is about the fetus'. Many people think abortion is literal murder. You can thank religion for that one.\n\nRepublicans realized they could leverage that sentiment into a platform - described very well by this quote from Dave Barnhart:  \n\n\n&gt;“The unborn” are a convenient group of people to advocate for. They never make demands of you; they are morally uncomplicated, unlike the incarcerated, addicted, or the chronically poor; they don’t resent your condescension or complain that you are not politically correct; unlike widows, they don’t ask you to question patriarchy; unlike orphans, they don’t need money, education, or childcare; unlike aliens, they don’t bring all that racial, cultural, and religious baggage that you dislike; they allow you to feel good about yourself without any work at creating or maintaining relationships; and when they are born, you can forget about them, because they cease to be unborn. You can love the unborn and advocate for them without substantially challenging your own wealth, power, or privilege, without re-imagining social structures, apologizing, or making reparations to anyone. They are, in short, the perfect people to love if you want to claim you love Jesus, but actually dislike people who breathe. Prisoners? Immigrants? The sick? The poor? Widows? Orphans? All the groups that are specifically mentioned in the Bible? They all get thrown under the bus for the unborn.”",
                                    "score": 7,
                                    "author": "Siaten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't disagree that religious views on reproduction are irrelevant. The difficulty I have is when those same anti-abortion advocates care more about those foetuses than living, breathing children. To me, it seems like a, \"care passionately about them before they're born, blame them for and abandon them to their circumstances once they're alive.\"\n\nSo I think you're right, and we're in agreement. I think it's also a control issue, though; misogyny that's founded in historical and religious precedent.",
                                            "score": 10,
                                            "author": "dareallyrealz"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dang! Someone actually wrote this?!",
                                            "score": 1,
                                            "author": "jukenaye"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You found the problem. Those who turn a blind eye to it is.... everyone, unfortunately.",
                    "score": 1,
                    "author": "jukenaye"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Completely agree",
            "score": 27,
            "author": "jeonpendejo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Many Americans would rather blame anyone or anything else other than the obvious; their crazy obsession with guns.",
                    "score": 14,
                    "author": "Background_Farm1961",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where I come from we have guns in every household But mass shootings are very rare.. can’t just be a gun problem, might be due to sever isolation which can lead to mental instability",
                            "score": 3,
                            "author": "Shoddy_Marionberry20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right but gun toters don't want to fun mental health care either. The way I see it, we have two options: ban guns or fund universal healthcare. They refuse either, so it will only get worse. Also, in the original post, he mentions that it's not poverty but I don't think that's entirely true. I don't mean it's homeless people obvs, but the quality of life in America has drastically decreased. We have no control over our homes anymore, and wages are barely rising while corporate America takes every opportunity and excuse to raise prices. Living in America is scary and stressful and demeaning. It doesn't surprise me we have so many shootings because if stupider people are as angry and fed up as I am, I can imagine the leap to violence is a small one.",
                                    "score": 1,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Can't be isolation or mental instability either. In Japan it's becoming a more and more common thing where people isolate themselves from others leading to severe depression and mental instability and yet no shootings. The only thing uniquely American is our obsession with guns. Lack of mental health access happens elsewhere too but America is one of the worst so that's part of it but not the only cause. The only thing uniquely American is our obsession with guns",
                                    "score": 1,
                                    "author": "Liberty6000"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "One thing I noticed by living there for a little bit over five years was that it’s a beautiful country their hospitals are nice if you can afford it but Americans as nice as they are, so I’m not all are very me, me, me. ￼",
                            "score": 2,
                            "author": "Kimolainen83"
                        },
                        {
                            "level": 2,
                            "comment": "Actually they know it's their crazy obsession with guns the problem is they don't care. The problem is organizations like the NRA are funded by gun manufacturing companies like Remington. Gun manufacturers pay the NRA, who then makes donations with that money to Republican lawmakers in Congress For their campaigns. Because they're receiving that money from the gun manufacturers and the and RA they refused to vote for look for stronger gun control measures. There was a bill that ran through the house when the Republicans had control and it was a gun control bill, a background check and red flag bill which would have done stronger background checks and listed people who had mental health issues in the past with red flags when they go to purchase a gun. The only people to vote against that bill in Congress were the Republican party. Every Democrat, all the democrats voted yes to making this Bill a law,  the Republicans voted against making it a law!  They also repealed a law that Stopped people with certain mental illnesses from being able to purchase guns... They literally killed a law that  Prevented mentally ill people from being able to buy guns,  But now they wanna be so surprised when crazy people go around shooting a bunch of other people. Don't tell me this was unpredictable this has been predictable cause it happens every freaking day... In America we have at least 10 mass shootings A day across the country, We have something like 3000+ mass shootings a year in America,  DON'T fucking tell me this was unpredictable,  it was VERY FUCKING PREDICTABLE!!",
                            "score": 1,
                            "author": "LisaSKadel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You absolutely hit the nail on the head. Well said. Fuck the NRA",
                                    "score": 1,
                                    "author": "Liberty6000"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is one political party in the US that is stopping gun legislation. Anyone identifying with this political party has blood on their hands.\n\nThey care more about fetus' than actual, living, kids.",
            "score": 56,
            "author": "Siaten",
            "replies": [
                {
                    "level": 1,
                    "comment": "The US looking like a really bad joke but that's on them. Guns and memtal illness are things that can be avoided but nobody is taking it seriously. Very sad what happened to those kids..",
                    "score": 20,
                    "author": "Gelibean27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lots of us take it seriously, unfortunately it's not an \"overwhelming majority\" which is what is needed to make legislative changes.\n\nThe USA is being run into the ground by a minority of violent fundamentalists. I need to get out of here.",
                            "score": 13,
                            "author": "Siaten"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh you didn't know? I thought that was blatantly obvious when they were on Fox talking about we should let the immigrant babies  (that we are keeping in what is basically jail) at the border starve, and take the formula the government gave them to give to \"real\" (that's what they say \"real\") babies...  I mean I figured one can only read that as \"We like unborn fetuses but we don't like Brown babies, and we don't want Brown babies to live\"  But see the truth is they don't care about unborn fetus is either because if they're 16 year old daughter gets knocked up by a black boy guaranteed they're taken hurt to get an abortion guaranteed they don't got a problem with abortion when it comes to that so so it's not abortion that they have a problem with it's women having ownership over their own bodies and having autonomy over their own bodies and having control over their own bodies that they have a problem with.",
                    "score": 7,
                    "author": "LisaSKadel"
                },
                {
                    "level": 1,
                    "comment": "Funny how we don't see this kind of outrage from these people when a terrorist massacres European children. This is political theater, that's all they know how to do.",
                    "score": 3,
                    "author": "kai_wulf_dog"
                },
                {
                    "level": 1,
                    "comment": "False.",
                    "score": -17,
                    "author": "Mr_Guy_Person",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Umm true but go on, elaborate on that please...",
                            "score": 9,
                            "author": "mar_lene_l",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "🤓",
                            "score": 4,
                            "author": "HolyBreadWithCheese"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I swear that not all Americans are like this. Some of us would rather prioritize the wellbeing of the nation instead of banning abortions and making money off of firearms. Stricter gun laws need to be in place. And maybe even more action needs to be taken than just stiffer gun laws. But the fact that a 18 year old is able to buy a rifle but they can’t drink is beyond me…",
            "score": 8,
            "author": "GraphixBeVibing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed; I am an American",
                    "score": 5,
                    "author": "GeoffreyTaucer"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The NRA has financial backing and friends in high places. Americans by majority do not want guns banned or strict gun control laws and those that do are outnumbered and their voice drowned out by those who HaVe ThE rIgHt To BaRe ArMs. \n\nDoesn't matter that the amendment is from a time when you had to manually refill the gunpowder in your gun between each shot, pretty incomparable to the autos available today. Doesn't matter that fucking CHILDREN are being killed by mentally ill people who, despite being clearly fucked in the head, STILL have access to firearms. \n\nDoesn't matter. \n\nThere are many, many people who care more for people than guns but they are not powerful or big enough in numbers to do a damn thing but sit, watch and despair St the state of the country.",
                            "score": 4,
                            "author": "TonksTBF"
                        },
                        {
                            "level": 2,
                            "comment": "Lol is this a serious question? We’re not free and it’s not a democracy. It’s a two party system and we’re stuck. Both sides have blood on their hands.",
                            "score": 1,
                            "author": "SirCoughsAlot_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now, I may be biased, since I like to shoot guns and plan to own one in the future (note I am from EU), but holy shit US is so backwards in some areas.\n\nFrom one comment i read elsewhere, you gotta jumo through more hoops to drive a car, than to get a gun. Someone correct me on this, but if you turn 18, you could go to the gun shop the same day and get a hand gun or a rifle almost instantly (depending on state laws).\n\nYes the issue is guns, the issue is also the people using them. A gun wont kill by itself, unles used by a person, who at the same time, is not in the right state of mind.\n\nLimit access to guns - create as many hoops as needed to get access to them meaning: courses on how a gun works, maintaining it, proper safety procedures and etc. Also, the person gonna go throug a psych check, to determine if the person is stable.\n\nLike OP said - Fuck your thoughts, fuck your prayers, fuck your silence.",
            "score": 3,
            "author": "ltdemon"
        },
        {
            "level": 0,
            "comment": "Very insightful, that the problem is uniquely American, so so must be the cause, it's availability of guns!",
            "score": 6,
            "author": "LifeIsAwfullyLong"
        },
        {
            "level": 0,
            "comment": "Preach. We have the most serial killers of all countries. Most mass shootings etc. It’s like slaughtering native Americans and then building the country on the backs of slaves left negative energy here. Every country has their dark chapters of course but we’re just…..I feel like we are a lost cause.",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Serial killers and mass shooters have one thing in common, they’re mentally ill. If we get get guns out of the hands of mentally ill people while also dealing with mental illness in this country, then we’ll see a reduction in these types of homicides. Let’s not pretend that these people aren’t absolutely out of their minds.",
                    "score": 5,
                    "author": "ryt8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's the issue. We need to deal with the mental illness. Unfortunately, we've decided it's more fun to ignore it.",
                            "score": 5,
                            "author": "blue4t",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah and to just point a finger at guns because it’s more simple to deal with and a political platform. Imagine a candidate that spoke deeply about mental illness, you can’t.",
                                    "score": 3,
                                    "author": "SirCoughsAlot_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just today I Heard: \"If teachers were allowed to carry guns in the classroom, this would not have happened!\"\n\nSome people just never learn...",
            "score": 8,
            "author": "XeoXeo42",
            "replies": [
                {
                    "level": 1,
                    "comment": "even if you were a teacher with a gun, would you be able to pull the trigger on them while also having to worry about not hitting others?",
                    "score": 4,
                    "author": "mario610",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m majoring in Music Education, and planning to be an elementary music teacher. I don’t need a damn gun. I don’t trust myself with one because I’ve never had to hold one in my entire life. Also, I personally think that it increases the chances of insane people finding the guns in schools. To add on, my worst fucking nightmare would be having to hold one, as being inexperienced with a gun around small children and an evident threat is just completely fucking unsafe. What we need is stricter gun control laws and these teachers need a god damn pay raise for putting their lives on the line to protect these children from absolute idiots. \n\nI know I’m cursing a lot but I still genuinely can’t process everything that’s happened and I can’t process how ignorant these Americans are.",
                    "score": 2,
                    "author": "realrecycledstar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Youre not the only one pissed off",
                            "score": 2,
                            "author": "Silent_Estimate_7298"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re going to do thoughts and prayers, do some actions too. \nPrayer doesn’t work unless you act on it, at least that’s what I heard when I went to catholic school. But it does make sense. I’m not religious though so I don’t 100% know.\n\nTo add, the problem isn’t just guns. There’s more to it. While they are apart of it, it’s not the whole of the issue.",
            "score": 2,
            "author": "Various-Teeth"
        },
        {
            "level": 0,
            "comment": "Thoughts and prayers always the first thing people who really dont care try.. I cried when i read the news .  Soon as I saw my kids I cried even more. But hey we are making sure we keep our mental health at an all time low and we are making sure access to high powered weapons and weapons in general is as easy as getting a fishing license.",
            "score": 2,
            "author": "Silencer271"
        },
        {
            "level": 0,
            "comment": "Imagine. Guns in America become illegal to own, every one of them. A gun destruction plan goes into place where the public hand over their guns to be destroyed as owning one illegally would carry a hefty prison sentence. \nIt's not the ultimate solution but it's a start. Have a look at the Dunblane school shooting in the UK and what effect that had on gun ownership in the UK. And whilst your at it, have a look at the stats for shootings in the UK vs the US on any given year. \nObviously I'm pissing into the wind here because 'murica and the whatever ammendment and all that.......",
            "score": 2,
            "author": "theoriginalalfalfa"
        },
        {
            "level": 0,
            "comment": "You’d think after at least the fifth time their “prayers and thoughts” did nothing to stop mass school shootings that maybe prayers and thoughts aren’t enough to end this. But they keep praying and kids keep dying. It’s all “in gods plan” though.",
            "score": 2,
            "author": "midoriyasour"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Feel free, so long as you don't do that thing where you drop my name out.",
                    "score": 2,
                    "author": "GeoffreyTaucer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this post right here is the truth the problem is that people actually believe that what happened is because we don’t pray enough if your god doesn’t help when children get shot up then i want nothing to do with god i don’t care if that means i’m going  to hell they want to ban abortions and can’t make it harder to get guns ? wtf why don’t you protest saying ‘pro life’ now",
            "score": 2,
            "author": "t_rayy"
        },
        {
            "level": 0,
            "comment": "For a country as advanced as America to have belief that prayers and moments of silence will do a thing to help the kids that were killed, in what could’ve been avoided if they addressed gun control like they do abortion. Giving thought to the families of the lost means nothing when they could have done something to prevent it. OP is right to be angry. This isn’t stuff that happens anywhere else. It’s not an answer to pray to an imaginary friend for something to be done. Actual effort has to be made by people to stop atrocities like this happening.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Maybe they'll stop thinking religiously and start thinking tactically once more people get fed up with idols that don't do anything for them and decide to take matters into their own hands. For once.",
            "score": 2,
            "author": "SableyeFan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, maybe this time we'll finally actually do something aboAAAAAHAHAHAHAHAHAHA I almost made it through that with a straight face, but couldn't quite manage it.\n\nNo, today they'll tweet out their thoughts and prayers, and tomorrow they'll go on with business as usual.\n\nFuck 'em",
                    "score": 4,
                    "author": "GeoffreyTaucer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. You're right. \n\nStill, taking back our power and using it, instead of giving it to someone else, tends to get a lot of things going. Wish more people had the same ideology as you. \n\nI'm done waiting for a miracle",
                            "score": 3,
                            "author": "SableyeFan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everything important in the US is protected by armed security. Schools are \"protected\" by gun free zones. Restricting access to guns wouldn't have stopped that psycho from stabbing a bunch of kids in the throat with safety scissors, or kitchen knife, or a baseball bat.\n\nThere is no solution to prevent evil people from doing evil things. It makes sense to me though, that schools shouldn't be left unprotected like they are. It may come as a surprise to some, but criminals dont actually obey the law. What the guy did was illegal. Making it *more* illegal will not stop it.",
            "score": 4,
            "author": "graydog1998",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Restricting access to guns wouldn't have stopped that psycho from stabbing a bunch of kids in the throat with safety scissors, or kitchen knife, or a baseball bat.\n\n100% agree, but I would argue that a psycho with a pair of scissors, kitchen knife, or baseball bat is much easier to restrain than a psycho with a gun.\n\n&gt;Making it more illegal will not stop it.\n\nI think it would make it harder to commit crimes like that though, which in itself can save some lives if not all.",
                    "score": 10,
                    "author": "Nobody-w-MaDD-Alt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This. All of this.\n\nWe don't go to war with knives and scissors, we use guns for very good reason.",
                            "score": 11,
                            "author": "bluelifesacrifice"
                        },
                        {
                            "level": 2,
                            "comment": "I'd take being stabbed 10 times over being shot point blank in the fucking head. \n\nThis argument baffles me. Being stabbed is SO much more survivable than being shot, I do not understand the logic.",
                            "score": 3,
                            "author": "TonksTBF"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is your point really \"crimes happens, so no point in having laws\"?",
                    "score": 3,
                    "author": "aesoth",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Gun legislation to reduce accessibility does likely save lives according to a massive [epidemiological study](https://watermark.silverchair.com/epirev_38_1_140.pdf?token=AQECAHi208BE49Ooan9kkhW_Ercy7Dm3ZL_9Cf3qfKAc485ysgAAAsswggLHBgkqhkiG9w0BBwagggK4MIICtAIBADCCAq0GCSqGSIb3DQEHATAeBglghkgBZQMEAS4wEQQMxHaDp8QMZ3e8g1UWAgEQgIICfv0nwnBCcoTiboatONgjdgyB-hzRe9X5Lhf7Ls_MvGMWwGirwX5OI7BhzyvOoQgSs5rpfBOUQ7q41w3UVWelPYnoJ-XcBMggLYeONwo3vODPQXKG14t10SIYXaMOHl2p3x2Gf9VrNjp07TrKqjvrNrtOlVPXhHY9JtIyM_DkXy95I0cXyYpMuEDUvH5r83I1ecgj2yL3N9Gri4yVZzNiDMNdxIIBPQb2fwLkfoLEavhr6wvUI0-bnzYQprCNf6HRxrEYMt_aUHKCc_zF6qPTcd4mtnBEvBK5yp8NJPpxV-JaZi4gPuGF-dbauJvc_w_lU9HIm3i7pGieclcgvDf6QqbTfWutJzZGLIjy9kLto1XgE93lq8XhlCJFpMYLc0wPqgomp-f13LaWOE1Lw8f8gjDp375ho6Io7DFE_6b8M4YqiP2WtostD0JTijOEsXk2Bk1pdMQ8fa5moi2Y77gaYNIx7o82PbrCBrf9fWKM4Vol2QUXCtyEMUmnKWp2ZU2VCG_L53Hvl0RtLsCLm6NdejHsiPs-VA00Tkg9meMbdiLNHiVzkMXPSuVxVylIafRXngLklMqqLx2Y0KqB5GmiRkPB8mcIFfyeCZBp_utjhCkY23hY7K8Q0rIaAOqBa_cua75h1ocCNNkWMdqLfaL1pv1_E3gHHAc5bCq9gfefsYsbbUN-5SqrpLae0IChdq4vC0MerAOy2tEv9k1bRivqYApTcYBrdslLTzypO81CwTTKscwksxvvfX7KPoZRzzplDfUaxmhCeqUB0AElWzHb2BYWDg3hacKnLL854KNBC6dJOy1FK7oo354m2k_t_GIzwogwzzez2tyMfGmuNglw) in 2016.\n\nThe solution to mass shootings is multi-layered. A combination of firearm legislation, mental healthcare access, and restrictions on media sensationalism will significantly reduce the frequency of these events.\n\nGuess which political party in the US is against firearm legislation and universal healthcare. Guess which political party the most sensationalized news media source leans to.\n\nWe all share the blame in this, but Republicans refuse to help fix it.",
                    "score": 7,
                    "author": "Siaten",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't share the blame in this. I didn't kill anyone.",
                            "score": -4,
                            "author": "graydog1998",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you are supporting policies or parties that enable mass murderers, you are tacitly responsible for that enablement.",
                                    "score": 4,
                                    "author": "Siaten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What policies are you pretending I'm a supporter of? Are you already putting words in my mouth?",
                                            "score": 1,
                                            "author": "graydog1998",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not saying you, graydog1998, are personally supporting anything. I'm using \"you\" in the universal sense.\n\nI hoped the \"if\" prior to that was enough of a declaration that I wasn't accusing you, personally, of anything.\n\nThe only thing you, graydog1998, are wrong about is that \"there is no solution to prevent evil people from doing evil things\". We have solutions. One group of law makers refuses to implement these solutions because it'll lose them money and a platform.",
                                                    "score": 1,
                                                    "author": "Siaten"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why is it that only the US feels they need “gun free zones”? You do realize that in most countries around the world, children don’t go through metal detectors to get to their classes. Most schools around the world do not employ armed security guards. Most children around the world do not practice “armed shooter drills”. Do you think that there are not people with mental health issues around the world? Why does the US often have these massacres? Their ridiculous obsessive love of guns. Period.",
                    "score": 6,
                    "author": "Background_Farm1961",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gun hobbyists and school shootings have absolutely no correlation.",
                            "score": 0,
                            "author": "graydog1998",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The US owns 393 million guns. Hobby? Yeah, right.  More like a Wyatt Earp fetish.",
                                    "score": 4,
                                    "author": "Background_Farm1961",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wyatt Earp killed an entire gang of 50+ murderers. So sure. Literally good guys with guns according to you.",
                                            "score": 5,
                                            "author": "graydog1998"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It does happen in other countries. \n\nIt's just not getting blasted in the news.",
                            "score": 1,
                            "author": "graydog1998",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "26 years since a school shooting in the UK. \n\nStudents do not go through metal detectors. I was never taught how to survive a school shooting, because they just didn't happen. I'm 31 and in living memory I cannot remember a mass shooting, and I've been looking into it. \n\nWhy? Because gun ownership is legally restricted to those who hunt and armed law enforcement.",
                                    "score": 3,
                                    "author": "TonksTBF"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What amazes me instead every time this happens some American say that they should arm everyone. I said some I did not say everyone.\n\nI think the US should adopt the gun policy most European countries or look at Scandinavia if you take away that one instant we had some years ago the incident we had before that was second world war.\n\nAnyway Europe has a super strict gun policy no concealed carry and so forth and so on and it’s worked wonders for us and it would work wonders for the US aswell.",
            "score": 2,
            "author": "Kimolainen83"
        },
        {
            "level": 0,
            "comment": "Maybe the cops who were already chasing the suspect and caused this shooter to crash their truck should have done more to stop them from entering a school.",
            "score": 2,
            "author": "md11086",
            "replies": [
                {
                    "level": 1,
                    "comment": "Side note: the teachers were much more willing to put themselves in harm's way than the cops.\n\nWe should keep this in mind when deciding how to allocate funds.",
                    "score": 2,
                    "author": "GeoffreyTaucer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "!!! i’m so heartbroken",
            "score": 2,
            "author": "throwawayacctlmaooo"
        },
        {
            "level": 0,
            "comment": "Perfectly said. I think you might like the song Thoughts &amp; Prayers by grandson.",
            "score": 2,
            "author": "deviant-joy"
        },
        {
            "level": 0,
            "comment": "What do they think is going to happen when they say that? Do they think thoughts and prayers do anything? I’m genuinely curious",
            "score": 2,
            "author": "AllMyStupid_HealthQs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm assuming they want to provide comfort for the people who have lost their loved ones. In this case, fucking children with their entire lives ahead of them. \n\nWhen actually, just makes them look like a massive dick. Don't want your thoughts and prayers, shithead, they want their kids back.",
                    "score": 2,
                    "author": "TonksTBF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right? But they don’t want anything done that could prevent these mass killings. They think human lives are ok to sacrifice. I don’t even think they sincerely want to comfort anyone. They don’t have feelings if they think this shit is ok",
                            "score": 1,
                            "author": "AllMyStupid_HealthQs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard someone say, \"We need more armed security at primary schools.\" When someone asked how they would achieve that, this person responded with, \"Hey, it's just an idea. I'll leave it to the experts to sort out.\"\n\nUtterly disgusting, frankly.",
            "score": 2,
            "author": "dareallyrealz"
        },
        {
            "level": 0,
            "comment": "People really here out saying it’s not an American problem when it clearly is an American problem. Blinded with pride and “patriotism?”",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This right here,  ALL OF THIS...\n\n Isn't it amazing how the SAME people who claim that they believe that all life is precious, and all lives matter are the same people in people who literally LITERALLY REFUSE to put laws into place to prevent this kind of thing from happening...\n\n Isn't it amazing how the same people people that were screaming \"my body my choice\" at the top of their lungs when it came to getting a shot to prevent them from dying,   Can't say the same thing when it comes to WOMEN making choices about their own medical health... the \"It's about my freedom, I want my freedom\" crowd doesn't give a Damn about the freedom of others...\n\nFUCKING HYPOCRITES!!\n\n And if it's a black man it would be an entirely different story, Case in point, look at Filando Castille,  A black man licensed to carry a weapon Who was pulled over by the police and shot within 90 seconds of the beginning of that interaction and Within only 30 seconds of informing the police officer that he had a concealed weapon  and his concealed weapon permit on him. The officer pretty much heard black man with a gun, pulled his gun out and shot him, in front of his children. And yet I didn't hear the NRA coming out in support of Filando Castille but they will quickly come out in support of ANY white man who shoots an unarmed man with a firearm. In fact,  in ALL my 46 years alive, I've never once seen the NRA defend 1 responsible Black gun owner. They get vilified and called criminal,  regardless of whether they were or not.\n\n But the problem is two fold because the problem is not just the system itself but it's  The people we elect to run it.. We keep electing republicans thinking that they're gonna eventually do something but they don't WANT to because they don't NEED to! THE NRA is paying them NOT to and we keep steady electing them into office on one issue that has nothing to do with guns and not realizing that they're never gonna do anything about the problem Of guns.\n\n What does it say that 90% of Americans want background checks on checks and the only people to vote against that are the Republican party? \n\nEvery last Democrat voted yes on background checks and red flag law and EVERY LAST Republican voted NO!!\n\n They literally hold the lives of Americans in their hands every day and refuse to do anything about it because they DON'T care if Americans have to die in order for people to have guns. I've literally seen republicans say that is the cost of freedom, basically inferring that the cost of freedom, of the freedom to own guns, is that people will die at the hands of crazy people and to them, that's acceptable. That is the biggest part of the problem!!",
            "score": 2,
            "author": "LisaSKadel"
        },
        {
            "level": 0,
            "comment": "I don't understand pro-gun logic at all.",
            "score": 2,
            "author": "BreathOfPepperAir",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is no logic. Just fear and death.",
                    "score": 1,
                    "author": "The_Pip",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck all the old white men running this country too.",
            "score": 2,
            "author": "hug5fordrug5",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Nah it’s alright chappies, let’s politicise this.\nNot talking about the original post on its own, Americans truly treat politics like war. Calm down. This is a tragedy and should be recognised as such and we should grieve before using this as a political message in saying “X party is for our kids and Y party are all murderers”\nObviously banning guns is unconstitutional as per your constitution, and regulating them is already done but a lot of people don’t recognise it.\nMore can be done, but we ought not to run away with ourselves in saying that this and that can and should.\n\nI don’t see why you’re annoyed with thoughts and prayers, if they are not isolate, and so I have and will continue to offer mine.",
            "score": 2,
            "author": "Slayer_of_Germs"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "School massacres on this level with this frequency are uniquely American",
                    "score": 23,
                    "author": "GeoffreyTaucer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good thing you don’t live here I guess. I’m sick of people using this tragedy to farm upvotes. (Not saying you are or aren’t or whatever) but gee there sure are a ton of people doing just that! Like so many, kind of like with the war in Ukraine and everyone was using the tragedy to farm upvotes. So so many upvote farmers on Reddit. I’m not even sure people care and I guess that’s my own little rant!",
                            "score": -16,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -20,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 21,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -15,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": -1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 3,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "One party in the USA continuously votes against firearm legislation. One party in the USA continuously votes against better healthcare access.\n\nThat party isn't the one on the left.\n\nThe discussion that needs to happen is how much blood Republicans are willing to spill before they accept responsibility for their policies.",
                                                                                    "score": 0,
                                                                                    "author": "Siaten",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 11,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -4,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I though the silence was to honor those who died?",
            "score": -1,
            "author": "Steamedbutterr",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's to pretend to honor those who died, while not actually doing a goddamn thing to prevent it from happening again. It's theater, nothing more.",
                    "score": 1,
                    "author": "GeoffreyTaucer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get what you mean, but I feel like there is only so much a school can do. A school can’t make the gun laws better. I still see your point and agree with what your saying.",
                            "score": 1,
                            "author": "Steamedbutterr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not so much referring to the schools as to the elected representatives who, like clockwork, respond to things like these with \"thoughts and prayers\" and zero legislative action.",
                                    "score": 1,
                                    "author": "GeoffreyTaucer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I get what your saying and now I completely agree it’s horrible how they do nothing but say stuff like We pray this will never happen again. Honestly disgusting.",
                                            "score": 1,
                                            "author": "Steamedbutterr"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If the problem is people and there are so many unhinged ppl out there, then maybe access to guns shouldn’t be so easy.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Restrictions on legal gun ownership only punishes law abiding citizens. If a criminal wants a gun, they're not gonna go to a licensed facility to legally purchase one. They're gonna go somewhere else and get one illegally. Quit pushing for gun control. It doesn't work, and it punishes the wrong individuals. \n\nOption A. Arm teachers and mandate they attend firearms safety courses semi annually, and school shootings will stop. \n\nOption B. Employ our veterans or otherwise experienced security personnel as both security AND on site QRF that communicates and cooperates with local law enforcement with the same constraints. \n\nOption C. Instead of, or alongside, active shooter drills, implement heavily supervised self defense courses that encompass non lethal hand to hand defense techniques at a high school level as a mandatory course.\n\nBut don't punish everyone else for the actions of one moron.",
                    "score": 2,
                    "author": "reallycertaintragedy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There seem to be plenty of “morons” not just one. Not even just one per year. \n\nOption A. Teachers are not armed guards, they already have so much on their plate, it’s inhumane. Now they have to be trained shooters also?",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Eh, I'll concede that point. Got any better ideas that don't punish law abiding gun owners? A happy middle ground shall we say?",
                                    "score": 1,
                                    "author": "reallycertaintragedy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There’s no middle ground when this keeps happening. \nPeople in general are unpredictable so guns shouldn’t be accessible  to all and any.",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In most states guns aren't available to all and any. Texas is the only one I'm aware of that allows an 18 year old to purchase anything more than a hunting rifle larger than a .22 at the age of 18. I could be mistaken, and if I am then feel free to show me the federal law that allows any and everyone to purchase a firearm without a federal background check.",
                                                    "score": 1,
                                                    "author": "reallycertaintragedy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s all a problem. It’s not uniquely American, bad shit happens all over the world. You can say it’s worse here, it just seems that way because of social media.",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Massacres on this scale with this frequency are uniquely American.",
                    "score": 4,
                    "author": "GeoffreyTaucer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hate will do that.",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Especially when it has unfettered access to guns",
                                    "score": 6,
                                    "author": "GeoffreyTaucer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If it wasn’t guns he’d have blown the place up as happens in Islam countries every day. Stabbed… raped… it’s all horrid and awful. A bad guy will get a weapon regardless of what it is. You blame it in guns… I just blame it in hateful people who choose bad. I blame hate. Hate from politicians. I’m all for gun laws… it won’t stop it though. They will just find something else… politicians will blame the other party… and really what it comes down too… people can’t be trusted to handle weapons of any kind. We will strictly be eating with our hands. You won’t be driving. Hate is the enemy. Stop hating and being hateful. Stop picking up guns… knives… whatever… stop hurting and killing each other. Just stop.",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But you’re missing the point entirely. Yes crime happens but guns exacerbate the death toll immensely. There’s a reason you don’t see mass rape and mass stabbings… because you don’t have a tool that literally can take 10-20 lives in the span of seconds. Wake up and read how ridiculous you sound clutching to this freedom and patriotism that will likely get you killed in the end. Because anyone can obtain and fire a firearm.",
                                                    "score": 3,
                                                    "author": "tobeperfectlycandid",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm still gonna give my thoughts and prayers. Cry about it 🤭",
            "score": -4,
            "author": "Stranger188",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "As if that ever did anything.",
                    "score": 8,
                    "author": "Gelibean27"
                }
            ]
        },
        {
            "level": 0,
            "comment": "SAY IT AGAIN FOR THE PEOPLE IN THE BACK",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Preach",
            "score": 1,
            "author": "Silent_Estimate_7298"
        },
        {
            "level": 0,
            "comment": "I come from the UK so 8 dunno how guns work in the   US but I honestly feel like America should have banned guns in modern day since after ww2 or after cold War. (For the public) As time goes on guns of bigger caliber and faster firing rates are made and it turns accessible to the public which in turn makes situations like these. \nI understand that Americans want freedom and to do what ever they want but they don't have the freedom or right to take anouthers away from them through taking their lives.\n\nGuns should never be put in public hands unless it call for it as doing so causing so many problems that the public will face. I. E school shooting, increase in gang and drug related violence, officers being harmed in duty.\nAmerica coukd quite easily solve this like banning guns in public hands unless theirs a lisence or only allow a type of bullet to be allowed in public hands like rubber or bean bag rounds so they can still use it for safety and defence.",
            "score": 1,
            "author": "Frozen1100"
        },
        {
            "level": 0,
            "comment": "It's not guns that are the problem. It's hate. It's the division and hate that keeps growing in this country every day. This post of yours is an example of that. We have politicians who fuel the fire by saying you need to physically fight the people who hold differing political opinions. If these people couldn't find a gun they'd use something else, perhaps make bombs like they tried in the late 90s and early 00s.",
            "score": 1,
            "author": "blue4t"
        },
        {
            "level": 0,
            "comment": "Y'all *need* to come here to Canada, cuz here we don't really have school shootings. We've had a couple, but never to the point where I'm afraid of school cuz I don't know whether or not I might get shot and die.",
            "score": 1,
            "author": "YeetersUwU"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "With your logic then guns aren't the problem because guns are not uniquely American. Canada, Switzerland, and Germany all spring to mind as countries with widely available guns yet we don't see the same level of violent attacks in those countries that we see in the US. The real problem in the US is in fact the people commiting the acts not the tools they use to do them. The problem with the people though cannot be traced to one single root cause but I'd say the largest impact that can be made and the one that is somewhat unique to America is the government and how the country is run. Right now Americans are being raised and groomed from birth to be nothing more than tax paying consumers to make the rich in our country richer. Raised to ruin our bodies and minds to line someone else's pockets. We are molded into the perfect little corporate workers through our culture and pathetic excuse for an educational system. We need to start with our system. We  need to educate people to actually be better and smarter and to make a better society not just learn how to fit into an office job or how to work in manufacturing, we need healthcare both mental and physical to care for our citizens, we need to know that an accident or illness isn't going to leave us thousands in debt or worse dead and leaving family in debt because we just couldn't afford it, we need to be able to stop worrying that the police will murder us for no reason or that we'll be thrown in jail for challenging their ego. \n\n\nWe need to be able to stop worrying the government is going to strip us of our rights and push thier religious and political opinions into laws that affect all of us.\n \nWe need proper nonreligious education, improved social programs and we need fucking hope that we can live a decent life.\n\n        My point is everyone wants to blame the HOW of these situations while totally glossing over the WHY. Without figuring out how to solve the cause of violence on a societal level changing the HOW changes nothing. Magically disappear all the guns tomorrow and people will still commit these types of acts, they'll just start using bombs, take those they'll use chemical attacks, take those they'll use fire or knives or sticks. No matter what types of restrictions are put in place violence will happen until the cause of the violent acts are addressed.",
            "score": -2,
            "author": "Big_J95",
            "replies": [
                {
                    "level": 1,
                    "comment": "The other countries you listed have much more stringent regulations on guns and ammo.\n\nI'm not calling for a gun ban, or gun confiscation, nor am I claiming that legislation can prevent 100% of gun violence, or whatever other dumbshit strawman you feel like throwing out there.\n\nI am calling for regulations. Background checks, registration, insurance requirements, psych evaluations, and required training.",
                    "score": 6,
                    "author": "GeoffreyTaucer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm all for background checks, registration and gun education and training, I'd like a basic class (no live weapons) in schools specifically so that every child understands guns and how serious they are. I disagree with insurance and psych evals though, insurance is 100% useless here not to mention expensive( which prices out low income people) and a psych eval is too subjective and open to corruption IMO to be a requirement of ownership.\n\n      But even all those things don't accomplish the goal of reducing violent attacks. All restrictions do without addressing the cause is make it harder on law abiding people to protect themselves from the non law abiding. This is the part that I don't see how people don't understand. A gun is a tool. These people could have just as easily built a bomb or set things on fire and caused equal or greater death and destruction. What needs to be addressed are the reasons the people are commiting the acts in the first place not what tools they use to do them. We need to figure out how to stop the people from commiting violent acts not just try to restrict how they commit them.",
                            "score": 3,
                            "author": "Big_J95"
                        },
                        {
                            "level": 2,
                            "comment": "As it should be.",
                            "score": 1,
                            "author": "Gelibean27"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are we civilans supposed to do? Change the laws? Thoughts, prayers, and hope that the laws change are all WE can do. Changing the law is all up to the government officials.",
            "score": -3,
            "author": "Morg_2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Call your officials. If you can afford to, donate to the ones that support gun control. If you are able to, volunteer for the campaigns of the ones who support gun control. Vote for the ones that support gun control.\n\nIt mat not fix everything, but action is a hell of a lot more useful than \"thoughts and prayers,\" which don't do jack shit.",
                    "score": 7,
                    "author": "GeoffreyTaucer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Whatever the problem is, it's uniquely American. Which means it's not poverty, or mental illness, or whatever other bullshit you were gonna finish that sentence with. The problem is uniquely American, so unless whatever you're about to blame it on is also uniquely American, you can fuck right off.\n\nAmerican health care is unique.  We spend more money and get less actual healthcare than any other developed nation.  Virtually EVERY other developed nation does it better than us.  \n\nOur treatment (or lack thereof) of mental health is abhorrent.  That is a uniquely American problem.  \n\nOur treatment of our own citizens is abhorrent.  That isn't uniquely American but it is in the developed world.  For a decade plus, cost of living has risen while the minimum wage has stagnated.  \n\nI want to stop mass shootings.  I just don't believe gun control will do it.  I used to think it would, but then I learned about guns, gun owners, how many people own how many guns, and how easy it is to MAKE a gun.  Learn about these things and you quickly realize that stopping gun ownership won't work any better than stopping illegal drugs.",
            "score": -1,
            "author": "SirEDCaLot",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I just don't believe gun control will do it.\n\nIt depends on how far we're willing to go. The \"common sense\" measures many of our electeds want to start with would curb gun violence slightly. Serious gun reform could drastically curb gun violence. We know it because it works all over the world.  \n  \nRepeal the second amendment. Ban rifles with magazines and all semi and fully automatic guns. Limit ammo purchases. Require background checks, training, and registration of all handguns and outlaw all public carry of any firearm. Make it a felony to have a gun when/where you shouldn't. That would have a dramatic impact. Or, if it were up to me, ban all guns for all civilians. But we won't do any of it. Because one person's gun is more important than every other person on the planet.  \n  \nFuck guns.",
                    "score": 2,
                    "author": "thegardenhead",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't think it depends how far we go.  I don't think it *matters* how far we go.  Even if, in some hypothetical situation, you manage to repeal the 2nd Amendment and find and destroy every single firearm in the USA- it won't stop mass killings.  It will just push killers to other means.  People who want to kill others, WILL kill others.  You don't need a gun to do it.  \n\n&gt; A firearm is a tool.  ...  It is not the tool that determines its work, it is the mind of the man that controls the tool which does.  \n&gt; Evil does not lie in the hands of man, it lies in the hearts of evil men.  Evil men will always find the tools they need to dispense their evil.  \n&gt; --Brannon LeBouef  \n\nI cite as evidence the Nice, France truck attack in 2016- psycho drove a rented cargo truck into a crowd; 86 dead 450+ injured.  Quite frankly I'm surprised attacks like this aren't more common- in a crowd, you can kill a lot more people a lot more quickly with a truck than with a gun.  However I'd guess they're uncommon because the mass SHOOTING people become media celebrities whereas this guy was kind of quietly shuffled off the public radar (probably because he was an immigrant and there was a lot of anti-immigrant sentiment in Europe at the time).  \n\n**So I look at our situation and say, how can we save the most lives?**  I approach that question open minded, without any political or positional bent.  Politics not important only life important.  \n\nTo me, the answer is easy- crime is a distributed problem, mass shootings are a distributed problem.  A centralized solution will not solve a distributed problem, you need a distributed solution.  \n\nConsider an organism that is infected with a disease.  If the organism has a virus or bacteria, you cannot perform surgery to remove the virus or bacteria because it is or could be everywhere.  You need an immune system- cells that exist all over the body and will fight the infection wherever it happens to be.  \n\nTo me, the distributed solution is to not disarm everybody, but to arm the *right* people.  \n\n[Here's what I mean](https://en.wikipedia.org/wiki/West_Freeway_Church_of_Christ_shooting).  In 2019 in Texas a guy walked into a church with a gun, and he started killing people.  He killed two- and then an armed civilian shot him.  And that was it.  It didn't make the news because 'only' two people died and nobody likes the narrative of 'arm yourself against psychos'.  But it's an example IMHO.  \n\nAnd I look at the Nice, France attack- what stopped the psycho?  Police, with guns.  Imagine if a few of the people in the crowd were armed?  Do you think that might have reduced the body count?  \nLook at the school shooting.  From what I've read, the psycho was in the school for 20 minutes before a border patrol assault team went in and shot him.  If a couple of the teachers or administrators in the school were armed, do you think that might have reduced the body count?  \n\nTo be clear- I'm not making a MUH GUNS MUH FREEDOM type argument.  I'm talking practical solutions.  I don't think supply-side controls would work for guns, because they don't work for drugs.  I think it's a distributed problem and it needs a distributed solution.",
                            "score": 2,
                            "author": "SirEDCaLot"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, then we'll just all end up like Chicago: all the criminals have guns obtained illegally while the law abiding citizens are at their mercy bc they have no way to defend themselves.\n\nNo, thank you. I'll keep my home defense tools, thanks. They help me sleep at night when my husband is away. They help me keep peace of mind for my pets and my belongings.\n\nGuns don't kill people, people kill people. End of discussion.\n\nAlso, half the shit you said IS A LAW ALREADY in most states but guess what? Criminals. Don't. Care. Again, look at Chicago, look at NYC. Strict gun laws, but err'body's still got a mf gun. Fucking wild...",
                            "score": 1,
                            "author": "Searwyn_T",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I get it, you don't have to repeat *all of the talking points.* Chicago isn't a case study in anything. Guns are legal in Chicago. There isn't a jurisdiction in this country that has enough or the right combination to actually do anything. As long as guns are legal, people will have them. Want to know how to stop all of the big, bad criminals from getting guns? Don't fucking mass produce, market, and protect gun sales and force it down our throats that *everyone needs a gun otherwise you'll get murdered twice a week.* Jesus Christ, we're the only developed country in the world where this happens and you selfish fucking assholes still try to convince yourselves that \"guns don't kill people.\"",
                                    "score": 1,
                                    "author": "thegardenhead",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mine or my husbands gun don't hop out of their (locked) cases and try to shoot me of their own volition so no, guns don't kill innocent people all by themselves. It's the fucked up creep holding it. Our guns have never hurt anyone, like pretty much every legally obtained gun in the US still in the possession of the original owner. \n\nBut also, I will agree that we need more background checks. I know someone who has a gun in their possession who legally should not but the laws in their state are all kinds of contradictory so given the situation they're in, no one can do anything about it. I will never understand why it's a state by state thing when it should be nationally regulated.",
                                            "score": 2,
                                            "author": "Searwyn_T",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Great bad faith argument you make. Really good stuff. My car never ran over a kid but I still have to slow down in a school zone, don't I? None of these law abiding travelers have ever tried to blow up a plane, but we still all get searched and screened before we get on a plane, don't we? What a fucking joke. Your guns are so important to you that you accept children being murdered at school and aren't willing to do a goddamned thing about it. 27 school shootings so far in America this year. We're #1! We're #1! The fucking governor of Texas is proud that he made it easier for this piece of shit to get his hands on guns. He's proud that he made sure that kids that can't be trusted to drink a beer can get all of the sweet sweet guns they can handle. Fuck you and fuck every single selfish, complicit, gun worshipping fuck in this country. We love babies so much that we will legislate women into forced birth, and then gleefully watch as they're gunned down by our precious murder tools while they learn about how plants use sunlight to grow.",
                                                    "score": 1,
                                                    "author": "thegardenhead"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Smile for the camera\nAnother politician bought\nI swear I heard another shot\nCash another payment\nBled all on the canvas\nThere's murder on the campus\nAnother press conference\nNothing gets accomplished\nThe shooter's an accomplice\nMoney is the motive\nThe wars in the street\nWatch history repeat\nNo thoughts, no prayers\nCan bring back what's no longer there\nThe silent are damned\nThe body count is on your heads\nNo thoughts, no prayers\nCan bring back what's no longer there\nThe silent are damned\nThe body count is on your heads\nNo thoughts, no prayers\nCan bring back what's no longer there\nThe silent are damned\nThe body count is on your heads\nBow before the violence\nIt's a governmental shakedown\nWelcome to my breakdown\nBulletproof backpacks\nThey want to arm the teachers\nI think I saw the reaper\nFear's good for profit\nDeregulate the casket\nThey're lyin' to the masses\nHow much will it take\n'Till you get buried in the coffin that you make?\nHeaven's sake\nNo thoughts, no prayers\nCan bring back what's no longer there\nThe silent are damned\nThe body count is on your heads\nNo thoughts, no prayers\nCan bring back what's no longer there\nThe silent are damned\nThe body count is on your heads\nNo thoughts, no prayers\nCan bring back what's no longer there\nThe silent are damned\nThe body count is on your heads\nTurn off all the lights nobody make a sound\nAshes to ashes, we all fall down\nAre we out of time when we turn this song around?\nAre we out of time when we all fall\n(We all fall down)",
            "score": 0,
            "author": "Captain-Crunch1989",
            "replies": []
        },
        {
            "level": 0,
            "comment": "At this point I would very much like to see guns in school. More guns. But not the conventional way, I'm talking that we need security weapons built into the hallways that can be accessed using keycards, biometrics, a lock, facial recognition, and authorization codes by police or faculty remotely.\n\nThe military already figured out the solution for such destructive weapons, which is why we should structure our school's defense the same as we do with nuclear weapons. I'm talking 2 people with 2 keys turned at the same kind sort of thing. Also have as many firewalls as possible and have the systems retract into the ceilings and/or walls.\n\nSchools should continue to have standard lockdown protocols dare I say even stricter protocols, so the shooter will be in the halls alone. I'd much rather hear a hail of gunfire if it means putting down the shooter.",
            "score": -2,
            "author": "JD60x1999",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jesus fucking Christ what kind of dystopia do you want kids to live in?",
                    "score": 3,
                    "author": "GeoffreyTaucer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The kind where guns are used in schools but only in defensive scenarios. It's not like they would be sticking through the wall unless there is a threat.\n\nWe're already living in the dystopia of \"your kids might not come home but luckily the internet is here with thoughts and prayers\"",
                            "score": -2,
                            "author": "JD60x1999"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Life is shit and so is the government I agree with this whole statement",
            "score": 1,
            "author": "Non-binary_mushroom"
        },
        {
            "level": 0,
            "comment": "at this point im starting to feel like evil really exists and it's peaking",
            "score": 1,
            "author": "FRlEND_A"
        },
        {
            "level": 0,
            "comment": "Okay class today we are learning if we pray for the rest of our fucking lives we won’t have to bury anymore people due to violence. Start now.",
            "score": 1,
            "author": "blazedbug205"
        },
        {
            "level": 0,
            "comment": "This happened because people don't raise and monitor their kids.\n\n\nThis guy was throwing up red flags left and right, it's takes a village to raise a child, and protect the villages children",
            "score": 1,
            "author": "LunarLoco"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jesus isn’t the problem. Jesus has nothing to do with this. Religion should be left out of this issue. The problem is people who shouldn’t have guns are getting access to them.",
                    "score": 3,
                    "author": "Various-Teeth"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, of course they won’t stop anything. I don’t think anyone is claiming they will though. The purpose of sympathy was never to undo the irreversible. It’s to comfort those who are receptive to it. Evidently, you are not. \n\nWhat would you have people do instead? And whatever that may be, what is wrong with offering you their sympathy in addition? How does it make anything worse?",
            "score": -3,
            "author": "libertysailor",
            "replies": [
                {
                    "level": 1,
                    "comment": "It makes things worse because it's a substitute for action. Every time this happens, lawmakers offer their \"thoughts and prayers,\" then go back to business as usual. It's a way of pretending to care about dead kids without actually doing anything about it.\n\nFuck 'em.",
                    "score": 3,
                    "author": "GeoffreyTaucer",
                    "replies": []
                }
            ]
        }
    ]
}