{
    "id": "11n8460",
    "score": 545,
    "title": "To the girl struggling with her paper at the dairy bar today around 530",
    "author": "RatNegan",
    "date": 1678405701.0,
    "url": "https://www.reddit.com/r/Cornell/comments/11n8460",
    "media_urls": [],
    "other_urls": [],
    "postText": "You were with another girl and a guy. You were trying to get help with a paper you wrote but the guy was being such a jerk about it.\n\nThe things he was saying to you were so nasty and mean that I could not believe it. Obviously you knew your paper needed work, that's why you were trying to get help. But nobody deserves to be put down like you were, no matter how rough your paper is. \n\nWho knows what you have going on in your life right now. Not every paper is going to be your best work and there's nothing wrong with that. I mean damn, even if you're the worst writer on the planet, that doesn't make you stupid and certainly doesn't mean you can't be successful and happy.\n\nI was very upset overhearing these things. I would have stepped in to say something but I have autism and sometimes struggle with knowing what is appropriate to do in certain situations. When I got home, I talked it over with my wife and decided to make this post hoping you see it.\n\nI would like to offer to help you with your paper. I am not the strongest writer,  but I'm certain that nothing could have hurt your progress more than the words of that jerk. I am glad your other friend was there to stick up for you as much as she could.\n\nAs an alumni, I am ashamed that that guy represents a part of Cornell, and said such mean things to you. You made it this far, you need to know that you deserve to be here and that you can do anything. \n\nFeel free to reach out for help with your paper, I'm sure there might be other folks on this sub that would be happy to help as well.",
    "comments": [
        {
            "level": 0,
            "comment": "You should volunteer for EARS or something- this was super uplifting to read",
            "score": 74,
            "author": "huds0nian",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not familiar with EARS but I will look into it! Thank you very much for the suggestion and comment",
                    "score": 13,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't mind the trolls. This was a very sweet post and I hope the girl sees it",
            "score": 166,
            "author": "Public_Intern_2622",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Trolls will be trolls, I figured there would be some crappy comments when I made the post but I am pleasantly surprised with the amount of folks who seem happy to see it!",
                    "score": 30,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Life can be hard and cruel. People like you make it better. Keep on keepin' on, good person.",
            "score": 33,
            "author": "aerger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! :)",
                    "score": 6,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Speaking as someone who grew up receiving unnecessarily harsh criticism, it’s an awful feeling being made to feel “less than” for needing help. However, it wasn’t until I directed that unwarranted behavior towards my loved ones that I realized I had carried that hurt with me across the years and was continuing the cycle.\n\nTo the girl, I hope she realizes she’s always deserving of dignity and respect. To the guy, I hope he realizes being “right” and in the know-how never justifies cruel criticism of others, regardless of how insignificant their questions might wrongly feel to him. \n\nThank you for offering to help the girl, it is posts like this one that make me proud of this community. We should always opt for compassion over disdain.",
            "score": 68,
            "author": "Visible-Rutabaga9268",
            "replies": [
                {
                    "level": 1,
                    "comment": "I understand where you're coming from very much. I think that's a big reason why overhearing this made me feel so upset. It's really difficult to realize that not only have you been hurt that way, but that you're making those you care for feel the same way. But it's so important to feel that because then you can grow as a person and end that terrible cycle. I hope you're doing well and feeling better about that now. Thank you for the support!",
                    "score": 7,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the best post I’ve ever seen.",
            "score": 56,
            "author": "positive_energy-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you haha :)",
                    "score": 7,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am not sure whether chances are high that the actual person see this post.. but it’s a very kind suggestion.",
            "score": 67,
            "author": "Alexa257",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, fingers crossed!",
                    "score": 6,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She may never see this but I’m so grateful that I did. Bless you!!",
            "score": 9,
            "author": "Wonderful_Highway_45"
        },
        {
            "level": 0,
            "comment": "&lt;3",
            "score": 7,
            "author": "Forgotwhoisignedinas",
            "replies": [
                {
                    "level": 1,
                    "comment": "&lt;3",
                    "score": 4,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This wholesome and beautiful. Best of luck in everything kind person",
            "score": 17,
            "author": "Glittering_Pasta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you :)",
                    "score": 3,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hope she sees this bro",
            "score": 9,
            "author": "FlashyPension2258",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too friend, thanks for the support!",
                    "score": 6,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&lt;3",
            "score": 8,
            "author": "OhHannahh",
            "replies": [
                {
                    "level": 1,
                    "comment": "&lt;3",
                    "score": 5,
                    "author": "RatNegan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "bruh",
            "score": -52,
            "author": "No-Extension-6270"
        },
        {
            "level": 0,
            "comment": "I think I overheard this too! Was it over along the window seating? I only overhead a bit but genuinely just hoped he was joking/being sarcastic and they were friends who had that kind of relationship.",
            "score": 1,
            "author": "SunflowerSnareDrums"
        },
        {
            "level": 0,
            "comment": "i was working on my paper with a guy i have a crush on and get flirty with and some creep was staring at him making an angry face",
            "score": -35,
            "author": "mining4goldwinsmith"
        },
        {
            "level": 0,
            "comment": "Jesus Christ dude, get laid",
            "score": -62,
            "author": "MediocreSpice",
            "replies": [
                {
                    "level": 1,
                    "comment": "ong",
                    "score": -23,
                    "author": "mining4goldwinsmith"
                }
            ]
        },
        {
            "level": 0,
            "comment": "that was me",
            "score": -135,
            "author": "mining4goldwinsmith",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will dm you my net id. Feel free to send along your paper and I'll do my best to help.",
                    "score": 31,
                    "author": "RatNegan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -153,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why are you being so mean?",
                                    "score": 44,
                                    "author": "Rainbow_Kali",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i said 4 words how was that mean?",
                                            "score": -1,
                                            "author": "mining4goldwinsmith",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don’t play dumb, you know what you’re doing and it’s disappointing behavior",
                                                    "score": 2,
                                                    "author": "Rainbow_Kali",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "alright im the guy being rude in the story, are you happy?",
                                                            "score": -2,
                                                            "author": "mining4goldwinsmith"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Daily checklist:\n\nStudy for prelim ✅\n\nGrocery shopping ✅\n\nBully stranger with autism ✅",
                                    "score": 34,
                                    "author": "rtels2023"
                                },
                                {
                                    "level": 3,
                                    "comment": "😂",
                                    "score": -93,
                                    "author": "mining4goldwinsmith",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re a douche bag and you’re also a dick. Honestly couldn’t choose which of the two. I hope that while you’re walking on the sidewalk, you fall into a manhole. You sound like someone who deserves nothing but misfortunes to bully someone online let alone someone w/ autism whose post is very wholesome. You’re the type to say “why does bad shit happen to me.” When really, you’re the whole piece of watery shit that I shat in my crapper just now. 🙃",
                                            "score": 21,
                                            "author": "Glittering_Pasta",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i have autism",
                                                    "score": -7,
                                                    "author": "mining4goldwinsmith",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t feel or care for someone who is a straight douche to people on the internet on a wholesome post regardless of whatever disability they have.",
                                                            "score": 18,
                                                            "author": "Glittering_Pasta",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "um okay? elon musk has autism do u not care about him either?",
                                                                    "score": -10,
                                                                    "author": "mining4goldwinsmith"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes well I don’t care. What I said stands. 🤷🏾‍♀️",
                                                            "score": 12,
                                                            "author": "Glittering_Pasta",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "u don’t care abt someone with autism?",
                                                                    "score": -2,
                                                                    "author": "mining4goldwinsmith",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You can still be a bully if you have autism. They're not mutually exclusive.",
                                                                            "score": 14,
                                                                            "author": "pandemicpunk",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "um often times it gets mistaken as bullying but this creep made a post about me, it’s fucking weird",
                                                                                    "score": -1,
                                                                                    "author": "mining4goldwinsmith",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Simp",
            "score": -68,
            "author": "LeonhardEuler_",
            "replies": [
                {
                    "level": 1,
                    "comment": "fr",
                    "score": -15,
                    "author": "mining4goldwinsmith",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "get a job",
                            "score": 1,
                            "author": "Kindly-Tumbleweed972",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i work at the green dragon",
                                    "score": 1,
                                    "author": "mining4goldwinsmith",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "green dragon deez nutz across your face, lmao gottem",
                                            "score": 6,
                                            "author": "the_okenshitter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "lmao",
                                                    "score": 0,
                                                    "author": "mining4goldwinsmith"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "tell your boss you need more hours so you stop being an ass online",
                                            "score": 4,
                                            "author": "Kindly-Tumbleweed972",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i can post from work lol",
                                                    "score": 1,
                                                    "author": "mining4goldwinsmith"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I were there, I would have jumped in and saved the helpless girl from the tyrant. Jk, I would have moved on and not given a 2nd thought.",
            "score": -10,
            "author": "[deleted]"
        }
    ]
}