{
    "id": "13er691",
    "score": 3,
    "title": "Sophomore sorority rush",
    "author": "Ok-Flow4890",
    "date": 1683820089.0,
    "url": "https://www.reddit.com/r/Cornell/comments/13er691",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey if I’m a girl who’s gonna be a sophomore this upcoming fall, and I really wanna rush, I can still get into a sorority right?? Like how common is that",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, it's common for sophomores to rush and to receive bids from sororities. Fall recruitment for PHC is informal and not every sorority participates, however. I do not think we will know for certain which orgs will COB until the fall.\n\nI believe AOPi is also planning to recolonize at Cornell in the coming year, after a 15-year absence, though I do not have any details.",
            "score": 4,
            "author": "ad-lapidem",
            "replies": [
                {
                    "level": 1,
                    "comment": "With both Phi Mu and PSS getting their charter pulled by their nationals in the last 4 years Cornell definitely needs some more sororities. The sad thing is that because the way Panhel rush works and the small number of sororities they don’t get to develop their own culture like fraternities do. Effectively the only difference between sororities is social status, which isn’t good for longevity of greek life.",
                    "score": 3,
                    "author": "Jwbaz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "agreed. with aopi probably coming back, this probably means another sorority will suffer with recruitment numbers and get pulled next. it’s a ridiculous cycle.",
                            "score": 2,
                            "author": "corngladiator"
                        }
                    ]
                }
            ]
        }
    ]
}