{
    "id": "13giyck",
    "score": 14,
    "title": "Just curious about the Starbucks Issue…",
    "author": "hurxhur",
    "date": 1683987892.0,
    "url": "https://www.reddit.com/r/Cornell/comments/13giyck",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/poll/13giyck)"
    ],
    "postText": "Should we take Starbucks off campus?\n\n[View Poll](https://www.reddit.com/poll/13giyck)",
    "comments": [
        {
            "level": 0,
            "comment": "I think it would be a good move and realistically i can’t imagine it would change eatery experiences much. Swap it out with Pete’s like they do at Jennie once the Starbucks contract is over.",
            "score": 29,
            "author": "esperantisto256",
            "replies": [
                {
                    "level": 1,
                    "comment": "Martha apparently agreed yesterday that whatever supplier they choose to switch to needs to be peer-reviewed by student orgs on campus to ensure their labor practices are ethical and what not. Also, the current SB contract isn't supposed to end until 2025 which would involve Cornell continuing to support them for the next 2.5 years which was the whole point of the demonstration in the first place.",
                    "score": 6,
                    "author": "livelaughqueef_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Starbucks does NOT own Peet's. Peet's is privately owned by a German conglomerate.",
                            "score": 13,
                            "author": "AsgardWarship"
                        },
                        {
                            "level": 2,
                            "comment": "Ah I see, I had no idea that SB owns Pete’s. My point is moot I suppose about how easy this would be. I guess the best option would be to expand via Gimme but that doesn’t seem entirely feasible either.",
                            "score": 0,
                            "author": "esperantisto256",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah gimme is also complicated bc of the proper gimme locations on campus (ie. gates and zeus)",
                                    "score": 1,
                                    "author": "livelaughqueef_"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "the sun article has been corrected, starbucks does NOT own peets",
                            "score": 1,
                            "author": "Pitiful_Meringue_57"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it is an important groundwork for better grad student pay.\n\nAnti union sentiment is why people get paid garbage as grad students. There's a power differential that can't be overcome no matter how nice your PI is because stochastically each unit within the system can't see how their choices \\*indirectly\\* results in treating each other unfairly, which is why collective bartering is able to even the playing field.\n\nAs nice as it would be for admins to design the university policy from behind a veil of ignorance it is too efficient to change things up, so this is a good step in the right direction.",
            "score": 37,
            "author": "synapticimpact",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi Karl Marx",
                    "score": -16,
                    "author": "IndianPabloWithPP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is this supposed to be an insult?",
                            "score": 2,
                            "author": "pinto_pea"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yep. Some of the worst coffee on earth anyways.",
            "score": 4,
            "author": "oneiromantic_ulysses"
        },
        {
            "level": 0,
            "comment": "The \"I don't really care\" gang, would you mind explaining more on your position? I'm curious about what it's based on; is it a lack of empathy for the workers or maybe for Starbucks as an enterprise, is it a poor understanding of the issue, or is it complete apathy towards it? I have a lot less trouble understanding either of the yes/no positions than the \"I don't care\", so I would love to hear more.",
            "score": 1,
            "author": "Piolets_Are_Cold",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any other coffee chain they choose to replace Starbucks with will be just as frustrating to work at and will pay approximately the same. I have more sympathy for labor activism when the work is difficult, not making frappuccinos. I feel like the Ithaca Starbucks strike had awful optics and was primarily run by Cornell students who wanted labor or political clout and corporate made a decision to close the stores because it just wasn't worth dealing with.\n\nThus, it's pretty hard to bring myself to care either way. Starbucks has shit coffee so frankly I wouldn't miss it though.",
                    "score": 13,
                    "author": "HenriLautrec",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough! Makes more sense now.",
                            "score": 1,
                            "author": "Piolets_Are_Cold"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t drink coffee so it’s a non issue for me. I think Starbucks as a chain is asking for trouble clearly going after stores that unionize but if people want them to take notice there needs to be a boycott. Hitting their bottom line will get attention. Do I think removing them from campus would do that? No, not enough to make their corporate office care.",
                    "score": 2,
                    "author": "brt37",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I disagree with your statement that they wouldn't care. Cornell consumes a lot of coffee, but mostly it's about the precedent. Other unis or large organizations would be more likely to also cut their contracts.",
                            "score": 6,
                            "author": "SMW14-_-"
                        },
                        {
                            "level": 2,
                            "comment": "Makes sense, thank you! That's a very balanced account.",
                            "score": 1,
                            "author": "Piolets_Are_Cold"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some clarification from an organizer of the campaign/occupation!\n\nRemaining SB stores in Ithaca are all licensed through the “Proudly Serving Starbucks” program— the company profits from multi-year licensing contracts, not the actual coffee sold. Starbucks closed all of its corporate locations in Ithaca (CTown, Commons, Meadows) but didn’t end any of their Ithaca licensing agreements (Cornell dining halls, most cafes, plus Target and Barnes and Noble). Our campaign targets the latter, calling for an end to the Cornell contracts.\n\nOur opinion isn’t really that the loss in profits from Cornell will directly impact Starbucks that much — by closing all of their stores in Ithaca, the company has effectively conceded that they don’t care if they make money in Ithaca. Rather, extracting a commitment to swap vendors sets a precedent that pro-union activists at universities and other organizations across the country can and should push for similar demands. Cumulatively, this changes the decision calculus for Starbucks — the longer they continue union-busting, the more of their lucrative “Proudly Serving” contracts that they risk. College students are the core of their customer base, and what we do really does matter in their eyes.\n\n\nAs others have noted, we still want coffee on campus — we’re just asking admin to work with us to find a more ethical alternative. The important part right now is committing that it won’t be Starbucks. Corporate alternatives are obviously far from labor utopias, though we think local unionized cooperative Gimme should also be on the table (two years is plenty of time to scale up), but Starbucks has screwed over Ithaca individually and has racked up more federal Unfair Labor Practice charges than any other corporation in history. There need to be consequences, and this is one avenue for that.\n\nI know the Ithaca workers and they’re brave, incredible people who are cornerstones of the broader Ithaca community. Those people have been suddenly laid off after over a year of being specifically targeted by a multi-national corporation. I feel our campaign is an effective way to show our support for them in a situation where they have very little power.",
            "score": 1,
            "author": "Resident-Anything808"
        },
        {
            "level": 0,
            "comment": "Can someone please explain what's happening?",
            "score": 1,
            "author": "petronerd54",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, please.   There are articles saying all Starbucks are gone from Ithaca,  but there is still one on campus?",
                    "score": 1,
                    "author": "reader106",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So starbucks owned 3 stores in Ithaca all of which unionized. They closed one of them last year and are closing the other ones now. In between these closings the government ruled that starbucks closing the initial location was illegal. \n\nIn addition to these starbucks locations cornell has a contract with starbucks and sells starbucks coffee and drinks at several locations on campus, but these locations are not owned by starbucks and not closing. The details of the contract are unclear except that it is set to expire in 2025.",
                            "score": 2,
                            "author": "Pitiful_Meringue_57",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Many thanks!!",
                                    "score": 1,
                                    "author": "reader106"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How does that contradict the goal?",
                    "score": 1,
                    "author": "pinto_pea"
                }
            ]
        }
    ]
}