{
    "id": "13hrmdj",
    "score": 1,
    "title": "anyone selling a car?",
    "author": "Maximum_Hornet7463",
    "date": 1684108931.0,
    "url": "https://www.reddit.com/r/Cornell/comments/13hrmdj",
    "media_urls": [],
    "other_urls": [],
    "postText": "looking to buy a used car if you are selling yours!",
    "comments": [
        {
            "level": 0,
            "comment": "Just go on carfax or craigslist. There are thousands of listings around. A mere google search would be more efficient than this.",
            "score": 4,
            "author": "VeganRiblets",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah thats probably true. i was just wondering bc i guess some seniors whos leaving might not be able to bring their car and want to sell it to someone. j in case",
                    "score": 2,
                    "author": "Maximum_Hornet7463",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes sense but wouldn’t these departing seniors need their cars to leave? 😅",
                            "score": 2,
                            "author": "AUtoMaTicGUnsHoT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "some internationals often leave their car here bc they cant bring it bsck to their home country, so 😭",
                                    "score": 1,
                                    "author": "Maximum_Hornet7463"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Actually Ithaca is a terrible place to buy a car. Inventory is limited, prices are inflated, and the stealerships like McGuire are predatory.\n\nDo yourself a favor and go to Cortland or preferably Syracuse where you'll actually have some decent selection. \n\nIf you need to stay local though, check out ridge road imports which is known to be an unflinchingly honest dealer. I have had repair work done there and they were exceptional. Ask for Elliot.",
            "score": 1,
            "author": "tr3g"
        },
        {
            "level": 0,
            "comment": "Price range, body style, etc?",
            "score": 1,
            "author": "Joe30330_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Price depends on the car! Body style is ideally fullsized SUV or similar.",
                    "score": -1,
                    "author": "Maximum_Hornet7463"
                }
            ]
        }
    ]
}