{
    "id": "13jonj9",
    "score": 15,
    "title": "A trait that I picked up after downloading Reddit is giving extensive feedback",
    "author": "Sufficient_Pumpkin90",
    "date": 1684290211.0,
    "url": "https://www.reddit.com/r/Cornell/comments/13jonj9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Idk if anyone has had a similar experience, but before I would just like disagree or agree without putting too much thought into things I don’t really care about. Now I give extensive feedback and long paragraphs to my friends or others asking for my opinion even if I don’t care too much. \n\nMight delete this it doesn’t seem like ppl would care/relate lol",
    "comments": [
        {
            "level": 0,
            "comment": "Everyone I regularly and comfortably engage with has come to know me for my ungodly long essay lengthed texts. \n\nI'm not sure when this happened exactly but I do know that I've been on reddit for about the same amount of time. I'm not saying it was reddit because idk if this started before or after I started using it but I'm definitely crediting the internet in some manner",
            "score": 9,
            "author": "Impressive_River8929"
        },
        {
            "level": 0,
            "comment": "Haha you’re not alone I guess, one of the reasons I love reddit is because you can find some great quality answers to very specific questions! I honestly think it’s underrated a lot by people but hey, it helps maintain the quality of the conversations we can have here to an extent. Now I’m not responding to people in paragraphs per se, but the time I spend on here has given me a unique insight into a wide variety of perspectives and opinions, so I think a bit more about my own opinions now.",
            "score": 4,
            "author": "0reoperson"
        },
        {
            "level": 0,
            "comment": "Finish high school",
            "score": 3,
            "author": "CanadianCitizen1969",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shut up",
                    "score": -1,
                    "author": "Sufficient_Pumpkin90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't drink and drive at prom! You're going to prom, right?",
                            "score": 1,
                            "author": "CanadianCitizen1969",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Already went",
                                    "score": 0,
                                    "author": "Sufficient_Pumpkin90"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok",
            "score": 2,
            "author": "ImaKant"
        }
    ]
}