{
    "id": "13rv63c",
    "score": 3,
    "title": "Classes after CS 4780",
    "author": "Substantial_Ice_4993",
    "date": 1685052984.0,
    "url": "https://www.reddit.com/r/Cornell/comments/13rv63c",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a humanities major who took 4780 last semester and really enjoyed it! Curious if anyone has recommendations for similar classes to take after, and what kind of mathematical background is needed for classes like 4789 and 4783? I took 4780 without any math prereqs (literally hadn't taken calc 1 before; studied entrance exam over winter break), so I'm really worried about not being able to keep up in the follow-up classes, but I also really want to keep learning about the subject. Does doing decent in 4780 prepare you enough for future classes?",
    "comments": [
        {
            "level": 0,
            "comment": "Sheesh my question is how the hell you did good + enjoyed 4780 without much math background. It's typically considered a more mathy class that you need to prep for, so props to you\n\nIf you were able to really follow the theory in the notes and all the proofs then you seem pretty ready for advanced ml to me. If you want you can (and probably should) refresh on important linear algebra, probability, and statistics.",
            "score": 12,
            "author": "ItzBritz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Prerequisite: CS 2800, probability theory (e.g. BTRY 3080, ECON 3130, MATH 4710, ENGRD 2700) and linear algebra (e.g. MATH 2940), calculus (e.g. MATH 1920) and programming proficiency (e.g. CS 2110). \n\nOP must be a genius. With no calculus background he could do well and enjoy 4780?",
                    "score": 4,
                    "author": "Grant-James_River282"
                },
                {
                    "level": 1,
                    "comment": "Haha trust me it was an insane amount of time sunk into the class (but was in like 4 social science/humanities classes so I had a ton of time to devote to it). I did really enjoy the theory and spent a lot of time trying to understand all the proofs in lecture so that's really good to hear! In that case might try some of the later classes just to check them out (if they open during add drop), and will definitely keep studying those topics over summer. Thanks!",
                    "score": 3,
                    "author": "Substantial_Ice_4993"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Heard that 4789 is quite different from 4780 and much more mathy (proofs… scary!)",
            "score": 2,
            "author": "Cautious-Review-9326",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah that's a shame(? Probably means it's too hard haha), but good to hear beforehand",
                    "score": 1,
                    "author": "Substantial_Ice_4993"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It preps you for the assignments (as in you will have a solid pytorch foundation) in classes like NLP but the math problems you will encounter in other ML classes are pretty different. Not sure how you managed to self study calc 1,2, and bits of multi + linear algebra up to Hessians in one winter break but ig it worked out for you. NLP probably has the most similar math problems to 4780 (some simple backprop, n-gram probability, etc). CV has much more linear algebra and the math is almost completely not ML related. Reinforcement learning is a ton of pretty hard calc and linear algebra based proofs that are definitely above the level of 4780.",
            "score": 1,
            "author": "Zajiba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooh this is a ton of specific information, really appreciate that. Nlp an CV were definitely on my list so it's sad to hear CV isnt super related, but glad to hear about nlp!",
                    "score": 1,
                    "author": "Substantial_Ice_4993"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can take 4789 /.6789, 4787 / 6787, or 6784, potentially even 6785 if you petition.",
            "score": 1,
            "author": "OkenshieldsEnjoyer"
        }
    ]
}