{
    "id": "1408q8i",
    "score": 0,
    "title": "How much rain do you get in Ithaca?",
    "author": "kr-choi",
    "date": 1685874207.0,
    "url": "https://www.reddit.com/r/Cornell/comments/1408q8i",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do you need a pair of rain boot at the campus? Is an umbrella is better or should have a raincoat to run classes?",
    "comments": [
        {
            "level": 0,
            "comment": "Some form of waterproof shoe is a good idea cause it’s very uncomfortable to walk around with wet socks all day",
            "score": 9,
            "author": "Parzival133113"
        },
        {
            "level": 0,
            "comment": "strongly recommend waterproof footwear, and during orientation it was drilled into me to carry an umbrella on my backpack every single day and I’ve done that for years and never regretted it. The weather can be very unpredictable sometimes, even when the sky looks clear you might exit lecture hall to find it raining.",
            "score": 9,
            "author": "psyberbird"
        },
        {
            "level": 0,
            "comment": "Kinda off topic but what college are you in? If you search them out you will find which buildings are connected or have really short outdoor sections. This is both useful in the rain and the windy, snowy, cold weather",
            "score": 7,
            "author": "brt37",
            "replies": [
                {
                    "level": 1,
                    "comment": "CAS. But don't know dorm assignments yet.",
                    "score": 1,
                    "author": "kr-choi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is no shortcut from North or West campus to the academic buildings. You will have some walk in the weather to deal with.",
                            "score": 3,
                            "author": "brt37"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ithaca tends to get plenty of precipitation, but there’s not usually huge amounts of standing water, so rain boots aren’t really needed. Rain jacket or umbrella is a personal preference, but you should have one of them.",
            "score": 10,
            "author": "Tchemgrrl"
        },
        {
            "level": 0,
            "comment": "https://www.nrcc.cornell.edu/wxstation/ithaca/normal.html",
            "score": 3,
            "author": "aonealj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the link",
                    "score": 1,
                    "author": "kr-choi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember (graduated 7 years ago- where has the time gone) most people having rain boots. Ithaca can be rather windy so I would recommend a jacket over an umbrella but both I recall both certainly in use.",
            "score": 7,
            "author": "brt37",
            "replies": [
                {
                    "level": 1,
                    "comment": "brightly colored rain boots were trendy back then.  Waterproof ankle high boots will handle the rain, snow, and slush in between.  When I was working on campus I had an umbrella in my car but rarely used it.  There will be times when you'll want one though.",
                    "score": 4,
                    "author": "ithacaster"
                },
                {
                    "level": 1,
                    "comment": "Thank you. Do you recommend a jacket or raincoat to the knee?",
                    "score": 1,
                    "author": "kr-choi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just something that's water proof. The rest is probably personal preference. Largely you will be fine with a jacket but there are a few days over 4 years where the skys just open up",
                            "score": 3,
                            "author": "brt37"
                        },
                        {
                            "level": 2,
                            "comment": "I’m transferring from UF where it rains really really heavily. I had a raincoat and an umbrella, but in my opinion a small umbrella is better because it protects you from a lot more rain than a coat does, and can be useful in an emergency when you didn’t think it would rain",
                            "score": 3,
                            "author": "Jolly_Law_501",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good to know. Thank you.",
                                    "score": 1,
                                    "author": "kr-choi"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I often have problems using umbrellas in Ithaca because of the wind. There are lots of rainy days that also have very strong winds that can easily flip your umbrella inside out. I almost never carried an umbrella and always used my jacket, the only issue is that it doesn’t keep your backpack dry.",
            "score": 2,
            "author": "Starfish-baddie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you have any recommendations on choosing a rain jacket that covers a backpack?",
                    "score": 1,
                    "author": "kr-choi"
                }
            ]
        }
    ]
}