{
    "id": "145g2py",
    "score": 3,
    "title": "CS Math Requirement Question",
    "author": "yuuzuuu",
    "date": 1686342996.0,
    "url": "https://www.reddit.com/r/Cornell/comments/145g2py",
    "media_urls": [],
    "other_urls": [],
    "postText": "Considering majoring in CS (A&amp;S), but unsure of which lin alg class to take.\n\nI know they give the option between the 1110-1120-2210 arts sequence and the 1910-1920-2940 eng sequence, but I was curious if you're allowed to combine the two for the purposes of fulfilling the math requirement, e.g. 1120 -&gt; 2940.\n\nI took 1120 and did well, but I've heard the engineering maths are more application-based while the math dept. classes are more theoretical, which is why I'd prefer taking 2940 given the option.\n\nIs this at all advisable/allowed? I did see 1920 listed as a prereq for 2940, so I assume some multivariable calc would be necessary, which I'm willing to self-study. Or should I just suck it up and take 2210?",
    "comments": [
        {
            "level": 0,
            "comment": "I had a great experience with 2210. One of the best classes I've taken here. Honestly if you don't mind a little proof I think linear algebra is an important enough topic that you should have a solid theoretical foundation in.",
            "score": 7,
            "author": "echefcy",
            "replies": [
                {
                    "level": 1,
                    "comment": "But to answer your question, no, you don't have to take 1920 for 2940 (in fact it's probably better to take linear algebra before vector calculus). And prereqs are generally not enforced here anyways.",
                    "score": 3,
                    "author": "echefcy"
                },
                {
                    "level": 1,
                    "comment": "I took 2940 and regret not taking a different class to get a better theoretical foundation. OP if there’s a chance you will ever be in a field that uses Lin Alg extensively, don’t take 2940.",
                    "score": 2,
                    "author": "StudyBio"
                },
                {
                    "level": 1,
                    "comment": "I took 2940 and regret not taking a different class to get a better theoretical foundation. OP if there’s a chance you will ever be in a field that uses Lin Alg extensively, don’t take 2940.",
                    "score": 1,
                    "author": "StudyBio"
                },
                {
                    "level": 1,
                    "comment": "Who did you take it with if you don’t mind sharing?",
                    "score": 1,
                    "author": "yuuzuuu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tim Riley",
                            "score": 1,
                            "author": "echefcy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 1,
                                    "author": "yuuzuuu"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Took 2210. Don’t do it. Please go take 2940. Your gpa will thank you. The proofs are no joke if you’ve never had proof experience.",
            "score": 5,
            "author": "NotVinny0125",
            "replies": [
                {
                    "level": 1,
                    "comment": "As to answer your question about if it’s allowed to take either one; yes, it doesn’t matter. You can totally take 1110-1120-2940.",
                    "score": 2,
                    "author": "NotVinny0125",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's great, thank you!",
                            "score": 1,
                            "author": "yuuzuuu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No problem! Good luck 👍",
                                    "score": 1,
                                    "author": "NotVinny0125"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "will never forgive my advisor she told me to take 2210 my first semester freshman year with no proof experience :)",
                    "score": 2,
                    "author": "PoinT_-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I had the same experience… I’ll never forgive 2210 Fall 2022…",
                            "score": 1,
                            "author": "NotVinny0125"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1920 is not at all a prereq for 2940, I think it's there because all engineers have to take 1920 anyways and it introduces the idea of working with more than 2 dimensions - you will be more than fine taking 2940 without 1920.",
            "score": 4,
            "author": "EvilWarlord838"
        },
        {
            "level": 0,
            "comment": "Tbh there are certain areas of CS (and ECE in my case) that demand a really strong background in Lin alg. I took 2940 and am lowkey regretting not taking the math dept one",
            "score": 3,
            "author": "lynxeffectting",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could you possibly elaborate on which areas specifically? I’m mostly just interested in getting a typical SWE role, but I am kinda interested in ML or possibly data science",
                    "score": 1,
                    "author": "yuuzuuu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LinAlg is used extensively in graphics and ML. Basically anything that deals with spaces and dimensions.",
                            "score": 3,
                            "author": "echefcy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see, thanks",
                                    "score": 1,
                                    "author": "yuuzuuu"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}