{
    "id": "1484l3e",
    "score": 5,
    "title": "Incoming Freshman: Admitted Off the Waitlist &amp; Don't Know If I Should Commit",
    "author": "blueebanisters",
    "date": 1686624503.0,
    "url": "https://www.reddit.com/r/Cornell/comments/1484l3e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I'm a recent admit to AAP off the waitlist for the Class of 2027, and I'm deciding whether to commit. My major is Urban and Regional Studies, and I plan to minor in Public Policy or Political Science. I'm currently committed to UC Berkeley, and I've grown attached to the community I've found at Cal. However, Cornell offers a more well resourced Urban Studies program and deeper connections along the East Coast. \n\nBerkeley and Cornell both pioneered Urban Studies programs at the undergraduate level and continue to be two of the best in the world, so either way I can't go wrong but am still very conflicted. I've grown up in large cities, mainly NYC, and find the thought of isolation and brutal winters in Ithaca to be daunting, unlike in the Bay Area where I'd have a temperate climate and a mirage of activities at my disposal. I'd be in Ithaca for only 6 semesters though because AAP has a semester in NYC and another in Rome, but three years in Ithaca is still a long time. \n\nI guess my main dilemma is: do I prioritize my immediate career after finishing my undergraduate studies by choosing Cornell or being in an environment where I'm more comfortable at Berkeley? That's not to say Berkeley doesn't have amazing resources as well; it's one of the best for Urban Studies and one of the best schools in the world regardless. I'm just concerned about how its more West Coast-oriented alumni network and weaker advising will affect me in the future, not to mention its student body size.\n\nAny advice would be appreciated. As you can probably tell, I'm indecisive and an overthinker.",
    "comments": [
        {
            "level": 0,
            "comment": "If you’re already attached to UC Berkeley, go there.",
            "score": 23,
            "author": "TheBlackDrago"
        },
        {
            "level": 0,
            "comment": "Do you plan to work on the East Coast or West Coast upon graduation? Pick UCB for West Coast.  Pick Cornell for East Coast. \n\nYou probably know this better than I do: which coast provides a better opportunity for an Urban Studies major?  Go with where your best job offerings are.",
            "score": 19,
            "author": "Grant-James_River282"
        },
        {
            "level": 0,
            "comment": "i go to cornell and live 20 minutes out of berkeley — chose cornell over berkeley aswell\n\ngo to cornell. we had one day of snow in the fall and it rained all fall in berkeley. you’re home for the worst part of winter. there’s much more to do in ithaca than berkeley unless you enjoy walking piss-ridden streets and fearing for your safety. \n\nbut this decision should be made based on where you see yourself living in the future. if you wanna be on the west coast, you’ll have a better network at berkeley. if you wanna stay out east, cornell will hold higher prestige.\n\nalso, let’s be real here — you may have found some people online going to berkeley but i’m guessing you haven’t actually met them or made any real personal connections with them — most people in college don’t end up staying close with the very first people they meet minus their roommates, so don’t make this decision based on online strangers",
            "score": 6,
            "author": "TheBossPineapple"
        },
        {
            "level": 0,
            "comment": "I somehow enjoy that people shit on Ithaca while knowing nothing about it. It prevents it from being the cesspool that is California. \n\nIn reality, you’ll likely never be in a place with that much clean air, nature, and educated people in your life again if you spent time in Ithaca. Waterfalls integrated into the campus, colorful forestry, altitude views. Boohoo you “can’t do anything” but enjoy nature, explore the local town, or immerse yourself in the campus community. You’re only at undergrad for a few years too, how about also studying? Lmao. Maybe Ithaca could bore you as a place to live forever, but as a place to do undergrad? City people smh \n\nAlso now that I’ve spent sufficient years in California, fuck that place. Literally an overcrowded, overpriced desert. I’ll never understand.",
            "score": 9,
            "author": "qwik_question",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, as someone who has lived in places with brutal winters, Ithaca winters are not brutal. There's maybe a few days out of each winter where there's a lot of snow or the temperature is below average, but for the most part winters are not that bad here. We don't get the crazy snow that Buffalo, Rochester, or Syracuse gets because we are mostly sheltered from lake effect snow.",
                    "score": 4,
                    "author": "Usagi179"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before deciding do some research on safety issues at Berkeley. I know someone who is transferring out because of lack of security.",
            "score": 4,
            "author": "chuckedeggs"
        },
        {
            "level": 0,
            "comment": "Cornell has notable issues with student support and community, so if you already feel attached to UC Berkeley on an emotional level I wouldn't throw that away. I'm no expert in your field but I can't imagine the difference in resources would be so distinct that Berkeley would hurt your chances at a career post-grad.",
            "score": 0,
            "author": "itslilimethinks"
        },
        {
            "level": 0,
            "comment": "As someone in the URS major from California, I had trouble with the same decision. I ultimately chose Cornell for a multitude of reasons which I can briefly go over if you want. Regarding you wanting a community feel, the URS major at Cornell is very small (like 30ish?) which is cool because you get to know everyone pretty well, especially since we have similar interests and often find ourselves in the same clubs and activities. AAP itself is also a small community, and with most of our classes is one area, it’s nice to see familiar faces all the time. Also, while the weather in the Bay Area is certainly better, it’s not socal so they still get a lot of gloom and rain which can be pretty depressing too. Personally I think there is no benefit of Cal over Cornell unless you have in-state tuition or plan on living in California in the future. Cornell offers a lot of cool individual opportunities (especially Cornell in Rome!) that are built to allow you to find your individual passions and study pretty much whatever you want. I would check the curriculum of Cal URS vs Cornell URS, but I can almost guarantee that Cornell URS curriculum has wayyyyy more flexibility and fun. If you have any questions you can ask me, but I would 100% say pick Cornell.",
            "score": 1,
            "author": "Stunning-Celery2183"
        },
        {
            "level": 0,
            "comment": "go to berkeley\n\nthink about what matters to you more in the long run. if you think you can grit your teeth and make it through 4 years at a place you're less attached to for the big bags waiting for you at the goalzone, plenty of ppl here are probably in your same boat. join the party. on the other hand, if you'd rather enjoy your experience at a perfectly great campus and don't mind figuring things out later (the thing is, resonating more with the place/people you work with has its own 'up' advantage in terms of finding opportunities post-grad that truly resonate with you as well), you might find that you regret not choosing berkeley. at the end of the day, it's all a learning experience and you'll be fine wherever you go. it seems like it's head vs. heart. so follow whichever has consistently made you happier in life.\n\ni hope this helps",
            "score": 1,
            "author": "raspberrypie2223"
        },
        {
            "level": 0,
            "comment": "The median family income of a student from Cornell is **$151,600**, and **64%** come from the top 20 percent. \n\nThe median family income of a student from U.C. Berkeley is **$119,900**, and **54%** come from the top 20 percent.\n\n[https://www.nytimes.com/interactive/projects/college-mobility/university-of-california-berkeley](https://www.nytimes.com/interactive/projects/college-mobility/university-of-california-berkeley)\n\n&amp;#x200B;\n\ngo where the money is at. people pay 70k to go to cornell, vs 30k to berkeley. Just my thoughts.",
            "score": 0,
            "author": "mondodb"
        }
    ]
}