{
    "id": "qov789",
    "score": 1136,
    "title": "Cornell Alert: Anyone know whats going on?",
    "author": "pw11111",
    "date": 1636311520.0,
    "url": "https://www.reddit.com/r/Cornell/comments/qov789",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just got a cornell alert saying to avoid the arts quad, anyone have any idea whats happening?\n\nEveryone please be safe and hopefully this is resolved soon.\n\nEdit: We are going to just get ahead of this and turn this into a megathread for this situation.\n\nEdit 2: We put the subreddit into restricted mode temporarily to avoid the mountain of posts. New posts will not show up for now, but you can still comment\n\nEdit 3: If you see people giving advice such as leaving where they are sheltered, please report it, we dont want people to get hurt for following bad advice. Everyone please stay safe and locked down unless directed to do otherwise by authorities.\n\nEdit 4: Cornell confirmed that there is a bomb threat. We still dont know if there is anything else, so please stay safe and locked down.\n\nEdit 5: We took the subreddit out of restricted mode. Still keep all stuff related to this in this thread, but you can post again. ",
    "comments": [
        {
            "level": 0,
            "comment": "Please, don't make our job harder than it is already. If the news/comment you have to share is insensitive or from an unconfirmed, unverified, untrustworthy source, don't post it.",
            "score": 1,
            "author": "luminous_moonlight",
            "replies": []
        },
        {
            "level": 0,
            "comment": "To the professor that gaslighted the first young woman that shared in the Zoom Community Support group for this incident...wow. Did that actually happen",
            "score": 16,
            "author": "Relevant-Week5364",
            "replies": [
                {
                    "level": 1,
                    "comment": "What happened??",
                    "score": 6,
                    "author": "SuchStretch979"
                }
            ]
        },
        {
            "level": 0,
            "comment": "love that during all of this I have a prelim tomorrow 🙃 really selfish that Cornell has barely issued any statements or made accommodations for work we were unable to complete during this crazy time",
            "score": 13,
            "author": "traylblayzer"
        },
        {
            "level": 0,
            "comment": "We didn’t even need a new thread… bad look for Cornell that we now have an active emergency post that we’ll just leave up",
            "score": 30,
            "author": "I-TG2-I",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean if I’m a prospective student and I see that in 3 days there was a bomb threat and a gunman on campus I’d be hesitant to attend, especially with the attempts to disarm the police",
                            "score": -10,
                            "author": "I-TG2-I",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There’s not a gunman on campus. There was a shooting at the dmv. The shooter fled to Cayuga heights and has yet to be found by police, so everything within a one mile radius is on shelter in place as a precaution. The shooting was well over a mile from campus and did not involve students or people affiliated with Cornell.",
                                    "score": 7,
                                    "author": "Testingcheatson"
                                },
                                {
                                    "level": 3,
                                    "comment": "Literally happens to every big university.",
                                    "score": 3,
                                    "author": "EvilJamesMay"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This seems pretty updated: \nhttps://ithacavoice.com/2021/11/local-schools-cornell-enter-lockdowns-due-to-police-pursuit-in-cayuga-heights/",
            "score": 9,
            "author": "Jakyland",
            "replies": [
                {
                    "level": 1,
                    "comment": "why would Ithaca school district end their shelter in place when the suspect is still on the loose? I guess all schools in Ithaca are incompetent…",
                    "score": 5,
                    "author": "traylblayzer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Police helicopter spotted over Cayuga heights",
            "score": 11,
            "author": "Stonktard69",
            "replies": [
                {
                    "level": 1,
                    "comment": "according to flightradar24 the helicopter came from Rochester\n\nhttps://fr24.com/B407/29ce4701",
                    "score": 6,
                    "author": "Jakyland"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "WTF",
                            "score": 2,
                            "author": "starsweburnedaway",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://twitter.com/14850today/status/1458170926474973187?s=21",
                                    "score": 1,
                                    "author": "afacewithaview2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sunday: Red light\n\nMonday: Green light\n\nTuesday: Red light",
            "score": 44,
            "author": "jay_et"
        },
        {
            "level": 0,
            "comment": "Hopefully my CHEM 2510 lab report is postponed",
            "score": 7,
            "author": "roselia4812"
        },
        {
            "level": 0,
            "comment": "Someone called into IHS this morning saying they were gonna shoot up the school… police deemed it not credible. Tf is going on around here",
            "score": 24,
            "author": "Stonktard69",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is that time again in the fall semester. When people drop classes, people get stinky, and people get fed up.",
                    "score": 2,
                    "author": "roselia4812"
                }
            ]
        },
        {
            "level": 0,
            "comment": "BRO WTF IS GOING ON SHITHACA??",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I missed my testing and need to go ASAP so Cornell doesn't turn off my ability to school AND I need to go to office hours.\n\n\nCornell:",
            "score": 13,
            "author": "bui1tdifferent"
        },
        {
            "level": 0,
            "comment": "Have we tried turning Ithaca off and back on again?",
            "score": 21,
            "author": "redditmuffin"
        },
        {
            "level": 0,
            "comment": "Does this mean shelter in place for everyone or just North?",
            "score": 10,
            "author": "mongster_03",
            "replies": [
                {
                    "level": 1,
                    "comment": "phone call says shelter in place for the entire campus with north campus also locking doors and windows",
                    "score": 12,
                    "author": "starsweburnedaway"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah shit here we go again",
            "score": 13,
            "author": "RobotChad100"
        },
        {
            "level": 0,
            "comment": "Again bruh 💀",
            "score": 13,
            "author": "KlassicKayXO",
            "replies": [
                {
                    "level": 1,
                    "comment": "at least we know what’s going on this time",
                    "score": 12,
                    "author": "gase456"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be fair, the report was that there's an active shooter AND a bomb threat. If they put out an alert saying there's an active shooter AND a bomb threat, people wouldn't know whether to shelter in place or evacuate. That probably would've been a worse situation",
                    "score": 3,
                    "author": "CapDris116",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Check the email to the community from VP Malina. It said the caller claimed to have automatic weapons AND explosives",
                                    "score": 2,
                                    "author": "CapDris116"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Butts",
            "score": 5,
            "author": "grugcaveguy"
        },
        {
            "level": 0,
            "comment": "i hate to be kind of selfish in saying this but, what happened yesterday (even though it was of no consequence) kind of sent me into a bad depressive spiral. I hope everyone is ok and knows that there are people here ready to support you. The isolation here is only temporary and I'm thankful for the community in helping me realize this. I hope no one suffers too much from this because I wouldn't wish what i went through on anybody. Thanks",
            "score": 27,
            "author": "normiedelight"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -22,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Millennial\" doesn't mean \"young person.\" Current undergraduates are not millennials.",
                    "score": 11,
                    "author": "VisitingFromNowhere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, it's not like the definition of generations is written on stone tablets, but the vast majority of those who write on this would place today's undergraduates outside of that generation:\n\nThe Pew Research Center, for example, defines millennials as those born between 1981 and 1996 and that age range has been accepted by others. Current undergraduates are Generation Z. \n\nYou're not being downvoted for misusing the word \"millennial,\" though.",
                                    "score": 5,
                                    "author": "VisitingFromNowhere"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m from Cornell lol",
            "score": -9,
            "author": "Puzzleheaded_Day_755"
        },
        {
            "level": 0,
            "comment": "For those who want tomorrow off:\n\n&amp;#x200B;\n\nhttps://cornell.ca1.qualtrics.com/jfe/form/SV\\_efAe0U7rdobcGKW",
            "score": 25,
            "author": "theoryguy"
        },
        {
            "level": 0,
            "comment": "missed my surveillance test cause some creep couldn't get laid 😡",
            "score": 60,
            "author": "chickensquare42",
            "replies": [
                {
                    "level": 1,
                    "comment": "fr",
                    "score": 4,
                    "author": "Spirited_Attorney"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Random shit",
            "score": 10,
            "author": "dehlifd",
            "replies": [
                {
                    "level": 1,
                    "comment": "wacky shit",
                    "score": 2,
                    "author": "RobotChad100"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every comment in this thread in unrelated to the topic or previous comment. It’s like a bunch of people just randomly posting shit.",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome to reddit",
                    "score": 4,
                    "author": "WashuZ"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guys, how can I get into Cornell's vet college?",
            "score": -54,
            "author": "TheDudeman0101"
        },
        {
            "level": 0,
            "comment": "Broccoli Rob at it again",
            "score": 8,
            "author": "Jrh843",
            "replies": [
                {
                    "level": 1,
                    "comment": "r/unexpectedoffice",
                    "score": 1,
                    "author": "FartedBlood"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes my daughter is a student. She sent me this message. \nCampus has been evacuated. Rumors of a bomb threat and active shooter. Columbia has also been evacuated for\nSimilar reasons and Yale had bomb threats on Friday. This is the email we got. I’ve been on and off calls for the last hour but wanted to let you know that I’m safe and give an explanation for why I don’t answer the phone if you call. Please pray that everything remains okay. I will keep\nYou updated when I find out more info.",
            "score": -36,
            "author": "AlwaysFancychick",
            "replies": [
                {
                    "level": 1,
                    "comment": "firstly, it was confirmed as a bomb threat and not an active shooter. secondly, they completed their sweep of the entire campus and no bombs were found let alone was anyone hurt.",
                    "score": 10,
                    "author": "traylblayzer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m getting reports of an active shooter now. Do you know if this is accurate.",
                            "score": 2,
                            "author": "AlwaysFancychick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes I got the alert sent by Cornell themselves, its on North campus they ordered to shelter in place, lock doors/windows, and avoid the area. No instructions for the main campus though.",
                                    "score": 1,
                                    "author": "traylblayzer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for your update.",
                                            "score": 1,
                                            "author": "AlwaysFancychick"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks my daughter is on campus : she texted me this \nBut im in a room where you need keycard access to get in and you need keycard access to get in the building as well\n\nWell I was in a meeting with the police chief debriefing all the shit that happened on sunday when he got the notification that there was the active shooter so he abruptly left our meeting to go respond\n\nIm in a zoom right now with university leadership so im fine. \n\nWhen shit like this happens all the students and administrators are blowing up my phone because im the main communication connector between them",
                                            "score": 1,
                                            "author": "AlwaysFancychick"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "actually it seems that the gunman is near North campus and not on it as of an hour ago",
                                            "score": 2,
                                            "author": "traylblayzer"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oct 5th, young man calls in to police saying that there is multiple bombs and an armed gunman in two school in California… \n\nhttps://abc7news.com/amp/mountain-view-hs-bomb-threat-st-francis-high-school-san-jose-presentation/11085479/",
            "score": 12,
            "author": "Stonktard69"
        },
        {
            "level": 0,
            "comment": "The jiadagod twitter is posting a bunch of threads with emails from her alleged cyberstalker. Seriously creepy shit",
            "score": 46,
            "author": "Calamamity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who is jiadagod?",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The girl who's being threatened by the guy who called in the bombs. If you want to see the creepy emails, here you go: https://twitter.com/jiadagod",
                            "score": 3,
                            "author": "aimiria"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "rip to everyone who missed their covid tests and don't have access to student center for pre enroll tmr",
            "score": 62,
            "author": "No_Locksmith6215",
            "replies": [
                {
                    "level": 1,
                    "comment": "if they were vaccinated it wouldn’t be a problem:))",
                    "score": -25,
                    "author": "traylblayzer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Many of us are vaccinated but still have a mandatory surveillance test once a week",
                            "score": 10,
                            "author": "klytai_av",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yo really..? why",
                                    "score": 2,
                                    "author": "traylblayzer"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "lmfao",
                            "score": 1,
                            "author": "mypointofview44"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the email from Cornell:\n\n&gt;Cornell University Police Department (CUPD) immediately began investigating and issuing real-time alerts to urge students, faculty, staff, visitors, and community members to evacuate central campus and avoid the area\n\nPretty sure they said to \"shelter in place\" for the first hour...",
            "score": 38,
            "author": "ThePrime222"
        },
        {
            "level": 0,
            "comment": "I hope Andy is ok.",
            "score": 6,
            "author": "FromThePort1990",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its Drew",
                    "score": 5,
                    "author": "jnybrsco00",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's bonerchamp",
                            "score": 5,
                            "author": "a_ron23"
                        },
                        {
                            "level": 2,
                            "comment": "I’m not gonna call you that",
                            "score": 7,
                            "author": "uyghurs_in_paris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i can’t control what other people do…",
                                    "score": 4,
                                    "author": "jnybrsco00"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know this was an extremely serious situation, and I've been very tense and anxious all day, but you have to admit it's drop dead hilarious that the suspect is almost certainly some deranged incel whose motive is trying to force some egirl to date him by faking bomb threats at famous universities. Brah really thought that was going to work.",
            "score": 103,
            "author": "sovietdoppelganger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mental illness is hilarious bruh 🥵 I bet his childhood was rough af too 👌😂💯",
                    "score": -3,
                    "author": "Afterbirth_Mods",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ok, look. there's a little bit of a difference between \"mental illness\" and \"about to be extradited to the US to face federal charges worth 10 years in prison for a threat of large-scale violence\". just a little.",
                            "score": 6,
                            "author": "myncknm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The difference is untreated mental illness",
                                    "score": 1,
                                    "author": "Afterbirth_Mods",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The vast majority of those with mental illness, even untreated, do not resort to violent acts, so in what sense is the violence attributable to \"mental illness\"? And don't you think excusing violent acts due to \"mental illness\" does a disservice to the vast majority who do not resort to violence?",
                                            "score": 2,
                                            "author": "myncknm",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Obviously not what I was saying. It’s not funny is what I was saying",
                                                    "score": 1,
                                                    "author": "Afterbirth_Mods"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yo wait this is what happened?!",
                    "score": 3,
                    "author": "Apprehensive_Fee1922"
                },
                {
                    "level": 1,
                    "comment": "And now the FBI is [bouta...](\nhttps://imgur.com/t/rip/iozpNk9)",
                    "score": 14,
                    "author": "bui1tdifferent"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kill fuck marry: snow days, bomb threats, warm spring days in February and March",
            "score": 33,
            "author": "Advanced-One7401",
            "replies": [
                {
                    "level": 1,
                    "comment": "Marry snow days,  \nKill bomb threats (obv),  \nFuck warm days in Feb, because they're fun for a little bit, but they only come around due to alarming underlying reasons, and you def don't want them sticking around permanently.",
                    "score": 46,
                    "author": "canteen_boy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this is exactly right",
                            "score": 3,
                            "author": "Skystorm14113"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cool soooooooo arrests when",
            "score": 80,
            "author": "scout-scoot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here's hoping this dingus is in the US (or a sympathetic ally with a workable extradition policy) and doesn't know how to cover his tracks.   \nI'm not holding my breath.",
                    "score": 28,
                    "author": "canteen_boy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Given what the situation is reported to be, it seems like an angry child or teen incel, so it might not be too hard. Especially since the victim who was framed knows them, they might be able to provide info. \n\n\nReading the threats, it’s pretty obviously fake stuff so we’re not dealing with a real mastermind here",
                            "score": 23,
                            "author": "Udontlikecake"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We are now at Defcorn 5",
            "score": 50,
            "author": "micabobo",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "r/woooosh\n\nEdit because wtf spells it without \"wh\"?",
                            "score": 0,
                            "author": "lorcancuirc"
                        },
                        {
                            "level": 2,
                            "comment": "Exactly, the all clear has been announced.",
                            "score": 26,
                            "author": "micabobo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 62,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, I think every other school that got threats deemed them not credible by late/mid-evening and resumed normal activities the day after. I'm not 100% sure on that though and I'd be glad to be proven wrong.",
                    "score": 20,
                    "author": "regiment262"
                }
            ]
        },
        {
            "level": 0,
            "comment": "CornellALERT: Law enforcement has concluded search of the Ithaca campus; no credible threats were found. It is safe to resume all normal activities.\n\nSeems we have to have class tomorrow",
            "score": 55,
            "author": "Keplex2117"
        },
        {
            "level": 0,
            "comment": "[https://cornell.ca1.qualtrics.com/jfe/form/SV\\_efAe0U7rdobcGKW](https://cornell.ca1.qualtrics.com/jfe/form/SV_efAe0U7rdobcGKW) CORNELL QUALTRICS SURVEY... here's an qualtrics survey through cornell so even if you've signed other, please do sign this one as well!!!... Qualtrics \"has been reviewed by CIT's security team and approved for conducting surveys at Cornell.\" i believe it's more likely to help!",
            "score": 70,
            "author": "Cautious-Basil-2054"
        },
        {
            "level": 0,
            "comment": "&gt;CornellALERT: Law enforcement has concluded search of the Ithaca campus; no credible threats were found. It is safe to resume all normal activities.",
            "score": 12,
            "author": "ProjectWHaT"
        },
        {
            "level": 0,
            "comment": "CornellALERT: Law enforcement has concluded search of the Ithaca campus; no credible threats were found. It is safe to resume all normal activities.",
            "score": 11,
            "author": "EBY2002"
        },
        {
            "level": 0,
            "comment": "ALL CLEAR",
            "score": 18,
            "author": "brosbeforefoes"
        },
        {
            "level": 0,
            "comment": "Just got the all clear from Cornell alert",
            "score": 11,
            "author": "cornellgirl11"
        },
        {
            "level": 0,
            "comment": "CornellALERT: Law enforcement has concluded search of the Ithaca campus;  \n no credible threats were found. It is safe to resume all normal   \nactivities.",
            "score": 10,
            "author": "Harmonyano"
        },
        {
            "level": 0,
            "comment": "For everyone who has felt really anxious all day/are not feeling okay, I am here for you. Please reach out if you need anything. This day has been surreal and despite all of our best efforts, truly panic inducing, and yeah, I am here for anyone who feels this toll is quite hard to carry!",
            "score": 65,
            "author": "DatNeuroBioNerd22",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is very sweet of you &lt;3 I'm glad people are looking out for others. I was worried I would come on here and see people saying like \"bro there wasnt even a real threat why are yall so anxious lol\"",
                    "score": 18,
                    "author": "scout-scoot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;bro there wasnt even a real threat why are yall so anxious lol\n\nbro there wasnt even a real threat why are yall so anxious lol",
                            "score": -5,
                            "author": "throwaway_fight_club",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "v edgy good job sir very edgy you did it",
                                    "score": 3,
                                    "author": "scout-scoot"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "bruhhh this is fucked up",
            "score": 44,
            "author": "rey_chem"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 50,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dont care about karma lol. If there was a way to disable it for posts like this I would. It is just really hard to moderate when there are 100 different posts for the same stuff.",
                    "score": 43,
                    "author": "pw11111"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it needs to be qualtrics through cornell: https://it.cornell.edu/qualtrics",
                    "score": 26,
                    "author": "pw11111"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The Twitter of @jiadagod (the one implicated in the tweet threats against Columbia) is now public again. Some of her replies include “Hello. I’m the person who was tagged in the post where the bomb threat was made. The guy behind the “JiaNakamura” account was impersonating as me and has been trying to impersonate as me as of recently to get my attention.” “Hello. I would like to state that I have absolutely nothing to do with this sicko aside from the fact that he’s in love with me and refuses to leave me alone. He’s been making bomb threats at big universities in order to get my attention.”  “He has been sending me emails constantly in order to get me to unblock him. I’ve already contacted the police department about this and there is currently a case going on.” This sounds pretty likely to be what caused the incident at Columbia, and I’d bet on it being the case at Brown and here too. Columbia and Brown both got an all clear I’ve heard from various outlets/articles, so if that’s the case, we’re probably fine too, but stay cautious until you hear officially.",
            "score": 75,
            "author": "rprofilet",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is why we can't have nice things.",
                    "score": 14,
                    "author": "canteen_boy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "martha where is your email??? it doesn’t take 5 hours to write a message that says nothing",
            "score": 55,
            "author": "bigredron38",
            "replies": [
                {
                    "level": 1,
                    "comment": "What do you expect her to say anyway?",
                    "score": 1,
                    "author": "Artudytv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Express solidarity, condolences, and call for unity.",
                            "score": 1,
                            "author": "Mass_awakening"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I fail my prelim bc of some twitter incel that’s just sad",
                    "score": 40,
                    "author": "aimiria"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 25,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seems about right considering how the last several years have gone so far.",
                            "score": 9,
                            "author": "canteen_boy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me tomorrow at WSH getting my makeup covid test:\n\nGuy from WSH: do you have an appointment today?\nGuy: at Willard straight?\nGuy: Were you the one to give the bomb threat?",
            "score": 84,
            "author": "sillyelff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bro always says “how can I help you” 💀",
                    "score": 12,
                    "author": "REdd1212"
                },
                {
                    "level": 1,
                    "comment": "FOULLLLLL 💀💀💀💀",
                    "score": 15,
                    "author": "arodael"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My productivity was greatly diminished today. :/",
            "score": 137,
            "author": "carpetmagicianlaughs"
        },
        {
            "level": 0,
            "comment": "part of me thinks the perpetrator is intentionally targeting a bunch of schools with fake bomb threats to make any future bomb threats less serious, and then strike with a real one",
            "score": 66,
            "author": "ContactImpossible815",
            "replies": [
                {
                    "level": 1,
                    "comment": "It seems like some dude got rejected by his Minecraft gf and started making bomb threats.\n\nhttps://twitter.com/jiadagod/status/1457499212891844609",
                    "score": 18,
                    "author": "Higuy54321"
                },
                {
                    "level": 1,
                    "comment": "This also happened at Brown, Yale, and Columbia, so this guy definitely has something against the ivies.",
                    "score": 7,
                    "author": "canary_quinn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This seems plausible considering the other info I’ve come across, which is basically that this is some elaborate scheme to coerce a girl from the internet (“jiadagod” on Twitter) to date him.",
                                    "score": 6,
                                    "author": "canary_quinn"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 58,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it’s up to the professor’s discretion, no?",
                    "score": 2,
                    "author": "platoschild"
                },
                {
                    "level": 1,
                    "comment": "I think that’s an easy no.",
                    "score": 11,
                    "author": "canary_quinn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just kidding sign this one : https://cornell.ca1.qualtrics.com/jfe/form/SV_efAe0U7rdobcGKW",
            "score": 81,
            "author": "nahartailuj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can you delete this so that people don't accidentally sign the wrong one? Thanks!",
                    "score": 4,
                    "author": "pirouette_all_day",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "edited",
                            "score": 2,
                            "author": "nahartailuj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 1,
                                    "author": "pirouette_all_day"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I will absolutely sign, though I do want to stress that the need for mental health-related breaks is important regardless of whether there are traumatic events on campus or not.",
                    "score": 42,
                    "author": "Ekejejj"
                },
                {
                    "level": 1,
                    "comment": "Cornel does not recognize external petitions. Tell them to make a Qualtrics petition.",
                    "score": 71,
                    "author": "hwm0523",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It needs to be through cornell's version of qualtrics: https://it.cornell.edu/qualtrics",
                                    "score": 3,
                                    "author": "pw11111"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "okay word will do",
                            "score": 19,
                            "author": "nahartailuj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "pls post link if u do!",
                                    "score": 8,
                                    "author": "gongfugang",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "someone else made a new one! check above",
                                            "score": 1,
                                            "author": "nahartailuj"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it normal to have classes in the same buildings a terrorist threat, police evacuation, and lockdown extended late into the night before without any admin communication or are we just well-adjusted to an abusive relationship?",
            "score": 126,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "true",
                    "score": -3,
                    "author": "throwaway_fight_club",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you sound like a guy with no latent anger issues or mental problems at all mr. I Want To Start a Fight Club",
                            "score": 4,
                            "author": "scout-scoot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "why would you insult my mental illness? what's wrong with you",
                                    "score": -1,
                                    "author": "throwaway_fight_club",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i seriously do not understand ppl like you like i do not get it. a stressful thing happens and you go on reddit to anonymously harass people who got. stressed? like huh.",
                                            "score": 5,
                                            "author": "scout-scoot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "please don't react like this. no need for hate",
                                                    "score": -2,
                                                    "author": "throwaway_fight_club",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "you dont know me or how i reacted this is such a weird insult. i feel like you're just looking for attention on here so youre being edgy for a reaction. take this block freak",
                                                            "score": 5,
                                                            "author": "scout-scoot",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "why are you like this?",
                                                                    "score": 0,
                                                                    "author": "throwaway_fight_club"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They could and should cancel classes for tomorrow. While some people may feel safe going to class tomorrow, many people (including myself) feel very distressed from today and do not feel safe going to sit in a 600 person lecture tomorrow morning, or going to a class in a building I had to run out of today.",
                            "score": 23,
                            "author": "osdesi"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty sure Martha had us sign away all our rights in the student compact that nobody read. We are just cogs in the machine... I have no feelings anymore. 😣",
                    "score": 32,
                    "author": "Anson192"
                },
                {
                    "level": 1,
                    "comment": "This!!!!!",
                    "score": 8,
                    "author": "gongfugang"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NY Governor is monitoring the situation\n\n[https://twitter.com/GovKathyHochul/status/1457471100632371202](https://twitter.com/GovKathyHochul/status/1457471100632371202)\n\n&gt;My team and I are monitoring the situation at Cornell and Columbia Universities and are ready to offer any support that may be needed.  \n&gt;  \n&gt;I urge everyone to follow guidance from university and local law enforcement.\n\n&amp;#x200B;\n\nWSJ article on the bomb threats\n\n[https://www.wsj.com/articles/ivy-league-schools-report-bomb-threats-11636324598](https://www.wsj.com/articles/ivy-league-schools-report-bomb-threats-11636324598)\n\nBloomberg\n\n[https://www.bloomberg.com/news/articles/2021-11-07/evacuations-ordered-at-columbia-cornell-after-bomb-threats](https://www.bloomberg.com/news/articles/2021-11-07/evacuations-ordered-at-columbia-cornell-after-bomb-threats)\n\nWashington Post\n\n[https://www.washingtonpost.com/dc-md-va/2021/11/07/ivy-league-bomb-threats/](https://www.washingtonpost.com/dc-md-va/2021/11/07/ivy-league-bomb-threats/)",
            "score": 41,
            "author": "ProjectWHaT",
            "replies": [
                {
                    "level": 1,
                    "comment": "I Google news searched University bomb threat, and saw that in addition to half the Ivies (Cornell, Columbia, Brown, Yale), at least 3 schools in Ohio had bomb threats over the past few days (Ohio University, Miami University, and Cleveland State). One of the articles from local news in Ohio (from I think a threat on Thursday) mentioned that \"investigators had determined\" those threats came from the same individual.  \n  \nFWIW I've been through a few of these in my day, a couple back in HS, one in college, obviously everyone takes it seriously but you know, although tbh in HS none of us did, we played hacky sack outside until the all clear, but really different crowd than your typical Cornell student I suppose. Sorry I'm getting off topic. But you know, try to relax a little and take it in stride",
                    "score": 12,
                    "author": "kidsinballoons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's important to find a balance: this one wasn't credible, but it doesn't mean you should always assume future ones won't be. basically, take emergency situations seriously when they arise, but recognize that there was no real threat this time, and while anxiousness is valid, it is no longer a useful emotion for your body",
                            "score": 2,
                            "author": "Skystorm14113"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "brown had one today too. so freaky, why target all the ivy leagues?",
            "score": 37,
            "author": "TheGreatMastermind",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let me preface this by saying I have no evidence to support this, but it is possible that there is no real reason why someone would choose the Ivies except that they wanted to make threats of some school and picked some of the biggest/ most famous names out of a hat. You don't think of some random community college when you think of \"universities\", nor are you as likely to make national news.",
                    "score": 53,
                    "author": "ShowMeTheData19",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "IDK Not all prestigious schools are Ivy's. Even in the \\*northeast, schools like NYU and Georgetown are plenty prestigious.",
                            "score": -11,
                            "author": "Jakyland"
                        },
                        {
                            "level": 2,
                            "comment": "for sure, but it’s so egregious . feels like the plot of some campy movie",
                            "score": 12,
                            "author": "TheGreatMastermind",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, most public figures get death threats all the time.  It happens when someone/something is high profile.  There's 300 million people in the country and like 15 universities that everyone knows.  Sometimes people are just severely mentally ill, and being humans there is only so much that everyone can do about it.",
                                    "score": 6,
                                    "author": "ShowMeTheData19",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that’s fair. i’m glad everyone seems to be safe at least. the threat was cleared at brown",
                                            "score": 3,
                                            "author": "TheGreatMastermind",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "me too",
                                                    "score": 2,
                                                    "author": "ShowMeTheData19"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "when is martha going to make an announcement....",
            "score": 31,
            "author": "No_Locksmith6215",
            "replies": [
                {
                    "level": 1,
                    "comment": "When there’s something to be said?",
                    "score": 10,
                    "author": "mrabbit1961"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "A disgruntled Ivy League reject targeting all Ivies ?",
            "score": 56,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who was that kid who put an ad up on a TCAT bus to get off the waitlist? Wonder what he’s up to…",
                    "score": 82,
                    "author": "gongfugang"
                },
                {
                    "level": 1,
                    "comment": "Ohio got threats yesterday. It’s going around.",
                    "score": 19,
                    "author": "mrabbit1961",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Meaning what",
                                    "score": 1,
                                    "author": "hoodoohoodootoo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I caught this tweet completely by chance like a couple hours after it was originally posted and a fucking chill went down my spine. I can't see anything on any of Jiagods linktrees because it's all private, which would make sense if some lunatic was stalking her. \n\nThen there was that account that posted screenshots of the files they made containing the threats and saying they demanded to be dm'd. \n\nThat whole thing is just fucking strange.",
                                                    "score": 11,
                                                    "author": "Cheddarmelon"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}