{
    "id": "ri3mx2",
    "score": 538,
    "title": "Thinking of rushing Delta Omicron next semester",
    "author": "BurRipRol10110",
    "date": 1639698596.0,
    "url": "https://www.reddit.com/r/Cornell/comments/ri3mx2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Heard that they’re the largest frat at Cornell- something like 1,000+ actives? Heard the hazing process is kinda whack though. So crazy that some schools are trying to shut their chapters down. Something about self isolating for 10 days and having to do your finals as well? Also apparently they like to stick stuff up your noses once a week, kinda weird if you ask me. If any of the current brothers could give more info on the frat I’d appreciate it!",
    "comments": [
        {
            "level": 0,
            "comment": "Too bad there’s already 900+ new members, good luck getting a bid",
            "score": 124,
            "author": "AncientVacation5974"
        },
        {
            "level": 0,
            "comment": "don't worry, if you talk to one of the bros for &gt;15 minutes while standing within six feet you're a shoe in",
            "score": 58,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "There is a business frat whose chapter designation is Delta Omicron. I wouldn't bring it up in your interview though.",
            "score": 32,
            "author": "ad-lapidem"
        },
        {
            "level": 0,
            "comment": "Here you go. It's an international music fraternity. \n\nhttps://www.delta-omicron.org",
            "score": 23,
            "author": "fatednomad"
        },
        {
            "level": 0,
            "comment": "rushed last sem &amp; didn’t get a bid :( gl tho",
            "score": 12,
            "author": "htxnycbrownboy"
        },
        {
            "level": 0,
            "comment": "I hear they give every pledge $500 city bucks after rush",
            "score": 12,
            "author": "greens_giga_chad"
        },
        {
            "level": 0,
            "comment": "Love thisssss",
            "score": 24,
            "author": "Sydd2k"
        },
        {
            "level": 0,
            "comment": "You ask as if you aren't part of the frat already. Have you ever gotten surveillance tested before? Taken finals online? You're already in the frat bro whether you want to or not. No need to rush",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Don't worry, we're ALL going to be in Delta Omicron by spring - every single one of us rustlers, cut throats, murderers, bounty hunters, desperados, mugs, pugs, thugs, nitwits, halfwits, dimwits, vipers, snipers, con men, Indian agents, Mexican bandits, muggers, buggerers, bushwhackers, hornswogglers, horse thieves, bull dykes, train robbers, bank robbers, ass-kickers, shit-kickers and Methodists.",
            "score": 3,
            "author": "CaptLatinAmerica",
            "replies": [
                {
                    "level": 1,
                    "comment": "Travis Bickle is that you ?",
                    "score": 1,
                    "author": "Fabulousonion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "$50 says this kid tried to rush a frat and got dropped for annoying everyone.",
            "score": -4,
            "author": "josue_is_dae_way",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was annoying",
                    "score": 6,
                    "author": "bigjafar"
                }
            ]
        }
    ]
}