{
    "id": "v4va2u",
    "score": 503,
    "title": "Pls help starbucks college ave workers",
    "author": "doeinfrontofbakerlab",
    "date": 1654368659.0,
    "url": "https://www.reddit.com/r/Cornell/comments/v4va2u",
    "media_urls": [],
    "other_urls": [
        "https://preview.redd.it/viqo0zfehn391.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=f6840bba5d8daa940b081483018c5ca5e9ef555c"
    ],
    "postText": "Starbucks is literally ✨union-busting✨ and shutting down the COLLEGE AVE STARBUCKS. This store is high-volume and has nothing to do with revenue/customers. Not only that, but management has avoided saying whether the workers (the ones that unionized!) will be relocated to a different location. Of course, they did this when students are gone for the summer so not many students can physically help protest, but please help this gain traction.\n\nhttps://preview.redd.it/viqo0zfehn391.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=f6840bba5d8daa940b081483018c5ca5e9ef555c",
    "comments": [
        {
            "level": 0,
            "comment": "How can we help?",
            "score": 49,
            "author": "Harmonyano",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boycott them, and encourage others to do them. Losing revenue is much more meaningful than a few mean comments on their twitter.",
                    "score": 40,
                    "author": "isaaciiv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm pretty sure they're going to bet on the likelihood that people will cave the boycott and not really follow through with what they they say; and even assuming they did,  it wouldn't be enough harm their business since they'd probably not see a huge effect in their numbers in the long run. The best case scenario might be to convince the university from not selling Starbucks products all over campus, but it's likely not to happen.",
                            "score": 16,
                            "author": "epichatchet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People won’t follow through. They have too long been conditioned to take what these corporate entities give them without complaint and besides  how will they ever live without their grande mocha iced lattes??",
                                    "score": 12,
                                    "author": "sickofthebsSBU"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey some of us are at home tea drinkers! Don't lump us in with the Starbucks mob",
                                    "score": 1,
                                    "author": "Impressive_River8929"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If theyre shutting down what will boycotting it do",
                            "score": 3,
                            "author": "PhilUpTheCup"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Various outlets on the Cornell campus serve Starbucks coffee. Perhaps it’s time a message was sent by the students that they won’t tolerate their university supporting anti-labor corporations.",
            "score": 44,
            "author": "SockyMcSockerson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mannible serves (at least last time I was there) coffee from Gimmee!  My regular daily coffee is usually from Copper Horse.  The other one I often have is from Wegmans.",
                    "score": 6,
                    "author": "ithacaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It closed, now the corp that runs the dining halls has that space and it sucks.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Particularly when there are some national award winning local roasters right here in Ithaca that cornell can sell instead",
                    "score": 37,
                    "author": "Frosty-Literature-58"
                },
                {
                    "level": 1,
                    "comment": "I guarauntee you 90% of students could not give the slightest fuck. You may see your cause as noble, but the world runs on money and satisfaction, not moral righteousness.",
                    "score": 4,
                    "author": "redtonicspear"
                },
                {
                    "level": 1,
                    "comment": "starbucks coffee is also worse than peets and copper horse by a lot. and copper horse is local",
                    "score": 2,
                    "author": "sniperman357"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m just waiting for all of the fucks from Dyson to come in chat to defend their corporate overlords 🍿",
            "score": 23,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why is it illegal to close the store?",
            "score": 5,
            "author": "Sigong",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not illegal to close stores in general, but in this case, two of the cited reasons very much imply that this was for union busting. Especially considering that one of the reasons is directly related to our strike back in April.",
                    "score": 2,
                    "author": "sireggan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I posted earlier that this is exactly what would happen. They would close the store, wait several years and reopen it.",
            "score": 2,
            "author": "John_Galt1984"
        },
        {
            "level": 0,
            "comment": "Fuck SBUX\n\nTo all the workers getting laid off bc of these corporate pussies:\n\nI see in the you the strongest and smartest people who've ever lived. I see all this potential and I see squandering. God damn it, an entire generation making coffee, waiting tables, slaves with white collars. Advertising has us chasing cars and clothes, working jobs we hate so we can buy shit we don't need. \n\nWe're the middle children of the history man, no purpose or place. We have no Great war, no Great depression - our great war is a spiritual war, our great depression is our lives.",
            "score": 9,
            "author": "Accomplished-Lion620",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmfao",
                    "score": 3,
                    "author": "k0_crop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait I just came to green street for the bus and saw Starbucks getting closed by 2pm today. Thought it was because students left and they have less customers now, but it’s actually union busting? This is crazy. Not gonna buy from them until workers are getting their basic needs met.\n\nEdit: I mixed up the two stores. Hope the downtown store stay intact.",
            "score": 4,
            "author": "Deborah-Z",
            "replies": [
                {
                    "level": 1,
                    "comment": "all the Ithaca stores are closing at 2 for the summer but the store shutting down is unrelated",
                    "score": 3,
                    "author": "pragmatic_whale",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! I don’t usually come to SB so I wasn’t aware.",
                            "score": 1,
                            "author": "Deborah-Z"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably going to be an unpopular take, but I wish somebody that was a part of this strike initiative to be more vocal and provide alot more visual evidence regarding the extent of the perceived damage of the grease trap. It's really hard to believe that this issue, coupled with general disgruntlement, would really justify a strike. Rather simply notifying a local authorities regarding food safety, or OSHA guidelines seems like that would be a good place to start without going nuclear. That said, it's unclear to what lengths they have gone to solve this issue.\n\nPrincipally, the role of a union is not to wrest power and control from a company for its own sake, but provide an avenue in which employees under its umbrella feel as though they have negotiating agency and a well established line of communication. The problem is if you demonstrate that your union is willing to stop working on a dime and go nuclear for things that might not merit such a response, the company isn't exactly going to be inclined to continue that line of communication. Moreover, we know that this particular Starbucks makes most of its money at two different segments of time in the year, each lasting for 4.5 months. Deciding to impact the most lucrative month (after already having been impacted by covid restrictions) of the first 4.5 months of this year does not bode well in the corporate cost/benefit analysis of maintaining the property. Moreover, we have no idea what the property value/rental costs and operating costs on that Starbucks are... nevermind that a huge competitor (CTB) is closer in proximity to campus and is alot more popular. It's also unclear how the taxing works.\n\n Bottom line, It's a bit disingenuous, I think, to shout union busting when there are many factors that go into this issue and alot of the details aren't freely available. This isn't in defense of Starbucks per se, but apprehension that a company would simply shut its property down because they don't want to fix a grease trap. There has to be more details.",
            "score": 8,
            "author": "nrobsahtes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Serious question: do Starbucks have grease traps?  I thought their menu was mostly already prepped food.",
                    "score": 38,
                    "author": "pinniped1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unclear, I vaguely remember that It was actually a grease trap from the previous occupiers of the property, or perhaps was next door and grease leaked through the wall. Those were details that floated around when the employees were discussing unionizing.",
                            "score": 24,
                            "author": "nrobsahtes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, ok... Previous occupant's grease trap makes sense.\n\nA latte and onion rings would be...odd.",
                                    "score": 15,
                                    "author": "pinniped1"
                                },
                                {
                                    "level": 3,
                                    "comment": "Homie your vague remembrance could have been helped by a [quick Reddit search](https://www.reddit.com/r/Cornell/comments/u53p1x/collegetown_starbucks_is_on_strike/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) or by supporting the Starbucks workers when they spoke on campus, where the store manager described the grease trap in such vivid detail that they cut themself off because they grossed out the crowd ([link to recording](https://www.ilr.cornell.edu/worker-institute/blog/events/moment-movement-starbucks-and-slow-drip-starting-union)). \nBottom line, it’s a little disingenuous to pretend that you, an outsider, assume you have better view of the situation than the workers who are in the store every day. Sbucks union busting is notorious and highly documented, if you watch the workers talk in the above link. Get off your high and mighty stool and actually listen to what the workers are saying, even if you’re not going to support.",
                                    "score": 20,
                                    "author": "FriendlyVoodoDoll",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh my gosh that was aggressive.\n\nNowhere have I assumed to have a better view of the situation, in fact all of my language is built around not knowing various details and being aware of the existence of unknown unknowns. I'm speaking to this specifically BECAUSE I'm an outsider with no feelings one way or the other on the issue of this starbucks. Unfortunately the camp that i fall into is one thay the vast majority of students on campus do as well... and admonishing me(or anybody else like me) for expressing what I think and feel, as well as my various apprehensions is the last thing that is going to get anybody any support.\n\nThere is no high horse commentary... just a desire for a more complete approach to the issue beyond just \"they don't fix grease trap, we strike, they shut the store down\". This is not something that really anybody can form an opinion on in a vacuum, and asking people to rise up based on that narrative alone isn't in good faith.",
                                            "score": -5,
                                            "author": "nrobsahtes"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "the high speed (combi) ovens they use to warm sandwiches are notorious for producing lots of grease.",
                            "score": 1,
                            "author": "sniperman357"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Covid has been around for 2 years and this is not the first summer during covid. Last summer the store did not shut down and the summer before the store did not shut down, so what makes this one different?",
                    "score": 6,
                    "author": "pragmatic_whale",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "my point is surrounding compounding issues. that covid has been impacting the revenue for longer than just this spring semester only goes to evidence the potential instability of income. That store could even be breaking even, but has value in maintaining the Starbucks name at a popular location amongst younger patrons (who will presumably go on to make enough money to sustain regular coffee purchases down the road)... it could even run at a slight deficit. But now with the strike thrown into the mix and potential company perception that the union cant really be worked with at an acceptable level, they bail.\n\nmy only point is that their goal is to make money, not to spite random workers in Ithaca. They would only shut down an operation if their cost/benefit analysis indicated that it was an appropriate decision going forward given the environment that particular property rests in.",
                            "score": -1,
                            "author": "nrobsahtes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What about the unionized Starbucks popping up around the country? You don’t think that anti-union Starbucks would shut down a location to make an example? Regardless, with the margins that Starbucks makes on those drinks (50 cents for a little bit of oat milk…) and the volume of orders that they get from Cornell students in Ctown, even with a union there is no way that that Starbucks is going under. I think you lack a sense of the bigger picture here. There are definitely reasons that Starbucks would shut down beyond a pure cost benefit analysis",
                                    "score": 13,
                                    "author": "der_98",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't know anything about Starbucks unions popping up around the country. I don't know Starbucks's position on unions. \n\nWhat I do know is that I (hopefully) am a reasonable person who falls into an educated group of people, who has a particular outlook on things. That outlook is a similar one to many: detached from this problem. Im merely speaking to what i would expect, just like many others would expect as well, as somebody who does not have a lot of impetus to be informed.\n\nI'm a molecular biology major, I don't follow this. This issue does not fit into my sphere of interest of things that I would pursue independently... and I'm not the only one who is like this. Thus if I express that a particular issue doesn't appear intuitive, the goal shouldn't be to talk me down, but perhaps inform me or onlookers. \n\nAside from all of that, nothing I've said has actually been refuted. The closest thing to refuting what I've said is your statement regarding margins that Starbucks makes x y and z, vs what they pay.... but we don't know that do we? We done have the numbers... if we do that would be an important thing to share. Everything that I've been told so far revolves around what people think happens, and what somebody said something looks like.  So a reasonable person who is apprehensive about such things is berated by various people on an online forum because they want something more concrete to hold onto? Where that more concrete thing to hold onto would be an avenue for not just me but for other people to use as a reason to support this initiative?\n\nThis whole thread is disappointing to me...",
                                            "score": -11,
                                            "author": "nrobsahtes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It seems like you’re using “detached from the problem” as a synonym for uneducated. You don’t know anything about these issues but are speaking in a way as to claim the people who are actually educated about them are wrong. You also have no way to know you represent the majority opinion.",
                                                    "score": 18,
                                                    "author": "Fisherman_Worldly",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "detached from the problem, much like many problems, is generally the nature of the masses. Its not simply that i am uneducated about the nature of starbuck's attitude towards unionizing and how that affects the particularities here in ithaca (a pretty esoteric thing to be aware of, certainly if one finds themself in stem). Thats not to say these things are mutually exclusive, i may be uneducated as well... but thats not the point.\n\nWhat i am doing is speaking to things in a way that a reasonable person might be skeptical of a given assertion. This does not mean that i am saying what IS.... rather that i cant but sure that what another says IS. I am not claiming anybody is wrong btw... i have been asking for something concrete all throughout this thread.\n\nI dont even plan on being pedantic about a very vague figure... all i would want is something specific regarding this starbucks and how it interfaces with what is currently being seen. An employee in the know could probably do a bit of legwork and have gotten some info from the manager well before this blew up regarding revenue and pricing and blah blah blah. My point is that nobody is producing these things, and yet people feel super comfortable about shouting union busting.\n\nYoure right, i have no way to know i represent the majority opinion... just a strong inkling given what we know about public sentiment in general. Never mind that if i didn't represent the majority opinion, the corollary would be that more than half of the Cornell student body is aware of, is educated in the intricacies of, and supportive of this issue regarding the college town Starbucks. Now if you're going to make that claim, then idk what do do after that. \n\nRegardless, its a relatively intuitive idea, I think, to suppose that supporters who are passionate about a given issue are a lot more vocal than people who are unaware of said issue. Thus, while it may appear to be very popular issue, the majority opinion is unclear. One way to show this would be just looking at the last presidential election, where more people voted than ever before... yet that amounted to 40% of the country. That 40% was very polarized and loud, but certainly the majority of the country wasn't compelled enough to act. \n\nAgain, please look, in good faith, at what I am saying without addressing some construct of what I appear to be because i skeptical or in opposition to a given viewset. I am merely voicing my opinion and looking to BE informed, and being as cordial as possible while being berated by various people for doing so.",
                                                            "score": 6,
                                                            "author": "nrobsahtes",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It is not the job of the employees to educate you. You have the resources to educate yourself. Did you even watch the video that was linked?",
                                                                    "score": 13,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "again, i don't have any impetus to educate myself. This is the nature of people... i don't know how to express this any other way. If you are in such favor of an initiative that you with to promulgate it throughout your community, you don't put the ownership on various individuals who have never taken the time out of their day to look at these things. If one makes an assertion, the burden of proof is on them... and all of the impetus to give that proof is there too. How does regular Cornell student who can get coffee from 8 other places have any reason to look into this issue unless they are shown the issue.\n\nThis whole tangent isn't even relevant to the problem at hand, because I'm simply evidencing why the average person wont have it in there purview to take action about this particular thing out of thin air. My whole thing is hoping to find a solid piece of \"this is what is happening and here is proof why Starbucks is just trash\" and nothing I've been shown says that.\n\nEdit: this will be my last reply on this thread. I wish somebody would take the time to take what I'm saying in good faith and actually look to find a halfway point where we could have reasonable discourse. I wish you all luck, but frankly this issue lost my support simply because everything I'm see is reminiscent of willfully blind ideology.",
                                                                            "score": -4,
                                                                            "author": "nrobsahtes",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;  i don't have any impetus to educate myself\n\nIf you don't want to educate yourself, fine. But quit talking on this issue then. You've commented more than anyone else in this thread, despite claiming over and over that you don't want to educate yourself on this matter.",
                                                                                    "score": 12,
                                                                                    "author": "Nickyjha"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Dude that’s a really shitty argument. This doesn’t affect me so I have no incentive to educate myself on it? I drink coffee about twice a year, I go to Starbucks less than that. This shut down will not affect my life directly whatsoever but I recognise the bigger issue at hand, I’ve been provided the same info as you have. The hope is that people can care about things that don’t just concern them. I guess it’s fair to say that people don’t have the incentive to care and therefore wont but it’s a stupid argument to make. That’s what the point of these posts is? To try to get people to care? What exactly do you expect them to do?",
                                                                                    "score": 13,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Your responses read so fucking pseudo intellectual. Learn some self awareness my friend. A little introspection goes a long way",
                                                    "score": 1,
                                                    "author": "der_98",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Man get off me. This shit is 7 days old. Find a new battle to fight",
                                                            "score": 1,
                                                            "author": "nrobsahtes"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There were definitely worse-off Starbucks to shut down. This was targeted action against my store.",
                                    "score": 1,
                                    "author": "sireggan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 25,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "dunno why my expressing a slightly controversial opinion in a relatively cordial manner invites comments like this. If you want to be rude, be rude... but understand that viewpoints like mine are like those that exist in the majority of people, that one (presumably you) who supports the unionized employees of Starbucks might want to reach.\n\nPeople who support them are fewer in number, and this movement will only get steam by reaching out and showing a reason to care. If your goal is to disparage those who earnestly respond to an issue in a with no indication of disrespect, you're doing a disservice to those you probably support.",
                            "score": 18,
                            "author": "nrobsahtes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What you're suggesting is that there's a decent chance that SBUX decided to close this location because they think that in whatever time-frame is relevant to them they'll have net losses or that the resources being used there could make more money elsewhere. I highly doubt that location has anything even remotely close to net losses, so even with whatever the union wrangles it's very unlikely that that location will be anything but a regular net gain. As for the option of using the resources to open a location elsewhere, that could be the case, but again, I doubt that long-term the gains of where ever the resources of this closed location go will make more than this location. There are multiple SBUX locations in smaller and/or less rich college towns across the US (e.g. Normal, IL and DeKalb, IL) that have maintained their locations. If the choice isn't due to the net the location is making, then it's just a clear case of SBUX corporate bringing down the anti-labor hammer, possibly at their own expense.",
                    "score": 1,
                    "author": "drrocket8775"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol over a grease trap ...",
            "score": 2,
            "author": "ezraisthebestra"
        },
        {
            "level": 0,
            "comment": "🙌🙌🙌",
            "score": 1,
            "author": "awomaster0614"
        },
        {
            "level": 0,
            "comment": "This is fucking bullshit!!!! Solidarity ✊",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Bruh I was planning on joining when I move to Ithaca after summer because I’m already working at Starbucks…well, doesn’t look too good for me now 🫤",
            "score": 1,
            "author": "Dexrad24"
        },
        {
            "level": 0,
            "comment": "Context on the closure:\n\nBack in early April, we won the entirety of Ithaca for the union in a landslide vote. At College Ave in particular, it was 19-1. One of the main reasons for our decision to organize back in the fall was the November bomb threat, where our manager at the time forced us to reopen because it was \"JUST a bomb threat,\" not an active shooter threat (verbatim, isn't that awful?). Therefore, we unionized to have a say over the policies in our store, like for safety.\n\nIn mid/late April, we went on strike. There is a grease trap in our store (we don't even use grease at Starbucks, the trap hasn't been maintained in years) that overflowed, spreading old grease and wastewater all over the ground. We were expected to clean it with mops and rags (a clear OSHA violation to force workers to do that). My shift supervisor got permission from the workers on at the time for them to walk out, and he told customers to leave due to a wastewater incident, locked the doors, and they went on strike! We were on strike for an entire day before Starbucks temporarily fixed the grease trap and cleaned it with the alleged intent to replace it eventually.\n\nHowever, on June 3rd, Starbucks management told workers that our store would be closing on June 10th with less than a week's notice to find new jobs or know whether or not we would get to keep our jobs and just relocate. They specifically cited the grease trap as a reason why our store is closing, which implies that they would rather close our store completely than meet the demands of our strike. They also cited \"time and attendance\" issues, which only came about because they halved the store's hours so that much of the bargaining unit, especially closers, were unable to work full shifts and had to give up their hours.\n\nThis is illegal and retaliation for union organization, through and through. I don't know how else to explain it, there is convincing and damning evidence that there is no economic reason to permanently close a store with extremely high traffic during the school year. It's outrageous. There are more benefits than burdens to keeping the store open and negotiating a collective bargaining agreement with my store, but Starbucks would rather use us as an example of \"what happens when workers try to stand up.\"\n\nThe NLRB has been made aware by our lawyers. We will continue to fight for our store to be reopened and its workers reinstated. However, this could take several months. Expect occasional updates on the matter.",
            "score": 1,
            "author": "sireggan"
        },
        {
            "level": 0,
            "comment": "I went to this Starbucks a few times and the workers always tried to get me to put on a mask. \n\nLooks like another example of draconian covid policies scaring away customers and being bad for business.",
            "score": -183,
            "author": "sevectorv2",
            "replies": [
                {
                    "level": 1,
                    "comment": "My local Starbucks always followed local covid ordinances.  Whether one thought they were draconian or not wasn't cause to go full Karen on the baristas.\n\nBelieve it or not, I was successfully able to complete my coffee order with a mask on.",
                    "score": 34,
                    "author": "pinniped1"
                },
                {
                    "level": 1,
                    "comment": "Unbelievably bad take",
                    "score": 57,
                    "author": "rollerCrescent"
                },
                {
                    "level": 1,
                    "comment": "“draconian” 🤓",
                    "score": 45,
                    "author": "YoNaoi"
                },
                {
                    "level": 1,
                    "comment": "how tf did u get into Cornell bro you gotta be stupid as shit",
                    "score": 20,
                    "author": "Anxiousapathy20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you don’t even go here lmao",
                            "score": -27,
                            "author": "sevectorv2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yea but I know it’s supposed to be an ivy and for some reason this post got recommended 2 me so slightly shocked idiots of this level exist in an Ivy too",
                                    "score": 13,
                                    "author": "Anxiousapathy20",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s called legacy admissions",
                                            "score": 9,
                                            "author": "CornCornell",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m first-gen and low income…",
                                                    "score": -6,
                                                    "author": "sevectorv2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s hard to believe",
                                                            "score": 7,
                                                            "author": "CornCornell",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No, it’s not.",
                                                                    "score": 2,
                                                                    "author": "sevectorv2"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "bro what are you talking about",
                    "score": 18,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Man you are one crazy dude",
                    "score": 5,
                    "author": "CoconutEducational16"
                },
                {
                    "level": 1,
                    "comment": "Russian troll account.",
                    "score": 13,
                    "author": "NewPhoneNewUsermane"
                },
                {
                    "level": 1,
                    "comment": "Not right now vector",
                    "score": 1,
                    "author": "thruawayacc2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn bro, so you basically just live your life like “it’s impossible to be treated better by your employer”? That’s pretty pathetic mate",
                    "score": 12,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "“Don’t organize and lose your shitty job! Instead, break your back for your shitty job and just let them abuse you progressively more, squeezing every minute of productivity they can out of you beyond your breaking point :)”",
                    "score": 17,
                    "author": "rslashhellagay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Free market. People are desperate enough to work in shit conditions, workers with higher standards are passed over by companies in favour of those they can more easily take advantage of.\n\n\nEdit: I say this as someone who 1. Works hard, 2. Job hunted exactly as you suggested. And guess what? I love the job I have now. It’s exactly what I want, because it serves the exact purpose I aim for it to fulfill. It also took months to secure. Months. There was a whole month I had no income, being in between starting this job and ending my previous. Why did I leave my previous jobs? Because they treated me like shit.\n\n\nI’m making my reality as I envision it to be. I have goals. When I cut my tongue on my teeth advocating for my needs, ambition bleeds. But none of it has been easy. Nothing has been handed to me, not without me first searching or fighting for it.  So when you brush off real peoples real struggles, you only show how insular of a bubble you’ve been afforded to live in, thus far— or how internalized your apathy towards the economic plights of the non elite classes has become.",
                                    "score": 9,
                                    "author": "rslashhellagay"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}