{
    "id": "138letc",
    "score": 4,
    "title": "Deferral for medical reasons",
    "author": "Beliavsky",
    "date": 1683292501.0,
    "url": "https://www.reddit.com/r/amherstcollege/comments/138letc",
    "media_urls": [],
    "other_urls": [
        "https://www.amherst.edu/offices/controller/student-accounts/tuition-refund-policy)"
    ],
    "postText": "Our son accepted a spot at Amherst for Fall 2023, but he has mental health issues. We are seeking treatment for them, and this will be our focus this summer. If we do not think he is ready to attend college in the fall, what is the procedure for requesting a deferral, and how likely is it to be granted? Can you defer for a semester or only for a full year? For Fall 2022, when was the tuition due?\n\nWe mentioned to our son that he could have deferred admission at the May 1 deadline, but he did not want to do that. I see that [tuition insurance](https://www.amherst.edu/offices/controller/student-accounts/tuition-refund-policy) is available through Dewar. If we enroll our son we will buy that.",
    "comments": [
        {
            "level": 0,
            "comment": "Hi, I actually ended up in the same position and have already requested a deferred enrollment by May 1. In the commitment form, I believe that there was an option to state your plan, and that was how I requested my deferral. Now that the deadline has passed, I think it is the best to email/call the Admissions office to see whether they are still accepting deferral requests. I believe that they should because I have until June 1 to submit my gap year plan to them.\n\nI’m unsure whether they will grant it yet, but I think as long as my honesty and thoughts about taking action regarding mental heath show through, they’ll probably understand and grant it. Hope that it will the case for your son too!\n\nSorry I don’t know the answers to the tuition questions. But I’m excited to see your son on campus next year as deferred admitted student together :)",
            "score": 1,
            "author": "thu_h"
        },
        {
            "level": 0,
            "comment": "As a student with some mental health difficulties, I will say that the school has thus far been very supportive. I do not no the exact timeframe for deferral, but I have friends who deferred for a whole year.",
            "score": 1,
            "author": "ToyYodaToyota"
        },
        {
            "level": 0,
            "comment": "This is one of the most legitimate reasons to defer for a year. I hope your son is ok and the treatment works quickly, I am very sure that a school like Amherst would be very understanding and more than willing to grant this deferral. Good luck!",
            "score": 1,
            "author": "Conscious-Owl-7429"
        }
    ]
}