{
    "id": "na2cjj",
    "score": 18,
    "title": "What’s something you wished you’d known your freshman year?",
    "author": "sydthecoderkid",
    "date": 1620753890.0,
    "url": "https://www.reddit.com/r/amherstcollege/comments/na2cjj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! Incoming class of 2025 here. I’m psyched to get onto campus, and am just sort of twiddling my thumbs waiting for August to roll around. So I was wondering what other upperclassman think about Amherst/How they would have done their freshman year differently! Of course everyone’s experience is going to be different, but I thought it would be nice to hear other people’s general thoughts.",
    "comments": [
        {
            "level": 0,
            "comment": "Congratulations! Some super specific things that might help or not:\n\n* Every freshman (including myself when I was a freshman) reeks of desperation. Desperation to make friends, to create new experiences, to learn, to grow and this, combined with peer pressure can put you in uncomfortable situations. Try to balance how much you can handle with how much you're willing to explore. FOMO might get to you but find that good line to toe.\n* Get a desk job super early, go to IT / Mead / Keefe / Frost / Beneski. These are the easiest jobs to do by far since you can just sit down and do your homework. \n* Everyone in the beginning is trying to network, it's honestly so cringe, just try to find your group and make it out alive in the first month.\n* It's a small school so rumor / gossip goes around. Try to keep a low profile. I hear the craziest shit about people that are like 6 connections away from me.\n* Get a tablet for note taking, probably saved my life during this pandemic. \n* Talk to professors, ask them about their work and tell them you want to learn from them. If you start freshman year, you can develop that relationship over the next four years which is ideal.\n* Prioritize yourself over clubs and classes. You may feel the need to work super hard for a club or group but try not to, everyone is super understanding.  \n* If you're hungry and trying to get free food, go to Schwemms at the end of the night, they usually have leftover fried foods if it's not a weekend. Be chill about it and you can usually score yourself a couple fries. Or maybe I go to Schwemms too much LOL\n* Don't put your name on every club that interested you at the club fair. You will be bombarded with emails that you have no interest in reading.\n* Read the Daily Mammoth email everyday, make it a part of your morning routine, you will find cool events and great opportunities.\n* The vegan section at Val is honestly fire, don't knock the products there.\n\nGood luck!",
            "score": 11,
            "author": "boblikesbob"
        },
        {
            "level": 0,
            "comment": "Hello and congrats! I'm a rising junior majoring in Education, and here are some things I really wish I'd known, done differently, or am really glad I did freshman year:\n\n* There is definitely nightlife at Amherst - for some reason, I didn't think there would be and it totally caught me off guard. Try not to get too excited and fall prey to constant partying. FOMO is hard, but going to a Thursday party and then having to do work/go to class on Friday even slightly hungover is harder.\n* Your professors want to get to know you - if you're taking a class that really excites you, go to office hours and talk to them about it to kickstart that process. Those connections will help you secure jobs, internships, letters of recommendation, etc. later down the line.\n* Try out lots of different subjects freshman year! You never know what you might end up enjoying, and the open curriculum exists for a reason. I promise you will still have time for major requirements\n* Don't be scared of upperclassmen! I was super intimidated by them at first, but now some of my closest friends are in the class above me. \n* At the end of freshman year, a bunch of clubs/activities/jobs will be looking for people to take on more intensive leadership positions. Do not take every one of these that's offered to you - it gets really overwhelming sophomore year.\n* You are not obligated to only see therapists from the counselling center. Case management will work with you to find resources that are better catered to your needs.\n* When internship season rolls around, don't feel too pressured to find one that exactly matches what you want to do after graduating. Look for things that are tangentially related to your future field of interest or that will give you useful skills regardless of what you go into.\n* In my experience, professors and supervisors at the college are pretty understanding. Ask for help, extensions, or whatever else you might need.\n* Take advantage of the health center - they can do a lot more for you than you might think.\n\nOverall, I agree with a lot of what the other commenter mentioned. Wishing you luck, and feel free to PM me if you have any specific questions!",
            "score": 8,
            "author": "mmkk9677"
        }
    ]
}