{
    "id": "p67blt",
    "score": 9,
    "title": "course registration",
    "author": "autumnleaves13579",
    "date": 1629217745.0,
    "url": "https://www.reddit.com/r/amherstcollege/comments/p67blt",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi! incoming freshman wondering how bad course registration actually is. i got a 1:00 pm time slot; does that mean i should prepare for most classes to be full? \nalso — any general tips appreciated !! very confused atm",
    "comments": [
        {
            "level": 0,
            "comment": "What do you mean by 1:00 Pm time slot. Like when you meet with your advisor? As far as I know, registration opens at the same time for everyone and you need your advisor to approve it before you can register.\n\nOn the same topic, you normally get all the classes you want so really don't sweat it. If you don't, speak to the professor, show up to class the first day, and make your case and they usually try to accommodate as much people as possible.",
            "score": 4,
            "author": "boblikesbob",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!! and by 1:00 pm, i mean that i got an email today saying to show up to a zoom link on the 23rd at 1:00 pm (randomly assigned time) and that’s when i can begin registering for classes. maybe just a freshman thing?",
                    "score": 2,
                    "author": "autumnleaves13579",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just a freshman thing. Be sure to attend it tho, i found registration to be confusing for the first time",
                            "score": 2,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Oh I honestly forgot everything Freshmen year haha but I guess so! Goodluck getting your classes! Honestly one year I literally forgot to register for classes and I had to register during the firsst day of classes oof",
                            "score": 2,
                            "author": "boblikesbob"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got a 3:30 time slot—I’d consider you lucky",
            "score": 3,
            "author": "cheeseandhacker",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! 🥲",
                    "score": 3,
                    "author": "HeadlessRooster101"
                },
                {
                    "level": 1,
                    "comment": "I got 2:30 🥲",
                    "score": 3,
                    "author": "Deputy_Jrtssss"
                }
            ]
        }
    ]
}