{
    "id": "sehpx3",
    "score": 5,
    "title": "Question about being an RA",
    "author": "sydthecoderkid",
    "date": 1643342850.0,
    "url": "https://www.reddit.com/r/amherstcollege/comments/sehpx3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Quick question for anyone who’s an RA/ knows someone who is! Thinking about becoming one for my sophomore year, but I really want to get off the freshman quad. I saw in the description that freshman RA’s get an extra thousand dollar stipend- does that mean people can pick whether or not they’re an RA for a freshman dorm? Wasn’t sure and didn’t want to ask Amherst bussin lmao.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey, former RA/CA/RC/etc here! The extra thousand dollars is actually pretty new and came from a huge unionization effort by the RAs on campus. It’s pretty well-known that first year quad RAs have more responsibilities for community building, so ResLife recently agreed to pay them an extra stipend.\n\nTo answer your question, you can indicate your dorm preference when you apply to be an RA. As a sophomore, you probably won’t get your first choice in dorms, but if you indicate you don’t want to be a first year dorm RA, most of the time ResLife will honor that and give you a non-FYQ RA position. Once you’re given a dorm, though, it’s pretty difficult to get your location changed. This means you need to take your preference form pretty seriously when you apply. Feel free to ask any more questions and GL!",
            "score": 5,
            "author": "PMME_UR_HOPESnDREAMS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your response!! Super appreciated :) quick follow up question- would you say being an RA is super competitive? I have literally no preference for a dorm lol, I just really want a single 🤞🏽",
                    "score": 3,
                    "author": "sydthecoderkid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It honestly fluctuates year by year. Before COVID, around half of applicants would get the job. During the COVID fiasco, ResLife was desperate for applicants and would throw jobs at anyone who wanted it.\n\nIt’ll probably be a little bit competitive this year. One thing to note is that ResLife always prioritizes FLI or minority students for leadership roles, so if you check any of those boxes, you’ll probably be in a good spot.\n\nPS: look into theme housing if your main goal is to get a single! There are some crazy nice rooms  in those setups.",
                            "score": 5,
                            "author": "PMME_UR_HOPESnDREAMS"
                        }
                    ]
                }
            ]
        }
    ]
}