{
    "id": "147zdab",
    "score": 2,
    "title": "This Reddit collapse is really shitty",
    "author": "JH10208282",
    "date": 1686608467.0,
    "url": "https://www.reddit.com/r/offmychest/comments/147zdab",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been reading this site since 2010, I love it.  I love that there's a page for everything and there's this huge base of users who can answer and ask whatever and it's just am absolute treasure of a site.  \n\nBut greed has caught up and ruined it.   I guess all we have to do is switch to the main reddit app, but that app is absolutely garbage.   \n\nI'm just annoyed, I like reddit and I don't like this change coming.   Just a load of bullshit",
    "comments": [
        {
            "level": 0,
            "comment": "I’m still confused about what’s happening, can someone explain me",
            "score": 1,
            "author": "Sososaurus",
            "replies": [
                {
                    "level": 1,
                    "comment": "The easiest way to explain it is that Reddit has allowed other apps to use their API to create their own Reddit Apps. The most popular is probably Apollo. However there’s quite a few out there. If they previously had to pay Reddit it was a fee that was sustainable and these apps could still make money. Reddit is now changing so that the cost will substantially increase. Apollo has said it will cost them $20 million in fees and the chance of ever being able to make a profit is gone. Apollo has announced they will be shutting down on June 30.\n\nMany subs have made their subs private for at least 48 hours to protest this change to Reddit. Many are saying that if they don’t reverse course that they will leave their subs as private for good. This means people won’t be able to use them and will have to find other sources to post or for information. If this happens, Reddit makes a whole lot less money from advertising and from Premium subscriptions. The protest today could tell Reddit what type of user base will be around if they continue.\n\nThe major issue is if third party apps shut down then the only way to use Reddit is their own official app. This could bring more advertising dollars to Reddit. On the other hand, if major subs remain private, the user base could majorly plummet. Reddit is taking a gamble but seem to be supporting their position. The same thing happened with Twitter a few years back. I don’t know what their user base is now but it’s still around so I think Reddit thinks they can do the same.",
                    "score": 2,
                    "author": "infinityandbeyond75"
                },
                {
                    "level": 1,
                    "comment": "Same bro.",
                    "score": 1,
                    "author": "Proof-Development703"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not greed from Reddit, it’s entitlement from users. Reddit is a business and they want to make a profit",
            "score": -2,
            "author": "Soft-Butterscotch128",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's fair.  But you could be destroying your business at the same time",
                    "score": 3,
                    "author": "JH10208282",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Upvotes and echo chambers are basically cocaine to a lot of those people so reddits not in any real danger.",
                            "score": -2,
                            "author": "Soft-Butterscotch128"
                        }
                    ]
                }
            ]
        }
    ]
}