{
    "id": "14892ww",
    "score": 1,
    "title": "I am disappointed with myself to a level where I hate myself.",
    "author": "strongestest",
    "date": 1686640215.0,
    "url": "https://www.reddit.com/r/offmychest/comments/14892ww",
    "media_urls": [],
    "other_urls": [],
    "postText": "I met this girl in my sophomore year of high school, we became friends and then fell in love ( at least that's what I think ), I was always that kid who had tight circle of few friends and then suddenly I got this new friend cum lover and i couldn't ask for more.  During the honeymoon phase of our relationship, everything was going great. She was a straight-A student, beautiful and smart and I was just another kid playing sports and maintaining above-average grades. She was more like my best friend, somebody with whom I shared everything in my mind and but she was somebody who kept a bit of secrecy about her personal life, just a bit, and I was fine with that. So now I had this perfect girl with whom I had planned my whole life in my mind. Then she moved to a different school in junior year and from there things started going downhill. From the time I spent with her, I learnt that her parents were very strict and that made her somewhat a chronic liar and people pleaser. And after she changed school, we never met in person for a long time and during that time we tried to maintain a long distance relationship, but then she stopped making effort suddenly and started lying about almost everything and i started feeling disconnected from her, I tried but then i started to realize that things will end very soon and communication between us was almost dead. And then she called me and broke up with me giving some shit reasons, I was shattered and i decided to move on with my life and not to bother that person again but to my surprise, she again wanted to get back with me after a month and i agreed to that, but that same cycle of lying and dead communication kept going on, and then she broke up with me once again giving some shit reason, and my heart shattered once again. All these happened in a span of 1.5 years. I myself wanted how things were going on to end but I loved her more than anything, all i could say to her was \"I love you\" but these three words couldn't hold the feelings i had for her. And I always thought that she would return to me again after all that shit and that kept happening getting random calls and texts occassionally for very long time, and all that time we got in touch again, i always felt like we should start again but the past always haunted me, then she moved to college and I decided to take a year off and at this time i was mentally tired and fucked up and had pressure to get into a good college and build a career in which she was already ahead of me. And during this time too, stupid me had hopes of us getting back together and every time i got text from her I had butterflies in my stomach.  As time passed I made it to a good college and infrequent conversation kept going on till day I decided that it should stop. And i said really mean and hurtful things to her and the conversation stopped. I removed all contact of her, but couldn't remove her from my heart,  now i was in my sophomore year of college. And then very soon a common friend of ours told me she was in relationship with new guy...and then my heart shattered again. In this almost 4 years of me loving somebody one sided with all my heart and dedication, I never learnt how to love another person, never thought about loving somebody again and made very few friends ,became dull in all spheres of life.\n\nNow today when I am writing this I am sitting in dorm of this good college, completed prefinal year of my degree thinking about future and how life would have been if things went as i planned it in my head, I never tried to get a girlfriend while i kept hearing about her new boyfriend. And I feel like i have lost the ability to love somebody new or maybe now I am afraid to love somebody new. I never shared all this with any person because i didn't feel like sharing, even with my very close friend i made in college with whom i am spending almost all my time.\n\nI decided to write this because I somedays see her in my dreams and today was that day again, I have nothing to say to her but i wanted her to know all these. I am just disappointed with myself to a level where I hate myself.  ",
    "comments": []
}