{
    "id": "148bz4i",
    "score": 1,
    "title": "If loving means being hurt I don't want it",
    "author": "Strict-Business179",
    "date": 1686651449.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148bz4i",
    "media_urls": [],
    "other_urls": [],
    "postText": "My (23M) now ex boyfriend (23M) and I were together for 3 years. We met during the covid situation as a long distance relationship (2h of train). At that time I didn't want to be in a relationship I was only 20 and was livinig my life but as the time went by I realised I like him very much. We played video games together, watched films, series, have the same taste in music but we were also different (he studied history and I studied biology for example)...   \n\n\nIDK if this is relevant but before meeting me he was in a toxic relationship and it affected him at first but being with me made him more and more confident and he overcame little by little the trauma he suffered from. \n\nIn september 2022 he moved on to Paris (we are french, oui oui baguette, and I live in Paris surburbs) to study and get away from his town which he hates. It was nice at the begining but he developped some depressionnal symptoms. He told be that in november, it was so bad that he wrote a suicidal letter and wanted to unalive (I didn't know back then he told me 3 weeks ago). At that time he met a guy (let's call him O)  to became friend with : they spent somee time together and I saw that it was good for him to get some fresh air since he didn't know much people in Paris.\n\nWe were in a group of friends , my friends to be honnest, which with spent most of our time and we were really really close but he didn't feel he was a part of the group and I thought he was kind of delusionnal because I thought they really liked him. The relationship between my ex and the group deteriorated a bit and he spent some more time with O. \n\nAt one point a month ago he confessed me that he was confused because he thought he had some feelings that started to appeared for O but still loved me and that he didn't want to lose me, that I was the best thing that happened to him and he didn't see his life without him. But because of hiis mental health he let some barrier down with this guy and regretted everything that happened between them. O seemed to like my ex aswell and asked my ex to date but my ex didn't agree. \n\nBecause of all of that we decided to split up and stay as friends to work on ourselves (you can imagine that my mental state is not the best right now)... We don't know if this is a definitive break up or just a break for a while. \n\nHere's the thing : He didn't cheat on me and was honnest about his feeling and about being lost. He said that I brought him so much in his life to end it all (he was all teaering and shaking up while we had this conversation) and felt miserable. He also had another suicidal crisis but thankfully he is now fully medically treated and seems to be better. \n\nI regrete everything here : I should've seen how he felt at that time, I should've make more efforts to make him feel good and make him think about something else. We had a routine that he didn't like and I should've done more for him. And i feel like shit since we brokee up, crying every f\\*\\*\\*ing day. \n\nFor now our relationship is better, we talk everyday, he send me a message as soon as he wakes up, we still play video games together and spent some time together in thee weekend. He is coming for my intership defense and I'll go to his... Some signals tell mee that he doens't want to end our relationship (for example he told me to keep his cloth that I have in my closet, that he doesn't wan't to get for now, and some others). And i don't blame hime for going after something that was positive for him especially if he wanted to end his life....\n\nBut since he have a few friends he still talk and see O (whom don't want my ex to date anymore) and it bothers me so much : why does O is getting everything and I get the scraps compared when we were happy together ?\n\nI'm such a mess right now and need time to heal to get something positive back but I love him so damn much (i would die for him) and miss him so damn much.  \n",
    "comments": []
}