{
    "id": "148d8sh",
    "score": 0,
    "title": "I just want a happy relationship",
    "author": "darian1601",
    "date": 1686655915.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148d8sh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just want a happy relationship.\n\nSo back in December I (22m)went home on Christmas leave from the navy and got picked up by this  beautiful girl (22f) I had been talking to for about 2 months from the airport. We spent a lot of time together and we hit it off great I was on cloud 9… soon after I left we found out that she is pregnant. She is also Bi-polar 2.\n\nNot long after she got really mean but we worked through things and I just thought it was the bi-polar disorder. We rushed things because of the pregnancy and got married in March. I told her that I don’t want to joke about divorce or talk about it unless we mean it. Well within a week she was threatening me and got online and looked at consultations. Broke my heart I mean it made me sob and ugly cry like a baby. Then it kept happening and I kind of became numb to it. She’s been really mean and hateful and accuses me of cheating I’ve had friends for years that I grew up with (female) that I shut out and don’t talk to anymore because she thought that I was cheating and I wasn’t at all, I have no desire or any thought of wanting anyone else. \n\nShe’s so hateful anymore… she told me the other day she hopes I go to war and die. She tells me she’s not attracted to me and she doesn’t know why she married me. I ruined her life by getting her pregnant. She doesn’t want the baby because he will remind her of me. She tells me I’m a cheater and I’m a shitty person. And just accuses me of being bad to her when I try my best everyday to make her happy. Obviously I’m not innocent in everything I say things that hurt her when she’s firing on all cylinders. But I apologize she’s probably said sorry to me 8 times the whole relationship. \n\nShe started hitting me but not enough to leave bruises and I left Bruises on her arms from grabbing them so she wouldn’t hit me anymore.  There’s been a couple times where I’ve grabbed her by the throat and told her to stop. I’ve always been the healthy one in relationships never been toxic but she’s turning me into a monster. I’ve never raised my hand to her. \n\nOn Memorial Day weekend I went back home I saw one of my bestfriends who is dating one of my close female friends (because I hooked them up) and my wife asked me about it and at first I lied because I was scared then I told the truth and she threw a cup of McDonald’s hi-ci in my face why I was driving on the highway and I threw one back and she started punching me in the head as hard as she could with her 2 year old in the back seat. Then she threatened to call my command and tell them that I’m AWOL. I took her to her moms house and she wouldn’t get out of my car. She said we’re going back to Florida tonight you need to go tell your mother and brother bye. So I went towards my moms house and she called the sheriffs dispatcher and told them I was holding her against her will she hung up and I took her phone because I wasn’t doing anything wrong (which was wrong and I gave it back within 2 minutes of taking it) she then tried to jump out of the moving car going 40mph and I grabbed her and pulled her in while trying to drive and she took my phone and threw it out the window. I got out of the car to find my phone and she tried getting in the driver seat of my car and driving away so I had to push her into the passenger and take my keys why I look for my phone. When I found it she had gotten her 2 year old out of the car called the dispatcher and told him I kicked her out of the car and made her and her son walk on a long black road then threatened to tell him that the marks on her from me pulling her in the car were from me choking her out. Why I’m driving right beside her asking her to get in. She finally got in and then wouldn’t get out so I could go home. \n\nShe told me she was going to get help and take her medicine more. \n\nThe Bad thing is i do love her and I want her to do right, she’s not all bad and we have fun and do fun things together she just over thinks and accuses me of things to start arguments. Like she tells me she loves me and we go on dates and things like that we just argue so much it’s hard. I’m 22 with a failed marriage. \nI’m not innocent I do my side of things. It she takes it to the extreme. She’s made me toxic. I’ve always been a happy loving guy and I don’t like being this way I don’t know if there’s hope. She had me so low on Memorial Day weekend I just wanted to wrap my car around a tree when it was just me driving alone. I’ve never had a thought like that in my life. She’s just put me in a dark place mentally and I miss the bubbly version of myself. I FaceTime my friends and they ask me why I looks so stressed. I’m not gonna lie my heart hurts because I wanted this to be my forever. I love my stepson I have a little boy on the way. And honest to god I love my wife but I feel like I’m drained. \n\nI was woke up at 4:30 am today being accused of cheating because she dreamt it and she wanted to go through my phone and I told her no\nNot because I have anything to hide but I told her there’s just boundaries. I always let her go through it am I wrong for saying no?\n\nTo the people who listen thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "Wow. So first off, you don’t love her.  You barely know her. You may be married but that is undoable\n\nThe child though. You need to protect them. I would hire the best lawyer I could and try to get custody. Your child deserves better",
            "score": 5,
            "author": "dianaprince76",
            "replies": [
                {
                    "level": 1,
                    "comment": "There’s no way I get custody of my child. She’s a good mom there’s no way for her to be proven unfit because she loves her kids. And I deploy in April.",
                    "score": 1,
                    "author": "darian1601"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She is toxic and you need to get away from her op.",
            "score": 2,
            "author": "Dan_the_man1992"
        },
        {
            "level": 0,
            "comment": "I'm so sorry you are in this situation",
            "score": 2,
            "author": "Dan_the_man1992"
        },
        {
            "level": 0,
            "comment": "Tbh, it could be sth like PPD or post partum insanity that’s affecting her as well. Get her checked out. Is she taking her bipolar meds regularly as well?\n\nYou’re also allowed to fail in life. It’s okay if you just need to leave.",
            "score": 2,
            "author": "restless_otter",
            "replies": [
                {
                    "level": 1,
                    "comment": "How long does it last because her son is 2 and my son isn’t born yet",
                    "score": 1,
                    "author": "darian1601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems most severe symptoms last 2-12 weeks. However, it can also take 6-12 months to fully RECOVER. She needs help NOW.",
                            "score": 1,
                            "author": "restless_otter"
                        }
                    ]
                }
            ]
        }
    ]
}