{
    "id": "148jldz",
    "score": 3,
    "title": "Alone on my birthday",
    "author": "snowtopsthrwy",
    "date": 1686674284.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148jldz",
    "media_urls": [],
    "other_urls": [],
    "postText": "tomorrow is my birthday, im turning 17, and ill be spending it mostly alone. i have my mom and grandma who bought me a cake and everything, but it doesnt really change the fact im alone. 2 weeks ago me and my best friend got into a fight and she had her 3rd attempt. her mom blames me for it, and i cant help but feel that she blames me a little too even if she says she doesnt. tomorrow she will come see me for maybe an hour, at most. its sucky timing. ive spent every day of the past two weeks crying and feeling like shit, and trying to pick up the pieces. but my birthday is tomorrow and i will have lost the most important person in my life. and she doesnt even want to see me. ive been unhappy for a long time but this is the worst feeling ive ever had. i thought at this point in my life id have people around me and i wouldnt have to keep spending these days unhappy. my therapist says they shouldnt blame me, and its not my fault, but thats how i feel. i just wish it could go back. i wish she could spend the day with me. i wish i could tell her how badly i want her to spend the day with me. on her birthday i spent 3 whole days with her, and it was great. i think she had a really good birthday. i just wish i could have that. i know i dont deserve it but, i cant help but wish",
    "comments": [
        {
            "level": 0,
            "comment": "My heart aches for you. I’ve had multiple friends attempt and it’s so hard, but know you are not responsible for it in any way. The best you can do is be a kind person. You are so young, 17 is just then beginning. Happy birthday hun!!! Here’s to a better tomorrow.",
            "score": 2,
            "author": "Zadsta",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you for the kind words, i really appreciate it! hopefully things get better &lt;3",
                    "score": 1,
                    "author": "snowtopsthrwy"
                }
            ]
        }
    ]
}