{
    "id": "148ledo",
    "score": 1,
    "title": "A fictional character triggered me into remembering a childhood trauma and I feel like a clown",
    "author": "Usual-Honeydew-6601",
    "date": 1686679000.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148ledo",
    "media_urls": [],
    "other_urls": [],
    "postText": "When I (17F) was around 14 I started to watch this show, and I got really attached to a specific character (not naming the show or the character, don't feel comfortable doing so). At first I just thought he was cool and all, but as I grew older I realized that he was actually written with certain implications, implications about something he might've gone through. Something I felt like I went through as well, had this lingering feeling since childhood but couldn't quite remember it.\nAnd to make a long story extremely short one day I was reading a fanfiction about him and I felt like I got it by a truck. I have a huge gap in my memories from childhood and doctors said it's probably traumatic amnesia. I'm still not entirely in the clear, but basically reading this put me in so much shock that a big part of the puzzle suddenly got together. And I know this is already ridiculous, but I genuinely cannot deny what this did to me no matter how stupid it sounds.\nBecause of this, this character is extremely important to me. And I feel extremely stupid about this. In a weird way, it's kinda like I owe him, like he gave me back something I had lost. And this is absolutely sad to admit, but I don't think I've ever felt so connected emotionally to anyone aside from him. \nNow I know that some people have kins and this is rather frequent, but this has gone to a point were I genuinely cannot express anything regarding this trauma if not through him. \nAnd he means so much to me. I think about him on a daily basis. I not delusional and I'm well aware that he's not real, but in a weird way it's like he's with me. All the time, especially when I'm having flashbacks and it becomes too much. I draw him experiencing my symptoms because it's the only way I know how to verbalize.\nBut he also makes me so incredibly sad. In the bad days just thinking about him make me cry. And I know how ridiculous this is because I'm a 17yo girl and he's some fictional 40yo dude that isn't even that great of a guy, but somehow he's been in my heart for over 3 years now and I genuinely don't know how I would cope without the knowledge that he is a thing that exist, and that he would know how it feels \nIt's completely pathetic. \nWorse thing about it is that I wanted to write something about him. like a story about what he went through, so that I could finally try and express all these things I can never say out loud. I'm unable to do it. I just cannot write anymore. So now not only I'm pathetic but I cannot even be useful in anyway.\n\nI'm not delusional. I know he isn't real. But more and more these days I feel like if I leave this world he'll take my pain and my shame away. And idk who else is gonna do it. \nI know this is all pretty stupid and pathetic. Like I said, I do feel like a clown. But I guess I just needed to talk about it somewhere.",
    "comments": []
}