{
    "id": "148me6l",
    "score": 3,
    "title": "I don't know, how I should feel about, what my mother did when I was younger.",
    "author": "Commercial_Bicycle92",
    "date": 1686681622.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148me6l",
    "media_urls": [],
    "other_urls": [],
    "postText": "\n\nTW: Potential CSA\n\nI 15M when I was 9 was touched by my mother at my private part.\n\nFor context when I was 9 I needed treatment on my private part, because I hurt myself there by my hypersexuality.\n\nSo one night my mother touched it. I don't know why, because I don't remember the details clearly.\n\nBefore she touched me she asked me about, if I can pull my foreskin back. I answered with \"no,\" because it hurt at the time.\n\nMy mother then decided to pull my foreskin back. While she did it for 1 minute she asked me questions like \"if it felt good\", \"if I felt strong\" and possibly I don't remember correctly \"if it was the first time I felt something like that.\"\n\nI don't remember how long it was, but it felt like eternity. I don't know why I felt like that, but I said, that I felt strong and good to the questions my mother asked, which I feel awful for. She then replied to what I said \"with yes it really does.\"\n\nI also remember something new. She talked about how I can't f*ck people, if I can't pull my foreskin back maybe she talked about that it feels so strong, if you put it in a women's private part. I feel dirty about this!!!\n\nAfter she did it she said she can't do it anymore because she will get in trouble. To this day she has an weird obsession with my foreskin and wanting to help me wash it, if I would say I can't wash it.\n\nShe maybe I don't remember correctly when I was younger \"helpd\" me wash me there and pulled it back, even if I said it hurt. She said i'm overreacting. \n\nMaybe she was even n*ked with me in the shower sometimes. I don't remember.\n\nI just don't know what to do. Should I call for help i'm not at home right now. I'm in a mental hospital, because of my (depression and self-h*rm), but their reactions to what my mother did, which wasn't the incident i'm describing now. Did already let me lose trust to them. I still have to go home one day in the week.\n\nI feel ashamed about what happened, because I felt good when it happened after it hurt. I feel so dirty!!!\n\nI feel so awful. I already in the last few days broke down crying because of it a few times. I also don't remember everything, because it feels it could have even been worse.\n\nWhat should I do?\n\nI feel so awful dirty, gross and weirdly aroused while thinking back at it!!!\n\nI feel terrible!!!",
    "comments": [
        {
            "level": 0,
            "comment": "I have no idea how I can help with your problem...\n\nI wish you all the strength you need, maybe try talking to one of the people who work at the mental hospital. Maybe they know more about this?",
            "score": 2,
            "author": "IDC2871",
            "replies": [
                {
                    "level": 1,
                    "comment": "The problem is they probably won't believe me I already told them about other incidents, which weren't s*xual, but still physical and they didn't do anything, but say \"it isn't severe enough.\"\n\nThank you for replying. I really appreciate it.",
                    "score": 2,
                    "author": "Commercial_Bicycle92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How is that not severe enough? \nRidiculous. \n\nI hope you will feel better soon. I wish you all the best and a lot of strength.",
                            "score": 2,
                            "author": "IDC2871",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was once pushed down the stairs and threatened to be k*lled, my therapist said it wasn't severe enough and that they didn't really want to k*ll me, because they are kind.\n\nThank you again for reading it.",
                                    "score": 2,
                                    "author": "Commercial_Bicycle92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "...I am very sorry to hear about that... \nDid you try to find a different therapist? I don't believe every therapist is as cold as yours was/is",
                                            "score": 2,
                                            "author": "IDC2871",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I had many therapists. I can't switch right now, because the mental hospital doesn't let me switch until I leave.\n\nMy last therapist also needed to be convinced that it was bad enough until she believed it and then I needed to change therapists because I entered the mental hospital.\n\nMy first therapist when I was 7 was the worst who said I should act certain ways to not get bullied I was physically bullied a lot. He was the worst. He also gave me medicine without a diagnosis.\n\nEdit: I was 8 when I had my first therapist.",
                                                    "score": 2,
                                                    "author": "Commercial_Bicycle92"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not diminishing your experience but I just want to share that I went through something similar around that age. My dad showed me how to properly clean my foreskin &amp; at that age, I definitely did shower with my parents occasionally. I’m wondering if you may be misremembering a similar experience.",
            "score": 2,
            "author": "mood_le",
            "replies": [
                {
                    "level": 1,
                    "comment": "That could be the case, but I again don't remember it completely. I only know for sure that the one incident where my mother asked \"does it feel good?\" is true. \n\nI don't remember the others clearly and can't say for sure what happened.\n\nI'm sorry for that because my memory of my childhood isn't the best.\n\nI just know I never wanted to pull down my foreskin because it hurt and would have said \"no\" because it hurt. If water was then put on there I would scream because it hurt. Because it was really really really really really sensitive.\n\nThank you for reading and replying again sorry for not having such a good memory.\n\nI hope I didn't inconvenience you.",
                    "score": 1,
                    "author": "Commercial_Bicycle92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes i remember it hurting. But you do have to pull it back &amp; keep it clean. Hope you know that now.",
                            "score": 2,
                            "author": "mood_le",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I know that now but it still hurts and I sometimes have problems with washing it, because it hurts like hell.\n\nAgain maybe I'm misremembering details that could be correct.\n\nAgain sorry for inconveniencing you.",
                                    "score": 1,
                                    "author": "Commercial_Bicycle92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know this isn’t what you asked but let me tell you: I refused to pull mine back for years before I started having sex. It is sensitive because foreskin has many more nerve endings. You will need to get used to pulling it back &amp; in time it stops hurting. If you don’t, you risk illness &amp; disease &amp; overall having a disgusting penis because of the buildup of smegma. You may also require a circumcision later in life because you are unable to pull it back because it’s grown too tight.\n\nWhen you get in the shower, pull it back slowly. As far as you can. Keep doing this everyday and ease it back further &amp; further each day until you’re able to pull it back all the way. Wash with a warm washcloth.",
                                            "score": 2,
                                            "author": "mood_le",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I will try my best. I guess I never washed it correctly because I never used a washcloth I just put some soap, which already hurt too much and poured some water over there.\n\nI think using a warm washcloth will take time to get used to, because it hurts like hell. I still am afraid of touching it and the thought of using that makes me afraid but I will probably need to try that. \n\nYeah thank you for the advice I will also research about it because I didn't know that.\n\nSorry for inconveniencing you again.",
                                                    "score": 1,
                                                    "author": "Commercial_Bicycle92",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You’re not inconveniencing me! Happy to share advice. Trust me bro, you’re not alone here but it’s just good hygiene practice. Really, the more stimulation you provide it with, the less it will hurt in time. Make sure to do what I said with pulling it back as much as you can without hurting yourself each day. I actually had mine rip on me in the past because it was too tight — hurts, but you gotta fight through the pain before it gets to that point!",
                                                            "score": 2,
                                                            "author": "mood_le",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah I try to pull it back but I don't know how far I can pull it back, because I never had someone else explain it to me. I just assume I can pull it back to the point where it then stays and not farther I don't know.\n\nYeah I will try but the pain already makes me shiver imagining it.",
                                                                    "score": 1,
                                                                    "author": "Commercial_Bicycle92",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You want it to be able to go all the way past the head of your penis. So, pull it back each day until you can’t because it won’t go back further, or because it hurts too much. Keep trying each day to pull it back further. You need to be able to clean underneath. You’re stretching it out, and desensitizing it. The more you stimulate it, the less it will hurt. I can remember feeling how you do, cringing at how much it hurt / how weird it felt. Trust me, you will thank yourself for doing this in the long run.",
                                                                            "score": 2,
                                                                            "author": "mood_le",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah I will try so what I described isn't enough as it seems.\n\nYeah I wanted to say that I remember when my mother, when she asked \"if it felt good\" and pulled it back. It went really far down. I never managed to simulate that again, because it hurts like hell so I imagine it can go back really far. \n\nAgain only my mother managed to do that. I feel awful thinking about it because I enjoyed it, but that's another thing I feel dirty and aroused weirdly f*ck.\n\nSorry for that yeah it will take awhile.",
                                                                                    "score": 1,
                                                                                    "author": "Commercial_Bicycle92"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}