{
    "id": "148mvt2",
    "score": 451,
    "title": "Why men choose to spend so much time at work.",
    "author": "Nope_5487",
    "date": 1686682917.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148mvt2",
    "media_urls": [],
    "other_urls": [],
    "postText": "\r  \nAfter being married for over 10 years, I now understand why men choose to spend so much time at work.  This is the cycle that I've seen in my own marriage:\r  \n\r  \n1.  I do something at home that needs to be done.  My wife sees what I do and says to me, \"Why did you do this?  This is wrong.  Why didn't you do this instead?\"  This implies that I should have known of this \"better\" way of doing the thing, but I didn't.  OK, cool.  I won't fight that.  She obviously knows better than me in these situations.  That means I can look to her as a resource so that I can make better choices next time.  Awesome.  I'll refer to her next time until I start to do things correctly consistently and then I'll be good.\r  \n\r  \n2.  I ask her for input while making a decision or doing something.  This results in \"adding to her mental load\" (as she put it) and complains that asking for her input is harder on her because she has to stop, focus on me, help me, and then go back to doing what she was doing.  OK, that's fair.  I don't want to stress her out even more and add burden to her; I want to lighten her burden and be a help.  If doing things on my own adds to her burden, and asking her for input adds to her burden, then I'll just wait until she asks me to do something.  I'm happy to help out and do whatever I'm asked.\r  \n\r  \n3.  I wait to be asked to do something.  This results in her seeing me be lazy because I'm not doing anything of my own initiative.  She complains to me that I'm not doing anything, that she's the only one that does anything around the house or for the family.  She wants me to do more.  OK, that's fair.  Then when I see something that needs to be done, then I'll go do it.... but wait.... I remember what happened when I did that.  That was step 1.  Now what?\r  \n\r  \n4.  I leave for work.  During work I take care of things, get things done, am told thank you and well done by my boss and peers.  If I mess something up, I'm able to correct it and learn from it and get better.  I'm able to contribute to my work in a positive way.  I feel great.  Then it's time for me to go home and I hesitate and I wonder why I feel this way.  Then I think of the cycle above.\r  \n\r  \nIt could be anything from planning a family vacation (\"Why did you pick this hotel?  Didn't you think of this?  Why didn't you choose this instead?\")  To loading the dishwasher (\"You put the bowls in wrong.  The plates are in the wrong spot.  That's not how the silverware goes.\")  Just today I asked her \"What do you think about getting a rug for the top of the stairs?\"  The response I got was \"If you've thought about this for a while and you know its a bad idea, why are you asking me?\"\r  \n\r  \nMy wife wants me to see things how she does, think how she does, do what she does the way she does it before she does it herself so that she doesn't have to do it.  \r  \n\r  \nAnd she blames me for her disappointment.  \r  \n\r  \nI don't know if all women are like this, but if they are, you women needs to wake up and smell the coffee.",
    "comments": [
        {
            "level": 0,
            "comment": "“Hey wife, I want to help you out at home but I feel discouraged because everytime I do, I can’t do it to your standards. If you want me to help, you’re going to have to accept that I do it my way, or show me how to do it properly — otherwise, I don’t know how I can do anything for you”",
            "score": 1168,
            "author": "mood_le",
            "replies": [
                {
                    "level": 1,
                    "comment": "'Hey wife' \n\nI will be using this when the time comes",
                    "score": 141,
                    "author": "KREIST23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*at the altar*\n\nHey fiancee, I am... *chokes up* happy to address you fir the first time as... hey wife.",
                            "score": 20,
                            "author": "ClassicVegtableStew"
                        },
                        {
                            "level": 2,
                            "comment": "There be monsters...",
                            "score": 19,
                            "author": "daytonakarl"
                        },
                        {
                            "level": 2,
                            "comment": "This is how I call to my wife 😂",
                            "score": 3,
                            "author": "Many-Place-8690"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Communication to the rescue, yet again",
                    "score": 18,
                    "author": "deadshard"
                },
                {
                    "level": 1,
                    "comment": "OP, communication can fix this problem instead of deciding to not help at home and wait until his wife blows a gasket because homie is waiting to be told what to do like a child. Keep helping out with chores around the house, if she has an issue with how you do a certain thing, you'll learn then and there and now you won't do it wrong next time. \n \n If you feel this upset about how she talks to you about housework, talk to her about it. \"Honey, I feel ___ when you ___ and I was hoping you could work with me on this.\" Its really that easy, might take a few times, but you better work this shit out now before either one of yall build up enough resentment to hate either one's guts.",
                    "score": 18,
                    "author": "NathanielTurner666"
                },
                {
                    "level": 1,
                    "comment": "Answer will be Step 1. \"Why do you think about it that way? Are you saying there's a problem? You shouldn't feel that way.\"",
                    "score": 118,
                    "author": "JusonCadr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It doesn't seem like communication is either OP's or his wife's strong suit.",
                            "score": 209,
                            "author": "lookitsjustin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some folks are just like that - it’s their way or no other way at all - not about communication- currently why I have an ex- life is way to short",
                                    "score": 20,
                                    "author": "AlfalfaValuable5793",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're right. This is a personality problem, not a communication problem.",
                                            "score": 11,
                                            "author": "Confident_Visual_933"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yep. This entire dynamic was a huge factor in my own divorce.",
                                            "score": 5,
                                            "author": "Redshirt2386"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "lol yah that will go over well",
                            "score": 6,
                            "author": "updownsidewayz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just boldly exclaim \"HEY LADY, LISTEN\"\n\n(in a humorous way, of course)",
                    "score": 4,
                    "author": "Boebus666"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you need to change the title to why you choose to spend your time at work.",
            "score": 183,
            "author": "angelicdreame",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately you can't change post titles afaik lol",
                    "score": 8,
                    "author": "andersmmg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My ex husband was like this. That’s why he’s my ex.",
            "score": 215,
            "author": "walled2_0",
            "replies": [
                {
                    "level": 1,
                    "comment": "It feels good not trying to make impossible people happy.",
                    "score": 10,
                    "author": "RichardsLeftNipple"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bruh 💀 she's not asking you to do brain surgery or rocket science. It's literally just housework—tedious, sure, but not that difficult to do right.",
            "score": 72,
            "author": "BoroMoo"
        },
        {
            "level": 0,
            "comment": "Tbh, if you've been married for 10 years, then you should know by now how the dishwasher is emptied or where the silverware goes.. If you don't, that's because someone else (she) has always done it, to the point where you never bothered to learn it.",
            "score": 626,
            "author": "PatheticFarce",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's called weaponized incompetence and OP sounds like an expert in it. Does nothing at home then when he does he intentionally half asses it so wife feels like she has to do it or it'll never get done correctly. Then OP doesn't get asked to do things and we get OPs step 3.",
                    "score": 568,
                    "author": "EthanWeber",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, everything about this screams weaponized incompetence. Nice try at painting yourself as the victim OP, but most of us have met someone like you before and can see straight through your bs narrative. We get it - you're a manchild who needs to be coddled and praised for doing less than the bare minimum.",
                            "score": 70,
                            "author": "pockette_rockette"
                        },
                        {
                            "level": 2,
                            "comment": "Is that what he's doing?",
                            "score": 7,
                            "author": "Bazookajojo69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely he is. He does a task without thinking of what his family actually needs, he does the task by his barometer. Then he gets upset with his wife because he did something boneheaded, and his wife has to clean up after him. He then cries that he can't read minds. He wants to be told what to do and how to do it. He's acting like he hasn't been a part of the family he created for ten years. I'd be absolutely disgusted and put off by man like him. I'd resist going to therapy with him as well. Just gotta get the kids outta elementary and leave is probably her focus.",
                                    "score": 113,
                                    "author": "BunnyKerfluffle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hmm",
                                            "score": -46,
                                            "author": "Bazookajojo69"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or the other possibility is that his wife is toxic…",
                            "score": -19,
                            "author": "TopazWarrior",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s amazing how everyone is just completely turning against him. I understand that the wife could have a different side to the story and it’s possible that he is the problem..\n\nBut it’s almost as if a woman can never do wrong. From what I’m reading she sounds very difficult to live with and I say this because I’ve seen it play out in real life. A sweet guy who gets constantly pushed over and bullied by his girlfriend/wife and withdraws to the point where he doesn’t even try anymore. \n\nBut what do I know.. as they say, there’s 2 sides to a story and the truth is somewhere in between.",
                                    "score": 15,
                                    "author": "piink-kitty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have seen this scenario you mentioned a few times. We can only speculate. Same goes for the Reddit hivemind",
                                            "score": 20,
                                            "author": "erichf3893",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "True, I guess that’s the whole point of Reddit.",
                                                    "score": 2,
                                                    "author": "piink-kitty",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"I don't know if all women are like this, but if they are, you women needs to wake up and smell the coffee.\"-this is the OP....yeah the wife sounds like the problem.",
                                                            "score": 17,
                                                            "author": "themboizclean"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Fun fact - women are the abusers in 40% of all domestic violence cases. It’s probably dead even just somewhat under reported.",
                                            "score": -24,
                                            "author": "TopazWarrior",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Source?",
                                                    "score": 2,
                                                    "author": "abbadactyl_"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Anyone who touches grass knows these statistics are wrong.",
                                                    "score": 6,
                                                    "author": "Specialist-Company24"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "how do you know it's this and he isn't being setup for failure? someone can constantly \"move the goal posts\" so no matter if you do things the \"right way\" as previously shown, there will always be something new that's wrong that has to be \"corrected\"",
                            "score": -12,
                            "author": "updownsidewayz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because men don't deserve any benefit of the doubt... Ever! Even the proposed solution to take the kids and leave him has that fact in it's consideration. There isn't a hint of doubt as to the allocation of child custody. Even the law is expected to see things that way.",
                                    "score": -20,
                                    "author": "Confident_Visual_933",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "not sure about this, sounds pretty unhealthy to never be able to earn someone's trust, but hey. I don't blame you, most people aren't worthy of our trust. anyway I'm curious if they hired a housekeeper then would then would they fall into the same doom loop or not or is it unique to OP in their marriage",
                                            "score": 1,
                                            "author": "updownsidewayz"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OP also wants a present every time he does something correct around the house, as evidenced by his perspective that work is better because he receives praise.",
                    "score": 44,
                    "author": "Familiar-Let-5035"
                },
                {
                    "level": 1,
                    "comment": "why is her way the correct way and his way is wrong?",
                    "score": 7,
                    "author": "pm-pussy4kindwords",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because they're not gonna put their silverware in two different places, are they? You ask, and you put it back with the rest. And the fact he doesn't know where the silverware goes tells you he doesn't do that stuff often. Honestly, I can't comprehend the idea of living in a place and not knowing where your shit goes and doesn't.\n\nEdit: the reason why you put back things at the same spot is so you don't have to open all cabinets to look for something every time you need it. So yeah, her method of putting back stuff in one place is objectively superior.",
                            "score": 31,
                            "author": "PatheticFarce",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not necessarily- some folks simply cannot be pleased and are always searching for something to complain about",
                    "score": 0,
                    "author": "AlfalfaValuable5793",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;some folks simply cannot be pleased and are always searching for something to complain about\n\nWhat does that mean in this context?",
                            "score": 3,
                            "author": "PatheticFarce"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do I have a nagging suspicion that your wife has another side to this story?",
            "score": 892,
            "author": "lookitsjustin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep.   Sounds like a full post on purposefully doing things wrong so they won't be asked again.\n\n\nIs it that hard to put the plates away?  She does the cooking, do it her way so she knows where it all is.  \n\n\"Ask me to do things\"  she is not your mother OP!  That's why she doesn't want to carry the mental load.   Can you manage to put dishes away all by yourself or does she have to ask you to 1)do the dishes 2) dry them 3) put them away 4) put them away organized for her.\n\nSo just doing the dishes you want her to hover and tell you those 4 steps?  Or are you a grownup??\n\n\"Why did you pick this hotel?\" Does it fit everyone?, is it clean? In the right area? Comfortable? ..How about just send a text and ask...\n\n\"I won't do that because of last time when I did it wrong\"... are you 2 op?  So leave it for the wife?\n\nUgh I feel bad for the wife.  This guy is playing dumb to get out of house work.  I can't imagine having to tell someone every move they need to make and they still do it wrong on purpose.",
                    "score": 428,
                    "author": "Plus-Adhesiveness-63",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\"I won't do that because of last time when I did it wrong\"... are you 2 op?  So leave it for the wife?\n\nthis is also his only post...no comments or other stuff..and a brand new account.",
                            "score": 124,
                            "author": "themboizclean",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep prob some old boomer who trapped his wife into this routine years ago and she is only learning now it's inhuman...  And she's a grown man's mother.\n\n\nOr some kid with a sad life.",
                                    "score": 96,
                                    "author": "Plus-Adhesiveness-63",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "exactly and the whole \"now I see why men stay at work longer...\" the only men who do that are ones who hate their lives. I work with men who are giddy to get back home to their kids and wives despite it being 5 years or 20 years.",
                                            "score": 73,
                                            "author": "themboizclean",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly! And it's because they contribute.   This guy gets his confidence from pats on the back at work.. \n\nWonder how his boss woukd react if he claimed he \"couldn't do it right\" or \"not good at it\".  Does his boss instruct him on every move?\n\nFire his ass lol",
                                                    "score": 31,
                                                    "author": "Plus-Adhesiveness-63"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "THANK YOU. This reeks of weaponized incompetence.",
                            "score": 42,
                            "author": "pockette_rockette"
                        },
                        {
                            "level": 2,
                            "comment": "Weaponized incompetence. I’m just so tired. I think my favorite thing my husband says to me is that I look the best have in awhile all while he’s looking at porn. Nevermind I birthed the child he insisted we have, managed to get within a few pounds of my prebaby weight in under a year, and support him financially as he gets his second degree. He wonders why I’m unhappy. I’ve told him point blank why and he still doesn’t get it.",
                            "score": 20,
                            "author": "Disappointedtourist"
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like you identify with the wife and don’t like the criticism.",
                            "score": -16,
                            "author": "Truth_Master_5000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or.. statistics, and life experience.  Criticism?  Constructive, yes.  I'm open to learn always.\n\nSounds like OP identifies with a child and also \"doesn't like criticism\" to the point he doesn't take care of his adult responsibilities out of spite so he won't be asked.\n\nEdit:  nm another troll",
                                    "score": 13,
                                    "author": "Plus-Adhesiveness-63",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would definitely like to hear the wife’s side of the story before passing judgement. However, your stance and tone make your opinion seem bitter and very experienced indeed.  The statistics comment is a head scratcher.  I don’t know, maybe this guy is a bum.",
                                            "score": -5,
                                            "author": "Truth_Master_5000",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "K bye",
                                                    "score": 2,
                                                    "author": "Plus-Adhesiveness-63",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Introspection is tough, don’t beat yourself up. Bye.",
                                                            "score": -6,
                                                            "author": "Truth_Master_5000",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Cool cool",
                                                                    "score": 3,
                                                                    "author": "Plus-Adhesiveness-63"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Very likely she's on XXchromosome right now complaining about his weaponized incompetence.",
                    "score": 30,
                    "author": "BigYonsan"
                },
                {
                    "level": 1,
                    "comment": "Yup",
                    "score": 2,
                    "author": "kidsandbarbells"
                },
                {
                    "level": 1,
                    "comment": "I was so worried it was just me reading this going 😳",
                    "score": 2,
                    "author": "Klexington47"
                },
                {
                    "level": 1,
                    "comment": "because women can never be the one in the wrong to you?  \n\n\nseriously. Is it so, SO hard to fathom that one person in the world is like this?",
                    "score": -18,
                    "author": "pm-pussy4kindwords",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep most people work on a men bad women good foundation.",
                            "score": -17,
                            "author": "Confident_Visual_933",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except that if you actually read the post, you’ll see that he is quite literally doing the opposite and you guys are just blindly agreeing with him. \n\n“Why men choose to spend so much time at work” \n\nOr \n\n“You women need to wake up and smell the coffee”. \n\nHow did none of that give it away lol (it most likely did, y’all just chose to ignore it)",
                                    "score": 2,
                                    "author": "Specialist-Leg6790"
                                },
                                {
                                    "level": 3,
                                    "comment": "Probably bc it's logical to do so. Look up the data on men...it doesn't look good.",
                                    "score": 1,
                                    "author": "gibbonsRcool25"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " Don’t think OP got the reaction he was looking for here",
            "score": 67,
            "author": "nefelibatanna"
        },
        {
            "level": 0,
            "comment": "&gt;I leave for work. During work I take care of things, get things done, am told thank you and well done by my boss and peers. **If I mess something up, I'm able to correct it and learn from it and get better.**\n\nIf you go back to step 1, your wife is also providing you feedback so that you're able to correct it, learn from it, and get better. If you messed something up at work, would you proceed to step 2 or would you learn how to fix things on your own so that you wouldn't always need to refer to your manager in the future? Wouldn't your manager also find it annoying to always be helping you with every little thing (i.e. adding to their mental load)?\n\nYou imply this is some logical succession but you're missing so many possible branches to this decision tree. Why not branch from step 1 to step 1a where you learn from your wife about her preferences and then get better? The same skill you're using at work to get kudos will also work at home.\n\nI'd start self-reflecting and wonder why you don't want to learn from your wife in the same way you learn from someone at work, and why you don't prioritize things that are important to her in the same way you prioritize tasks at work.",
            "score": 172,
            "author": "maviegoes",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was exactly my first thought as well! How can OP have genuinely typed this without realizing what he was saying. And to think he can apply this logic to the complexities of a work atmosphere, but somehow he loses it at… the dishes.",
                    "score": 52,
                    "author": "tennissyd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems op is afraid of the verbal abuse he gets from doing step 1 wrong. Idk about you but if the consequences of failing something is too high I’m not gonna do it.",
                            "score": -7,
                            "author": "Creamyc0w"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; you women needs to wake up and smell the coffee\n\nThis tells me everything I need to know about you.",
            "score": 122,
            "author": "Amphabian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? Apparently all women are the same because this Fuckface has never thought of marriage counseling.",
                    "score": 16,
                    "author": "dradonia"
                },
                {
                    "level": 1,
                    "comment": "What does smell the coffee mean?",
                    "score": 1,
                    "author": "ballsdeep1619",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Smell the coffee means to take in reality as it is. It's just another way of saying \"Wake up and take notice.\"",
                            "score": 17,
                            "author": "Cranksta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ohhhh. Thank you! :D",
                                    "score": 2,
                                    "author": "ballsdeep1619"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a weird way of saying you and your wife need therapy. \n\nAnd what a weird way of saying you see all women as monolithic.",
            "score": 238,
            "author": "ReasonableAgreeable"
        },
        {
            "level": 0,
            "comment": "Its a common problem, but its not a woman thing. Its a breakdown of communication thing. \n\nPeople in relationships who stop talking about their problems and issues build resentment, and so start checking out of the relationship. Petty nit picking and versions of silent treatment become ways of venting unspoken grievances that become subconscious resentments, poisoning everything.\n\nThe problems in your marriage, as you describe them, are common. They can also be marriage ending. But, they can also be solved.\n\nIf the two of you cannot speak candidly about your issues now, you should invest in couples counselling to guide you through this admittedly sensitive process.\n\nRunning away wont solve anything.",
            "score": 136,
            "author": "Le1bn1z",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd love to go to counseling.  I've been by myself.  I've asked her to go.  I've told her that if she doesn't like the place I'm going, that she can pick whomever she wants and I'll be happy to go there with her.  Her response is \"Counseling is pointless.  Going to someone to tell us what to do won't do anything.  We both know what we need to do.  We're just not doing it.\"  Just more of her knowing what I don't.  \n\nYour comment does give hope tho, which I really appreciate.  Thank you.",
                    "score": 27,
                    "author": "Nope_5487",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wonder if she just feels like she’s not being heard and that she’s had this conversation with you a million times but nothing has changed in her eyes. Now I think she’s wrong in rejecting counseling it could really go a long way in helping her feel heard. Maybe try letting her know you really want to do the right thing but communication seems very difficult for the two of you. You just want to have a third party to ensure everyone is getting their point across. It seems like you don’t actually know what she wants or expects from you and maybe being honest that your confused by what she’s saying versus her actions and you just want assistance to help guide you with understanding. Also this is probably a good area for you to maybe enforce a boundary and say this is what you need for this relationship to continue.",
                            "score": 28,
                            "author": "kf6890"
                        },
                        {
                            "level": 2,
                            "comment": "Grow a backbone, dude. Seriously. Tell her that you both need to work on your relationship (as you clearly do), and say that you insist upon her joining you in therapy. If she won't work on things with you, well, then the writing is on the wall.",
                            "score": 63,
                            "author": "lookitsjustin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "perhaps she is being uncooperative because she has more to gain from a divorce than OP but wants him to deliver it so he can look like the bad guy",
                                    "score": -13,
                                    "author": "updownsidewayz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why are you still with this person",
                            "score": 3,
                            "author": "Dowager-queen-beagle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because we have kids and I've seen the statistics on kids that grow up with both parents vs kids that don't.",
                                    "score": -62,
                                    "author": "Nope_5487",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right, and what are the statistics for kids that grow up with two parents hating each other? Happy to provide some insights.",
                                            "score": 89,
                                            "author": "lookitsjustin"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Grew up with divorced parents. Sure it sucked, but it would’ve been 10x worse if they stayed together for our sake because I was already protecting my younger sister from their fighting pre-divorce. I don’t want to think about how I would’ve had to deal if they stayed together.",
                                            "score": 24,
                                            "author": "CluelessMochi"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My parents stayed together for the same reason. It did not work out in any way, shape, or form. I pity your children and hope they are able to find their way out of the hole you are digging for them.",
                                            "score": 13,
                                            "author": "Dowager-queen-beagle"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My parents divorced when I was about 9. They were amicable afterwards and I never had any issues about them splitting up. My husband’s parents stayed together “for the kids” in a loveless, acrimonious marriage until both of their kids were grown and married. He wishes they divorced early - growing up in a house with arguments and brooding silences etc. was not a pleasant experience for him or his sister. The kids are aware when you’re not happy and they might be better off if you do divorce. Don’t stay together JUST for them.",
                                            "score": 7,
                                            "author": "Catty_Lib"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry you feel that way in your relationship, it doesn't sound like either of your needs are being met and you are both frustrated. \n\nHere are a few things for you to consider:\n\n1. Do you know where everything is kept and how it is kept in the house? If you don't, why not? \n\n2. Do you know what your children's schedules are and how to take care of them solo? If you don't, why not?\n\n3. Do you practice clear judgement that is long term and strategic focused instead of short term? \n\n4. Do you communicate with each other as a discussion or do you wait to be led?\n\nAnd most importantly, does she know how the way she speaks to you makes you feel?\n\nI can tell you that your wife wants you to pick up things independently, considering all relevant angles to your family's needs and make decisions that prioritise your family.\n\nNext time she has feedback for you, ask her why and take note, so she doesn't have to tell you again. You wouldn't expect your boss and colleagues to have to hold your hand every single day would you?",
            "score": 15,
            "author": "shouldlogoff"
        },
        {
            "level": 0,
            "comment": "I smell a divorce coming. Don't be surprised when you're wife finds a new partner that is exactly the- an actual partner. A marriage isn't him vs her, it's a partnership. Sounds like you need to work on your communication and marriage or you'll only have work left.",
            "score": 51,
            "author": "snowbird9888"
        },
        {
            "level": 0,
            "comment": "“I haven’t communicated with my wife about any expectations of family life and house work in 10 years” there, fixed the title for you.",
            "score": 55,
            "author": "Natthealleycat"
        },
        {
            "level": 0,
            "comment": "You need to live alone and see what you do for yourself what works and doesn't. You'll never understand or appreciate what work goes into being with you, until you're the only one that does. Stop asking women to \"wake up and smell the coffee\", when you can't be bothered to wake up to your first alarm and smell a coffee you made, yourself.",
            "score": 58,
            "author": "DataAdvanced"
        },
        {
            "level": 0,
            "comment": "&gt;I don't know if all women are like this, but if they are, you women needs to wake up and smell the coffee.\n\nPlease leave the rest of us out of your marriage, thanks.",
            "score": 170,
            "author": "aamfbta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously, fuck this guy. Sounds like he did a shitty job cleaning the bathroom once and then gave up because “hurr durr I’ll just do it wrong and get yelled at.” Jesus Christ bud, grow up.",
                    "score": 86,
                    "author": "ACatWhoSparkled",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Literally. Last time I checked, he's married to one woman, not the rest us. Major eye roll.",
                    "score": 3,
                    "author": "thornz_z"
                },
                {
                    "level": 1,
                    "comment": "Totally agree with you - OP should not generalize. But in a similar fashion, seeing the exact same projecting in the comments.",
                    "score": -5,
                    "author": "Sgt_Scrub7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry, I’m not sure what you mean?",
                            "score": 8,
                            "author": "aamfbta"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "…this is offmychest…….",
                    "score": -30,
                    "author": "RevolutionaryBit3244",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, and regular comments apply, especially if when you speak to the wider audience of women to “wake up and smell the coffee.”",
                            "score": 49,
                            "author": "aamfbta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I originally interpreted your first comment as something like “we don’t want to hear about your problems”, but i think you meant “women as a whole aren’t the problems of one specific person”… my mistake 🤔",
                                    "score": 31,
                                    "author": "RevolutionaryBit3244",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, that’s exactly it! And NP!",
                                            "score": 20,
                                            "author": "aamfbta"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My husband has a thing about how the dishwasher is loaded. Guess what? We load it how he wants. I have a thing about sorting laundry. Guess what? We sort it how I want. Yeah, that's a two-way road, and after ten years, you should be able to figure out that crap. Now, if I don't mind either way, it's a thank you for the extra help. Crap, with my kids, one will come by and I'll ask them to do the task, then another one comes by later, I ask for the same task to be done( I have three) so by the time I come around to do it properly it's way less work and I just end up having to sanitize. Like, work smarter. Learn your wife, unless she's just changing her processes or her feelings on things every week, I'm sure you can figure her out.",
            "score": 25,
            "author": "AMReny"
        },
        {
            "level": 0,
            "comment": "sounds like your wife has to take care of a manchild.",
            "score": 76,
            "author": "emmmbaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bingo!",
                    "score": 5,
                    "author": "pockette_rockette"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What does your therapist say?",
            "score": 7,
            "author": "RealisticVisitBye"
        },
        {
            "level": 0,
            "comment": "Try using the tactic you use at work. You’ve gotten feedback, and instead of acting on it, you’ve decided to be a baby about it. It’s a choice, but it won’t solve any of the household issues. If you can do your job, I’m sure you’ll be able to learn how to do household chores.",
            "score": 27,
            "author": "catperson3000"
        },
        {
            "level": 0,
            "comment": "Can't imagine avoiding going home to my partner and instead staying at work. Never will I ever.\n\nEdit: I've also never heard of this generalization that men spend so much time at work. Like, in TV shows and movies, you mean? You're generalizing men in much the same way you've generalized women, and nothing good comes from either one.",
            "score": 43,
            "author": "lookitsjustin"
        },
        {
            "level": 0,
            "comment": "Stephen?",
            "score": 7,
            "author": "platynom"
        },
        {
            "level": 0,
            "comment": "I’d love to smell the coffee but you probably made it wrong",
            "score": 79,
            "author": "ThreeCatsOnAKeyboard",
            "replies": [
                {
                    "level": 1,
                    "comment": "LOL!  This is hilarious.  Thank you =D",
                    "score": -13,
                    "author": "Nope_5487"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You wait to be asked to do something?!? \n\nThis is why so many women eventually get fed up and leave. Be a fucking adult. Empty the dishwasher. Take out the trash. Sweep the floors. Jesus fucking christ, stop being a full grown child. I hope she leaves you. Go hide at work.",
            "score": 101,
            "author": "reginafelangi123",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP's wife complains when he does something without her input. OP's wife also complains when she is asked for input.\n\nIt is like you didn't read the OP.",
                    "score": -20,
                    "author": "Soonhun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And I wanna hear an example. He’s being vague on purpose.",
                            "score": 21,
                            "author": "reginafelangi123"
                        },
                        {
                            "level": 2,
                            "comment": "This is *his* side. God I’d love to hear hers. \n\n“I have a full grown husband who never helps me unless I nag him. I might as well have an additional child.”",
                            "score": 56,
                            "author": "reginafelangi123",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Did you not read where he does everything right at work, corrects himself, but doesn't do it at home instead opting to wait until she says???  It's weaponized incompetence.",
                            "score": 1,
                            "author": "Ezentsy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, I did not read that, because that's not what he wrote.",
                                    "score": 1,
                                    "author": "TheDeadlySinner"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not every man is your ex, calm down lol",
                    "score": -38,
                    "author": "RedTheDopeKing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Once men wake up and realize we dont wanna be your mommies, everyone will be a lot happier.",
                            "score": 45,
                            "author": "reginafelangi123",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I assume you have both lived in your home for the same amount of time\n\nSo why is it up to your wife to know more about how your household works? \n\nDo you even pay attention to how something is done, so you can do it the correct way, or do you check out mentally? \n\nIf your wife told you you loaded the dishwasher wrong for example, and told you why, did you take this information to heart, and apply it every time after? Or did you just not ever load the dishwasher again?",
            "score": 23,
            "author": "AffectionateMarch394"
        },
        {
            "level": 0,
            "comment": "So sick of the fucking weaponized incompetence. If men can go to work and succeed and all that shit there, then they can learn how to fuck to do things the right way at home. I can’t stand man-babies.",
            "score": 36,
            "author": "moonweasel906"
        },
        {
            "level": 0,
            "comment": "My mom said herself she used to get upset if my dad didnt do something her way but realized that hes putting effort and thats why matters. They went to therapy and thrive. Sounds like you and your wife need the same.",
            "score": 6,
            "author": "Smallflowerleila"
        },
        {
            "level": 0,
            "comment": "OP:  why won't my wife be my mommy?\n\nWeaponozed Incompetence.\n\nGrow up OP.\n\nYou sound like a whiny child.",
            "score": 61,
            "author": "Plus-Adhesiveness-63",
            "replies": [
                {
                    "level": 1,
                    "comment": "What part is weaponozed incompetence?",
                    "score": -11,
                    "author": "Sgt_Scrub7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The entire post.  \"I can't do it, because I don't do it right, so I won't do it\"  rather than just do it right... it's dishes not astrophysics.\n\nThink his boss would respond well to this at work?",
                            "score": 18,
                            "author": "Plus-Adhesiveness-63",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hmm I don't think he's absolving himself from responsibility, from what I see, he's actively making an effort to learn more and take new tasks on. The frustration is coming from how his work is going unappreciated or criticized.\n\nWe don't know if he's not doing dishes the \"right\" way, for all we know his wife could be really picky and he's actually doing it the way you or I would consider \"right\".",
                                    "score": 1,
                                    "author": "Sgt_Scrub7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So what your saying is that he cannot comprehend arranging dishes etc?\n\nI say this because women do all the invisible labor.  He needs to carry his half.\n\nYou know the saying.. usually the obvious answer is the right one.  I'll go with the statistics and say it's weaponized incompetence.\n\nI'll have to agree to respectfully disagree :) but it is a possibility.",
                                            "score": 8,
                                            "author": "Plus-Adhesiveness-63"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP here literally sounds so passive-aggressive in some instances when I read this the second time... \n\nOP. This is about teamwork. \nMaking it easy for both of you is the way to go. \nHave you tried asking them how to go about certain things? If yes, and it is respected, good. If not, I believe you both have mouths to use and speak about it. \n\nExample: \nFor me, I need to have dishes and specific items in the house in a specific order and place. If I mess the order even once or put it somewhere else, I will most probably lose time trying to find it and then fret slightly because I will think I lost it. For that same reason, I absolutely loathe if you don't leave it where it initially was.\n\nRespect and cooperation go a long way.",
            "score": 13,
            "author": "astrogeek95"
        },
        {
            "level": 0,
            "comment": "Have you tried telling here all of this instead of us?",
            "score": 5,
            "author": "TAABWK"
        },
        {
            "level": 0,
            "comment": "I’m a woman but this was me in my past relationship. At some point I gave up. I couldn’t load the dishwasher right, I held the dog leash wrong, I bought the pre-cut fruit because I cut the fruit wrong when I did it but I wanted to eat that fruit (and buying it pre-cut was also wrong and waiting for him to cut it was also wrong), my ideas were stupid. It was easier to let him decide everything. \n\nAnd then he left because this was my fault.\n\nEdit: for a while I was the breadwinner, but it’s worth noting once our relationship was more “typical” in that he earned more, he left. But I get it: at least my job has clear expectations and things I can do correctly.",
            "score": 4,
            "author": "Puzzleheaded_Door894"
        },
        {
            "level": 0,
            "comment": "I’ve felt that way in past relationships, but once I found my person we both want to be home as much as possible. Home now if the safe space where nothing bad happens, and we can feel whatever we need to and deal with it together",
            "score": 10,
            "author": "Glittering-Ad-3859"
        },
        {
            "level": 0,
            "comment": "You can vent without being a misogynist.",
            "score": 8,
            "author": "NoUsername817226"
        },
        {
            "level": 0,
            "comment": "Sound like a lack of communication. \n\nYour wife sound harsh as hell, like the hotel stuff ain’t that important, right? Why making a drama for this?\n\nBut after 10 years of mariage, you look like you don’t help that much or don’t pay that much attention either. Unless y’all use the dishwasher once a year, you know how to place things. When I ask help from my husband when I’m unable to do something, he knows how I do things, and if he doesn’t, he asks me how. Communication",
            "score": 15,
            "author": "Bebi-Cat"
        },
        {
            "level": 0,
            "comment": "Sounds like weaponised incompetence on your part. I feel sorry for your wife that she has another child that she has to look after.",
            "score": 26,
            "author": "abcixtwt"
        },
        {
            "level": 0,
            "comment": "There are a whole host of household chores that you should be able to tackle without issue. Notice dishes in the sink while she's putting the baby down? Do the dishes! Have a few minutes on a Saturday afternoon? Run a vacuum through the house! Overnight guests coming? Pick a few restaurant options and change the sheets! Running low on toilet paper? Stop by the store on the way home! \n\nI think you need to read up on the mental load— and then pay more attention to how the household runs and where you can pick up slack. If you're worried about stepping on your wife's toes, just talk to her! Maybe there are chores that she'd prefer to do for whatever reason (i.e. a specific way that she does her laundry) and then ones that might be better suited for you. \n\nHonestly, your post is very whiny. It seems like you need perpetual praise for doing the bare minimum, but I bet your wife rarely receives a thank you for keeping the family running. I also found it odd that you don't know where your own dishes or utensils go— but here's your opportunity to learn from the mistake and do better! \n\nMaybe weekly family management meetings would help so that the two of you could make a plan for the week and divide up responsibilities? Seeing a therapist to talk some of this out wouldn't be a bad idea because they'd be able to set you up with the tools to communicate better.",
            "score": 6,
            "author": "Dismal-Onion"
        },
        {
            "level": 0,
            "comment": "This sounds like both of you are just bad at communicating.\n\nYou need to use your words and explain your desire to help but your frustration at feeling you are doing the \"wrong\" thing more often than not. \n\nShe needs to communicate what she wants from you and how she wants you to do things.\n\nYou both need to make the other feel safe in communicating concerns or needs with the other.\n\nAdditionally, you both need to sit down and look at everything that needs to be done and divide up chores fairly. Not evenly because sometimes being even is not being fair. Especially if there are children or medical concerns involved. But try to make sure mental workload, household chores, pet care, child care, lawn work, cooking, cleaning, repairs, and employment are all considered and divided in a way that makes each person feel heard, respected, and appreciated.",
            "score": 3,
            "author": "pthepuff"
        },
        {
            "level": 0,
            "comment": "Sounds like you both are candidates for marriage counseling. I am sure others have mentioned it. And while therapy seems to be the answer to everything, I know ppl in similar situations that have benefit.",
            "score": 3,
            "author": "Newdaytoday1215"
        },
        {
            "level": 0,
            "comment": "Info: what kind of job do you have OP, and how do you act at work?\n\nWhen you do something the could have been done better or more efficiently at work, do you *just* treat your boss or coworkers as a resource? Or do you implement the fix the next time you complete the task?\n\nBy your own admission in point 4 - you strive for improvement.\n\nThen why not implement that same quality of improvement and pro activity at home?",
            "score": 3,
            "author": "CakeForBreakfast08"
        },
        {
            "level": 0,
            "comment": "You can do it your way, or I can do it my way. \nYou pick. \n\nI don’t fold towels her way, wash dishes, or pretty much anything. \n\nI drew a line in the sand 20 years ago. It’s still there. \n\nI’m not arguing about how I fold laundry. \n\nWe did for a while, and I’m just clear, “you were raised to do x your way, and I was raised to x my way, obviously you don’t want to change, so why should I”",
            "score": 3,
            "author": "BigDaddyDMJB"
        },
        {
            "level": 0,
            "comment": "OP kinda sounds like a self-absorbed A hole",
            "score": 5,
            "author": "pgmach89"
        },
        {
            "level": 0,
            "comment": "It might be beneficial to both of you if you were to communicate all of this to her instead of posting it on Reddit. As far as I know, women haven't yet developed the ability to read minds, even if we're often expected to. Just saying.",
            "score": 8,
            "author": "Mistress-Metal",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're assuming he hasn't already.",
                    "score": -7,
                    "author": "mydmtusername",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed. Nothing in the post mentions that he had, so my comment is based on the information available. What was I just saying about being expected to read minds again... Oh yeah, we can't.",
                            "score": 2,
                            "author": "Mistress-Metal",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is weaponised incompetence at its finest. op didn’t expect this post to go like this lmao",
            "score": 5,
            "author": "Nethii120700"
        },
        {
            "level": 0,
            "comment": "sounds like weaponized incompetence on your part honestly",
            "score": 5,
            "author": "manicpixiebeangirl"
        },
        {
            "level": 0,
            "comment": "You can vent without being a misogynist (yes, your post was still sexist, even with the whole “I don’t know if all women are like this” part). Also, since women typically do most of the thankless stuff around the house (cooking, cleaning, usually the more attentive parents), do you think we want to be at home too?\n\nI hope your marriage gets better. And I hope you’re more mature about it next time you run into conflict with her.",
            "score": 6,
            "author": "NoUsername817226"
        },
        {
            "level": 0,
            "comment": "Couples therapy is going to be needed. And possible single therapy. You both aren't understanding each other.",
            "score": 2,
            "author": "dawns_mind_space"
        },
        {
            "level": 0,
            "comment": "wow i am glad my marriage isn’t like this",
            "score": 2,
            "author": "Toketree"
        },
        {
            "level": 0,
            "comment": "Okay but you’ve been married for 10 years, why haven’t you learned how to do things by now? \n\nThis is weaponised incompetence. There is no reason why you can’t be doing your fair share.",
            "score": 2,
            "author": "Pinkcoral27"
        },
        {
            "level": 0,
            "comment": "We need to hear her side of the story. You remind me of my ex.",
            "score": 4,
            "author": "333astral"
        },
        {
            "level": 0,
            "comment": "You need to sit with her and have a conversation on this matter. This is something that leads to divorces.",
            "score": 4,
            "author": "Parking-Anywhere-744"
        },
        {
            "level": 0,
            "comment": "Wow. 10 years and you don’t understand what is expected of you. Weponized Incompetence this screams of and when he does do anything half assed so his wife feels like she HAS to do it now as well. Man… I hope my SO and I don’t act this way. :x",
            "score": 4,
            "author": "ChocoBro92"
        },
        {
            "level": 0,
            "comment": "Uh, no. All women aren’t like this. Your wife is just mean.",
            "score": 5,
            "author": "darklightner11"
        },
        {
            "level": 0,
            "comment": "If you stop doing something whenever you get corrected or asked to do it differently, of course you’ll never learn something new or gain new skills.\n\nCommunicate with your wife about the details and her expectations. To be fair she also has poor communication skills so this is absolutely a 2 way problem. But your personal problem is that you are using this lack of communication to disengage from taking any responsibilities.\n\nSome people really are just this picky though, but most definitely not everyone.",
            "score": 2,
            "author": "Affectionate_Many_73"
        },
        {
            "level": 0,
            "comment": "Completely forgot that everyone who uses Reddit has a phd on the human psyche. Dude comes to a sub to vent and gets flack for it, also not super sure about “weaponized incompetence”. Would make it all the more strange that according to his account he is well received at work and considers staying late even to avoid her. Not saying he’s right or wrong but to jump on him for trying to vent is wild lol. Good luck sorting it out man be honest with yourself and take it one day at a time.",
            "score": 2,
            "author": "cry360",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's because he decided to say some dumb shit about all women while he's at it. That already told me what this dude is looking for.",
                    "score": 14,
                    "author": "Tuxyl",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You sound miserable, divorce and enjoy the freedom of single life",
            "score": 2,
            "author": "SometimesKip"
        },
        {
            "level": 0,
            "comment": "Oh man. Old wife here.(57f married 37 years)\n\nI have heard my husband's friends say this more times than I can count.\n\nI am so sorry you go through this. Have you put what you wrote above in writing in front of her?\n\nI will never I understand being married to some one I do not respect. I fear, you are in such a relationship.\n\nI know why guys stay at work or go to the gym, bar, etc. \n\nYou need to gently share that you do not feel respected or valued in your partnership and build your mutual communication from there.\n\nGood luck.",
            "score": -7,
            "author": "APO_AE_09173",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the kind and understanding response.  It's happily received =)  It's good to hear that someone understands on some level.  You probably understand more than most in many other aspects of this situation.  Cheers.",
                    "score": -21,
                    "author": "Nope_5487",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Textbook case of confirmation bias, here.",
                            "score": 9,
                            "author": "hdmx539"
                        },
                        {
                            "level": 2,
                            "comment": "Dude, I hear your pain. Everyone NEEDS to feel respected and appreciated. So many women demand ot for themselves and do not give it in their relationships. It is sad.\n\nDoes my beloved (M59) partner do everything the way I like. Nope. But I am going to say thank you every time he helps me or tries to? (He over cooks the hell out of pasta. But I eat it any way) Yes. \n\nI wish you the best of luck.",
                            "score": -9,
                            "author": "APO_AE_09173",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you miss the part where they've been together for 10 years and still doesn't know how to do something basic? Why are you supporting this manchild?",
                                    "score": 4,
                                    "author": "Ezentsy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find it rather funny that some of the comments are accusing you of weaponized incompetence when nothing in your posts implies it. People intentionally being incompetent do not feel a need to vent about it online, nor do they ask for input/advice from their partners in order to improve. Rather, I suspect that people are grasping at straws; for the most part, uneven workloads in marriages are the man's fault, so people are desperately trying to frame the situation to fit their worldview.",
            "score": -8,
            "author": "xiaomaome101",
            "replies": [
                {
                    "level": 1,
                    "comment": "We're reading between the lines and coming up with an 'unreliable narrator '\n\nI am betting his wife has a different view on this",
                    "score": 13,
                    "author": "SpaceIsVastAndEmpty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Narrators are unreliable by nature on reddit, and unless there's something that doesn't add up about their story, there's no way to discern the truth. OP's story reads to me as an incompetent person who initially earnestly tried, but was never given the feedback and patience that it takes train someone properly and got disillusioned; I don't see what's so suspicious about that.",
                            "score": -1,
                            "author": "xiaomaome101"
                        },
                        {
                            "level": 2,
                            "comment": "In other words \"I'm making assumptions about him.\"",
                            "score": -2,
                            "author": "Sgt_Scrub7",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And honestly, it sounds to me like he genuinely does want to be helpful and support her. I mean he even said that he’s suggested therapy which isn’t something an incompetent person would really do. \n\nI don’t know.. maybe I’m incompetent too.",
                    "score": 1,
                    "author": "piink-kitty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You mean because you’re useless?",
            "score": 1,
            "author": "Competitive-Lab9730"
        },
        {
            "level": 0,
            "comment": "This sounds more like a little boy who is upset that his parent makes him do chores. It doesn’t sound like you are very helpful, nor competent, nor self-sufficient in helping around the house. I think your wife is over being your caregiver, instead of your partner.",
            "score": 1,
            "author": "actuallygenuinely"
        },
        {
            "level": 0,
            "comment": "I agree emphatically, as a young man it despaired me to hear men talk like that, “hey I prefer to be at work!” But now as a 34 year old man I can understand it, it really does feel that way a lot of the time. Either you take the initiative to do something, but you’ll get nagged because you didn’t do it exactly the way they wanted, or you get ripped for being lazy and not doing enough. Well honey, I’m glad to help out and do whatever, maybe you should just explicitly tell me how you want things done because it wears on a person after a while. It’s something I’m trying to figure out and navigate as well.\n\nAlso your wife just kinda sounds like a dickhead, my wife and I clash a bit but your wife sounds like she belittles you a lot.",
            "score": -11,
            "author": "RedTheDopeKing"
        },
        {
            "level": 0,
            "comment": "Not all women are like this, thankfully.\n\nThe issue is, she thinks you're a mind reader and know how *she* would do things. Everyone has methods to their own madness. Theres multiple ways to load a dishwasher, do laundry, fold, put away groceries etc. The problem is that she perceives her way as the only correct way, yet refuses to communicate it to you because to her, its self explanatory. Ngl my guy, if you're happier at work than at home, thats not a good marriage. Communication needs to happen desperately or someone will eventually get fed up. If she doesn't want to work on it, then it might be time to head out.",
            "score": -8,
            "author": "Puppin_Tea_16",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crazy how this comment is considered \"controversial\" lol",
                    "score": -1,
                    "author": "Sgt_Scrub7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are you staying for if she’s so miserable? Lots of women are happy to have a task done and don’t complain about how it’s done.",
            "score": 0,
            "author": "Ok_Detective5412"
        },
        {
            "level": 0,
            "comment": "I find it rather funny that some of the comments are accusing you of weaponized incompetence when nothing in your posts implies it. People intentionally being incompetent do not feel a need to vent about it online, nor do they ask for input/advice from their partners in order to improve. Rather, I suspect that people are grasping at straws; for the most part, uneven workloads in marriages are the man's fault, so people are desperately trying to frame the situation to fit their worldview.",
            "score": -9,
            "author": "xiaomaome101"
        },
        {
            "level": 0,
            "comment": "You guys sound like you might benefit from counseling. Would you both consider that?",
            "score": 1,
            "author": "platynom"
        },
        {
            "level": 0,
            "comment": "if your boss at work didn’t have time to teach you something themselves, you wouldn’t just give up on the work that needs to be done. you would problem solve and find another resource to help you get it done to the company’s standards. why can’t you problem solve and find another resource to be able to help your wife? \n\ni do think the wife needs to learn how to be less controlling if she wants help from others, but OP needs to grow up and act like an adult about it",
            "score": 1,
            "author": "Ecstatic_Walrus_9565"
        },
        {
            "level": 0,
            "comment": "Narc",
            "score": 1,
            "author": "Papalal13"
        },
        {
            "level": 0,
            "comment": "I think you and your wife sound like you could use a mediator to talk to each other. When my husband and I first got married I used to get on his case about folding the towels wrong. Then one day he just told me that if I wanted him to do equal house chores I should probably just let him do it his way, since there is no wrong way to fold a towel. At that point I realized there were definitely other hills to die on. Like never cleaning his hair up off the sink after shaving, and I gave up on the towels and tried to be thankful. Also he hates how I organize the dishwasher so he insists on doing that himself. We both came in with expectations that we had to sort out, but we only did it through having conversations.",
            "score": 1,
            "author": "K80lovescats"
        },
        {
            "level": 0,
            "comment": "Ppl really be thinking they deserve praise for doing the bare minimum as a spouse/coparent",
            "score": 1,
            "author": "BugsRFeatures2"
        },
        {
            "level": 0,
            "comment": "Regardless of who is right or wrong in this relationship, the fact that you’re suggesting taking a passive approach (avoid your relationship and spend more time at work) will never ever help you. \n\nStep 1. Bring this up to your wife (some great scripts are already given in the comments). \nStep 2. If wife denies/dismisses/doesn’t care to work on this with you, request couples therapy to help navigate. \nStep 3. If wife still doesn’t want to work on this in counselling with you, all cards go on the table (“If you aren’t willing to work on this together, then I don’t want to stay in a relationship that is making me unhappy”). Wife might agree, then you can part ways and both be happy. \n\nI’d also suggest individual therapy to address your own behaviour to build more confidence and self worth. If your wife is actually a horrible, critical person as your post suggests, individual therapy will ensure you don’t end up in a similar relationship ever again!!",
            "score": 1,
            "author": "pppppppppppp13"
        },
        {
            "level": 0,
            "comment": "This is the most perfect OFF MY CHEST ever!!!!",
            "score": 1,
            "author": "rhodatoyota"
        },
        {
            "level": 0,
            "comment": "I knew before I finished reading the post how this was going to go. The thing is, this kind of nonsense is exceedingly common, as is seeing women queue up to say it's the man's fault she's pulling BS like saying it adds to her burden to simply tell him how she'd like something to be done. I mean WTF hubby, you're not even a mind reader? That's \"weaponized incompetence.\" Put in some effort, dude. \n\nHere's how this works at my house. I do something. My wife says \"great, thanks.\"\n\nSometimes she'll say something like \"could you put the plates in the cabinet this way next time?\" I say sure, no problem. I don't really care how the plates go in there, so it doesn't matter to me unless she's asking for something that would make it a lot more work. \n\nOnce in a blue moon she'll say something like \"that's not right at all.\" I'll say \"oh, what's wrong with it?\" She'll say whatever is on her mind. Here's where it gets interesting. If she brings up something that makes sense and would actually improve the result, I say ok, I'll do it that way next time. If it's something that's clearly just a preference, I say \"oh, do you want to do it yourself next time?\" \n\nOn the really rare occasions when she come comes back with something snarky like \"if you can't see it, I'm not going to tell you,\" I don't even ask, I just say \"I see, well, you can do it yourself next time since the right way is apparently some kind of closely guarded secret.\" \n\nWe've been married for over 30 years now, and probably haven't had a fight about chores in 25 years. She knows I'll take direction if I think it's valid and helpful. She also knows I won't put up with BS game playing.",
            "score": 1,
            "author": "RegularJoe62"
        },
        {
            "level": 0,
            "comment": "So.. No. Her expectations are the cause of her disappointment. Regardless of whether you're doing something right or wrong, or even doing anything at all, it's her expectation of what you should be doing and how you should be doing it that's got her upset. And for real, if you do a thing, yet it's done in a way she doesn't want it done - then she has to at least inform you of her preferred way of doing said thing. \n\nHonestly, if my husband does something and it's not the way I'd do it, I still thank him and show appreciation. Because he did the thing. If he needs to ask me how to do something, telling him how is still not impacting my mental load as having to do it myself, plus now in the future he's already been taught how, so that's also taking from my load.  \n\nBeing upset because someone does something in a way I wouldn't have, yet being unwilling to tell/show them how I'd like it done just seems silly to me..",
            "score": 1,
            "author": "terilarusso89"
        },
        {
            "level": 0,
            "comment": "I'm not sure if this is true in your case... But in my case, when I get mad about things like this it's either because it's stuff he should already know how to do as a grown ass adult, or can look up on the internet if he doesn't know how to... Or at least show humility for having to request me take the effort to teach him something his parents should have taught him.\n\nAgain, not sure if this is true in your case... But if it is about cooking and cleaning, it's possibly an issue of your mom did everything for you so you don't know how to pitch in and your wife doesn't want to mother you. Might be time to grow up, if that is the case.",
            "score": 1,
            "author": "gobblingoddess"
        }
    ]
}