{
    "id": "148mcyp",
    "score": 1,
    "title": "“My love, I can’t see the future you do.”",
    "author": "AwayYogurt241",
    "date": 1686681530.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148mcyp",
    "media_urls": [],
    "other_urls": [],
    "postText": "When she broke up with me she said this. It completely shattered my heart and left me in shock. We never really talked about our futures throughout our relationship because we were living in the moment. I felt I was living in the moment at least, and she mentioned she was too. I don’t know. We talked about goals for careers but we were at different stages in life (fresh grad, I’m still in school), and I was more uncertain about mine more than hers. We had adventures vaguely planned, things what we wanted to do with each other, but we looked away from conversations about building our relationship through actions like moving in together, marriage, kids, etc…. Looking back I realize that was something I needed to do and figure out for myself… \n\nI think we were both nervous and scared because we were each other’s first real love. I was so open to being with her for longer than nearly 2 years, but slowly and slowly it seems she didn’t feel the same. I don’t know why. I was okay with the uncertainty our future held, because I desperately wanted to work on figuring all of that shit together… She was everything to me.\n\nI want to understand why she said this, really digest it, but I know it will ruin me if she told me the truth. It’s so weird because we never really talked it out to begin with. I guess I just don’t need to know. If anything, it is a lesson for my future loves. It breaks me that it isn’t with her… at least for now.\n\nSo really, I don’t want to know why she said that, and that is what I’m going to keep telling myself. But that one fucking phrase keeps playing in the back of my mind and I can’t get rid of it. It’s been a few weeks now. I miss her so much. \n\nIf you ever see this, I love you for what we shared. I hope you’re doing well.",
    "comments": []
}