{
    "id": "148r1nw",
    "score": 2,
    "title": "Friend Betrayed My Trust, Told Others",
    "author": "thrown2lost",
    "date": 1686694156.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148r1nw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, first time poster and a throw away account. I'm just here to air this out and see how other people feel and what they would do in this situation. This will be quite lengthy as there was a massive betrayal of trust involved and I dont trust people often due to being massively bullied when I was younger.\n\n&amp;#x200B;\n\n   Late last year I had a falling out with my friend who we will call H, I will be called M for this post, H is female and I am male. I had known H for nearly 10 years and had been a part of their friend circle for a long time though H and I would go months with out hanging out and just sending meme and gifs or random dumb things to each other over messages. H and I met at work and back when we first started to hang out H would be pretty open about all sorts of things, hobbies, anime, games, bands, really anything and everything. After hanging out with them a few months and going out to dinner H, for some reason, decided to show me some pictures of kinks they were into and, oddly enough, they were things I am into but I didnt tell her. \n\n   Something to understand about me is that I am very private about these things because I am petrified of people treating me different or ostracizing me because of something I am into to the point that I had guarded myself from opening up to people about anything that would seem out of the norm for someone raised in the 90s. It wasnt until I met this person that I started to open up about my interests in things like games and anime to people I worked with and interacted with on a regular basis. In fact it was H that helped me come out of my shell a great deal because of how expressive they were and how they just wore their personality on their sleeve. I knew was developing feelings for them but I wasnt quite sure what type of feelings they were. I know there is a big difference between infatuation and love and I knew I might want to pursue a relationship with them but didnt want to do so if it was just a physical attraction and I move VERY slow when it comes to making that choice because I dont want to pursue a relationship that wont be a lasting one. I want to be with someone and make a life with them and I want to make sure thats something I can see happening with that person if I am going to ask them out, is that weird? \n\n   By the time I decided to ask them out we had ran into a guy at the convention we were attending and there was a guy that she thought was cute but was to scared to ask him out. Me being SUPER drunk cause we had gone to a bar a just a short time ago i walked up to him and asked him if he was single, he was, and if he would like to meet H. He came over and started talking and they hit it off and they got together. I was fine with this because it was something H wanted and i was happy for her and i was happy just to be a friend because they made me feel more comfortable being me. This also gave me the perfect reason to not ask them out and risk being rejected which i have a huge fear of which stems from my lack of confidence in my personality and looks. Over the years we keep hanging out and stay in touch, that relationship didnt work out for her but she gets into another one and then she just vanishes off the face of the earth. \n\n   Then a few years ago a movie comes out that has my favorite Marvel character in it and she invites me out to see it out of the blue. We link back up and start hanging out again, turns out her last relationship was a very toxic one and shes just gotten out of it and I've spent some time growing into myself so after hanging out a few times I ask if she'd like to go out on a date or two to see if we're compatible and she declines saying that she just doesnt wanna do the whole dating thing right now and just get back to who she was. I understand and move on and we continue to hang out more and more and I start to view her as a friend which means a lot to me. Friends to me are people who I can trust with who I am with out the fear of being judged and I've never really had that before. Sure there were people I trusted but no one i trusted enough to fully open up to about kinks and other weird things because i knew they wouldnt understand but H would and so i opened up to her. I told H things about me i had never told anyone else that i didnt want other people to know and i made it a point to make sure H understood that and i thought she did.\n\n   Move forward a few months and H is starting dating again and has this pretty awesome job with people she likes being around. We're hanging out again and I told her that i applied to a company that we both know and get things from some times and she loses it laughing, which i do to because i applied while drunk one night (didnt get the job but it was pretty funny). Next week i find out that she told one of her coworkers about how she wanted to work for them if she could and told them she had a friend who applied for a job with them, she didnt say my name but remember this as its important later. She also tells person that not only does she shop there but i do as well, this time she does mention my name. This does concern me because even if they dont know me i dont want them knowing this about me, H and only H in my whole life about this kink(?) and dont feel comfortable with people knowing this about me because i believe it could lead to complications later on if people did know. I dont know what KIND of complications if any, honestly, but its still something i want kept private and i had only told one person in my whole life (29 when this happened). When she told me this i was shocked, concerned, and terrified about what these people would think and who would they tell but H's whole excuse was 'dont worry they wont tell anyone, they dont even know you.' \n\n   Move forward a few more months and i lose my really nice job and H puts in a good word for me at their company and i get a job with them. A few weeks after i start i'm talking with one of my coworkers with H and H tells them that i'm the guy who applied for the job at the company she wanted a job with. She outs me to this coworker. I go pale while he just chuckles and move on in the conversation. Once we're alone i start to low grade freak out and H says to not worry and that the coworker is a cool guy who wont tell anyone. They talk about this stuff because his girlfriend is pretty bland but hes interested in it but thats it. Then she mentions that another of the coworkers knows and i realize that the person she mentioned was another coworker and not a different person with the same name as them. I freak out internally but try to blow it off because I am in love with H, i have ben for a while, and am willing to just try and write this off. A few months go by and we have another new person start at this company who is to be her supervisor and i share an office with them. One day H comes into my office to tell me that the site had a new drop of items and released a new item as well while this guy is in our office and i just look at her shocked. She picks up on it right away and she says she had already talked with him about this type of stuff and told him that i was into it as well and not to worry about it because 'hes cool.' Again i write this off because of my feelings and try to move on.\n\n   Move forward a few months and the guy shes been dating just ghosts her because 'hes not in a good mental space for a relationship' and shes devastated by this because she really like this guy (we'll call him Ghost, Ghost has the same name as her ex. this will be important later). I feel completely awful for her because shes so dejected by it and i tell her that if she really likes this guy then she needs to put in the work, let him know that shes willing to be there for him if he needs someone and that she wants to be that person but H says no, shes tired of these guys going out a few times with her and leaving and that she was done with it. If they ghost her then shes just deleting them out of her contacts, apps, and life to which i say that if she really wants a relationship with someone she is going to need to be willing to fight for it and put i the work for one. A few days later we get something to eat on our day off and I tell her that I have something important I need to tell her to get off my chest and she agrees to hear me out. I tell her that I love her (we had been saying this to each other for a while now) and that I know she doesnt see me in a romantic way but I'm also IN love with her and thats something I will have to work past but I wanted her to know that because even if she feels like no one else does (she had been going through a pretty rough bit of depression lately) that I do. That I understand that isnt what she wants and I'm okay with that but its something that I will have to work on and get over but I needed to tell her so I could move on. Shes upset with me telling her this, shes single at the moment, and she didnt want to hear that and i understand and i tell her i hope that she understood where i was coming from and that i will be working on being the best friend she deserves to which she says shes a terrible friend.\n\n   Things go back to how they were before and we're hanging out in her office at work for lunch and she tells me she got a message from someone she deleted from her contacts and i ask her who. She says she doesnt know and i tell her i think its Ghost. She shrugs it off and we make plans for the weekend, come Saturday of the plans she bails because she had other plans to follow up on. Thats fine, next week we make plans again. She bails. We then make plans out two weeks in advance. She bails. This process repeats for nearly two months. Eventually she expresses interest in one of my hobbies that i'm super passionate about and i offer to teach it to her and mention theres an event going on this weekend that a few people we know and i are going to and invite her to join. She agrees and i pay for her entry into the event. Come the day of the event she mentions that she may not show because shes running around a few towns looking for some items with who i though was her ex and laugh and tell her to just let me know if she'll make it late or not. It gets later and later and i ask her if shes going to show up late and she says no because shes still with her ex and i laugh again saying, didn you say you werent going to be his taxi any more? to which she says not him and i realize shes with Ghost and not her ex at which point it makes sense as to why she was bailing on the plans we had made. She was bailing on me to spend time with Ghost which immediately made me feel like a total idiot and that i wasnt worth her time any more. It was a massive mood shift, whiplash levels of mood shift. I felt so bad, hurt, betrayed. It was like everything just kinda fell together and i felt i wasnt really a friend but more so a convenience to them.\n\n   They picked up on this and started to distance themselves from me and that was fine, i needed to sort myself out but eventually i wanted to talk this out with H and let them know how i felt. It got to the point that they were mad when ever i showed up and i asked if they had a problem with me and they didnt respond. After being on read for nearly two days i told H i assumed there was and she said that now we do. She was sick about hearing me talk to our coworkers about the hobby we all shared, that i was being rude and ignoring her, and that the one time she tried to talk to me when a group of us got lunch i didnt talk to her. I told her I didnt talk to her at lunch because we have nothing to talk about, i dont know where i stand with her and that if she wont hear me out on how i feel then we cant talk. \n\nH doesnt like drama and wont talk about things that are difficult and had been avoiding talking through not just my feelings for being ditched but also her telling 3 different people about something i had only ever told her in my whole life. I guess being ditched was the final straw that made the whole betrayal of trust situation really dawn on me. H never talked it out with me and i ended up confronting them over text messages because they werent going to meet up to talk about this in person or over the phone. I told them i trusted them and they betrayed that trust and lied to me several times and while i've been trying to talk to them about it. They asked how they lied and i told them about the times they said they were staying in and canceling our plans just to meet up with other people. thats not really a problem just tell me thats what youre doing instead of lying to me and having me catch you in it. Then H asked how they betrayed my trust and I told them that if it really mattered then they would be able to figure it out. I should have just told them but i was upset and in my feels so i didnt.\n\n   They said that they werent going to play games with me and that we should take a friend break and i told them that we already were, we hadnt been hanging out or talking for a few weeks at this point and how they didnt see that already was pretty strange to me. They go on to say more things about me and my personality which i acknowledge and admit need work and that i've ben working on it but when i bring up things about them they just keep listing things off about me regardless of how i've been working to better myself. \n\n   We havent talked about this since. My pet died a while ago and i guess i reach out to them because my pet was a massive part of my life and i want to fill the void and went back to talk to them. After talking to them a few times I said it'd be fine to talk occasionally but until we actually address the betrayal of trust there wont be anything more and I wont support them like i used to. That the ball was in their court and if they wanted the friendship we had back or to start building it up again its a decision that H would have to make and put time aside to actually talk through it with me. She said she understood and still doesnt like confrontation and would like to not if possible. Again I said it was her decision and that she needed to make it. That was 3 months ago and she hasnt offered to talk about it. I was hoping she would because i'm the type of person who need to talk thing out to move past them, its unfair to them i understand but i was hoping that our friendship was important enough to do so. I feel like i'm not important to them and never was, i feel like i trusted them when i shouldnt have, i feel lost. I feel like i was just a person they used to fill their time with until they hoped into their next relationship which was what happened the last two times. I feel like trash and i am trash. I feel like i'm the bad guy here but i feel like i'm coming from a justified place but i dont know. I feel like i shouldnt post this but i am.",
    "comments": []
}