{
    "id": "148vtr7",
    "score": 1,
    "title": "Self improving but it feels so empty",
    "author": "alt10account",
    "date": 1686708609.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148vtr7",
    "media_urls": [],
    "other_urls": [],
    "postText": "In the last months i lived a pretty monotone life, ive been attending college, but i dont put in pretty much any time besides completing hw or viewing the lecture presentations if there is any test soon. My grades arent really suffering from it though. Other then that, back then i just read a lot - as in a real lot. i mean i also had other hobbies like working our or practicing piano but i would mostly just read for hours every day.\n\nI dont know the average amount of hours, but for a sense of scale i completed a 14000 page series in less than 2 months and thats while i had to complete a pretty big project.\n\nA month ago, when my sister who lives abroad came back to visit for something to do with her job i practically forced myself to keep visiting her (it was basically while she was working, but the job was similar to something akin to a tourist guide so it wasnt that weird for me to come)\n\nThese 2 weeks were maybe the 2 weeks i went out of my house the most in a span of a month for the last three years for things that arent 'mandatory'. But even though i love my sister very much i had to force myself everyday to come. One day i even canceled one a meeting with her and our cousins just because i couldnt bring myself to go.\n\nEven though the more i enjoyed finally seeing the only core family member (as in siblings+parents) i can actually act with as myself without it feeling out of place the more i forced myself to go out of my comfort zone the more i broke down when i was alone.\n\nThere is a reason for that, but ill continue on that after.\n\nA few days ago, i tried finally doing the switch i wanted to do for some time and cut down on my reading time, as most of it is mostly probing for good books since i finished the ones i really like already. I dialed down and did thing that i wanted to do, i played some video games i lost passion for, i actually studied the piano instead of mindlessly repeating old songs/ using my left hand to play it while on the computer and even started to eat slightly better from the 'im sleepy all thd time' amount of food had per day.\n\nBut even though i thought that if i forced it for a while it would truly help it didnt.\n\nSome part of it can be attributed to my lovely sister, who really fucked me up several times even though it was on accident. From her saying something that really hurt me, not because it was an insult but because it showed that she thought i liked spending time with her only because she has cools things to offer. And another time where she made me feel as if i am just a label called 'brother' she gives only artificial care for, when i basically broke down in front of her after once again, you guessed it, trying to force myself to talk about my feelings to a person that seemed, at least at that time, as a saving grace and told things i bottled up for a long time. Even though she did talk with me, and i almost feel guilty for saying it; i didnt feel her heart in it. It was like me writing this entire pos only for someone to respond 'ok' (if someone does that it would be kinda funny ngl). Even when she went throught something that i thought she also needed comforting she told me it wasnt that bad, and i believe her. But she barely talked about it with me for a few minutes and i did most of the talking just trying to relate to how she feels. But i know she talked with one of her friends about it for longer then that 2 seats behind me in a bus. I know she doesnt owe me this, but it still hurts when a person i place so much emphasis on doesnt recipocate it.\n\nI know that if someone would ask her she would say she truly cares, but i got more of a response from my cousin after saying \"fine but not great\" as a response to a text saying 'how are you' than i got from her after all the things i said above. It probably has to do with her being less good at this kind of stuff but it feels like something beyond that\n\nIm slightly warping the chronological sequence of events here but i have no idea how to tell it better.\n\nBecause of that and because of the thing above it i started having some intrusive thoughts when i was home alone.\n\nAt first i just thought about it as something that is an option but will never happen, but then i started scratching my arm with a knife and now i have some bloody cuts on the right side of my left sole (i dont want scars on my arms)\n\nHonestly, i dont even get any andernaline from that. I just like the sense of liberty and the stimulation the pain gives, it helps me trying to push myself more. I know its not healthy, but i feel like going back to my previous always only half consious state is worse.\n\nI did have some sort of different coping machanism before that, where i would try write my feelings in a notebook app in a rythmic and slightly poetic way, but i dont feel like thats enough anymore, so i brought it here (minus my amazing writing abillities since this post is a mess)\n\nI dont think i havent cried a single day over the last 1.5 weeks, and even then i feel like im holding myself back. I just cry soundlessly, but i feel like i want to actually let it all out, but i cant seem to do it. But on the contrary, for literally any other person besides me my life looks like its going the other direction.\n\nIm finally going to get my license soon after being stuck halfway through the driving lessons for a year and a half, i started going to job interviews, and i was even told by 3 seperate people that i seem like i have a lot of motivation after talking with them about some of my latest 'breakthroughs' (for lack of a better word) in the various hobbies i meddle with just before being told how positive my vibe is (only by 1 of the 3). even though all that motivation is fake. Its just me balancing myself on a rope waiting to for the inevitable fall that i dont want to come.\n\nI do like individually working out, playing piano, and talking to people, but i feel like that only in an ideal version of this world ill be able to look forward to things i actually like doing.\n\nI pretty much took the \"depressed? Just dont be sad\" approach here, not because i thought it would work, but because i felt like i would at least have something to show for my time.\n\nI pretty much gave up hope for recovering from this unless there is a significant change in my life\n\nI really have a lot more to write about this, but im going to stop myself because i feel like thats enough for now and also if i keep going im going to ruin my sleep scedule even more.\n\nI wanted to post this here just for the sake of it, maybe there are some comments that will give me insight. Thanks in advance",
    "comments": []
}