{
    "id": "148wr99",
    "score": 2,
    "title": "To Hell With Rheumatoid Arthritis",
    "author": "MoldInYourShed",
    "date": 1686711578.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148wr99",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I am 18 years old and was diagnosed with Rheumatoid Arthritis (RA) about 6 months ago. I've had severe pain in my back, legs and recently hands/wrist since I was 15 years old. I'm basically bed bound and it's depressing. I have no motivation, no desire to do anything. When I get out of bed and try do simple things (cook, clean etc) my back becomes unbearable so to ease the pain, I crawl back into bed. The level of pain wasn't as bad until roughly a year ago. I'm also diagnosed with Anxiety, which I take medication for, meaning I never ever leave my house. I haven't been outside (properly) in over 2 years. I don't meet with friends, because I lost them all after I suddenly couldn't leave my house (This was after multiple traumatic events) and was and still am absolutely terrified of everything. I wanted to become some kind of police officer but who would hire me? Am I able to do so? No. I got offered surgery to fix/whatever on my back to help it but I was told it has the potential to leave me paralysed. In truth, I'm depressed, lonely, deprived of everything and envious of everyone else who is living their life. IM 18 YEARS OLD I should be out doing stuff I'm not supposed to, going to pubs, bars anything! But I can't, I'm unable to. Nothing brings me joy anymore, I watch meaningless TV shows, games don't interest me anymore. \n\nThanks for reading the \"rant\". Have a nice day/nice and never take life for granted.",
    "comments": [
        {
            "level": 0,
            "comment": "Having RA at 18 has to suck a lot!! \nI'm struggling today with arthritic pain too. Even the hydrocodone isn't helping so I am just scrolling through Reddit trying to distract myself.\n\nJust a thought--is there an occupational therapist you could see? They may have tips or adapted equipment you could use to make life just a little bit more comfortable for you.",
            "score": 1,
            "author": "JuneTheWonderDog"
        }
    ]
}