{
    "id": "148z3ym",
    "score": 1,
    "title": "I hate fatphobes",
    "author": "dogsrneat27",
    "date": 1686719341.0,
    "url": "https://www.reddit.com/r/offmychest/comments/148z3ym",
    "media_urls": [],
    "other_urls": [],
    "postText": "I hate them. There is nothing that fills me with more rage. I’m not overweight, but I’ve struggled with body image my entire life and I’m not what a lot of these shitbags would call “ideal”. I hate the stupid “amiugly” subreddits that keep being suggested to me because I keep yelling at the fatphobes on there. I hate the reels, shorts, and TikTok’s that pop up where gym bros are just insulting fat women to their faces. I hate the comment sections under every plus sized creator’s posts that are full of thin people shitting on plus sized people simply living their lives. I feel so much genuine hatred towards these people, I wish they would disappear off the face of the earth. \n\nI was watching an insta story of a girl who was working out and it was like “these are the things I don’t like as a plus sized athlete”, and then she showed some normal stuff to dislike. The comments were horrific. They told her to lose weight, said her ankles wouldn’t hold up, that she shouldn’t even bother because she won’t ever look good, laughed at her for calling herself an athlete, and generally were just vile. On one crusty comment with weight loss “advice” she mentioned having an eating disorder and everyone under that comment was like “no you don’t, you’re fat” “obviously not disordered enough” “no one gives a fuck about your eating disorder”. \n\nThey would NEVER treat a thin woman this way. They wouldn’t treat a fat man this way. I hate them. They always say it’s under the guise of “not promoting obesity” but then when a fat person posts about getting healthy they bully them too. None of these assholes give a fuck about health. They are bad people, and they need someone to take it out on. There is obviously so much bigotry in the world but fatphobia feels like it’s the only thing that media sites and society at large looks past when it is so blantant, which is why it’s so frustrating. You can tell a fat woman to starve herself more on instagram and the platform doesn’t see that as offensive. \n\nI’m disgusted by fatphobes. I hate them so much. If these are your views, I’m disgusted by you. I never want to speak to a person who’s held these beliefs (same with all bigots). You are a bigoted piece of shit who deserves absolutely nothing. Leave people alone. Quit kidding yourself into thinking you’re fit for society. You suck. Leave them alone.",
    "comments": [
        {
            "level": 0,
            "comment": "Fat men are treated worse... They don't whine like you.. Kindly Get healthier",
            "score": 4,
            "author": "Layman_Lazyboy_420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amen! \n\nSigned, a fat guy.",
                    "score": 2,
                    "author": "SpamRiskLikely"
                },
                {
                    "level": 1,
                    "comment": "I’m… not overweight. Like I fucking said. Fat men are not treated worse there have literally been studies done on this. But it doesn’t matter because shitbags like you will bully men too. If you’re one of the the people who does this shit then like I said, you deserve nothing. Leave people alone. Leave fat men alone, leave fat women alone. I’m so fucking sick of people like you treating people you deem unattractive like crap. Stay in your basement and don’t come out. Fucking tired of society tolerating people like you.",
                    "score": 0,
                    "author": "dogsrneat27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Studies... Really? Studies done by bunch of dumb feminists with huge biases? Fat men don't think much to fat phobic stuffs said to them coz they have been bullied like that since childhood and have become sensitised. If you aren't overweight as per standard BMI then it's probably women who are jealous of you who are bullying you.",
                            "score": 2,
                            "author": "Layman_Lazyboy_420"
                        }
                    ]
                }
            ]
        }
    ]
}