{
    "id": "fgj4m9",
    "score": 30778,
    "title": "To those who are stockpiling over the Coronavirus, fuck you.",
    "author": "Kpruett95",
    "date": 1583867354.0,
    "url": "https://www.reddit.com/r/offmychest/comments/fgj4m9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Because of you, people are unable to buy the basic everyday necessities like hand soap and toilet paper. Because of you, a 2 pack of Clorox wipes is $50 and a big bottle of hand sanitizer is $50.\n\nStop stockpiling. You don’t need all of it, and you’re keeping it away from people who really do need it, coronavirus aside.\n\nAnd if you’re someone who is buying out the stock to resell it for a profit: I hope that every time you’re barefoot or wear just socks that you step on something cold and wet. I hope that you constantly get papercuts in between your fingers. I hope that there is a pebble in your shoe that you just can’t get out. I hope that there in something pokey in your jeans, but when you go to get it, you can’t find it. I hope that you get food stuck in your teeth and you can never find floss to get it out because some freak bought out the entire stock.\n\nEdit: I have to say, I appreciate that feedback, positive and negative. I appreciate hearing your side of things and getting to step into your lives as people in need. Thank you strangers for the awards! I had no clue this was going to blow up so much! Sending happy thoughts everyone’s way!",
    "comments": [
        {
            "level": 0,
            "comment": "China is making reselling these items a crime.",
            "score": 1453,
            "author": "Adhdicted2dopamine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don’t most products say “Not for (individual) resale” on the bottle/packaging?",
                    "score": 304,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's generally for multipack items, so shops don't buy 6 packs of Coke (for example) for cheap and sell them individually for higher prices.",
                            "score": 167,
                            "author": "Helloiamgary",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, it's because they don't have the legally required nutrition information on them. You may definitely sell individuals from a six packs of Coke.",
                                    "score": 84,
                                    "author": "sandefurian",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Only applies to actual businesses.",
                            "score": 32,
                            "author": "pudeximtegtnod"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to the market this past weekend to buy steak.  I saw plenty of water and toilet paper despite my nearby Costco being on the news for panic shoppers.\n\nI fell for the panic and bought an extra piece of steak.",
            "score": 3220,
            "author": "FancySack",
            "replies": [
                {
                    "level": 1,
                    "comment": "My panic purchase was buying a second thing of bacon and some legos. My work is planning on shutting down our building so my thought process was like “legos will give me something to do.” I am 24.",
                    "score": 1255,
                    "author": "thegigsup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ha, I work in a place that sells LEGO’s and we just got the ISS LEGO. Boss asked if me and hubby want to put it together for the display. Hells yeah we do! Now we get to put it together and not have to buy it or worry about where to put it when we’re done :D",
                            "score": 224,
                            "author": "breesanchez",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This sounds like the best thing ever! Where do I sign up to build LEGO’s for display!?",
                                    "score": 51,
                                    "author": "batteriesnotrequired",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Step one, work at toy store",
                                            "score": 8,
                                            "author": "PuttingInTheEffort"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Legos, great idea! \nMy work is most likely going to force us to work at home. I’m going to be too restless and anxious to be on my laptop or anything electronic. Legos have endless possibilities! I’m 38.\n\nEdit: I also paint (acrylic &amp; oils). So I’m probably going to do a LOT of that.",
                            "score": 238,
                            "author": "sophro_syne",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Way to start a run on Legos...",
                            "score": 25,
                            "author": "gaveedraseven",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I’ve turned to puzzles, I’m 35.",
                            "score": 66,
                            "author": "liriwave",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Puzzles are legit! I always buy puzzles around the holidays because my boyfriend and I do them. We're in other 30s. You're totally good!",
                                    "score": 12,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol, me too. Those and board games. But I keep taking over the game table with my puzzles.",
                                    "score": 11,
                                    "author": "breesanchez"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I bought a bunch of legos and other busy activity kits for my kids. They are 3 and 1 and will not respect that I have to work even though I am home. TV and toys for the win!",
                            "score": 11,
                            "author": "thestarlighter",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah all the other stores I've been top are fully stocked on TP every morning, then run low toward the end of the day. It's not a snow storm, I don't get it.",
                    "score": 88,
                    "author": "RUfuqingkiddingme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s the media making sure to show empty shelves somewhere so people freak out. The city where I live has plenty of toilet paper. Not sure about hand sanitizer or alcohol, haven’t checked those lately.",
                            "score": 71,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We have plenty of everything except soap is slim pickings and hand sanitizer is nonexistant",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's also been in the news in my area that people are going and clearing out Costcos nearby, meanwhile the grocery store 4 blocks from my house has plenty of everything and hardly anyone in it lol",
                    "score": 69,
                    "author": "Jangle_Bottom_Jeans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly my experience yesterday. No paper products to be found at BJ’s. Look over to see a guy paying for 3 FLAT CARTS 4 FEET HIGH with bottled water (F that guy if his motive is to hoard and make a profit on *WATER* if this gets really bad), I swear people like this start the panic.\n\nI drive home just a few miles away and stop at the grocery store because we were genuinely low on TP, and there was plenty.",
                            "score": 19,
                            "author": "MyLouBear",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 107,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Esp if you're stuck at home and have kids....",
                            "score": 33,
                            "author": "DoctorCaptainSpacey",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Priorities",
                    "score": 27,
                    "author": "Kpruett95"
                },
                {
                    "level": 1,
                    "comment": "I bought a bunch of lobster tails. The price has hit rock bottom and we have a vacuum sealer so I figured I might as well.",
                    "score": 57,
                    "author": "SlapCracklePlop",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This man knows how to act during a pandemic.",
                    "score": 17,
                    "author": "wastelandzombie",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It is known by a very small minority that steak cures all. You should keep it on the DL before the hoarding spreads to the meat department",
                    "score": 12,
                    "author": "festizzio22"
                },
                {
                    "level": 1,
                    "comment": "Wtf is wrong with you!!! Someone else needed that steak!! How dare you spend YOUR money on YOUR needs! Think of the children",
                    "score": 51,
                    "author": "Joeybatts1977",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Think of the children\n\nNo!",
                            "score": 32,
                            "author": "FancySack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fuck them kids..",
                                    "score": 41,
                                    "author": "Eleepzo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "no dont",
                                            "score": 41,
                                            "author": "themightyduck12",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm immunocompromised and I can't get rubbing alcohol or hand sanitizer, two things that can help me stay safe.\n\nEveryone in my family is immunocompromised; I'm the healthiest. If I were to get this and be asymptomatic for a few days and spread it to them, I could quite literally wipe out my entire family (two people have copd/are on oxygen and 1 is on a mild form of chemo).\n\nhoarders and resellers especially are fucking scum.\n\n&amp;#x200B;\n\nedit: My boss is giving me a bottle from our office supply, so I'm set for now.  Thank you everyone who offered.  This is a very kind corner of the internet. &lt;3",
            "score": 2310,
            "author": "chicklette",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please be safe and try not to go out! I hope you stay healthy and away from COVID19.",
                    "score": 344,
                    "author": "kashyapbodi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&lt;3 thanks.  I work with the public and there are cases in my city, so to be cautious, I missed my grandma's 93rd birthday yesterday. I'm just terrified to see my family in case I've accidentally picked it up.",
                            "score": 216,
                            "author": "chicklette",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re doing the right thing!",
                                    "score": 103,
                                    "author": "kashyapbodi"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Check \"Bath and Body Works\" for hand sanitizers.  One of our local stores got a load in a couple days ago and haven't sold out yet.  What else do you need.  If I can help you, I will.",
                    "score": 68,
                    "author": "intransit47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a great idea!  My boss just gave me one of the big bottles we have for the office, but thank you so much!",
                            "score": 25,
                            "author": "chicklette"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know. I went to the store today to buy rubbing alcohol, because my hubs is immuno-compromised right now after a bout of cancer treatment. Couldn't find it. I was like, \"What t he Hell?\" \n\nSo stupid. We've stopped buying from Amazon as well, because the price gouging. \n\nI was around for Y2K and it's like that only not as many people had the Internet, so it wasn't quite as bad then. Now it's just beyond ridiculous.",
                    "score": 145,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I found some Isopropyl Alcohol 91% at $2.59 on Target online. I use mine for work and was the only place I found some.",
                            "score": 70,
                            "author": "DarkRed40",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 57,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People are (or at least I was) looking for 91% and up to blend with aloe vera gel to make their own hand sanitizer. The cdc has a recipe. But awesome info",
                                            "score": 36,
                                            "author": "theyreall_throwaways"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So dilute your 91%?",
                                            "score": 27,
                                            "author": "cupcakemittens234"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So Amazon is really cracking down on price gougers right now, and listings making false claims about how they could treat or cure Corona.  They’ve pulled something like a million listings recently.\n\nSo I hope that frustration is aimed at the asshole sellers, and not the slightly-less-asshole-than-usual corporate giant.",
                            "score": 65,
                            "author": "therealniblet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, yes. I probably should have said it's at the sellers. But that's good to hear Amazon is cracking down on them. I'll check them back out after that. We use them a lot and I was really disheartened to think sellers could be jacking up their prices to take advantage of a crisis like that. Not that I was surprised honestly, but still.\n\nI ignore scammy spammy health claims anyways.\n\nThanks for the info!",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey! I have a small bottle of hand sanitizer at the house unopened and we got lucky and found a large bottle at Costco by chance. Let me ask the girlfriend, but I'd be more than happy to send you the small bottle. Would be coming from Columbus, Ohio.",
                    "score": 107,
                    "author": "highchaos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are awesome! I would also be happy to send what I have as well!",
                            "score": 37,
                            "author": "ShellBells514",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, another comment on this thread seems to be in need of that too. The name's u/247doglover",
                                    "score": 23,
                                    "author": "Lazybangs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh wow thank you so much for thinking of my comment and my parents. I’m in tears seeing this, my mom has stage 3 breast cancer and is undergoing aggressive chemotherapy leaving her White blood cell\nCount 0.3 as of her last appointment this past Thursday, and my father is a stroke Patient so he’s also immunocompromised. For them any small bacteria or virus is detrimental and can wipe them out. We change our clothes when we go home and ask Others to do the same.",
                                            "score": 23,
                                            "author": "247doglover",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t have a lot, my husband grabbed a few small bottles from a gas station, but I feel you and your family need it way more than we do and if you would like me to send it to you, I will be happy to do that. You can send me a private message.  I hope your parents heal and things get better for you all!!",
                                                    "score": 5,
                                                    "author": "ShellBells514",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Aye! For a better tomorrow!",
                                    "score": 5,
                                    "author": "highchaos"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you! My boss is giving me one of the big bottles we have for the office, but thank you!!",
                            "score": 10,
                            "author": "chicklette",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds good. Hit me up if you find this all hasn't blown over and you've run out. Much love from a stranger!",
                                    "score": 11,
                                    "author": "highchaos"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Try Dollar Tree or whatever your local dollar store is called. Same alcohol as anywhere and plenty of it last time I checked. Or, you can buy a big old industrial can of it at a hardware store.",
                    "score": 31,
                    "author": "SlapCracklePlop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "4 different dollar trees were sold out by me",
                            "score": 6,
                            "author": "m_d_f_l_c",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The resellers are definitely scum, but I'm also mad at the retailers for not implementing a 1 item per person policy for these things. I don't know, maybe customers would find a way to get around that anyway.",
                    "score": 35,
                    "author": "PantryGnome",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mood. Our area isn't too bad for stockpiling and hoarding (most places still have toilet paper and canned goods), but all the hand sanitizer, lysol packs, and anything remotely antibacterial is sold out.\n\nI've got a couple of autoimmune diseases and get sick a lot, same situation where it runs in the family. Worried about what'll happen if it hits my city.",
                    "score": 48,
                    "author": "bituna",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have 19 cases now in my city. I told my mom I'm not visiting until this is contained.  I just wouldn't be able to live with myself.",
                            "score": 7,
                            "author": "chicklette"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are people hooked up to machines on hospice that actually need alcohol wipes for some of their medical equipment for sanitary reasons. It's freaking ridiculous the selfishness of these hoarders.",
                    "score": 36,
                    "author": "ThalassophileYGK",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Pleas stay safe and always stay away from the crowd until this covid-19 passes. Immunocompromised, elderly, pregnant, and those with co-morbidities are of higher mortality than those of healthy individuals.",
                    "score": 8,
                    "author": "anotherasiannurse123"
                },
                {
                    "level": 1,
                    "comment": "Hi, I have a medium bottle of hand sanitizer that's been sitting around the house unused for months. If you're in Australia,  pm me you address and I will send it to you. Free",
                    "score": 9,
                    "author": "angelofjag",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bet Craigslist is filled with idiots selling shit",
            "score": 862,
            "author": "JustaItalianDad",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work at a paint store and guy bought most of our stock of face masks, then came back to buy more, then told us he was reselling them for double the price. Now we’re hiding them.",
                    "score": 1177,
                    "author": "Kpruett95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck that guy.",
                            "score": 533,
                            "author": "Salty-Shame",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "People are such assholes. My best friend is a big contractor and his guys rely on those masks for their demo and painting and have been forced to work without them bc he can no longer but them at the paint store or Home Depot. \nPlease add I hope they find a curly hair in their food and suffer from an annoying eyelash in their eye that seems to be there for days !!",
                            "score": 230,
                            "author": "thisyearsgiri",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk what country your friends business work out of but in the USA if you’re a job you’re a job that requires face masks from the EPA or OSHA and you have your workers working without them you can expect millions in fines. \n\nSource: have seen similar things happen in the asbestos industry resulting in millions of dollars lost.",
                                    "score": 94,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It sucks that your friend would have to shut down construction because of this hoarding bullshit, but he absolutely should not have his people working without the proper safety equipment and he should be shutting down his projects.  He is opening himself up to massive lawsuits.  That is assuming the masks are actually required for the work.",
                                    "score": 39,
                                    "author": "m_anne",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So you're aware, the resellers and panic-profiteers are likely breaking the law. It's hard to say if they will actually face justice, but I'll keep my fingers crossed. If the mask guy comes back tell him you're gonna report him to the DOJ and see if he shits his pants.\n\n[\"More than two-thirds of the states have laws preventing price-gouging of necessities\"](https://www.forbes.com/sites/joanverdon/2020/03/04/coronavirus-related-price-gouging-is-a-risky-business-for-retailers/)\n\n[\"The Department of Justice today announced its intention to hold accountable anyone who violates the antitrust laws of the United States in connection with the manufacturing, distribution, or sale of public health products such as face masks, respirators, and diagnostics.\"](https://www.justice.gov/opa/pr/justice-department-cautions-business-community-against-violating-antitrust-laws-manufacturing)",
                            "score": 22,
                            "author": "ExistentialEchidna",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Your store should exercise their right to refuse service to him.",
                            "score": 47,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We do! I told my manager I would send him away next time he came in and he agreed with me",
                                    "score": 19,
                                    "author": "Kpruett95",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“People are sick and scared and some are dying.\n\nTime to make some money!”\n\nWhat sort of trash do you have to be? I’m okay with capitalism, but there are limits.",
                            "score": 6,
                            "author": "Tweapodok33",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "We tell those kinds of people they need to be purchasing from business supply store and not from here and then refuse the sale.",
                            "score": 5,
                            "author": "Srsly_dang"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yup and Facebook Marketplace.",
                    "score": 46,
                    "author": "AFXC1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 40,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it's ridiculous. It's best to just screenshot these posts and save them for the future. That way we can look back at how ridiculous these prices were.",
                                    "score": 18,
                                    "author": "AFXC1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 803,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, we definitely would.",
                    "score": 185,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 59,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What about the 28 days later version? Still alive but rabid.",
                                    "score": 37,
                                    "author": "PennName47",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've been thinking of exactly the damr thing. It's scary to think that humans could actually act like the people in the movies who literally kill for anything.",
                    "score": 33,
                    "author": "aggsimalone",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If that is the case then my lethargic ass is screwed",
                    "score": 41,
                    "author": "Names_Are_Stupid_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The key is not to go outside.",
                            "score": 20,
                            "author": "megmatthews20"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd be dead at the beginning of the apocalypse because I am tired af the most time at the moment.",
                    "score": 16,
                    "author": "Hubsimaus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some might say the real monsters are the living.",
                    "score": 4,
                    "author": "zeoranger",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm pretty confused why so many people are worried about tp. I understand that there's some crazy people buying like 5 years worth, but why is there so many people who are on their last roll and just now looking for it? My city Facebook page is full of people who literally ran out and it's only been a thing for a couple days. \n\nI'm starting to feel like a weirdo for always having a full large package as backup. It's not for the virus, it's just cause I hate to have to go shopping for one single item that won't even go bad.",
            "score": 202,
            "author": "AJ-in-Canada",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I am always a little bit stocked up. Got that from my Grandmother who went through the depression.  I'm afraid if I ran out of TP she would throw something at me from Heaven...she was a tough Lady.",
                    "score": 84,
                    "author": "ajdsgranny03",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same here. It won't expire and you're going to use it for sure. I have a stockpile even when its not a special time period...",
                    "score": 39,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I'm a bachelor frog person who generally doesnt buy toilet paper until Im peeling that last square off the roll",
                    "score": 37,
                    "author": "GrumbleCake_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What's a bachelor frog?",
                            "score": 8,
                            "author": "AJ-in-Canada",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was one of thise old macro memes of a lazy, gross single person.",
                                    "score": 8,
                                    "author": "GrumbleCake_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agreed. The extent of my stockpiling has been one pack of Clorox wipes, not exactly an unreasonable purchase. But it’s driving me nuts because folks are raiding the shelves of stuff I’D NORMALLY BE BUYING IN REASONABLE QUANTITIES and now I can’t get any. I couldn’t find the Kleenex I wanted yesterday. I was worried I wouldn’t be able to get aloe vera gel due to hand sanitizer DIYers. I was buying it to treat a damn sunburn. Fortunately I had no trouble finding what I wanted, but they definitely weren’t well stocked. I might need to go grab toilet paper just to ensure we have some when we actually run out. Tl;dr people need to wash their hands and chill out.",
            "score": 231,
            "author": "lizardgal10",
            "replies": [
                {
                    "level": 1,
                    "comment": "July last year I bought a Costco clorox pack of wipes. I still have 3 full containers. What do these people planning to do, take clorox wipe baths?",
                    "score": 57,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i use them to sanitize my kitchen counters before making food. my cat, despite being told several times not to, enjoys jumping up onto the counters and the island.",
                            "score": 20,
                            "author": "might_not_get_it",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was out of cleaning wipes and had only a few rolls of TP left when the panic buying started. I wasn’t able to buy the wipes but I did get one extra case of TP. It’s good to be prepared but I saw people walking around with entire carts filled with TP!",
                    "score": 38,
                    "author": "froogette",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At one of the Costcos in my town I saw someone walking out with about 400 rolls of tp. Someone walked up and said “hey man, I’ve got a family of 4, can I have one of your 10 cases of toilet paper? We have none at home and the shelves are empty” and the person with all the tp just went “nah” and fucking left. Some of these supplies hoarders are disgusting.",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow that’s fucked up. People can be such assholes.",
                                    "score": 12,
                                    "author": "froogette"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If your store has a travel section, check over there for travel size disinfectant wipes. My local Walmart was clear out of regular size Clorox and Lysol wipes but over in the aisle with the shampoos and razors where they keep travel sized stuff, there was plenty travel size.\n\nMay not be the case where your at, you might have smarter hoarders. But it's worth a look if you're in a pinch.",
                            "score": 14,
                            "author": "adriarchetypa",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This virus made me realize that a lot of people really walk away from toilet without washing their hands.",
                    "score": 10,
                    "author": "TakeThatOut",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Same! I bought a single pack of wipes and two bottles of bleach and some disenfectant because we finally ran out! The lady at the store told me to grab some more and I told her I didn't need it because I don't.",
                    "score": 14,
                    "author": "diffharmony",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The only extra stuff I bought was a flat of water, 4 cans of tuna, 2 bags of pasta, and toilet paper because I was out (only one package), and Kleenex because my dad continuously blows his nose.",
                    "score": 7,
                    "author": "whifflesnippet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It really is annoying. For some examples, there are people who need things like Clorox wipes or baby wipes because they have a newborn or live with an elderly person, therefore higher need to wipe things down. The rest of us can use normal soap and a cloth. There are people who need face masks and hand sanitizer more urgently because they’re more susceptible to disease than the rest of us. \n\nFor gods sake just buy some hand soap and wash your hands! Better yet, buy the bars of soap because they last longer and use less plastic than the bottles of soap. A hygiene habit you should already have. Refrain from touching your face. And if it’s cold enough to wear long sleeves where you live, just open door handles and such with your sleeves, don’t buy out all of the rubber gloves. Remember to wipe off your phone with some phone or eye glass cleaner. Eat healthy and drink lots of water to keep your immunities up. \n\nAnd finally, corona is a viral form of pneumonia and does not make you shit like a dragon. So stop stockpiling on toilet paper!",
            "score": 371,
            "author": "misschris666",
            "replies": [
                {
                    "level": 1,
                    "comment": "this... there have been people stealing hand sanitiser in hospitals. because they totally don't need it amirite? it's not as if there are much worse diseases that are contained in hospitals that we really don't want to spread",
                    "score": 83,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly! That is disgusting behaviour. Hand sanitiser is a big need in hospitals.",
                            "score": 6,
                            "author": "NonsenseText",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. My office is dangerously low and we can no longer order more. We see around 100 patients a day, many of whom are elderly or infants.",
                                    "score": 6,
                                    "author": "clydesdale_unicorn",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I understand the water, soap, and Clorox wipes, BUT WHY THE TP?",
                    "score": 114,
                    "author": "Kpruett95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’re quarantined you won’t be able to go out to buy toilet paper.",
                            "score": 161,
                            "author": "trashtierqueen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is the actual answer.  However, the chances that the majority of Americans will be subjected to a quarantine is not that great.  This is just panic.",
                                    "score": 94,
                                    "author": "Mavplayer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The average family still doesn’t need 400 odd rolls of toilet paper, even if you are quarantined. The stupidity in people is on full display right now.",
                                            "score": 30,
                                            "author": "ketowarp",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Right?! If you’re shitting so much that you need 400 rolls of toilet paper, you should be washing your ass with soap and water instead of wiping with paper! Common sense ain’t so common.",
                                                    "score": 30,
                                                    "author": "Ajna_Magik",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If I needed 400 rolls of TP I'd be curled up crying in the bathtub most likely.",
                                                            "score": 14,
                                                            "author": "Ridiculisk1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "or bleeding to death from anus chafing",
                                                                    "score": 13,
                                                                    "author": "I_Am_Mandark_Hahaha"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But what if I have ultra diarrhea?\n\nThat question has nothing to do with coronavirus, just you know, in general.",
                                            "score": 35,
                                            "author": "mashuto",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Then get that extra strength Imodium. 😎",
                                                    "score": 25,
                                                    "author": "trashtierqueen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Got it, hoard immodium. You all are doing this zombie outbreak wrong.",
                                                            "score": 23,
                                                            "author": "mashuto",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nausea, heartburn, indegestion, upset stomach, .....ultra diarrhea? Yay pepto bismil",
                                                    "score": 14,
                                                    "author": "Mostly__Relevant"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; However, the chances that the majority of Americans will be subjected to a quarantine is not that great. \n\nI bet Italy didn't think that two weeks ago",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 49,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "honestly, its the lemming effect. Others see/ hear of TP running out at stores, go get some, and then others see that, and follow suit. \n\nAt the end of the day, lets say there is a quarantine put in place... No one wants to be running out of TP if they are stuck at home for 2 weeks.\n\nBut... \"\n\n**\"...do a handstand in the shower, grab a sock, improvise... your 15 years old for christs sake...\"**",
                            "score": 13,
                            "author": "smoothVroom21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "or just get a bidet and save hundreds on TP over time",
                                    "score": 14,
                                    "author": "stepheatsnothing",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don’t understand this either. I picked up groceries today at wal mart and there’s no more toilet paper there. Cleaning supplies are pretty much gone. No more Clorox wipes. I’m out of cleaning spray for wiping down the counters and stuff. I’m going to have to either make some or search a bunch of stores until I find a bottle because I decided not to have 800 bottles on hand a week ago.",
                            "score": 8,
                            "author": "ashrosc",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "White vinegar works for cleaning as well, even though it smells horrible.",
                                    "score": 14,
                                    "author": "jorn158",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Vinegar only does an ok job of actually disinfecting stuff though.\n\nSource: I had to run an experiment on how well different cleaning supplies work for disinfecting for my microbiology lab and I wrote a paper on it. The vinegar did a slightly better job than doing nothing, but it still wasn’t anywhere near an acceptable level.\n\nEdit: something like bleach or very high concentration vinegar would probably work much better.",
                                            "score": 11,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "A gallon of bleach is more effective, cheaper and lasts longer.",
                                    "score": 6,
                                    "author": "lnsewn12"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's because of a myth that China produces all of the TP and what with all the halted production over there people are thinking we're gonna run out of TP.  \n\nIt's BS of course, but that hasn't stopped people before.",
                            "score": 22,
                            "author": "ZoeyBeschamel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im down to like 2 rolls of toilet paper at home, starting to stress....",
            "score": 124,
            "author": "Rabbit-King",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would be more stressed about that than the virus.",
                    "score": 94,
                    "author": "Iforgot_my_other_pw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am indeed more stressed about that than the virus. Imagine getting quarantined in this state. Time to dig up my old magazine collections, just in case....",
                            "score": 37,
                            "author": "Rabbit-King",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Watch out for papercuts",
                                    "score": 12,
                                    "author": "Iforgot_my_other_pw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Who coulda guessed the longterm consequence of poor Chinese government would be papercuts on my asshole",
                                            "score": 27,
                                            "author": "Rabbit-King"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just ran out a couple of days ago. I felt weirdly ashamed walking through the store with a large pack of toilet paper in my cart. I was just willing the other shoppers to know I wasn't buying it because of the hysteria, but because I poop a lot.",
                                    "score": 9,
                                    "author": "clydesdale_unicorn",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you run out, my advice is to jump straight from the toilet to the shower and use it as an improvised bidet. I do this anyway just because it saves TP and it works great for me (caveats: I do wipe 2 or 3 times to get the worst of it off before leaving the toilet, and I deliberately have my showers directly after my shits so I'm not showering more than once daily).",
                    "score": 29,
                    "author": "FistingJesus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I will take your advice here based solely on your username haha",
                            "score": 11,
                            "author": "Rabbit-King",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't actually make a habit of anally interfering with the Son of God, or a specific hispanic man named Jesús, so don't factor that in when considering my advice on toilet usage. I was just an edgy teenaged atheist when I made this account seven years ago.",
                                    "score": 12,
                                    "author": "FistingJesus",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; If you run out, my advice is to jump straight from the toilet to the shower and use it as an improvised bidet\n\nhonestly, I prefer that over anything else\n\nnothing like knowing you're 100% clean",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 44,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you write them to tell them what a monumental piece of shit they are? It might not do any good, but someone needs to.",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn’t waste the keystrokes, it’s like yelling at the sky for being blue.   People like that don’t care what people like me think of them.  They literally don’t care.  They are what they are, just an example of what not to be like!",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I 100% agree. There’s a way to prepare without buying everything you can get your hands on. That’s just 1. Stupid and 2. Fiscally irresponsible. If I, an immunocompromised person don’t need to stockpile on like 50+ rolls of toilet paper then neither do you. You know how I prepared today as Madrid is going into mini quarantine for the next 15 days? I bought pasta, tortillas, some snacks, 1 pack of soap, 1 surface cleaner, and a couple boxes of risotto and stock cubes. I got just the basics so for the next 15 days so I can avoid going outside to protect myself and make sure I’m okay. You don’t need to hoard shit, lets face it people who are stockpiling probably won’t stay inside 24/7 like they should and will just do whatever. I know people who have hoarded goods but have gone out clubbing and into public places on the same day. Equal distribution, I don’t get why people think they need all this stuff that I see in videos and hear people say they’re bluk buying? You know what’ll protect you more than all that toilet paper? Washing your hands regularly, not touching your face and DONT FUCKING COUGH ON PEOPLE I SWEAR TO GOD EVEN AS A JOKE ITS GROSS AND YOURE AN ASS IF YOU DONT COVER YOUR MOUTH PERIOD. Also this goes for 24/7 without the COVID-19. Like was I just raised weird? Cause I was always taught it was RUDE to cough or sneeze into your hand or not covering it and so you had to do it into a tissue or your elbow and turn away from people because otherwise that’s rude???? Am I the only one taught this cause I had 4 people cough literally open mouth at me on the bus last week and if I die cause of idiots not knowing proper etiquette I’ll be pissed as hell. Thanks for coming to my ted talk and I 100% agree with you. And people who are inflating prices and taking advantage of this horrible situation are scumbags and it just makes me sad that this is how humanity reacts.",
            "score": 37,
            "author": "lunalyra",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 33,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I feel this, thank you for saying it out loud. \n\nI’m asthmatic and have severe respiratory issues. I am hospitalized for a week almost every year due to something. Last year a sinus infection (3 days in) and my O2 level was at 87% and I had to be rushed to the ER. I spent 6 days in a solitary room with everyone having to take additional precautions so I didn’t catch anything else. I have permanent damage from taking such high doses of steroids for so long. \n\nI have to wipe down my nebulizer gear after use. I usually just use isopropyl alcohol and then boil once a week for a good sanitize. \n\nI HAD TO BOIL THEM 3 TIMES A DAY FOR THE LAST 2 WEEKS. \n\nWhy? I didn’t think people would start screaming end of the world and stockpile. So when I used the last of mine and went to Walgreens to get more. Which was followed by trips to 6 separate stores, because everyone is sold out.\n\nI swear to god if I get it and die (literal possibility) I swear I will spend the rest of my eternal rest haunting every mother f*cker I can find who stockpiled in my town.",
            "score": 33,
            "author": "mrsmayne2018",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah this is super annoying my household is actually low on TP and I’m nine months pregnant so I pee like 50x per day and once I give birth I expect a large mass of people to descend on my house.  This pisses me off and I’m freaking out about running out.",
            "score": 54,
            "author": "BessertQween725",
            "replies": [
                {
                    "level": 1,
                    "comment": "My Costco had a huge display of flushable wipes right next to the giant empty space that usually houses TP. Just a thought. Good luck with delivery!",
                    "score": 17,
                    "author": "zolas_paw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just a heads up, don't flush flushable wipes. They actually clog up your pipes. Plumbers will tell you stories. Always toss them in the trash!",
                            "score": 37,
                            "author": "pantydandy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Friendly reminder that flushable wipes actually aren’t.",
                            "score": 6,
                            "author": "JCtheWanderingCrow",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone whose immuno-deficient and will most likely die if I catch it.. this is how I feel. I can’t find the stuff I need anywhere",
            "score": 56,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My friend's toddler was ill with a plain old cold the other day, and even after visiting 5 big supermarkets and 3 pharmacies she still couldn't find the toddler pain relief meds that she needed for him because people have started stockpiling paracetamol and ibuprofen too. \nEven sanitary products like pads and tampons are starting to disappear off the shelves by the dozen. It's ridiculous!",
            "score": 26,
            "author": "TheLostGremlin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Also a big fuck you to the people over buying shit and leaving people with disabilities and the elderly with nothing.",
            "score": 151,
            "author": "wonderhype",
            "replies": [
                {
                    "level": 1,
                    "comment": "THIS. people are assholes",
                    "score": 21,
                    "author": "vetosandtitos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;anyone who went to the store for an extra pack of toilet paper out of fear of getting quarantined without TP is literally the scum of the Earth\n\nGod I love Reddit some times.",
                            "score": 11,
                            "author": "MakeWay4Doodles",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agreed. It’s a bit excessive. I work at a preschool and restock the supplies every month. I can’t find refill hand sanitizer anywhere. And now its getting back to the shelves far to expensive for a small business like our school to afford.",
            "score": 81,
            "author": "ScoutingArtist",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used to work at a preschool and constantly got sick there.",
                    "score": 30,
                    "author": "Kpruett95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. It’s a perfect place for festering germs. But because all the supplies are sold out I’m hesitant to give a child some hand sanitizer every time they touch their nose/mouth. We’re almost out. We just don’t have enough for that anymore.",
                            "score": 16,
                            "author": "ScoutingArtist",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My daycare center uses Lysol spray and wipes to help clean and we run on a federal grant that regulates where we can shop. Guess which stores are on back order for cleaning supplies",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have fallen out with my cousin because she was reselling hand sanitisers and wipes at a huge margin. I was so disgusted with her.  \nIf this is all it takes for people to start acting like massive arseholes what the hell are we going to do when it gets significantly worse.",
            "score": 40,
            "author": "idiotinbcn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Where I live we have regular water cuts and hand sanitiser is a necessity for avoiding disease.\n\nOn the same day that the first case of coronavirus is announced in my country, every store in my town has sold out of hand sanitiser. We actually need it to maintain hygiene standards and people have gone and bought all of it and stockpiled it.\n\nThe area we live in has poor health care and resources. We frequently don't have power or water. The one thing we had was access to reasonably priced hand sanitiser and now we're fucked. There's none, not even to buy at a premium, and online stores take weeks to get here and are heavily taxed.\n\nI am honestly disgusted. Not only are these people selfish, but their actions are counterintuitive. If they had left enough for us all to share the supply, we would have group protection against most diseases. Now if any of us are infected then the whole town is compromised.",
            "score": 19,
            "author": "missminky8potate",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If a store is price gouging they need to be reported. It's not legal. Don't blame other people for the store decisions.",
            "score": 105,
            "author": "trishamyst",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's only illegal if your area is under a state of emergency. Otherwise, 100% legal, 0% moral",
                    "score": 34,
                    "author": "Ghawblin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah good to know and I probably should have thought about that. Still I'd at least publically shame them. That's a store decision. I should be able to buy whatever I want. But I'm also not one of the people going crazy. I was at Walmart and there's still plenty of hand sanitizer here although they were sold out of generic.",
                            "score": 15,
                            "author": "trishamyst",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 17,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dude all I want to do is use toilet paper like a normal human being, nah - we have to ration it cause people are greedy af",
            "score": 16,
            "author": "spook96"
        },
        {
            "level": 0,
            "comment": "Couldn’t agree more. I had a major surgery 4 days ago and I can’t even get the essentials of what I need to keep the area clean and disinfected because all the shelves have just been cleared out. My mom had to go to 4 different places before she was able to find some peroxide!",
            "score": 14,
            "author": "kristenhermes20"
        },
        {
            "level": 0,
            "comment": "I hope that everytime you wipe using your stockpiled toilet paper your finger pokes through the paper.",
            "score": 48,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's not fear of coronavirus causing the shortage. Maybe that's what started a few people hoarding, but its fear of a shortage that's causing the shortage. \n\n90% of people stockpiling now arent afraid of coronavirus, they are afraid they wont have another chance to buy TP for 6 months because of everyone else stockpiling. \n\nEvery facebook status about the subject, every news article, every reddit posts exacerbates (Im watching shawn of the dead, dont iamverysmart me) the problem.",
            "score": 13,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I agree with this so hard. My parents are both immunocompromised and we need hand sanitizer for them at home always and just as luck has it we were running out as coronavirus started and now we have none. My moms wbc counts are so low and she really really needs this and we can’t find it anywhere. Really hard for us",
            "score": 11,
            "author": "247doglover",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You know what will definitely make the virus spread? People not being able to wash their damn hands because 10 people bought all the soap in the area.",
            "score": 10,
            "author": "Buffer_Brain"
        },
        {
            "level": 0,
            "comment": "Well I hoard cereal but for  totally different reasons, and I totally agree with you.\n\nI just like having different brands/flavors on hand so I don't get bored of it or have sugar free/low alternatives when my teeth don't want to deal with it",
            "score": 10,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I went into Asda (UK) today and their shelves was bare, no toilet roll, hand gel, hand wash, or wipes yet the shelves was full of food ect. People seem to be saying they are getting ready for a 2 week lock in but still they ain't buying food I would have thought food would be more important than bog roll. Simple fact if you buy all the handwash how is everyone else meant to stop the spreading of this virus?",
            "score": 18,
            "author": "jjsgirl89"
        },
        {
            "level": 0,
            "comment": "So, two things:  I am going to be painting my kitchen in a couple weeks. I need to buy gloves and face masks because I’m stripping off stain first. I don’t want people to think I’m buying these items because of Coronavirus fears, so I’m actually thinking of wearing a sign. \n\nSecondly, I have to have a surgery in a month or so. It would be nice if the hospital actually HAS gloves and masks so they can do it.",
            "score": 35,
            "author": "SuperMommyCat",
            "replies": [
                {
                    "level": 1,
                    "comment": "i mean people buying masks from ace hardware should not effect how many masks the hospitals have. hospitals don’t get their supply from ace or walgreens",
                    "score": 17,
                    "author": "MonkeyInDiapers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have pretty bad spring allergy and I need face mask for pollen grains but stupid people just keep buying more and more and now they are costly..",
            "score": 26,
            "author": "im_phoebe",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm immuno compromised and I can't get my hands on anything I need to protect myself because of some ridiculous people",
            "score": 26,
            "author": "gaygender",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too. No hand sanitizer anywhere. And I'm a professor, so constantly around lots of people. I know people are saying \"it wont be that bad for healthy people\" but we are not all healthy. Some of us are really at risk.",
                    "score": 11,
                    "author": "thoughtsandthefeels",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's actually a bit more serious than that, a coworker of mine was telling me the local clinic will have to hold off surgeries until April because they couldnt get surgical gloves and masks due to them being out of stock. People who do this are scum bags and are actively hurting people who need these items.",
            "score": 8,
            "author": "Hungryjowels"
        },
        {
            "level": 0,
            "comment": "It’s not just the people doing it. But then logical non hysterical people like me see what they’re doing and we don’t want to run out of basics either.",
            "score": 19,
            "author": "Lacygreen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I always prefer this one: I wish they would get fucked with something hard and sandpapery.",
            "score": 6,
            "author": "Tildengolfer"
        },
        {
            "level": 0,
            "comment": "Before this all happened  the CDC made a post about having 6 months of supplies just in case.  Given the fast and severe spread which we wont know the ramifications of for quite some time I think you are missing the boat.  Anyway prices in my town are still normal mabey just a little traveling out of your area could help u out.",
            "score": 6,
            "author": "inter_dimentional",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dude....so my skin is super sensitive so I always buy softsoap antibacterial or the dial gold to wash my hands before I wash my face .. I'm now low on my soap and I can't find those two anywhere. \nMost of the hand soaps are all scented and I just paranoid about scented or moisturized stuff to wash my face. \n\nI'm so irritated -.-",
            "score": 12,
            "author": "knoka",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I work at a card/game shop, we need those wipes and hand sanitizer because we have people coming and going all day long. luckily my boss already had some on hand because we do use these things anyway. But you better believe we are wiping everything down with the wipes on a daily basis now and I'm using the hand sanitizer way more...like every time I touch cash instead of just before I eat or whatever. I will be upset if we run out and can't get anymore.",
            "score": 5,
            "author": "Girl_speaks_geek",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What annoys me the most is that people are stockpiling over househould necessities that they don't need rather than food incase all stores are closed for a few days.\n\nSurely being able to eat is more important than being a bit low on toilet paper on the very unlikely event that they're going to have diarrhea.",
            "score": 6,
            "author": "GN10GamingYT"
        },
        {
            "level": 0,
            "comment": "I want to string along people selling it on kijij. Make them meet me some where, never show. do it again. If they give me their address sign it up for every kind of junk mail.",
            "score": 5,
            "author": "karatesauce"
        },
        {
            "level": 0,
            "comment": "I went to buy some cleaner for the house and there are three bottles left on the shelf. I take one bottle and another lady takes the last two. Another lady comes into the aisle and is so disappointed that there is nothing left. The lady who took the two bottles gave one up.  - I felt all warm and fuzzy until the two bottle lady said \"its alright, I have like 20 bottles at home already.\"",
            "score": 7,
            "author": "UpsetAmsie"
        },
        {
            "level": 0,
            "comment": "My man spitting BARS 🔥🔥🔥",
            "score": 5,
            "author": "ChurchBond"
        },
        {
            "level": 0,
            "comment": "This is why I hate the news, because it always blows things waaaaay out of proportion, I feel like people wouldn't be panic-buying shit if they just said the Corona Virus is like the flu or some shit instead of saying \"PEOPLE ARE DYING EVERYWHERE, THE WORLD IS ENDING\" type of shit. The only people who have died are people who have weak immune systems.  \n\n\nAnd I'm not saying I'm safe as I have a very weak immune system, I was and always have been a very sickly person.",
            "score": 6,
            "author": "ArchiboldRavencroft",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fuck, I wanna clean my mother fucking bong and I can’t get no iso. Fml",
            "score": 11,
            "author": "bowlonatbl",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Come on, it’s not unreasonable for families and people to get a little extra of the stuff they normally use just in case. \n\nIf you’re reselling at ridiculous prices, then yeah fuck you.",
            "score": 56,
            "author": "the__day__man",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. Hoarders and price gougers need to calm tf down. But it’s not a bad idea to just buy a little extra when you go out just in case. \n\nLet’s not forget the CDC is encouraging people over 60 and those with compromised systems to stock up on supplies. This doesn’t mean clearing the shelves, but yeah make sure you have what you need.",
                    "score": 36,
                    "author": "histrionicsprofessor"
                },
                {
                    "level": 1,
                    "comment": "Unfortunately people aren't just buying a little extra, they're walking out with a trolley full of 6x24 packs of toilet paper as if it's the fucking apocalypse. \n\nAt least they are in my country.",
                    "score": 19,
                    "author": "pm_me_your_cobloaf",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "“A little extra” is fine. Buying the entire fucking shelf of supplies to hoard in your basement is not ok.",
                    "score": 34,
                    "author": "angrygnomes58",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "People arent getting \"a little\" though. They're literally buying enough toilet paper, anti bac, etc. to last an entire year. It's ridiculous.",
                    "score": 11,
                    "author": "SlapCracklePlop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fear is one hell of a drug!",
            "score": 10,
            "author": "ThrowAwayEggShells",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I agree those who are using stock piling for personal gain in a monetary way is cruel. \n\nBut I also would like to bring forward the importance of prepping awareness.",
            "score": 9,
            "author": "2mustange"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I went to Costco today and it was ridiculous. EVERYONE had tons of toilet paper and water. No medication, sanitation items, pet care items or canned food...just shit paper and bottled water.",
            "score": 4,
            "author": "HalfOrcMonk"
        },
        {
            "level": 0,
            "comment": "Late to the post, but this literally happened yesterday. I was at a 24 hour Walmart at 11 PM when they were restocking the shelves.\n\nThe hand sanitizer section was empty and an employee came to stock it. She placed 5 boxes (each box had 8 3-ounce sanitizer bottles) and a girl just picked up all 5 boxes and put them immediately into her cart.\n\nAsked her for 2 bottles (which I wanted just because I have to fly to California for work) and thankfully she did give. But I can't imagine why someone would need that many bottles. A) it is not a substitute for hand washing and B) if everyone is not able to protect themself, then you're not safe either.",
            "score": 5,
            "author": "drunkkard69",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt; I hope that every time you’re barefoot or wear just socks that you step on something cold and wet.\n\nI would have said hoped something hot and sharp but I get you a just a better person than I am.",
            "score": 5,
            "author": "MarinkoAzure"
        },
        {
            "level": 0,
            "comment": "Where do you live that they’re doing that? That sounds shitty.",
            "score": 4,
            "author": "Jotro2",
            "replies": []
        }
    ]
}