{
    "id": "hfwkjt",
    "score": 16068,
    "title": "As a black person, I'm just so moved by the fact that the world is actually starting to do something about racism. I never thought it could happen in my lifetime.",
    "author": "Existent-Being",
    "date": 1593127476.0,
    "url": "https://www.reddit.com/r/offmychest/comments/hfwkjt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Thank you to all the people paving the way for a better future.",
    "comments": [
        {
            "level": 0,
            "comment": "As a fellow young black person, I'm glad that some light has been shone on the topic. I'm glad that there's at least some progress made.\n\nWithin a month alone, all has lead up to officers who use too much force being fired and even charged. Statues are being torn down and streets renamed just because they have ties to slavery. Protests and marches worldwide. Social Media campaigns bringing light to the evil of anti-black racism.\n\nObviously we shouldn't get complacent as there's still a long way to go and much more work to be done.",
            "score": 861,
            "author": "djdisciplejosh",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a white woman and a Christian, the number of people from my childhood who mentored me growing up, who have now come out of the woodwork to tell me I'm sinning against God and not helping black people by sharing the history behind the confederacy, prisons, and police have been incredibly disappointing. I am currently getting a master's in history, so I felt like it was my duty as an academic and an ally to stand up and explain to my ignorant friends why this was happening and how history led to so much racism and oppression in the United States. \nI was changing people's minds, people who were offended by the thought of having Juneteenth as a holiday were getting excited and opening up to the idea that the police were racist. Then my mentor in my recovery program started explaining how everything I said was wrong and how they had many conversations with black friends to prove it. They started arguing that all this social justice was a sin, and all my knowledge about history was an opinion and not fact. They even sent me a video of pastors slandering and lying about BLM. I was feeling defeated, and because these people are my elders and mentors, I started second-guessing myself. This post and your reply has re-inspired me, my biggest worry is hurting the people I'm advocating for, but I now see that is all just lies told by ignorant people. I will continue do my best to keep raising awareness and advocating for civil rights and equality for all people who are living in a nation with oppression and racism. I am so sorry for all the evil white people have done and continue to do.",
                    "score": 138,
                    "author": "fatsexlover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Religious elders” (and old white people in general) will try to gaslight the fuck out of you. Just remember who benefits from their narrative. Who benefits from maintaining the status quo? Who benefits from white supremacy? \n\n(Hint: it’s not Black folks...)",
                            "score": 40,
                            "author": "LightninBoltsaGlowin"
                        },
                        {
                            "level": 2,
                            "comment": "I am a Christian as well, and have been struggling with the same thing. Not the history major part, but seeing my old mentors and those I looked up to spew ignorance and hate. It has made me doubt if I am a Christian or not since these people also say that they are and I cannot be grouped with them.",
                            "score": 14,
                            "author": "Investing4thefuture",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your belief in God is independent of how those who taught you behave and act. We can't debase God to the standards of man. You probably know deep down Jesus was a man of justice and always worked for the oppressed and needy. You're in an interesting situation to represent God better than your mentors, you can do it!",
                                    "score": 15,
                                    "author": "theanointedduck"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Think you can change the minds of some of those pastors? Just saying, thats like a buy 1 get 50 free deal on changing racist minds.",
                            "score": 5,
                            "author": "koli12801"
                        },
                        {
                            "level": 2,
                            "comment": "If you haven't heard of it, I would suggest looking at [The Poor People's Campaign](https://www.poorpeoplescampaign.org/) and it's founder, [Rev. Barber](https://en.wikipedia.org/wiki/William_Barber_II) if you want some Christian inspiration for social activism.",
                            "score": 4,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "All social justice is a sin?? Has he read the Bible??",
                            "score": 4,
                            "author": "awinedarksea"
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like time to find new mentors.",
                            "score": 3,
                            "author": "ID9ITAL"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is the beginning! If we all use these communities and work togehter we can all crush this shit as a new gen! Create a new world where we are all equal and the same in rights!",
                    "score": 105,
                    "author": "Mistasquires",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Make sure to vote. Get involved in local politics encourage others to do the same. The Republicans are against reform.",
                    "score": 48,
                    "author": "BAPlaya",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Definitely important to not get complacent over SYMBOLIC change that doesn’t really change too much in the grand scheme of things. But these changes that are happening are definitely awesome and a first step",
                    "score": 5,
                    "author": "xycion12"
                },
                {
                    "level": 1,
                    "comment": "All of this should have been done a long time ago. It's human decency and caring for one another. It's sad it had to come to this for there to be a change but I'm sure glad there's a change in progress! Much love!",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully we all can raise our kids in a way that the next generation won’t have to deal with racism anymore. \n\nIf I am ever going to have kids that’s definitely my goal.",
            "score": 207,
            "author": "scalaaaas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed I've been reluctant to have kids sometimes",
                    "score": 24,
                    "author": "WatchDragonball"
                },
                {
                    "level": 1,
                    "comment": "This generation of kids (including my own) impress me every day. Their bravery, empathy, willingness to speak the uncomfortable truth, be the only ones standing up for what’s right, regardless of the consequences, call the secrets/hidden into the light, demand a reckoning, is astounding.\n\nI’m not sure how I got so lucky or what I did to have them turn out so amazing; my kids make me so proud and yours will too.",
                    "score": 15,
                    "author": "TXrutabega"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1046,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I 100% agree with your statement. I feel like right now is a honeymoon phase and we will soon be forgotten yet again. It’s hard for me to have hope that things are actually going to change. And I wish I could be happier like op",
                    "score": 372,
                    "author": "straw-berry-candy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel the same way, it’s like I want to assume that things will get better but there’s still been killings and shady stuff happening that isn’t getting reported on and it’s very upsetting \n\nOf course we appreciate what people are doing for us but the real question is how long will it last? Are they doing these things just because or are they doing it because they actually care",
                            "score": 81,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\n&gt;the real question is how long will it last? Are they doing these things just because or are they doing it because they actually care\n\nI think people care. I just think it's really difficult to keep the public's collective attention for more than a few weeks. There's just so much wrong with the world and it's hard to get people to focus. \n\nI'm impressed that we've seen some momentum and even some actual change, but unfortunately I can't help but think in 5yrs from now we'll have to be out in the streets again, mad about yet another black kid being killed....\n\nI hope I'm just being a grumpy old bitch tho. I really *really* hope I'm wrong about this.\n\nAnd goddamnit we still gotta *try*, you know?",
                                    "score": 35,
                                    "author": "ArsenicAndRoses",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree, people do care.... and it’s hard to keep the public’s focus.\n\nOf course, some people are awful and benefit from the uneven power structures. Those that fit this bill need to be removed from positions of power and influence.\n\nPlease vote.\n\nNever give up. There are a lot of people who don’t do the right thing because they don’t know any better. Every day, we have an opportunity to help change someone’s perspective. To help them understand the many nuances of structural and subtle power imbalances. Beige bandaids, appropriation, what Dixie even means .... curious people will be open to learning.",
                                            "score": 16,
                                            "author": "m37an13",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Realistically, I’m sure there’s a bit of both. But, there are definitely people who are doing it because they actually care. Many people, although unfortunately late, are finally waking up to the fact that shits pretty uneven and starting to question the bullshit that’s being fed to them. Here’s to some long over due change my friend.",
                                    "score": 39,
                                    "author": "weeblybeebly"
                                },
                                {
                                    "level": 3,
                                    "comment": "The problem as I see it, and I could be wrong and lacking information or perspective here, but if the point is just posting black squares and getting outraged then of course it’s not going to last. \n\nIf there’s actual policies to push, actual changes proposed, that’s what will last. But I’m not seeing a lot of that. For some reason, everyone is scoffing at police reform, which as I see it is the first step.",
                                    "score": 7,
                                    "author": "bellabellebella"
                                },
                                {
                                    "level": 3,
                                    "comment": "There's no doubt been some pandering from corporate interests for better or worse. But as a white guy I've been having more open and frequent conversations about the matter past few weeks compared to years prior. I'd say those conversations are happening a lot more often as a result of the protests and that's a good sign and decent step forward. Being afraid to discuss issues is a large reason change is slow in the US for fixing racial tensions and also LGBT issues, woman's rights, immigration and etc.\n\nThere's still in my immigrants locked up in what is effectively concentration camps and when the conversation stopped about them fell out of interest to address the problems.",
                                    "score": 7,
                                    "author": "Marko343"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know I’m (30F White) only one person, but I promise not to forget that there is a lot more to be done. I for one really had to adjust the way I look at every day life and can only fathom what simple human interactions would be different if I was black. It hit me when I saw a my city’s Facebook page during the high of the riots (not protests, those should remain strong and on going. The height of the protests is yet to come!) a mother posted “don’t confuse my two kids with rioters, they live in this community and are just riding their bikes.” Well the reason this impacted me was it was sent by a black woman who honestly felt her mostly white community would hurt her kids. No mom should ever need to feel this, so I promise. I won’t forget.\n“Mother mother, there’s far too many of you crying.”",
                            "score": 14,
                            "author": "Pibbles-n-paint"
                        },
                        {
                            "level": 2,
                            "comment": "I want you to know that at least one person won’t forget you. Won’t quit standing with you. And won’t quit reminding my privileged/(un)intentionally racist white elders, colleagues, and neighbors that BLACK LIVES MATTER. \n\nI’m sorry. And I hope one day you can feel safe when going for a jog, sleeping in your own bed, or interacting with police.",
                            "score": 27,
                            "author": "booksandnetflix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hoping in here to say I guarantee that there are at least two of us. \n\nI always thought that all that was required was for me to not be racist and treat people who are different from me in a shitty way. And call out people who were toxic racists.  \n\nIt never occurred to me that I actually had to learn a bunch of stuff, confront my hidden biases, absorb the horrible enormity of Black American history and the history of white supremacy and go out of my way to educate other white people into waking up to these truths. \n\nIt was great to read OP’s post.",
                                    "score": 12,
                                    "author": "smnytx"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I believe it’s going to be a VERY long time before ANYBODY forgets what is taking place now in our world! Everybody is joining in on this fight! There are a lot more good people I believe in this world now then there are bad. The ones who are bad/negative just need to sit down and shut up because the majority are fed up!",
                            "score": 5,
                            "author": "ProcessDeb"
                        },
                        {
                            "level": 2,
                            "comment": "Facts",
                            "score": 7,
                            "author": "devilkitteh"
                        },
                        {
                            "level": 2,
                            "comment": "I understand you being hesitant on how this will play out in the future. One thing that gives me hope is that I feel as if we’ve never gotten this far, never made this many advancements... it’s proof that people want change. I really hope it leads to actual reform and change. But I’m also thankful for everything that has been happening lately. How many awful police killings and racist attacks have happened that have been forgotten about?! It finally feels different. Thank God.",
                            "score": 3,
                            "author": "finding_bliss"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; we will soon be forgotten yet again.\n\nYou're just as ingrained in American history as every other nationality. \n\nBlack excellence should be celebrated more. I don't wait around for February to learn about the pioneers in civil rights. There is so much I have yet to learn about the struggle for equality.",
                            "score": 1,
                            "author": "badpeaches"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We’re allowed to be happy about progress. I get that there’s still a long way to go, but this kind of really annoys me in progressive movements. Whenever there’s a win, people have to make sure nobody’s happy about it because there are still problems. \n\nPeople can be happy when progress is made.",
                    "score": 93,
                    "author": "ClownPrinceofLime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The comment below yours right now talks about how they relate because they don’t want to get their hopes up. Reminds me of therapy. Things have been shitty for so long, and there’ve been moments of growth and progress, and then they do go back to shit for awhile. And then they inch forward, and then they go back to shit. \n\nI’m now able to better appreciate the tiny steps forward and not be as frustrated at how fucking slow it is. \n\nIt will go back to the same, with a modicum of change. \n\nDef not comparable, my therapy and the constant oppression of black people, because it’s so fucking wrong, and unfair, and unjust, and frankly, racism is really, really stupid. Caring who someone is because of skin pigment? So dumb.",
                            "score": 18,
                            "author": "positivepeoplehater"
                        },
                        {
                            "level": 2,
                            "comment": "Definitely. You have to take each opportunity to bask in a little glory. Life sucks enough the rest of the time.",
                            "score": 5,
                            "author": "geekitude"
                        },
                        {
                            "level": 2,
                            "comment": "What progress has been made? A few cops have got what they deserved but what changes have been made to prevent police brutality in the future? Everyone will forget as they have every time this happens.",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know several people who are more bothered, and more knowledgable about racist oppression now than they were a year ago, a few months ago. Not terrible people, just...ignorant and apathetic, I'm sorry to say. Something has changed, they have changed. They're mad, and grieving, and fed up. This is how the change is fomented, by keeping the issue front and center, in everybody's face, so minds start to change. \n\nI credit cameras in every phone with this increasing outrage. It's getting more difficult to lie and dismiss what is being done to POC, the urgency is very clear to many who didn't quite get it before. It's terrible they didn't get it before, I realize. But surely it's an improvement that more people are engaged now... This has not been in vain.",
                                    "score": 8,
                                    "author": "snaregirl"
                                },
                                {
                                    "level": 3,
                                    "comment": "[House of Reps just passed a police reform bill](https://www.nbcnews.com/politics/congress/ahead-house-vote-pelosi-says-bill-george-floyd-s-name-n1232114?cid=sm_npd_nn_tw_ma). Small step, but it's happening.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same. Like ok thanks we get Juneteenth off and Aunt Jemima is no longer a thing.....can we actually get back to what we asked for since day 1? Let’s talk about what we’re going to do about the police.",
                    "score": 25,
                    "author": "FakeBeigeNails",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Look over there” type of move",
                            "score": 10,
                            "author": "supersteph13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yeah same here. I've heard this tune one to many times. give it a couple and everyone will go back to their subtley prejudiced selves",
                    "score": 16,
                    "author": "monteis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Until I stop seeing them small town folks stop with their little dirty looks and mutterings I won’t be wholly convinced, but a lot of them are boomer age so...",
                            "score": 14,
                            "author": "devilkitteh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They’re kind of hopeless tbh. I think our best bet rn is to educate the future generation and make sure they don’t absorb the bigotry of their parents.",
                                    "score": 16,
                                    "author": "yardiknowwtfgoinon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let me rephrase, and for that very generational reason, I am wholly hopeful for progress because I see a huge difference since the 70s/80s.  What I meant is I wish I still didn’t witness those micro aggressions, for the sake of black people everywhere(and brown). There is still a lot of it in small town America, at least that I have witnessed and experienced on many occasions.",
                                            "score": 4,
                                            "author": "devilkitteh"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Small town folk here. Raised to be afraid of black people. I was told they would rob and rape me. All it took to wipe away generations of fear and prejudice was a friendship. Even my parents and grandparents came around and quit saying racist crap. I now live in an even smaller town than I grew up in and the first time my daughter saw a POC (is that the PC term now or is black still ok?) she asked why they were dirty. She was scared of the man. I was not prepared for that moment and the man just kept quiet and kept his distance. I apologized and was highly embarrassed. Sounds silly but the kids show Yo Gabba Gabba helped. I didn’t realize when I became a parent I would actually have to teach my child not to fear someone due to skin color. \n\nShe’s 8 now. The protests have sparked much needed conversations with my daughter. I’m sure I’m not the only small town white mother having these conversations with my child. That is what is different this time. \n\nI know it doesn’t mean much to you, but this white woman hurts for all of you. I’m not affluent or anything. I grew up poor and in a trailer park. I made something of myself and have become a nurse. I have had patients be rude to black CNAs. The patient looses their CNA and have to wait a loooong time to get a cup of water from me when that crap happens.",
                                    "score": 2,
                                    "author": "JoRybnic"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I appreciate your realist view of it. I really hope it finally works out. I’ve been listening to a podcast that’s doing an in-depth report on the history of police in America and how they’ve been developed and used to suppress minorities... it’s pretty eye opening how severe the problem actually is when you look at the history behind it.",
                    "score": 14,
                    "author": "XFMR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What's the podcast? I'd love to give it a listen. Been trying to educate myself on the history that they don't teach in school",
                            "score": 1,
                            "author": "aquamar1n33",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The podcast is Behind the Bastards, their most recent episodes are a mini-series called Behind the Police. The guest host is Propaganda. My only gripe is I wish they presented themselves as unbiased so that I could show it to my family and not have them think it’s all lies simply because they make it clear they *do not* like the police and think the police are racists. I really just wish they presented it in a way that wouldn’t make it easy to just dismiss them as biased when they’re presenting the racist history of policing in America.",
                                    "score": 3,
                                    "author": "XFMR"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes but the general attitude I've noticed is a lot stronger. There is much more diversity in the movements as well.",
                    "score": 4,
                    "author": "k-810"
                },
                {
                    "level": 1,
                    "comment": "Personally, I feel the exact opposite from OP. I’m mad that it took so long for this widespread recognition to happen. I’m with you, I’m pretty skeptical, there’s a lot of performative shit going on now",
                    "score": 11,
                    "author": "TrillLogic_"
                },
                {
                    "level": 1,
                    "comment": "Yes, we have a long way to go but the biggest change is in how the future generation is acting in regards to racism. We don’t really pay attention to the things that are not directly shown in mainstream media and because racism is being publicized more now than ever before, more and more people are getting involved. Generation Y and Generation Z are taking to the streets to show their solidarity towards their black brothers and sisters and the passion and outrage they are showing right now, won’t just end with tweets, protests and public activism but also in how they raise their own children. THAT is where change is brought about - through experience, exposure, and education.",
                    "score": 3,
                    "author": "chotumotu21"
                },
                {
                    "level": 1,
                    "comment": "Small steps are still steps.",
                    "score": 2,
                    "author": "Gold_Conference"
                },
                {
                    "level": 1,
                    "comment": "100% It ain’t over yet. Not one bit. Fuck complacency!",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I’m not convinced either. I was young. Maybe 7 during the la riots. Rodney king made a real stamp. Those riots changed a lot. But they didn’t change enough. And Bcs of social media then reach of these protests and requests for change has reached the world. \n\nBut if history has shown us anything, it’s that it repeats itself. Detroit riots, stonewall, Chicago, we’ve had so many fights for change. And so much push back. It’s wonderful to think we’re a generation for change. But we’re not. We’re just like our parents, and our parents parents. \n\nSomethings will change. But not enough. And it’s disgusting, heartbreaking and absolutely pessimistic to think this way. But history hasn’t given us much hope.",
                    "score": 2,
                    "author": "FullyCaffinaited"
                },
                {
                    "level": 1,
                    "comment": "Anyone with a brain will be able to tell it's all controlled chaos, the people who really have power to actually change anything have not been impacted by the protest at all.",
                    "score": 1,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not as many as you'd think. I only get a pm or two each week about it. I get mostly positive feedback about it tbh.",
                            "score": 1,
                            "author": "HermioneIsBlack"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree. I'm not convinced meaningful change is currently happening. However, my eyes have been opened to the way police interact with civilians in a way that I'm sure you have been experiencing for generations. Hopefully if we can change police culture, that will translate to better interactions with minorities in the future.",
                    "score": 1,
                    "author": "MikeThePlatypus"
                },
                {
                    "level": 1,
                    "comment": "Definitely. After the protests wane off, you (you Americans)/we need to bring it to a new phase. There needs to be a followup.\n\nAnd it's very important it doesn't just stop with a few cops being charged (most if not all will avoid sentences though, but lose their jobs), a few status permanently removed or altered to highlight the racist parts of history, however important that is.\n\nI believe this will lead to more permanent changes in people's mindsets than former protests, but if no structural changes are made the problems remain.",
                    "score": 1,
                    "author": "gladoseatcake"
                },
                {
                    "level": 1,
                    "comment": "As a white dude having conversations with other white people about the systematic abuse I'd say it's working. I'm having a lot of friends come out in vocal support and other friends show their true colors on the matter (most of one's against were no surprise). Hardest part imo is starting the conversation. Can't fix anything if you don't talk about it openly. Trevor Noah said one of the things he wish he could bring to the USA from South Africa is how openly they talk about past racism and oppression, because if it's out in the open and discussed you can actually learn about/from it.\n\nHere in the US it's ignored, overlooked, then forgotten, so no progress is ever made. Seeing flags being ordered down in southern states is small in the grand scheme of things, but the amount of work it took for that to happen is no small feat.",
                    "score": 1,
                    "author": "Marko343"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not convinced it will last unfortunately. I’m a bit more hopeful than I’ve been in the past but I’m also old enough to know that memories are short and the status quo is long. Newtown really sunk this home for me. To this day I still don’t understand how the cold blooded murder of two dozen fucking kindergartners didn’t result in anything other than expressed outrage.",
            "score": 34,
            "author": "largepayload1"
        },
        {
            "level": 0,
            "comment": "That you “never thought it could happen” is so telling. I’m sorry. I hope things continue to get better.",
            "score": 67,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I personally thought that if Tamir Rice hadn’t motivated people to care, nothing ever would. At least it’s a relief to see people care a bit.",
                    "score": 21,
                    "author": "I_Dont_Own_A_Cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t get too excited.  Ain’t nobody asked for Aunt Jemima to be removed, we want to see real, tangible policy change.",
            "score": 35,
            "author": "lusciousleftfoot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its starting to happen though. Not nearly enough yet,  but it is. Some places are disbanding entire police departments. Chokeholds are being outlawed. Qualified immunity and no-knock warrants are being challenged. That stupid BS bill the Trump administration tried to put out failed, a good thing because it wasn't enough. \n\nI'm white, I know I dont know what it's like to be a victim of racism. But I'm also 47 and I can tell you this is the biggest push and the most awareness I've seen in my lifetime. I've learned a lot, and I'm going to keep learning, and I'm not the only one.",
                    "score": 12,
                    "author": "LaMadreDelCantante",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There have been some good small changes! A lot of states are looking at their policies and revising them. Check out current police reforms. It's not a lot by any means but it's a start. We just can't get complacent.",
                    "score": 1,
                    "author": "notalwayslost12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a gun-totin’ white dude in Montana, I hope these changes stick and lead to true reform. The greatest shame in our country’s history is the failure to come to grips with our historic and current racism, particularly with respect to African Americans and their contributions to this nation at every turn.",
            "score": 30,
            "author": "boom_boom66",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a gun-totin’ white dude, please man talk to the other gun-totin white dudes who don’t see it the way you do. Racism isn’t even a black problem it’s a white problem. Racists will never listen to black peoples ideas and solutions on how to fix it. It needs to come from people that they can relate to and see as human beings",
                    "score": 6,
                    "author": "MoneyTurtles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have those conversations frequently, with admittedly mixed success. Folks who've never traveled or had much in the way of meaningful interactions with people who come from different backgrounds and ethnicities can be hard to reach. I find it much easier to connect the dots with people who're more worldly, even if they think of themselves as traditional social/political conservatives. Once you can humanize the issue, it becomes more difficult to maintain a wall of ignorance and racism--but if it were so easy to fix we wouldn't be in this fucking mess today. But I remain hopeful.",
                            "score": 3,
                            "author": "boom_boom66",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for that. Truly",
                                    "score": 3,
                                    "author": "MoneyTurtles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks for the kind words and encouragement, stranger. We all need to do our part and then some. I look at it as trying to change one mind and heart at a time.",
                                            "score": 3,
                                            "author": "boom_boom66"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm glad that the conversation is opening up. I am not a POC however I have siblings that are. I've done my best to fight the good fight and to teach my kids to stand up against racism as well. I ran into a friend of mine recently, we had some small protests in our small town and he had commented about how many cops were out. I told him there was a protest a few blocks up. He said, \"I don't know why they bother, things have always been the same for us, they'll always be the same. You just gotta keep your head down and keep moving.\" I had nothing to say, it just hurt my heart. I really hope he's wrong and some much needed change comes from this. It shouldn't even need be a discussion at this point in time but here we are. Anyways, for what it's worth I stand with you.",
            "score": 27,
            "author": "Miraverick"
        },
        {
            "level": 0,
            "comment": "I might be white, you might not be. \n\nYour human tho. So am I. You are my brother. My sister. My aunt. My uncle. My family. \n\nI don't give a fuck what anyone says, where you are born, the colour of your skin or your religious belief, it should never, ever have you treated like you are not human just like the rest of us.",
            "score": 54,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Underrated comment....\n\nI might be white, but you are right. \nYou're my human, as I am yours, family...\nJoined by blood, not skin.",
                    "score": 2,
                    "author": "hungryhippie30",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My Muslim neighbours when first meeting me and checking I was okay with them just hurt. \n\nI simply said: your human yes? You respect me as a human yes? You respect I'm doing literally the best I can yes? They agreed. \n\nThat's all I need. I have covered my hair and self for them with a burka to be able to participate in things, they have all respected my 8yr old daughter and my stance of until like me she understands this piece of religious garb, she will not wear it. \n\nI really appreciate the Muslim culture that ad Quazi adopted us. They never want us to convert. They simply ask for respect and show it.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They still shoot at Emmet Tills grave!! and that little boy was completely innocent (the old white lady admit she lied that he whistled at her). Racism is never going to just “disappear”. We’re less than human to these people, hell they treated their dogs better than us during slavery.",
            "score": 16,
            "author": "suckmydonut"
        },
        {
            "level": 0,
            "comment": "I’m Native American and I feel this. All eyes have been on the black community where I’m from and a lot of my people stand in support and in solidarity. \n\nPOC aren’t as divided as some like to make us when battling racism and bringing awareness to how fucked up many aspects of society are.\n\nJust my opinion: Governmental bodies paying residential school settlements but avoiding slavery reparations is something I want to see change in my lifetime.",
            "score": 41,
            "author": "belligerentgf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you.  Seriously, thank you so much.  It means a lot especially coming from someone who belongs to this land.  And really, I hope this all isn't just a moment, but a true seismic shift that begins and continues to include addressing the horrible disparities and injustices that have gone on and still go on toward the Indigenous people of this land.  I hope more of us Black folk become even more aware and amplify your voices, too, because I see y'all here for us, and it's all connected.",
                    "score": 2,
                    "author": "catofnortherndarknes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For sure, we share injustices and we’d be stronger working together against them more than anything.\n\nDivision amongst races of colour is a part of the reason why social constructs such as white supremacy and privilege can continue to exist. And the thought that races should be divided to compete against each other is detrimental to progress. A victory for one race of colour should be viewed as a victory for all because it’s still forward movement to breaking those constructs that should NOT be there. \n\nJust to note: the civil rights act was signed in 1964, the last residential school shut down in 1996 - MLKs photos are printed in black and white in text books to mislead readers, while text books read that residential schools occurred in the “early 1900s.” Also, the Japanese Americans forced to internment camps in the 1940s are not mentioned much in text books, but the “victory” after Pearl Harbour is. The educational system is misinforming and erasing histories because of how ugly they are. And that is why we should always help each other - we share similarities in those histories. Empathy and sympathy for one another should go hand in hand, as should support.",
                            "score": 2,
                            "author": "belligerentgf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed to all.",
                                    "score": 2,
                                    "author": "catofnortherndarknes"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Slavery is still huge in other countries. We need to get rid of it world wide for this statement to be true.",
            "score": 4,
            "author": "lonelybean64"
        },
        {
            "level": 0,
            "comment": "White boomer guy here. This was the 60's in the south.\n\nI was thinking of a conversation with my dad when I was a boy. Wondering about racism and blacks not being treated like whites. The gist of his response was, \"that's just the way it is\".\n\nLearned recently that some black fathers at the time were telling their children the same thing. Hit me hard. \n\nIt's time to make a change. And us older guys are not exempt. It's not too late for us to get in the game and do the right thing. \n\nStay tuned.",
            "score": 15,
            "author": "onthelevel54e",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't want to be pessimistic but racism will never be eradicate. Racism stems from culture and good luck trying to change cultures/beliefs for the so called good of mankind.\nA utopia where we always get along with no hate is a Disney movie.\nHumanity needs to aim for something realistic. \nIf by some miracle we can restructure society to educate newer generations to accept others regardless of who they are or what someone believes, that's a win and the most likely only win we will ever achieve.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It won't last for much time as long as the only thing being done is tearing down statues, renaming streets and screaming \"RACISM\" at basically everything that shows an stereotype of a black person, even if it's from 100 years ago. Education is the best (and only) form to actually put an end to racism.",
            "score": 4,
            "author": "Muxxer"
        },
        {
            "level": 0,
            "comment": "It's such a huge issue my man. I don't mean to put the spotlight on me here but as a southeast asian, we receive a huge amount of racism as well most especially from east asian countries. The most problematic thing is because of the culture, people do it in the most hushed or passive-aggressive way that it doesn't get as much attention or people would label it as us being sensitive, but it doesn't remove the fact that it is just as damaging. Just keep on keeping on.",
            "score": 14,
            "author": "why_me_why_you"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 32,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please talk to the other conservatives who don’t see it the way you do. Racist people won’t ever listen to black folk. The only way they’re gonna change is when people who look like them start calling out that behavior and those beliefs and helping them understand why it’s wrong",
                    "score": 3,
                    "author": "MoneyTurtles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro or broette as a you g white guy we are tired of it too.  I think we are all waking up to see how racism has been hiding under a thin veil.  Claiming to not be racist doesn’t work we all need to denounce it and call ugly racists out.",
            "score": 8,
            "author": "surflaxrat"
        },
        {
            "level": 0,
            "comment": "I honestly  don't see how Aunt Jemima and Uncle Ben and Eskimo Pie getting new names is helping anything :/",
            "score": 9,
            "author": "spokitty-meow"
        },
        {
            "level": 0,
            "comment": "As another fellow black person I'm afraid that this is a transparent, vapid trend that only exists because white people were bored and stuck at home because of an international pandemi. We've been screaming into the void for decades but all of a sudden BLM is trending on social media and shit gets done. Its called trending for a reason, what happens when the trend is over? Are you telling me this interest is genuine? How much will you care when it's no longer convenient? How much will you care when things are back to normal? For black people we don't even n have a fucking choice l, we care every second of every day because we don't get to choose when we care",
            "score": 9,
            "author": "ProbablyKindaRight"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I post everyday very raw things and donated $200 to the ACLU matched by my company. I’ve had 5 black former friends (as in people I just haven’t kept in touch with since HS or college) message me about how much my consistency is heard and appreciated. Real change is needed but I’ve learned it matters a lot when your pain is heard and acknowledged by someone it doesn’t affect.",
            "score": 6,
            "author": "madguins"
        },
        {
            "level": 0,
            "comment": "I'm sorry it's taking so long that it's still going on in your lifetime. Here's to the hopeful continued growth of the human race. \nWe're with you!",
            "score": 3,
            "author": "slutforachickenwing"
        },
        {
            "level": 0,
            "comment": "Sorry it took so long. We were all mislead that \"education and hard work\" is the only way up in the world. Most white people were just busy struggling with their own issues with capitalism to spend time worrying about others. Not a good excuse, but I think just the reality of what happened. It was for me, but I left academia after struggling with seeing these issues play out and my own depression for many years. \n\nI'm really hoping that across the world we can tear down the inequality and get rid of the old timer racist regimes.  We need more young blood involved, and I'm so proud of Gen Z for taking action. Keep up the noise, I (and many others) will keep fighting to let you be heard. BLACK LIVES MATTER! 💜",
            "score": 16,
            "author": "rstanek09"
        },
        {
            "level": 0,
            "comment": "And the people who give a fuck will continue to fight racism until we're dead. There will always be racism in this world and there will always be people willing to stand up against it.",
            "score": 6,
            "author": "MrClintonKildepstein"
        },
        {
            "level": 0,
            "comment": "We have started to do something against racism if you look how far the worlds come from 50 years ago.",
            "score": 2,
            "author": "ilovesusie"
        },
        {
            "level": 0,
            "comment": "Remember when Russia occupied a State in the Ukraine?\n\nRemember the Friday for Future-Movement? \n\nRemember Free Hong Kong? \n\nDont get me wrong. Im glad to see some change. That the society in the USA want to fight against racism and want a change how there police operate but people will forget soon about it ... like always.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "We’re doing something but whatever we do it’s clearly not enough.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm more concerned since I'm a mixed (but black by everyone's standards) guy in middle georgia in a prominently white area with a lifestyle that alot of people frown upon and the amount of racial nationalists brewing on a \"civil war\" that I'm in a compromising position.",
            "score": 2,
            "author": "cmb271"
        },
        {
            "level": 0,
            "comment": "Wouldn’t all of this be solved if we just treated people how we would want to be treated? It seems simple when you look at it that way.",
            "score": 2,
            "author": "Gringodrummer"
        },
        {
            "level": 0,
            "comment": "As a european, I literally have no clue what changed but hf",
            "score": 2,
            "author": "Marc_A_Teleki"
        },
        {
            "level": 0,
            "comment": "Black guy here. I am cautiously optimistic at best. America and the world may just simply be bored due to Covid and want something to rally around temporarily. Afterwards something else catches their attention. Time will tell. But for now, Seems the world  has cleaned out their ears a bit.",
            "score": 2,
            "author": "Delrious_whispers"
        },
        {
            "level": 0,
            "comment": "well I can tell you what did it for me, and many other people I know.  All my life as a white man, I always heard about police brutality against black people and deep down I always thought \"Well they must have done something really fucking stupid to get the cops to beat their asses like that.\"  Yeah, I can see now that I was so very very wrong about that.  Nothing has woken me up more than the flood of videos in the last few months where the true behavior of the police has come out.  It's fucking horrifying.  There is just no other way to describe it.  These racist cops aren't even trying to hide it anymore.  The US police force is a perfect mix of macho racist assholes, who operate under a gang mentality, and the rest who are not actually racist, are too chickenshit to step up and put a stop to their bullshit.  In my book, that makes them all bad (ACAB!).  We need to dismantle the present concept of policing, and start completely over.   At this point the whole system is so badly infected, that you can't save it.",
            "score": 2,
            "author": "madmax7774"
        },
        {
            "level": 0,
            "comment": "You mean being racist to white ppl is what you have been waiting for? What about South Africa where black ppl are murdering white ppl and taking their properties? Nobody is giving a f***k. And ill Tell you why. Becauss nobody cares about you or someone else. Its all just 3rd world war made by huge companies. They want to split society.",
            "score": 2,
            "author": "SnooSuggestions2147"
        },
        {
            "level": 0,
            "comment": "I agree and am so thankful to see it! My hippie mom would be so thrilled to see these days, bless her soul. \n\nI have to say, and it’s pathetic, but a bunch of us White people are so locked up in our own shit, because we have the ability to be this way because Johnny Law doesn’t immediately see us as suspect, and because it’s convenient to use this as an excuse, that we never ‘noticed’ how Black folk are treated. \n\nOh yeah, we see the news stories, we are outraged, but we are not living on the knife edge of survival that our Black brothers and sisters navigate, every day. As we have learned and realized since the passing of our friend, Mr. George Floyd, the reality of daily life for Black Americans is that they can be forced into our criminal justice system at the drop of a hat, any time, any day, 24/7/365. \n\nWe as White suburbanites are raising kids, paying bills, dealing with traffic, living busy lives, struggling to survive like anybody else. When we see movies about black drug gangs in NYC and LA, the stereotype those movies paint in our minds is hard to erase. Movies and media have a huge impact on us. Black youth and the Glock held at a 90 degree angle are all we older White folk to fear L. A., Black people, and shopping after 10am. I don’t know why Black actors allow themselves to be portrayed in these roles anymore, except the roles are visible and available, and actors need work. But movies like these are killing Black social growth, IMHO, and giving Whites the wrong impression of Black/Brown culture. \n\nI had to re-read and edit this comment to ensure that I wasn’t being ‘apologetic’ for Whites. I am clearly not apologetic, and I loath our laziness and blindness to Black injustice and suffering due to the shared ‘inconvenience’ that participating in such pain would ‘put me through.’ I hate this ‘hatred’ that racism causes. Why hate someone based on looks or differences? I have never understood that. \n\nPeace. Love. Kindness. Respect. Empathy. Love again.",
            "score": 4,
            "author": "Black-Coffee-Social"
        },
        {
            "level": 0,
            "comment": "When my son was born 6 years ago, I actually thought to myself: man what a time to be alive! This kid and his peers are going to live in an amazing world! This kid will never know what racism is. Won’t grow up hearing the old folk and their nasty backwards remarks. The technological advances. The medical advances. Ugh. Gotta say I’m real disappointed this year. For so many reasons. But especially the racism aspect. I truly hope we all take a huge step forward from this.",
            "score": 3,
            "author": "Successful_Club"
        },
        {
            "level": 0,
            "comment": "Yeah, to me it feels like it’s just a trend and nothing will ever fully change. Maybe there will be some small change (which is better than none), but no complete overhaul.\n\nKnowing historically, even in the most homogeneous of societies that people still found ways to create conflict and hate one another, how much can I really expect this conflict/hate to change in a society that varies so much?",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I agree. I’m glad that the world realizes how stupid racism is. Imagine we just said blue eyes are better than brown eyes? I’m so glad the world is becoming more educated and much different than it was in the last 30 years. And not just to black people, but to the LGBTQ community, Muslims, Hispanic... etc. May God protect us all. Be nice to everyone ❤️",
            "score": 3,
            "author": "amirak22"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "cringe man stop",
            "score": 6,
            "author": "Negomires"
        },
        {
            "level": 0,
            "comment": "Then 60-70s would have blown your doors off.",
            "score": 6,
            "author": "st15jap"
        },
        {
            "level": 0,
            "comment": "What do you feel is being done? I don’t personally see any quantifiable actions other than protesting.",
            "score": 3,
            "author": "nunswithpuns"
        },
        {
            "level": 0,
            "comment": "I’m sorry we took so long",
            "score": 3,
            "author": "unclefiestalives"
        },
        {
            "level": 0,
            "comment": "Police still act like total asshats, I don’t have faith",
            "score": 5,
            "author": "dtyus"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You shouldnt feel guilty for being treated like a person. Seriously. Some people don't treat other people well due to racism, thats not your fault. \n\nBut i also wanted to ask you. \n\nIf you were made president for a day and you could just enact any changes you wanted and they would be executed right away. How would you fix this????\n\nPolice reform is usually peoples first pick.  What else? What would make things whole for the black community and everyone else?",
                    "score": 2,
                    "author": "fulldiapey25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s just something white people are posting on IG and tiktok so they look woke. If they had to move to a black neighborhood or go to a black school watch how fast they would change. I don’t know why anyone falls for the fake support of the white liberal.",
            "score": 3,
            "author": "Gladiatorsdad"
        },
        {
            "level": 0,
            "comment": "Oh man, I hope it takes off. I really do. I hope this is the thing that finally, finally makes a dent in the way things are.",
            "score": 3,
            "author": "MyHairIs___"
        },
        {
            "level": 0,
            "comment": "I believe that over time cultural diseases like racism can be fought with the right approach. The younger generations are largely against it and that trend will likely continue with future generations as long as things keep going the way they are now. If you want to make the world better then just teach your kids how to act right, don't just expect the public school system to give them everything they need to function in society.",
            "score": 2,
            "author": "average_meme_thief"
        },
        {
            "level": 0,
            "comment": "I am so sorry it’s even a thing and that it took a pandemic and several people dead to get it moving. It’s going to be a slow uphill battle. We can never completely wipe it out but we can at least try to make it more fair and hopefully safer for you. Hugs and all the love, as a white person I will try my best to help keep it moving in the right direction.",
            "score": 2,
            "author": "britclinton1011"
        },
        {
            "level": 0,
            "comment": "Im waiting for the day when being racist and prejudice towards black/dark skinned people is no longer comedic joke for laughs/profit.",
            "score": 2,
            "author": "somnicrain",
            "replies": [
                {
                    "level": 1,
                    "comment": "The same people who make racist jokes towards black people are usually the ones who get really sensitive when you make white people jokes or jokes about men and then in turn end up spouting really racist/sexist rhetorics.",
                    "score": 2,
                    "author": "geemeer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Slowly but surely we just mustn’t let up the fight and let them coerce us into complacency with a few murals and street names and the taking down of some statues, hell, even arresting some officers. NOT ENOUGH. It’s a start but we cannot let this end until real change happens.",
            "score": 2,
            "author": "themagichappensnow"
        },
        {
            "level": 0,
            "comment": "As a white/mixed person, I hope other white people actually keep on fighting this as allies too.     \n Instead of just trying to do this because its a trend or trying to perform in order not to look bad. Protesting and supporting Black Lives Matter is just a start. We also have to fight against racism towards other POC. \n\n My fellow white people need to keep checking our privilege and keep having uncomfortable conversations within our families, friends, and coworkers. Keep educating ourselves on these topics by researching online, reading books, and/or watching movies/documentaries. We need to hold our elected officials accountable and vote out ones that uphold the systems that discriminate against Black people and other POC. Support Black-owned businesses and other POC-owned businesses. Support charities that help these communities as well.",
            "score": 2,
            "author": "YinzNation"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No, only the US is starting to do something about racism. Not the world.",
            "score": 2,
            "author": "nsa_official2"
        },
        {
            "level": 0,
            "comment": "People have been doing stuff about racism for two centuries, this isn’t a new thing..",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Before this movement I didn’t realise how common racist mindsets were, especially from people of power. It’s genuinely terrifying.",
            "score": 2,
            "author": "geemeer"
        },
        {
            "level": 0,
            "comment": "I'll keep learning and trying to be better. I'm sorry you had to endure all this.",
            "score": 2,
            "author": "Keesatt"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "When exactly did systemic racism end?",
                    "score": 2,
                    "author": "BigassBoxOMagicCards",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "D-\n\nTry harder troll.",
                    "score": 1,
                    "author": "000100111010"
                }
            ]
        },
        {
            "level": 0,
            "comment": "BLACK LIVES MATTER",
            "score": 1,
            "author": "candiray",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hope the horizon will bring you beauty and warmth.",
            "score": 1,
            "author": "ZeroDrawn"
        },
        {
            "level": 0,
            "comment": "Hope and action is what makes things come true. Stay optimistic, we all bleed red.",
            "score": 3,
            "author": "M3hdic_333"
        },
        {
            "level": 0,
            "comment": "There’s more closet racists in this country than you could imagine. Try almost any person older than 40. Ive known people with black friends who drop the n word all the time. This issue is so deep rooted that we haven’t even begun to unravel the problem. What causes racism? What makes people hate in the first place? How can some people have black friends and acquaintances, then callously refer to any other black person by that word? A lot of congressmen/congresswomen and representatives are old enough to have gone to segregated schools, and grew up in that doctrine. But what’s the next step? Like how does racism and the mindset of it go away? It feels like we’re trapped in a circle, we had a black president for crying out loud. Now we’re back to this antiquated ass shit, fucking dumb man. I’m sorry this is still even an issue.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "As a black person, keep dreaming lol",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I just hope it goes all the way. Black people, and other minorities, have been through enough. How is it a battle for equal treatment and respect? I just genuinely don't understand the hate and ignorance that has festered for so many generations. Let's start every relationship and interaction with respect and open mindedness, that should make a difference. I wish.",
            "score": 2,
            "author": "blahlz4374"
        },
        {
            "level": 0,
            "comment": "I mean people have been doing this since the civil war ended you act like it's some new thing.",
            "score": 2,
            "author": "Herpderp654321535"
        },
        {
            "level": 0,
            "comment": "As a white person, I feel like I have spent a lifetime of being slowly poisoned by false information and bias towards blacks (and by the way, other races....)  It's a daily battle to resist and sometimes it's so subtle, you don't realize the influence it has on you.  I am sorry that this is a thing.  I wasn't raised to be biased, my parents certainly never gave me cause to feel one way or another.  I am incredibly happy that so much seems to be changing to move to racial equality.  I believe that judging a person is inevitable.  But for me, I try to judge by merit and the actions of the person, the character and integrity they display.  That is how I want to be judged. How else can we be a functioning healthy society if not by those measures?  And, as an edit, I can only apologize if I have ever offended another person, regardless of color.  I try to be a positive person who affirms others, not tears them down.",
            "score": 2,
            "author": "2020HammersandNails",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not nearly enough.  But hopefully we'll start seeing some meaningful changes.",
            "score": 2,
            "author": "AbbeFaria001"
        },
        {
            "level": 0,
            "comment": "As a person in a minority, I hope the world learns from this and does more movements for other minorities too. It’s amazing to see what all these people are doing for your community.",
            "score": 1,
            "author": "Aleximo27"
        },
        {
            "level": 0,
            "comment": "Waiting for the day when I won’t be followed in a store 🥵",
            "score": 1,
            "author": "MisuCake",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Agreed!  It felt like for so long people thought we were just wearing our heart on our sleeves and being sensitive. Now the entire world is realizing that systemic racism is real and has affected us since race was invented.",
            "score": 2,
            "author": "Heavydikk"
        },
        {
            "level": 0,
            "comment": "Sorry it took so long. Lots more to be done.",
            "score": 1,
            "author": "peacefinder"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The world didn't just start. I didn't just start. It won't just end though.",
            "score": 1,
            "author": "Ufcfannypack"
        },
        {
            "level": 0,
            "comment": "Hm...changing mindsets is a long journey. It either takes decades or we have to wait for new generations. Replaced statues and street names is a very small step but at least something. But the real problem is the way people think and thats sadly not going to change by tomorrow or in a year. Even it is easy to change :/",
            "score": 1,
            "author": "redheadroe"
        },
        {
            "level": 0,
            "comment": "Human races do not exist, so there can be any racism as the absence of races draws the term racism obsolete.\n\nIm glad you feek good tho but dunno why since most of the \"racism\" happens in africa and asia...",
            "score": 1,
            "author": "GunsAreHumanRights"
        },
        {
            "level": 0,
            "comment": "What is the world doing about racism?",
            "score": 1,
            "author": "TheIceScraper"
        },
        {
            "level": 0,
            "comment": "Dude that’s so cool! I wonder if the same thing for ableism will happen in my lifetime",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm working on my friend who's a little right wing and helping a black family get better cars and a computer.\n\nand battling racists on Reddit of course.\n\nit ain't much so what else I can do let me know.",
            "score": 1,
            "author": "darkstarman"
        },
        {
            "level": 0,
            "comment": "Dont get complacent. They just recently murder an amazing young man named Elijah McClain. The audio will make you sick. They're still killing black people. We can't give up the fight yet until they are defunded.",
            "score": 1,
            "author": "Reese_misee"
        }
    ]
}