{
    "id": "ih54cp",
    "score": 11897,
    "title": "My 8 year old turned off my alarm so I could sleep in.",
    "author": "GarbageDayyyyy",
    "date": 1598468730.0,
    "url": "https://www.reddit.com/r/offmychest/comments/ih54cp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I woke up around 9:30 this morning and she was snuggled up against me with her school Chromebook (camera off), doing her live lesson and even scribbling down notes.\n\nShowered, teeth brushed, and a warm bowl of oatmeal on the table next to my bed. She also knocked out over half of her assignments while I was peacefully snoring away.\n\nHonestly, I'm fucking speechless. I've always had issues sleeping properly (due to anxiety, if I had to guess). Instead of taking my being tired/irritable personally, she grabbed it and ran in the opposite direction.\n\nThe most thoughtful thing anyone has ever done for me came from an 8 year old.\n\nEdit: I don't know what these awards do specifically, but they did make feel even more fuzzy which is what counts ❤ Thanks guys. Please give me more cute stories. Even if I'm slow to respond, I really enjoy reading them.",
    "comments": [
        {
            "level": 0,
            "comment": "She's such a doll. You're so lucky to have a kid like her man",
            "score": 2104,
            "author": "Reahal38",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's exactly how I feel right now. Parental pride is a hell of a thing.",
                    "score": 929,
                    "author": "GarbageDayyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You deserve to feel that pride. She's a keeper alright.",
                            "score": 355,
                            "author": "Reahal38",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've been showing my appreciation through making an ass of myself and (per request), giving on demand pony rides. My back hurts, but with homework out of the way so early, I've no excuse. Haha",
                                    "score": 493,
                                    "author": "GarbageDayyyyy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Best reward a child would get for being raised right by a lovely person like you.\n\nWeird how you give me a bit of hope that I'll be a good parent when I settle. I'm 18 and life's just weird 😂",
                                            "score": 204,
                                            "author": "Reahal38",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you saw me at 18 you'd probably have a different opinion ☺ 12 years later and I'm still a pretty shoddy adult. But pertaining to kids, just giving them a little love and trust goes a long way. I'm sure you'll be great",
                                                    "score": 185,
                                                    "author": "GarbageDayyyyy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Man, you're fine, as evidenced by your awesome kid. She saw that behavior modeled by you, I'm sure.\n\nOh, big secret. All of us adults are just winging it and flying by the seat of our pants. My life is pretty good right now, and every day I wake up thinking, \"This is it. This is the day the adult police arrest my juvenile ass for faking it.\" I mean, I even get to work ON TIME now, but I still feel like I'm 12.",
                                                            "score": 94,
                                                            "author": "Tigaget",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "ON TIME? Alright man, now you're just showing off to the other adults. Joking of course, but yeah. I feel that way pretty often. I may not be the most successful in life, but this is what feels meaningful to me at the moment.",
                                                                    "score": 71,
                                                                    "author": "GarbageDayyyyy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "LPT, get a job where start time is 9:00 am and leave time is 6. You'll never be late again. \n\nI'm so lucky to get this job, honestly. I can work from home when I need to. I do work late two or three days a week, and sometimes I catch up on projects a few hours on the weekend, but honestly, I'd rather work than just waste time effing around. Helps that I love accounting. I truly have fun with spreadsheets.",
                                                                            "score": 12,
                                                                            "author": "Tigaget",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Seems like around here everyone wants 7:30 start times that really mean be here for 7:20 or you’re late. \n\nI’m legit sick of waking up at 6:00 in the morning and just barely making it to work on time. \n\nMoving closer can only do so much, I’ve been looking at moving closer to work and cutting 2/3s of my distance only results in ~30-50% time reduction. \n\nShit sucks, man.",
                                                                                    "score": 4,
                                                                                    "author": "PM_ME_A_Pic_"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Traffic in my current city is so bad that if I had a 9am start time I would probably always be late! I love starting at 7 because the roads are usually clear. 😭😭 It's terrible and I'm dreaming of the day I can finally bike to work.\n\nGlad you found such a great schedule, though!!",
                                                                                    "score": 1,
                                                                                    "author": "dropsinariver"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The best thing you can ever do is raise a happy healthy wonderful child who will become an excellent member of society",
                                                                            "score": 1,
                                                                            "author": "LateKate97"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Right?! I keep wondering when I’ll become a REAL adult but 35 and counting and it hasn’t happened yet.",
                                                                    "score": 7,
                                                                    "author": "Ruth-Stewart"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lol holy shit I totally have that unfounded fear as well 😅\n\nLike, \"okay when is the other shoe gonna drop, huh?! Things aren't allowed to be sorta going okay like this, right?\"",
                                                                    "score": 1,
                                                                    "author": "Trillian258"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Is this some form of imposter syndrome? \nI have been struggling with it and I'm sure that will happen to me at some point. Starting first job in 2 days 😳.",
                                                                    "score": 1,
                                                                    "author": "bkapz"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Keeper??? Do you give your misbehaved children away?????????",
                                    "score": 28,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes. Also the ones with weird hair. O.o",
                                            "score": 22,
                                            "author": "Badbookitty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Jokes on you i dont have parents!",
                                                    "score": 10,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And now you know why. (;",
                                                            "score": 10,
                                                            "author": "Badbookitty",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'll have you know i gave *them* away ù_ú",
                                                                    "score": 12,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Quick Draw McGraw here. LOL!!!",
                                                                            "score": 6,
                                                                            "author": "Badbookitty",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Hey im really sorry but i dont know what that means",
                                                                                    "score": 6,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I usually hear \"keeper\" referring to an SO that's proved themselves to be worth keeping around, not a child, haha.",
                                    "score": 18,
                                    "author": "onthemotorway",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "😂😂 she's just so darn cute 🥺",
                                            "score": 1,
                                            "author": "Reahal38"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Which is good, because it's too late to return her.",
                                    "score": 4,
                                    "author": "iififlifly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I keep telling her I'm gonna find the receipt one of these days, but she doesn't believe me anymore.",
                                            "score": 4,
                                            "author": "GarbageDayyyyy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My dad used to joke about selling us for medical experiments. He'd also sometimes say \"I'm glad I decided to keep you.\"\n\nHe'd sometimes say the same thing about our mom, at which time I'd always remind him that he'd be in pretty big trouble if he didn't. There were 9 of us, and there's no way he could have handled it alone.",
                                                    "score": 1,
                                                    "author": "iififlifly"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "as opposed to an alternative?",
                                    "score": 1,
                                    "author": "slimethot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "o damm u lucky someone does that for u\n\nto wake me up,my mom shuts the AC and pulls up the curtain\n\nit feels like hell",
                            "score": 10,
                            "author": "blunt_arrow26"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wish mine would do that. She gets up at the crack of dawn and pounces on me till I’m awake",
                    "score": 5,
                    "author": "Radman25426",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ngl that's hella cute too",
                            "score": 2,
                            "author": "PranyTea"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Counter:  my 1 year old son has not been letting me sleep past 5 in forever.",
            "score": 551,
            "author": "s0ulbrother",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trust me I feel that pain. I know it sounds cliche and sappy, but he really will appreciate you later in life when he's able. It's an awesome feeling.",
                    "score": 244,
                    "author": "GarbageDayyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yesterday when he woke up he had a poopy diaper.  In my tired state I got a poppy hand .",
                            "score": 58,
                            "author": "s0ulbrother"
                        },
                        {
                            "level": 2,
                            "comment": "Alternatively I was a creepily quiet baby and never had to appreciate anything. Literally took me to the doctor cause I never cried about anything unless I was hungry or shit myself.\n\nIronically enough, unlike my brother who woke them up and kept them up every single night, I actually treated them well my whole life.",
                            "score": 13,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, technically, he's not let you sleep for one year and several months....",
                    "score": 17,
                    "author": "Sfb208"
                },
                {
                    "level": 1,
                    "comment": "I had one of those! We had to put a clock in his room to let him know when he was allowed to get out of bed!  I think we started that around 2 or 3 years old.  Game Changer!  Just had to have some quiet toys and books he could use.  Good luck!",
                    "score": 1,
                    "author": "Musicalmaudra"
                },
                {
                    "level": 1,
                    "comment": "I don't have kids but I have a dog who truly believes that I must be up by 6 am or earlier as her tummy is empty and must be filled.",
                    "score": 1,
                    "author": "creakinator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every Saturday morning my older sister would gather me up and take me downstairs. We would eat breakfast and then take laundry baskets, fill them with blankets and pillows (making mini beds) and sit/lay in them while watching cartoons. All while my parents peacefully snoozed away. My sister still gets kudos for doing that and she is now 32.",
            "score": 423,
            "author": "dredreidel",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's so adorable. I have two older brothers, and being the youngest and only girl, I remember them doing plenty of sweet things through my childhood. I also remember them giving me hell, but I love them anyway. Give your sister a hug for me, she sounds amazing.",
                    "score": 137,
                    "author": "GarbageDayyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I will the next time I can :) Older sibs can be the best and the worst. Still remember her telling one of my bullies “Hey! I am the only one who can make fun of her.”",
                            "score": 34,
                            "author": "dredreidel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a big sister I’ve said the same thing 🤣🤣",
                                    "score": 14,
                                    "author": "kaylakalay"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My sister met my boyfriend for the first time last weekend. Guess how long until she brought up the time I got spaghetti in my bangs?",
                                            "score": 2,
                                            "author": "dredreidel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean. I can’t grow a mustache to keep snacks in!",
                                                            "score": 1,
                                                            "author": "dredreidel"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s adorable. You kids may not have realized that Saturday morning can be a, ahem, special time for some parents.",
                    "score": 15,
                    "author": "hotelcalif",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Welp. Didn’t get a little brother or sister from it in any case.",
                            "score": 15,
                            "author": "dredreidel"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My three year old does that for kicks all the time. He’d rather lay on clean clothes though. Lol",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so beautiful. You are clearly doing a wonderful job of raising her 💖",
            "score": 142,
            "author": "Kissed_By_Fire_X",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for saying that :) but I give her all the credit. She's a lovely kid.",
                    "score": 73,
                    "author": "GarbageDayyyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kids are the best! I don’t have my own yet, but one of my friends started early, her son is 10 now and he is *awesome*!\n\nWhen he was in kindergarten she was pregnant and we walked to school together to pick them up. When he saw me he ran and said “Cuppycakes! What are you doing here?!” Then held my hand the whole way home. \n\nWhen he was 6 or 7 we were all hanging out and he looked at me and said “I like you because you always say your feelings”. One time his sister said I had a fat butt (I do) and he defended me like the knight he is! He told me if I was a color I would be glitter (I shamelessly accept that I have indoctrinated these kids into my glitter obsession!)\n\nLast year we were sitting on the couch and I said “I’m so sad, pretty soon you’re going to grow up and it won’t be cool to be my friend anymore”. And he just looked at me and said “that’s ok, I’ll always be your friend”.\n\nI freakin love that little dude! He is the favorite of all my friends kids, I like the rest of them a lot, but he’s just a little better :)",
            "score": 122,
            "author": "iluvcuppycakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cuppycakes— I cant even that’s so cute! He sounds like the perfect little man!",
                    "score": 14,
                    "author": "yankee174"
                },
                {
                    "level": 1,
                    "comment": "Feeeeeels!!",
                    "score": 2,
                    "author": "allthecoolusernamesw"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow. I'm so fucking emotional rn. Tell your daughter I said she's the best!!!",
            "score": 82,
            "author": "WindCleaver2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too man. Sorry for infecting you with my mushiness, but I now can't stop. Haha. I'll tell her :)",
                    "score": 38,
                    "author": "GarbageDayyyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My brother and I surprised my parents by making them dinner for their 25th anniversary. They were just planning on ordering from out families favorite restaurant, but we insisted we got it. Now, me and my brother are not *great* cooks, but I made some twice baked potatoes and my brother grilled some chicken (though he did consult my mom to check that the chicken was done like he thought it was, we didn’t want to poison anyone). It was simple, but I think my parents appreciated it\n\nEdit: forgot to add the obvious comment about how sweet your child is! She sounds like a wonderful young lady\n\nEdit 2: I know to some people 30 upvotes is not a lot but my comments often don’t get above single digits so thanks!",
            "score": 83,
            "author": "Flyer18"
        },
        {
            "level": 0,
            "comment": "That is so sweet. I was at a funeral and my nieces who were 6-8 years old asked to braid my hair. I said yes even though I was feeling insecure about them seeing that I had a few spots of greys coming in. But heck it’s a funeral and if it’ll make them happy to play with hair fine. So I end up with 3 of them braiding and I’m waiting for one of them to say something so true that it’s painful, when the 6 year old gasps and yells for her mom to *come see this*. “MOM! Aunt OP has WHITE HIGHLIGHTS!” Then the other two gasped in awe of my white highlights and called their mom too. It was so pure and adorable that I felt proud of my natural highlights and now that’s what I call them.",
            "score": 67,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My favourite story from raising my amazing son as a single mom...I was working as a paramedic, and had just worked a 24 hour shift. Picked up the kiddo at the babysitters and brought him home. He was about 7 years old and had adapted to our ridiculous schedule, he stayed out of trouble and knew how to keep himself entertained while I slept for a few hours. I had just laid down, and he knocks on my bedroom door...walks in carrying a plate with two slices of peanut butter toast and a Dr Pepper, “I made you breakfast before you sleep, Momie!”  I was absolutely overwhelmed by the wholesomeness and sweetness of this little human that I made! I was sitting up, eating and telling him how cool he was when he says “I even scraped the mold off the bread for you!”  \n\nI mean, what was I gonna do? Of course I kept eating...knew it was at least a forever story!",
            "score": 53,
            "author": "GallifreyanBrowncoat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Paramedic and single mom 🙋‍♀️ normally I cringe at “girl power” shit, but for Valentine’s Day last year my daughter got me a firefighter Barbie doll, then bought one for herself because she wanted to be like mommy. You can imagine the waterworks. \nSide note: idk why the font change. My phone is nuts",
                    "score": 5,
                    "author": "firemedicchick"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So I live with my mum and grandma and just got into baking. My grandma used to bake -she was a Home Economics lecturer and travelled to the US because of that 😂 She got diagnosed with breast cancer 11 years ago and even though she’s in remission now nothing really went back to the way it was. \n\nAnyways, we were talking and she mentioned some things that she missed making and eating and I made a list so my sister and I (she was behind the finances) would randomly surprise her with them. \nIt just makes her smile and nag us for putting a lot of sugar😂 (we don’t btw 😇) and I feel better especially since HER sister died not so long ago.\n\nSorry I ramble a lot 😖",
            "score": 39,
            "author": "Ese_tg"
        },
        {
            "level": 0,
            "comment": "When my nephew was 3/4,  he was still learning about how to interact with people. My boyfriend (who my family knew well) and I met up with him and his parents at a local fair. Little nephew kind of knew my SO, but assumed that the rest of the family didn't know him, so nephew took my SO by the hand and walked him around the group, introducing him to everyone.  \n\n\nIt was very sweet!",
            "score": 30,
            "author": "foul_female_frog"
        },
        {
            "level": 0,
            "comment": "Alright, if we are sharing favorite stories of our kiddos.  A couple year back a get an automated cal from the school that my daughter's lunch account had run low.  It was the middle of the month though so this didn't make sense.  Going on line I found she had actually run her account dry when the money I put in there usually lasted all month so, I called her over and asked her what was going on.  She explained that the mom of one of her friends was on the schools free lunch program.  While this was bare minimum to start with it also did not cover anything but the basics, especially when it came to snacks and such so her friend was having to miss out and was not able to keep her company when they had snack times.  (No sitting with and distracting the kids having snacks if you did not have snack.)  So, my daughter was buying snacks, drinks and even better quality lunches for two.  I praised her for doing a good job and taking care of her friend, went in and, since we had gotten to a good place in life, just doubled what I had been putting in her account.  \n\n(For those who might be curious girls mom is a single mom with 3 kids.  I kept the double funds in there for about four months until she got a new job that pays enough that they no longer qualify for the free/reduced lunch program.  I still keep some extra in the account at all times now \"just in case\".)",
            "score": 30,
            "author": "thearticulategrunt",
            "replies": [
                {
                    "level": 1,
                    "comment": "This makes my heart happy. I'm a single mother and my daughter also qualifies for free lunches. Pre-covid, I used to take her to the store and let her pick out her own snacks rather than paying for overpriced pudding or whatever. I'd make her promise to wait until after lunch, and she always did.\n\nI got such a kick out of her snack time stories, honestly. I let her pick some fairly ridiculous things. But her friends thought she was cool as hell for it, and I loved it. You're raising a sweet kid. And happy cake day by the way ;)",
                    "score": 13,
                    "author": "GarbageDayyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh thank you, I had not even noticed it was cake day lol.  Yeah she has the sweetest heart.  I hope she never has reason to loose it.\n\nWe actually ran into her friend with her mom and siblings at last year's school trunk or treat.  Really nice lady but I thought she was going to cry when she found out who we were.  I just told her all I did was back my daughter's play.  We all hung out all night, half of it with her youngest riding on my shoulders.  They've stayed friends since though my daughter is really bummed this school year though as their last names are different enough that with the split up schooling due to covid they are attending on different days and don't see each other.",
                            "score": 8,
                            "author": "thearticulategrunt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; (No sitting with and distracting the kids having snacks if you did not have snack.) \n\nWow... That's an effective way to show who's second rate people. The system really is messed up.\n\nYour daughter is awesome!",
                    "score": 7,
                    "author": "Svataben",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed.  They got to go to PE early but still, the kids knew and lets be honest, kids can be cruel for lesser reasons.  I mentioned as much a while later talking to the principle about something else but I don't think any changes were ever made.\n\nAnd thank you, yes she is.  She continues to amaze me on a pretty frequently.",
                            "score": 3,
                            "author": "thearticulategrunt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's how you know you've done a good job. That's all your hard work in action, mom/dad!!\n\nNow, if I could get my 5 year old to not wake me up at ungodly hours by bursting into the room like Kramer, I'll be so happy...",
            "score": 29,
            "author": "jhonotan1"
        },
        {
            "level": 0,
            "comment": "So very kind. My 6 yo knows when I’m having a rough moment with my anxiety and she turns up the kindness factor too. This is a testament of how you are raising her. You’re doing a great job. You’re raising an empathetic and kind hearted person.",
            "score": 14,
            "author": "civilrobot"
        },
        {
            "level": 0,
            "comment": "It’s little gestures like this that just make you feel like, okay maybe I’m doing this parenting thing right.\nKudos on an amazing kid.",
            "score": 11,
            "author": "1unimpressedunicorn"
        },
        {
            "level": 0,
            "comment": "The awards are just to make you feel fuzzy! This was so sweet to read! Enjoy your sweet little one! May they always be this considerate of others! &lt;3",
            "score": 10,
            "author": "jusalilem"
        },
        {
            "level": 0,
            "comment": "That’s amazing and so thoughtful. I hope you enjoyed your extra rest. Kids can be so perceptive and see more than we realise.\n\nI have a 5yr old daughter and my husband works away for months at a time so it’s tough trying to manage on my own trying to parent, work and manage my health issues. She knows I’m always tired. She told me last week that I should take a day off and still send her to daycare so that I can have a day to myself to just rest. I said that’s so thoughtful but I’d be lonely without you. She said you won’t be lonely you have the kitten, the big cat and the dog to keep you company. She was adamant she could make this work for me. I just told her that if I have a day off she gets the day off too because I know daycare days are long and tiring for her but she still thinks I need a day off. She also keeps coming up with ideas like getting a robot vacuum so I wouldn’t have to clean the floors or how she’s going to clean the house so I don’t have to. It gets me right in the heart that she’s worrying about me like that but also so thankful to be raising such a sweet and caring kid. She’s my little mate, such good company while her dad is away and we take care of each other 💗",
            "score": 10,
            "author": "scatterling1982"
        },
        {
            "level": 0,
            "comment": "My 7 year old brother could NEVER. I have to force him out of bed at 10am",
            "score": 8,
            "author": "GoddessHecate5"
        },
        {
            "level": 0,
            "comment": "Sounds like great parenting to me right there reflected in outstanding behavior and understanding by your little one!  Props to both of you!!",
            "score": 8,
            "author": "diplomatist_kind"
        },
        {
            "level": 0,
            "comment": "And here I am, yelling at my my kids to get up for over an hour before they finally start to even sit up in bed... You're so lucky!",
            "score": 7,
            "author": "RevivedNewt",
            "replies": [
                {
                    "level": 1,
                    "comment": "If she doesn't get up, I start popping her toes. She can't stand it, the sound I guess, and it's become my secret weapon.",
                    "score": 4,
                    "author": "GarbageDayyyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I definitely thought this was going to end with: \"and she made me late for work\"",
            "score": 7,
            "author": "IllicitTomato"
        },
        {
            "level": 0,
            "comment": "That’s actually so cute omg. You’ve raised an angel I’m sure you’re so proud 🥰",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That’s so cute oh my god",
            "score": 5,
            "author": "caro_131"
        },
        {
            "level": 0,
            "comment": "This shows you’re doing a great job of raising a compassionate human being!",
            "score": 5,
            "author": "no1youdknow"
        },
        {
            "level": 0,
            "comment": "What a beautifully thoughtful and amazing child! Good job on raising her!!!",
            "score": 5,
            "author": "goddess-of-the-trees"
        },
        {
            "level": 0,
            "comment": "You obviously are raising a very good and beautiful daughter with a big heart be proud mama...",
            "score": 6,
            "author": "Charles44Edwards1234"
        },
        {
            "level": 0,
            "comment": "What an amazing daughter! You’re doing a good job raising her. That’s an amazingly intuitive and kindhearted child. My heart is so full!",
            "score": 6,
            "author": "mollyclaireh"
        },
        {
            "level": 0,
            "comment": "I got my period last week along with a horrible headache, my 5 year old daughter came down to my room and after telling her I wasn’t feeling good got me water, pamprin and a snack with the help of her 10 year old brother.  Most days my kids are worthless, “Mom where’s this, mom where’s that?!, but once in awhile they amaze me!",
            "score": 8,
            "author": "smrphotowi"
        },
        {
            "level": 0,
            "comment": "You are raising her right!",
            "score": 4,
            "author": "AlarmingEase"
        },
        {
            "level": 0,
            "comment": "you’re raising her right:) what a sweet girl",
            "score": 4,
            "author": "kingofdoofus"
        },
        {
            "level": 0,
            "comment": "you’re a lucky mom and she’s a lucky kid.",
            "score": 3,
            "author": "Oblinger4"
        },
        {
            "level": 0,
            "comment": "Awwwwwww.... makes me all warm and happy to read this. Can’t get the smile off my face.",
            "score": 5,
            "author": "swiftarrow9"
        },
        {
            "level": 0,
            "comment": "What an amazing kiddo",
            "score": 3,
            "author": "Moxman73"
        },
        {
            "level": 0,
            "comment": "Shit I need an 8 year old butler apparently",
            "score": 5,
            "author": "burrito_poots",
            "replies": [
                {
                    "level": 1,
                    "comment": "The problem with 8 year old butlers is that you can't fire them and they only work once a year.\n\nBut ima give her a 5 star rating anyway.",
                    "score": 11,
                    "author": "GarbageDayyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Says you!",
                            "score": 6,
                            "author": "burrito_poots",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I'm ready to fire her, I'm gonna look you up ❤",
                                    "score": 5,
                                    "author": "GarbageDayyyyy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Please do. 8 year olds hold no charm over me. I won’t even offer a severance package. “Fire fast and furious” is my normal approach.",
                                            "score": 4,
                                            "author": "burrito_poots",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well jesus. What's your abnormal approach then? You know, for curiosity's sake. I'm not considering enrolling her or anything, but...?",
                                                    "score": 3,
                                                    "author": "GarbageDayyyyy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Indentured servitude in the form of forced labor working on a commercial poultry farm. Chickens aren’t hard to catch because they’re fast, it’s the angle — which 8 year olds are conveniently the right height to do. Best chicken wranglers you’ll find, bar none.",
                                                            "score": 7,
                                                            "author": "burrito_poots"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "good, good",
            "score": 3,
            "author": "metastasis_d"
        },
        {
            "level": 0,
            "comment": "Beautiful ❤️",
            "score": 3,
            "author": "Tendiciouz"
        },
        {
            "level": 0,
            "comment": "&lt;3 omg I miss caring for my mommy",
            "score": 3,
            "author": "SublimeTina"
        },
        {
            "level": 0,
            "comment": "That awesome. You have an amazing kid on your hands. I bet you're so proud. My baby is 10 weeks old and I cannot wait to feel how you are feeling. Keep up the good work momma!",
            "score": 3,
            "author": "GemStone97"
        },
        {
            "level": 0,
            "comment": "What a sweetie. I gotta be on my 8 year old’s butt or she ends up falling back to sleep lol.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is the sweetest thing I've read in a while. You must be a great parent, because this sounds like one incredibly thoughtful and sweet kid.",
            "score": 3,
            "author": "Mistress_Of_Mischeif"
        },
        {
            "level": 0,
            "comment": "A daughter so thoughtful and considerate must have been taught right by her mommy! You’re doing great !! She notices the sacrifices you make, you are both blessed to have each other !! Be proud of yourself momma",
            "score": 3,
            "author": "gerbma"
        },
        {
            "level": 0,
            "comment": "You must be a wonderful mom to have raised such a compassionate daughter. Kudos.",
            "score": 3,
            "author": "Elle0527"
        },
        {
            "level": 0,
            "comment": "Okay, who’s cutting onions? Love to your little family.",
            "score": 3,
            "author": "ToonForever"
        },
        {
            "level": 0,
            "comment": "Adorable! This is why I want kids despite all the horror stories that come with childbirth and raising a kid. Imo all of it will be worth it for these wholesome moments with a tiny human. \n\nMaybe that's just my monkey brain hormones screaming at me to reproduce already though 🤷‍♀️",
            "score": 3,
            "author": "Metalnettle404",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have 3 kiddos, and it's 100% worth it and then some. Those moments are just.....amazing!",
                    "score": 1,
                    "author": "zen_canna_mom"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She made the oatmeal?",
            "score": 3,
            "author": "Gerard_Wayyy_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hell yeah she did. Instant oatmeal, like the kind you just mix with some water. But still. I love some blueberry flavored oatmeal.",
                    "score": 1,
                    "author": "GarbageDayyyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ngl, I thought this was gonna be a bad turn where your daughter meant it in good faith and instead you got in trouble at work for being late.  Super happy I was very wrong.  Wholesome as could be.",
            "score": 3,
            "author": "TheLastRookie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking when I wrote this that it easily could've been that situation. Not having that 8 hour window that'd normally be filled by school has been complicated to work around, but on the other hand I actually really enjoy spending more time at home with her. She's a cuddly little creature.",
                    "score": 3,
                    "author": "GarbageDayyyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "wow. explain to her how kind and thoughtful that was. and what a wonderful, independent girl she is. and how that sort of initiative and independence shows what an amazing young woman she is becoming (every little girl loves hearing this) - these kinds of praises from family are what made me into a self starting, motivated human",
            "score": 3,
            "author": "freshcutlilac"
        },
        {
            "level": 0,
            "comment": "Your kid is more mature than I am and I’m 22 lol",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Children bring out the best in us.",
            "score": 2,
            "author": "Blind_philos"
        },
        {
            "level": 0,
            "comment": "Reading that made me feel warm and fuzzy and it wasn’t even my kid lol. I’m impressed an 8 year old would even have the thought process to be THAT thoughtful. That’s a sweet kid you have there for sure 💜",
            "score": 2,
            "author": "KimKarTRASHian09"
        },
        {
            "level": 0,
            "comment": "Precious moments like this, especially when a sweet child does something so selfless and loving, a part of a song from “The Sound of Music” comes to mind:\n\n\nFor here you are standing there, loving me\nWhether or not you should\nSo somewhere in my youth or childhood\nI must have done something good\n\nI am so happy for the both of you for having each other.",
            "score": 2,
            "author": "hoosermama1974"
        },
        {
            "level": 0,
            "comment": "You give a lot of love and you SHALL receive! \n\nSounds like love",
            "score": 2,
            "author": "JawnDouh"
        },
        {
            "level": 0,
            "comment": "Have my first award ive given. Wasn't sure who to give it to and only had 24 hrs to use it.. but this story made it clear who deserves it.. you should be a proud mumma. She is a product of your teachings. Good kid.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It sounds like you’ve raised and taught an amazing young person who will do wonders in this world (: kindness will always go a long way",
            "score": 2,
            "author": "BlackSabbath935"
        },
        {
            "level": 0,
            "comment": "Honestly that kid is gonna grow up to be such a wholesome human being. Hope for humanity's future right there",
            "score": 2,
            "author": "pancakemonkey21"
        },
        {
            "level": 0,
            "comment": "What a sweet child!",
            "score": 2,
            "author": "delee76"
        },
        {
            "level": 0,
            "comment": "Oh how sweet! Amazing kiddo you’re raising!",
            "score": 2,
            "author": "Alloutofsuckers"
        },
        {
            "level": 0,
            "comment": "Only 8 and you can already tell you raised em right",
            "score": 2,
            "author": "cool_girl2091"
        },
        {
            "level": 0,
            "comment": "This is a beautiful reflection of your parenting. You are doing an incredible job!",
            "score": 2,
            "author": "Spoon_Shaker"
        },
        {
            "level": 0,
            "comment": "When I was about that age, once a month my mum would go on a night out with her friends. When they got back home at who knows what time, she would pay the sitter and then go to bed whilst her friends passed out in our living room (should stress her friends are like family, really nice people). In the morning I was always first up and would quietly make toast out orange juice in a pitcher and make a big jug of coffee for everyone ready for when they woke up. My mums friends still to this day say how much they appreciated it. Also used to make breakfast and coffee for my mum every morning when I was a kid anyway because she worked so hard looking after me :)",
            "score": 2,
            "author": "_lulu23_"
        },
        {
            "level": 0,
            "comment": "Wholesome 100",
            "score": 2,
            "author": "NotSH4DOW"
        },
        {
            "level": 0,
            "comment": "You have to tell this story at their wedding! You’ll make everybody cry.",
            "score": 2,
            "author": "Porksterconquered"
        },
        {
            "level": 0,
            "comment": "Well that’s just wonderful, you must be doing something right! Good kid, good parent :)",
            "score": 2,
            "author": "dj_unscripted_"
        },
        {
            "level": 0,
            "comment": "The joys of parenting girls. Meanwhile my boy woke me up today by jumping on my head lol!",
            "score": 2,
            "author": "IamaCheeseAMA"
        },
        {
            "level": 0,
            "comment": "I think what's so great is that you're seeing different values she's learned play out here. She saw a moment where compassion was the best decision. You're also seeing that she's developing a sense of independence. Personally, I would encourage you to continue fostering great qualities like those. It'll make her into a confident person.",
            "score": 2,
            "author": "BungalowBootieBitch"
        },
        {
            "level": 0,
            "comment": "My version of doing this as a kid was putting bubble gum in my dads shoes so he could have an excuse to stay home and play with me. I got yelled at instead.",
            "score": 2,
            "author": "ImHardLikeMath",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's the thought that counts? Lmao, I honestly laughed way too hard at this. Kid logic is the best.",
                    "score": 2,
                    "author": "GarbageDayyyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re doing something right mom. Good job",
            "score": 2,
            "author": "UnihornWhale"
        },
        {
            "level": 0,
            "comment": "Am I the only one seeing potential red flags of codependency and/or enmeshment? The kid is ONLY 8 years old! That is A LOT for a child that age to accomplish and take on caretaker duties. I don’t mean to rain on anyone’s parade, but I’m feeling for this kid. Maybe just something to be aware of. Let the kid be a kid.",
            "score": 2,
            "author": "WaffelFrye",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's alright to be concerned and I understand where it's coming from. My daughter doesn't do these things often though, which is what made it special to me. She knows how to shower herself, make instant oatmeal, and join her classes by now because they're just basic life skills that she's developed.\n\nShe used those skills to do something thoughtful and I was proud of her. That's all there is to it, honestly.",
                    "score": 3,
                    "author": "GarbageDayyyyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for being open to my perception. I understand I am just a stranger on the internet who has NO idea about what is really going on. So, I appreciate you responding so graciously to my honest concern for your daughter.",
                            "score": 3,
                            "author": "WaffelFrye",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man, you're fine. Including every detail would make for a pretty long post obviously, but you're just using the information you were given.\n\nI've argued over some pretty silly things with internet strangers, but honest concern for a kid is hard to get defensive about. Thanks for letting me clarify a bit.",
                                    "score": 2,
                                    "author": "GarbageDayyyyy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish more people in the world were like caring 8 year olds.",
            "score": 2,
            "author": "Sakura-Moonspell"
        },
        {
            "level": 0,
            "comment": "You're a lucky guy. I've got 20 and 21 yr old girls that are so self-centered, they're unable to do anything for anyone unless there's an immediate benefit them.",
            "score": 3,
            "author": "sr_plankton",
            "replies": [
                {
                    "level": 1,
                    "comment": "woman\\*",
                    "score": 4,
                    "author": "onthemotorway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All good, this is the internet after all. But I appreciate that you read enough to know, lol",
                            "score": 2,
                            "author": "GarbageDayyyyy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol, I'm just tired of men arbitrarily assuming everyone on reddit is a man.",
                                    "score": 4,
                                    "author": "onthemotorway"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly I don't have the experience to compare, I only have one girl, she's 8, still sweet, and I do dread those years that I know are coming.\n\nBut to offer some perspective of my own, my dad thought the exact same of me when I was younger. But I feel now that we just never communicated properly.",
                    "score": 3,
                    "author": "GarbageDayyyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How sweet ❤️",
            "score": 1,
            "author": "kissmy-cat25"
        },
        {
            "level": 0,
            "comment": "That's so cute!",
            "score": 1,
            "author": "greenstonemeerkat"
        },
        {
            "level": 0,
            "comment": "My sister used to complain about math as a child so I hid her math books. She just got upset.",
            "score": 1,
            "author": "puppycat69"
        },
        {
            "level": 0,
            "comment": "What a sweetheart!",
            "score": 1,
            "author": "SentientSnowball"
        },
        {
            "level": 0,
            "comment": "That is just the sweetest!",
            "score": 1,
            "author": "ThrowAwayEggShells"
        },
        {
            "level": 0,
            "comment": "Sooooo...what did teacher think of mommy being passed out while kiddo was on the class meetings?",
            "score": -12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The camera wasn't on. If it were, I'm sure her teacher would've had more empathy than the typical below average reddit comment.",
                    "score": 12,
                    "author": "GarbageDayyyyy"
                },
                {
                    "level": 1,
                    "comment": "\"Passed out?\" OP was sleeping",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}