{
    "id": "jhw5vx",
    "score": 10984,
    "title": "I will happily pay more taxes so medical insurance companies can cease to exist.",
    "author": "[deleted]",
    "date": 1603643089.0,
    "url": "https://www.reddit.com/r/offmychest/comments/jhw5vx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been wracking my brain and I just can’t understand why private medical insurance is a good idea for anyone but the pigs getting rich from it.  There exists an entire industry around medical insurance. All of those people, including CEOs that get paid millions of dollars a year, take a shitload more money then it would cost to just pay to send someone to a doctor. What kind of sense does this make?",
    "comments": [
        {
            "level": 0,
            "comment": "Let’s not forget they are taking that money and paying off your politicians :)",
            "score": 1153,
            "author": "baseballlover4ever",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wouldn’t dare forget that.  Another issue is lobbying and the cause of it: Corporate Personhood.  Corporations aren’t people and the whole concept exists just so executive officers can do shady and dangerous shit that actually kills people and fucks up the earth.  Absolutely another bullshit concept that needs to be done away with.",
                    "score": 466,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Remember that the mere concept of corporate personhood was just made up and then codified by the Supreme Court, facilitating a lot of the horrible, greedy excesses that had to be addressed by later restrictions and legislations. Another way the SC finds new ways to combat progress and serve the powers that be",
                            "score": 101,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can we make it a thing where we give corporations the death penalty for especially hainous violations of law ?",
                                    "score": 14,
                                    "author": "LATourGuide"
                                },
                                {
                                    "level": 3,
                                    "comment": "if someone could clarify better i'd appreciate it, but...\n\nlawsuits can only be brought against people. corporations were defined as \"people\" only in the sense that they could also be sued. the idea of \"corporations are people so they also have rights\" was never intended originally",
                                    "score": 29,
                                    "author": "sniffels95",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "corporations were also defined as \"people\" for tax reasons.  something about only people can be taxed.",
                                            "score": 13,
                                            "author": "Mr_Quackums"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If corporations are people, then they should pay their taxes and register (their CEOs) for the draft.",
                            "score": 27,
                            "author": "cindybubbles"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Which is exactly why we're not likely to see this happen.\n\nIf it did, it would have to be phased in some manner. And that manner would have to say least look like it gave them a fighting chance to continue to exist.\n\nAdditional taxes, and a credit for purchasing insurance? And decoupling from employment?",
                    "score": 7,
                    "author": "_Magnolia_Fan_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yea, might as well give the money straight to the politicians as op suggests.",
                    "score": 2,
                    "author": "RAconsensualPE"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d really like term limits for senators and congressmen. I really think this should be something the United States looks at",
            "score": 317,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d really like to look at term limits for Supreme Court Justices first.  Lifetime appointments?  Woah, they can do too much damage for that shit.",
                    "score": 235,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At least an upper age limit to be forced to retire, like airline pilots etc. No one over 70 belongs in any federal job or political office...they should have mandatory retirement.",
                            "score": 169,
                            "author": "anonymousforever",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would mean presidents would only elect young judges, to ensure your pick has a maximum amount of time in the position. With judges, maybe experience is a good thing. You don’t necessarily want a green candidate. Someone in their 40s may not be best equipped to do the job. \n\nI think term limits makes more sense.",
                                    "score": 8,
                                    "author": "DanielBox4",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It wouldn't work. There are studies that look at effectiveness of term limits, and outside of executive positions term limits don't help with anything from campaign spending (still high) to listening to their constituents (they listen less).",
                            "score": 9,
                            "author": "RahaneFan"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 24,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn’t the purpose of lifetime appointments so that the SC isn’t politicized? Which it completely is now anyways?\n\nAnd if lifetime appointments are kept in place, they should then be voted on by citizens and popular vote wins. Instead of corrupt politicians who are swayed by dark money.",
                                    "score": 14,
                                    "author": "monogramchecklist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would agree with that.  Lifetime appointments only work if the people can be apolitical.   trump was clear that he was picking people who would vote a certain way.",
                                            "score": 3,
                                            "author": "ssf669",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Have to disagree with that. Mitch McConnell and the Senate Republicans acted in bad faith and broke their own rule they made up to deny Obama a justice seat in an election year so they could stack the court with right wing ideologues. There needs to be a course correction and term limits might be more reasonable than expanding the court. Doing so would force Breyer and Thomas into retirement, and Biden could replace Thomas with a liberal justice, bringing the court to a more reasonable 5-4 conservative majority instead of 6-3 and hopefully Democrats would get to choose the replacements for Roberts and Alito eventually.",
                                    "score": 32,
                                    "author": "squawkingood",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "term limits require a constitutional amendment, adding justices requires a majority in the senate, removing justices requires a majority in the house plus a supermajority in the senate.  much easier than an amendment.\n\nterm limits are also a long term fix and should not be used to fix a temporary problem (yes, there are other good reasons for term limits, but you are talking about them in terms of fixing a short term issue).",
                                            "score": 8,
                                            "author": "Mr_Quackums"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I see your point but don't you think that the same could be said about the supreme court?  Most are not in line with how the country feels about issues.  This country is founded on a promise of equality but SCOTUS doesn't interpret the law based on equality, they base it on their religious beliefs.  That is absolutely wrong.  We need term limits so these out of touch judges can be replaced.  If they were interpreting the law based on only the law then there would be no question about LGBTQ discrimination or discrimination against women's health care issue.   No one should be able to use THEIR religious beliefs to refuse rights or refuse to provide health care or medications to women.  They're out of touch.  \n\nTerm limits for Congress and Senate aren't really needed.   They aren't voted in for life and every 2-4 years they need to seek re-election.  Their voters get to determine if they deserve another term.   The real problem isn't the term, it's the gerrymandering and voter suppression.   If we fix those issues and ban changes, then the voters get to choose.  If Kentucky voters fairly chooses someone like McConnell then that's their choice.  The problem is, it isn't fair right now.",
                                    "score": 2,
                                    "author": "ssf669"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I personally would like to see term limits for SC justices if those limits couldn’t be politicized. Sadly, any term limit will be politicized, even ones based on age. The whole idea of lifetime appointments, as outlined in Federalist 78 of the Federalist Papers, was to prevent “judicial activism.” I could write a whole essay on the thing, and I’m more than willing to talk about this in depth with you if you’d like to have a good discussion about it, but here’s the basic tenet of the idea of lifetime appointments (LA): through LA, the justice wont have to rule any remotely radical way in order to appease any side and hence hold their position. This also applies to age in that, before ones term is up, they could rule drastically one sided in their last cases in order to preserve their views after they’re gone.",
                            "score": 3,
                            "author": "MyPenJustBroke"
                        },
                        {
                            "level": 2,
                            "comment": "This is also true! I feel the same sentiment. But I don’t think my idea is less worthy than yours.",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think your idea is perfectly valid.  It’s just that with what’s been going on, justices are at the front of my mind.",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’d put that term length at 6 years with no repeats. And the public should be able to vote for them, not the Senate.",
                            "score": 8,
                            "author": "cindybubbles"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A better idea is to keep them in their home districts.   Votes and hearings can be remote.   Local news could then keep tabs on them, and hopefully know who and what lobbyists are coming and going.   Constituents would be able to make their views know and make them answer questions.",
                    "score": 10,
                    "author": "architect19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re in America you already pay astoundingly high taxes for your limited returns. America’s tax rates are pretty on par with other countries who provide socialized healthcare. Your Government just chooses to allocate to funds to military spending. \n\nThat’s it. That’s the joke",
            "score": 64,
            "author": "-janelleybeans-",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are 100% correct.  It’s all about priorities.  Imagine what could happen if US military spending was cut in half and instead spent on healthcare.",
                    "score": 23,
                    "author": "mw891011",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A population dying of old age instead of preventable/treatable illnesses, probably.",
                            "score": 15,
                            "author": "-janelleybeans-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah there’s no reason beside profits. I live in the UK, we have the National Health Service and other than the problems caused by underfunding and overuse (it’s free so people show up to hospital with a cold or very minor injuries) it’s incredible. My friends and family have had surgeries that would each have cost upwards of $100k for FREE. I sliced my leg open in work, a couple of hours later I was stitched up and sent home. \n\nBut our government reduces funding and increases expectations every year. We know they’re corrupt, but you can see it so much more clearly this year with brexit and the pandemic.",
            "score": 160,
            "author": "vanadlen",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is a bad trajectory your country is going in.  God help you if you join the US in it’s abject stupidity.  We need to get over the greed and be better people here.",
                    "score": 66,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They just blocked a plan to feed kids from poor families during the school break. In reaction, tons of independent restaurants said they’d offer free meals to anyone who needed it and a senior politician tweeted this afternoon that it was ‘nice to see that they had bounced back well enough to offer free food and I hope that this means they won’t be taking any more government aid’.",
                            "score": 76,
                            "author": "vanadlen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fuck that’s infuriating. That was his takeaway from that?  Jesus how blind",
                                    "score": 62,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "This is a great comment, but don't forget they blocked to feed those kids whilst still being able to claim expenses for food and drink for themselves. \n\nJust to put that in perspective, my local MP claimed £63,000 in expenses which is more than my combined household income.",
                                    "score": 35,
                                    "author": "henchy91",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And yet they will act astounded at the assertion that they're - as it was so eloquently put - scum. Absurdity.",
                                            "score": 7,
                                            "author": "CrimsonDaedra"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cries in stressed about potential health issues and their potential costs that raise anxiety and stress even more to create NEW health issues that are unrelated :)",
                    "score": 11,
                    "author": "tacos_up_my_ass"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It doesn't. Welcome to the rest of the developed world.",
            "score": 388,
            "author": "Blippy_Swipey",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know the vast majority of the developed world has multi-payer systems where insurance companies do exist... right? Single-payer systems are in the minority.",
                    "score": 32,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes but they have the option of a public insurance. Look at germany. They have public insurance for everyone making under ~€62k and anyone above that can still use the public option. Private options are available and they usually have the benefit of shorter wait times, perhaps more specialties, etc. That's not to say that the care in public hospitals and practitioners are bad by any means, because its still very world class. \n\nThe USA has a unique opportunity to implement a great new healthcare system because there are so many countries with different public healthcare systems that america can pick and choose things from that they like and don't like.",
                            "score": 82,
                            "author": "conman526",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It is. I think they pay 7% or so for healthcare as part of their taxes. However, no more than 1% (maybe 2) of their income can be spent on healthcare besides the taxes. So no getting fucked with cancer bills, ambulances (Krankenwagen auf Deutsch lol), etc. If you make €100k then you'll pay no more than 1k out of pocket after the taxes per year.\n\nEdit: I should add that it's possible if you never visit the doctors and such you may pay less in the US. For example, my employer covers 100% of the monthly premiums for me so if I didn't visit the doctor my health insurance would be free. But if I did get in an accident and my surgeon wasn't in network id be on the hook for 50% of the bill. I'd rather pay more for the peace of mind knowing that can't happen, like ya know, insurance should be for.",
                                            "score": 14,
                                            "author": "conman526"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It is. I can pay $50-100/month depending on the coverage I want for health care that covers 1 (or more if you pay) dentist cleanings, majority of prescriptions costs, and glasses. That's on top of the free basic health care I get in Canada for annual checkups and walk-in clinics.\n\nMy partner in Vermont pays an arm and leg for her prescriptions even though she has insurance from her employer. And I think she has private insurance on top of that.",
                                            "score": 6,
                                            "author": "canuckkat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah I know, but that's not the point tho. I'm just saying that most countries don't have single payer systems, which is what the comment I was replying to said. The German system is a good model for the US.",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree completely about germany's system. I've actually been thinking about moving there haha. \n\nI think it's that a lot of people think it's 100% private or 100% public and many don't realize it's incredibly feasible to do both. The issue in America is that there is no public option available unless you're basically homeless (even then it's iffy) or you're old, and even then it's not that great.",
                                            "score": 15,
                                            "author": "conman526",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah Medicare and Medicaid are horrendously inefficient. Canada spends less per capita then the US does on medicare/caid and is able to use that money to extend universal coverage for its entire population. I would rather the US repeal them entirely and replace them with a different public option that's more well designed because I think medicare/caid is beyond fixing. The problem is that this would be insanely unpopular.",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hence the compromise with the elderly on Medicare for All. That's why Bernie proposed it; as a former chairman of the Senate Committee on Veteran Affairs, he was in a position to see the strengths and drawbacks of Medicare and VA care, and was aware of systems in other countries which didn't have the same issues we have. It's easier and far cheaper to expand the program while expanding its user base, but that wasn't communicated out to people because the industry stepped in to try and kill M4A.",
                                                            "score": 8,
                                                            "author": "shotgun_ninja",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Medicare for all has a lot of problems aside from efficiency. The two main problems are the lack of a proper price control system (Bernie keeps Medicare payment rates and drug costs are based on ingredient cost, rather than efficacy like with every other country. This increases costs and leads to a lot of problems with overconsumption, which drives up drugs costs in the US) and the lack of accountability for moral hazard (Bernie says no co-pays and deductibles like it's a good thing, but those things exist for a reason. Since out of pocket costs are so low, you're gonna have people show up to the doctor for every little thing, like a cold, which studies indicate may result in increased wait times and hundreds of billions in wastage).\n\nI would support a well designed single-payer system, which has the potential to save tons of money, but M4A is nowhere near well designed. I can't support it in good conscience.",
                                                                    "score": 11,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Who would've thunk that free preventive health care will result in less expensive treatments for serious health conditions because they're caught earlier. /s",
                                                            "score": 5,
                                                            "author": "canuckkat"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let’s not forget how pharmaceutical companies rob us, and the said insurance companies.",
            "score": 154,
            "author": "joebaby1975",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yeah, let’s not. I’ll pay for that shit too. I guarantee if I did, I would still make a net plus for not paying all those assholes",
                    "score": 58,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This always blew my mind... here in the UK all prescription drugs are capped at £9. Also, there’s an option, where if you have more than 11 prescriptions a year that you know you’ll need (antidepressants, heart medication etc) you can just pay a one off £106 and for the next year (or £30 for 3 months) you’ll get ALL your prescription medications for free - no matter how many prescriptions you have... my husband uses this option, as he’s asthmatic (2 different inhalers) and takes different adhd medications too  - this way he actually saves around £400 a year just on the regular medication, not including anything like antibiotics or cold medication. Also, have I mentioned we have completely free birth control?!",
                    "score": 44,
                    "author": "TheMittleLermaid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's definitely true that other countries do a far better job with all things Healthcare than us in the ol USA.",
                            "score": 13,
                            "author": "Secondlife20"
                        },
                        {
                            "level": 2,
                            "comment": "In England. Prescriptions in Scotland, Wales and NI are free.\n\n... well for now at least.",
                            "score": 2,
                            "author": "sneagator",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And let's not forget that pharmaceutical companies take tax payer dollars to develop vaccines and drugs....and then turn a profit for those.",
                    "score": 14,
                    "author": "ArtlessDodger10"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For my meds my copay went from $82 a month to $1000. I will gladly pay more taxes so I didn’t have to worry about this. If my job didn’t assist with copays I wouldn’t be able to take my meds.",
            "score": 41,
            "author": "nodlabag",
            "replies": [
                {
                    "level": 1,
                    "comment": "What kind of bullshit is that? I would be thrilled to pay more taxes so you can have your meds.  I’m sorry about this crap.",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I am lucky that my job covers the copay so I don’t have to if not it would have been the issue of not taking my meds.",
                            "score": 13,
                            "author": "nodlabag",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Should have to be lucky though, right? What about all the people who aren’t so lucky?",
                                    "score": 11,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I know. Americans need to stop viewing it only has paying more in taxes. Yes taxes increase but there won’t be anything taken out of your pay for health insurance. Plus all the additional costs are gone too.",
                                            "score": 13,
                                            "author": "nodlabag"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been ranting about this for days now. I don't understand why people get so angry at the idea of socialized medicine but are totally fine with privatized medicine in which people can (and do) completely rob people to make a profit. What do normal people who support that shit have to gain from it?? I'll never understand. And people (like trump lmfao) say socialized medicine just \"doesn't work\"-- it works in so many other countries and they're so much better off, that doesn't even make any fucking sense.",
            "score": 54,
            "author": "alyitaliano",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m an Australian and every single time I’ve mentioned that I get free healthcare on here, I get downvoted and I don’t understand why. My friends dad had a stroke the other week, he was flown in a helicopter 230 miles to a better hospital, had surgery and is now getting physiotherapy to help him regain movement and it didn’t cost him a cent, I just can’t understand how people are against that.",
                    "score": 50,
                    "author": "XoGossipgoat94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crying over the fact that he got airlifted and it didn't cost him anything yet my completely unnecessary forced ambulance ride down the street to a different hospital cost $4,000 😭",
                            "score": 19,
                            "author": "alyitaliano",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What the actual fuck! How can they justify that price? That’s terrifying. I’m really sorry it cost you that much.",
                                    "score": 5,
                                    "author": "XoGossipgoat94"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Firstly, yall dont have to pay for airlifts? Secondly, any hospital you can go too? Like my American brain is confused or is it only hospitals in your province, its provinces right. Also that sounds like a luxury. I nearly lost my mom too a kidney infection because the only hospital in network for us is the worst in town and suprise suprise their operating room wasn't in network.",
                            "score": 18,
                            "author": "Shirudo1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow I’m so sorry to hear that, it honestly makes me feel a little sick that people get treated like that in America. Generally they’ll send you to whatever hospital suites you best. one of the best hospitals in the country is John hunter hospital and they have an absolutely amazing children’s hospital next to the main hospital, if you have a sick kid they’ll send you there because the doctors are specifically there to treat children. It doesn’t matter where you are.",
                                    "score": 15,
                                    "author": "XoGossipgoat94",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ooooo thats honestly pretty smart! Its ok she's recovering just was very frustrating to experience.",
                                            "score": 3,
                                            "author": "Shirudo1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As far as I know each state covers ambulance rides (and air ambulance is included in this) differently. I live in Victoria and we have to buy ambulance cover but I think it was about $45AUD for the year. When I lived in Queensland I’m pretty sure they added it to our power bill so everyone was covered.",
                                    "score": 9,
                                    "author": "the-full-bird",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My mother had shortness of breath at work.  \nHer employer call 911 and wouldn't let her leave on her own they forced her to use the ambulance or be fired.  \nThat ambulance ride cost her 7000 USD.\n\nShe tried to get her employer to pay for it because they forced her to take it under their policies.\n\nShe was \"let go\" during this process (Right to work state) and when it got to small claims court the judge concluded that because she was no longer an employee the employer was not responsible for the ambulance cost.\n\nYour system sounds so much better.",
                                            "score": 14,
                                            "author": "hebeach89"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thats pretty neat thing. You pay a reasonable amount and don't receive a massively frightening bill just to get to a hospital.",
                                            "score": 7,
                                            "author": "Shirudo1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right.  And we DO have socialized medicine in the USA:  Medicare for seniors, Medicaid for the poor, Veterans Administration VA for ex- military —-  not perfect but it works decently for a lot of people",
                    "score": 13,
                    "author": "PaulaPurple",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Because socialism = bad. That’s all they know. Never mind that their taxes already pay for schools &amp; police, &amp; firemen &amp; roads all of which is socialism. Socialism = bad.",
                    "score": 18,
                    "author": "polish432b"
                },
                {
                    "level": 1,
                    "comment": "I think a lot of this has to do with people who want to control how their taxes are spent. And by that I mean, they don’t want their tax money being spent on someone’s transgender operation (I don’t know what those are called) because they don’t believe in it. Also the fact that apparently the only people who deserve medical care are those who work hard enough for it.\n\nI was having a discussion last year about this with someone who identifies as republican, and when I brought up socialized healthcare, the first question out of his mouth is “so you think pedophiles deserve free healthcare?” The only response I could think of is “are they human?”\n\nThere’s going to be 10-15% of shitty, undeserving people out there who’s life choices I don’t agree with and who will take advantage of the system, and so because of that we all should suffer. That’s how I think anyone against socialized medicine sees it. There’s always a focus on the minority that will take advantage rather than the majority that it’s going to be life changing for.",
                    "score": 6,
                    "author": "Oldsodacan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Whenever I have these types of conversations with a Republican it’s always someone who hasn’t been to the dentist in like ten fucking years because they can’t afford it yet are too stupid to realize they’re the exact person that would benefit from socialized medicine.",
                            "score": 4,
                            "author": "alycat_859"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tbh, I think it’s exactly those people that are making massive profits that are paying for marketing and public representative to lie to their constituents.  The people that buy into that bullshit can’t think for themselves and just take the word of dipshits at Fox News.",
                    "score": 13,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "They've been lied to by republicans for years that socialized medicine is the worst thing in the world.  The only ones who benefit from private insurance are the CEOs, big pharma, and republican politicians.   The problem is just ignorance.",
                    "score": 2,
                    "author": "ssf669"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work in medical administration (I process medical insurance claims, specializing in high dollar Medicaid claims) and I am not getting rich. The CEOs are making bank but the rest of us.. not so much. I live in a high cost of living state, and because I have a special needs child, we are covered under a Medicaid plan because my work doesn't offer direct healthcare.\n\nI love my job. I don't work directly with patients, but I work hard to make sure that their medical claim are processed correctly and paid so that they don't have to worry about getting any bills from a doctor or hospital and can keep getting treatment. \n\nUnfortunately insurance companies are never going to cease to exist because even if we (Americans) raise taxes for us all to have health insurance, claims are still going to need to be processed in order for the government to pay for the treatment or medication. Plus, not everyone is going to want a government backed healthcare plan, so companies will exist for those who purchase private healthcare insurance.\n\nHealthcare should be a right for ALL, not for those who can afford it or the very poor (Medicaid)",
            "score": 17,
            "author": "SuperbPlan8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, that’s fair.  I don’t mean all medical processing should be gone.  But I would make it a public department. The point I wants to make is really that profit shouldn’t be an incentive regarding healthcare.",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And I totally agree with you. I get really upset when I hear that the insurance company either denied a claim or declined to authorize a procedure because they think they might lose money on it. I can tell a whole lot of stories where procedures were denied and than it came back the patient got worse or they died. I can't tell you how many claims I have seen (mostly) women and children being denied a procedure they desperately needed. It is sickening.\n\nI am in favor of expanding Medicaid but that program needs to be overhauled. I would happily pay more in taxes to see our most vulnerable people get healthcare they need.\n\nThere is no reason why an aspirin given at the hospital should be a $50 charge on an itemized bill.",
                            "score": 14,
                            "author": "SuperbPlan8",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was 11 my mom was dying from this rare autoimmune disease. New studies showed that chemotherapy could more or less cure it. My dad’s job had family coverage insurance. The insurance company told my family that they didn’t think she actually needed it. When my dad said “she’ll die without it and leave her 11 and 7 year old children motherless unless she gets it,” they told my dad to calm down and not to overreact. It was a $20,000 procedure. My parents had to pay out of pocket. Insurance companies are evil in my opinion.",
            "score": 37,
            "author": "Cheshire17",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are evil. I'm looking at a 20k bill right now from a surgical procedure I needed, which my insurance approved I add, and somehow they've decided to flat out not pay for part of it.",
                    "score": 6,
                    "author": "janiepuff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It should be criminal to deny coverage after initially accepting it. Seems like fraud to me. It’s also so wrong to deny someone coverage to a necessary surgery.  I’m so sorry you had to experience that.",
                            "score": 2,
                            "author": "Cheshire17"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "did she live?",
                    "score": 3,
                    "author": "redheadmarxist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She did! She’s had health issues since then, including open heart surgery, but she’s actually doing really well right now! I’m now 27, so this was almost 16 years ago that this happened.",
                            "score": 2,
                            "author": "Cheshire17"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No shit.  And since blue cross/blue shield became FOR PROFIT, and most health insurers are for profit, the goal is to satisfy stockholders and other stakeholders, rather than pooling risk and allocating as much as possible to the premium payers who have legitimate claims - the very notion of insurance.\n\nAnd so much staff in doctor offices and hospitals spending so much time sorting out insurance issues, denied claims, etc.  a lot of wasted overhead.   And so many insurance companies denying claims over nothing, ridiculous stuff, like “your doctor charges more than the national average for this procedure, so we will not pay the whole claim, you owe the rest out of pocket”.   \n\nWhat I saw my sister-in-law go through in her 30s in a 6 year battle with breast cancer was appalling!  \n-Denied a double mastectomy right off the bat, the massive tumor was only on the left side”. (Luckily a parity regulation stopped that).   \n- Oh that intestinal problem, go down the hall to this gastroenterologist.  $1,000 bill not covered “Oh his office is on our campus, but he is out-of-network, and it is your responsibility, very sick patient, to make sure all providers are in-network!”   \n- $8,000 chemo dose?  You must order it from our mail-order pharmacy, not the hospital pharmacy.  So she shows up for chemo, they check her heart and vitals -  too sick to handle chemo today.  “Well you still have to pay for it”\n- “we deem the treatment your highly experienced oncologist ordered as too experimental, so we will not pay”\n..... on and on and on.  \n\nI have always been behind Hillary Clinton’s health care reform initiatives, starting in the early 1990s, for this reason!  So many medically bankrupt Americans.",
            "score": 16,
            "author": "PaulaPurple",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks a lot, that is such a great post.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They are stuck on “why should I have to pay for someone else’s sickness” or “you can’t force me to have health insurance”. they won’t understand until they become sick and can’t afford to pay their bills.",
            "score": 12,
            "author": "PrincessPeach029"
        },
        {
            "level": 0,
            "comment": "None. It makes no sense at all. I hate it so much.",
            "score": 16,
            "author": "LondonIsMyHeart"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lately, I’ve wished I lived there too. Too late now I guess!",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "United Healthcare has now raised my deductible higher than the HSA contribution limit. The deductible has nearly tripled in 8 years. Their profits last year were over $100 billion. Fuck United Healthcare.\n\nOur family deductible in 2012 was $3,000. This year it was just raised to $8,000 and has finally surpassed the federal HSA contribution limit of $7,100. They have strategically raised the deductible to match the HSA contribution limits over the last several years. This is nearly TRIPLED over 8 years and is absolutely insane. I have exactly $0 in my HSA even though I've contributed somewhere around $45,000 over the last 8 years. We have to fight to get approval for basic medical services and we pay out the ass if we happen to go to an in-network hospital but can only be seen by an out-of-network doctor. We are suffering to make ends meet while they make billions. Fuck this entire system.",
            "score": 6,
            "author": "FuckUHC1"
        },
        {
            "level": 0,
            "comment": "I’ve done the math. Paying higher taxes like the “socialist” countries would actually leave me with more take home pay than what I bring home now, considering what I have to pay for out of pocket after my taxes anyway, like health care premiums, co-pays, deductibles, prescriptions, etc.. Not to mention all of the other stuff stuff, like retirement, affordable schooling, daycare, etc.",
            "score": 18,
            "author": "FML_Mama",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am a Hongkonger living in Denmark, protected by two universal healthcares. I’m sorry to burst your bubble a bit but:\n\n- insurance companies will still exist even with universal healthcare. They will be much cheaper, and they will mostly cover things like accidents or non-critical illnesses. But they will still be a thing because there will always be some people who want more than what basic universal package can offer.\n\n- your taxes has nothing to do with it. Hong Kong has the lowest tax rate in all of the developed world. We still have universal healthcare, the best in the world actually according to life expectancy. You don’t lack universal healthcare because you can’t afford it without raising taxes. You don’t have it because your govt doesn’t wanna give it to you; and because you people aren’t fighting for it enough.",
            "score": 16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My bubble isn’t burst at all really. Ok, I didn’t communicate the sentiment of my post well.  My concern is centered on the form American health insurance companies exist in today.  I get that they will always still exist in some form, however what I find deplorable is that a sickening number of people are left totally fucked by the shenanigans that take place over people’s very health just to generate profit.  Tell me more about how my taxes don’t have anything to do with my country adopting a single payer health system.  That sounds like magic to me.",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not familiar with single payer healthcare, as neither Denmark nor Hong Kong has it. We have socialized medicine or universal healthcare, which basically means that public hospitals are free. You don’t pay into it as health insurance. Because hospitals are already funded by tax money, just like the post office and the police.\n\nYou just call an ambulance (also free) and stay in the hospital until you are well. And you only get charge a little bit for things like syringes or non-critical medication.\n\nI honestly don’t know why things cost the price they cost in America, even tho I lived there for a good portion of my life. I believe drug prices are unregulated, which is the main reason for the price hike. If Martin Skereli pulled the shit he pulled in Europe, he would be going to jail so fast.\n\nAs what to fund the hospitals with, I dunno, spend a little less on the military and stop bailing out failing corporations, I guess. In the EU we tax the rich just as much as they do the middle class. And most of our hospitals run fine (except the UK the NHS suck because they keep cutting funds); and HK is a bit of a special case because our government’s main source if income isn’t tax, but investment in land/corporations/other governments etc..",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We already pay enough to do it, no need for a tax increase. It just goes to killing brown people in the middle-east, and into the pockets of billionaires and politicians. Look how easily they bailed out businesses. That cost more than healthcare for all would. \n\n“bUt HoW wIlL yOu PAy fOr It?” \n\nMotherfucker, how did we pay for that shit we don’t need? Stop putting the money into shit we don’t need and put it into Healthcare.",
            "score": 8,
            "author": "Kyhan"
        },
        {
            "level": 0,
            "comment": "Hell, fucking *add 50% to my taxes right now*, as long as I never have to hear the words ‘medical billing’ ever again.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not more taxes, just divert all the money that you AND your employer are paying monthly from you paycheck. Put all that money together with everyone else’s and we could easily pay for universal healthcare",
            "score": 3,
            "author": "iveseensomethings82",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People paying like $1000 a month for a family plan. Adjust for currency conversion and two people in my country would pay ~$200 per person (not including kids as they don't cost). Also perscriptions are free for kids. Also you can go to any hospital. Also your doctor will recommend medication based on evidence and not ads. Also the gov't will ALWAYS cover the expenses - even if they contract it out to a private company. Also ambulances exist only to take you to hospital.\n\nI have no idea why anyone wouldn't want socialised healthcare, other than they enjoy stress and pissing money away for no reason",
            "score": 4,
            "author": "KaiRaiUnknown",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t either, what country do you live in?",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You might be paying more taxes but if we look at Medicare 4 All, it might be more beneficial in the long run.\n\nSome reports state that M4A would be around $900 a year per family. \n\nLet's say that is a low ball and its double and we round up.  So $2000 a year.\n\nThe average American family spends $10,000 a year for medical coverage (I can attest to this, I pay $1000 a month so $12k a year)\n\nPlus whatever co pays.  \n\nunder M4A there would be no copays\n\nYeah you pay more in tax but really you would be saving money and some say that the amount an employer saves could technically go into your compensation package if they choose to do so.",
            "score": 3,
            "author": "berger034",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah private healthcare doesn't make sense in my eyes. They don't even cover some of your treatment. I'm from the UK and the NHS isn't the best but I'm happy to wait a long time for my stuffed nose or bad cough to be seen too if someone gets a life saving operation or consultation before me.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is why I dislike the US so much. Corporations have far too much power over there and get away with murder (figuratively, and probably literally).",
            "score": 3,
            "author": "thatwasanillegalknee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Cancer survivor here.  I am 100% in agreement.",
            "score": 5,
            "author": "Happy_Each_Day"
        },
        {
            "level": 0,
            "comment": "People should not profit off of things like healthcare and utilities. Healthcare in the US is double the cost of the second most expensive country, and there is no reason for that.  I’m not saying it should be free, but why is it so outrageously expensive?  Greed.",
            "score": 7,
            "author": "1badh0mbre",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m saying it should be “free”.  You as the sick or injured pay nothing but I will happily shoulder the cost.  It’s for me too, but tbh, I can afford my health care where most people in the country can’t.  We need to take care of those goddamn people.",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It baffles me how we haven’t even adopted a basic form of universal healthcare. Most people would vote for it, and we see it work with other developed nations in the world.",
            "score": 3,
            "author": "ZachtheKingsfan"
        },
        {
            "level": 0,
            "comment": "Here in Australia we have universal health care but private health is still worth it. If you need a new hip you don't limp around in pain for years waiting on a list of you have private.",
            "score": 3,
            "author": "heyimhereok"
        },
        {
            "level": 0,
            "comment": "Canadian here. You've missed the point. A Yale University study published in The Lancet indicates a SAVING of $450 Billion every year and it would save 68,000 lives per year. The savings would be realized by dismantling the for profit system currently in place giving reduced costs for health care. There would be enough saved in the first year to provide severence pay and job retraining for every employee who loses their job in private industry for six months. I would never presume to speak for all Canadians but, every time the subject comes up here in Canada we are all mystified when tax paying, law abiding Americans vociferously defend a health care system that leaves them at the mercy of greedy insurance companies and for profit hospitals while enriching shareholders and management. To sum up; we think you're fucking crazy.",
            "score": 3,
            "author": "wardog1066"
        },
        {
            "level": 0,
            "comment": "Since so many of us are working remotely and can choose to live anywhere, why does my health insurance have to be tied to the geographic location of my employer? I am ready for national healthcare.",
            "score": 3,
            "author": "tagoNGtago"
        },
        {
            "level": 0,
            "comment": "I work in healthcare, and me too. I see firsthand how lack of basic preventative and primary care leads to preventable deaths, infant mortality, and shocking health disparities. \nI thought graduating college and getting a full-time professional career would turn me more conservative. But it’s just opened my eyes even more to the reality of how soulless corporate healthcare organizations are. \n\nThe issue is that many Americans think that the price the hospitals charge is a fair price, and that nationalizing healthcare would be astronomically expensive. It doesn’t have to be.",
            "score": 3,
            "author": "enzymelinkedimmuno"
        },
        {
            "level": 0,
            "comment": "Aren’t most employers already adjusting your pay to cover the medical insurance costs? \n\nI have no idea how they do this in the US, but I doubt employers are providing the cover for free.",
            "score": 3,
            "author": "papercut2008uk"
        },
        {
            "level": 0,
            "comment": "Because medical insurance doesn’t work like any other type of insurance. \n\nYou don’t have auto insurance to cover getting oil changes, or repairing your transmission. \n\nYou don’t have homeowners insurance to cover fixing your refrigerator or changing the filters in your a/c. \n\nBut because of how jacked up the medical system is, you have to have medical insurance just to get a physical.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I live in Canada.  We don’t have private medical insurance companies.  Health care is top notch.",
            "score": 3,
            "author": "Violeta_555"
        },
        {
            "level": 0,
            "comment": "I thought about this the other day. $200 is taken from each of my pay checks for insurance. I have a $1000 deductible that I have to meet before insurance covers anything, and I never go to the doctor. If I were to go to the doctor for an emergency, if insurance covered it, I would still have to pay the $1000 on top of what I’ve already payed every check for 10+ years. Oh and the deductible resets every year. Tax me harder baby. I’ll take higher taxes any day.",
            "score": 3,
            "author": "sspaceghostt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tax the shit out of me because it’s so hard to keep me from losing money Compared to what I have to pay right now.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know how it works where you live, but here in Mexico you have either the IMSS (Mexican Institute of Social Insurance) or the ISSTE(State Employees Social Insurance Institute), so... They are the same (Government owned insurance companies) but if you work for a private company you can only have the IMSS, if you work for the government you go to the ISSTE. The IMSS takes a part of your paycheck (and a part of your boss' profit) each month and you get monthly appointments with a doctor or specialist, free meds for diverse illnesses and free check up exams. But it won't cover mayor surgeries or dangerous illnesses like cancer.",
            "score": 3,
            "author": "Main-Routine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "United healthcare made 282 billion dollars with a profit of 13.8 billion. There is no need for them to make that much money for an insurance company.",
            "score": 3,
            "author": "I-Ask-questions-u",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It doesn't make sense. Most people who have thought actually thought about it will agree with you. The ones who don't are either benefitting from the current system or else they have swallowed the propaganda hook line and sinker. It saddens me that many people, even my own parents can look at the way things are and think that instead of making absolute change we should try to just go back to the way things were x amount of time before bc their Healthcare costs were cheaper then. Costs are only going to continue to go up, its the nature of the beast. Unless we make an actual change to the system, that is",
            "score": 3,
            "author": "_basic_bitch",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't get it either. 4 years ago with Bernie Sanders medicare-for-all plan they said it would cost $32 Trillion over 10 years, and people cried 'that's too expensive!'.\n\nBut, under the current system we spent: 2016-$3.3T, 2017-$3.5T, 2018-$3.6T. As such, we're on track to spend over $40 Trillion under the current private insurance system over the next decade. AND that doesn't cover everyone, so we're paying more for less people covered.\n\nIt would be nice if we had honest politicians that could objectively debate policy.",
            "score": 3,
            "author": "ThorFury314"
        },
        {
            "level": 0,
            "comment": "Agreed x 1000",
            "score": 3,
            "author": "flykillermother"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man, good post!",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone else hoping there would be a juicy controversial section?",
            "score": 4,
            "author": "ImaJimmy"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also sending drug addicts to rehab could be covered by universal healthcare, thus killing two birds with one stone. We cut taxes on prisons with this prison reform, and use it toward helping everybody :)",
                    "score": 6,
                    "author": "ZachtheKingsfan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then we can get rid of for profit prisons!",
                            "score": 3,
                            "author": "Shirudo1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if I told you to dont have to make that choice?",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It’s weird how my uncle who lives in Canada with free healthcare, still decides to get private healthcare. I live in the US so that’s not even a choice for me... I don’t get it",
            "score": 2,
            "author": "RandomRedditReject",
            "replies": [
                {
                    "level": 1,
                    "comment": "With private healthcare, you get to choose who you want to see and can be seen sooner. With free healthcare, the government limits who you can see and there’s a waitlist.",
                    "score": 3,
                    "author": "Kpruett95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "An exboyfriend of mine could’ve survived cancer if he had gotten a treatment, but since he wasn’t considered sick enough for it. This was under Medicaid.",
                                    "score": 3,
                                    "author": "Kpruett95",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The US government pays more per capita than pretty much any other nation for healthcare despite not having free at point of use healthcare. \nA properly implemented system would cost less in taxes, and there would be no insurance premium, deductible, medical bankruptcy, keeping a bullshit job you hate because you need the medical cover etc. With so many vested interests it’s a long shot for this change to happen soon. \nI think it’s best not to overwhelm the government, maybe getting an uncontaminated water supply to Flint would be a nice stepping stone into joining the civilised world.",
            "score": 2,
            "author": "shmdtbditw"
        },
        {
            "level": 0,
            "comment": "I am literally writing a paper about this. Great to see other people share the same sentiment!!",
            "score": 2,
            "author": "ThisMusicChick"
        },
        {
            "level": 0,
            "comment": "I suspect a lot of it will actually be resistance from the doctors and surgeons not wanting to have public healthcare. For them public healthcare = more work, less pay. More worryingly it could lead to a huge reduction in the number of doctors as they'll just go into a different career.\n\nTo put it into perspective, the max salary working as an orthopaedic surgeon purely on the NHS is around £100,000 per year. In comparison, an orthopaedic surgeon working purely privately can earn 10x that pay easily (i.e. £1 million per year).\n\nIt's a sad truth but understandable. Although most doctors become doctors for good intentions, it is difficult to tell anyone to work more for less money",
            "score": 2,
            "author": "ImplodingPeach"
        },
        {
            "level": 0,
            "comment": "I don’t understand why everyone doesn’t stop paying their medical bills.\n\nThere is power in numbers. If everyone agreed to not pay, the medical industry would tank and something would have to be done.\n\nI mean if we can get 30% of the population to follow a dipshit like Trump we should be able to stop them from paying bills.",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I advocate for government health insurance, too. I’m on my government’s health insurance and drug program, but I worry about those who can’t afford the drugs that they need to live a fulfilling life.",
            "score": 2,
            "author": "cindybubbles"
        },
        {
            "level": 0,
            "comment": "Saaaame!  How can people make so much money on someone’s health?  \nI don’t know how they sleep at night. Doctors should get paid well\nBut insurance salesmen (ceo and executives)?  No. Fricken. Way.\n\nGet a conscience.  Find a purpose.  Money is not everything.  Our society needs to change for us to grow as a species. This is not it",
            "score": 2,
            "author": "anotherbitesit99"
        },
        {
            "level": 0,
            "comment": "Here in the uk we have universal healthcare do we generally pay more tax to fund this than the USA and I think a lot of people in the us feel this way.",
            "score": 2,
            "author": "mattamz"
        },
        {
            "level": 0,
            "comment": "A-fucking-men. Private insurance is a morally bankrupt, disgusting blight on the American way of life.",
            "score": 2,
            "author": "letsrollwithit"
        },
        {
            "level": 0,
            "comment": "I am a revenue manager for a 100+ physician medical practice, primarily in insurance collections.  I would 100% support Medicare for all even if it means I have to find another career path.  Pretty sure I can take my rev cycle and management skills anywhere.",
            "score": 2,
            "author": "wannabesupermom"
        },
        {
            "level": 0,
            "comment": "Greetings from Argentina, where most of us are kinda poor but we all have free public healthcare and universities. If we can have it, you guys definitely should be able to have it too.",
            "score": 2,
            "author": "chipamboca16"
        },
        {
            "level": 0,
            "comment": "Came here to say 100% agree. I make between 135-180K yearly, And I have ZERO issues paying more in taxes so people can have access to health care. I’ll never understand the obedience to our system and it’s clear fraud and short comings.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The medical industry in the US is literally run like any given retail chain. When the profit stops(like they did with the elective surgery stoppage during this pandemic) quality nurses and docs got laid off. It’s a “for profit” industry and it should be a “for people” industry.",
            "score": 2,
            "author": "imanasshole1331",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly what I’m saying",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you make more than 400k?  If not, I have good news...",
            "score": 2,
            "author": "JerkfaceBob"
        },
        {
            "level": 0,
            "comment": "Where I live they are trying to privatize. Fuckers",
            "score": 2,
            "author": "jamz1988",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why does insurance companies get a better rate than an out of pocket customer? They’ll bankrupt us but take a $14 payout from Medicare. Americans have been bamboozled.",
            "score": 2,
            "author": "Barcode3"
        },
        {
            "level": 0,
            "comment": "I gotta thank americans for exporting this shitty system that increases inequality and diminishes quality and access to medical care.\nIt even was written into our constitution (Chile).\nNo hate for the people (despite electing Nixon) but fuck all fucking american corporations.",
            "score": 2,
            "author": "tenomaik",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Insurance is a scam",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Pretty sure it wouldn’t take much more in taxes once the insurance companies aren’t siphoning off all of those billions of dollars in profits.",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": ".....or Just move to Canada.",
            "score": 2,
            "author": "olderfartbob",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You'd actually be paying less - a lot less.\n\nTurns out basic healthcare for all saves a lot of money, in the long run...",
            "score": 2,
            "author": "thikut",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had a radical thought. The answer is to make public all things related to healthcare. Not just insurance but research, supplies, delivery and aftercare. Across the world not just the US but here in the UK, Europe and everywhere.\n\nNobody should make a profit from making people better.",
            "score": 2,
            "author": "Carphead",
            "replies": [
                {
                    "level": 1,
                    "comment": "If that’s a radical thought, then I’m a radical ass motherfucker because I think that’s a great idea.  Profit (read:capitalism) is the main threat to human life as it cares nothing for our environment or the health of people.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Exactly! Patients hate it, doctors hate it, administrators hate it, EVERYONE hates it except people who get rich from it and politicians who get campaign money from insurers.",
            "score": 2,
            "author": "redheadmarxist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People are invested in private insurance. That's why we will have a hard time getting rid of private insurance.",
            "score": 2,
            "author": "ChrisPBacon420Blaze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely, I am aware this is the problem. That being said, investing is just another form of gambling and I would be happy if all of those investors lost that money so that the rest of us could have healthcare.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just come to Europe.",
            "score": 2,
            "author": "bananamadafaka",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would absolutely love to move to Europe.  Unfortunately I can’t leave the US because we handled the pandemic so terribly. When we can though, I’ve always wanted to live in Spain. I spent the last 10 years learning Spanish because my wife’s Puerto Rican and I would love nothing more than to master that language",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same, dude, same. \n\nSource: work for an insurance company and hate it. Also, I have a chronic illness so it sucks whenever I lose a job / switch jobs and don't have insurance for a bit. It's landed me in the hospital at least once in my adult life because I couldn't afford my medications without coverage.",
            "score": 2,
            "author": "easycure",
            "replies": [
                {
                    "level": 1,
                    "comment": "See? That’s bullshit. You shouldn’t have to live like that and I’m sorry.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work 30 hours a week (between two jobs) and don’t have medical insurance. It’s too expensive. I hate how we’re an advanced country still charging citizens an arm and a leg to see a doctor",
            "score": 2,
            "author": "areaunknown_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Both public and privatized health care have a huge potential for abuse.  Just look at Social Security and imagine that as our health care. The government is not any less corrupt than the current privatized Healthcare.  The problem is the corruption that goes on unchecked.  We see it and know that they are corrupt as all hell but can't do anything about it because they are protected by a system they BOUGHT that we also know is corrupt as hell.  To turn around and give the power of governing everyone's health system over to the very same people that have already been BOUGHT is not going to help us.  Every executive of every medical insurance agency, every executive of every hospital,  along with executives of pharmaceutical manufacturers needs to be held severely accountable for their actions.",
            "score": 2,
            "author": "Analath"
        },
        {
            "level": 0,
            "comment": "Then come to Canada lol",
            "score": 2,
            "author": "katkannabis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sound great, can I stay at your house? J/k :-)",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope you're aware that the medical insurance isn't a US only thing, but something that exists almost everywhere in the world with a few notable exemptions. It's just a lot cheaper elsewhere, because the US has a ton of red tape around everything, and the American Medical Association is perhaps the world's strongest union that ensures that you can't get a medical degree in e.g. Europe and then come to the US to practice your physician skills.",
            "score": 2,
            "author": "Juvor"
        },
        {
            "level": 0,
            "comment": "Come to canada",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's what we have with the NHS. It's a lot nicer than insurance companies",
            "score": 2,
            "author": "DrDraydle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Health insurance is a total scam.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It makes no sense. Join the rest of the civilised world with state run healthcare. Love the UK.",
            "score": 2,
            "author": "choparts"
        },
        {
            "level": 0,
            "comment": "Alberta. \n\nWe are in the middle of a wildcat strike.",
            "score": 2,
            "author": "jamz1988",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Me too. People don't want to get sick.  Health is kind of necessary to live",
            "score": 2,
            "author": "EvilBigBrother"
        },
        {
            "level": 0,
            "comment": "You don't know how hard I want to flex my nation's free Healthcare. Here in Italy we pay zero, even for chemotherapy or everything else. Everything is completely free if you have a prescription",
            "score": 2,
            "author": "RaimondoSpit"
        },
        {
            "level": 0,
            "comment": "There's a neighborhood in one of the ritzy towns in my area, and the joke is if you don't work in insurance you're the attorney they deal with.",
            "score": 2,
            "author": "Pink_Karma_Power"
        },
        {
            "level": 0,
            "comment": "It doesn't. Letting the insurers have a profit motive leads to them trying to shirk the sickest people -- the ones who need them the most.",
            "score": 3,
            "author": "Scaulbielausis_Jim"
        },
        {
            "level": 0,
            "comment": "The U.S. is a great example to the rest of the world of where a pathological disgust towards public services will get you. Let's just hope the country collapses sooner rather than later so that Americans can see the errors of their ways and nobody else follows suit. \n\nSad thing is that the country wasn't always like this.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, I’d prefer to skip the collapse of the US.  I think that would be bad for everybody at this point. Not to mention I live here and fuck that.  I prefer that we look back in the Trump era and learn from that. We can put progressive representatives, senators and judges in office to go the other way and fix this without anybody getting hurt.  It’s just hard work.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alternatively, you should consider instead WHY medical care is so outrageously expensive in the United States. It’s not because of private medical care, it’s because of the continually skyrocketing prices of everyday medications, and life saving technology and machinery. Big Pharma is the reason, and it will only get worse from here.\nGetting rid of private healthcare will not fix this problem. Instead, our quality of healthcare will plummet. Sure, everyone will have access, but what will that do when the few good doctors, nurses, and other care technicians who are left after the financial purge are spread too thin to provide the quality of care we’re all used to?\nTake a look at what hospitals in “universal” healthcare countries actually look like. You may not be happy with what you find.",
            "score": 3,
            "author": "Waifu-Box"
        },
        {
            "level": 0,
            "comment": "You really want the government in charge of your healthcare? You, sir, are a moron",
            "score": 3,
            "author": "thingsandstuffsguy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd probably lose my job if new laws fixed healthcare, but if losing my job means more people have access to healthcare, then I'm OK with that.",
            "score": 4,
            "author": "cylonrobot",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s great. It’s possible I could lose my job if they reallocated a large portion of the DOD budget, but that’s another issue I’d like to see fixed. We could pay for childcare, make college free and pay for healthcare if we did something about that.",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I totally agree but it also worries me to think of government agencies and officials having that kind of money. Bottom line is none of it should cost as much as it does in my opinion",
            "score": 2,
            "author": "Smp-911"
        },
        {
            "level": 0,
            "comment": "I pay over $6000 a year and my husband pays $4000 and we haven't had a claim in 7 years. I needed my hip replaced and it cost me $300. I work for a huge hospital system in the US. The main reason I took this job was the insurance. My prescriptions are free and as long as I us our Urgent Care or Hospitals I have a total cost of $300. I was put on pandemic pay April 1st. Paid 70% and claimed unemployment for the 30%. Executives took a pay cut. We were told we wouldn't get our annual pay raise and quarterly bonuses were on hold. We were informed a few weeks ago that yearly raises would still happen and we were getting a bonus at the end of November. Even though my hourly pay is low compared to similar jobs I still feel secure in my job.",
            "score": 2,
            "author": "bcurler"
        },
        {
            "level": 0,
            "comment": "From what I've read you are from the US. Universal healthcare with an economy like yours (big companies and such) would be 100% possible and average person wouldn't necessarily have to pay more taxes. The military budget is insanely high, the rich barely pay any taxes. That money that people are paying for their insurance could easily go for universal health care that covers every medical expense. I've heard that there are people with serious illnesses who take their own lives because they can't afford treatment. It's so cruel, so hearthless and so profit-oriented to let people die like that.",
            "score": 2,
            "author": "sunnie_gl",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly, that’s what the rest of the developed world do and it works pretty well!",
            "score": 1,
            "author": "oscarandtav",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sure it does.  The alternative is paying a bunch of extra people that don’t do anything for you.  It’s simply the only sensible option unless you stand to make a bunch of money from the misery of others.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And boooom thousands of jobs by hardworking people who really just needed a job are gone",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The problem with your scenario is you end up replacing corporate fat cats with government bureaucrats. You have less control over bureaucrats than fat cats. Plus you lose any market incentives to get quality care at an affordable price. I admit that the current system is pretty far gone. Mostly I am trying to explain why you are running into people who are apposed to single pay or government type solutions.",
            "score": 2,
            "author": "mcduffsbane"
        },
        {
            "level": 0,
            "comment": "We pay more tax here in Australia n our medical is pretty much free",
            "score": 1,
            "author": "NeilZ303",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I know.  Wtf?",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People do complain that products like tobacco n alcohol are too highly taxed. Cost of living is dearer here than some places but then our minimum wage is much higher (roughly $18 an hour). Honestly I don't mind it and prefer paying more tax because I like taking our child into the hospital (because they hurt themselves) and walking out a couple of hours later not paying a thing. Or having a baby and my wife staying in hospital for a few days and us walking out not paying a thing. Or wanting to see a private GP instead of waiting at the hospital and it is only $38 a visit after Medicare.",
                            "score": 1,
                            "author": "NeilZ303"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Right there with you, this is actually how Europe supplies free health care to everyone. It’s not really free but hell, 100% worth it",
            "score": 1,
            "author": "Dreamtheory618"
        },
        {
            "level": 0,
            "comment": "*I came back because I thought of something else too lmao, I just hate how fucking selfish the US is. Some people say they don't want to pay more taxes for those benefits because they don't want to pay for other people's stuff..... Just what the fuck?? First of all yes you might be paying more but the benefits would way outdo that, and in the end you'll actually end up paying LESS... Also, if the taxes I pay benefit myself and other families so that they can also get the care they need, I can't see why that's such a horrible thing. I wish people cared about other people.",
            "score": 1,
            "author": "alyitaliano"
        }
    ]
}