{
    "id": "ucth2s",
    "score": 10788,
    "title": "My girlfriend made me cry today",
    "author": "dasnogud",
    "date": 1651027579.0,
    "url": "https://www.reddit.com/r/offmychest/comments/ucth2s",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m kind of insecure about my body. I’m not obese or horribly overweight but I know I could stand to lose a few pounds. I’ve been nervous about being naked in front of her, especially since she’s so stunning. \n\nThis is a pretty new relationship and we had sex for the first time today. It was amazing and we fell asleep in each other’s arms afterwards. When we woke up and it was time to get up and dressed she was just staring at me and my body. I asked her “what’s up?”\n\nShe got up and walked over to me, took my face in her hands, kissed me and said “you’re so beautiful.”\n\nI started crying grown man tears right there and she just kept kissing me all over my face. She guided me back down to the bed and let me lay my head on her and cry. She rubbed my back, wiped my tears, kissed my forehead, and just held me.\n\nAs a black man I don’t often feel like I’m allowed to have emotions and be vulnerable but she makes me feel so safe.\n\nMy girlfriend made me cry today and I’ve never felt more loved.",
    "comments": [
        {
            "level": 0,
            "comment": "When I just read the title I sighed\n\nNow I am happy to read that",
            "score": 649,
            "author": "SuckkMyRiddle",
            "replies": [
                {
                    "level": 1,
                    "comment": "SERIOUSLY! I totally thought it’d be something completely different. I was pleasantly mistaken that it took a different route than I was expecting. Loved it 😍",
                    "score": 152,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I got to the “you’re so beautiful” part and all the tension I had reading this story just left and I thought, oh thank Christ.",
                    "score": 49,
                    "author": "CordeliaGrace"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cherish her, there’s nothing like being loved for who you are. I’m so glad you have someone in your life to make you feel loved!",
            "score": 2517,
            "author": "malevolentrose",
            "replies": [
                {
                    "level": 1,
                    "comment": "She hates cooking. Can’t stand it. She will sooner starve herself before she cooks. It works out fine though because I happen to love cooking. I had a rough day at work last week and briefly mentioned to her on my lunch break that I didn’t feel like cooking so she should pick somewhere to order in from, she said okay.\n\nI came home from work to my favourite meal cooked BY HER because she wanted to cheer me up a little bit.",
                    "score": 2719,
                    "author": "dasnogud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay, man, marry her because someone this special doesn't come around that often.",
                            "score": 934,
                            "author": "CoffeeAndDachshunds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I plan to! If I can get her to agree, she’s not very traditional lol. Just another reason to love her.",
                                    "score": 842,
                                    "author": "dasnogud",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I have met only a couple folks that are THIS specific brand of Special, and I missed out on em both. Don't let yourself live in regret I say!",
                                    "score": 16,
                                    "author": "Skjold_out_here"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Now I‘m sitting in the subway on my way to work with tears in my eyes. So beautiful. Never forget to cherish her and make her feel as loved as she does you. \n\nPS: Marry her ASAP 🥰",
                            "score": 109,
                            "author": "cannolirule"
                        },
                        {
                            "level": 2,
                            "comment": "That’s true love if I’ve ever heard it! Congratulations on finding such a genuine and loving woman, you deserve it! I wish you two nothing but the best",
                            "score": 327,
                            "author": "malevolentrose"
                        },
                        {
                            "level": 2,
                            "comment": "aww i wish you guys the best",
                            "score": 38,
                            "author": "endthe_suffering"
                        },
                        {
                            "level": 2,
                            "comment": "just propose to her, im begging you. this woman loves you, you two deserve this, please marry her",
                            "score": 79,
                            "author": "edensrotting",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In about a year and a half since she doesn’t want to be married before she’s minimum 25 years old",
                                    "score": 116,
                                    "author": "dasnogud",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that's wise! are you both so young?",
                                            "score": 40,
                                            "author": "agent-99",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She’s 24 I’m 28",
                                                    "score": 55,
                                                    "author": "dasnogud",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "ahh yes, give it about 4 years. in a couple of years you could always give her a \"promise ring\" if you're into that kind of thing",
                                                            "score": 39,
                                                            "author": "agent-99"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As a fellow non-traditional type, no need to rush into marriage just because you found someone lovely. Just keep doing whatever feels right for you two. I hope you keep making each other happy! Thanks for sharing your wholesome story.",
                                            "score": 54,
                                            "author": "windandthewaves"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Marriage isn’t her “ultimate” thing at the moment, what makes her feel loved? She sounds like someone who knows how to make people feel loved. Make sure she feels loved back, even if she says she doesn’t need anything",
                                            "score": 16,
                                            "author": "NEDsaidIt",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She sounds very smart. Enjoy each other and your time together.  Remember this feeling and don't rush into anything.  Simmer in this time",
                                            "score": 5,
                                            "author": "AtmosphereFar2509"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ok, your future wife sounds amazing 😁",
                            "score": 61,
                            "author": "ShadyGreenForest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was about to say, when you meet your person, you just *know*. You two will cherish each other in a way no one else can.",
                                    "score": 4,
                                    "author": "snowmaninheat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wow, this post just gets better and better. I’m about to cry.",
                            "score": 19,
                            "author": "EricValzArroyo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I admit, I am crying. This is so beautiful",
                                    "score": 12,
                                    "author": "Nanalily"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Who’s cutting onions 😭\n\nThis is the sweetest thing I have read. She is precious and loves you very much!",
                            "score": 14,
                            "author": "Hungryshorty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "IKR? This really triggered my allergies. 🥹",
                                    "score": 3,
                                    "author": "shellymaff"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Put a ring on it",
                            "score": 8,
                            "author": "DCChilling610"
                        },
                        {
                            "level": 2,
                            "comment": "dasyesgood",
                            "score": 3,
                            "author": "Corny-13"
                        },
                        {
                            "level": 2,
                            "comment": "Wow she sounds AMAZING!! I hope I can find someone that’s a fit for me, like she is for you!",
                            "score": 3,
                            "author": "Show_me_titties_plz"
                        },
                        {
                            "level": 2,
                            "comment": "Oh my God 🥺🥰",
                            "score": 3,
                            "author": "Traditional_Front637"
                        },
                        {
                            "level": 2,
                            "comment": "I also don’t like cooking but my husband does. I feel like I hit the jackpot 🎰 We aren’t very traditional in many other ways and I love that about us! Happy for you man 🥹",
                            "score": 3,
                            "author": "thebearjew666"
                        },
                        {
                            "level": 2,
                            "comment": "You found yourself a true gem.  I'm really happy for you 😊",
                            "score": 2,
                            "author": "bhabel814"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love love! I can feel your happiness",
            "score": 341,
            "author": "SnooRecipes5643",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’s so amazing. So kind and intelligent and funny. Just a truly beautiful person, inside and out. She’s not perfect but my god, she blows my mind.",
                    "score": 290,
                    "author": "dasnogud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perfection is overrated uninteresting nonsense",
                            "score": 62,
                            "author": "I_BK_Nightmare"
                        },
                        {
                            "level": 2,
                            "comment": "Nobody's perfect but she's perfect for you &amp; that's what matters ♥",
                            "score": 16,
                            "author": "Quirky_Reindeer_8899"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thats beautiful your post made me 😢 in a good way, hold onto her 😃",
            "score": 95,
            "author": "butterfly0848"
        },
        {
            "level": 0,
            "comment": "OMG I have tears in my eyes from reading this! Your girlfriend sounds like an angel! And you are absolutely allowed to cry. You are allowed to have emotions, because you are human. Keep being your awesome self, and hold on to that girl of yours. She sounds amazing! ️ ❤️",
            "score": 83,
            "author": "tiffanygrayslife",
            "replies": [
                {
                    "level": 1,
                    "comment": "I call her an angel on a regular basis and she says, “don’t be putting me on pedestal, I want to make this last a long time”",
                    "score": 91,
                    "author": "dasnogud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God bless her, and God bless you too. I really hope this relationship lasts forever for you guys.",
                            "score": 28,
                            "author": "tiffanygrayslife"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God bless you both. This is an amazing place to be.",
            "score": 41,
            "author": "Conor_88"
        },
        {
            "level": 0,
            "comment": "My eyes watered reading this. People like her are wonderful.\nI’m glad you found each other !",
            "score": 32,
            "author": "ixelspixels"
        },
        {
            "level": 0,
            "comment": "I get this. I’m married to a beautiful woman who’s invariably the hottest woman I’ve ever met. Even my friends told me I’m punching (I need new friends). Gained a few lbs (and lost them again) during Covid. But the way she looks at me .. man.",
            "score": 28,
            "author": "partaylikearussian"
        },
        {
            "level": 0,
            "comment": "It's 2:58AM where I'm at typing this, I recently found someone that makes me feel like I could begin to maybe feel safe doing what you did, and all I can say is reading your post melted my heart. I know how you feel, and it's beyond a liberating feeling to be able to experience and embrace what you did. I'm so beyond happy for you as another man, I'm Brazilian but people constantly think I'll constantly be this level headed male model of mentality. But being able to just be appreciated and feel vulnerable yet loved all the same? It almost becomes and alien concept, but to fully embrace and experience a moment like that is life changing. I'll say it again, I am so happy for you man. I think you very well might have yourself the one. I hope you too grow old together.",
            "score": 28,
            "author": "Prawnboii"
        },
        {
            "level": 0,
            "comment": "This is so damn wholesome 🥹",
            "score": 58,
            "author": "Jayciflash"
        },
        {
            "level": 0,
            "comment": "LITERALLY my heart just bursted into butterflies",
            "score": 13,
            "author": "Butterfly_anal"
        },
        {
            "level": 0,
            "comment": "Fuck dude good for you. Hold on to her and never let her go",
            "score": 14,
            "author": "VMrSoloDolo",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s the plan!",
                    "score": 13,
                    "author": "dasnogud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who's cutting onions?",
            "score": 11,
            "author": "velocity_ken",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wish I had a wholesome award to give this, but I'm glad that you've found someone who you can be open and vulnerable with, and feel supported and safe doing so.",
            "score": 38,
            "author": "highendhoax"
        },
        {
            "level": 0,
            "comment": "So sweet.. I tell my man he’s beautiful too..above all else it means she truly loves you, cherish her and love her hard!! I wish you both all the happiness in the world.",
            "score": 12,
            "author": "southernruby"
        },
        {
            "level": 0,
            "comment": "Thats pure love. Kudos to you for showing your emotions. Beautiful",
            "score": 23,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is the most wonderful thing I have ever read.. 😭",
            "score": 8,
            "author": "snuffleupagamer"
        },
        {
            "level": 0,
            "comment": "Awww, you two are adorable. I'm so glad you found someone so sweet. I doubt bodyimage issues are going to just disappear over night, but I do wish you the best in working on them. It seems like you got someone wonderful to support you now at least :)",
            "score": 8,
            "author": "RaspberryPie-"
        },
        {
            "level": 0,
            "comment": "I felt this, on such a high level, growing up where I grew up I feel like you just always have to be hard, 24-7 that’s what’s pushed on you by grown ups, parents, woman, peers, etc…, Even all my ex’s pushed that agenda, fast forward to the relationship I’m in now and have been in for the last 2 years and 6 months I finally met someone who allows me to be me at my most vulnerable state, so strange to allow yourself to be “weak” in front of someone who’s opinion you care about so much but so fuckin beautiful, glad you had that experience pimp💯",
            "score": 7,
            "author": "B4l_ssmuls",
            "replies": [
                {
                    "level": 1,
                    "comment": "My girl says that it’s a privilege to have someone trust you so deeply and that she’s honoured to have earned mine. She thanked me for being open with her and told me that there is so much strength in emotion. Nobody had ever said anything like that to me before and it just made me bawl even more. I’m so thankful for her.",
                    "score": 13,
                    "author": "dasnogud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "From one to another, get more black male friends that show hints of wanting to be vulnerable. I cherish the ones that I have. Being tough all the time is exhausting.",
            "score": 7,
            "author": "ThrowAwaih",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You made me cry too bro❤️",
            "score": 5,
            "author": "ICastPunch"
        },
        {
            "level": 0,
            "comment": "no matter your race. you are a man. you are ALWAYS allowed to have emotions, you have ALL the rights of the world to show your emotions. don't let the internet make you think otherwise.",
            "score": 6,
            "author": "LightningSpearwoman"
        },
        {
            "level": 0,
            "comment": "This is SO SWEET. I’m so happy for you :) made me so happy to read",
            "score": 5,
            "author": "electricjeel"
        },
        {
            "level": 0,
            "comment": "Dude, you made me cry too, lol.\nThis went in such a different direction than I was expecting. This is so beautiful, cherish each other.",
            "score": 4,
            "author": "wise_owl68"
        },
        {
            "level": 0,
            "comment": "Enjoy it man had the same thing happen with my girl and it really makes you appreciate what you have.",
            "score": 13,
            "author": "Resident_Cow6752"
        },
        {
            "level": 0,
            "comment": "I love this so much.",
            "score": 3,
            "author": "2blakez"
        },
        {
            "level": 0,
            "comment": "I’m not saying you have to marry her, but like also marry her. 🥰",
            "score": 4,
            "author": "Ayde-Aitch-Dee"
        },
        {
            "level": 0,
            "comment": "this is the same way i feel about my bf, there are times when i just have to look back and just admire him, smile to myself and think about how lucky i am, makes me so happy",
            "score": 5,
            "author": "midsommerseye"
        },
        {
            "level": 0,
            "comment": "Dude I just felt feelings I never thought I had reading this post lmao.  You're gonna make me cry, how dare you restore my faith in humanity? The audacity. I just read the title and saw the first few words and was ready to bash a girl online and here I am now smiling from ear to ear like an idiot. As a girl, things like these remind me how stupid I can be when it comes to men and how most of the time I don't really know what's going on below all that exterior. Idk. I wish you the best man 👊🏾",
            "score": 5,
            "author": "SnooGoats2555"
        },
        {
            "level": 0,
            "comment": "It is at that moment you know you've made it.  You know that she loves you not for your body but who you are as a person - in essence, you are a beautiful human being. \n\nShe sounds like a keeper.",
            "score": 5,
            "author": "Questn4Lyfe"
        },
        {
            "level": 0,
            "comment": "Wow this took a wholesome turn 💜",
            "score": 4,
            "author": "Zealousideal-Wheel46"
        },
        {
            "level": 0,
            "comment": "Damn. You almost had me crying there for a second! She sounds amazing. And you ARE beautiful, dude. Never forget it.\n\nMy wife is the same way about my physical appearance and my personality. Only loving and supportive, warm and sensitive. When school or work has me stressed to the point of losing it, she selflessly comforts me. I came from a long line of abusive relationships so it gets me right in the chest every time she shows unconditional love. Like all of sudden there’s this little kid inside me that’s finally at peace and if I’m not careful I can start bawling my eyes out. I knew from the day we met that I was going to marry her and I want her to feel as loved as she makes me feel. Your story is another case that shows how men are trained through culture to accept life without praise, emotional support, or acceptance. It’s toxic how normal it is.",
            "score": 3,
            "author": "TheYewnahcorn"
        },
        {
            "level": 0,
            "comment": "That’s so lovely😭",
            "score": 10,
            "author": "landminephoenix"
        },
        {
            "level": 0,
            "comment": "This was just the wholesome type of content I needed",
            "score": 6,
            "author": "Bruhlolz"
        },
        {
            "level": 0,
            "comment": "This was so nice to read have a great day champ",
            "score": 3,
            "author": "cristiancasty"
        },
        {
            "level": 0,
            "comment": "Gosh, and here I am telling my boyfriend to lay off cheese cause he’s starting to look like the Michelin man.",
            "score": 3,
            "author": "mkeyboi"
        },
        {
            "level": 0,
            "comment": "Man, I just got back in the dating game and would describe my body issues the same way you did. I just started seeing this woman that I can only explain as way out of my league and she said something similar to me and I probably had a smile on my face for the rest of the day.",
            "score": 3,
            "author": "NyetRifleIsFine47"
        },
        {
            "level": 0,
            "comment": "this is a banger post, OP",
            "score": 3,
            "author": "GoodJoeBR2049"
        },
        {
            "level": 0,
            "comment": "Keep her safe.",
            "score": 3,
            "author": "contrabandboi123"
        },
        {
            "level": 0,
            "comment": "I’m so happy for you",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Sounds like a keeper!",
            "score": 3,
            "author": "ScaryPotterDied"
        },
        {
            "level": 0,
            "comment": "I was ready to throw hands until I read the post\n\nBest of luck to both of you👍",
            "score": 3,
            "author": "MasterYehuda816"
        },
        {
            "level": 0,
            "comment": "Love to see it! Treat her well and I’m sure you’ll get the world in return. Congrats and all the best!!",
            "score": 3,
            "author": "Khasse318"
        },
        {
            "level": 0,
            "comment": "Good for you man, you are beautiful and it sounds like you have a great partner. Thanks for sharing this uplifting stuff! Happy for you bud",
            "score": 3,
            "author": "moonweasel906"
        },
        {
            "level": 0,
            "comment": "That's the real deal right there... love is supposed to make you feel just like that. Marry her.",
            "score": 3,
            "author": "vagittarius-szn"
        },
        {
            "level": 0,
            "comment": "Now I’m crying 😭 ! This is so sweet",
            "score": 3,
            "author": "ellalop26"
        },
        {
            "level": 0,
            "comment": "this is the cutest shit I’ve read today oh my god",
            "score": 3,
            "author": "abagoflettuce1"
        },
        {
            "level": 0,
            "comment": "Finally something heartwarming. You've got a good girlfriend, man!",
            "score": 3,
            "author": "PromotePajamaPants"
        },
        {
            "level": 0,
            "comment": "This is so damned sweet I couldn't be more happy for you. ❤",
            "score": 3,
            "author": "retnuhsbmoc"
        },
        {
            "level": 0,
            "comment": "Hey man, as a bigger guy myself,(always have had a bit of a dad bod-20 pounds overweight),that has dated alot of really attractive women I can say it's in your head. Don't be shy, just be confident, and if you aren't confident just fake it. Confidence is sexier than having a chiseled 6 pack. I know I sound like I am bullshitting you. I have dated chicks WAY WAY WAY THE FUCK out of my league and when I figured out how to fake confidence I never looked back. Now I don't have to fake it 😉. Your woman sounds awesome, best of luck to you guys bro!",
            "score": 3,
            "author": "Yak_Mehoff"
        },
        {
            "level": 0,
            "comment": "So sweet",
            "score": 2,
            "author": "crnberryjuice"
        },
        {
            "level": 0,
            "comment": "This is beautiful and I’m so happy for you OP. Thank you for sharing!",
            "score": 2,
            "author": "loss_of_truth1234"
        },
        {
            "level": 0,
            "comment": "Happy for you, that's awesome :)",
            "score": 2,
            "author": "Boardwalks"
        },
        {
            "level": 0,
            "comment": "this is so sweet. im happy for you!",
            "score": 2,
            "author": "rengokyo"
        },
        {
            "level": 0,
            "comment": "Man I know you already are, but keep this relationship goin lol. There aren't many gems like her out there frfr, she's a rare keeper.",
            "score": 2,
            "author": "-ItsCrazyOutHere-"
        },
        {
            "level": 0,
            "comment": "That's how they get to you, man. I am happy for you!",
            "score": 2,
            "author": "ihave1000beaches"
        },
        {
            "level": 0,
            "comment": "If I were at your place I would cry too. Pls protect her at all costs. 🥺🥺",
            "score": 2,
            "author": "ayushi666"
        },
        {
            "level": 0,
            "comment": "Very happy for you OP",
            "score": 2,
            "author": "Isitjustmedownhere"
        },
        {
            "level": 0,
            "comment": "happy life ^(reeee)",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Beautiful.",
            "score": 2,
            "author": "jokenaround"
        },
        {
            "level": 0,
            "comment": "Ash I’m so happy with how this post turned out! Congrats on finding a keeper!",
            "score": 2,
            "author": "sycamore_years"
        },
        {
            "level": 0,
            "comment": "Love this. She sounds like a keeper. Enjoy 😉",
            "score": 2,
            "author": "Remarkable-House-729"
        },
        {
            "level": 0,
            "comment": "Awesome, reminds me of my girlfriend too, she is always boosting me up, yay for us",
            "score": 2,
            "author": "celticthugger"
        },
        {
            "level": 0,
            "comment": "That's so sweet🥰🥰🥰",
            "score": 2,
            "author": "Voilent_Bunny"
        },
        {
            "level": 0,
            "comment": "This made me cry. What a beautiful beautiful moment for you both. Thankyou for sharing such vulnerability and love. Bless you both.",
            "score": 2,
            "author": "Zestyclose-Edge1374"
        },
        {
            "level": 0,
            "comment": "bless you and bless her &lt;3",
            "score": 2,
            "author": "Lazy-Tower-5543"
        },
        {
            "level": 0,
            "comment": "This is a genuinely awesome post.",
            "score": 2,
            "author": "joebuck125"
        },
        {
            "level": 0,
            "comment": "This is so beautiful bro. She sounds awesome!",
            "score": 2,
            "author": "shrekandmorty"
        },
        {
            "level": 0,
            "comment": "\"They had us in the first half, not gonna lie\"",
            "score": 2,
            "author": "GoodGamer72"
        },
        {
            "level": 0,
            "comment": "this made me cry, hold onto her! i’d do anything to be able to do that again with my ex",
            "score": 2,
            "author": "hewhospendsit"
        },
        {
            "level": 0,
            "comment": "Aaaah, you're gonna make me happy cry, op. I'm glad you have such an amazing gf. Let those tears flow!",
            "score": 2,
            "author": "dai-the-flu"
        },
        {
            "level": 0,
            "comment": "Oh this is so heartwarming 😍",
            "score": 2,
            "author": "MissHollySmart"
        },
        {
            "level": 0,
            "comment": "This is so cute",
            "score": 2,
            "author": "nayely2cool"
        },
        {
            "level": 0,
            "comment": "Obligatory \"Had us in the first half not gonna lie\"\n\n&amp;#x200B;\n\nand I hope you and your beloved live long and prosper.",
            "score": 2,
            "author": "ILNSMIWTDFH"
        },
        {
            "level": 0,
            "comment": "Damn. Never let her go.",
            "score": 2,
            "author": "Full-Function-8427"
        },
        {
            "level": 0,
            "comment": "I nearly cried reading this.  That was truly a beautiful moment.",
            "score": 2,
            "author": "JtheCook1980"
        },
        {
            "level": 0,
            "comment": "For most adult women, their love for you comes from what you have in your heart and mind. The body is distant. Sure many of them like a “fit” body but it is not a deal breaker. She seems to care for you so keep doing what you are doing,  listen to her needs, and you will be fine. Best of luck to you both.",
            "score": 2,
            "author": "MrDrDad"
        },
        {
            "level": 0,
            "comment": "Dude, you got to marry her fr",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s the plan, if she’ll have me haha",
                    "score": 2,
                    "author": "dasnogud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She loves you with all her heart ♥️ Congratulations, you deserve to feel wonderful and vulnerable!",
            "score": 2,
            "author": "JelloisYummy"
        },
        {
            "level": 0,
            "comment": "You are lucky king... sit back , relax and enjoy your love life",
            "score": 2,
            "author": "Iam-Locksmith123"
        },
        {
            "level": 0,
            "comment": "YES! \n\n\nI love this post so much. I’m so happy that you found someone who sees you for you, and loves it. It’s such a powerful emotion, when someone not only *really* sees you/accepts you, but celebrates you. \n\n\nThank you for sharing! ☺️",
            "score": 2,
            "author": "The_New_Spagora"
        },
        {
            "level": 0,
            "comment": "This is. So. Sweet.",
            "score": 2,
            "author": "nopiepoopi"
        },
        {
            "level": 0,
            "comment": "I love this so much!",
            "score": 2,
            "author": "jturner2424"
        },
        {
            "level": 0,
            "comment": "Aww man, about to make me cry too! What an absolute gem.",
            "score": 2,
            "author": "shrecko28"
        },
        {
            "level": 0,
            "comment": "I got a heavy cold (not covid) and need to rest alone at home bc my bf needs to go working, reading this fills my heart and I am pretty sure it sooths my symptoms a bit also, thanks for sharing this super cute story❤️",
            "score": 2,
            "author": "Ian80413"
        },
        {
            "level": 0,
            "comment": "Lucky man...",
            "score": 2,
            "author": "mr-chickenfoot"
        },
        {
            "level": 0,
            "comment": "Wife her. She’s a beautiful soul.",
            "score": 2,
            "author": "myassgotsuspended"
        },
        {
            "level": 0,
            "comment": "i was preparing to throw hands, but this is so sweet! i wish you both all the happiness in the world:)",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Im glad you were able to feel so loved and accepted in that moment. As a man, you are absolutely allowed to be vulnerable and experience emotions. Don't let anyone tell you otherwise",
            "score": 2,
            "author": "Mmaibl1"
        },
        {
            "level": 0,
            "comment": "Dont take that love for granted.  Women give their heart and soul and love hard. I am one of them and my love, my compassion, my nurturing was taken for granted. Make sure you give back and show her you appreciate that love by being trustworthy and loyal",
            "score": 2,
            "author": "Acuramdx1"
        },
        {
            "level": 0,
            "comment": "There is a name for a girl like that where I come from. Keeper.",
            "score": 2,
            "author": "craigeroni"
        },
        {
            "level": 0,
            "comment": "That's true love right there. I wish I could find someone who loves me half as much as your gf loves you.",
            "score": 2,
            "author": "chupahcobbler"
        },
        {
            "level": 0,
            "comment": "Well Damn! i cried too while smiling!",
            "score": 2,
            "author": "Berarru"
        },
        {
            "level": 0,
            "comment": "This is beautiful, man.",
            "score": 2,
            "author": "DifferenceOrdinary98"
        },
        {
            "level": 0,
            "comment": "I wish yall the best man",
            "score": 2,
            "author": "nitekittenblue"
        },
        {
            "level": 0,
            "comment": "Whew. I'm glad this was a positive post. Look, I remember having a relationship with a guy who could stand to drop a few pounds too. But he was so smart, kind, and with a handsome face, those pounds ain't mean sh*t honestly. He was so attractive to me. \n\n\nIt's time to live in the present. Yes, work on your body but understand that how you view yourself is not how others see you.\n\nJust saying.\n\nYeah and marry her!",
            "score": 2,
            "author": "Complex_East_5676"
        },
        {
            "level": 0,
            "comment": "You had me at first half not gonna lie..",
            "score": 2,
            "author": "FuckGerontocracy"
        },
        {
            "level": 0,
            "comment": "Had us in the first half, not gonna lie\n\nBut in all seriousness, hold onto that relationship! Even better, return the compliments! Let her know how good it felt for her to tell you you were beautiful. Communication is key, don’t let that slip away! If you can create a relationship based on honest, uplifting communication, that is a relationship that can last.",
            "score": 2,
            "author": "Nazgul417"
        },
        {
            "level": 0,
            "comment": "Broski’s gf made him…now broskis making us cry…\n\nI’m not crying!",
            "score": 2,
            "author": "YetAnotherMorty"
        },
        {
            "level": 0,
            "comment": "Aww happy for you to find that kind of peace and love and care 🥺❤️ I sti believe this exists, I hope I can find mine",
            "score": 2,
            "author": "marjem26"
        },
        {
            "level": 0,
            "comment": "gosh this is the cutest 🥺❤️",
            "score": 2,
            "author": "wizardofazkaStan"
        },
        {
            "level": 0,
            "comment": "I was serious going to ask if this was my boyfriend because this happened to us. You found your safe space and unlocked a core memory for you both. I’m happy for you, and if you feel insecure take baby steps to lose your weight. Rome wasn’t built in a day and neither is a flat stomach.",
            "score": 2,
            "author": "jsloan92"
        },
        {
            "level": 0,
            "comment": "I came here expecting to get really mad at a shitty gf but now I'm nearly crying. Really really happy you found someone who can make you feel this secure and loved, you deserve it.",
            "score": 2,
            "author": "calamari6819"
        },
        {
            "level": 0,
            "comment": "This is so wonderful. I'm glad you found each other!",
            "score": 2,
            "author": "THE_ORANGE_TRAITOR"
        },
        {
            "level": 0,
            "comment": "Now it's YOUR TURN to make HER cry, brother!\nTell her you've been waitingggg- for a girl like her- to come intoooo your liiiife.",
            "score": 2,
            "author": "SirYonkerz"
        },
        {
            "level": 0,
            "comment": "If that genie popped up in front of me with those 3 wishes, I hope I'd remember to wish that every human being could feel so loved and safe.",
            "score": 2,
            "author": "geekitude"
        },
        {
            "level": 0,
            "comment": "That sounds beautiful. I'm so happy for you two. Congrats.",
            "score": 2,
            "author": "jen_a_licious"
        },
        {
            "level": 0,
            "comment": "That story just almost made me cry. That's amazing! I wish I could feel that way. I am not a super confident person either and come from a background of being abused. It has absolutely hindered the way I feel and the way I think people look at me. It's been 10 years in my current relationship and sadly I still don't feel this level of vulnerability.",
            "score": 2,
            "author": "Deadweightdanger_"
        },
        {
            "level": 0,
            "comment": "May I ask how you two met?",
            "score": 2,
            "author": "CCRYSTALL"
        },
        {
            "level": 0,
            "comment": "Far too often I've heard men say they've been shamed for their emotions and tears and it breaks my heart. Bless you both :) this made my day better",
            "score": 2,
            "author": "laskykvet44"
        },
        {
            "level": 0,
            "comment": "Honestly, her reaction is beautiful too. You did something right to bring that part out of her. Yall sound like the universe is working to bring you both together.",
            "score": 2,
            "author": "Junglepass"
        },
        {
            "level": 0,
            "comment": "that's so cute, she's definitely the one",
            "score": 2,
            "author": "belosca"
        },
        {
            "level": 0,
            "comment": "Damn!! Love, trust and intimacy are sexy. Keep and cherish this lady.",
            "score": 2,
            "author": "CosmeFulanitx"
        },
        {
            "level": 0,
            "comment": "Bro, never let this go. This made me well up, super happy for you.",
            "score": 2,
            "author": "LindemannO"
        },
        {
            "level": 0,
            "comment": "Aw cheers man for finding such a gem! Not everyone  can love you for who you are. Huhu you made this not so grown up woman cry tears of joy😭",
            "score": 2,
            "author": "Huge_Combination_637"
        },
        {
            "level": 0,
            "comment": "She sounds incredible, and I'm so glad she made you feel so loved. It's a rare thing ❤️",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I want a love like this!!!",
            "score": 2,
            "author": "petals4u2"
        },
        {
            "level": 0,
            "comment": "This is so wholesome.  I'm so glad you have somebody like this in your life.",
            "score": 2,
            "author": "matt314159"
        },
        {
            "level": 0,
            "comment": "if a girl ever wanted me someday. i think i wouldn't hold it and will start sobbing",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This made ME cry!!!! Your girlfriend sounds like an amazing person! I am so very happy you found her, and you feel so loved by her.",
            "score": 2,
            "author": "chels0493"
        },
        {
            "level": 0,
            "comment": "Awww! I love this so much! I was worried this was going to take a different route and I’m so glad they were happy tears! I hope you both have a beautiful, happy life together (if that’s what you want)! 😍",
            "score": 2,
            "author": "_witch-bitch_"
        },
        {
            "level": 0,
            "comment": "Bro you're motherfuckinf beautiful and you've got something real special between you two",
            "score": 2,
            "author": "riffsix"
        },
        {
            "level": 0,
            "comment": "Good for you, man. That’s wonderful.",
            "score": 2,
            "author": "Backwardsunday"
        },
        {
            "level": 0,
            "comment": "Oh to be loved for all your entirety. Happy for you! Manifesting to have someone love me this way too in the near future &lt;33",
            "score": 2,
            "author": "pingumochi"
        },
        {
            "level": 0,
            "comment": "Based on your title and the first paragraph I was ready to bonk someone, but now I bonk only myself for prejudice",
            "score": 2,
            "author": "4_non_blondes"
        },
        {
            "level": 0,
            "comment": "Wife her immediately she’s the one bro ❤️\nSo few people like her are left in this world and you are so lucky to have her and I bet she feels the same way ❤️",
            "score": 2,
            "author": "Laila_Hale"
        },
        {
            "level": 0,
            "comment": "Awww that's so beautiful!! She's a damn keeper for sure!! ND that black man crying stereotype needs to stop..it's annoying now. Everyone crys! Even MEN.... well not everyone if they are emotionless. Men aren't invincible.",
            "score": 2,
            "author": "Likklebit91"
        },
        {
            "level": 0,
            "comment": "That's so sweet I almost cried just reading it. I wish you two the best future together!",
            "score": 2,
            "author": "GenericNerdGirl"
        },
        {
            "level": 0,
            "comment": "Fuck this hit me, as someone with a noticeable physical deformity in my arms/hands, I dream of this. I'd def cry too. Thats awesome dude, now don't fuck it up! LOL",
            "score": 2,
            "author": "Mnigma4"
        },
        {
            "level": 0,
            "comment": "I'm really happy for you dude, glad you found someone who loves you for who you are!",
            "score": 2,
            "author": "NoirTheMisfit"
        },
        {
            "level": 0,
            "comment": "man i thought this was gonna go a horrible way but I'm glad it didn't. Your gf seems lovely. Congrats mate!",
            "score": 2,
            "author": "fdunjoseph"
        },
        {
            "level": 0,
            "comment": "Oh my goodness this is so sweet",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I remember the moment I cried after love making with my husband, then boyfriend at the time. He accepted me unconditionally and I have learned to do the same with him from him.\n\nIt's beautiful, isn't it?",
            "score": 2,
            "author": "hdmx539"
        },
        {
            "level": 0,
            "comment": "Bless you both.",
            "score": 2,
            "author": "kirbywantanabe"
        },
        {
            "level": 0,
            "comment": "The peak of male fantasy right there (not saying that I think it’s fake or couldn’t happen).",
            "score": 2,
            "author": "GreaseyMunchkin"
        },
        {
            "level": 0,
            "comment": "Wow she's sounds like the one! How did you two meet?",
            "score": 2,
            "author": "Jurassic___Bark"
        },
        {
            "level": 0,
            "comment": "As a fellow black man, I can relate to not showing too much vulnerability when it comes to something like feelings. Like I've been told in my life by loved one's it's okay to feel weakness, I'm here to pass it onto you because it's part of being human. Unless you're the Terminator, hiding these emotions will lead to bottling up, which leads to things like depression, or so much built up rage, you'll snap on an innocent trying to rip off the bottle cap. I can speak from experience that it never ends well in these circumstances. I'm glad you found someone that can bring these feelings out of you as someone does for me. Best of luck from now on, friend ☺",
            "score": 2,
            "author": "FatallyStruck"
        },
        {
            "level": 0,
            "comment": "I was so prepared to be mad from reading the title, but damn. That is beautiful! Happy for you both!",
            "score": 2,
            "author": "Pie_Crown"
        },
        {
            "level": 0,
            "comment": "This is beautiful. I’m glad you found her",
            "score": 2,
            "author": "Blueskyblonde"
        },
        {
            "level": 0,
            "comment": "I'm so happy for you. Wishing you and your girlfriend the absolute best. You sound like a beautiful soul, OP.",
            "score": 2,
            "author": "CivilWhiskers"
        },
        {
            "level": 0,
            "comment": "❤️",
            "score": 2,
            "author": "eyesorfire"
        },
        {
            "level": 0,
            "comment": "Cant believe this actually exists, how do people come across people like this",
            "score": 2,
            "author": "flishtide",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was so scared that this was something abusive but this made my day. Love that women and do everything in your power to keep her it sounds like true love",
            "score": 2,
            "author": "IkVerveel_me"
        },
        {
            "level": 0,
            "comment": "This really made me smile",
            "score": 2,
            "author": "ornerydelirium"
        },
        {
            "level": 0,
            "comment": "This is so goddamn lovely 🥰",
            "score": 2,
            "author": "rainbowbasil2"
        },
        {
            "level": 0,
            "comment": "Man, this is so sad and sweet. I think I overwhelmed my boyfriend in the first few months of our relationship because. He was also slightly insecure about his looks. He told me he'd never been complimented in ways that I complimented him. And it was hard for me to not overwhelm him with those compliments. But I sincerely think he's the most beautiful man I've ever laid eyes on. His shoulders. His stomach is my favorite part of him. Besides, you know the other part of him 😏.\n\nHis eyes, his face, everything about him is so beautiful and looking at him in the mornings when the sunlight streamed in after a night together was\n\n...just it made me want to cry.\n\n\nMen need compliments too, and they need recognition for how they look because. Too many times I've heard men say I've never been treated this way. I've never been told this. And I told him that I really liked his shoulders and his hands were really nice....He did tell me one point that it was overwhelming and that I needed to stop a little bit, but I couldn't help it. You know, he's just beautiful.\n\n\nEdited to add I did tone it down and try to keep it at a minimum so he's not getting bombarded. Buts he's so beautiful inside and out. And so are you OP.",
            "score": 2,
            "author": "Traditional_Front637"
        },
        {
            "level": 0,
            "comment": "I love this sooo much 🥹",
            "score": 2,
            "author": "elletee95"
        },
        {
            "level": 0,
            "comment": "She is the one for you. Treat her right",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Aww damn dude, this post has me tearing up over here. Learn to be kind to yourself, and while you may not find your own body attractive, others will love it immensely. Also, you are not just your body and it does not define your value! Im so happy that you have such a loving partner.",
            "score": 2,
            "author": "Hxrizxn"
        },
        {
            "level": 0,
            "comment": "This is so sweet 😭",
            "score": 2,
            "author": "Brilliant-Chip363"
        },
        {
            "level": 0,
            "comment": "This is just one of the most beautiful posts i’ve ever read 🥺🥺😍\n\nI got goosebumps all over me now…",
            "score": 2,
            "author": "Investigator420"
        },
        {
            "level": 0,
            "comment": "From the title I was expecting something bad but you go King!!!!!",
            "score": 2,
            "author": "Remote-Relief7258"
        },
        {
            "level": 0,
            "comment": "That’s love. So happy you found a teammate that sees you. Beautiful.",
            "score": 2,
            "author": "Dreadifare"
        },
        {
            "level": 0,
            "comment": "Also I didn’t know I was going to cry this morning but here we clearly all are and thank you for sharing",
            "score": 2,
            "author": "Dreadifare"
        },
        {
            "level": 0,
            "comment": "I never expect these posts to be positive.\n\nI’m so happy for you, man. It’s hard to find someone that doesn’t expect you to play a role constantly. You deserve to be able to cry. You deserve to feel kindness and compassion. I love to see stuff like this.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Awh this is so sweet! 😍 best of luck to you two!",
            "score": 2,
            "author": "thatsnotme133"
        },
        {
            "level": 0,
            "comment": "What's up New York Time Bestseller 🕶️",
            "score": 2,
            "author": "chacaloou"
        },
        {
            "level": 0,
            "comment": "This is such a gorgeous story, you’ve got you’re self a keeper!",
            "score": 2,
            "author": "TunaFishOil"
        },
        {
            "level": 0,
            "comment": "You deserve to feel loved and safe while being vulnerable. This is a great thing to read.",
            "score": 2,
            "author": "NeonWarcry"
        }
    ]
}