{
    "id": "vjq6tb",
    "score": 14958,
    "title": "Fuck the USA",
    "author": "clarabear10123",
    "date": 1656082159.0,
    "url": "https://www.reddit.com/r/offmychest/comments/vjq6tb",
    "media_urls": [],
    "other_urls": [
        "https://en.m.wikipedia.org/wiki/Irish_Women%27s_Liberation_Movement)"
    ],
    "postText": "Fuck it. I’m tired of having fewer rights than corpses. Than guns. Than old ass men that have no right to have their shriveled hands wrapped around my uterus. I feel like I’m being strangled by my own Fallopian tubes. I want all of them to feel pain and suffering. I wish nothing but misery on anyone celebrating the overturn of Roe v. Wade. I can’t wait to move. And fuck anyone who says, “bUt YoUr NaTiOnAl PrIdE! It’S wOrSe OtHeR pLaCeS.” Fuck you, too.\n\nEdit: \n\nTo those of you who offered support: thank you so much. I am reading through and you have given me hope!\n\nTo those who suggest I move or die: I’m trying. Believe me. Enjoy the brain drain that is inevitable. Have the life you’ve earned. I hope your mothers, sisters, daughters, wives, etc see the hatred you are spewing and realize you would rather have your dick wet than them safe!\n\n[This](https://en.m.wikipedia.org/wiki/Irish_Women%27s_Liberation_Movement) is my suggestion: all women and people with uteruses should just… stop. Everything. No cleaning, no cooking, no child rearing, no job, etc. If someone says it “doesn’t affect” them, **MAKE IT**. Definitely sex/dating strike.",
    "comments": [
        {
            "level": 0,
            "comment": "The fact that Ireland - the most catholic, white old man ruled state has finally declared them legal - proves that the USA is scarily going backwards. \n\nI’m in the Uk. I just want to send my solidarity to all those women who’s lives are now controlled by disregard, disrespect and stupidity. \n\nI’m sorry 😞",
            "score": 1593,
            "author": "SillyOldBird",
            "replies": [
                {
                    "level": 1,
                    "comment": "One of my best friends recently moved to Ireland simply because he couldn't take US politics anymore.\n\nEdit: I might have to move in with him after this post. The US is loosening gun control laws.",
                    "score": 249,
                    "author": "PoSSlinger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Person living in Ireland here who has a lot of Americans in her friendship circle. None of them want to go back to America.\n\nEdit-typo",
                            "score": 119,
                            "author": "IrritatedMango",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't blame them. It's all fucking crazy talk from one of the two parties that are really available, and the other party has to bend over backwards to get votes. We pretend to have a third party that is essentially a wasted vote because people are so misled by the media. It's all about money in politics here.",
                                    "score": 38,
                                    "author": "PoSSlinger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t have anything to say apart from how sorry I am and I hope every one of those Supreme court justices are haunted on their deathbeds.",
                                            "score": 29,
                                            "author": "IrritatedMango",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you want real fear, look at what is going on in Texas.",
                                                    "score": 25,
                                                    "author": "PoSSlinger",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beyond my anger and grief I’m just …. stunned by the stupidity of it all. Where would we be if they werent so focused on stupid shit like this?? What would our lives be like if they actually made rational decisions meant to help people? Who fucking CARES if people are gay?! Who CARES if a woman gets an abortion? WHO CARES! It doesn’t affect them beyond their “hurt feelings”, it’s frankly none of their business, but they spend all their waking hours fighting for this stupid shit when we could be moving forward as a country! It’s infuriating and demoralizing, the whole world is acting fucking stupid and it’s driving me insane. Religion is ruining lives, old white men are dragging us back in time and I feel totally powerless. We can vote, but I don’t even trust that anymore, they just do what they want and if they get caught breaking the law, NOTHING HAPPENS. fuck this place.",
            "score": 3359,
            "author": "LongbowTurncoat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its to further divide your nation and its working beautifully for them because alot of the population are happy with the result. \nkeep you distracted and hating each other while they can stay in power with no consequences. I wish every American good luck and really hope the nation avoids a civil war. People do not realise how dangerously close it is to that because their distracted.",
                    "score": 685,
                    "author": "Bad_to_Good",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not just to divide the nation for the fun of it. It's also a white supremacist issue. White people are having fewer babies, so abortions need to be illegal in order to keep the white majority. And since unwanted babies often grow up to be imprisoned adults, well, they can't risk a decrease in the \"domestic supply of infants\". They need their modern day slaves.\n\nSince the last civil war was also about white supremacy and slavery, a second civil war wouldn't be a surprise.\n\nIt's also obviously about misogyny. And capitalism. \n\nAnd it is obviously NOT about valuing life. They're fine with kids getting shot up at school after all.",
                            "score": 1369,
                            "author": "sapphiccatmom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Making abortion illegal results in a higher rate of deaths, not a lower rate. Any \"pro-lifer\" is really just pro-death.",
                                    "score": 304,
                                    "author": "RealBrookeSchwartz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Completely agree. And if they were “pro-life” they should also be willing to help children who need to be adopted, children who deserve a good education, children who deserve to go to school without fear of dying. But a majority of them don’t care about the children once they’re out of the womb. I’m sure there are some that do, but they are outweighed by the ones that don’t.",
                                            "score": 151,
                                            "author": "lacklustereded",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And they don’t want an educated populace either. Educated people don’t want to vote for bigoted misogynists.",
                                                    "score": 59,
                                                    "author": "MsFloofNoofle"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Finally fitting words to my absolute dissolution with this embarrassment of a country",
                    "score": 167,
                    "author": "NutralMcNutralGuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "American women need to research and think deeply before casting their next vote .. while you still have the right to vote",
            "score": 35,
            "author": "AlternativeSpreader",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If there's any solace to be had, it's that you are not alone.  Tens of millions of people are fucking furious right now, and I hope we can take our collective anger and channel that into political action to take this country back from literal fascists. The thing is Democrats have had 50 years to codify roe and they didn't even when they had supermajorities in congress, so I don't really know what to do anymore.   \n\nI'm so fucking sorry, OP.",
            "score": 650,
            "author": "matt314159",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this country is not ready to admit how much American politics flirts with fascism. We aren’t almost there we are actively taking steps towards it and we are having less and less ways to fight back.",
                    "score": 75,
                    "author": "Ketchup-and-Mustard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watched a documentary where Hitler wouldn't allow Jewish women to get abortions during the Holocaust. They had to keep the children before they were executed.",
                            "score": 9,
                            "author": "CollectandRun",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The only reason I vote Democrat anymore is because they aren't actively trying to pass laws/remove laws to take away these kinds of rights. But they are doing absolutely nothing to protect them or the citizens impacted, either. I won't give up, but have to admit it does feel incredibly futile and I am also at a loss of how to change things.",
                    "score": 239,
                    "author": "embracing_insanity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Organize with workers - in the past, strikes, whether they shut down the entire economy or just parts, have been pretty successful at forcing change.",
                            "score": 81,
                            "author": "InLeague"
                        },
                        {
                            "level": 2,
                            "comment": "Absolutely: no more donations to dems and PP. Grassroots is the only way out",
                            "score": 9,
                            "author": "lilpoopsyartist"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The rest of us women from across the world are watching in horror, our hearts break for you and we stand fully by your side. I think we’re even protesting it here in London. This is setting a standard and sending a message to women across the world. WE MUST NOT ACCEPT THIS.",
            "score": 724,
            "author": "Next_Confusion892",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely. PLEASE make a fuss right now! Not just for us, but to solidify that this WILL NOT happen elsewhere!",
                    "score": 246,
                    "author": "clarabear10123",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt;This is setting a standard and sending a message to women across the world.\n\n\\^ Absolutely - This time, it's really bigger than the US.\n\nThose states don't deserve women.  If only they could all move out.  Imagine a state with 90% less women...",
                    "score": 67,
                    "author": "ycc2106",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really is. The illusion of the USA being the ‘best’ in any way is long gone from the rest of the world, however what is left over from that mindset is that your politics/society get a ton of attention compared to others. Not ideal but there is no way around it - this will have a global impact. \nAnd yeah, if only!! Sadly, they will rely on the majority of people being too poor to run. Then they can make profit by fining people having abortions, and prosecute those supplying the pills. A whole new black market, to imprison participants of for profit - your politicians will be drooling with delight.",
                            "score": 46,
                            "author": "Next_Confusion892"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live in a country where abortion is illegal and I am so sad and angry to read about what's happened in the US. Even here, I'm pretty sure you can legally terminate if the pregnancy poses a real risk to the mother. This is madness. I can't imagine having those rights and then having them taken away....",
                    "score": 77,
                    "author": "milkybarbah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s even worse that you’ve had to live somewhere your rights have never been respected. To be forced to carry an unwanted pregnancy to term is physical and mental torture, and should be legally classified as such globally. All these twisted men in power have not a drop of empathy :(",
                            "score": 42,
                            "author": "Next_Confusion892",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can die in war.\n\nI can bury myself beyond a reasonable amount of consumer debt and car financing and I can own my own home and \n\nI can pay the federal government 37% of my income.\n\nBut I can’t choose when I am ready to become a parent.\n\nEdit: if you’re a reproducing male and you don’t like this either, you have the options now of getting a vasectomy. Unlike the surgical options provided to reproducing females, yours is reversible.",
            "score": 761,
            "author": "mtweiner",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re *obligated* to pay for a government that *doesn’t serve you*. That makes me so mad!!!",
                    "score": 243,
                    "author": "clarabear10123",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Told my husband to get a vasectomy. He said he would but didn’t do anything. Had an appointment with by obgyn and had her remove my iud, came home and\nTold him and he made the appointment that same day! Not getting pregnant SHOULD NOT just fall on us women.",
                    "score": 226,
                    "author": "pink-lady-1985",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am a guy and I agree with the saying it's better to take the bullet out of the gun then shot yourself while wearing a bulletproof vest. Vasagel? I think it is makes it super easy as hell to make guys shoot duds but they wont let it come to the USA which is a bummer.",
                            "score": 36,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;it's better to take the bullet out if the gun then shoot yourself while wearing a bulletproof vest\n\nThis is the most perfect analogy of this situation. Thank you. I will be using this from now on.",
                                    "score": 26,
                                    "author": "Red_Sweet_Tart"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And males don't need permission from their spouses to get vasectomies. And aren't asked \"but what if you want kids later?\" -.-",
                    "score": 227,
                    "author": "JovialPanic389",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm convinced that this is the moment for all doctors to stand up for their patients. Any woman who comes in asking for sterilization should automatically be approved now.\n\nIf the doctor is concerned over the woman \"changing her mind\".... rest easy buddy, the already overcrowded foster system is about to get a hell of a lot worse.",
                            "score": 5,
                            "author": "boxofmarshmallows"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with your whole post except your edit. Sadly I know personally that a successful reversal is rather difficult to achieve.",
                    "score": 36,
                    "author": "JimiTrucks1972",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Goodbye dating! Goodbye hanging out alone with males! Goodbye birth control! Goodbye bodily autonomy! Goodbye everyone!!!!",
            "score": 376,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yep, same. I started looking into moving out of the US. My kids aren't safe at school, I have less rights than my cat, and my health insurance costs $250 more a month than my damn mortgage. This ain't living.",
            "score": 1584,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Canadian here- we are also a little pricey but would be happy to have you ❤️",
                    "score": 495,
                    "author": "flipflapdragon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "after i finish schooling(2 years give or take) i will be starting my dual citizenship process so i can live in BC with my biyfriend❤️",
                            "score": 150,
                            "author": "flabaciousfailure",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you can handle cold winters, the Praries (Manitoba and Saskatchewan) are a lot more affordable.\n\nOf course though, BC is beautiful and warmer. If you got enough income to live out there, then do it!",
                                    "score": 60,
                                    "author": "feleven",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'll take paying higher taxes and not having to pay when I have a medical emergency. Had brain surgery and didn't cost me anything other than paying my usual taxes. 👌",
                            "score": 70,
                            "author": "SquareSniper",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Canadian here too - confirming we would love to have you! Lots of maple syrup to go around ❤️",
                            "score": 68,
                            "author": "GT-FractalxNeo",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That's ok, we can make do and cut corners- we've been doing that for some time here!! I also recently found out they celebrate Krampus in one of your provinces and I am BEYOND excited about that😁 Fingers crossed🤞and thank you!❤️",
                            "score": 33,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Aww! I can't wait to move there &lt;3",
                            "score": 10,
                            "author": "TheStarPower"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 169,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How does one even do this, though? I have several skills but none are considered in demand enough for a visa. Loved traveling there but every route into which I’ve looked for immigration seems blocked by rigid standards.",
                            "score": 65,
                            "author": "GlamrockShake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do you have any recent family members that have immigrated? I am eligible for duel citizenship in Ireland because my Grandfather was a citizen. My sister and I are looking into it seriously now",
                                    "score": 36,
                                    "author": "_littlelowin",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If considering the UK, please give it some serious thought. This country doesn't feel like a fantastic place to live in at the moment either, and I think English will work well enough for most Western European countries until you can learn the language.\n\nI'm not saying anywhere else is perfect, and it's not nearly as bad as it sounds in the US at the moment, but as an average Brit, moving away from here is looking more and more of a good idea every day...",
                            "score": 78,
                            "author": "TheAndyman777",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sweden would be an excellent choice.  Practically every one of them speak excellent English and their way of life is a refreshingly slower pace.",
                                    "score": 41,
                                    "author": "traversingthemundane",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, Denmark and the Netherlands…the latter of which has “The Dutch American Friendship Treaty.” Lots of potential opportunities.",
                                            "score": 38,
                                            "author": "einahpyt-2864",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s not. My parents just bought a house abroad and I plan on moving as soon as I graduate (which is when I’ll be able to)",
                    "score": 110,
                    "author": "clarabear10123",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly I’m a bit numb about it. I know I’m going to drive home, park in my garage, get out and walk inside my home where my girlfriend will be. I will have to help her come to grips and to deal with the grief that she feels about this. I’ve never known what it’s like to lose my autonomy. It sounds dehumanizing. I’m furious on her behalf",
            "score": 234,
            "author": "Beans_Technician",
            "replies": [
                {
                    "level": 1,
                    "comment": "My boyfriend is also seething and doesn’t know what to do to help. Make a fuss. Let the women in your life know you support them through action, not just words. It’s… violating. Humiliating. I feel sick when I look at my male coworkers because I feel less-than, even though I’m training one of them. I resent people without uteruses and that makes me even angrier because I know it’s not their fault. Just know there could be a lot going on in her mind.",
                    "score": 131,
                    "author": "clarabear10123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We’re gonna go get some pizza and then join our local protest. My biggest concern is her immediate mental health. Right now it’s heading for a big slump and I’m trying to head that off.",
                            "score": 49,
                            "author": "Beans_Technician"
                        },
                        {
                            "level": 2,
                            "comment": "My girlfriend works for a mental health call center and starts in 7 minutes. She told me she's worried about the onslaught of calls from people having a hard time with the news. I wish we could just stay home and snuggle and cry a bit today.\n\nFuck it. I'm a straight dude and I'm depressed as fuck about this. I feel so numb. Trump was the beginning of the end for so many who felt that there was a bright future ahead of America. It just takes so much work for basic human decency to become the status quo here.",
                            "score": 50,
                            "author": "STRMfrmXMN",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Blacklist hosted an episode where the politicians who make abortion Illegal were implanted with a child that they could not abort. I think the same should be done now.",
            "score": 148,
            "author": "domclaudio",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, please. Mandatory transfusions, too.",
                    "score": 33,
                    "author": "clarabear10123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canadian woman here. To our neighbours to the South with uteruses: I am so, so sorry that this is happening to you. Please know that the Canadian government has already stated that it will welcome any Americans wanting abortions with open arms, so if crossing the border is an option for you, rest assured that you can safely access an abortion here. Also, know that there are countless Canadians, myself included, who will support you in anyway that we can, and we will welcome you with open arms. Stay safe my friends ❤️",
            "score": 218,
            "author": "queenofthepotatoes00",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is so good to hear. I did not know Canada will welcome Americans for abortion",
                    "score": 28,
                    "author": "Apprehensive_Round_9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Conservatives read The Handmaid’s Tale and thought it was paradise.",
            "score": 497,
            "author": "ammygy",
            "replies": [
                {
                    "level": 1,
                    "comment": "“That didn't happen.\n\nAnd if it did, it wasn't that bad.\n\nAnd if it was, that's not a big deal.\n\nAnd if it is, that's not my fault.\n\nAnd if it was, I didn't mean it.\n\nAnd if I did, you deserved it.”\n\nConservative ideology in a nutshell",
                    "score": 219,
                    "author": "TeamToken",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They did this shit on purpose. Probably used it as a manual.",
                    "score": 37,
                    "author": "DylansStripedPants"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a Canadian I grew up with American culture, on our tv’s and radio ( thank goodness for Can con laws lol) thinking that the American dream was the be all and end all. The older I got the more I realized I won the birth lottery being born a female in Canada. Normally I’m not an anxious person but seeing what’s going on in American politics and changes in personal rights and freedoms I can’t help but feel anxious, you couldn’t pay me enough to be an American. I feel like the myth of the American Dream has now turned into a nightmare. I know Canada has it’s own issues that need to be worked on and can always be better but for today I’m glad to be Canadian. I’m so sorry to my neighbours to the south, you deserve better.",
            "score": 23,
            "author": "maggier672",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is what happens when you allow religion to dictate law.",
            "score": 166,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Only had to read the title to upvote this.\n\nSuch a bad vibe right now",
            "score": 230,
            "author": "flentaldoss"
        },
        {
            "level": 0,
            "comment": "Can someone help me with my boyfriend? I keep telling him and informing him about how I feel with Roe. He just says “you’re in a safe state, you’re fine, our governor is voting against it”. That is the furthest thing from the point. My fellow women in red states are SUFFERING. HOW CAN I JUST TURN A BLIND EYE JUST BECAUSE I’M “OKAY”.",
            "score": 764,
            "author": "squidslet",
            "replies": [
                {
                    "level": 1,
                    "comment": "People said for years that Roe was settled law and that we were all just dumb hysterical ninnies to care about it, and look where that got us. Trusting that the rich won't gamble away your humanity if it'll get them more clout or a few pennies they won't notice is abysmally foolish. I'm sure he's got a lot of good qualities, but saying something like this should give you pause. If he's not willing to listen to you and rethink his naive stance, then do you really feel this is a safe person with which to start a future? You don't owe me an action or an answer, but you owe yourself some space to think, for your own safety.",
                    "score": 153,
                    "author": "unsaferaisin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; People said for years that Roe was settled law and that we were all just dumb hysterical ninnies to care about it\n\nThose people were either lying or idiots.  Google Ted Kennedy's 1987 Robert Bork speech.  This was always the long game for the far right wing for decades.\n\nToo many people acted like Charlie Brown trying to kick the football, and surprised with conservative Lucy pulls it away again.",
                            "score": 13,
                            "author": "BoldestKobold"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "State governments move fast.  I’m in a purple state and whether or not abortion will be legal when I have my next child (if something goes wrong) now depends on a  single election.  You might be in a “safe state” but you’re no longer in a safe country.  Every state is now on the precipice.\n\nOne way to explain the feeling might be to explore hypotheticals.  If the law had changed such that men could not be out after dark unaccompanied would it be sufficient reassurance that your boyfriend has a supportive partner who will chaperone him?  No.  Because that’s not the point.  \n\nIt’s not about transient privileges, it’s about human rights.  You now live in a small, safe bubble in a vast sea where you are less than human.",
                    "score": 249,
                    "author": "miss3lle",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Say that you are worried for other women in this country. The woman who is in Mississippi who is raped by her father and forced to have his baby because she can’t afford to fly to NYC to get an abortion. Or the woman whose fetus cannot survive outside of her womb who is being forced to carry and birth a non-living fetus, ripping her open for literally no reason. Or the woman who has a health emergency when pregnant and the baby is worth more than her life in the eyes of the government. It’s about solidarity for other human beings. Empathy for your fellow woman. Peoples lives will be ruined over this. Millions. And that is something to fucking care about, boyfriend.",
                    "score": 135,
                    "author": "ev3000",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yes I agree with you and it’s problematic even if you only look at your own state. Even if your state allows abortion and even if that same state has legal protection for those providing abortions, other states may not. A provider who performs abortions might not be able to travel outside the state without risking being arrested. And a pregnant person going to another state may experience a miscarriage and end up like that poor tourist in Malta. The US is a country of states. One should not have to consider if it’s safe to travel domestically, or how to move around the country. So while you may be in a safe state, the way people in that state interact with others may change dramatically with this ruling. Your boyfriend may say “well, don’t travel while pregnant and you’re not a provider so you’re fine” but that’s still highly limiting compared to how the country worked only yesterday. Also, according to the scotus, this is only the beginning. Same sex marriage, contraceptives, womens right to vote, minority rights…. How long can one really say that “oh, it doesn’t affect me directly so it’s ok?”",
                    "score": 22,
                    "author": "tiramisutra"
                },
                {
                    "level": 1,
                    "comment": "Louisiana here, and unable to take birth control due to health reasons. I'm not okay lol",
                    "score": 97,
                    "author": "cornballdefense"
                },
                {
                    "level": 1,
                    "comment": "All my male friends have been radio silence since all of this started. It's disheartening the amount of men who just don't care because it doesn't affect them. Like most men feel that way",
                    "score": 63,
                    "author": "vivalasleep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had a weird experience at work, one of my older, white Catholic, male colleagues, was floored by this and didn't agree with it. He said that while he doesn't personally agree with abortion, he doesn't think that should preclude others from getting one and it's none of his, or the government's business if they do. He's concerned about the precedent this will set going forward about how involved government is going to be in people's personal lives.\n\nSo I guess even some of the ones you wouldn't expect do care, not always in the way you'd want them to but some of them seem to be able to see the forest so to speak.\n\nI personally haven't felt this disgusted in a while and that's saying something with everything we've gone thru as a nation the past couple years. I'm afraid as a white woman who, while not 100% straight, married a man... but I'm terrified for bipoc and lgbtq communities. I can only know what it's like to be hated, looked down on, and treated as inferior because I'm a woman, I can't imagine adding in skin color and/or my choice of spouse. \n\nI'm so sorry everyone, this is a dark day for humanity and I'm just shattered, but I'm also afraid of what else is coming, and the men will care then, but it will be far too late by the time they wake up.",
                            "score": 15,
                            "author": "MrsKnutson"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I doubt men will ever fully understand. We as women are fortified together because we know the struggle. State elections are upcoming ladies! I suggest we all seriously review and vote to protect each other because we are the only ones looking out for us!",
                    "score": 70,
                    "author": "_littlelowin",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 515,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "When sleeping women wake, mountains will move",
                    "score": 170,
                    "author": "darlingchase"
                },
                {
                    "level": 1,
                    "comment": "I am a man, and I am right here with you. I don’t want to stand by watching others lose their rights",
                    "score": 59,
                    "author": "InfiniteStarFighter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why the fuck these old ass hag men have control over a womens body. This country got its priorities all types of fucked up.",
            "score": 20,
            "author": "tonytone404"
        },
        {
            "level": 0,
            "comment": "Attention Prospective Emigres\n\nIt is much harder to immigrate than you think.\n\nJust because you want a safe place to raise your kids does not mean Canada or Australia give a fat rat's ass.\n\nI'm an American who tried to immigrate-I even acquired a degree in Canada &amp; work permit but was unable to do so.",
            "score": 95,
            "author": "Active-Neat-5511",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who knows- maybe someday in the near future we might get refugee status?  🤷‍♂️😕",
                    "score": 40,
                    "author": "pnkflyd99",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm very glad I was able to have an abortion when I needed one. I live in the Bible belt in one of the states that's very likely to ban abortion completely or make it as difficult to have access to as possible. As it was I already had to go through a week long waiting period and hear pro-life propaganda spilled into my ear by a nurse before I was allowed my medical abortion. I'm moving to New Zealand at the end of the year to be with my fiancée and I couldn't be more grateful I'll never have to raise a daughter in this country. I'm sorry for any woman not lucky enough to be able to nope tf out of this country.",
            "score": 119,
            "author": "lalalady123_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m moving out of the country to be with my fiancé as well ❤️",
                    "score": 10,
                    "author": "keepitorig"
                },
                {
                    "level": 1,
                    "comment": "Welcome to NZ ( when you get here)",
                    "score": 7,
                    "author": "NoUnderstanding347"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m literally at the hospital helping pay for my girlfriends tubal ligation (I already have a vesectomy) just so you can feel in control of her body.\n\nDoc says there’s been an uptick of women doing this.\nMore power to ya.\n\nIf the point is to control y’all…\nTake away that power i guess.\n\nI’m so sorry y’all have to go through this.\nAnd I’m sorry more for the potential future this opens way for.",
            "score": 87,
            "author": "syddevious",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy shit. I hope she recovers well. That's invasive as hell",
                    "score": 23,
                    "author": "JovialPanic389",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If our constitution doesn't even give me rights to my own body - then burn it. It's worthless.",
            "score": 313,
            "author": "hello_01134",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 85,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of fucking course they limited that too. I just had to look it up because I hadn't heard a damn thing about it. They're constantly piling all these things on top of each other so people don't have time to pay attention to anything without getting mental and emotional whiplash. \n\nI fear for my children and my children's children. I fear for my neighbors and their children. I even fear for the future generations coming from the idiots who wanted this shit in the first place because if they EVER break the generational curse of stupidity brought forth by their forebears, they will have to fight through the fucking mud just to get their rights back THAT SHOULD BE A GODS BE DAMNED GUARENTEE",
                            "score": 39,
                            "author": "darkangel8724"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm doing my part by getting a vasectomy. No way am I letting the government force my wife who has uterus problems already to carry a thing in her to term that can kill her. Fuck that.",
            "score": 18,
            "author": "Calicobeard12",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 188,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very interested in hearing the where and how. I have been trying to figure out for years how to move out the of US. It’s sickening here",
                    "score": 83,
                    "author": "geenuuhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And here I am trying to move from Sweden to the US. Well only because my boyfriend lives there and he can't really move to Sweden. However, I heard same sex marriage might get overturned so...that might not be a possibility either.",
                            "score": 47,
                            "author": "Veridiyus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You would be crazy to leave Sweden for the US.",
                                    "score": 56,
                                    "author": "Sweet-Advertising798",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep.  They've already begun talking about overturning the laws that would protect same-sex marriage.  All my coworkers are Swedish and I've been there a few times.  I'd move there tomorrow if I could.",
                                    "score": 49,
                                    "author": "traversingthemundane"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Been seriously contemplating Canada",
                    "score": 13,
                    "author": "KingCosmic18",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Come! We have our own issues( like everyone) but we do have lots of room and universal healthcare.",
                            "score": 15,
                            "author": "Matchbox54883",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Help!",
                    "score": 12,
                    "author": "smokey-taupe"
                },
                {
                    "level": 1,
                    "comment": "Any regrets? Seriously considering myself...",
                    "score": 28,
                    "author": "MsDudemyster",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Help. I need to get out of here.",
                    "score": 19,
                    "author": "ItsLauraDuh",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where’s a good place to move?",
            "score": 16,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hey America,\n\nYour neighbour to the north is here for you,and abortion is legal here. \n\nWe’re right next door.",
            "score": 16,
            "author": "TormentedOne69"
        },
        {
            "level": 0,
            "comment": "Suicide rates and pregnancy related deaths are about to sky rocket. That's not even including people who are going to die due to unsafe abortions. \n\nThey don't really care about us.",
            "score": 69,
            "author": "lilybear032",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I almost killed myself after I was raped without ending up pregnant. If I had been forced to go through with a pregnancy like that I would also not be here right now.",
                            "score": 9,
                            "author": "kinetochore21"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bet Susan Collins is \"oh so furious\" right now because they told her, they *promised* her that Roe V Wade wouldn't be touched. \n\nVote every one of these fuckers out.",
            "score": 97,
            "author": "Questn4Lyfe"
        },
        {
            "level": 0,
            "comment": "this is just full on scary. i just wanna live in a country where i have basic human rights not a country where a gun has more rights than i do.",
            "score": 157,
            "author": "gusav-hrz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 340,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "For decades the strategy from the GOP has been to concentrate on states with smaller populations. They have about half under their control via gerrymandering and education. This gives them a lot of sway in the Senate.\n\nThey are using the system against the majority.\n\nThey don't have the numbers, they have gamed the system.",
                    "score": 79,
                    "author": "korinth86"
                },
                {
                    "level": 1,
                    "comment": "The electoral college and the senate. Both archaic institutions that favor rural areas and give them outsized power in our government. They don't need a majority to rule like they are the majority.",
                    "score": 35,
                    "author": "TallGeminiGirl"
                },
                {
                    "level": 1,
                    "comment": "It’s scary how divided this country has become. Not to be an alarmist, but after the January 6th insurrection, I don’t think a civil war is too far from reality. Hopefully we can find common ground before it comes down to that.",
                    "score": 27,
                    "author": "wolf_beast_10x"
                },
                {
                    "level": 1,
                    "comment": "I live on the border of Kansas and Missouri and I can’t even tell you the number of Pro-life signs I see in peoples yards on a daily basis",
                    "score": 125,
                    "author": "buttbratface",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "KC here. Sad.",
                            "score": 28,
                            "author": "notSamMalone"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The South. I’m in KY and the majority of the people I know that have guns are Christian and the majority of Christians I know have guns.",
                    "score": 89,
                    "author": "clarabear10123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fellow Kentuckian here, we breed pro-life Republicans just as well as we breed horses. I swear they are all here. I only know of 2 other people who don't believe in god and maybe a handful of Democrats. Damn near everyone is a gun toting carbon copy of eachother.",
                            "score": 6,
                            "author": "Wobbles8steve"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You're correct; there really aren't that many. Problem is, for years now Dems have been way too obsessed with winning the presidency. Meanwhile, R's have been laser focused on winning local elections and controlling local and state courts, which is how cases like this one end up in front of the supreme court. Then you also combine that with the fact that Dems constantly go around saying they want a strong Republican party and how it's good for the US. Meanwhile, the leader of the GOP basically steals a supreme court justice and RBG decides to not retire, so you end up with this perfect storm of shitbaggery that's not at all representative of what most Americans believe.\n\nEither way, as mentioned this shit has been a long time coming. Liberals need to wake the fuck up and vote even in off year elections.",
                    "score": 47,
                    "author": "Jk0285",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also gerrymandering",
                            "score": 24,
                            "author": "FullBlownPanic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely. It's another reason why winning these governorships and state legislatures is vital too (Rs control a majority of those). They determine the district maps and boundaries. I hope this is a serious wake up call for progressives but if I'm being pragmatic, this is going to be pretty hard to undo.",
                                    "score": 14,
                                    "author": "Jk0285"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like I’m living in crazy land.",
            "score": 15,
            "author": "purpleinthebrain",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m right there with you. It’s infuriating and I absolutely cannot believe we are still living in a time where us as women do not have all the rights we deserve.",
            "score": 134,
            "author": "DSFBrand",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There is so much wrong with the US it's crazy but it won't get better unless citizens band together and speak up. US has turned into a war machine that has been swallowing countries for the past 3 decades not once thinking about its own ppl, it's time for a change",
            "score": 14,
            "author": "LordSidious1"
        },
        {
            "level": 0,
            "comment": "Same. I hate what they have done to this country.  I'm at the point where I wish nothing but awful things in their lives and I don't like that I've become that person.  I truly hate them.",
            "score": 82,
            "author": "PigletVonSchnauzer"
        },
        {
            "level": 0,
            "comment": "I'm at the office but just staring at my desk. I just can't today.",
            "score": 229,
            "author": "Otherwise_Ad233",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work with republicans. They’re celebrating. Im the only woman in the office. Im tempted to call out",
                    "score": 252,
                    "author": "clarabear10123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gross. Do it. \n\nOk, do what you gotta do, but do what you gotta do to take care of yourself too. Your office, your clients, your community, your friends, are more than lucky to have you. Hang in there. It's a shitty office day for lots of us and we're with you!",
                            "score": 118,
                            "author": "Otherwise_Ad233",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. I’m sending as much goodness as I can out into the world for all of us. I hope this is uniting",
                                    "score": 31,
                                    "author": "clarabear10123"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Every woman should call out all of next week.   Grind the country to a halt.  Fuck\n\nEvidently there is a plan for next week.  Please check it out",
                            "score": 86,
                            "author": "imightb2old4this",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Voting should be the bare minimum everyone does in November. After that, we need to cause as much disruption as humanly possible.",
                                    "score": 19,
                                    "author": "Weakness_Cheap"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "not even a woman and I'm just so depressed with everything going on I want to call out.",
                            "score": 42,
                            "author": "SmytheOrdo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn’t it heartbreaking?",
                                    "score": 8,
                                    "author": "clarabear10123",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I was checking Reddit to see what the decision was and I’m just holding back the tears right now. This is fucking gross and disturbing.",
                    "score": 18,
                    "author": "hobbyjunkie"
                },
                {
                    "level": 1,
                    "comment": "You are me.",
                    "score": 6,
                    "author": "shinyquartersquirrel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s a special place in hell for these people who voted and celebrated the overturn of roe vs wade. It’s a sad day for democracy.",
            "score": 123,
            "author": "Kiki-Sol",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ones celebrating it are all fuckin religious.\n\nI live for the day human civilization is basically pragmatic and only deals with issues using real world information from testing and studying.\n\nThese people bringing their fairy tales to the discussion board fuck it up *every time*.",
                    "score": 54,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t get why they cant just practice their religion on their own? Why does everyone else have to adhere to their religion.",
                            "score": 48,
                            "author": "AsslessChapsss",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They do this directly after saying gun laws can't be decided by states lol. Almost like they want those guns to be used on them or something lmao.",
            "score": 39,
            "author": "hiroshimasfoot"
        },
        {
            "level": 0,
            "comment": "Why are women so hated? We are your mothers, your sisters, your carers, we raise your families but we are feared and despised. It’s heartbreaking.\nWorst of all this denies women healthcare - curettes are routine for general obyg issues, not just abortions.",
            "score": 33,
            "author": "Opinionatedintrovert",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We welcome you with open arms\n\n\\- A Swiss",
            "score": 12,
            "author": "Redemption_road_443",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If any of you live in Missouri, I’m so sorry. That state immediately enforced banned abortions. It doesn’t matter if a woman or girl gets pregnant by incest or a rapist, SHE CANNOT GET A FUCKING ABORTION and that pisses me the hell off. And you know for a fucking fact that if any of those old white men on the Supreme Court had anything happen to their daughter, they would be the first to reverse their decision. But just because it doesn’t affect them personally, they don’t give a fuck about any other woman in this country.",
            "score": 10,
            "author": "eva-rae"
        },
        {
            "level": 0,
            "comment": "I've never down voted so many comments on one post. Why is it so hard to understand this county says it separates church and state yet these Christian fucks are the only one with rights apparently. Fuck the rest of us apparently. Fuck women apparently. I'm fucking reeling right now.\n Fuck the government. Fuck the USA. These old christain fucks can pay for my healthcare",
            "score": 78,
            "author": "curtni"
        },
        {
            "level": 0,
            "comment": "Does anyone know if the UN can be moved to act? This absolutely falls under the realm of a human rights violation.",
            "score": 10,
            "author": "lil_dovie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good point. Maybe if enough outrage takes place across the world?",
                    "score": 8,
                    "author": "clarabear10123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They also voted to limit the Miranda rights too. Welp, we’re fucked",
            "score": 10,
            "author": "Mobius0118",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Republican Party is embarrassing and makes me ashamed to be American.",
            "score": 101,
            "author": "Pedittle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No don’t fuck the USA. It won’t be able to get an abortion if it got pregnant",
            "score": 27,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I just got engaged and this is honestly making me rethink everything. I don’t want to raise a fucking child in this country. What if it only gets worse and we go back to women becoming their husbands “property?” I don’t want to be here anymore. This nation is corrupt and crumbling, next stop - full on civil war. They’re trying to divide the nation to keep us from fighting the real problem- the 0.01%… the billionaires and corporate overlords. Fucking scum.",
            "score": 29,
            "author": "butterflyfrenchfry"
        },
        {
            "level": 0,
            "comment": "If only Death Notes were real. I’d have written every single name of those old fucks down.",
            "score": 44,
            "author": "KiaMoon1"
        },
        {
            "level": 0,
            "comment": "I want to move so badly, but because my husband and I are disabled, very few countries with universal healthcare will take us in. So we're stuck in a hellhole that doesn't care about my rights.",
            "score": 43,
            "author": "LatchedVoice95",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe you could look back at family history? Many nations in Europe (and some in Asia afaik) provide that if you can trace lineage back to a certain point you're entitled to a passport (and citizenship, ofc). As a fellow disabled person I feel you, I am basically housebound in the States.",
                    "score": 11,
                    "author": "Internsh1p",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Freedumb!",
            "score": 8,
            "author": "Frafulero"
        },
        {
            "level": 0,
            "comment": "I can't do kids. I have to much trama centered around being a abused child, being forced to raise siblings, being abused and berated. \n\nI still like kids. I just refuse to have my own. I'm not meant to be any sort of parent. I've also got something like 20 and counting, nieces and nephews from various cousins baby mama dramas. I'll pass. \n\nI'm also disabled. So no. I don't even have the financial means to support them let alone myself.",
            "score": 8,
            "author": "badpandaunicorns"
        },
        {
            "level": 0,
            "comment": "Feeling very grateful for this IUD I got put in a few months ago so I have a few years before needing a new one. Would 10/10 fight an old white man if he tried to pull this out of me- over my dead body you miserable saggy balled wrinkly assholes. \nLadies who can handle birth control/ have access to IUDS I highly recommend getting them while you can. They last anywhere from 3-7 (maybe more for non hormonal) years depending on the brand.",
            "score": 9,
            "author": "Cool_Faithlessness_7"
        },
        {
            "level": 0,
            "comment": "I'm not a violent person.  I'd love to live in a field of flowers where people just live and let live. Love who your want, live how you want.  As long as you aren't harming other then I Don't care what you do or don't believe in, what music you listen to, or what you do in your free time.  I'm the girl who captures spiders to release them safely outside because I don't want to harm anything.\n\n If women are going to go to jail for murder for choosing not to carry our rapist's child or prioritizing our own lives over an ectopic pregnancy... Those women who find themselves in that position are not going to have anything to lose.   Let's be real here, from this point on it is self defense for any of the women who find themselves suffering from this decision.\n\nI hope some countries open their borders for American refugees.",
            "score": 8,
            "author": "BunnyPort"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 90,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay but hear me out: need a roommate? 👀",
                    "score": 57,
                    "author": "clarabear10123",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn the USA developing backwards or something idk . Hope they atleast focus more on preventing pregnancy now. Like easier access to birth control, plan B etc. Though that will only prevent pregnancy that occurs through consensual sex . But still the number of unwanted pregnancy would decrease ig.",
            "score": 84,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are rumors that they want to overturn a case that gives access to contraceptives for married people (and probably single people as well)",
                    "score": 71,
                    "author": "orangesarenasty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thomas literally wrote it in the opinion. It’s on the paper, he said they should reconsider the cases on contraceptives, same-sex marriage, and privacy in the home. This is just the beginning.",
                            "score": 50,
                            "author": "Weakness_Cheap"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh any type of contraceptive is against these people's beliefs seriously.",
                    "score": 56,
                    "author": "marmarkinz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tf they really want lmao?? More unsafe abortions that'll risk the life of the women ? Force women that don't have enough money to raise a child which will only end up as the kid having a shitty asf childhood? More child abuse? Overpopulation? It's like they're not only taking away rights but also forcing people to have children they never wanted or consented to have.... Sheesh.",
                            "score": 42,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "According to the SCOTUS opinion they want \"a domestic supply of infants\" for Christisn white people to adopt and indoctrinate. But mainly they just want us dead.",
                                    "score": 47,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Women are incubators for future tax payers in the US. That’s our purpose. That is what the Supreme Court said to me today. JFC.",
                                            "score": 27,
                                            "author": "highd"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 26,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They want to control people and women\n\nThat's it. They don't care about them, they care about the control of them\n\nThey're slave holders still pissed off that they lost their war for slaves",
                                    "score": 16,
                                    "author": "Rich-Juice2517"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel so bad for the women out there, who are not affluent or lucky enough to get to somewhere safe.",
            "score": 36,
            "author": "Svataben"
        },
        {
            "level": 0,
            "comment": "How bad does it have to get before countries start accepting refugees FROM the US?",
            "score": 24,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The justices should be held accountable somehow for what they have done",
            "score": 22,
            "author": "anime-zingjohn"
        },
        {
            "level": 0,
            "comment": "10 bucks says they’ll make suicide attempts illegal too- pregnant with an unwanted fetus and you survive a suicide attempt? Prison. Fuck this country.",
            "score": 25,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Miscarriages are also illegal, so suicide wouldn’t need to be added",
                    "score": 12,
                    "author": "clarabear10123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's be nice if American women could be considered political refugees by other countries now. So if we want out but have limited resources we can actually get out",
            "score": 22,
            "author": "JovialPanic389",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt;It’S wOrSe OtHeR pLaCeS\n\nYeah, in similar 3rd world countries. In the rest of the developed West it's lightyears better than in the USA. So happy I escaped that shithole for a civilized society...",
            "score": 60,
            "author": "Prophet_60091_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "yeah I'm officially ready to get the fuck out of here. let these freak republicans enjoy their school shootings and extortion priced healthcare.",
            "score": 8,
            "author": "maxwell8998"
        },
        {
            "level": 0,
            "comment": "I agree fuck the USA and I’m out of here from this shitty country",
            "score": 8,
            "author": "ProudPolishPolak"
        },
        {
            "level": 0,
            "comment": "I'm in eastern Europe and I honestly believe we have it better. I'm sorry, big hug.",
            "score": 7,
            "author": "re-la-tivity"
        },
        {
            "level": 0,
            "comment": "I think it’s time for an uprising. I’m sick of this bs",
            "score": 9,
            "author": "pelehcar"
        },
        {
            "level": 0,
            "comment": "go to your local prochoice marches, please register to vote to get democratic seats, keep those around you educated, don’t be silenced.",
            "score": 8,
            "author": "omgbei"
        },
        {
            "level": 0,
            "comment": "I guess women need to up the ante and start demanding higher child support and make them pay if they wanna force us to rear the children they don’t much want to care for either.\n\nNot only that but also get cost of living increases!",
            "score": 7,
            "author": "restrictedsquid",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sex strike!",
            "score": 7,
            "author": "because-caffeinated"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 22,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wish all of you that want to leave the best of luck in leaving",
            "score": 21,
            "author": "AngryAngel24"
        },
        {
            "level": 0,
            "comment": "I'm pissed off too, and I'm a cisgender male! This is completely bad for women's health and I've heard other people talk about this and it's clear that the Supreme Court either didn't think through all the complications it would cause or they just simply didn't care. \"It's all about saving lives!\" Yeah, bullshit! What exactly are doing to ensure women's health of they can't give birth safely? what you goings to provide to women who can't afford to keep their children? What are you doing for women who can't physically or emotionally handle birth? This is so obviously misogyny and the fact that they're not even trying to hide it baffles me! If these dipshits honestly think that the American people will take this lying down, then these so called \"American patriots\" don't know the first thing about our own history.",
            "score": 21,
            "author": "Feral_Chat"
        },
        {
            "level": 0,
            "comment": "Fuck China, fuck Russia, and fuck the USA.",
            "score": 84,
            "author": "Luminoose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amen lol",
                    "score": 14,
                    "author": "clarabear10123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Godspeed. I am autistic so I cannot immigrate to another country.\n\nI’m fortunate to live in PA but now I have to fight like hell to protect abortion access here.",
            "score": 30,
            "author": "carlykerfuffle",
            "replies": [
                {
                    "level": 1,
                    "comment": "why can't you immigrate to another country if you're autistic? I'm genuinely asking, first thing I thought of was some local laws that every country has that prevents autistic people from gaining citizenship, which is horrifying, but I'm guessing the causes are actually indirect?",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anything that could be a drain on the healthcare system and stop you from gainful employment can prevent you from getting a visa. That includes clinical depression and other illnesses or disabilities too.",
                            "score": 30,
                            "author": "JovialPanic389",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My heart goes out to all women in the USA who are, and in future will be, heavily and negatively impacted by this. \n\nThe USA is moving backwards, meanwhile in Germany a new law was passed today that there is no longer an advertising ban against abortion; so means/methods for abortion can be legally advertised to help people make informed decisions regarding abortion",
            "score": 31,
            "author": "ReturnOdd7817"
        },
        {
            "level": 0,
            "comment": "I'm Canadian. I have never understood why immigrants all flock to the US like it's some beacon of hope. Health care is expensive, guns are valued over the lives of children (except the unborn), and racism is rampant. Fuck conservative values and fuck Republicans. This anti-choice sentiment better not trickle into Canada.",
            "score": 137,
            "author": "Mountain-Patience-59",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ask the First Nations people how they feel about their freedom too before we start pretending racism only exists in America",
                    "score": 71,
                    "author": "GI_Bill_Trap_Lord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Never said it only exists in the US. I am fully aware we have our own issues. I would still rather live in Canada.",
                            "score": 19,
                            "author": "Mountain-Patience-59",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I left the US years ago, I've been trying to get the rest of my family to follow for years. Maybe they will listen now...",
            "score": 6,
            "author": "julika6"
        },
        {
            "level": 0,
            "comment": "Came here to say this too. I'm so fucking sick of this country. I'm sick of a small group of nazis stripping back my rights. I'm sick of ineffective government that are only beholden to their corporate overlords and nothing else. \n\nI'm sick of being here. Sick of shills spreading lies. Something has to give, something has to be less terrible, something has to change. \n\nThat being said everyone who is a US citizen should call every rep they can and clearly demand that they enshrine healthcare rights into law and that they have no chance of getting reelected without doing so.",
            "score": 39,
            "author": "OuijaFox",
            "replies": []
        },
        {
            "level": 0,
            "comment": "can some one explain. i am outside usa. i dont know whats going on.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They overturned Roe V Wade, which was a Supreme Court case that protected the right to abortion",
                    "score": 9,
                    "author": "Notablueperson",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "We'll greet you with open arms\n\n\\- A Canadian",
            "score": 6,
            "author": "OddSilver123"
        },
        {
            "level": 0,
            "comment": "Make use of the guns you get to have there, and go fuck shit up. Show the polititians and the judges that people are actually the ones in control",
            "score": 6,
            "author": "YaBoyPads",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People in 3rd world countries are both laughing and crying at this",
            "score": 6,
            "author": "RespectfulVirtue"
        }
    ]
}