{
    "id": "148jlc9",
    "score": 10,
    "title": "Boyfriend [51M] of 7 months says that he might need to work while on vacation. I’m (45F) trying to find fair compromise.",
    "author": "ramblinglass",
    "date": 1686674281.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148jlc9",
    "media_urls": [],
    "other_urls": [],
    "postText": "UPDATE:\nThanks for the advice.  I texted him to ask if he could try to put his work into a block if possible so it doesn’t eat into the entire day.  And if he could give me as much notice as possible if he does need to work while on vacation so I can make plans to do something on my own instead of just sitting around waiting for him to be done.  And I’m going to try to be understanding if a true emergency pops up that is not foreseeable or avoidable.\n\nORIGINAL POST:\nThe nature of my work is that I only work a couple hours a day and I need to schedule time off at the beginning of the month but then once I’ve reserved the time I’m 100% off work and able to focus on my personal time.   His job has demands where he might need to address urgent issues while on vacation like taking phone call meetings and answering work texts and emails.  \n\nI don’t have paid vacation so it puts a pretty big financial burden on me to take any time off.  And so I think I will be annoyed if I’ve taken the time off for my work thus taking on the financial  burden and then he’s not really taking time off and instead potentially working remotely as opposed to actually taking vacation.  He’s saying that he won’t necessarily need to work on vacation but things can happen and his hands are tied when they do.    \n\nI told him that if he isn’t able to reserve the time for the vacation I’d prefer to not take time off for my work and we just do a staycations instead because I can just  work my couple hours and then take the remainder of the day off together.  Which in my mind is similar to his situation where he’s saying he only needs to work an hour or two as urgent matters arise.  He’s saying that a staycation is too limiting because he wants to travel together since it’s fun and he can do his work from any location and doesn’t see it as intrusive.   \n\nI’m setting up this traveling boundary in an effort to avoid a situation where I start developing feelings of resentment towards him.  Am I being petty for establishing this boundary? Is there a better compromise I’m not seeing?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "That’s not really a compromise. You’re asking him to sacrifice his PTO for a staycation instead of a trip when it sounds like he probably is looking forward to that break from work. If the trip is too much of a financial burden on general to go then that’s understandable but it sounds like you’re just upset that his work cuts into his personal time. \n\nAnd honestly at that point maybe rethink what you’re getting into. He’s clearly very committed to his job. If you guys end up living together how are you going to feel about the weeknight emergency calls, the weekend meetings, etc.",
            "score": 15,
            "author": "Danic89",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not PTO if he answers any work calls etc…. He will get paid for the whole day so he’s not really motivated to set personal boundaries with his work.  \n\nAnd I agree his commitment to work might not work for me long term that’s why I’m trying to establish boundaries early on to see if this is going to work out for us.  Because I do value work life balance.",
                    "score": -3,
                    "author": "ramblinglass"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's unclear how him having to work a little bit while on vacation would detrimentally impact you. You can't spend 24/7 together whether you're at home or away ('cause that's a great way to destroy a relationship). Most people with important jobs simply don't have the luxury of being completely out of touch with work, ever. So ask him what he wants to do. If he'd rather do his few hours of work at a holiday destination than at home then you should plan a trip. You can use his work hours there to do your solo activities.",
            "score": 10,
            "author": "DplusLplusKplusM",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is a good point. And also good reminder that we need space even on vacation.",
                    "score": 1,
                    "author": "ramblinglass"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with the other comments, it is kind of petty to put restrictions especially if he is in a position where he needs to take these calls. He may start resenting you for it, if he comes off of holiday having to deal with an even bigger mess because he wasn’t allowed to take these calls/ respond to emails etc",
            "score": 7,
            "author": "LilLei",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just to be clear I’m not telling him to not take calls or ignore his work at all.  I’m fully recognizing that  his work is important and that he needs to attend to it as it demands.  I’m just suggesting that we can be more equitable and both do our little amounts of work in the morning and then spend the rest of the day doing fun staycation stuff together in our community.  We haven’t done any local tourist stuff together and we live in a really nice tourist area.",
                    "score": 0,
                    "author": "ramblinglass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough but just keep in mind that emergencies can’t be scheduled in so he may take the odd call/ email every now and then. Just be as supportive as possible as I’m sure he would if the roles were reversed x",
                            "score": 3,
                            "author": "LilLei"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, frankly, you are being kind of petty.  You're basically telling him that you'll never travel with him because both of you know that the nature of his work might call for him to put in a couple hours.\n\nInstead of such a stark demand, see if you can find a different compromise.  Try to get him to promise to put in time only up until maybe 10am.  I fail to see anything quite so urgent that he can't schedule his stuff to morning hours.  Then he may need to shoot off a text or something, but that's life.  If he's putting some time in when you'd be getting up and cleaned up, that shouldn't be so bad.  But insist on no meetings and no phone calls after that.",
            "score": 16,
            "author": "saxonjf",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like this suggestion for a compromise.",
                    "score": 0,
                    "author": "ramblinglass"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Listen, he is a working man, probably in a position of authority, or at least one of importance. It's better than being a freeloader with no job. Sometimes, things like this happen. It's part of being successful. Quit punishing him for his work grind. To me, it sounds like you're only thinking about yourself. Not everyone has the ability to work remotely, or to choose a few hours here and there to complete their work. Give the man a break, and appreciate the times when he doesn't have to work, at least he is giving you a heads up that work emergencies are a thing, and he might have to buzz off for a minute to take care of things.",
            "score": 11,
            "author": "Pronebasilisk",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s possible that I’m being selfish.  But I’m just suggesting that we do fun staycation stuff centered around our community instead of traveling to a remote location.  We live in an area that tourists flock to especially in the summer to because of all the awesomeness so I don’t see it as that negative of a compromise.",
                    "score": -6,
                    "author": "ramblinglass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sometimes it's nice to get out of town though, even if he has to do a little bit of work here and there, and brief change of scenery can be good for one's mental health.",
                            "score": 7,
                            "author": "Pronebasilisk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just saw a post where the woman was mad that her man never got explosively angry, now a post about a woman being mad that her man is hardworking and dedicated to his job. So glad I’m not in the dating pool anymore",
            "score": 1,
            "author": "bsigmon1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uh huh.  We’re glad you aren’t also.",
                    "score": -2,
                    "author": "ramblinglass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol I was snagged up fast. Glad I don’t have to deal with the nonsense of the leftovers",
                            "score": -4,
                            "author": "bsigmon1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m sure you are living your best life.  And us peasants who have actual questions about what is appropriate boundaries for relationships are should just fuck off.  Enjoy being scooped up.  I’m sure you’re a catch.",
                                    "score": 1,
                                    "author": "ramblinglass"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One more comment.  I can’t leave this alone.  I think you’re missing that I’m also hard working and dedicated to my career.  But since I own my own business I’m not getting paid for the time I take off and it puts a financial burden on me when I do take that time off.  He’s not taking care of me financially and I don’t want him to.  I want there to be an equal amount of respect for each of our careers and time. I’m not asking him to not be dedicated to his job.  I’m asking him to let me be also dedicated to mine and do a staycation instead so we can both take care of our work as it would take up roughly the same amount of time.\nWhy is it okay for me to sacrifice my career but not him?",
                    "score": 1,
                    "author": "ramblinglass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Main point is if he says he may need to hop on something quickly to help out then get back to vacationing, just let it be. He’s obviously needed and valued and work and that’s a good thing.",
                            "score": 3,
                            "author": "bsigmon1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I literally said that is what I’d do in my update if quick emergencies do come up. See above.\n\nWe’re talking about hours of work meeting calls that would roughly equal the amount of time I spend on my work.  It’s just that I can’t work remotely like he can so I’m suggesting we staycation, instead of going somewhere remote, and become local tourists since we haven’t done that together yet.\n\nI don’t think that’s completely unreasonable.  But I came here looking to see if there was a less extreme boundary than what I was thinking.  And I have already taken that less extreme advice.\n\nAnd btw neither of us are left overs.  We both had long lasting loving marriages that came to tragic ends and are feeling lucky to be in love again.",
                                    "score": 1,
                                    "author": "ramblinglass",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wishing you the best then. Just remember to not be so hard on your man",
                                            "score": 0,
                                            "author": "bsigmon1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}