{
    "id": "148t8bp",
    "score": 8,
    "title": "I 21M feel like my 19F girlfriend is only after money.",
    "author": "ThrowRaWISYbob",
    "date": 1686700474.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148t8bp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I (21m) can say i belong to wealthy family, and i recently met this girl (19f) and we got together for about 5 months now, her parents are divorced and she is living with her mother, they are struggling financially, but since we got together, i always paid for everything when we go out, food, cinema tickets, if she wanted something i get it for her, if i travel i buy her gifts, and i ask her if she want anything, and recently, she just seemed a lot more demanding, and complaining how she hate her life because of financial problems, and saying that she want to buy cloths, shoes, change her phone, go to the salon.\n\nI get monthly money from my father, and it’s enough for me to pay for my monthly expenses( gaz,subscriptions…) and buy things i want online, pay for both our food, pay for the activities I like, and save some money to travel in the summer with my friends.\n\nNow back to her, i explained that to her, and was clearly ignoring her, when she start mentioning that she want to buy that and that and she doesn’t have money, and she hates her life because it’s full of family problems, financial problems and mental problems because of that, and that i never tried to help, i told her it’s not true, i was here for you mentally, physically, and financially…, her response was financially?? And it just kept going on to end in a fight and gn.",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "&gt;  and that i never tried to help, i\n\nThis is the part you should leave over. It's one thing to occasionally vent because financial difficulties are common and they do frequently suck, but when it's frequent and especially when she accuses you of not helping, then serious red flags go up.",
            "score": 18,
            "author": "ProfPlumDidIt",
            "replies": [
                {
                    "level": 1,
                    "comment": "And every time she goes mad, im the one doing effort trying to make it up by any mean possible",
                    "score": 6,
                    "author": "ThrowRaWISYbob"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve dealt with this before. Tone down everything, the gift buying, the paying for dates and see how she reacts and you’ll have an idea of where her head is at. You wouldn’t want to move forward if her mindset is all about what you can do for her. Make sure she actually likes you for you.",
            "score": 12,
            "author": "Soft-Contract-5916",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah I would’ve told her to kick rocks already. It has been FIVE months and that should’ve been plenty enough time to show who you really are to your partner. \n\nShe’s shown that she doesn’t feel bad about withdrawing money from her ATM boyfriend. With how op was describing her behavior (especially in the third paragraph), it sounds like she’s trying to manipulate op so they feel bad enough to buy her things. Her response to the “mentally, physically, and financially” comment also doesn’t sit right with me. So far, the girlfriend has shown that she is only focused on the financial aspect of this relationship. How much longer are you going to put up with this op?\n\nTell me, what does she even contribute to the relationship? How would she react if you stop financially supporting her for a few weeks? Is this relationship going to be stable in the long run if your girlfriend only values you for your money? Is it worth keeping it stable if that’s the case? I say get rid of the gold digger op and find someone that will value you for everything that you provide for them.",
                    "score": 3,
                    "author": "yellowmackerel6403"
                },
                {
                    "level": 1,
                    "comment": "had that one as well. she bounced lol. glad she did.\n\nI may have done ok, but I still live a simple life.\n\nthat doesn't mesh well w some.\n\nplus she's 19 ffs. lol. she can get a job or better an education and a job.",
                    "score": 2,
                    "author": "bucketsofpoo"
                },
                {
                    "level": 1,
                    "comment": "I will try that and see",
                    "score": 1,
                    "author": "ThrowRaWISYbob"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't marry this girl she doesn't love you she just can't afford to be single anymore and she wants someone to help her pay the bill.",
            "score": 4,
            "author": "fatcock76"
        },
        {
            "level": 0,
            "comment": "I dated a guy that had a lot of money. He wanted people to like him for his money, flaunted it and bought expensive dinners and gifts, then he accused people of using him for his money.",
            "score": 5,
            "author": "Teledoink"
        },
        {
            "level": 0,
            "comment": "You could try telling her the money tree has dried up because Dad lost everything in the stock market or something and see how she responds to that.\n\nHowever, she does kind of sound like she's looking to make a money grab.",
            "score": 4,
            "author": "NancyLouMarine",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been thinking of doing that and keep it up for weeks and see how she will react",
                    "score": 3,
                    "author": "ThrowRaWISYbob"
                }
            ]
        }
    ]
}