{
    "id": "148u0c0",
    "score": 3,
    "title": "21F &amp; 21M feel stuck and don’t know what to do PLEASE HELP !!!",
    "author": "Character_Education6",
    "date": 1686702788.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148u0c0",
    "media_urls": [],
    "other_urls": [],
    "postText": "i (21F) and my partner (21M) are having a problem that seems to grow bigger each day, which happens to be sex and i’m sure i either am somewhere on the asexual spectrum or demisexual one i’m not very immersed into either so i’m a bit ignorant. all i know is that i hardly have a sex drive but that doesn’t mean i don’t have one at all, it’s just rarely there and i’ve expressed this to my partner and he has an opposing sex drive which is fairly high and i don’t seem to be able to meet it. \n\nhe doesn’t force me to do anything by i feel like he’s been trying to set that mood and because i cannot force myself to get into that sort of mood out of a spur he seems to have resulted in directly asking now such as “wanna have sex tn?” or “wanna have sex” and it puts me in a weird place that i’m not doing enough and i feel bad about it. i’m not sure what to do as he doesn’t want to force me into anything and i do not and cannot do that, as i have extreme trauma with r word as a kid and teenager as well as being continuously sexualized as a minor by women and men so i find it hard to provide in this aspect as i am a more emotional and mental sort of individual when it comes to love languages. \n\ni’ve communicated this and had various of multitudes of conversations and sit downs with my partner to find a way we can meet in the middle and cater for each other. but the problem persists, and only grows for him as he gets sad about it and depressed and begins to overthink and i’ve suggested an open relationship but he was offended i had done so and as well masturbation and porn and have even gave him lewd videos and pictures of myself yet he told me he hates that idea and i’m unsure of what to do and how to proceed now. \n\ntoday i found him looking at lewd girls profiles on facebook and tiktok that show their bits but it confuses me whether that counts as porn or not or if that’s a completely different thing? if anyone could give me some perspective please i’d appreciate it !!",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "If you've had extreme trauma (as you describe it) with sexualization when you were young, you should seek therapy to help you work through that. It can be difficult to tell whether the lack of sex drive comes from the trauma or asexuality.\n\nFor the time being though, it sounds like you're not sexually compatible with your partner, and that not your or his fault. You definitely shouldn't be pressured into sex when you don't want it, and he's also allowed to want to be with someone has a sex drive closer to his. If this isn't resolved then it can cause resentment to grow in a relationship, as you're probably already experiencing now.",
            "score": 2,
            "author": "SkittlesPlease"
        },
        {
            "level": 0,
            "comment": "Yeah major incompatibility - this can’t work. End it.\n\nHe should find someone with a matching high sex drive, and you should find someone with a matching low or no sex drive. Boom everybody wins.",
            "score": 1,
            "author": "AreiaMage"
        },
        {
            "level": 0,
            "comment": "you probably are not actually attracted to him dump him and find someone you don’t physically attractive",
            "score": 0,
            "author": "FunDecision7442"
        }
    ]
}