{
    "id": "148u9zr",
    "score": 0,
    "title": "How do I (24 f) be a giving spouse to my husband (25m) during a time where I’ve got no emotions to give.",
    "author": "Sufficient-Hawk-7245",
    "date": 1686703622.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148u9zr",
    "media_urls": [],
    "other_urls": [],
    "postText": "My little brother (20m) died about a month and a half ago, tragically in a car accident. My husband didn’t know him much, and my husband has not lost anyone close to him, no grandparents, no friends, nobody. I’ve lost my dad and now my little brother. And about two weeks after my little brother died, I had to move across the country to a new place because of my husbands duty station. So I’m in a new place, no friends, no job, no family who gets what I’m going through. Since losing my brother, I’ve had such a loss of motivation, and a deep feeling of despair, especially at night time. And my anxiety has gotten really bad. But I keep pushing through and try to not show my emotions, because he doesn’t get it and he keeps trying to get me to stop from crying but I need to grieve this loss. \nI’ve been applying to job after job and no call backs and it’s been a month of applying online, following up in person, etc. to like 30+ jobs. I feel like the universe is kicking me while I’m down and I’ve got nothing good going on. I feel so bad that I can’t even describe it. But still I try to joke with my husband, try to hang out with him, do stuff, etc. but he came to me today complaining that I am not giving him the attention and love that he needs. And I get it. You need to feel loved, but I told him that I’ve got nothing left to give. I’m giving everything I can. I’m trying the best I can to try and move forward but I’ve got nobody but him. And maybe that is exhausting, but I don’t even share my emotions with him because the few times I do, he just shuts me down. He doesn’t get it and I can’t believe he’s expecting me to just be okay. So what can I do, in this time, to give him what he needs?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I literally cannot imagine a scenario where my spouse had lost a sibling six weeks ago and I went to him complaining that he wasn’t giving me enough attention. Your husband needs to grow the fuck up, period.",
            "score": 10,
            "author": "wigglebuttbiscuits"
        },
        {
            "level": 0,
            "comment": "&gt;So what can I do, in this time, to give him what he needs?\n\nI'm really sorry.  I can't imagine losing a sibling.\n\nInstead of worrying about him, maybe figure out what *you* need.  It has to be really difficult in a strange place with no family or friend support, and having all this trouble getting a job.  It even puts your husband in a tough spot.  It doesn't sound like he's handling this ideally, but it's also hard on someone when they're the only support system.  \n\nWould it help if you flew back home for a few months?   It would just be to regroup, get that support you need and maybe get into a better emotional situation.",
            "score": 6,
            "author": "maricopa888",
            "replies": [
                {
                    "level": 1,
                    "comment": "This could also work. If you can take a week or two and fly back home spend time with family and friends.",
                    "score": 2,
                    "author": "Away-Inspection-3600",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want to do this, I’m waiting to hear from my mom when we are doing the celebration of life for him. We did the funeral and everything, but she wants to do a time where we can celebrate him. So I am waiting to hear about that, but I know she’s in absolute devastation right now.",
                            "score": 1,
                            "author": "Sufficient-Hawk-7245"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does his need for attention and love trump your need to grieve? Why can't he help support you during this time? He doesn't need to have lost someone close to him to understand that *you did* and you need HIS support more than he needs yours in this time. \n\nHas he always been this selfish? Is this a pattern of behavior? Does he always put his wants above your needs? \n\nYou should be allowed to express emotions in a healthy adult relationship. And right now, the way you're describing this relationship, it's definitely toxic and honestly probably divorce-worthy if this is a pattern of behavior.",
            "score": 3,
            "author": "PixieOnAcid"
        },
        {
            "level": 0,
            "comment": "Your BF definitely isn't the best.... \n\nYou should talk with a counselor, so that you can get the support that is lacking and you can get your bearings. You need to take care of you first.\n\nYour BF can kick rocks till he gets a clue.",
            "score": 5,
            "author": "Drawn-Otterix"
        },
        {
            "level": 0,
            "comment": "I don't think I would ever be able to get past his selfishness in this moment. You shouldn't be asking what you can do for him. He should be asking how he can support you.",
            "score": 3,
            "author": "AnOutrageousCloud"
        },
        {
            "level": 0,
            "comment": "It sounds like you are experiencing depression and rightly so.\n\nMake an appointment on base with your primary care doctor or who ever you are allowed to see and tell them you need to be evaluated for depression.\n\nThat is a good first step to getting over this hole you are in. \n\nIf you do have depression and you get medication, this is a good step in the right direction.\n\nI would say, if you can, to get out every day and get some exercise. Go for a walk and just let your mind be a peace. Talk to your brother and tell him how much you miss him ect. Have full blown conversations. Tell him about your life ect. \n\nTry to make an effort to get up every day, take a shower and eat breakfast, make it a ritual between that and walking.  Maybe toss in reading the paper while you eat breakfast.\n\nIf you have a resume, try  going on [fiver.com](https://fivver.com) and have someone look at your resume and give you suggestions on how to make it better ect.\n\nAs for your husband, he needs to be patient and understanding. If he isn't, sit him down and have a serious conversation about how he isn't giving you what you need at the moment and that your give a shit factor is literally at bottom. He needs to let you cry it out and at some point, you will stop. It is OK to be sad. Give yourself permission to feel it. \n\nRight now, your husband needs to be more supportive, not wanting you to give him more attention. Tell him to back off a bit.\n\nAt night, I suggest you start a ritual. Take a hot bath, have a cup of hot tea, grab a book and read until it is time to go to bed. It will keep your mind occupied.\n\nI am so sorry you are going through this and I am sorry you lost your brother. \n\nThings will get better, there will still be lots of tears but it will get better. Just hang in there.",
            "score": 2,
            "author": "SpanielGal"
        },
        {
            "level": 0,
            "comment": "The first thing that sprang to mind when you said  \"no family who gets what I’m going through. \"  is grief counselling. Its mostly a few sessions of group therapy but wow, it was so great to talk with people who \"get it\" .   It may vary depending on your area but call a funeral hope and they will direct you regardless if you used them or not. Or since your husband is in the military medical facility.\n\nYou need to grieve and take care of yourself and since your husband is not helping you need help elsewhere. You can deal with his insensitivity later. Although I might tell him now exactly how you feel so he cant say later \"I had no idea\".",
            "score": 2,
            "author": "NFT_fud"
        },
        {
            "level": 0,
            "comment": "Firstly I want to say I am very sorry for your loss and my heart goes out to you. I know loss can be hard and although I have not lost a parent or sibling I have lost friends and other relatives. You never really stop missing them, but what I can tell you is eventually it does get easier. Hang in there I’m rooting for ya ! Secondly can you elaborate more when you say he shuts you down? What does he say exactly and how do you initiate the speaking of your emotions. I want to know how his about him before I comment on him.",
            "score": 1,
            "author": "Away-Inspection-3600",
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s trying to be helpful and tell me that it’s okay, because he’s in a better place, but I tell him all the time that I’m not crying because of that, I am crying because I no longer am have him. No more memories, all the things that he never got to accomplish, all the regrets that I live with daily about how I should have been a better sister. And I worry that it was painful before he died. I worry that he was all alone and scared. And I know that my husband trying to tell me that it’s okay, but it doesn’t solve it. It will never solve it, and I just want my little brother back. And I want to cry about it, I want to mourn and deal with the grief because shoving it down all the time won’t help me.",
                    "score": 1,
                    "author": "Sufficient-Hawk-7245"
                },
                {
                    "level": 1,
                    "comment": "And I try not to let it consume me, because I know it can. But I’m very good at allowing myself time to grieve and then I continue with my life. And then it’ll hit me again that he’s gone, and I’ll grieve a different time. I usually wait until after he has fallen asleep.",
                    "score": 1,
                    "author": "Sufficient-Hawk-7245",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well that right there shows me that maybe his heart is not in a bad place he doesn’t want to dismiss you but maybe he doesn’t fully grasp how you feel inside. I know this can be hard when dealing with grief, but you have to also remember that your husband can’t ever make anything better when it comes to that, all he can do is try to reassure you and make you feel more comfortable. The only thing that will be able to take the pain away is time. Time heals all wounds, in the mean time what I believe you can do is remind yourself that your brother now lives on through you. I also suggest couples therapy or maybe even one on one therapy. Your man could use some pointers on how to help you grieve.. despite me thinking his heart is in the right place he needs to do a better job at being a support system for you during this trying time and I guarantee that the love will pour out of you. I think right now there’s a lot of tension cause you see him as not really helping you or understanding you. Couples Therapy would be a great way for you guys to figure that out. This is a rough time in your life and it’s really important that he can step up emotionally. You need him. Besides that what are you goals ?",
                            "score": 2,
                            "author": "Away-Inspection-3600",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Goals? As in Job? Or marriage?",
                                    "score": 1,
                                    "author": "Sufficient-Hawk-7245",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Give me both",
                                            "score": 1,
                                            "author": "Away-Inspection-3600",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well that is difficult currently because I’m trying to figure that out. I graduated from college last year with a degree in international relations and a minor in writing. I have a passion for writing, coaching, and geography/sociology/cultures. I am trying to get into contracts and procurement for the government because that is a job that will transfer well while my husband fulfills the rest of his time in the military. And then after that, maybe I can find something that is more of my passion. But I’m having a hard time getting into contracts and procurement because all the agencies want you to have years of experience and I previously had done 8 months of an internship in it (but we had to move because of my husband). And I could pay for a program to get educated using the MyCAA, but I’m having a hard time locating one that isn’t outrageous (I don’t want to have to take a loan out because we already have one out for my husbands car). \nAs for marriage, he really is a good guy, he just doesn’t get certain things because he grew up in a very stable home, which, is nice because he’s not toxic (I know this post is a one-of situation) so I want to stay married and we both want that, but I’m just struggling with now with what he needs of me and I can’t provide it. I can’t act like I’m okay 100%, and everything is normal. Because it’s not, but I do a good job most days.",
                                                    "score": 1,
                                                    "author": "Sufficient-Hawk-7245"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;So what can I do, in this time, to give him what he needs?\n\nThe question is why is he not giving you what you need? You don't have to have lost someone personally to be an empathetic person and a helpful, supportive and loving partner. It's times like these when you're at your lowest that you learn whether or not you can count on your partner to lift you up. Instead all he's doing is complaining that you're not giving him enough attention? \n\nI'm so sorry for your loss. If you can, are you able to get back and spend some time with your family? That might give you an opportunity for healing that you're not getting where you are now, and give you some perspective on your relationship once you're in a better headspace.",
            "score": 1,
            "author": "lecorbeauamelasse"
        }
    ]
}