{
    "id": "148vt99",
    "score": 0,
    "title": "23F 24M Can taking time apart help?",
    "author": "UnfairSyrup9722",
    "date": 1686708562.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148vt99",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nWhen I say taking time apart I don’t mean a “break” I just mean a couple days to miss each other and relax and do things on my time. My gf and I have been practically at each others throats, mainly my fault as she feels I don’t care or love her like I used to but deep down I know I do. I just feel so exhausted and I can’t seem to break the cycle even though she’s communicating to me exactly what I’m doing wrong. I work 6 days a week and I’ve been busy fixing my truck and handling my responsibilities with all my free time being spent with her and little to none doing things that I actually wanna do. I’m overwhelmed with everything going on and us arguing just makes it 10 times worse. I’m wondering if others think some time to miss each other will help or there’s something else lacking in the relationship?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The cycle will just keep repeating itself.\n\nTaking a 'break' won't actually fix things. You don't need time apart, you need balance. An adjustment to the relationship dynamics.\n\nYou can only give so much up until you start feeling like you have no control over your life... you still need to carve out a piece of your life for you.\n\nShe needs to be able to handle that.\n\nTwo years ago, me and my GF went through this exact thing.\n\nIt got to a point where my life was defined by my relationship.\n\nWeekly I had:\n\n* All day events with her family\n* Hang out with her friends\n* A date night for the two of us\n* A normal hang out at home\n\nThe thing is.. I am an introvert, so a lot of those things were draining to me, whereas they were recharging for her.\n\nIt got to the point where I felt like I had no say in my life anymore. I was so drained that it was  sending me into a depression.\n\nIt was impacting how I preformed in my relationship. It got to the point where it was obvious I didn't want to be at those social gatherings when I was there.\n\nWe had a heart to heart and I told her I need balance. I still need time for myself. I like to feel as if I have control over my life. I want her to ask me if I want to go to those things, don't sign me up become my schedule looks free.\n\nI told her that she will get more out of me if we did these things in less frequency... And that is exactly what happened. The less I went to those functions, the more personable I became.\n\nSort of the same thing here but in a different texture.\n\nYou don't need to go a couple days of no contact, all you need is a balance to have your space. You can still maintain interacting with her, but every free minute you have cannot be given to her.\n\nIf she expects too much out of you, sorry... the two of you will never work. Both of you need to be capable of giving the other person what works for them. Your side, is equally as important as her side. Both of you need to respect your differences and find compromises that work.\n\nSo, please be honest and communicate your side. Requesting a mini vacay is like slapping a band-aid on a bigger issue. You need to genuinely address the issue and implement a solution that works so it doesn't happen again.",
            "score": 2,
            "author": "MckittenMan"
        },
        {
            "level": 0,
            "comment": "“I work 6 days a week and I’ve been busy fixing my truck and handling my responsibilities with all my free time being spent with her and little to none doing things that I actually wanna do.”\n\nMaybe you just don’t need a relationship right now. You sound pretty busy. \n\nYou might take a break and realize you don’t miss her.",
            "score": 1,
            "author": "AreiaMage"
        }
    ]
}