{
    "id": "148vns5",
    "score": 5,
    "title": "38 M married to abusive wife 35 F",
    "author": "Weakweek85",
    "date": 1686708075.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148vns5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have always struggled to speak up and stand up for myself. My wife has essentially walked all over me for our 9 year marriage. She is verbally abusive, manipulative, calls me every horrible thing imaginable, disrespects me in front of my friends family, her friends etc , has gotten physically violent with me and has even gotten violent with my dog and has whooped her. \n\nShe has many strained relationships in her life, including with her parents and many of her friends don’t talk to her anymore because they think she’s mean. \n\nShe has made new friends at the gym she goes to, but is already having drama with them. I don’t see these friendships lasting. \n\nShe refuses to see any wrong that she’s ever done and blames all her marital problems on me.\n\nIt’s incredibly one-sided, and I’ve gotten completely numb to it\n\nWhen we got married, she was not a legal resident of the US. She was able to obtain a green card through our marriage. \n\nAnother factor is that her parents lost their apartment seven years ago and had to move in with us in our tiny little ranch home. \n\nAlso she barely works- and puts zero effort into landing a job. So I kind of feel like if I leave her, she’s screwed.\n\nI’ve also struggled with erectile dysfunction throughout our marriage, partly physical health related, as I once weighed 320 pounds and had a plethora of health issues, but probably because of the emotional abuse I’ve had to deal with. She also has PCOS so having children has not happened and would be difficult. I’ve recently lost a ton of weight and am overcoming my ED issues.\n\nI do feel like I’ve done an awful lot for her. \n\nLately, she’s been talking about divorce and how she doesn’t know if she wants to be with me anymore and all this crap. And then to top it off, she said she might be attracted to women. In my head, I know I should leave or kick her out. But my heart has grown numb to the situation and I feel stuck. Do you think I should leave her, or should I kick her out? What would you do in this situation?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I think you should leave her. If you're unhappy and she's even been talking of divorce, you should just cut the loss. I know it's probably very hard because you've been in the situation forever, but in the end, it will be worth it. Think of the big picture and what it will take to make you happy.",
            "score": 6,
            "author": "unsure-bird"
        },
        {
            "level": 0,
            "comment": "“If i leave her, she’s screwed.” Lmao and??? She abused you for years. You don’t owe her anything. YES get a divorce and metaphorically drop kick her out of the door.",
            "score": 3,
            "author": "AreiaMage"
        },
        {
            "level": 0,
            "comment": "Leave, kick her out, do whatever as long as the end result is her being out of your life and do NOT leave your dog behind. She's a complete waste of air on this earth.",
            "score": 2,
            "author": "MissConduct0120"
        },
        {
            "level": 0,
            "comment": "Definitely leave her. You will be surprised at how fast that \"stuck\" feeling goes away.",
            "score": 1,
            "author": "curly_lox"
        },
        {
            "level": 0,
            "comment": "Look after yourself and your dog. Boot her ass out.",
            "score": 1,
            "author": "La_Baraka6431"
        },
        {
            "level": 0,
            "comment": "Take the d man",
            "score": 1,
            "author": "cindylou91"
        },
        {
            "level": 0,
            "comment": "You may never heal completely from that.",
            "score": 1,
            "author": "AcceptableBake9191"
        },
        {
            "level": 0,
            "comment": "Please leave her.  You (and your dog) have suffered enough abuse.  It is ok for relationships to end, especially if one person is terrible.  Stand up for yourself and your pets and break it off.",
            "score": 1,
            "author": "th3critic"
        }
    ]
}