{
    "id": "148vb9x",
    "score": 0,
    "title": "I (F25) feel insecure about my small breasts and my boyfriend (M23) of 3 years will sometimes try to compliment me by telling me “they look bigger” and it kind of hurts me",
    "author": "Individual-Club-9909",
    "date": 1686706940.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148vb9x",
    "media_urls": [],
    "other_urls": [],
    "postText": "My boyfriend, knowing that I’m insecure, will think it makes me happy when he tells me that my boobs look bigger at times, but I’d rather that he just compliments them how they are regardless of that, even as small as they are. If they seem bigger it might just be hormonal, but that comes and goes and I would still consider them small, even while at their biggest. I’m probably between an A-B cup. \n\nAnytime he says this, it just makes me kind of upset but, I feel like I’d like it more if he just appreciated them for being how they just normally are, even if small. You can describe breasts in other words than size too, the way they look, or feel! Has anyone else been in this situation and how did you deal or respond to comments like this?\n\nOtherwise he still tells me they’re perfect, and he loves them but it just triggers me that the only characteristic of them that he can compliment at times is how they may seem bigger than usual..\n\nTLDR: I’m insecure about my small breasts and my boyfriend thinks he is complimenting me when he says at times that they seem bigger, but in reality they are still just as small",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Tell him, \"I don't like when you say that. It triggers my insecurities.\"",
            "score": 2,
            "author": "-too-hot-to-handle-"
        },
        {
            "level": 0,
            "comment": "You need to be honest with him and tell him that it hurts your feelings when he says that because your insecure about your boob size and you'd rather be not tell you that.",
            "score": 1,
            "author": "Drawn-Otterix"
        },
        {
            "level": 0,
            "comment": "You have to be honest. And you can offer the idea that instead of saying hey they look bigger then he can say hey they look good today. Though if he’s telling you they are perfect and he loves them is this after you ask or at other times? Bc just take his word for it. He might be a butt guy and truly not care what size they are. \n\nBut yeah they should swell some around your periods. Just fyi. Lol",
            "score": 1,
            "author": "DomiShea"
        }
    ]
}