{
    "id": "148wpj7",
    "score": 1,
    "title": "My (31M) Girlfriend (29F) Isnt listening to my needs and feelings. Losing interest.",
    "author": "MurphyBronson",
    "date": 1686711418.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148wpj7",
    "media_urls": [],
    "other_urls": [],
    "postText": "TLDR: Girlfriend doesnt acknowledge my needs and feelings. Always brings it back to her. Starting to get exhausted playing too many roles in this relationship.Ive currently been with my girlfriend for 8 months and Im starting to feel myself pull away from her. She is incredibly sweet, loyal, great family, gorgeous and lots in common but Im starting to feel that Im doing more to make her happy then the other way around. Now I truly believe you should always get into a relationship to give but I dont really know what Im getting out of this....\n\nSeveral times we've spoken about our needs in the relationship. Whenever she has told me about her needs Ive always listened and tried to meet them but unfortunately when I speak about my needs, thoughts, opinions and feelings she always reverts it back to herself and what she wants. I told her at one point I felt I wasnt ready to meet her family and take it to the next level after she invited me to her brothers wedding 5 months in and she took it immediately as a hit and questioned if we were gonna break up. I reassured her no and cheered her up but once again I was left in the dark...\n\nWhen she is upset, angry, or sad about something Ive been there to talk to her, reassure her, and open her up so we talk but I feel she doesnt do the same back to me. Its nice when you can have a partner try and open you up as well and try to understand you back. One of needs in a relationship is Autonomy. One weekend I was hoping to do something on my own and after I mentioned it she got super upset and said \"She didnt feel like a priority. Dont do that again\". I felt criticised and once again misunderstood.\n\nIn the relationship Im doing about 75% of the date planning and fun ideas, 100% of initiating sex, and whenever were out for dinner or with each other Id say I have to carry the conversation. In fact one time I deliberately went quiet to see if she could bring up any interesting topics and all she said was \"So what else is up?\".\n\nI understand that a lot of women like it when men are the leaders and make the decisions for them but after a while thats get super old. Im finding myself not only playing the role of the boyfriend, but the best friend, therapist, date planner, and honestly sometimes the baby sitter. She also lives an hour away through transit so its not super easy for us to just pop over to each others place. She does spend more time at my apartment but she does also work in the city close to me. She also doesnt have too many hobbies and a few friends (not a local to this city and country).\n\nI do also Muay Thai and yoga 4x a week which make me extremely happy but it does take up a lot of my time. I would love to do them together but her schedule doesn't always fit with mine and once again I feel that our mismatching schedules is my fault.\n\nPersonally I believe that you should always try and meet your needs as best as possible on your own and then once your so called \"buckets\" of needs are filled others can top them off and you can also focus on topping off your partners needs.\n\nNow she does show her love in other ways like gift giving and acts of service and I always love it and appreciate it but mine are words are affirmations (she knows this) and I never feel encouraged.\n\nCurrently I feel myself becoming distant on her and this might sound harsh, but sometimes I dont see her as a woman but as a little girl. The other night she was sad in bed and I opened her up to ask what was wrong. She said Im making her feel uncomfortable at times and she is wondering if I even like her. I reassured her I did and opened her up more to make her feel better. But once again I was never asked about my feelings.\n\nAnd also a big kicker - she also wants marriage and 3 kids in the future where as I dont want marriage and only 1 kid.If anyone else has had a similar experience please let me know? Sometimes my gut is leading to end things with her.... I know people will say COMMUNICATION but as I stated before I feel its never reciprocated back to me. Relationships are a two way street.",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I can’t figure out why you’re continuing to date her. You seem entirely mismatched.",
            "score": 1,
            "author": "pineboxwaiting"
        },
        {
            "level": 0,
            "comment": "Yeah so you have a checklist of needs and things that would make someone compatible for you, right for you.\n\nYou have spent 8 months with this girl to see if she checks the boxes. And she doesn’t. \n\nYou need someone to put in more effort and you need someone who’s on the same page as you on marriage/kids. She’s not that person.\n\nA breakup doesn’t necessarily mean she’s a bad person. It just means she’s not right for you. So tell her goodbye, and find someone that is.",
            "score": 1,
            "author": "AreiaMage"
        }
    ]
}