{
    "id": "148x44u",
    "score": 3,
    "title": "Am I(30F) wrong for wanting to leave him(31M)?",
    "author": "toystorycat",
    "date": 1686712680.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148x44u",
    "media_urls": [],
    "other_urls": [],
    "postText": "We are currently married and have a beautiful baby together who just turned 1. From the get-go, I had a better education than he did and made more money. We both came from a poor family background and I was able to work my way up with a full fledge scholarship (i won't be able to attend university without it). Prior to meeting him, he was just strollin through life and getting by. \nWhen we met, we were both young (early 20s) and fell in love. We did go through break ups and somehow ended up back together. I always saw the potential in him, he's down to earth and respectful but immature. He doesn't really do much for me only when I ask for his help. He doesn't know how to cook and isn't romantic either. I have talked to him about it and he always tells me he's gonna work on it. Throughout our relationship, I'm always the earner and I am also more financially stable as I love to save. For him, he's a spender but he has learned to manage his money and understands the importance of saving. \n\nI kept telling myself over the years that things are gonna get better, that he would be able to move up financially and mentally. Since having our baby, I had to stop work and we've been struggling living on his income. My savings are going down and there have been times where I question our marriage.\n\nI would see my peers and family who are married to a more or equally capable husband who is able to provide financially and I can't help feeling like a loser for choosing the man I married. \n\nMaybe it's the hormones, but idk if I should stay and hope for a change in him or just move on with my own life... It's been 8 years since we got together and 4 years married. I am honestly tired of believing in him and giving him the benefit of the doubt.",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Love is never enough to stay with someone, if there not ticking off other boxes as well then your pretty much doomed, it would be fair to say all the \"other things\" are coming home to roost, you should be strong in your convictions give it a good think then do something about it, by the way people can change but most if they do change for the better wont ever change enough for you to be happy...",
            "score": 3,
            "author": "AlexisRobbo"
        },
        {
            "level": 0,
            "comment": "He won't change until there are actual consequences for his actions.\n\nUntil now, his behavior has been largely overlooked and therefore enabled.\n\nHe doesn't cook, yet everyone somehow still eats (because you cook). He doesn't help out around the house, yet everyone somehow avoids living in squalor (because you clean). He doesn't save money, yet everyone somehow avoids bankruptcy (because you manage the finances).\n\nAllocate cooking and chore duties. Assign weekly and monthly budgets. Establish actual boundaries.",
            "score": 3,
            "author": "newfakestarrysky"
        },
        {
            "level": 0,
            "comment": "Kinda sad that women can only really date up or across in economic status. Not saying women don't ever date a guy they are financially superior to but when it happens issues like these, regrets and doubts are bound to come up. If your partner hasn't been able to get a good financial foothold he may just not be ambitious enough to achieve it naturally. You could try telling him to get a better job or you're going to leave if that doesn't give him the push he needs it's likely nothing will.",
            "score": 0,
            "author": "No-Lawfulness-6959"
        }
    ]
}