{
    "id": "148x2m4",
    "score": 3,
    "title": "How do I (21f) deal with the constant worry that my boyfriend (23m) will pass away?",
    "author": "Express_Lime_8550",
    "date": 1686712545.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148x2m4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m (21f) writing this here for advice. I really need advice because this is ruining my life. For example, let’s say my boyfriend (23m) went to the grocery store. At home I will watch him on Life360 drive to the store, if the car slows down or he stops at a light a little too long I wonder if he either got in a car crash or is being robbed at gunpoint at the stoplight. When he isn’t answering I keep watching my phone imagining a relative of his calls me telling me he’s dead. When I’m alone at home and he’s out I imagine the police knocking on the door to tell me he’s dead. When he’s busy and won’t text back I check the local news website to see if any deaths have been reported on. When he’s asleep and won’t pick up the phone I imagine he died in his sleep. When he’s outside getting something from his car I’m afraid someone will just walk up and shoot him. I don’t just imagine him dying in every way possible but the aftermath too. I have never lost anyone, I have never been cheated on, I don’t feel this way with friends/family, etc. have no idea why I am constantly thinking like this. Even if I tell my mind to stop, everyone has their time to die, enjoy the moment you have with him now because you can’t control death and you don’t want this to ruin your relationship, my anxiety convinces me it’s best to imagine every possible outcome and that stressing about it can possibly stop it from happening. Any tips on this? I hide this very well so he doesn’t know how much it affects me and I don’t like talking to him about it because I’m always afraid I’ll somehow jinx it. He knows about it though and tries to reassure me he won’t die but my anxiety just goes you never know, don’t believe him. I’m begging please does anyone have any advice? I’m going crazy. The only time I’m not thinking this way is if I’m distracted or thinking of/doing something else. I also think I’ve developed an attachment disorder without him so that’s great too..",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "This isn't a relationship problem, this is a psychological problem. Therapy might help. If you can't find a therapist right now, you might try cognitive behavioral therapy workbooks for anxiety.",
            "score": 37,
            "author": "BelmontIncident"
        },
        {
            "level": 0,
            "comment": "You definitely need psychological help for this. Nobody on Reddit can give you any other advice besides that. It's way beyond our ability.",
            "score": 20,
            "author": "Mountain_Affect-2"
        },
        {
            "level": 0,
            "comment": "Okay, so for starters. Stop tracking your boyfriends location. You alone are literally fabricating all of your own anxiety, and that app is a tool. You don’t need to be tracking him. People have been having boyfriends for a millennia and haven’t needed to track them on life360, you’ll be fine. But this is way above reddits pay grade. You legit need therapy.",
            "score": 19,
            "author": "Sad-Lime-4426"
        },
        {
            "level": 0,
            "comment": "I *strongly* suggest you look into therapy, and possibly medication, to treat this level of anxiety and paranoia. This is above our pay grade. You need the help of a professional.\n\nIn the meantime, take that app off your phone. It's not helping - it's feeding your anxiety.",
            "score": 12,
            "author": "MbMinx"
        },
        {
            "level": 0,
            "comment": "Therapist",
            "score": 9,
            "author": "kzapwn"
        },
        {
            "level": 0,
            "comment": " You likely have a mental illness that is causing you all of this distress imo.\n\nMake an appointment with your doctor to discuss this and get a referral to a psychiatrist if appropriate.\n\nThere are medications that can alleviate these thoughts and it would be worth your time to look into this and see if it would be helpful for you.",
            "score": 5,
            "author": "Wild_Service5517"
        },
        {
            "level": 0,
            "comment": "So I am going to actually give advice. I'm not licensed or anything but this is actually very, very common for postpartum anxiety where you get intrusive thoughts that the worst will happen to you or your loved ones. A few things help - \n\nFirst, minimize the anxiety inducing thing by not feeding into it. For me, that mean that I had to stop looking for those scary/sad but improbable news stories. For you, it might mean you have to stop tracking your boyfriend. \n\nSecond, understand what you can and cannot control. Anxiety, despite it bad rep, is actually a good thing - it keeps you from doing dangerous things and keeps you safe. When you get anxious that your boyfriend isn't wearing his seatbelt while driving or a helmet while biking, you can encourage him to wear them, but you can't control anything else. If it's beyond something you can prevent, then you have to stop the intrusive thought. \n\nThird, give positive reinforcement when the bad thing doesn't happen. I'm terrified of flying, but I fly a lot for work. What I used to do was worry about everything bad that could happen while flying but I realized that it was all beyond my control. Instead, when I land safely or if the flight is smooth or whatever, I go \"what a smooth ride that was\" or \"the pilot handled that turbulence perfectly.\" Little by little, I no longer fear flying the same way because I've created positive reinforcement about the fearful activity.\n\nLastly, seek help. Staying present and learning from mistake and listening to reasonable anxiety can be learned in therapy, so I suggest you try it. Even though others haven't said it, it kind of makes sense - you love your boyfriend a lot and care for him. Just make sure your fears and love for him stay healthy and not obsessive (which this very well can turn into).",
            "score": 5,
            "author": "0l0l00l"
        },
        {
            "level": 0,
            "comment": "You’re very unwell, sorry, get therapy. This is an issue with you &amp; death.",
            "score": 3,
            "author": "relentlesscxnt666"
        },
        {
            "level": 0,
            "comment": "Therapy. This is above reddits paygrade",
            "score": 1,
            "author": "Mean_Environment4856"
        },
        {
            "level": 0,
            "comment": "Hi hun, I struggle with the same thoughts and just want you to know you’re not alone. I always fear the worst is gonna happen/did happen in those similar circumstances. I don’t think we’re allowed to diagnose people here, so I would go along with the suggestions of seeking out a therapist or psychiatrist to help you with the mental strain. I wish you luck 🫶🏻",
            "score": 1,
            "author": "UnicornBlood630"
        },
        {
            "level": 0,
            "comment": "Are you afraid he is gonna die or that you are gonna be alone if he dies?? If it is the second you have severe abandonment issues, seek therapy.",
            "score": 1,
            "author": "scrockz"
        },
        {
            "level": 0,
            "comment": "Oh no, you are severely attached to him but, you gotta take a breath for yourself. Because as much as you think about what “ifs” for him, can’t those situations be flipped and you be the victim those situations can happen to you. Then what? You really gonna lose him for good. So stop. You’re bringing so much negativity into a relationship you want. You are developing a victim mentality and that’s no way to live in peace. Put everything in God’s hands, right? He gave you a great man to be with. Then have faith. Remember this everything happens for a reason. Don’t live by the future and in fear; live by the now and in joy. Thank God every day you got to go to sleep and wake up together. Look at him and hug him. If yall get into fights, ask each other this “why did you fall in love with me” \n\n\nHope that helps\n\nAlso r/fightforpatientrights \n\nJoin my community 🙏🏻🫶🏻",
            "score": -7,
            "author": "AffectionateSpace629"
        },
        {
            "level": 0,
            "comment": "If he dies, he dies.",
            "score": -4,
            "author": "donjuancoyote"
        }
    ]
}