{
    "id": "148zi84",
    "score": 1,
    "title": "I (25M) have a big crush on a close friend (24F) and don’t know what to do",
    "author": "lilomo9971",
    "date": 1686720718.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148zi84",
    "media_urls": [],
    "other_urls": [],
    "postText": "We’ve known each other for over a year now and met through friends of friends. We are part of a friend group of about 8 people and we are the only 2 that are single. We don’t hang out all the time but the group chat is active enough where we chat and hang out about twice a month. Her and I normally text outside the group chat as we get along super well, both love movies, and just genuinely enjoy talking to one another. We have never talked about being involved romantically and have both, willingly or unwillingly, avoided talking about our romantic affairs in each other’s presence. \n\nFrom what I see, she is constantly asking for my opinion, laughing at my jokes, and giving me attention; yet I believe she is hooking up with some guy. Just a month ago we went to a concert with a group and she met up with a dude and hid away from us. When I was leaving said concert, I nearly left without saying bye to her (given I had noticed and was a bit bothered) and she came out to say good bye. My friends all say she looks and talks to me differently, but I also think it’s my group of homies just trying to gas me up.\n\nI’m going on a trip with 5 of the friends and she is joining. Should I tell her something then? Maybe before? I don’t think keeping emotions to myself is the best idea, yet I keep thinking there just would be a clearer sign if she was into me. Waiting for something to happen is never the right way to go but idk what to do. Am I an idiot? Should I say fuck it and go for it or wait for some clarity?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "There is too much risk at play.\n\nYou need to take a subtle approach if you want to test this.\n\nFor now, cap your emotions off... Stop falling deeper for her until she reciprocates. Consider it a lost cause for your own sake.\n\nIf you come out guns blazing and go:\n\n&gt;I have been harbouring feelings for you all this time and I want you to be mine, what do you think of that?\n\nThat is too extreme if its out of the blue... Which is what you'd basically would doing.\n\nDon't emotionally dump on a person, instead, emotionally develop with a person.\n\nTry to take what you have right now, and bring it do the next level. Ignore the interference.\n\nThrow a couple flirty comments out there and see how she responds. Start talking to her more than average. If she reciprocates, play that game for a bit, let it develop. Ask her to hang out one on one. If that goes well, do it a few more times... Then present the idea for a date when everything is set in place.\n\nAnd please don't shoot yourself in the foot for successfully flirting once and getting mad at her interacting with other men.\n\nOnce the two of you have gone on a couple of **defined dates,** a romantic foundation, then you have a right to communicate that you're not interested in playing games.",
            "score": 1,
            "author": "MckittenMan"
        },
        {
            "level": 0,
            "comment": "As I've gotten older I regret the 'playing it safe' approach I took as a young man. Call it being a Nice Guy, whatever, I wish I had been more up-front with people.\n\nIt's hard, but right now, she's going to date guys who ask her out.\n\nYou need to be clear, and shoot your shot. Standing idly by, while she gets with other guys, then being upset isn't doing you any favours.\n\nIf you ask, and she says 'no', then at least you know and can just enjoy your friendship with her while you explore other romantic opportunities elsewhere.",
            "score": 1,
            "author": "perthguy999"
        },
        {
            "level": 0,
            "comment": "What do you want out of the situation? Are you gonna be happy if you don’t try to date her? Why do you get upset when she dates someone else? Is it jealousy?",
            "score": 1,
            "author": "challah"
        },
        {
            "level": 0,
            "comment": "No your just friends leave it at that.",
            "score": 0,
            "author": "NexLvLxeN"
        }
    ]
}