{
    "id": "148zkw3",
    "score": 5,
    "title": "My(25F) boyfriend(28M) agreed to make our yearly vacation a “guys trip only”.",
    "author": "gahbbey_",
    "date": 1686720979.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/148zkw3",
    "media_urls": [],
    "other_urls": [],
    "postText": "My(25F) boyfriend(28M) agreed to make our yearly vacation a “guys trip only”.\n\nVacation changed to guys trip\n\nHello! \n\nMy boyfriend and I have been planning a vacation for over 5 months now. His dad and brother are supposed to meet us there and hang out for a couple of days. I have found the hotel, events to go to, restaurants to eat at, and everything else. I was so excited as it has been about a year since our last vacation and we work a lot. Our relationship is kind of suffering and this is the light at the end of the tunnel for me. I was so excited to finally get some much needed time away with my boyfriend and our dog. But, no. \n\nPlans changed last night without my knowing. He was on the phone with his dad on the couch right next to me when the update came that he actually just wants it to be a guys trip and didn’t want me or our dog to go. I suddenly became uninvited. My boyfriend did not end up telling me until, 24 hours after the phone call and him finding out. Only after I asked him what his dad said yesterday, thinking it was some kind of update, was I informed our vacation was off and it was just him going now. We have been together for 3 years and his dad just learned my name a year ago. I feel so disrespected and betrayed. I do not want to be the bad guy and make him not go on a fun vacation, but at the same time lack confidence in our relationship because of this. Do I take my own vacation during the same dates or stay at home and potentially have him feeling sorry for me?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "He’s asking to get dumped",
            "score": 23,
            "author": "kzapwn",
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s clearly checked out of the relationship. OP mentioned they have been struggling, and then he doesn’t this? If I was her, I would cancel everything. She booked and planned it all, so she can cancel it all, and not tell him, until he’s about to leave. She should also end the relationship, and find someone who respects her.",
                    "score": 8,
                    "author": "Mmoct"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would call him out in this immediately, personally.\n\n“We’ve spent the past five months planning a vacation, and you’re now telling me *you’ve decided* it’s just a guy’s trip…did you consider how that would make me feel or how it would impact our relationship?” \n\nHave you booked anything like the hotel or events you’ve found? If so, I would start looking at their refund policies. Personally, this decision would probably cause me to leave a relationship and I would start planning a trip with my own friends.",
            "score": 14,
            "author": "SeekingBeskar"
        },
        {
            "level": 0,
            "comment": "He needs to come up with a \"couples vacation\" right quickly or face your wrath.  Nothing wrong with a guys trip, but not at the expense of your time together as a couple.  \n\nGive him a chance to make it right. Ask him sweetly, \"OK, then where are WE going?\" and let him squirm.\n\nOtherwise, he can go on his vacation. And return to an empty house.  Because this will not get better over time, only worse.",
            "score": 5,
            "author": "Samwry"
        },
        {
            "level": 0,
            "comment": "He intentionally didn't tell you when he found out and he knows you've been planning to go on vacation and looking forward to it. If you didn't ask he probably wouldn't have said anything until you called him when he left without you. \n\nHe doesn't respect you, and/or something else is going on he's not telling you about. This isn't normal especially when you were planning the trip together. \n\nIf the place you were going to stay or anything is in your name you can go and stay and not let him stay, or you can cancel it without his knowledge and ruin his trip. You might even be able to call and cancel without it being in your name knowing the details of everything. \n\nThe relationship is probably over, however you could try talking to him and tell him how this makes you feel, assuming you haven't done this already...",
            "score": 6,
            "author": "knowone1313"
        },
        {
            "level": 0,
            "comment": "Move your shit out while he's gone.",
            "score": 2,
            "author": "LittleMtnMama"
        }
    ]
}