{
    "id": "1490vmm",
    "score": 0,
    "title": "I (32F) got in a heated argument with a guy (31M) on 6th date about relationship status, is it over?",
    "author": "Easteuroblondie",
    "date": 1686725704.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/1490vmm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I went on a fifth date with a guy (32M) and I definitely was crushing.  \nFor context, before we ever met, we were both in early stages of dating other people as well. This came out early…I think second date. We decided we’d see how it went anyways.  \nOn the fourth date, I was kinda drunk and expressed some kinda flirty jealousy asking about her. I punned her name. He said something like \"if you don’t want to know, you shouldn’t ask.\" I thought about this later and realized he’s right. It was hypocritical since I have someone else in the mix, and why was I doing that? What was I trying to get? I resolved that I would not bring it up again unless necessary, like trying to start a relationship. I wasn’t quite yet — I wanted to get to know him first and presumably, he wanted the same.  \nNext time I saw him, he started using the mean spirited nickname for the girl that I had joked in the last date. I didn’t not engage at all as I had changed my mind and decided its best to focus on us, not what going on outside of us. I gently changed subjects. Over the course of the night, he also brought up that his ex (another girl) had come over to his house earlier that day. Again, I acknowledged what he was saying but gently changed subjects.  \nThen he brought up that when he was on a date with other girl, he ran into another ex (a third girl!). Ok. Still, I didn’t not engage too much. I listened, nodded, and moved on. I did not at any time mention other person I am dating. I did not pry for details about his. We both know our status — no need to go into details. It’s all out there.  \nI don’t remember how, but at some point, he said he wasn’t ready to settle down. I got kinda annoyed by this. I said I didn’t want to go down what I knew was a dead end. He said it wasn’t a dead end. I didn’t like this answer. I didn’t like this conversation in general, because it was already established we were seeing other people. I was not in any way trying to “escalate” the relationship by any measure at the time this came up. It wqas actually kind of jarring. I said yeah I know we're both dating other people, I'm going on a first date soon. It seemed he really didn't like that. he straight up said that made him jealous. I had said this to basically show that I also wasn't actively trying to settle down, as he had just said.  \nI can’t remember exactly how, but he brought up the other person I’m seeing in this conversation as well. He also said he thinks about me when he masterbates…. It was a convoluted. It got heated. He left in anger.\n\nI texted him a few minutes after that I thought we were going to have sex, and I still wanted to. He came back. But when he did, we just started arguing again. He said he was jealous of the other guy. I said I was annoyed he’s acting like I’m trying to settle down with him when I am seeing someone else and I know he is too. I just wanted to get to know each other and take it from there. I know this all sounds immature and bad but I actually kinda like this person. This argument was so bizarre. He ended up leaving a SECOND time — we didnt have sex. That was last night. No word today.  \nIs this over? Honestly would be open to not seeing the other people, but I kinda thought it would be a “cross that bridge” thing with him if we did end up clicking well as we got to know each other. But hes also telling me he doesn't want to settle down.  I', cool with us seeing other people. \n\nI just don’t understand…like what does this person want from me? Were it totally up to me, we’d keep getting to know each other and leave things open ended. If it goes well cool. If not, we part ways. I can’t tell … like is he trying to make me jealous about this other girl? And if so, why also say he’s not ready to settle down? While also saying he masterbates to me? Wtf am i supposed to make of all this?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Omg girl. He’s an immature child. Move on. He’s petty jealous and plays games. You can find way more mature adult relationships. You seem open and sturdy. Go find someone more emotionally mature and available and stop playing with little boys. Good luck 😘",
            "score": 1,
            "author": "gymberlee"
        },
        {
            "level": 0,
            "comment": "sounds like neither of you is mature enough to handle dating right now honestly.",
            "score": 1,
            "author": "mightymite88"
        },
        {
            "level": 0,
            "comment": "Jesus, you're a mess. Yes, it's over. He came back for sex, god knows why you would even text that to someone in that situation. But even grudge-f\\*cking you wasn't enough to get him to go home with you. You can't even comprehend how much a guy has to actively dislike you to pass up guaranteed sex. He may hit you up when one of his other girls falls through that night, but have some self respect and just preemptively block him. This is never going anywhere past some bedroom fun in the very best scenario for you.\n\nOf course he didn't want to settle down. He was never going to settle down or date you for more than a month or two. He's good looking enough to have a rotation and men in general are repulsed by women who date more than one guy at a time. It puts them directly into the recreational use only category.",
            "score": 1,
            "author": "bobobanyon"
        }
    ]
}