{
    "id": "1490rrt",
    "score": 1,
    "title": "Girlfriend (23F) confided in her friend that I am not dominant enough and frigid in our relationship (25M).",
    "author": "Big-Huckleberry-310",
    "date": 1686725288.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/1490rrt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello r/RelationshipAdvice, I would appreciate some advice on whether I or my girlfriend are at fault in our relationship.\n\nI've been with my girlfriend for 6 years, but our relationship hasn't always been ideal. We've had numerous petty arguments and disagreements because we have different opinions. However, our relationship has always somehow worked and there were / are really great days too!\n\nFor the past few years, I've noticed that the initial honeymoon phase is slowly fading, not only due to the arguments, which I can brush off, but mainly because my girlfriend has lied to me several times. I found out almost a year and a half after the fact that she wasn't attending school and got expelled due to poor attendance. Instead of going to school, she would spend time with her mom or her friend, whom I'll refer to as Z.\n\nWhen I confronted her about not attending school, she told me she was afraid to tell me because she didn't want me to break up with her. Nonetheless, I still held onto a glimmer of hope that she would start going back to school, so I stayed with her. To this day, she hasn't found another school to attend.\n\nThe same thing happened with her job, but that's a different story altogether.\n\nCommunication in our relationship is also poor. I've seen many times that something is bothering her, but she won't tell me and acts like nothing is wrong, even though it's evident that something is indeed bothering her. Sometimes she suppresses her problems for so long that they become unsolvable (like the school situation) or develop into further complications.\n\nShe told me that she needs to \"let those things settle in her mind\" before telling me. Sometimes, it takes a week, and as a caring partner, it's excruciating not knowing what's troubling her, whether it's something trivial or something serious that I could help with.\n\nI can be quite affectionate in our relationship, maybe even clingy. I often caress her body in various places—her thighs, back, neck, or even her belly. I won't lie; my hand sometimes wanders elsewhere.Sometimes, I playfully spank her or grab her breasts from behind to show her that I'm still very attracted to her. Well, I've also been served with the accusation of being \"too touchy\" and that she might not be in the mood for it. I understand that, so I've limited it. I can't tell when she actually enjoys it, so I mainly test to see if she finds it unpleasant, and if not (based on her reactions), I continue.\n\nOur sex life is not great. My girlfriend doesn't like discussing anything related to sex; she finds it uncomfortable, according to her words. Sex is often unpleasant for her, and she complains that I'm too big (although I believe I'm average) and that it hurts her.That means our only option is vanilla sex and nothing more. I've hinted several times that I'd like to try something new and different in bed besides missionary.\n\nAnd now it gets interesting.\n\nLast weekend, I was at a bar near the lake with Z and his girlfriend. Everything was going fine until alcohol started affecting our minds. My girlfriend was with Z's girlfriend, and I sat with Z. I asked him if he knew what was bothering my girlfriend about me and what I could improve. He told me that my girlfriend wishes for more frequent sex and for me to be more dominant in that regard. He also mentioned that my girlfriend thinks I'm frigid, which is funny because a few years ago, I said the same thing to her when we didn't have regular sex for almost a quarter of a year.\n\nApparently, I should push harder and demand more. But when I do that, she rejects me. Maybe she doesn't feel like it, isn't in the mood, is tired, or has other issues.But here's where I struggle. I don't want to force sex at all costs. I don't want to rape her or take her by force—I've told her that multiple times because it doesn't excite me.\n\nIn general, there's a significant stigma in our relationship when it comes to the question of sex. For example, my girlfriend prohibited masturbation at the beginning of our relationship. Although sometimes I do it because I can't bear it anymore, and the horniness becomes unbearable.\n\nSometimes they explain her peculiar libido by blaming it on hormonal contraception. That might mess with her feelings and desires a bit. I've even suggested to her that if she stopped taking contraception, despite my fondness for creampies, I would willingly give it up so that her original libido would return, like at the beginning of our relationship when we had sex four times a day (although I attribute that to the honeymoon phase, I suppose).\n\nI don't know what to do. It annoys me that she prefers discussing our intimate problems with her long-time friend rather than telling me. She tells her troubles to everyone else first and then I am maybe lucky enough to get to hear that too. She doesn't want to address questions about sex and intimacy with me because it makes her uncomfortable, but she's perfectly fine discussing them with her friends. It seems like she doesn't want me to be involved, and it saddens me that she doesn't even want to experiment a little with me...\n\nDue to all the lies and deception, I don't know if that what she said to Z is true or false. I'm unsure if what she's telling others around is really the truth. I'm afraid there might be something more to it, but I don't want to jinx anything or invite trouble. I'll keep digging deep, to resolve all this but I wanted some advice as I am desperate and really on edge with my mentality.\n\nHow should I confront her about this?",
    "comments": [
        {
            "level": 0,
            "comment": "I'd just tell you you need to confront her and say this level of communication is unacceptable but..... Idk dude, she's capable of lying about significant things for a LONG time, she's shown you you can't trust her... Her excuses for lying are so pathetic. About school for example, I'd never want a partner who can lie like that, they would make for a shitty team member.",
            "score": 3,
            "author": "ChocolateChouxCream",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that’s actually insane to me if I found out that they were lying about going to school for an extended period of time. How could you trust them again, even in just the small things? A quick way to get white hairs fast.",
                    "score": 1,
                    "author": "psalter1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, I still have not gone gray, so I think I have some time to resolve this until it's too late.  \n\n\nI wanted to show her, that I am not like her family, that she can tell me ABSOLUTELY anything and I will help with EVERYTHING. But somehow, she still keeps everything for herself.",
                            "score": 1,
                            "author": "Big-Huckleberry-310"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well yeah, I wont even know if she's cheating on me, because she wont tell me, like with all the other things. \n\nI have already talked about this with her, but it seem that she just keeps it secret. If I ask  she tells me that she \"does not want to talk about it\" and it's like this with all the other things.\n\nMe: \"How's work? What have you been doing all day\"She: \"Not much, like every day. I just don't want to talk about it\"\n\nMe: \"What's bothering you love? Is there something I said or did that made you mad?She: \"I dont want to talk about it now, I have to think about it\"\n\nIt's really tiring to ask anymore. So, now, I... just dont care.. I know that this is killing the relationship but, if she wont tell me I won't pry it out of her. I just dont care anymore. And it makes me sad sometimes that I've losing hope for love.",
                    "score": 1,
                    "author": "Big-Huckleberry-310",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So why are you still with her if you don't care?",
                            "score": 1,
                            "author": "ChocolateChouxCream",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, as this is my first ever romantic relationship I am strungling between two mill stones. To let her go (which I think she would do anything to keep me hooked - she did cut herself numerous times before - so I dont want to even image what would she do then) or stay and resolve all the smallest details and hiccups.   \n\n\nThat \"I dont care\" is more like, \"I'll wait till she tells me herself what bothering her\".   \n\n\nDon't get me wrong but I'm still mad in love, I just need some advices how to aproach all this.   \n\n\nLeaving is my final solution, the worst case scenario. But all signs point this way so far..",
                                    "score": 1,
                                    "author": "Big-Huckleberry-310",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should have some self respect - she lies and manipulates you and you are still like \"I'm madly in love with her and leaving is a last resort\". Noone gets into a relationship with leaving as the goal. Sometimes you have to. \n\nRegarding her self harm - please let her family or friends know and tell her to seek professional help. She is manipulating you with this and you are not responsible for it.\n\nYou also cannot fix a problem that you aren't the cause of. She doesn't want to fix her behaviour. She doesn't see anything wrong with it. Love does not conquer all.",
                                            "score": 1,
                                            "author": "ChocolateChouxCream",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have a plan what to do in case of leaving this RS. I'd tell her mother, what she's maybe about to do, but I think she would not do much and that scares me.  \n\n\nAnd naturaly my RS plan is not to leave, but to thrive and prosper together, but slowly I'm getting hints that she does not want to have it that way - she has own plans it seems.",
                                                    "score": 1,
                                                    "author": "Big-Huckleberry-310"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She is definitely not mentally or emotionally prepared for a relationship, even after being with you for 6 years it sounds like. The amount of trust you put in your partner has completely gone out the window, if you can’t even trust her to tell you MASSIVE events that happen to her, good and bad. You should really look at this relationship and see if you could spend the rest of your life with someone who is “afraid” to tell you major events that effect the both of you. It sounds very childish and only amplified by her wanting certain things sexually but then not accepting how it makes you feel, which has decreased your intimacy with her. There’s a lot of fish in the sea OP and it may seem hard or the end of the world wanting to end it but it sounds like your at your wits end mentally and might be better to reevaluate the whole relationship.",
            "score": 1,
            "author": "psalter1",
            "replies": [
                {
                    "level": 1,
                    "comment": "What you stated is mostly true.   \n\n\nI've proposed to her three years in relationship and I tought that things will eventualy get better and I would marry her in time to come but I reevaluated my toughts and I'm just idling and stalling in my life.   \n\n\nWell things did not got any better, I tried to talk to her numerous times, but always she gets only like 40% of what I said. And the rest 60% of things she adds in her own ways and logic. I dont want to command her or steer her in life, but I just try to tell her what grinding my gears. And she always get stubborn and just waves me off or she gets really passive. Like saying \"Yes, you are right, I know I'm wrong\" but I feel that she tells me it only to make me feel better that I'm right. That's not what I want, I want her to actualy get these things and to get her thinking if its alright.  \n\n\nI personaly think, that she is manipulating me so that I would be numb and OK with everything she does. But I'm no psychologist to prove any of that. So I dont jump to conclusions but I'm really dumb in love ways as I'm commanded by my hearth and not my brain.  \n\n\nI dont want to throw this RS into a bin and call it a day, it's been 6 years and she is my first love, but I think this whole situation is changing me diametricaly.",
                    "score": 1,
                    "author": "Big-Huckleberry-310",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Something I’ve learned is that marriage and children never ever ever fix relationships, they only amplify the problems you originally had. I know it seems like “throwing away” all this time invested but what happens when you’re 15 years into the relationship and still feeling this way? And now you have kids? And now you have a house together? It just makes it more messy and complicated and delaying those gut feelings you have is never a good idea. You felt strongly enough about this to come into a relationship sub and ask strangers on the internet what you know you should do, but are too afraid to do. I’m not going to tell you how to live or handle the situations in your life but trust those gut feelings. They’re not normally wrong.",
                            "score": 1,
                            "author": "psalter1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for support. It's not normal for me to went this kind of information to anyone or internet at all and I'm glat that you've told me what my gut is telling me pretty long now. Not like I'm about to do any conclusion for this, but I'll take it into an account.",
                                    "score": 1,
                                    "author": "Big-Huckleberry-310",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Of course man! You definitely don’t have to make a decision now, but your mental health is a priority, don’t let anyone tell you otherwise! I wish you the best of luck friend and hope you can find happiness, whatever path that may be :)",
                                            "score": 1,
                                            "author": "psalter1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}