{
    "id": "149252j",
    "score": 0,
    "title": "My [F37] BF [45M] think I disrespect him by adding his friend on FB",
    "author": "ThrowRAlivebetter",
    "date": 1686730318.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/149252j",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nDon’t remember exactly why I accepted his friend’s friend request. I am guessing it was because I saw there were mutual friends or I mistaken him as someone I know, I added this guy who is a friend of my BF. As this “friend” is a loan officer, I am guessing he is adding people on FB to get potential clients. And he has wife and kids, I am sure he has no other intention. But my Bf said it is the principle that you should not add friends wife or GF on social media. And it is me that disrespectful to add a friend of his, since I don’t even know this person.\nThere was zero interaction between this person and me. But now my BF is calling me pofs and I have no boundaries and no respect. He will show me no respect so I know how it feels.\nI don’t think he should control how I manage my social media? How can I communicate to him that this is just normal social media thing?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Your boyfriend is being ridiculous - and this from a grown-ass man of 45?\n\nIf he is so 'disrespected' over something so minor, he must have very tender baby fee-fees and you two should probably break up so he can find someone from the 1800s.",
            "score": 1,
            "author": "WildlifePolicyChick"
        },
        {
            "level": 0,
            "comment": "He has a right to boundaries and has now expressed one: don't add people from his friends list if you don't know them. You now have a choice: to respect his privacy and boundary, or disregard it and create more conflict.",
            "score": 1,
            "author": "MercyForNone"
        }
    ]
}