{
    "id": "1492p4i",
    "score": 1,
    "title": "My (29M) love for her (27F) is ruining my peace and any suggestions dealing with this kind of uncertainty in relationships?",
    "author": "chaostero",
    "date": 1686732513.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/1492p4i",
    "media_urls": [],
    "other_urls": [],
    "postText": "\n\n\nSorry this is going to be a long post. \n\n\nI love her so much, we met through a dating app we lived in different countries tough same nationality. It was a long distance relationship all along for the last 8 years. We just met 7 times in total and we absolutely loved each other's company and were serious about marrying as well. \nBut last two years were traumatic for me having career problems and drained me mentally and financially. So whenever she we had serious talks about marriage and future I'd panic and say that I'm not ready yet. She became very insecure and vulnerable and I was called a coward for promising a future and now act like a pusssy. I hated everything, I was depressed and felt numb. We told each other let's take a break for a while and focus on our careers first. In those two weeks of break she went on a dating site and started talking to a \"sweet guy\", she told me how good he is and such a gentleman and what not. I was pissed but I felt she was exaggerating to get my attention. And after a two months she goes to his city and meets the guy and stays with him for two days. It fucked my brains and she gives me every detail of what they did, them making out, and how good kisser he is and yet says she loves only me and can't think about anyone else. I still tolerated coz I was in my own shit and she had me feel enough guilty for not supporting her when she was insecure and to feel grateful for the guy to show some love that she deserved. She never regretted any of this. \n\nI came back to my country and was broke and working on my startup and fighting depression. She wanted to meet me since I was back in the country after 4 years but I wasn't mentally prepared for it nor I could afford fancy dates. She said she doesn't fancy anything and just needs my love. She eventually came and stayed over the weekend with me and it was good. I started feeling alive and had a new found motivation. \n\nShe went back to her place and started talking about marriage and stay stuff all over again. And how I kept her hanging all these years and still not ready for anything serious. To the point that I couldn't work anymore. I used to shut myself in the room and do nothing for several weeks. No work, barely sustaining on some savings. This went on for a month and she gave me an ultimatum asking if I want to settle down with her or not. I was angry and said no. The next day she sent me a breakup text. The next week she booked flights to my city, I thought she'd surprise me to cheer me up but only to realise that her fling whom she met the last time lives in my city. She went on a trip with him for ten days. I called her friends they said not to bother her and to give her space. I couldn't resist i texted her saying I knew she was in town and I want to meet her so badly and fix our relationship and we'll work it out. Apparently the guy saw that and she felt awkward and said she doesn't want to meet me. \n\nShe went back and calls me. Blames me for everything and calls he a coward. And that now I'm jealous coz she decided to move on and with a guy otherwise i wouldn't have bothered her. I begged for another chance. She kept saying how good the other guy is and how much he loves her. Apparently they had sex too which we never did even after being together for 8 years. And tells me coming back to me means to hurt this guy and his feelings. Everyday since then she feels guilty saying how he loves her and she doesn't know what to do and asking me not to feel bad about her situation. \n\nI don't even call her these days coz it comes busy and she texts me she's on call with him and I shouldn't feel bad about it. \n\nThis week she had an accident and i was freaked out and wanted to go see her. I was in tears coz she might have to undergo a minor surgery, I was checking my flights and got her message asking her if it was in her karma to undergo a surgery for hurting the other guy's feelings while he loved her unconditionally and took her on a trip while he was just her rebound and if it's the god's way of punishing her that she doesn't deserve a life. \n\nLike wtf! I'm just so fucked right now. I can't even process what's going on in my life and her life.\nPlease tell me if anyone were in similar situations and how did you deal with it.",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/relationship_advice. Please make sure you read our [rules here.](https://www.reddit.com/r/relationship_advice/wiki/index) We'd like to take this time to remind users that:\n\n* We do not allow any type of [am I the asshole? or situations/content involving minors](https://www.reddit.com/r/relationship_advice/comments/r6w9uh/meta_am_i_overreacting_am_i_the_asshole_is_this/)\n\n* Any sort of namecalling, insults,etc will result in the comment being removed and the user being banned. (Including but not limited to: slut, bitch, whore, for the streets, etc. It does not matter to whom you are referring.)\n\n* ALL advice given must be good, ethical advice. Joke advice or advice that is conspiratorial or just plain terrible will be removed, and users my be subject to a ban.\n\n* No referencing hateful subreddits and/or their rhetoric. Examples include, but is not limited to: red/blue/black/purplepill, PUA, FDS, MGTOW, etc. This includes, but is not limited to, referring to people as alpha/beta, calling yourself or users \"friend-zoned\", referring to people as Chads, Tyrones, or Staceys, pick-me's, or pornsick. Any infractions of this rule will result in a ban.  **This is not an all-inclusive list.**\n\n* All bans in this subreddit are permanent. You don't get a free pass.\n\n* What we cannot give advice on: rants, unsolicited advice, medical conditions/advice, mental illness, letters to an ex, \"body counts\" or number of sexual partners, legal problems, financial problems, situations involving minors, and/or abuse (violence, sexual, emotional etc). All of these will be removed and locked. **This is not an all-inclusive list.**\n\nIf you have any questions, please [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Frelationship_advice)\n\n---\n\n#This is an automatic comment that appears on all posts. This comment does not necessarily mean your post violates any rules.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "she is not worth it. don't marry her.",
            "score": 1,
            "author": "Majestic_Spread3964"
        },
        {
            "level": 0,
            "comment": "&gt;It was a long distance relationship all along for the last 8 years.\n\nHow were you not able to establish an actual relationship within eight years?\n\nThat's far too long for a LDR to last.\n\n&gt;So whenever she we had serious talks about marriage and future I'd panic and say that I'm not ready yet.\n\nIf you aren't ready after eight years, then...\n\n&gt;She went back to her place and started talking about marriage and stay stuff all over again. And how I kept her hanging all these years and still not ready for anything serious.\n\nShe was absolutely right. You didn't make a move in eight whole years, then buried your head in the sand when confronted with reality.\n\n&gt;I was angry and said no.\n\nSo, you dug your own grave.\n\n&gt;which we never did even after being together for 8 years.\n\nBecause you never made any effort.",
            "score": 1,
            "author": "newfakestarrysky"
        },
        {
            "level": 0,
            "comment": "She’s been with you for 8 years. If you’re not gonna marry her and start a life with her she’s gonna move on to someone else. You need to stop sulking about and get your life together. Complaining about your life won’t help. Show her you still care about her. If she’s not interested then you need to start to move on.",
            "score": 1,
            "author": "ALPHARexHusky"
        }
    ]
}