{
    "id": "b1tpdw",
    "score": 31687,
    "title": "Should I (48m) tell my wife (44f) that I received a sex tape of her in the mail?",
    "author": "thrownitawaystdy",
    "date": 1552750596.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/b1tpdw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Throwaway.\n\nThis is an odd thing. Wife and I have been married 20 years. I’ve never suspected her of cheating and our sex life has been outstanding.\n\nFirst of the year, I receive a package in the mail. It’s a DVD addressed to me, and a typed note that says “your eyes only”. It’s my wife having sex , separately, with three guys. She was younger, much younger, based on body and appearance and hair style it was around the time we were going out—either before, during, or after we were engaged (she grew her hair longer for the wedding and kept it that way).\n\nFirst I’ve no idea who sent it to me other than one of those three guys in the DVD - none of which I know. I’m assuming it’s one of my wife’s ex. Second I’ve know idea why they sent it. Are they trying to say she was screwing around on me? The tape isn’t time stamped so I don’t have a frame of reference. She kept her hair short for years until we were engaged so it could have been during a block of time, certainly before we dated. \n\nAnd also what are they trying to achieve if this was taken before we dated? I know my wife had other partners. Hell I had three times the partners she did before we married but that was 20 years ago I think we’re past that. But apparently this person or persons isn’t.\n\nThe whole thing is strange. I’m not sure what’s going on. I haven’t told my wife, I’m not sure how she would take it. She’s very sexual and adventurous but I don’t think she’d like the idea of her past catching up to her. But I don’t think I’ll get to the bottom of this unless I tell her.\n\nEDIT - update. I’m overwhelmed by the responses. Thank you for your interest.\n\nI did speak to my wife yesterday afternoon. Some mentioned letting her watch it in private and I gave her that option. She did and we talked at length. Some of it is a bit clearer now.\n\nThe two “amateur” looking videos are two roommates, taken on the same night. That’s why the camera doesn’t move and that’s why the room is the same.  I asked why the bed looks different and she replied the sheets were a bit messy so they changed them before they had another go. \n\nThe other is a boyfriend she dated when her and I met, before we actually started dating. She knows this man is friends with one of the before mentioned roommates and thinks it’s him who got the three videos together and sent them to us. \n\nWhy?\n\nShe admits that last summer he tried connecting with her on Facebook. When she did he tried to make it sexual again so she stopped. She thinks he sent the DVD to cause an issue with us.\n\nFor the first time I now have doubts. Her answers are logical but seem a bit off to me. And honestly I may be just upset that she did two guys in one night - I know it was 20 years ago but that’s still hard to take call me shallow if you want. Also she didn’t seem shaken by the DVD or the fact I had it, merely irritated that this person sent it. I had the idea she’d rather I didn’t have it but now that I did, oh well. \n\nIt still leaves many questions unanswered, such as why the tapes are from 96-97 and the DVD was made in 2013 but I’m just getting it now? That many be minor but it may be everything. Plus how does this gentleman know where I live - Facebook doesn’t give you that information. Being in contact with someone does so now you see why I have doubts.\n\nThanks to you all for your concern and feedback. I love my wife and cherish her, and her past is her past, but for some reason it’s slapping us in the face right now. I will take some time between the two of us to figure out what is truly going on. \n\nEDIT II - I want to clarify something. I’ve been getting a lot of feedback, mostly negative, where everyone is irritated with me that I’m upset with my wife for being with two men in the same night. None of my business, it was 20 years ago I should man up, that sort of thing.\n\nLook, i said it was hard to take. Most men understand their partner was with different people before them. But SEEING their spouse with two men on the same night is hard to handle. I didn’t say I was changing my view of her, or leaving, or any other angst you want to put on me. It’s just a difficult thing for a married man to see and realize. I’ll get past it , but it’s not an easy thing. And for everyone who says “it was 20 years ago lighten up” I challenge you to sit back, grab a beer and watch two young men have intercourse with your wife on the same night and see how you feel about it. Frustrated at best. You won’t love her less but you’ll not feel great afterwards trust me. So thanks for everyone calling me an asshole but until your in that position I’ll ignore you thank you very much .\n\nFINAL EDIT - this will be my final edit. Thank you all for your support but all I will say is, it’s time for me to make some decisions. I hacked into my wife’s Facebook account - childish and immature I’ll admit but I did it nonetheless. And I found things disturbing enough that I need to think long and hard about what I do next. I’ve given her the benefit of the doubt through this entire thing , now a shadow had been cast and I’m questioning her more than ever before. Heartbroken is putting it mildly. It’s time for me to work on my life and my self. Thanks to everyone and their interest .",
    "comments": [
        {
            "level": 0,
            "comment": "Someone is sending you what is basically revenge porn with a smaller audience. Yes, tell her. ",
            "score": 2688,
            "author": "burntpumpkinpie",
            "replies": [
                {
                    "level": 1,
                    "comment": "My ultimate concern is that it's 20 years later, and whomever sent it knows where they live. If they're psychotic enough to send the video, who knows what else they're capable of.",
                    "score": 973,
                    "author": "Panuccis_Pizza",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Knowing where they live is super suspicious. Either they have a creepy stalker or they're still in touch with his wife.",
                            "score": 346,
                            "author": "JohnStamosBRAH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or they live in a state that has public voter data. You can find the address for anyone in Florida for example, all you really need is their name and city (assuming they're a registered voter)",
                                    "score": 133,
                                    "author": "secretlives",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually if you know which state/county they live in and they own property that’s in their name and not an LLC, all you need to do is go to the local auditors office and search for their name. I used to be in the business of finding people (not creepy, I used to negotiate mineral lease agreements and it was a tool used to mail letters to people), and this is how I’d find people that lived one place and owned property another place. ",
                                            "score": 56,
                                            "author": "ctang1",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s very strange to me this person had 3 tapes and combined them, to me its either the last ex and they were open about previous tapes and maybe she was the holder of those tapes and shared them with the final bf, or the 3 men are somehow related?  Friends maybe?  Or these are online and someone found them and combined them.  I’d be curious to hear from the OP if the rooms were all the same room?  This is so strange.  ",
                    "score": 87,
                    "author": "Macgruber57",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been baffled by this too!\nA sex tape with a past flame, sure. Three separate movies through different sexual partners, though? Who could possibly have access to all three to make a compilation? \n",
                            "score": 66,
                            "author": "neuromantic92",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I honestly thought upon first reading it that maybe the wife sent them as a spicy game.  She would obviously have access to all three videos and it would explain knowing the correct address 20 years later. But since OP is so deeply confused this obviously isn’t some kind of kink they’ve discussed previously. They also kind of sort of make it look like she was cheating on the past, which I imagine the wife would’ve considered if it was her. So now I’m not so sure anymore. This is a weird one. I look forward to an  update if we get one.",
                                    "score": 42,
                                    "author": "sabayawn",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have a more reasonable explanation:\n\nThe wife kept all of these videos she’s made in the past, potentially on a laptop. She went to get her laptop checked out, and creepy techies went through her files and burned a copy of the three videos she had. \n\nThis would explain how the sender had their address/name AND how they were able to compile three videos with three people into a single movie.",
                            "score": 59,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Separate tapes? I thought it was a gangbang 😂",
                            "score": 82,
                            "author": "JohnStamosBRAH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think this is the first time a gangbang with 3 dudes makes **more** sense than 3 separate dudes at different times...",
                                    "score": 49,
                                    "author": "corruptcake"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly what I was thinking? Same room, video recorder? Why would one person have 3 sex tapes? ",
                            "score": 17,
                            "author": "drawbored",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s actually pretty disturbing that someone sent you this 20 years later. Something about the time frame is unsettling. Why NOW? Is it a joke? Is someone trying to hurt your marriage? Is someone obsessed with your wife? WHAT IS GOING ON HERE! Definitely tell her, who knows she might be able to crack the case. ",
            "score": 7871,
            "author": "-elleryqueen-",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what I don’t understand. If it’s a more recent tape I could get the endgame but this was around the time we dated-before we dated. What are they trying to do here? Are they still obsessed with her 20 years later? Or are they trying to get me to think she cheated while we dated? Questions I don’t have answers to ",
                    "score": 3964,
                    "author": "thrownitawaystdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s what makes it even more creepy. You need to tell her because;\n\n1) someone could be stalking her. It’s a safety issue if you don’t warn her. To be still carrying around a tape that old is creepy as hell.\n2) someone could be preparing to blackmail you, get ahead of it and just tell her\n3)you shouldn’t keep something this big between you two. Keep it open and honest. Maybe she got a recent text or IM recently and she turned them down. She may have details to help you guys solve what’s going on.\n\nI would be supportive. It was before you were married and it sounds like this guy wants you two to fight over this. He isn’t worth your time. Be honest. Good luck. ",
                            "score": 1669,
                            "author": "RewardKristy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; someone could be stalking her.\n\nyeah my first thought too.\n\nSomeone is stalking her cause they were involved at some point and the stalker is hoping to break them up so he can swoop in.  It means he's watching.  It means you need to figure out who the fuck this is so you can get a restraining order. ",
                                    "score": 642,
                                    "author": "DarkwingDuckHunt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 70,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe something caused them to recently rebound in the interest?\n\nMaybe their life is on the skids and they have become reobsessed with her?\n\nMaybe she shot them down when they tried to reconnect on social media and they are doing it as a hail mary to break up the marriage? \n\nMaybe they lost the tape for a long time and recently found it again and never stopped being obsessed with her? \n\nMaybe it's a woman associated with one of the men, found the tape, and are angry with their partner and are just trying to slut shame the woman?",
                                                    "score": 145,
                                                    "author": "CricketPinata",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Maybe it's someone who just came out of prison after all these years?\n\nBut... Why would One guy have a video of OPs wife having sex with Three guys?\n\nWas he the cameraman? \nWas he her pimp back then that kept her actions on tape for some weird pimpy reason? (seriously, I don't mean that as a diss or anything OP! I'm just brainstorming possibilities here and I'm sorry if I made you sad or mad man)\n\nDon't touch the DVD any more OP. Not until forensics has done their jazz on it.\nWhen you tell your wife run the videos from a backup source and put the disc somewhere safe both for when the police investigates it and safe from your wife If she flips the hell out when she hears about it.\n\nAs a lot of people has said you should both call the cops and tell your wife.\n\nWe need an update sir. It's fascinating, interesting, And scary at the same time and I hope you both stay safe and that the scum who did this to you two will get what's coming to him!",
                                                            "score": 52,
                                                            "author": "iswallowedafrog",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I would really hate to have people investigating a sex tape of me... But that is 110% the thing to do no questions asked.",
                                                                    "score": 12,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe one of the 3 guys kept it for himself and HIS significant other found it, got pissed, and sent the tape to stir everyone else up?",
                                                    "score": 24,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Came here to say this. OP you need to tell her. You are just a conduit here. It sounds like you have a really solid marriage and you can get through this but you have to work as a team.\n\nI'd also call the police. Not sure what it looks like where you are but here we have family safety teams largely headed up by female officers and these women have seen a lot and are highly trained in managing things like this.\n\nOh and the obligatory reference to tell you to read the Gift of Fear by Gavin De Becker. ",
                                    "score": 100,
                                    "author": "ChopsNZ",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is pretty much no way to get any answers without telling her. \n\nAnd without telling her, she may also be at risk. Obviously, I really hope not. But that is a little scary. I don’t have any tapes or videos from me hooking up with people even from just 5 years ago. Someone saved this a very long time. And, unless y’all have lived in the same house for decades, they’ve also tracked where she lives (and clearly know she’s married to you, probably a lot more) \n\nI don’t want to scare you, but this could be something much more than just a tape sent over. People saying stuff about blackmail is a definite possibility. Although, it sure sounds like, if that’s the case, she didn’t give them what they wanted. \n\nGood luck! I hope it turns out to be nothing big!",
                            "score": 1276,
                            "author": "tomorrowsgirl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 303,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly. \n\nI can’t even think of a single explanation that wouldn’t warrant involving police. Although, that’s not to say it isn’t impossible. ",
                                            "score": 87,
                                            "author": "tomorrowsgirl",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There’s definitely a possibility of a safety issue. I haven’t moved a lot but 20 still goes back 4 addresses for me.",
                                    "score": 39,
                                    "author": "bloviateme",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My guess would be they want to harm your marriage somehow. Especially considering the “for your eyes only” message. If you can, I would track where it came from. Was it hand delivered? Either way - this is VERY disrespectful to your wife.",
                            "score": 875,
                            "author": "-elleryqueen-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also, if it was dropped off in a mailbox without postage, the person who dropped it off could be subject to a fine of up to $10k",
                                    "score": 374,
                                    "author": "Gregarious_Raconteur",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is that actually true? I’ve put letters in mailboxes before instead of mailing it. Is that illegal?",
                                            "score": 201,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 483,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol, this would be a great bot.",
                                                            "score": 154,
                                                            "author": "keyser-_-soze",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "*Criminal* Lawyer Bot",
                                                                    "score": 129,
                                                                    "author": "westartedafire",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "we need to get r/legaladvice to work on this bot",
                                                                            "score": 45,
                                                                            "author": "pilotmind",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "MY CLIENT MISSPOKE. HE MEANS HYPOTHETICALLY. BEEP. BOOP.",
                                                                            "score": 39,
                                                                            "author": "ShrimpCrackers"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Haha yes! ",
                                                                            "score": 20,
                                                                            "author": "keyser-_-soze",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "My client has nothing more to say.",
                                                                                    "score": 55,
                                                                                    "author": "Yocemighty"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Alleged criminal lawyer bot",
                                                                            "score": 17,
                                                                            "author": "Fin253"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "this guy right here USPS ☝🏻",
                                                    "score": 36,
                                                    "author": "Randy_____Marsh"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yup\n\nhttps://www.law.cornell.edu/uscode/text/18/1725",
                                                    "score": 67,
                                                    "author": "Gregarious_Raconteur",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not legal but no big deal if you are friends. I doubt you'll get in any trouble for putting a note in a friend's mailbox. Lol",
                                                    "score": 62,
                                                    "author": "Terok42",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wait - you're telling me that I can't put a note in my neighbor's mailbox?? You mean I have to MAIL it to them? That's preposterous. ",
                                            "score": 48,
                                            "author": "FinibusBonorum",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You could put it under their door. IN their mailbox is the potential issue.",
                                                    "score": 30,
                                                    "author": "babble_bobble",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You can even stick it to the side of the mailbox, or jam it behind the flag, but inside the mailbox is for the official use of the USPS only.",
                                                            "score": 40,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Your country is weird why does the government control your mail boxes ",
                                                                    "score": 54,
                                                                    "author": "weaslebubble",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I have two guesses. 1) it's just an old law from when the postal service was much more important...as in like the only way to communicate long distance. Mail is still super important so the law remains. \n\n2) Sort of the same reason as 1, but it's important mailboxes are protected because they contain personal, private information like bank info, health info, etc. I don't think protecting that stuff is weird at all.",
                                                                            "score": 28,
                                                                            "author": "CoffeesAndBeers",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Lol this thread it just like going on YouTube to look up a song and 3 hours later, you’re learning how to communicate with giraffes",
                                                                                    "score": 46,
                                                                                    "author": "My_slippers_dont_fit",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The only logical bit I can think out of this is that one of the men had to have sent this. I agree that you should show this to your wife while explaining that you were concerned about what was on it and you think she needs to see it.\n\nI don’t agree that you should play this like a surprise for her and act like you never saw it. This is a tape of your wife having sex with someone other than you so without any warning your wife may be genuinely afraid that you’re going to think the worst of her, even if it’s not the case. No need to put her through that kind of emotional trauma.\n\nComing to her and telling her what you found and showing her that you trust her will mean the world to her and shows that you truly trust and care for her over any feeling of jealousy or anger.\n\nIf you address this as a couple and as partners, you can hopefully come out of this stronger because this is certainly a weird situation. Someone sent this maliciously and maybe your wife would know who is trying to do this. I hope the best for you in this situation.",
                            "score": 256,
                            "author": "Legolasleghair",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "please talk to your wife because I am afraid for her safety. This is some weird behavior and it just feels unsettling.",
                            "score": 337,
                            "author": "SarahDeeno",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yes. and maybe u should go to the police too.",
                                    "score": 36,
                                    "author": "bitingleon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What if one of these ex lovers got divorced and tried to reconnect on FB or something and was rejected.\n\nYou should tell her only because her boss might get same video.",
                            "score": 42,
                            "author": "derphurr"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe they approached her recently and she shot them down so now they are trying to break you guys up.",
                            "score": 84,
                            "author": "chito_king",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Please give us an update later, OP.",
                            "score": 89,
                            "author": "GSDNinjadog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pllleeeaaasssseeee give us an update. What a mystery! I hope all goes well, op",
                                    "score": 34,
                                    "author": "hillsa14"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There\"s always the possibility that this is something a past partner only rediscovered recently, and they plan to use it to blackmail you.  I imagine the kind of loser that would send the DVD to you is the kind of loser that would subsequently try and get you to pay them an exorbitant sum to keep it off porn sharing sites.  ",
                            "score": 26,
                            "author": "GloomyPart",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "By the way this is revenge porn, and it's very freaking illegal.  I'd call the police and file a report.",
                            "score": 92,
                            "author": "sneaky_b3av3r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But definitely talk to your wife first, then go to the police ",
                                    "score": 26,
                                    "author": "x-Kitty-xo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was wondering if it’s someone obsessed with you instead of your wife. Someone who wants to hurt your marriage. Maybe someone who has a crush on you. ",
                            "score": 211,
                            "author": "prplehailstorm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On me? That’s weird. The tape is all about my wife I’m not in it... I’m sorry I don’t see what you’re getting at?",
                                    "score": 158,
                                    "author": "thrownitawaystdy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They're saying that someone either hates you and wants to ruin your marriage (hoping you get mad at your wife) or wants you to get a divorce because they want you to themselves   ",
                                            "score": 345,
                                            "author": "se7en_7",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "would be really random for some rando who has a crush on op to have access to not 1 but 3 different sex tapes of his wife with 3 different guys... ",
                                                    "score": 61,
                                                    "author": "AlligatorChainsaw",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Agreed, this is a nearly impossible scenario ",
                                                            "score": 33,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Maybe someone wants you to divorce your wife so she can be there to comfort you.",
                                            "score": 85,
                                            "author": "Pargozi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But how would they have gotten this 20+ year old tape of his wife? Seems pretty unlikely.",
                                                    "score": 40,
                                                    "author": "oenophile_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep. It's most likely someone in  the wife's life circle",
                                                            "score": 21,
                                                            "author": "effifox",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Exactly as the other posters said. It’s very possible this video is up online. Maybe someone who has a crush on you found it and sent it in hoping to get rid of the wife. It’s just a theory. Obviously you’ll need to talk to the wife and find out what she has to say. Either way Im very curious so I hope we will get an update ",
                                            "score": 68,
                                            "author": "prplehailstorm",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It wouldn't be the first time we've seen situations on this sub where the wife/girlfriend's old or current friends tried to sabotage the relationship because they wanted the man. If this was a sex tape that an old friend of hers had for some reason, or maybe even an old mutual friend that you guys share (more likely), it could be a possibility that she is trying to sabotage. ",
                                            "score": 58,
                                            "author": "AvrieyinKyrgrimm"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My ex wife’s high school bf came back into the picture after 24 years from Facebook and she left me because he said he still loved her. Things happen. He could have done all his research from online and this is an attempt to drive a wedge between you two. If you respond with anger it could be exactly what he is looking for. \n\nEdit - word ",
                                            "score": 10,
                                            "author": "garystevenroberts",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The tape wasn’t recent but I think the situation that motivated this person to send you this tape was...",
                            "score": 22,
                            "author": "Bedtimeshine"
                        },
                        {
                            "level": 2,
                            "comment": "One of the guys present (was there a fourth, as cameraman?) has gone through a recent breakup (possibly a 10+ year-long relationship?) and his mind has seized on your wife as being \"the one who got away\" and \"If only she and I….\" I'm pretty convinced that's the case. \n\n(Alternately, it sinks in that the person who suggested that this might've come from a *woman pursuing you* would make a lot of sense if the camera work was done by the woman in question.)",
                            "score": 20,
                            "author": "kimota68",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;&gt;  Are they still obsessed with her 20 years later? \n\nYou know what?  There are dozens of reasons why this could have happened now.\n\nThe ex b/f has found the video at the bottom of the drawer after all these years, and is still a bit pissed of at how she broke up with him.  Annoyed enough to find it amusing to send the video as some kind of late payback.\n\nHell, the ex b/f's soon-to-be-ex-wife could have just found it as she empties the house out and *she* sent it as some kind of revenge on the guy. Nothing to do with your wife other than using her to hurt the ex-husband.\n\nI doubt that this about making you think that she has cheated on you. This is about shock value and it's possibly about your finding out that your wife was involved in a gangbang that she's never told you about.  Plenty of guys would feel very uncomfortable find out about that even twenty years after the fact.",
                            "score": 80,
                            "author": "hungry_dugong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or OP sent it himself and doesn't remember it due to a carbon monoxide leak in his house.",
                                    "score": 25,
                                    "author": "GigaPuddi"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is all the shit I was thinking. It's disturbing and so random! I can't imagine this was sent with good intentions. \n\n&amp;#x200B;\n\nAlso who keeps a sex tape for 20 years? Maybe I'm just a weirdo",
                    "score": 48,
                    "author": "Syrinx221",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My dad told me a couple days ago that he really wishes he could talk to some girl he dated as a teenager because he was so in love with her.  Said he hoped maybe they could rekindle something.. like 40 years later.  \n\nSo it wouldn't surprise me that much if some weirdo was a bit too obsessed so many years later to the point they felt like they should ruin a marriage.",
                    "score": 49,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I need an update",
            "score": 2902,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;OMG yes, I am curious",
                    "score": 483,
                    "author": "GreatUmpire1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "RemindMe! 2 days",
                            "score": 81,
                            "author": "searcherguitars",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "RemindMe! 2 days",
                    "score": 106,
                    "author": "WizardOfPubg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "definitely tell her! if her past is coming to catch up with her, she should be aware of it. also, youll never know what really happened until you ask.",
            "score": 8062,
            "author": "giiibi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup I agree with this. Talk to her. Three possibilities that I can think of. \n\n\n1. Likely someone is blackmailing her or tried to. \n\n2. This is a tape that’s more recent than you think and someone wants you to know. \n \n3. This is a tape as old as you think but someone is hoping seeing your wife with three dudes will cause you problems anyway. \n\n\n\n**Talk to her either way**.  \n\nOr maybe just tell her a tape came in. And you’d like her to see it. And then play it. Gauge her reaction. See what she says.  \n\nYou decide. I’d talk to her about it first tho. \n\nEdit for edit. How did the ex boyfriend get the videos. She’s not sure if he sent them. Does she know he had the videos?  \n\n\n_________________________________________________\n\nEdit 1-2+:   Some other suggestions from comments lol\n\n\n4. She did cheat back then but she's going to play it off like it's option 3 and he has no way of knowing otherwise.  u/yeahokwhateverdude\n\n5.  Family or friend found these online and didn’t know what to do or say. They probably had no clue how to approach the situation... hell I don’t think anyone has a script for this stuff. They figured best option was to mail it anonymously and let you figure it out from there. Washed their hands of the knowledge. u/Sohl_Jalston_Raul\n\n6. She put the tape in the mail for him to find for some reason, which may be she wants to break up the marriage but hopes will do it when he sees the tape, or she thinks it’s scandalous and a little bit naughty and using it as a means to spice up their marriage. u/remember_is_ninja\n\n7. The wife sent it to see how he feels about swinging without having to bring it up on her own.  She has plausible deniability but gets to feel him out on his view. u/Moby_Tick\n\n8. One of the dudes randomly found it and simply thought it'd be funny to mail it to \"whoever she's fucking these days”.  u/Many_Faces_of_Mikey\n\n9.  She sent it to gauge his reaction. u/u-no-u\n\n10.  One of those gentleman received a transmittable disease and this is his revenge. u/mydogisamy\n\n11. She is secretly a mother to a child conceived in the video.  u/mydogisamy\n\n12. She mailed it to the husband herself as some kind of fetish thing.  u/mydogisamy\n\n13.  A emale friend found the tape and sent it. The motive there could be blackmail, jealousy, thing for the husband or some sort of self-righteous truth cleansing BS.  u/hunibe \n\n14.  One of the guys who kept it was dating/engaged to his current wife at the time it was made and she found it &amp; sent it to OP as some sort of way of getting back at the wife (not that I personally think the wife is responsible for a cheating guy’s actions).  u/swarleyknope\n\n15.  Someone someone close to the wife (someone that has access to her belongings from when she was younger) found it and thought he deserved to know, thinking that it was during their relationship. u/Dre6485",
                    "score": 3442,
                    "author": "romansamurai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree except she should NOT be blindsided by this by OP. It is definitely an old video, he knows by the short hair. The wife is innocent until proven otherwise somehow and she is likely going to be mortified and shocked at first. She doesn't need to be tricked by her partner into watching it. In fact have a conversation with her and prepare her. She may even want to see it alone and I think she has the right to request that.\n\nEdited for spelling",
                            "score": 703,
                            "author": "chitowntopugetsound",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right? Could you imagine having an unhinged ex trying to ruin your life, and then on top of it your partner sits you down to show you your own sex tape (which you didn’t know existed) like it’s some kind of “gotcha!” moment? Big yikes.",
                                    "score": 51,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Seriously. Reddit has bad ideas sometimes. That's like the advice of an insecure 25-year-old. It isn't appropriate to give to mature adults who've been married 20 years.",
                                            "score": 18,
                                            "author": "thisisthewell",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think this should be upvoted more",
                                    "score": 77,
                                    "author": "AcanthaMD"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would suggest this but also let her know (if you truly feel this way) that you don't judge her for things that happened before you were together (or serious about each other).",
                            "score": 1407,
                            "author": "TotalBS_1973",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "^ this is important. Some people cant get over the sexcapades their partner may have had in the past and this could be an attempt to ruin your relationship in that manner. So yeah. As long as it is the past...Let the past stay the in the past, unless she was something like an escort or a porn star and never told you...then you go from there. Still try not to judge, it’s her past and you don’t know why she had to do what she did. But, I know for some it may be a deal breaker which is also possible why the partners may never know about it. ",
                                    "score": 945,
                                    "author": "romansamurai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "37!?",
                                            "score": 161,
                                            "author": "fistymcbuttpuncher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In a row?",
                                                    "score": 57,
                                                    "author": "Boombals",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[For the uninitiated](https://youtu.be/tpQqH4H_SUQ)\n\nEdit:\n[Bonus version for Legend of Korra fans](https://youtu.be/TTXhxFvu4I4)",
                                                    "score": 91,
                                                    "author": "Durzio",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I love the buildup, how he asks innocently about Snowball... No clue. ",
                                                            "score": 26,
                                                            "author": "The_Sgro"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "In a row?",
                                                    "score": 51,
                                                    "author": "newfranksinatra"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Try not to suck any dicks on your way home!",
                                                    "score": 117,
                                                    "author": "mdtb9Hw3D8",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 55,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey, you get back here !! \n\n(to the guy that starts following her)",
                                                            "score": 16,
                                                            "author": "major84"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "On that same note this could have come from an angry partner currently of one of the guys in the video! ",
                                            "score": 29,
                                            "author": "mnkygrl80",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This. Whoever sent it is doing it to sabotage your relationship. Please listen to her response and don’t fight. This looks like blackmail and she is your WIFE, best have her back. ",
                                    "score": 189,
                                    "author": "xtrenix",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nicely said.",
                                            "score": 19,
                                            "author": "FloridaGator13"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 46,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Likely someone is blackmailing her or tried to. \n\nYes, this... Tell her - don't just blindside her by playing the tape - and ask if she knows who might have sent it, and why.  I think there's a good chance someone from her past is harassing/stalking/trying to extort something from her, and she probably has a good idea who might have sent it. She could have been trying to protect the OP from the situation, or kept it quiet out of embarrassment or fear of reprisal.  If that's the case, next step is going to the cops.  AFAIK, blackmail and distributing revenge porn are illegal.",
                            "score": 142,
                            "author": "lbreinig",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 196,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. This is the advice I would take. ",
                                    "score": 46,
                                    "author": "grednforgesgirl"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah in this case OP needs to have her back, not get in her face.  She will likely be overwhelmed by shame about this, and making her feel worse won't help anybody.",
                                    "score": 17,
                                    "author": "JayString"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don’t make her watch it in front of you, that feels like some weird, cruel hidden camera prank, especially since you’re not even sure she did anything wrong. Otherwise though, I would do this and simply tell her exactly what was on the tape.",
                            "score": 219,
                            "author": "g7gfr",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is honestly something I've never understood about people in relationships. If you have a problem with a person or a potential one ... fucking talk about it. I've had some very difficult conversations and I've made it through some very difficult situations. But I'm happy they all happened instead of being lied to or having information hidden from me.",
                            "score": 29,
                            "author": "_OP_is_A_",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "\"And then play it. Gauge her reaction.\"\n\nThis is so gross. Why not just talk about it. Your advice is to turn it into a confrontation.",
                            "score": 145,
                            "author": "PMmeyour-dreams",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If I were her, no matter what the background was on the tape, my reaction would be a horrified wtf. I don't think the reaction here is going to be too telling.... ",
                                    "score": 23,
                                    "author": "BeesForKnees"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’d advise against just playing the tape for her. Let her know what’s on it, and then ask if she needs to see it for herself to let her make the decision. \n\nIt’s blackmail, no matter the target. I’m sorry it involves your wife, but do you trust her enough to face this together, or do you choose to trust whoever is seeking to get something out of this conflict? \n\nEven if she’s in the wrong, working with her on resolving it is going to play out far better than just going on emotions and shady business from strangers. ",
                            "score": 25,
                            "author": "kindredfold",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Okay I agree with this except for the last part. That’s fucked up. Tell her what it is, and then offer to either watch it with her or alone. ",
                            "score": 71,
                            "author": "ramenn00dler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unless of course she doesn't want to watch it. There's more than th he choice of watching it with her husband ir alone.\n\nIf he mentions sex tape there is a high probability that she will already know what's on the tape, unless it was filmed in secret.",
                                    "score": 26,
                                    "author": "PMmeyour-dreams",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"Watch it with her and guage her reaction\" is kind of a dick move. They've been married 20 years, he should just be completely open and honest and hope she can do the same. Even if it was while they were dating, at this point it's probably water under the bridge.",
                            "score": 20,
                            "author": "possumosaur"
                        },
                        {
                            "level": 2,
                            "comment": "I absolutely would not surprise play it in front of her.",
                            "score": 12,
                            "author": "Bombingofdresden",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If it were me,I would want to know what it is before I saw it.  I would feel set up otherwise.",
                            "score": 26,
                            "author": "Winewins"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yup, you can/should frame this in terms of a threat to the marriage by an outside party, not by either you or her. You're a team, and this is threatening that.",
                    "score": 117,
                    "author": "FragilousSpectunkery",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah if they have one copy they have an unlimited number. And could send them to family, workplace etc. Treat this as a very serious issue!",
                            "score": 19,
                            "author": "JimboBassMan",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And OP should update us once he knows",
                    "score": 28,
                    "author": "viperex",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell her. She has the right to know someone sent this. Guessing it's likely before you were serious but she definitely needs to know someone has the capability of distributing this maliciously.",
            "score": 1883,
            "author": "mpls123456",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone is trying to hurt her. This is something she needs to know. ",
                    "score": 663,
                    "author": "BreqsCousin",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ya revenge porn is serious shit and illegal in some states ",
                    "score": 250,
                    "author": "Iamthewind91",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You sound very reasonable and non judgmental . I would tell her because this person is trying to cause problems for your marriage . Who knows the reason. It could lead to other harassment and it’s best she know and you can talk about it",
            "score": 652,
            "author": "dbmtz",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the best advice. You obviously love your wife. This is an opportunity to know your partner a little bit better. You may both hurt a little along the way, but growing hurts. ",
                    "score": 41,
                    "author": "StevoTheMonkey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If they can send it to you, they can send it to anyone - forgetting for a moment how you feel about the tape, she needs to know NOW to start dealing with this legally. She may not want to, but she has to face this. I don’t think having a sex tape is bad or anything, but whoever did this is trying to freak her out or potentially ruin her life ",
            "score": 177,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like sending it to her employer. ",
                    "score": 16,
                    "author": "BecauseItsWednesday",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone is trying to hurt her by hurting you. Tell her your not upset but you recieved a video. You dont want to get into detail but herself and 3 different men were in it. She needs to know someone is trying to hurt her.",
            "score": 440,
            "author": "Dragonsblud",
            "replies": [
                {
                    "level": 1,
                    "comment": "And that’s what I don’t get. This was roughly 20 years or more ago. Why send this now? What do they gain ?",
                    "score": 318,
                    "author": "thrownitawaystdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They might be sending it as a threat, to let you guys know they have it. While it isnt a problem in your marriage, it might be a problem for her personally and professionally. \n\n\nDefinitely tell your wife, she might have an idea of who would have the video and why. And I also suggest getting police involved just to be sure.",
                            "score": 234,
                            "author": "butactuallywhytho"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe it’s one of the guys’ current wives? Who knows maybe they caught their husband watching it and got really pissed off. \n\nMy question though, is how the hell do any of these guys have your current address? ",
                            "score": 39,
                            "author": "frankcostello88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was thinking the same thing. Possibly one of the guys in the videos wife found it and knew OP’s Wife back then. Some women can get territorial, even about things from the past. People aren’t hard to find these days if you have the right information. ",
                                    "score": 11,
                                    "author": "Driller4664",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Which is exactly why you should go to the police as well. It sounds pretty scary and might not be the last of it. Talk to your wife and then go to the authorities. Your wife might be able to help the police find out who sent it. ",
                            "score": 64,
                            "author": "se7en_7"
                        },
                        {
                            "level": 2,
                            "comment": "Everyone is saying it might be a threat or blackmail or something like that. It might be. It also might not be, maybe it was uploaded to some porn sight and a friend or family member or someone came across it while they were on a porn site jerking off and felt you should know about it. They might not want to have the awkward conversation with you or admit they were searching for porn.  ",
                            "score": 34,
                            "author": "BillyMac814",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You have to tell her and maybe even go to the police. Looks like someone is trying to hurt her by destroying her marriage ( many people would be very angry to see a such recording of their SO). Someone she knew long time ago knows your name and address. That’s scary. ",
                            "score": 9,
                            "author": "Lilutka",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell her. She should know what’s going on about her.\n\n\nAlso might be more to this like she’s been avoiding telling you to avoid hurting you.\n\nEx:\nmaybeLike that old ex has been harassing her and she doesn’t want you to worry etc. \n\nBetter just to get it out and move on together. You’re partners. ",
            "score": 413,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s an interesting thought. Thanks that haven’t occurred to me either. So much of this is weird I just need to talk to her ",
                    "score": 282,
                    "author": "thrownitawaystdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya man. Don’t let us get in your head. Just talk to her and go from there. we’ll be here for creepy comments or conspiracy theories or bad advice any time you need my man. ",
                            "score": 110,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah my first reaction was “what if they’ve already gone to her and she’s eating herself up inside trying to figure out how to tell you?”.  I agree you seem like a very reasonable guy who can create a safe environment for having this conversation. If you don’t say something, but she finds out later that you knew, I imagine that wouldn’t be awesome.",
                            "score": 19,
                            "author": "FirstChairStrumpet"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, just talk to her. Also, I'd say get the police involved. Can't be too careful with stuff like this. And be sure to let us know what happened. This is so strange I'm gonna be thinking about it all day.",
                            "score": 18,
                            "author": "theusualuser"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;\tYou’re partners\n\nThat's the crux of it. When you got married you agreed to face the rest of life's challenges together. This tape is no different.",
                    "score": 36,
                    "author": "MEANINGLESS_NUMBERS",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just tell her... \"Hey I'm not bothered or upset, but someone sent me this and I don't know from who or why. What do you want us to do about it?\"",
            "score": 77,
            "author": "goobersmooch",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You have to tell her and call the police",
            "score": 715,
            "author": "NURMeyend",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, “revenge porn” is illegal.",
                    "score": 363,
                    "author": "BramBones",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Got me thinking that... Maybe it was not only delivered to him but also uploaded on some porn websites!? ",
                            "score": 90,
                            "author": "foreverlong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope not. That would be terrible.",
                                    "score": 55,
                                    "author": "BramBones",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It would be, but god I can't get it's always sunny out of my head\n\n&gt;And then he posted a bunch of naked pics of me online and that was the last straw.\n\n&gt;Oh, my God, that's disgusting! Naked pics online? Where? Where did he post those?\n\n&gt;I don't know, one of those disgusting ex-girlfriend porno sites.\n\n&gt;Ugh, those disgusting ex-girlfriend porno sites! I mean, there's so many of them though! Which one?\n\n",
                                            "score": 11,
                                            "author": "orionmovere"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m surprised I had to scroll this far to see police mentioned. This person knows where you live, and is sending you illegal items anonymously that has a verrry weird vibe to it. Sure, it *could* just be a warning of cheating, but OP knows that all the evidence presented is from a time that may or may not be when they dated... 2 decades ago. Why wait until now to accuse of cheating. The vibe feels blackmail-y, and the fact that they know where you live and are staying anonymous rather than reaching out through fb or even a signed letter or something like that doesn’t help their case. \n\nI’d A) tell your wife and B (but also really coincide with A in priority)) call the police. They need to have it on record that someone is anonymously harassing you with potentially malicious intent and via illegal means at your home address in the event something more serious happens. ",
                    "score": 71,
                    "author": "SquirrelicideScience",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My question is how did this person get 3 different sex tapes and combine them to make one sex tape? Were they of professional quality filming or was it amateur filming which means a video camera being still on a mount? \nI was curious if a third person filling this?",
            "score": 136,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Two were amateur. The camera was still the whole time and they were out of frame at certain points during the love making. The other one the camera was on a swivel but it didn’t move otherwise. \n\nAs to how this person or persons obtained all three videos of her I don’t know but that is an extremely important question.",
                    "score": 203,
                    "author": "thrownitawaystdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Has your wife had her laptop worked on recently? Maybe she kept these old videos somewhere and a tech support person found them.",
                            "score": 65,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You might want to try to see if these videos are already on the internet somewhere. Maybe there's some reverse video search, something like tineye, but for videos. Or if that doesn't exist you could try searching frames of the video to see if you catch a thumbnail on the web.\n\nIt could be that there's someone who came across the videos and became obsessed with tracking down your wife.\n\nEdit: This service might work. I'd check that they guarantee confidentiality, of course. https://berify.com",
                            "score": 107,
                            "author": "cxseven",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wouldn’t introduce this to the internet. If it’s not already there (fingers crossed) it’s better if it never is. These things never go away ya know. ",
                                    "score": 30,
                                    "author": "Natural7778",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“For your eyes only” means they’re betting you won’t tell her.  Don’t play that game.  It sounds like you trust your wife, so trust her now. ",
            "score": 166,
            "author": "ryanknapper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea, my mother-in-law tells me stuff all the time and then tells me not to tell my husband. She’s extremely controlling, don’t fall for it, just discuss it. ",
                    "score": 31,
                    "author": "livy_stucke",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this an actual burned DVD or is it a DVD that has a video file on it?\n\n20 years ago puts us in the mid to late 90's for when this video was taken. Digital video was around but not completely dominant like it is today. Bug if it's digital and if you have the file and not a DVD that would play in a DVD player, there very well might be meta data on the file. Assuming you're using a windows computer look at it in file explorer and right click it and go to properties. Go through the tabs for any extra information about the file. There probably won't be too much about it. But you might find the date it was taken.\n\nI personally feel like what you need to decide is if she was fucking around while you were dating/engaged, how much does that matter after 20 years or marriage. ",
            "score": 91,
            "author": "Killbot_Wants_Hug",
            "replies": [
                {
                    "level": 1,
                    "comment": "finally a sane comment",
                    "score": 18,
                    "author": "Terapio"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This NEEDS an update. ",
            "score": 44,
            "author": "Just-curious95",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Every comment is suggesting you tell her.\n\nThink about ‘how’ you tell her. If you give any indication that you are bothered by the content then the sender will win.\n\nLet her know what’s on it before she sees it then ask if she’d like you to put it in the trash. Then ask what she fancies doing for the evening, stay in/go out, etc. Make it seem that as far as you are concerned it is from some dickhead and play it down.\n\nIf she wants to talk about it then reassure her. 20 years ago was a long time ago",
            "score": 292,
            "author": "alterperspective",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I’ve not thought about how to approach telling her. It’s not the sort of thing you just drop on someone, and the more dramatic you make it the worse they’ll take it.\n\nThanks that’s good advice.",
                    "score": 208,
                    "author": "thrownitawaystdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Whatever you do, DON'T throw it out. It could be very important legal evidence at some point. ",
                            "score": 121,
                            "author": "MunchmaKoochy"
                        },
                        {
                            "level": 2,
                            "comment": "\"There is something that you should see. I am not mad. I am concerned. I think someone is trying to hurt you or us. I believe its something you need to watch by yourself. and then we can talk about it after. I just want you to know that I love you no matter what.\"",
                            "score": 20,
                            "author": "Wannabkate",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone is trying to stir up shit in your marriage. \n\nUnless your wife sent it to you lol. You said she's adventurous and very sexual; is it possible this is a long con role play type of thing?  It is for your eyes only, after all ",
            "score": 288,
            "author": "dragonfliesloveme",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hadn’t thought of that. That’s an interesting thought. What would be her play in all that though?",
                    "score": 159,
                    "author": "thrownitawaystdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, it's a tape of her with three different partners, correct? She's likely to be the only person who would have access to all three. If it was a disgruntled ex, they may have access to their own tape, but how would they get the others?",
                            "score": 83,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Well, you're seeing her in this very sexual state, you're seeing her as extremely desirable by men...you're basically seeing her as a fantasy object, but she's real, she's right there next to you and you can capitalize on the turn-on and have hot heavy porn sex with this incredible woman. \n\nBut you know...we don't know if she sent it or not, it's just a thought. Seemed plausible since she's adventurous, but you know her best. Would she really do this?  It's risky, it could backfire on her. It's probably more likely that someone else sent it, someone who likes drama or is jealous of your marriage. \n\nYou could ask her if she sent it, and no matter what the answer is, still proceed to have sizzling hot sex. \n\nYou guys seem to have a great relationship, you're lucky to be so confident in yourselves and in each other. If someone is trying to stir up trouble, I think they'll be unsuccessful. Update us if you figure out who sent it, meantime embrace your relationship!",
                            "score": 76,
                            "author": "dragonfliesloveme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is honestly the last thing I’d want my partner to do if she’s trying to turn me on...",
                                    "score": 47,
                                    "author": "Ugly_Single_Near_You",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My first thought was that the wife sending it is the most likely scenario here.",
                    "score": 23,
                    "author": "FatalCartilage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope it's the wife (who did a crap job making this fun/flirty), because the second most likely scenario is blackmail.",
                            "score": 20,
                            "author": "simonsed",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "would make sense with the \"for your eyes only\" but odd anyways",
                    "score": 46,
                    "author": "Ordinary_Feeling",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It would be odd for me....but people and their sexual kinks, there's just no limit it seems. For a lot of people, this might be nothing more than some fun to get the engines going.\n\nI kind of hope the wife sent it, since that would mean nobody is trying to mess with their marriage or hurt anybody, but honestly I kind of doubt it's the wife. Still, fingers crossed lol!",
                            "score": 32,
                            "author": "dragonfliesloveme",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes you should talk about it. Clear the air and get the truth. That can drive a wedge between you guys. Maybe someone is blackmailing her. Maybe someone wants revenge. Maybe someone is trying to destabilize your marriage.  ",
            "score": 29,
            "author": "0359724"
        },
        {
            "level": 0,
            "comment": "I think you should tell her! First for safety considerations: a (possibly) unwelcome character from the past has decided to pop up. Second, for the possible intentions this person might have: to sow discord between you guys. Talk to her, walk through what happened and why this is coming up now, and **treat this incident as a safety and privacy threat.** Don't be foolish and ignore this! Sometimes a man has to show his courage through calm reasoning, wits and wisdom.  ",
            "score": 29,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hey man, at your edit, I don't think there's any reason to be suspicious of her. This happened 20 years ago, and it seems like that guy she shut down may have been the one to send it as payback for her rejecting him.\nI think you need to trust your wife, but also make sure you two are safe. At worst, this guy knows your address and may be emboldened to come do something to you two.\nAt best, its nothing to worry about.",
            "score": 25,
            "author": "LadyAzure17",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This smells slightly fishy to me. Your wife is up to something and she had all those answers prepared. That's why she's hardly rattled by the situation and is trying to play it down. Why is she not absolutely upset by this? Also the guy knows your address, how?! \n\nYour wife has fucked him recently and then broken it off, the guy has been upset about this and has retaliated. \n\nFurther, anyone calling OP out for feeling upset about seeing 2 guys fuck his wife need to back the fuck off. This would be confronting as all hell and not easy to come to terms with despite being 20 years ago. Try being in the same situation and reacting as you are telling OP to react. Trust me you would be in a world of hurt. ",
            "score": 22,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just a thought but could it be videos that are available on the internet ? Someone who knows you both recognised her and packaged them up and sent to you to cause you distress or in the mistaken belief that they were helping ? \n\nIt’s not a big deal at all and I agree with the commenter who gave advice on how best to approach it. Either way, if there were anything more recent it would have been included. \n\nMost likely scenario: one of the dudes thinks because he once had sex with her he has the right to try and ruin her marriage. \n\nLess likely; these were uploaded to the internet and someone else recognised you both, collected them and sent them to you to either alert you or mess with you. \n\nNo big deal if you handle it the right way. Good luck :) \n",
            "score": 22,
            "author": "townfox",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You should definitely tell her. This could be the opening salvo to some kind of blackmail attempt. Don't forget this person knows where you live now as well. \n\n&amp;#x200B;\n\nYou should also definitely give us an update after, I'm dying to know her reaction also. ",
            "score": 20,
            "author": "runostog"
        },
        {
            "level": 0,
            "comment": "I’ll tell you what my immediate gut feeling was. It’s someone who was jilted. And I don’t mean jilted 20 years ago. I think it’s someone she jilted recently. Maybe one of those guys got back in touch with her or came back into her life, they got close and he wanted more and she said no. Or she was crossing a line with him and then decided to pull back after making him think they were something more. Maybe an affair just ended. Youre thinking it’s from the past and why now? Well... maybe its because of something that is happening now. \n\nAlso how did all three sex tapes come together? You said it’s three different guys. Is it all taped in the same room? Any recognizable signs... like maybe its the same guys voice behind the camera? Does it look like its the same camera used in all three videos (possible to tell if it was taped with a vhs camcorder)? Was it vhs? How could 3 videos of 3 seperate sexual encounters be put together on a dvd if it wasn’t a guy she was dating taping the sex and keeping the videos or if it wasn’t something SHE recorded and kept? I mean,  the one common denominator in all this is your wife. If you show your wife, she should have no problem immediately knowing who sent it. How else would 3 different videos be put together if they were in the possession of three different people? And if they were, how would that person know who to contact for sex tapes of her... and actually be given the sex tape? What city was it sent from? Do all of you (you, wife, guys in video) live in the same city still? \n\nMy thoughts on this is that your wife knows exactly who sent it and most likely knows why. After telling her and showing her the videos I’d be asking her to hand over her phone because I think she’s up to something in the present. ",
            "score": 34,
            "author": "Bedtimeshine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 14,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a married woman I cannot imagine watching my husband sleep with anyone on tape let alone two individuals in one night OR three people. PERIOD. I highly doubt the people commenting have been married for 20 years. Do not let them bring you down. I hope you find support in this and do not feel judged any bit. You are 100% right for having your doubts. I would too. Especially with him knowing your address. I am so sorry this is happening to you. ",
            "score": 16,
            "author": "crtsquared315"
        },
        {
            "level": 0,
            "comment": "Honestly, it might be posted online. Someone not involved in the video might have stumbled into it while on a porn site, burnt it to a dvd and mailed it to you to maintain anonymity. They might just want you to know or of concern for you. I just don't think blackmail/revenge as there haven't been demands or negative things said about your wife in any communication (I assume)\n\nEither way, 100% tell your wife. ",
            "score": 14,
            "author": "TheKillerHeuristic",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Jesus I will never ask for advice on this subreddit because people are plain awful. ",
            "score": 14,
            "author": "bluebell-bumbles"
        },
        {
            "level": 0,
            "comment": "What were the things you found on her Facebook?!?",
            "score": 13,
            "author": "Theaterboy"
        },
        {
            "level": 0,
            "comment": "So, my wife had a crazy ex who she told me long ago probably has video or footage of shit they had done. She told me when they broke up he threatened her with it, and swore he'd put it up on a revenge porn site. She didn't *have* to tell me that, but she did, which I appreciated. However, had she not, and I was in a position as you are now, I would be kinda disturbed, and so I'll tell you what I told myself. \n\nYour wife has given you no reason to make you think she was unfaithful. She had the misfortune of choosing psycho partner(s) who would want to destroy her. Being the loving husband that can accept her for who she was and is, is  the piece of the equation that psycho hadn't taken into account. Have her back, tell her, but please don't corner or confront her as if she's guilty of something. You guys are a team, crush this POS by continuing to love and support each other!",
            "score": 12,
            "author": "kcwckf"
        },
        {
            "level": 0,
            "comment": "Can I just point out, 20 years is a long time to develop love, devotion, sacrifice, interdependence, commitment. etc.,\n\nPut none of that on the line, and question as little of it as you can, as you process this yourself &amp; with your wife. \n\nThe fact is, someone sent you tapes of an unmarried woman having sex, that woman eventually became your loving wife. \n\nPerspective. \n\nAlso - we’re on reddit, the seedy underbelly of the internet, so take your “peers” advice with a carton of salt here. Go talk to your wife, in love, &amp; concern for her soon. Don’t sit on this. She’s your partner - so attack this together. ",
            "score": 12,
            "author": "cheerstoourhealth",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You can convert old tapes to dvd. That’s been available since 2005 commercially. I used to work in a photo company and we did a TON of these. We’d take all kinds of media and convert them to DVD for customers. Who ever sent it could have done it themselves- I’m sure these are available now on eBay super cheap. If he was recording her he likely has done it to others and probably is impudent so he’s trying to relive his glory days of different girls each night. I’m sure her shutting him down bruised his ego a bit and he decided to retaliate. Her answers seem plausible and logical. Her reaction doesn’t seem spooked or defensive as though she just got caught cheating. The best revenge is to stay happily married, don’t let an ass like this get the best of you.\n\nJust looked it up on eBay... they’re ridiculously cheap.... starting as low as $10! ",
            "score": 12,
            "author": "helgathehorriblez"
        },
        {
            "level": 0,
            "comment": "This is so interesting and disturbing. Talk to her and you'd find yourselves in the oddest investigation. Haha, maybe you'll catch the wierdo behind this.\nGood luck please update details I'm so intrigued ",
            "score": 11,
            "author": "kingdomofuna"
        },
        {
            "level": 0,
            "comment": "OP please update",
            "score": 10,
            "author": "AcidPack",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My advice is throw the DVD away, man up, and put a lid on your questions. Oh, and you can take it to the bank the tosser who mailed it will mail her one also. If she brings it up, and most assuredly it will be tearing her apart, put your arm around her, tell her it doesn't matter, and don't ever bring it up again. Who am I to blather about relationships? 41 years married last week - [https://www.facebook.com/john.beech.716](https://www.facebook.com/john.beech.716)\n\nSigh, I now see I didn't see the OP's edit and realize he's told her. The jerk wins because he's caused friction in their marriage. Proof being he doubts her explanations. Too bad.",
            "score": 11,
            "author": "jbeech-",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Tell her, plus to anyone reading it never ever do sex tapes.  ",
            "score": 35,
            "author": "aussielander",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is a huge deal. There are two dangerous possibilities here and you NEED to tell your wife. The two of you need to get a lawyer and go to the police.\n\nFirst, blackmail. Do you or your wife have influence at work? Could your careers cause someone to do this to you?\n\nSecond, stalking. I believe it’s likely one of you is being stalked and someone is trying to destroy your marriage. \n\nRegardless, you need to get law enforcement on this and file for a restraining order. \n\nGood luck and PLEASE update us. ",
            "score": 11,
            "author": "volcanii_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hey OP - none of this may help, but a few comments related to the update. \n\n1. If her response/behavior is suspect to you, probe further. You know your wife better than anyone on Reddit. If you think she’s skirting the truth or monkeybranching, simply ask to see their communication on Fb. Sounds like it was relatively recent. I don’t think that’s too much to ask considering one of the guys you just watched her having sex with is the one she was communicating with. \n\n2. Wouldn’t look too much into when the DVD was produced. It was pretty common in 2013 to find an old VHS and have it put into DVD format. \n\nGood luck!",
            "score": 10,
            "author": "rrrrrrrrrrandom"
        },
        {
            "level": 0,
            "comment": "Google your own name and your wife's name and see if you find your address. If you can find it, anyone can find it",
            "score": 10,
            "author": "Informal_Horse"
        },
        {
            "level": 0,
            "comment": "\\&gt;&gt;She admits that last summer he tried connecting with her on Facebook.  When she did he tried to make it sexual again so she stopped.\n\n&amp;#x200B;\n\nThis is outlining what is called an emotional affair.\n\nShe connected with her ex, and was communicating with him, *over a period of time,* as I read OP's post. She did not inform OP that she was now 'friends' again with her ex? How many of these discussions before she 'stopped'?\n\nDuring *one* of their discussions he turned 'sexual' and wife cut off her clandestine, outside-of-the-marriage 'connecting'.\n\nOP: \"Sounds kinky! May I please read that message, dear wife?\"\n\n&amp;#x200B;\n\nSo I would want to see the messages etc., video does not matter much now, new priority . . .\n\n&amp;#x200B;\n\nGood Luck OP!\n\n&amp;#x200B;\n\n&amp;#x200B;",
            "score": 10,
            "author": "maxfreakout",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If this is true, which I'm skeptical about, it's pretty dangerous.\n\n First of all, the amount of time and effort that went into this is phenomenal. Over 20 years ago, we didn't have an eighth of the technology we do now. If she hasn't cheated, which I believe, this can be broken down into a complex series of steps.\n\n&amp;nbsp;\n\nFirst, these three sex videos were recorded with a camcorder to separate vhs tapes. Since dvds didn't come out until 2000 (even then, they were slow to start for the public), this is the only way it can be done before your marriage. Then they would have to be spliced together, either onto a vhs or dvd, years later. This would happen multiple times, depending on the quality of the videos, because they both degrade with time. Not to mention the person would have kept up with not only all this, but your personal address and information. It's not someone at the office that likes you or her. It's someone one or both of you have known for a long time. \n\n&amp;nbsp;\n\nTL;DR - If you feel your wife has been faithful, this is dangerously psychopathic behavior by someone that has known you guys for a long time. The dates and tech just don't match up for any other explanation besides this, or cheating.\n\nAfter further consideration, it's pretty strange that someone was able to collect 3 separate sexual encounters on tape. Are you SURE this isn't some kind of kink thing your wife might be into? Perhaps she is the one that put this together?",
            "score": 19,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Tell her, find out who it is, sue them for distribution of porn or revenge porn, live happily ever after ",
            "score": 17,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "\n\n\n\n\n\n\n\n\nOoh, I know this one from experience!\n\nFrom a practical standpoint:  \n\n1.  Whoever sent this to you without has very clear intentions.\n\n2.  If this had happened when you were together, someone with bad intentions would have included that information.\n\n3.  By not including the timeframe they do exactly what they set out to do and plant a seed of doubt that will slowly poison your relationship.",
            "score": 18,
            "author": "MoreGravyPls",
            "replies": []
        },
        {
            "level": 0,
            "comment": "She needs to know so the two of you can go seek legal counsel and go to the police. ",
            "score": 9,
            "author": "DearMissWaite",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Someone playing it dirty with you. Don't let this between you two.",
            "score": 8,
            "author": "manjeete"
        },
        {
            "level": 0,
            "comment": "Someone is probably obsessed with your wife and that someone knows where you live. I’d talk with her about it and maybe let the cops know. ",
            "score": 9,
            "author": "robinfresno"
        },
        {
            "level": 0,
            "comment": "please tell her and of course let her know you aren’t mad at her for this tape. It’s about her and she has every right to know and can possibly point out these gross fucks. goodluck ",
            "score": 10,
            "author": "drippindior"
        },
        {
            "level": 0,
            "comment": "She has the right to know that someone sent you this DVD. She may even know who it was that sent it. I appreciate that you know can separate one's past from their current self. A lot of guys are insecure and can't do that.",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd tell her. It's 20 years old, so I wouldn't even worry about it personally, but I'd want her to know that someone is being a creep and trying to start drama. Whoever did this is in a pathetic mental space. ",
            "score": 8,
            "author": "naked_avenger"
        },
        {
            "level": 0,
            "comment": "After your update - if you're having doubt go to therapy and possibly couples therapy. It doesn't sound like you're going to get this doubt out of your head on your own. No reason to let it fester and grow.",
            "score": 8,
            "author": "etoneishayeuisky"
        },
        {
            "level": 0,
            "comment": "Its perfectly understandable that you would struggle with watching a sex tape that your wife made, even if it was 20 years ago. Ignore reddit if they say otherwise. ",
            "score": 8,
            "author": "Vaccinate-or-Die"
        }
    ]
}