{
    "id": "fpxm56",
    "score": 39518,
    "title": "My wife \"baby-trapped\" me",
    "author": "Throwrawifebabytrap",
    "date": 1585318386.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/fpxm56",
    "media_urls": [],
    "other_urls": [],
    "postText": "I put baby-trap in quotation marks because I'm not sure what she did is the actual definition of baby trap, she didn't have a kid to make me stay, just against my will.\n\nSo my wife (32F) and I (34M) have been together for eight years. We have a little girl (5F) and a baby boy (2M). I love both of them more than anything and I finally feel like I have everything. A beautiful wife, two healthy kids, a great career, and a big house. The token \"American Dream\", minus the dog, I'm allergic.   \nWhen we talked about kids before, my wife always said she wanted two. I only wanted one, it would be easier and we'd have more money for vacations and stuff, but my wife maintained it's important for a child to have a sibling. I grew up with four and my wife with none, so I guess I understand where she's coming from. \n\nAfter our son and getting through the baby years and sleepless nights for the second time, I didn't want to ever go through that again. Both kids were very fussy and colicky. But when he was a year old, my wife began casually mentioning a third. I would laugh it off but finally she sat me down and said we have to have a third. I said no, we agreed on two, but she said she wanted *four* and three is the compromise. I refused and said I wanted one and we have two. She got angry and called me selfish for taking away her dream of wanting a big family.\n\nA couple days later, she apologized and we had sex. I noticed her drive increased exponentially but so did mine and I was happy to engage her. She was on birth-control, I had a condom, it was all good. Thinking back on it, I probably should have figured something was up, but I was barely handling two little kids and work on top of housework and yardwork and everything. \n\nI came home from work one day, while the kids were at their grandparents. My wife had a huge smile on her face and she sat me down and showed me a positive pregnancy test, literally dancing in joy.\n\nMy first thought was, \"*oh shit*.\" My wife noticed a less-than-happy expression on my face and started screaming at me. She berated me for not being supportive and this was a \"miracle from God\" and I should be grateful. I said I was sorry and hugged her and said I was super excited for the baby. My wife was delighted and later that night she was calling all family and friends to happily tell them the news. When she was talking about the nursery and how we'll convert my office into a room I started to get a little suspicious. Everything was so well thought-out and it seemed like she'd been planning this for a while. \n\nWhen she was asleep, I took the condoms out of the cupboard and ran them under water. Holes.   \nI nabbed her phone and saw she'd set a password. That was odd. Nevertheless, my wife has a terrible memory so I tried her birthday and it opened. Further up were texts with her best friend of my wife complaining how I wouldn't come around. Her best friend suggested \"arrange an accident\" with a winky face. My wife agreed and said she was going to come off of birth control. It went on for a little while, ending with my wife saying that yes, we *were* going to have a 3rd. \n\nSo I woke her up immediately and asked her if this had really been a \"miracle\"? She got that deer-in-headlights look and burst into tears. She wailed and then she got angry. Through tears she screamed I had no right to go through her phone and it's her choice whether or not she wants to take BC, the side-effects are bad and she was sick. She also brought up if I really didn't want a third kid, I should have had a vasectomy. She told me to go sleep on the couch, I laughed out loud and said no, I'm sleeping here, you're leaving. So while wailing she packed a bag and left to her parents. When she called the next day I told her I just need some time to myself. She said that's fine but I need to come around for our child. I told her I wasn't sure if it'd be \"our child\" and she cried more.\n\nIt's been two weeks since then. Governments recommended to stay at home and I knew staying home by myself while also working with two kids would not be ideal and she wanted to see our kids. So we're  in the same house, she constantly keeps on stopping me and trying to get me excited for our kid and planning the nursery and names and how happy our kids will be to get a younger sibling. I've been ignoring her entirely. \n\nWhat do I do? Staying home with her is bad enough and I don't know if I should leave her over this. I don't trust her anymore. She entirely betrayed it. I'm angry. But I have another child on the way.",
    "comments": [
        {
            "level": 0,
            "comment": "This is a huge betrayal by your wife and honestly, could’ve be a deal breaker leading to divorce.  Having a child is a big emotional, physical, and financial decision that should involve two partners.   She’s selfish, entitled, and manipulative.\n\nI would consider the following:\n\n1. Get a lawyer.  Discuss your options.\n\n2. Get screenshot evidence of the texts between her and her friend.  Record her admitting to tampering and lying with her birth control and your condoms.\n\n3. Get a couple’s counselor. You can get virtual sessions during the pandemic.  This is important to either save your relationship or to help mediate a divorce.\n\n4. Get a paternity test.\n\n5. Be honest with people why you two are separate.  She’s going to lie and be manipulative about what happened.\n\n6. Document interactions and record any fights with her.  She can’t be trusted.  Avoid her claiming abuse or other things by having proof.\n\nWhat’s most worrisome, and makes we worried your marriage is over:\n\n1. She lied.\n\n2. She blamed it on you for not getting a vasectomy.\n\n3. She’s not sorry.\n\n4. She doesn’t respect your view, needs, or opinion.\n\nIf she can’t see how wrong she is and how much she broke your trust, hurt you, this marriage won’t recover.",
            "score": 9001,
            "author": "Smiley-Canadian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can I ask an honest question? What do you mean exactly by “document” every interaction? Is it by just writing it down on some sort of diary just so you don’t forget? I’ve seen this phrase over and over and I always wanted to ask.",
                    "score": 1378,
                    "author": "Adiosmundocruel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Great question.  Document somehow with a time stamp.  This can be:\n\n1. Screenshot texts.\n2. Record arguments\n3. Send yourself an email documenting the interaction, e.g.  what happened, who was there, where were you standing, how long the discussion happened, both of your reactions and behaviour.",
                            "score": 1858,
                            "author": "Smiley-Canadian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey Smiley-Canadian (love your username), I just wanted to chime in that while I agree with almost absolutely everything you said, regarding #3, couples counseling is not recommended when abuse is occurring in a relationship - whether it be physical or emotional abuse. Couples counseling with a couple in which one partner is abusive actually runs the risk of escalating the abuse.\n\nThe National DV Hotline offers a great explanation of that here.\n\nhttps://www.thehotline.org/2014/08/01/why-we-dont-recommend-couples-counseling-for-abusive-relationships/\n\nIt doesn't mean that couples counseling is never an option. It just means that the abusive behavior needs to change before that becomes a safe option - and even then, that change requires prolonged and intensive domestic abuse transformation programming.\n\nIndividual counseling would be great; I'm just wary because I regularly see couples counseling recommended on here for abusive relationships and it runs the potential of being quite dangerous.",
                                    "score": 617,
                                    "author": "Ebbie45"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for taking the time to answer. I appreciate it.",
                                    "score": 449,
                                    "author": "Adiosmundocruel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "you can also just journal and write the date and time. it's not as persuasive as something with an electronic time stamp, but works.",
                                            "score": 164,
                                            "author": "kashhoney22"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "in many states, audio recordings only need one sided consent to be legal.\n\nThis would allow you to buy a voice activated recording device that will timestamp the audio files it records.",
                                    "score": 112,
                                    "author": "gordonjames62"
                                },
                                {
                                    "level": 3,
                                    "comment": "Can he carry a go pro on his head to record her?",
                                    "score": 10,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Layers suggest doing everything over text or confirming a vocal conversation via text",
                            "score": 18,
                            "author": "thegreatpumpkin23"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would add to talk to a doctor for a vasectomy just one worry less for the future",
                    "score": 98,
                    "author": "mydaycake"
                },
                {
                    "level": 1,
                    "comment": "Love how if the guy doesn't wear a condom it can be classified as rape because she didn't consent to sex without protection but somehow cases like this are something that flies under the radar. Like he didn't consent to sex without protection either yet she tempered with it. If I was in his position I'd feel pretty violated. To think such a thing would come from a person who I trust deeply would be just horrible.",
                    "score": 91,
                    "author": "Alicex13"
                },
                {
                    "level": 1,
                    "comment": "&gt;She doesn’t respect you",
                    "score": 22,
                    "author": "27yoFwCCtired"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’d be a 100% deal breaker for me. The lying, the manipulation, and leveraging your kids. No going back from that.",
            "score": 7588,
            "author": "tuna_fart",
            "replies": [
                {
                    "level": 1,
                    "comment": "But what do I do? I’m stuck in a house with her. The kids have noticed I’m ignoring her. She WON’T LEAVE ME ALONE.",
                    "score": 4168,
                    "author": "Throwrawifebabytrap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have to make it through the quarantine obviously, maybe you could use this time to start “making arrangements” for how you’ll proceed with the divorce. Contact your lawyer, look into where you might move to, etc. \n\nMaybe spend a little extra time hanging out with &amp; loving on your kids, that might distract them from what’s going on between you &amp; your wife.",
                            "score": 2971,
                            "author": "voiceinheadphone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, don't forget it'll be hard for the kids as well. It's hard, but please try to make it easier for them.",
                                    "score": 883,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The fact that she won’t leave you alone speaks to how little she respects you and your boundaries. You have a big reason to be upset and stay upset. \n\nShe’s trying to FORCE you to comfort her or to tell her everything is fine because \n that what SHE wants. You telling her you need space is a boundary you’re setting, and she’s trampling all over it with no regard for you and only seeking what she wants. Boundaries are really important in relationships. \n\nHer behavior continues to sound super manipulative to me.\n\nEdit: typo.\n\nEdit 2: wow, thank you for the award, it’s my first one ever!",
                            "score": 801,
                            "author": "charisma2006"
                        },
                        {
                            "level": 2,
                            "comment": "There is no quick answer.  This is a long haul.  You might have to pretend, or nod and smile.  Or Tell her to leave you alone.  That she’s not helping.  \n\nShe’s doing everything she can to manipulate you, gaslight you.  \n\nKeep a journal.",
                            "score": 98,
                            "author": "feyrath"
                        },
                        {
                            "level": 2,
                            "comment": "Can you move the kids into a room together and sleep in a separate room? Tell the kids that you and their mom are not getting along right now and need some space, but not the details. This is so manipulative and throughout your post I see a lot of emotional manipulation from your wife, turning the blame on you, crying to get you to stop being upset with her, even telling the grandparents before you to get them on her side. This is a pattern of lying and abusive sketchy behavior. It's better for the kids to have two parents that are happy and separated (might take some time to get back to happy I know) than two parents who are miserable together",
                            "score": 986,
                            "author": "dogsandtreesplease"
                        },
                        {
                            "level": 2,
                            "comment": "Then find ways to leave the house so you can speak to a lawyer. \n\nGo grocery shopping. Go take a drive. You're not chained to her because of the quarantine. I leave my house several times a day without actually going anywhere with other people by going for walks, taking a drive, etc... If your wife demands to come with you wherever you go, then firmly tell her you need space. Plus, I doubt she will come grocery shopping with you because that would entail bringing the kids and, right now, that is not a good idea.",
                            "score": 328,
                            "author": "moosetopenguin"
                        },
                        {
                            "level": 2,
                            "comment": "go for a drive.\n\nCall a lawyer\n\norder a [voice recorder like this one](https://www.amazon.ca/dp/B01BHBCU8K?tag=duc12-20&amp;linkCode=osi&amp;th=1&amp;psc=1)\n\nkeep friendly\n\ntake steps to improve your relationship (more civil) with your wife for the sake of the kids, and for any future legal action.",
                            "score": 197,
                            "author": "gordonjames62"
                        },
                        {
                            "level": 2,
                            "comment": "I am sorry you are in this terrible situation OP.\nvery gently: if I were in your place i would explain to her that you Need to be left alone because she abused you with reproductive coercion. \n2. kids are so sensitive and perceptive-- they would pick up on it no matter how well you tried to hide this anyway so please be gentle with yourself about them noticing-- it cannot be helped at this time. you have just discovered that your partner, their mom, betrayed you on the deepest fundamental level against your expressed wishes and was planning to keep that betrayal secret for probably the rest of your lives. you are processing trauma and grieving over the person you thought you married. the shock of the new monster that is now inhabiting her body and face and voice. it is a nightmare. \n\nit is ok that they sense something is wrong. remember-- you are also modeling to them how to deal with catastrophe (even if they are without the details and context). as parents we can do that respectfully and firmly by setting boundaries with the one who has so deeply harmed us. it would not help to fake it or perform that you are getting along with your wife at this time. that would model something far worse to your kids and they would see through it anyway. simply acknowledge what they are saying so they do not feel gaslit and pivot it immediately to assurances of your love for them to sure up their sense of stability. \n\nagain OP, i am so very sorry to hear about all this.",
                            "score": 122,
                            "author": "gilliandrew"
                        },
                        {
                            "level": 2,
                            "comment": "Well, if divorce is on the table for you, you're going to need to learn how to live with her, regardless.  Being a good father doesn't mean being a husband, and being divorced doesn't mean your ex is your enemy.\n\nShe's gonna be her, you gotta be you.",
                            "score": 42,
                            "author": "ITriedLightningTendr"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; The lying, the manipulation, and leveraging your kids\n\nDon't forget the holes in the condoms.",
                    "score": 189,
                    "author": "daten-shi"
                },
                {
                    "level": 1,
                    "comment": "From my perspective, short of attempting to murder me. i cannot think of a greater crime someone could commit in a relationship. a child is decades of hard work and money. I would much rather have them cheat on me and get pregent with someone else so i dont have to deal with as much long-term BS.\n\nThis is why you need a vasectomy the moment your done with kids.",
                    "score": 70,
                    "author": "spellsword"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Reproductive Coercion ](https://en.m.wikipedia.org/wiki/Reproductive_coercion) \n\nThis is a form of abuse.  \n\nSpeak with a lawyer, get a therapist.  This is NOT okay!",
            "score": 15083,
            "author": "Ruthless_Bunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are lawyers gonna meet with me in the quarantine? I don’t even know if therapist offices are still open. \n\nI guess I should try to voice-chat or something, that might work. This just sucks so much. I hate everything about this.",
                    "score": 5340,
                    "author": "Throwrawifebabytrap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Try to have a phone call or video chat (this applies to both therapists and lawyers). \n\nI’m so sorry you’re going through this, best of luck!!",
                            "score": 2618,
                            "author": "jjss54321"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1275,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work in the domestic abuse field, and domestic abuse programs are doing the same. If he can find one that serves male clients they can also provide him with assistance, though they are not lawyers so their assistance would look more like safety planning, legal advocacy, therapy referrals and the like.",
                                    "score": 606,
                                    "author": "Ebbie45",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;If\n\nThis is so sad.",
                                            "score": 243,
                                            "author": "Haight_Is_Love"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Local Bar Associations are the best bet to find programs.",
                                            "score": 21,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep I know plenty of therapist offices are conducting phone appointments, and I'm sure some law firms will be too! Please OP, don't put this off. The longer you let it go on before contacting lawyers/therapists the more time she will have to convince you that maybe it'll be ok in the end. That it's really more effort to divorce than stay. But she DOES NOT respect you (she wouldn't have taken away your choice if she did!). You cannot trust her. You deserve to share your life with a person you can be loved and accepted by, not someone who will lie and manipulate to get her way, and then TRY TO MANIPULATE YOU FURTHER by giving you this \"It's my choice to stop taking BC\" \"it made me feel sick\" BS!!! You saw the texts, it's nothing to do with feeling sick. And she has a right to stop taking BC but YOU have a right to know that your pre-agreed contraceptive methods have been altered. OP, you know she wants 4 kids. \n\n\nCould you ever feel comfortable having sex with her again? Because you shouldn't. What's to say she won't do it again to get the 4th baby? What's to say she is even pregnant now, and hasn't just bought a positive pregnancy test online and is waiting for you to accept it, and then you have sex and it will have happened for real? It might be far fetched, but the issue is you will never know. Don't settle for this headfuck of a life OP. What would you want your son to do in your situation? Don't stay with her and condone her manipulation; people this messed up don't just manipulate once, they do it constantly. At least separated your kids will get to spend time in the home of a parent who's honest and a good person half the time. Not spend all their time with their conniving, manipulative, selfish mother and their father who accepts her crap.",
                            "score": 249,
                            "author": "Literature_Girl"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, voice call *would* be what would be a good recommendation at the moment BUT you live at the same house as her for the time being. It can be less than helpful to let her know that you take legal steps in this situation.\n\nI usually try not to be the \"do this behind their back\" type but in your case, I'm iffy. She was already ready to break your trust, perform an illegal action and *screamed* at you for not being happy. She could at the least try to cover up, she could also escalate.\n\nSave evidence. Concentrate on that. Also focus on going through this time. When the situation got better, find a lawyer and let them help you. You need to get away from her. She doesn't care about what you want and would get another child - next time, four is the compromise because \"I want five and you wanted three\". And that she screamed at you? That is never a good sign. Get away from partners who scream at you *for absolutely normal reactions*.\n\n(Just to be clear: A partner screaming is always a warning sign IMO but here it's pretty clear that it's mindbogglingly bad because she wants applause for doing something illegal and is ready to scream for what is considered an absolutely normal reaction.)",
                            "score": 466,
                            "author": "ChristieFox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To add onto this, I would have the texts from the phone on hand with her admitting to it. On the other hand, not sure exactly how permissible it is since you technically broke into her phone. If it goes to a legal case she might try to turn it on you and say you poked the holes in the condom. Either way, I agree with seeking counseling and legal advice. Best of luck OP. It’s a rough situation.",
                                    "score": 149,
                                    "author": "Jdog1805"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am a lawyer and my wife is a therapist. We are both keeping up almost a full caseload from home. Many offices are doing this, so if you try to reach out I'm confident you'll be able to find someone in both fields with time to talk.",
                            "score": 139,
                            "author": "swagrabbit"
                        },
                        {
                            "level": 2,
                            "comment": "As someone who was baby trapped I have to tell you - whether you talk to a lawyer or not about the fact that you *were* raped (legally speaking) - please, please, please absolutely make sure you start seeing a counselor - *and* - if you're not jiving with the one(s) you talk to, keep looking for a new one until you find one you do get along with.\n\nI was too young and poor to be able to afford therapy so I did the only thing I knew I could do - I avoided the mother and the child - because I couldn't even think about him without thinking of her, and I'd get irrationally angry.  Actually it was rational, but all I knew was he didn't deserve that, and to at least protect him from that I stayed away.\n\nAs the years passed I realized I'd missed any chance of a relationship with him, so I planned to wait until he was 18, then write him a letter.  When he was 16 someone I was dating said, \"How do you know he doesn't need you right now?\"  I realized I was 16 when she'd trapped me, so I realized maybe I shouldn't wait.  We talk now, but I doubt he'll ever see me as anything but a distant uncle, and over the years I've come to really regret the choices I made.\n\nIf nothing else, for your own health, try to seek a counselor.  You may not want a relationship with this child, but you don't know ... that might change over time.  At the very least they don't deserve what their mother did either.  What she did was not out of love for them.  She probably believes she does but her beliefs are so divorced from her actions she's bordering on delusional.",
                            "score": 140,
                            "author": "workrelatedquestions"
                        },
                        {
                            "level": 2,
                            "comment": "Legally she raped you. She coerced you into sex on false grounds. You need to take this more seriously for the sake of your kids. If she could do this to you, what will she do to them down the road? She seems abusive and narcissistic.",
                            "score": 362,
                            "author": "ChinaCatLogan"
                        },
                        {
                            "level": 2,
                            "comment": "Email or call a lawyer. They’re essential services, so they’re open. \n\nTherapists have been shifting to phone and video sessions, there’s also programs like Talk Space which is  100% online therapy; video, phone, and text options.",
                            "score": 62,
                            "author": "megannuggets"
                        },
                        {
                            "level": 2,
                            "comment": "It wouldn’t hurt to call and ask - my therapist is doing all her appointments over phone/video now.",
                            "score": 20,
                            "author": "LittlestKitten"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Here is the answer.  This is as abusive as a man taking off a condom mid-coitus.  In many states sex under false pretenses invalidates consent and is therefore automatically rape.  Start with what u/Ruthless_Bunny said, keep all of the condoms you've found in a Ziploc bag and call the police to report this as evidence.\n\nEdit: Thanks for the silver!",
                    "score": 1788,
                    "author": "mkfelidae",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 257,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This does seem like the eventual direction that her manipulation will take.  She clearly doesn't care for the OP's feelings, nor has she taken into account what raising children in an unbalanced or deceptive relationship does to those children.  It honestly sounds like she is living in a fantasy of her own self-delusion.  If OP stays with her the moment the delusion shatters will be the moment he finds himself with 4 kids and no support from her as, without a lot of personal growth, she will simply move on to the next fantasy she wishes to live and leave this one in the dumpster.",
                                    "score": 101,
                                    "author": "mkfelidae"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agreed. This is illegal in many states. Lawyer up and prepare for a fight.",
                    "score": 1235,
                    "author": "ILoatheCailou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If he's gonna go with that he should get proof of those texts if he could since this can be very hard to prove",
                            "score": 79,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Agreed. This is illegal in many states. Lawyer up and prepare for a fight.\n\nHas a woman ever been convicted for it though?",
                            "score": 357,
                            "author": "Threwaway42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For lying about birth control to get consent? Yes.",
                                    "score": 724,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Reproductive Coercion\n\nand putting holes in the condoms",
                                            "score": 519,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The text messages show premeditation too",
                                                    "score": 438,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 194,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Probably too late to get screenshots, but tampering with evidence is a crime in itself. If she deletes those messages, the cell carrier may be able to retrieve them.\n\nEdit: as others have pointed out, carriers don’t have the data from those messages but likely have timestamps of the delivery of the data. This would be evidence those messages exist and if she deleted them, that would be a crime on its own.",
                                                                    "score": 204,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 77,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It shouldnt matter. If he wins, then he sets a precedent for others and that's very important.",
                                    "score": 74,
                                    "author": "Diya251",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "There's a first time for everything!",
                                    "score": 49,
                                    "author": "speleosutton"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "and schedule that vasectomy while you're at it.",
                    "score": 102,
                    "author": "raayhann",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is called reproductive coercion and it’s illegal in most states. Please consult a lawyer and when this pandemic starts to die down please consider a divorce.",
                    "score": 84,
                    "author": "threeofbirds121"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd divorce her and yes- she definitely \"baby trapped\" you. \n\nThis is actually a form of rape in several areas of the world. She withheld important contraceptive information from you (going off birth control) and actively tampered with the one you were using (holes in the condoms.) \n\nIs there anyway you can get on her phone again? I'd suggest screen shotting her admitting she tampered with your condoms and went off her bc purposely without mentioning it to you and sending it to your own phone. Hell, I'd even record a conversation between you and her and get her to openly talk about what she did.",
            "score": 1966,
            "author": "annoyed68",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do wire tapping laws allow that? I heard any recordings without the knowledge of the other person is inadmissible court. I’m afraid if I look into her phone I’ll get charged for hacking or something, if it even counts in court.",
                    "score": 633,
                    "author": "Throwrawifebabytrap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends on this state the people who are being recorded are in. Check your local laws find out whether you are in a one party consent or two-party consent state.\n\nhttps://www.justia.com/50-state-surveys/recording-phone-calls-and-conversations/",
                            "score": 246,
                            "author": "Treereme"
                        },
                        {
                            "level": 2,
                            "comment": "OP you should post something about this on r/legaladvice because they would be helpful to you as well",
                            "score": 65,
                            "author": "mrose1491"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This....is awful. Not only was she being selfish, but what kind of fucked up mother thinks it’s a good idea to bring a child into the world against the wishes of her partner? That hurts the child beyond measure because the father will never bond with that child the way he bonded with the other. She has seriously, seriously hurt that baby. It’s selfish, short-sighted, and incredibly.....I don’t even have the right words. As a mother myself, my heart is just hurting for that child. \n\nI personally wouldn’t be with someone like that. \n\nBUT, a situation like this is above Reddit’s pay grade. It’s a delicate, ethical thing that only you should decide going forward. No one would blame you if you left her, but you need to decide how to proceed with the baby. I would really encourage you talk to a counselor (betterhelp.com and talkspace.com are both online options for the time being). \n\nIf you want to ask her to leave, you’re well within your right to do so. You could give her a bunch of resources to find an apartment or call one of her family members to ask if she could stay. Maybe give her some counseling resources as well because you have to be seriously ill to think this is okay. \n\nI wish you the best. This is a hard situation and I’m so sorry it happened to you....especially in the middle of a fucking pandemic.\n\nEdit: \n\nr/legaladvice may be another useful forum for you, including the links u/ebbie45 gave you.",
            "score": 11442,
            "author": "fifthsonata",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t think she planned to tell me, and I guess she was thinking if I did find out I’d love the kid too much to think any different.\n\nI just don’t know what to do and I hate being stuck in a house with her. The kids have started to ask why I won’t talk to Mommy and I don’t even know what to say anymore. I’m so mad at her but I can’t leave two toddlers for her to wrangle.",
                    "score": 4857,
                    "author": "Throwrawifebabytrap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is called reproductive coercion.  It is possibly illegal in some cases.  It is abusive in ALL cases.  Couple that with your multiple examples of your wife screaming at you, and I wonder if she is abusive in general.  If so, your kids are at risk as well.\n\nLoveisrespect.org will be a helpful resources.  So will contacting a lawyer for some information",
                            "score": 4611,
                            "author": "SmallSacrifice",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wanted to tag onto this that Love Is Respect is more specifically for youth relationship abuse survivors, although they will provide referrals to anyone, so the National Domestic Violence Hotline would be a more appropriate option for him!\n\nThey have good information on reproductive coercion. \n\nhttps://www.thehotline.org/2013/07/18/from-broken-condoms-to-pill-tampering-the-realities-of-reproductive-coercion/\n\nThey also provide a list of resources for male domestic abuse survivors here: \n\nhttps://www.thehotline.org/2014/07/22/men-can-be-victims-of-abuse-too/\n\n**I would also recommend that OP consider reaching out to two programs, Male Survivor and 1 in 6. They are both organizations that specifically help male survivors of sexual violence and coercion, which reproductive coercion falls under. They provide 24/7 hotline advocacy, online and in-person support groups, therapy and legal referrals, and educational resources.**\n\nhttps://1in6.org/\n\nhttps://malesurvivor.org/for-survivors/\n\nSurvivorsUK for men is very similar only in the UK, and they also have a team of Independent Sexual Assault Advisors which are essentially legal counselors specific to sexual violence.\n\nhttps://www.survivorsuk.org/",
                                    "score": 2615,
                                    "author": "Ebbie45",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you Ebbie45 for providing constructive advice and helpful resources as always. I am glad you are back.",
                                            "score": 414,
                                            "author": "cornflakesarestupid",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks so much and thanks for the brief bit of light/joy your username gave me :)",
                                                    "score": 226,
                                                    "author": "Ebbie45"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "this is not the first time i seen Ebbie45 deliver a top notch advice. i hope op sees this",
                                            "score": 133,
                                            "author": "selah-uddin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&lt;3 thank you!",
                                                    "score": 64,
                                                    "author": "Ebbie45"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "OP this comment is very important. Please do not stay with someone who is willing to do this, it is absolutely abusive. You owe your children at least one healthy parent, and at this point that is a single happy father is the only option",
                                    "score": 309,
                                    "author": "sheeshbop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "OP, my mother stayed with my abusive father because she \"thought it would be better for us to grow up in a two parent household.\" He never physically hit her (though a lot of physical \"disciplining\" with us) so she somehow rationalized that he wasn't abusive.\n\nI would have MUCH rather grown up in a one parent home than have to go through what I went through. I can't tell you much my father fucked up my mind and affected the choices I made as a teenager and young adult. Not to mention the fact that my mom became a silent shell over the years due to the emotional abuse...and the end result of that was that there was no one ever telling me that my dad was wrong about the things he would say/do to me. I didn't have a stable adult to take care of me. I ended up being abused by one and neglected by the other.\n\nYour kids need one stable parent, and if you're going to be better away from your wife than trying to coexist with her abuse, then please, I strongly urge you to look into that.",
                                            "score": 189,
                                            "author": "Which-Individual"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She’s not usually so screechy. And she’s an amazing mother, the kids adore her. Other than this instance, she’s perfect. I only wish that “this instance” didn’t have to be something so fucking insane.",
                                    "score": 994,
                                    "author": "Throwrawifebabytrap",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Other than that, Mrs. Lincoln, how was the play?\"",
                                            "score": 1462,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 156,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, it *was* a comedy...",
                                                            "score": 35,
                                                            "author": "OrangeredValkyrie"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Holy shit lol",
                                                    "score": 49,
                                                    "author": "geardownson"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Isn't the fact that \"this one instance\" is beyond insane enough for you to question if this really an isolated incident?? I'm sure she's an amazing mother to the kids you already have but she is far from perfect, this being case in point. This is royally fucked up dude, for you and that potential baby. Maybe question things a little more than you are..",
                                            "score": 457,
                                            "author": "darkerthandarko"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She's not an amazing mother if she is willing to create a child through abuse and manipulation.  An amazing mother would not bring a child into the world for her own selfish desires, against the wishes of the father.  Imagine if and probably when that kid finds out how they were conceived....it will destroy them.  THAT is an awful mother, not an amazing mother",
                                            "score": 385,
                                            "author": "SmallSacrifice",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I wanted a third baby. But my husband didn’t. So we didn’t. Case closed.",
                                                    "score": 99,
                                                    "author": "Nectoux"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can confirm.  As a teenager my father told me that my mom didn't want to have children and that having a child or getting divorced was an ultimatum he gave her.  No child (or even adult) should ever have to carry the burden of that kind of knowledge.",
                                                    "score": 69,
                                                    "author": "schneiderhuf"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Also wondering if a 5 and 2 year old would really notice daddy not talking to mommy.. or if she’s using them for further manipulation",
                                                    "score": 118,
                                                    "author": "lost_library"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh mate. If you've ever read this sub you should know now you sound like the women that say \"he's perfect except this one time he beat me to near death, should I consider leaving him?\".",
                                            "score": 618,
                                            "author": "aron9forever",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Right? Men are hardwired to not think we are victims in things like this. She is a contender for worst mother with these actions... She can't be \"perfect\" except for the time where she lied, manipulated, and forced a child on you that you didn't want all while never coming clean. She would have lived this lie her entire life if he didn't check into her shit.",
                                                    "score": 200,
                                                    "author": "boxisbest",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's way above anyone's ability to properly advise you here, but avoid justifying something this significant with \"she's been fine in the past.\"",
                                            "score": 75,
                                            "author": "shortsonapanda"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You need some time away from her to think. In your post along, I see manipulation, reproductive coercion, demeaning you, disrespect. \n\nI think with some alone time, you’d probably see a lot more red flags and likely more examples of abuse. \n\nIntentionally forcing someone to reproduce against their expressed wishes is well beyond the limit of healthy.",
                                            "score": 63,
                                            "author": "neopolitian-icecrean"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;Other than this instance, she’s perfect.\n\nThis is a pretty big thing.  Reproductive coercion is a form of abuse.  \n\nYou can't ever trust her again.  :(",
                                            "score": 42,
                                            "author": "beaglemama"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This one instance is still not good. It doesn’t matter if she’s a great mother 99% of the time, if she screams at you, throws insults, tries to trap you in a relationship with more children 1% of the time, that’s still grounds for you to leave or seek some sort of help. This whole situation is abusive.",
                                            "score": 29,
                                            "author": "bunnybasics"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Your blinders are still on. Take them off. Look at her behavior and personality as if she were a contestant on a season of Big Brother or some other reality TV show. Don't view her as your loving wife. \n\nWhen you practice this, you will find that she's almost *always* had some pattern of unhinged behaviour. A \"perfect\" person doesn't just snap and impregnate herself against your will, so deep into a marriage. \n\nDon't let your past fondness toward her blind your view of her obvious insanity and abusive behavior.",
                                            "score": 10,
                                            "author": "EstoyConElla2016"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Its NOT this instance. Its abusive and insane. Remember that. I read this and my jaw dropped at how anybody could POSSIBLY think this was ok",
                                            "score": 19,
                                            "author": "itsbritneybitch12"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You are using the exact same defenses that defense lawyers use when pleading for clemency for clients who have done something horrendous.\n\n\"Clean record, no prior issues, good kid, bright future, no need to let one little major violent crime spoil that future, right? Never mind that it has destroyed the future of the victim, can't you think of the perpetrator and their other victims????\"\n\n\nWhat you do, whether you resolve this through talk, therapy, leaving, or whatever, remember this:\n\nThis person lied to you.\n\nThis person betrayed your trust in such a fundamentally profound way that it's clear that you will __never__ be allowed to stand in the way of what she really wants, no matter how much it hurts you.\n\nIf anything, I think the kids would be better without __her__ in their lives, because no one should be raised by parents that teach such horrible behaviors to children through example.\n\nBut that's not my call to make.\n\nI'm a random Redditor who hates relationships and has no intention on ever having children.\n\nThe truth is that you aren't here because you want to know what to do.\n\nThe truth is you're here because you already know what you should do, but you're reluctant to do it, and are looking for someone to argue you into or out of it one way or the other.\n\nIf you're looking to be convinced by others to do something, it means you've already made the decision and just want to have some way to not feel guilt over doing the right thing.\n\nJust do the thing. Whatever you were planning to do but came here to hopefully be talked out of. Because whatever happens, there's no way that trust is going to ever come back. There will always, always be that doubt in the back of your mind, \"But what if this is like the baby thing and she's selfishly disrespecting me to get her way again while lying to my face?\"\n\nIt doesn't matter if you are a guy, a girl, or a chihuaha, once that trust is gone, it's gone.",
                                            "score": 10,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I feel like you need more information to move forward. You need to talk to her again and again until she stops being defensive and coercive. “You don’t have the right to go through my phone” is a straw man to avoid talking about the real issue. Keep at this until one day she finally understands how you don’t feel like you could ever trust her again. Maybe how she responds once she understands that will help inform yourself decision. \n\nI would talk to me entire family and hers and explain what happened just to make sure everyone knows. Maybe public shaming will make her change her tune. This isn’t so much a recommendation as what I would do. It’s situation dependent. \n\nThis is going to be a heart wrenching decision for you to make, eventually. I think you should give yourself time to wrap your head and heart around all of it before making permanent decisions though.",
                                            "score": 35,
                                            "author": "ewisnes"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She sounds abusive to be too. For sure a very unhealthy and damaging in the long term type of relationship. I worry about those kids being around her. Someone that crazy, who knows what she says to them when she's alone with them.",
                                    "score": 213,
                                    "author": "ChinaCatLogan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, I was wondering whether it could be a\nClasses as rape by deception in the UK - https://en.m.wikipedia.org/wiki/Rape_by_deception\n\nThe fact that they were both supposedly using birth control, and that she had removed both forms WITH INTENT is rather concerning. That she immediately told friends and family feels like she's trying to build pressure on him to accept it. \n\nI don't think this is something that they will be able to work out just the two of them - I would definitely suggest counseling and am.not sure if he should report it to the police as well.",
                                    "score": 17,
                                    "author": "d0ey"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hmmm, with this woman she might be telling the kids to ask why you won't talk to mommy just as another way to coerce you. Obviously she cannot be trusted. \n\nIf you do decide to stay with her (which is something only you can decide though I would not), you definitely need to get a vasectomy ASAP.",
                            "score": 346,
                            "author": "Tastymeats88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My mother did shit like this. Always tried to poison me against my dad.",
                                    "score": 116,
                                    "author": "ChinaCatLogan"
                                },
                                {
                                    "level": 3,
                                    "comment": "And what's going to happen one day when she's pissed at OP and threatens to tell the kid \"Daddy never wanted you\"? What a great weapon for a manipulative person to have in their arsenal",
                                    "score": 18,
                                    "author": "egg_in_a_trying_time"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don't think the issue is her wanting another kid. The problem is her short-sided, selfish, and manipulative behavior. She went behind your back &amp; broke your consent. Imagine someone agreeing to have sex only with a condom, and you purposefully slip it off. That's flat out wrong.  \n\n\nNot only did she act deceitfully but when confronted she gas lit you &amp; sent you to the couch. I'd have a serious conversation that your trust is broken",
                            "score": 87,
                            "author": "Boneyg001",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hell, it's rape in some jurisdictions, and for good reason. The consent was contingent on birth control, and she lied about one and sabotaged the other, thus no consent from his end at all.",
                                    "score": 20,
                                    "author": "yoda133113"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She is insane!! To go as far as poking holes and preplanning after you explicitly said NO, I wouldn’t be able to come back from something like that. This is like an ultimate betrayal. A third child is a HUGE deal!! I have 2, never wanted any but I love my boys!! If I found out my fiancé was pulling a scheme to get me pregnant I would leave him immediately! He has a daughter and I have 2 boys and I’m overwhelmed as it is. I DO not want another kid but he does(he’s a bit younger, late 20s). He knows it’s a huge NO. I’m 35 with teenagers, I don’t want to start over!! Your wife is so wrong for doing this to you!! I wouldn’t stay for the “sake of the children” \n\nYou’re always gonna harbor some MAJOR resentment towards her and possibly even the third child.",
                            "score": 244,
                            "author": "BrittniLB"
                        },
                        {
                            "level": 2,
                            "comment": "Please document all the events and I hope you took screenshots of the conversation.  You may need this info in the future.",
                            "score": 29,
                            "author": "willowmarie27"
                        },
                        {
                            "level": 2,
                            "comment": "That's bad, is she trying to turn the kids on you? That's also more criteria for you in your talks with the lawyer. Do they normally notice that stuff or is she telling them that you're not talking to her to guilt you into talking to her and also put the kids on her side?",
                            "score": 83,
                            "author": "throweraccount"
                        },
                        {
                            "level": 2,
                            "comment": "She made the problem, why are you trying to make it easier for her? She doesn't care about what you want or how to make your life easier. She literally secretly went against what you had both agreed on. I don't understand how you don't see how insanely fucked that is.",
                            "score": 61,
                            "author": "ChinaCatLogan"
                        },
                        {
                            "level": 2,
                            "comment": "You should look into some virtual counseling, this is a lot for you to process. I see this as on par with her having a month's long affair, or worse, so it's hard to see it going anywhere other than separation. That would warrent getting yourself some counseling by itself, but you also have two children, a pregnancy and a quarantine to deal with.",
                            "score": 23,
                            "author": "paralyzedbyindecisio",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I know you're getting bombed with replies but hopefully you see this.  After what she's done I would start keeping an eye on any shared accounts and funds/credit cards that you have.  After your repeated unhappy reactions to this gift from backstabbing she may decide to start moving money to build a safety net for herself beyond whatever support you commit to giving her.",
                            "score": 11,
                            "author": "Syfte_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yea if gravity of this didn’t hit her yet OP saying he isn’t sure it’s “our child” should be chilling her veins. Sure you didn’t explicitly cheat with another man but you abused this guys trust. And I hope for the kids sake OP can come around and love him/her the same as their siblings but the family is broken",
                    "score": 128,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This should be a sex crime",
                    "score": 48,
                    "author": "Petsweaters",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In North America, it is a crime.",
                            "score": 32,
                            "author": "himetampopo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“This situation is above Reddit’s pay grade” is my new “you shouldn’t take advice from anyone other than your therapist especially on reddit” tokenology. Thank you, superstar!",
                    "score": 90,
                    "author": "theCmachine",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep the condoms",
            "score": 3988,
            "author": "vabab8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you actually think that it will be legit evidence? I mean every man can take a condom, make some holes and put water in it.\n\nIts a serious question, I think nobodly will take that as serious evidence.",
                    "score": 1084,
                    "author": "Accomplished-Context",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If he has a record of the text messages she was sending people then it's pretty good evidence.",
                            "score": 673,
                            "author": "SadTransmission",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am not a lawyer and this is not legal advice. The messages would probably be stronger evidence, he probably wouldn’t even need to save them because they can be subpoenaed directly from your mobile carrier.",
                                    "score": 377,
                                    "author": "Chesus007"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly! Maybe take a video of them and show the expiration date and show the holes of one, but anyone can just poke holes into a condom.",
                            "score": 170,
                            "author": "chiefdragonborn"
                        },
                        {
                            "level": 2,
                            "comment": "This is addition with the chats is a different story",
                            "score": 26,
                            "author": "littleanana"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd take photos or a video of water being poured through them and e-mail it to yourself or save it to some one drive she can't access, so the only evidence isn't something that is stored in the same house she's living in and could find and destroy.",
                    "score": 600,
                    "author": "AllstarIV"
                },
                {
                    "level": 1,
                    "comment": "But how would it serve as any proof if he could do it himself?  It's not like her DNA being on it would prove anything.",
                    "score": 27,
                    "author": "xantub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is circumstantial but with the coroberation of her texts to her friend,  not only did she discuss doing it (the text messages), but she ACTUALLY carried the act out.  This refutes any claim that she never really intended to ho through with it.",
                            "score": 26,
                            "author": "vabab8",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why?  \n\nWhat’s the difference?  OP knows the truth, why would he need to prove it to anyone?   If he wants to get divorced he can and doesn’t need proof for that.  He wouldn’t be getting out of child support or anything.",
                    "score": 19,
                    "author": "Junkmans1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "DO NOT STICK AROUND JUST FOR THE KIDS!!!!!! \n\nI think all children wishes their parents knew this. \nIt’ll be much healthier to raise them through co parenting as you will both be happier on your own whereas if you stay together they will see the fights, the resentment and things will be toxic. Good luck",
            "score": 1162,
            "author": "latinuh96",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. She is sick and she will not know how sick she is until she sees that what she did was not okay and that it is grounds for leaving. Staying will only make her think that her behavior was okay because at least it 'all worked out in the end.' The kids will be okay with parents coparenting especially when it is a much healthier than staying in a relationship where there is no trust and just resentment.",
                    "score": 174,
                    "author": "RIP_huell_howser",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to mention she wants four kids. What’s to say she won’t do the whole thing all over again?!?",
                            "score": 124,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She initially wanted 2, now she says 4 but will settle for 3. She either hasn’t been telling him the truth since the beginning, or she’s manipulating him now that she has changed her mind. Either way, this is not the behavior of a loving partner.",
                                    "score": 83,
                                    "author": "kasmarina",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A year from now she’ll say that she wanted nine and he wanted three so they compromised and will have six.",
                                            "score": 32,
                                            "author": "pshurman42wallabyway"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hope OP sees your comment. Hijacking yours to repost my warning to him:\n\nYour children's mother is a genuine narcissist. She won't treat your children with any more respect than she has treated you with. They will exist to make her happy and anything else they might want will be secondary at best. If you stay with her, they'll grow up to understand that you kept the family together (and therefore kept her a 100% constant facet of their lives) for your own convenience/pleasure and put what was best for them second to your own needs. They'll then have two parents who have never made their kids their main priority.",
                    "score": 14,
                    "author": "bambooshootstokill"
                },
                {
                    "level": 1,
                    "comment": "No, I know, but I’m not leaving the house because of the kids. If I leave she’s the one with the upper hand with the kids and the house. And I can’t leave my kids, I need to see them every day and my wife will probably find it impossible to take care of both the entire day on top of her working from home and cooking and cleaning and all that.",
                    "score": 156,
                    "author": "Throwrawifebabytrap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The entire point is going over your head.....you’re STUCK and your kids will FEEL IT and that will be their guidelines for their own marriage or how to treat their future partner. A divorce may cause temper tantrums in preschool and some stress but there’s also a theory that children exposed to certain degrees on stress will cope better on with it later in life. If they can see you and mom having a healthy separate relationship versus you being STUCK and picking up on your subconscious emotions and actions then they can have healthy relationships in the long run. A divorce hurts but that can be treated. Being raised in a broken home can lead to much worse....",
                            "score": 149,
                            "author": "latinuh96",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "+1. When I learned that my parents were having a divorce I was so angry but I eventually came around and realized that it was a positive thing. Now I wish that it had happened sooner.",
                                    "score": 43,
                                    "author": "ineedtoworkharder"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! I hate the statement \"But I have to stay for the kids!\" with a passion. As someone who grew up with a mum and stepdad, who argued all the time (and still do) and actually don't even like each other anymore, I can say that an enviroment like this hurts the kids badly. I struggle with mental health and I am scared of relationships, because the relationship my mum and stepdad are having taught me nothing. I have no idea how a healthy relationship functions and I am scared that I will accidentally do the same mistakes they did, because that's all I know.\nYou want your kids to experience a healthy relationship and you want to teach them to stick up for themselves and make the decisions that are healthy for them. You do NOT want to teach your children that it's okay to stay with a person that hurts you and disrespects you and your boundaries.\n\nThat all aside. OP has to evaluate his situation in a quiet moment and he has to decide if he could live with his wife for the rest of his life, because after what she did to him I definitely couldn't. But it is his life and ending a relationship is always difficult and with a wife like this might become dirty pretty fast. \nI just repeat what everyone else has said already: OP, call a lawyer, call a therapist, talk to your wife and make her understand how she betrayed your trust and see how she reacts. Because if she screams at you again and doesn't show any remorse at all, that would worry me. \nTry to get your hands on the messages she had with her friend. Better safe than sorry. \nAnd after all that make a decision that you can live with. You alone. Don't stay for the kids sake, because they will be okay as long as you love them and are part of their lives, which you will be either way.",
                    "score": 10,
                    "author": "pmDogPicsAmLonely"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is definitely not something you want to deal with in the long term. My ex would pull the same shit (lie about birth control, etc.) and I just lived with it and the trauma for the sake of being in love. Its messed me up pretty bad in the long-term and has made sex an extremely stressful event now that I'm out of that relationship. Even just for the sake of your mental health (which will rub off on your home and work life), you should definitely consider not being in that situation for the long term. Get records of the texts from your cell company for safe keeping if you have to.",
            "score": 513,
            "author": "Silverwarlocker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was gonna say she’s willing to do it once what would stop her from doing to again? OP is probably never going to be able to have intercourse with her again without the though nagging him in the back of the head. Total loss of trust. What kind life would that lead to in the future.",
                    "score": 14,
                    "author": "kal_c_smalls",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry dude, but your wife is trash and a complete psycho. And she has the nerve to call you selfish? She straight up sabotaged your personal mean of protection in order to have them intentionally fail so that SHE could have what SHE wanted while forcing YOU to deal with the care and upkeep of something you specifically said you didn’t want and took precautions to avoid. Get a divorce lawyer yesterday. In no world is this cute, romantic, sweet, or any of the like. It’s a literal $200k scam against you by someone who sees you as a means to an end. She doesn’t care about you, just your ability to provide food, shelter, and babies. Run, run, run like hell. Catch your breath, and then start running again.",
            "score": 80,
            "author": "MachineCode86"
        },
        {
            "level": 0,
            "comment": "if a guy taking off a condom without the woman's knowledge is technically rape...doesnt this count as that too???she didnt mention coming off BC AND poked holes in the condoms....get away from this lunatic..if not then get her some help.",
            "score": 2855,
            "author": "uknowimjojos",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was thinking the exact same thing. I didn't want to call this rape, but in my eyes it is. It's illegal",
                    "score": 620,
                    "author": "AMASON51",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He consented to sex with functioning condoms, not to sex with sabotaged condoms. It has to legally be a form of assault just like \"stealthing\"",
                            "score": 538,
                            "author": "BabyBundtCakes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He also consented to sex under the thought that his sexual partner was on birth control. She did a lot of no-no's here and I personally think the consent should be null and void under these conditions.",
                                    "score": 218,
                                    "author": "livingstone97",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Consent is void because it's a different scenario entirely. If we use that tea analogy this would be like someone asking if you want tea and then handing you a cup of milk and making you drink it.",
                                            "score": 70,
                                            "author": "BabyBundtCakes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "More accurately it’s like being given caffeinated tea while being assured it’s decaf.",
                                                    "score": 21,
                                                    "author": "AlternativeUse",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But I can’t leave the house, because then she’ll be left alone with the kids and I can’t leave the kids. And if I leave she gets the upper hand in the divorce proceedings too. Jesus Christ why did this have to happen now.",
                    "score": 427,
                    "author": "Throwrawifebabytrap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Call a lawyer. Take a drive (that's perfectly fine during the quarantine) and talk to them. They'll give you the best advice.",
                            "score": 311,
                            "author": "moosetopenguin"
                        },
                        {
                            "level": 2,
                            "comment": "Call them, or email. Even if this pandemic wasn't happening, I'm sure they would understand that you don't want to leave your house and kids with her right now.",
                            "score": 77,
                            "author": "ChinaCatLogan"
                        },
                        {
                            "level": 2,
                            "comment": "This is beyond Reddit man..talk to a lawyer. Dont leave the house or your kids before you try ANYTHING. Take pictures of the condoms as eveidence and if you still can, Screenshots of her convos would be handy too. But please TALK TO A LAWYER.",
                            "score": 63,
                            "author": "uknowimjojos"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s reproduction coercion.",
                    "score": 80,
                    "author": "CodingBlonde",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well that just sounds like rape with extra steps",
                            "score": 49,
                            "author": "Lil_Ross25",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I wonder if he would be off the hook for child support since he didn't consent to unprotected sex.",
                    "score": 180,
                    "author": "Desjardins97",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is no court hearing that sets precedence in this way. No matter how fucked up it is, the courts are going to act in the best way for the children involved and that would require him to pay child support if they separate. \n\nHe should divorce his wife. She committed reproductive coercion and abused him in this way. She will continue to manipulate him because she got away with it. It is no longer a healthy relationship because she couldn’t find a healthy compromise with him to begin with.",
                            "score": 228,
                            "author": "Sle08",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It absolutely is. Even if a person wants to have sex, consent under false pretenses is not consent. This man did not consent to having unprotected sex, but his wife forced it on him anyway without his knowledge. This is a form of rape.",
                    "score": 38,
                    "author": "FeralTaxEvader"
                },
                {
                    "level": 1,
                    "comment": "And if she did push it like this for kid 3, who knows she'd stop at 3?",
                    "score": 12,
                    "author": "Drakena_Amaterasu",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "reproductive coercion",
                    "score": 19,
                    "author": "jules-_-"
                },
                {
                    "level": 1,
                    "comment": "Yeah OP's wife is a rapist full stop.",
                    "score": 65,
                    "author": "Threwaway42"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She is manipulative as hell and what will prevent her from deciding to do this to get the fourth that she wanted. She didn't respect you or your wishes.",
            "score": 132,
            "author": "wesoftheweird"
        },
        {
            "level": 0,
            "comment": "this is technically rape, you consented to sex with a condom not without",
            "score": 46,
            "author": "gothkv"
        },
        {
            "level": 0,
            "comment": "You lost me at “miracle from god.”",
            "score": 46,
            "author": "esmelusina"
        },
        {
            "level": 0,
            "comment": "https://en.m.wikipedia.org/wiki/Non-consensual_condom_removal\n\nThat's rape. Get proof, get divorced, get custody. Your wife's a fucking psycho.",
            "score": 331,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "get a divorce. asap. thats horrible of her to do. you'll make a better father to your kids if you leave her because you won't be miserable and in a marriage you hate.\n\n&gt;it's her choice whether or not she wants to take BC\n\nshe tried lying. again. she was hoping you didn't find out she put holes in the condoms.\n\ntalk to a lawyer. now. if you feel like she'll try to run off with joint financials (which, after what she's done i wouldn't put it past her) or other damaging things you'll want to lock those down asap.\n\nedit: in some places, what she did is a crime. i didn't think that was relevant but i figured i should add that in anyway.",
            "score": 1065,
            "author": "t3hd0n",
            "replies": [
                {
                    "level": 1,
                    "comment": "I should probably start calling, but this is all so much harder because we’re all on isolation. How am I even gonna hide what I’m doing from her if she’s right in my face 24/7? She doesn’t even understand the concept of me needing space even if we’re in the same house. I feel like absolute shit.",
                    "score": 610,
                    "author": "Throwrawifebabytrap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take a walk and make the call.  Take a drive.\n\nYou've done nothing wrong here, man.  Don't beat yourself up.",
                            "score": 561,
                            "author": "VoidDrinker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just to add to this - if you do need to leave, then leave. And don't feel guilty. Your wife knowingly created this mess. If there are consequences then that is on her. At this point, you need to do what is right for you. Your kids will be okay.",
                                    "score": 119,
                                    "author": "kimber512_"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Take a walk and make the call. Take a drive.\n&gt; \n&gt; \n\n Make the call without breaking eye contact with her. Power move.",
                                    "score": 55,
                                    "author": "h0nest_Bender"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She’s not giving you space because she’s trying to wear you down until you just give in and accept what she wants, which is fucked. She absolutely understands that you need space and is choosing not to give it to you, in my opinion because she doesn’t want you telling anyone what happened because she’ll look bad. Don’t be afraid to lock her out of the room if you start feeling suffocated. I’d have blown up on her by now, kudos to you for keeping it together in front of the kids.",
                            "score": 545,
                            "author": "DeathIsTheFinalSleep",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This right here. She is abusive man, I'm sorry you're dealing with this.",
                                    "score": 85,
                                    "author": "aprillance"
                                },
                                {
                                    "level": 3,
                                    "comment": "Because she's a manipulative narcissist.",
                                    "score": 124,
                                    "author": "ChinaCatLogan",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;She doesn’t even understand the concept of me needing space\n\nanother huge red flag. a lawyer will probably tell you she has the right to stay in the marital home so you cant kick her out. is there a room you can claim for yourself?",
                            "score": 160,
                            "author": "t3hd0n",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "His office, which she is now trying to take from him to give to the baby",
                                    "score": 80,
                                    "author": "thekactuskween"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I worked in a domestic violence/substance abuse/respite center...so here's my best advice. \n\nDon't pretend to agree. Constant no. Go for a drive, lock yourself in the room with the router so it can't be turned off, hide your evidence in a box in the car if you need to. Get text records from your provider if you can't get back on her phone.  Tell her you want to get her a surprise. (Lawyers are always a surprise)\n\nIt's obvious she's cowed you into isolation pre corona, and will bully you till your opinion changes to save face in front of visitors. Tell these visitors you did not consent and this was rape, and you need help and then hard stop and walk away. Don't know your family situation but I'd be reaching out to anyone for help. she's got the monologue painted  to her friends/family as 'hes a neglectful and unsupportive dad, so help me make him be supportive and happy to be my sperm donor.' she's turning these people against you so that she has more people to wear on you and keep pressure to accept and 'be happy'. It didn't stop with no. 2, it's not stopping with no. 3, what about 4, 5..?\n\nShe lied and coerced you, and then berated you for being upset with her actions. She knew you didn't want it, and did it anyways. Relationships are about trust, support and unity. She's done the opposite of all on a life long issue. \n\n Tell her if she really cared and wanted you to even consider, you need space and time to process. You are absolutely being abused man.  Telling her no and walk away. Ignore her, and if not call the police, and start reporting her actions. I reccomend writing a journal with how you feel, evidence and dates &amp; times. A physical copy and a digital. Send it to a brand new email.  We're here for you. If you need to chat dm me and I'll send a number.",
                            "score": 73,
                            "author": "redCompex"
                        },
                        {
                            "level": 2,
                            "comment": "This is the trap part of baby trap. Shes taken advantage of a pandemic to make you doubt yourself and the actions you should take. \n\nJust say you need some fresh air and call out there. Call the nin emergency line and the officer will help you from there",
                            "score": 64,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "That's another huge red flag. She doesn't give you space at all? So not only is she emotionally abusive, she doesn't leave you time to process what she's done, or be alone. That's so fucked up.",
                            "score": 33,
                            "author": "ChinaCatLogan"
                        },
                        {
                            "level": 2,
                            "comment": "Could you maybe go to a grocery and get a few things for the house? If you take longer, maybe you could say that it was still a little busy? Or perhaps going on a walk? I don’t know how strict everything is where you are. I would try to come up with an excuse to get outside or see if places are taking emails and try with that.",
                            "score": 27,
                            "author": "plantfellow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I don't think it's something a marriage could survive and work fine afterwards.  \nAlso, she said she wanted four...Whats the guarantee, even if OP forgives her, that she won't pull the same shit over again?",
                    "score": 129,
                    "author": "Piffli",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "a vasectomy, but she's so toxic of a person to pull that i'm sure theres other instances she's so toxic he should be leaving anyway.",
                            "score": 45,
                            "author": "t3hd0n"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not to mention the fact that she said he should've gotten a vasectomy if he didn't want any more kids... he was wearing condoms! He was doing his part to ensure protection! She mutilated them!\n\nHow can you ever trust a partner again after something like that? It's beyond selfish to force someone into having a child.\n\nAnd she doesn't seem even remotely apologetic. She screwed you and just wants you to hop on board like nothing happened. I know you now have a baby on the way. But when she's trying to get you excited and all for a baby she forced you into having when you can't leave... she's totally delusional. She doesn't seem to realize the severity of her actions at all. \n\nI agree you need to talk to a lawyer. And then when you've got what you needed to down/ filed with them... you need to be upfront with her about leaving her. Even if you later decide not to (I personally would leave but to each their own). I don't think she's going to realize the severity of her actions unless you tell her that you're considering leaving her over this. And her reaction to that might even help you make a decision (i.e. blaming you further would really make me walk out). I do feel that it would still be appropriate for you to be there for your kid (as it sounds like you're already mentally preparing yourself to do)... but as of now you don't need to tell her that. Let her know that you have no intention of being there for her. You're going to move out and she can raise the baby by herself. She's expecting you to just go along with it and be the same supportive partner you've been with the last two kids... so don't be and let her know it.",
                    "score": 103,
                    "author": "starnova3000",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It might have  been her choice to come off birth control as it's her body but it isn't her choice to come off condoms when there is no other form of birth control in place... that's a mutual decision.\n\nCompletely agree with what you've said and OP should talk to a lawyer without her knowing  and maybe look into setting up a second bank account if theirs is shared.",
                    "score": 33,
                    "author": "DefiantBunny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree that it is her choice to come off birth control, however, that is something that should be mentioned to your partner prior to having sex, because the terms of the consent to sex have since changed as a result of that personal decision.",
                            "score": 19,
                            "author": "livingstone97",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whatever you decide to do, get a vasectomy asap. Anger will pass, your hard times will pass but getting the pinch will ensure you in the future.",
            "score": 291,
            "author": "Alove4Hellfire",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely get a vasectomy if you don’t want any more kids. She clearly cannot be trusted to make decisions with you, so you need to take her out of the equation in terms of reproductive choices, regardless of whether or not you choose to leave her. OP, do this ASAP. She cannot be trusted.",
                    "score": 111,
                    "author": "scarletts_skin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would leave. Put it this way *she said she actually wants four* what happens when 3 isnt enough for her? Shes just going to do it again. Men who do this are horrible and women who do are equally terrible. Shes trying to get you excited for a child you didnt want thinking the focus on the baby will make everything better. She wont leave you alone so tell her. \"I dont want to talk to you.\" Message a divorce attorney and see what they recommend in this scenario. Document everything, times, I would say discuss what she did (before telling her to leave you alone) so you can document it as a confession. Etc. Etc. This is *bad*",
            "score": 87,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You are in deep deep trouble. what you're describing looks nothing like a healthy relationship. you need help and I don't know what kind but the bottom line is you need to be in a relationship where you were equals not a victim of emotional manipulation",
            "score": 72,
            "author": "hoarduck"
        },
        {
            "level": 0,
            "comment": "Real talk, your wife raped you dude.\n\nShe had every right to go off birth control, her body her choice. \n\nThat said, putting holes in your condoms, that's rape, you didn't consent to sex that could lead to pregnancy and took steps to prevent that, she broke that trust.\n\nImagine if the roles were swapped, and a man removed a condom during sex without telling the woman, same concept.\n\nI won't presume to know what's best for you, but you really should go into any conversation you have about this with the right framework to fully convey the betrayal you've been through.\n\nI wish you the best",
            "score": 48,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "She is fucking batshit crazy.\n\nGet the hell away from that psychotic woman and get a divorce.\n\nShe totally disregarded your feelings and got herself pregnant.  There is no excuse and no way back from this.\n\nStay in the house and get a lawyer.",
            "score": 137,
            "author": "anomanderforPOTUS"
        },
        {
            "level": 0,
            "comment": "Rape. The word you're grasping for is \"rape.\"\n\nThis is no different than some douche \"stealthing\" a woman.\n\nCall the police.",
            "score": 115,
            "author": "RicklePickC137",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Damn that is awful.  I don’t know how you will ever trust her after something like that either.  Extremely sad for all 3 kids but don’t stay in a relationship because you feel forced.  The kids will feel it.  And please whatever you do, don’t take out your anger in the 3rd child.  It’s not their fault.  Do what you can to be a good father to your 3 kids and love them equally while rebuilding the remainder of your life.",
            "score": 83,
            "author": "tercer78",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That’s fcked up. Seems divorce worthy.",
            "score": 62,
            "author": "soulsearching89"
        },
        {
            "level": 0,
            "comment": "My comment might get drowned out but here goes:\nI am the third child. The “surprise”. I have no idea if my mom did the same thing to my dad (or vice versa), but I grew up feeling unwanted. I wish I had been aborted. Therefore I feel sorry for the kid. I also feel sorry for OP and I agree he should lawyer up. \nOne more thing: if I were OP, I would tell the kids that I am not speaking to mama because she broke a very important promise. \nI think that’s simple enough that they would understand.",
            "score": 161,
            "author": "lokithepunygod",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope things get better for you",
                    "score": 45,
                    "author": "kotters85"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Technically rape by deception. If you stealthed a girl she could have you in prison for a long time. Do you really want to be with someone who is technically a rapist?",
            "score": 45,
            "author": "Siphyre"
        },
        {
            "level": 0,
            "comment": "Idk I’m kinda doubtful about this one. She doesn’t throw out the condoms. So much blatant evidence on her phone. This plays out like a soap opera. Reddit fan fic imo.",
            "score": 12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "She didn’t just come off birth control, she destroyed your birth control. She tricked you, and she lied. At this point it’s not about how many kids you want. What’s happened has happened and that kid is yours and you need to get on board with being there for it. The new baby isn’t so much the problem; rather your wife’s ability to so quickly muster up a way to betray you is. Horrific. And frankly worryingly irresponsible, to say the least. Actions have consequences. Divorce her, and be there for all three of your children.",
            "score": 65,
            "author": "Wileykid",
            "replies": []
        },
        {
            "level": 0,
            "comment": "On the off chance this isn't a creative writing exercise (you couldn't tell if the condom wrapper had been punctured? You had to take it out, unroll it, and then fill it with water to discover the tampering?)\n\nYou need an exit plan (and a paternity test).",
            "score": 424,
            "author": "CampusTour",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll go over it with you. To begin with, when we started I just grabbed them and got down. After when I started suspecting I just blindly grabbed them and stumbled to the bathroom. I was almost positive there were holes so I checked to make absolute sure. I wrote this in not a good place so it may not make perfect sense. I felt so confused and angry that she could even think about doing this and wasn’t thinking very clear.",
                    "score": 232,
                    "author": "Throwrawifebabytrap",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Probably tested the same way you’d check a tire for holes. If you put soapy water on it and it makes bubbles there’s a leak . So if you run a condom pack under water and it makes bubbles you got holes",
                    "score": 73,
                    "author": "ajicku",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is fake. Really guys this is text book things reddit hates.",
            "score": 22,
            "author": "mani_mani"
        },
        {
            "level": 0,
            "comment": "First: Let's get one thing straight, That what she did was illegal on soooooo many fucking levels I'm surprised you aren't contacting a hole team of lawyers to help you or at the very least go to counseling.\n\nSecond: her little \"accident\" is called [reproductive coercion](https://en.m.wikipedia.org/wiki/Reproductive_coercion)\n\nThird: you need to go to therapy my friend, she needs to pay for her \"accident\" but first you need to heal from it",
            "score": 35,
            "author": "Mrsam_25"
        },
        {
            "level": 0,
            "comment": "Holy fuck what a psychopath. I'm so glad I'm single again lmao.",
            "score": 55,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Three is not a compromise for wanting four kids. That's insane and every thing about this post screams manipulative to me. You had two kids, you're compromising on your wish for one and she's compromising on her wish for four. She has absolutely taken away the compromise, it is now you getting shafted and her getting her way.",
            "score": 9,
            "author": "rokudaimehokage"
        },
        {
            "level": 0,
            "comment": "This is total bullshit.  Is your wife an evil villain?  She conveniently spelled out all of her plans in writing to her best friend, which would have had to happen months ago in order for this to happen.  What married couple uses two forms of birth control?  None.  And the old \"hole in the condom\" is not exactly a foolproof way to get pregnant. It could happen, but it's certainly not a guarantee and not even likely.\n\nYour plan is to have your third child be born and know for his/her entire life that he/she was the cause of your split family?  That will go over well with the other siblings.",
            "score": 80,
            "author": "KevWill",
            "replies": []
        }
    ]
}