{
    "id": "fv7ec7",
    "score": 61522,
    "title": "My son and his \"friend\" are a couple. How do I let them know it's okay?",
    "author": "throwralovemygayson",
    "date": 1586058701.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/fv7ec7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello Reddit. Please bear with me regarding my formatting and things. I have read the rules and things, but I'm an old fart who is rather on the wrong side of 40 so I'm not overly well versed in the art of efficient internetting. \n\nMy boy is 20 years old. He's absolutely my pride and joy, and there is nothing he could do that would ever make me love him less. For the first half of his life, I regrettably wasn't involved very much. His mother and I parted ways when he was just a few months old and at the time I was struggling with a heroin addiction and was absolutely not as present in his life as I should have been, nor was I suited to fatherhood at all. I saw him, at most, two to three times a year for the first 12 years of his life. I won't discuss details because that's his private story to tell, but when he was 12 he revealed to me that he was being badly mistreated at the hands of his mother and her boyfriend. Despite not being the best father at the time, I didn't want my boy suffering any more so I got myself cleaned up and sorted out in order to get full custody of him. I've effectively been a single (and sober!) father ever since and he has little to no contact with his mother. He's everything a man could want his son to be; he's uniquely kind and fiercely loyal, he's unflinchingly brave, he's incredibly generous and, despite the horrors he suffered as a child, he's unfailingly positive and sunny to the last. Somehow I of all people was bestowed with the honour of watching him grow from a sweet young boy to the greatest man I have ever known. I cannot stress enough my pride in him.\n\nWhen he was 18, he got accepted into a top ranking university on the other side of the country. I was sad to see him go, but simultaneously overjoyed that he got into his first choice and was starting a new chapter in his life. He comes home once every other month, and on the month's he doesn't come home, I go to visit him. He's doing well in uni, has made lots of friends and seems incredibly happy there, which I'm obviously chuffed about. Since his second year, he's lived with his \"friend\" in a flat off-campus. I've strongly suspected since his early teens that my son is gay, and I now more or less have confirmation that this is true and that his \"friend\" is actually his boyfriend. \n\nSo, for this COVID-19 faff, my son decided he'd rather come home and quarantine at mine than stay at his uni flat. His \"friend\", however, would be left alone if my son came back as he's a Candian and his family are back over there, and I gather he doesn't have the best relationship with them anyway. He asked if it would be okay if \"friend\" tagged along to my house and I said of course, no problem. \n\nThey've been back at mine for about six weeks now. They think they're being subtle I know, but I've caught them doing coupley things on several occasions now. The \"friend\" has slipped up a couple of times and called my son 'babe' and 'sweetie' in front of me, which I pretended not to notice for the sake of saving embarrassment. There have been nights where we'll be watching a film with the lights off and, thinking I can't see, my son will have his arm around the \"friend\". One day I walked into the lounge and I'm positive they'd just been kissing and were trying to cover it, though I admit I have no confirmation on that one. The most solid evidence, however, came a few mornings ago. I get up very early to go for runs in the morning (hence why I'm making a reddit post at five in the morning haha). As far as I was told, my son was sleeping in his childhood room and his \"friend\" was in the guest room. I don't know what possessed me to do so, but on Tuesday morning I cracked my son's door open to check on him like I used to when he was a kid. Lo and behold, they're both asleep, snuggled up together, in my son's bed. That's more or less solidified for me that they're together. I didn't say anything, just shut the door and went for my run, and I haven't mentioned it to them yet. \n\nWhat I want advice on is this; how do I let my son and his boyfriend know that I'm okay with them being a couple and they don't have to feel like they have to sneak around in my house? I want them to be comfortable here and I want them to know I support them both no matter what. Or is that not a good idea? Am I better off leaving it alone and waiting until they tell me themselves, if they ever do? I obviously don't want to force either of them out of the closet, but at the same time I hate feeling as if they feel like they're being forced *into* the closet in my house. What's my best course of action here?? \n\nTL:DR - my son and his \"friend\" are staying with me for quarantine. It's abundantly clear they're a couple, and I want to let them know it's okay and they don't have to sneak around in my house. What's the best way to go about it?",
    "comments": [
        {
            "level": 0,
            "comment": "I know this might shock some of you, but this is _not_ a moral judgment post. OP is asking for specific advice on how to communicate a certain kind of message, and that's entirely within scope of the rules.",
            "score": 1,
            "author": "eganist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You’re an awesome dad. I’m so glad you were able to clean up your life and become such an amazing father to your son. I hope he knows and sees that too. \n\nI’m a lesbian and I can totally relate to what your son is doing and feeling. I like the above advice in just referring to your son’s “friend” as his boyfriend. It’s casual and your tone will be the telltale sign in all of it. \n\nYou could also write a letter addressed to him if you wish. I think that would be really sweet and I would keep it forever if I were him. \n\nThanks for being one of the good ones.",
            "score": 3340,
            "author": "throwawayfeelings7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope your family is just as supportive as op! Or like my dad. When I was in my late teens/early twenties going to art school with short different colored hair every week and questionable early 2000s style, my dad called me and said one of his super religious work friends disowned his daughter for being a lesbian. Then he went on to say that if I am gay, that he loves me no matter what and would never do that. I’m not, but that still meant a lot to me and if I was a lesbian I definitely would have been terrified to tell him. \n\nMy immediate reaction to op post was just slipping in somewhere that they are a cute couple. I love the note idea too!",
                    "score": 427,
                    "author": "pennypiepup22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ahhh your dad is so sweet. Even though you aren’t gay, it’s so nice to know that your dad is one of the good ones too. I bet that made you feel super happy. \n\nMy parents are pretty supportive. My mom went through a lot of denial when I first came out and I think my dad just never knew how to react even though he has a gay brother. Both of them say they love me no matter what and they just want me to be happy and I definitely believe them. After I came out years ago, I introduced them to my first girlfriend and they both liked her. When we broke up, it went quiet for a while and it still doesn’t really come up unless I’m actively dating someone. But hey, they’re not hateful at all and they respect me for who I am and that’s all I want. :)",
                            "score": 92,
                            "author": "throwawayfeelings7",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First congrats on cleaning your life up and being there for your son, keep being strong.\n\nMost of the comments here are great and I think any of them would be fine. Just reassure your son its ok and that you'll love him no matter his sexuality. My friends dad left his son a sticky note for him to find that just said he loves him and approves of his boyfriend because hes such a gentleman lol.\n\nI think reassurance is best, but i love everyone else's comments.",
            "score": 7649,
            "author": "Known-Citron",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean I don’t even know if you need to be that on the nose if you wanna get there without the awk.\n\n\nJust be loving and say you’re proud of them and love them and nothing can ever change that.\n\n\nMentioning sexuality specifically could put him on his heels and make him get defensive out of like sheer fearful survival instincts.\n\n\nJust create the environment where they feel good about coming to you.",
                    "score": 177,
                    "author": "bensawn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean that's what a few of my friends who are gay and transgender said their parents said it pretty much like we don't care what your sexuality is, who you love, as long as you're safe, healthy, and happy.\n\nI think it would really depend on how the father wants to say it, he would know his son the best and how to word something like that better than any of us.",
                            "score": 42,
                            "author": "Known-Citron"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you like his boyfriend (it sounds like you do!) then I'd say something like, \"I hope you know that boyfriend's name is always welcome in our family. It's clear he really cares about you, and having people like that in our lives is so important.\" If you're feeling up to it add, \"I just want you to know that you two are more than welcome to share a bedroom here if you prefer.\"",
            "score": 4206,
            "author": "iamspamanda",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do like him very much! He's a good man, he likes rugby, he makes my boy happy and he cooks a fabulous hash brown. What more could a man want from a son in law haha",
                    "score": 5517,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck man, I told my Dad I was bi 2 years ago and haven't heard from him since. From now on I'm going to forget about that and pretend he reacted as sweetly as you did and then had to go into witness protection or something.\n\nEver see that story about the dad giving out dad hugs at a queer pride event? I feel like your that guy to a lot of us right now.\n\nYour son is a lucky boy.\n\nEDIT: Might never have such a visible comment again... Does anyone wanna play online quarantine D&amp;D?\n\nEdit 2: So many D&amp;D replies! Better specify that I'm in Australia (GMT +10) [Post here!](https://www.reddit.com/r/lfg/comments/fx3q3h/online_5e_new_dm_lf_new_players_for_some_weekly/)",
                            "score": 2525,
                            "author": "ThinkFor2Seconds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'll be your dad now haha",
                                    "score": 2531,
                                    "author": "throwralovemygayson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's an easy swap. My Dad had a heroin addiction and I only saw him once a year or so too. He cleaned up eventually but when my mum was hospitalised for schizophrenia he didn't step up when it was needed like you did. Reading your post was like reading a beautiful alternate timeline of my own life.\n\nI'm going to sleep so well tonight living vicariously through the relief and acceptance I know my newly adopted little brother is about to feel. It'll mean everything to him, man. Fucking everything. Absolute legend.",
                                            "score": 1084,
                                            "author": "ThinkFor2Seconds",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You have more adopted family than you think, man. Feel free to sleep well any night you want",
                                                    "score": 336,
                                                    "author": "aaronitallout",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep.\n\nWant a supportive sister? :)",
                                                            "score": 73,
                                                            "author": "mianjko",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Who the fuck is cutting onions around here?!",
                                                    "score": 45,
                                                    "author": "ceramia"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You’re so wholesome! No wonder your son grew up to be just like you!",
                                            "score": 147,
                                            "author": "in_plain_sigh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He's a better man than I'll ever be, but thank you for this. One of the best compliments I've ever received.",
                                                    "score": 288,
                                                    "author": "throwralovemygayson",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hey. Love the positivity you're spreading. Stay safe all of you!",
                                                            "score": 15,
                                                            "author": "writeoffthebat"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "/r/dadforaminute",
                                            "score": 17,
                                            "author": "whatisthisicantodd",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hugs friend.  My wife and I havent been able to have kids. Hearing about parents who throw their relationship away because they dont like the fact their kids arent the same sexual orientation breaks my heart.  I hope you're doing well regardless of his absence.",
                                    "score": 36,
                                    "author": "redls1bird",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely say that - tell your son you love his friend and love their relationship.  You are definitely father of the year no matter what!",
                            "score": 245,
                            "author": "docsab"
                        },
                        {
                            "level": 2,
                            "comment": "You are obviously British from what you are saying. In this situation don’t be British. Don’t bottle it up. Use the note idea above that would be amazing. You sound like a remarkable person, and I say that as one British old fart to another. But by God man you have to tell us how this situation goes!",
                            "score": 230,
                            "author": "DeusExPir8Pete",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do us Brits bottle things up? I have so many friends who are open af",
                                    "score": 50,
                                    "author": "turdlollipop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In my opinion, Brits do tend to bottle things up a lot more than other Europeans and definitely Americans. Just watch the passive aggressiveness if someone breaks a rule in public. Case in point, I remember once being in a room at a spa that was supposed to be for silent meditation and two middle aged women were chatting away. Myself and around 8 other people were obviously annoyed- sighing and huffing and giving them dirty looks. This went on for a good 10 minutes, one person even threw their arms up in exasperation. You could see everyone in the room was quietly seething but dared not say anything. My husband (not British) just turns to them and says ‘LADIES, can you zip it please?’ They turn to him in shock... ‘what?’. And he says again ‘zip it, there’s nobody else talking in here’. I was a bit shocked by his directness but my God it was hilarious. Everyone in the room was silently smirking and laughing to themselves. When we came out, someone actually came up to us, congratulated my husband and gave him a high 5. It still makes me chuckle thinking about it.",
                                            "score": 165,
                                            "author": "SamLuYi",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Probably more prevalent in older generations stiff upper lip and all that bollocks.",
                                            "score": 42,
                                            "author": "tommy5608"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Flat. Uni. Rugby. Aussie or British?\n\nOP you are amazing.",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "British!\n\n(Not to sound patriotic at all as the wisest man of the new generation said \"fuck the government and fuck Boris\" haha Tories out)",
                                    "score": 62,
                                    "author": "throwralovemygayson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mans is out here quoting stormzy.. my dude you are officially hands down the coolest dad.",
                                            "score": 32,
                                            "author": "novavein",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He's some man that Stormzy haha thank you",
                                                    "score": 26,
                                                    "author": "throwralovemygayson"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't have any advice that hasn't already been better articulated by others. I just want to say that this is so wholesome and sweet. You're a good dad, OP.",
            "score": 9106,
            "author": "redrosehips",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, that's all I try to be.",
                    "score": 4526,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish you had been my dad.",
                            "score": 1669,
                            "author": "Tbonethe_discospider",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am now I'm adopting everyone on this post who says their dad is shit haha",
                                    "score": 4013,
                                    "author": "throwralovemygayson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha. I’m not gay but I grew up without a dad. Keep up the good parenting my man.",
                                            "score": 545,
                                            "author": "tone-yo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Me too. My dad died when i was 7. I'm straight, and I've always wanted to experience having a dad i could look up to.",
                                                    "score": 209,
                                                    "author": "givemeyourusername",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks dad 🥺♥️",
                                            "score": 138,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The sheer pride and love that shone through in your post made me literally cry.\n\nI wish I had a Dad like you.\n\nI have no idea what the answer to your question is, but the sheer thoughtfulness and care in your asking makes me certain you'll handle this well.",
                                            "score": 71,
                                            "author": "Kaiphranos"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey idk if you'll ever read this. But as someone who is just beginning to be an adult and growing up in the closet with a dad that I feared would never accept me let me just say this. He will tell you on his own. Maybe drop some subtle clues, overtly telling him that you would never think any less of him, that it would never matter who he loved you would always love him. \n\nI cannot stress this enough, having him know that you'll love him no matter what is so important and will literally help him make some very important choices in life. I often wonder how different things would have been for me if I didn't have to worry about my homophobic dad ever finding out I was in love with other boys. It took me too long to fully figure out who I was. But it already sounds like he knows you love him and he knows how to love in return. You already won. The rest isn't isn't important. Just keep letting him know you love him no matter what. \n\nJust keep being great my man. I grew up knowing my father would never accept me, and it led to drug addiction and a series of poor choices. I'm now over all of that and finally love myself for who I am\n It took a while but it happened. All you have to do is that. The rest is trivial. ❤️",
                            "score": 106,
                            "author": "DarthWeenus"
                        },
                        {
                            "level": 2,
                            "comment": "OP youre a good dad. \n\nIf you want an idea on how to bring up the subject to your son in person you can use it in context of this quarantine. \n\nA lot of lgbt kids are nervous about being in quarantine with their parents right now. Its a stressful time for many who are not out or accepted. \n\nYou can bring it up to your son in that context. \"Hey son, I saw an article the other day about a parent finding out their kid was gay during this quarantine stuff and the kid was struggling to look for a place to go after the parent freaked out. I can't believe a parent would ever treat their kid like that. I would love you no matter who you loved as long as they made you happy and treated you right. Unbelievable the way some people treat their kids\" \n\nThis lets you have an in person conversation, but the topic isn't your son. It lets Your son know how you feel without any direct pressure for him to reply or feel forced into saying anything. It gives him control in the sense that he can sit on that info for as long as he wants. \n\nIf you don't want to have an in person conversation, the poster who suggested sending a short text had a really great idea that lets your son go at his own pace.",
                            "score": 660,
                            "author": "RealAbstractSquidII",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was going to recommend something similar. Bring up a story about a real lgbtq person you could show admiration for. In the context of quarantine I was going to suggest watch Bohemian Rhapsody with your son. At any one of the appropriate moments in the film or after, express how sad it was that Freddy couldn’t be his authentic self until so late in life.",
                                    "score": 148,
                                    "author": "Cratonis"
                                },
                                {
                                    "level": 3,
                                    "comment": "Upvoted cuz this is darn good advice.",
                                    "score": 29,
                                    "author": "WhiteOak77"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You are an angel. He is blessed to have a father like you.",
                            "score": 240,
                            "author": "CongratulatoryBlob",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Or say in a relaxed moment, that it is maybe better for \"friend\" to sleep in your sons room to have a sheet less to wash",
                            "score": 59,
                            "author": "jojayer",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You are such a fantastic human being.",
                            "score": 21,
                            "author": "0bsidiaX"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not just a good dad, a GREAT dad. I’d give anything to have a father figure like this in my life.",
                    "score": 89,
                    "author": "rosiesanatomy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom sent me a text that said, “You never have to admit anything to me that you’re not comfortable with. But if Jasmine was ever more than a friend, I’d want to make sure she knew she was loved here too”.",
            "score": 27674,
            "author": "MommaBearJam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Your mum sounds like a sweet lady. I'm glad you have her. \n\nI like this idea.",
                    "score": 13623,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please do this OP. That's gotta be the most loving way to express that emotion. Really shows the care and love that they deserve.",
                            "score": 4645,
                            "author": "theandyboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "LOCK THE COMMENTS SECTION UP WE ARE DONE HERE FOLKS YEET",
                                    "score": 3603,
                                    "author": "Domonero",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1367,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And now we all know that u/Corpse-Fucker is a caring and empathetic person with a sweet and tender heart.",
                                                    "score": 111,
                                                    "author": "UnfairGarbage",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I craved this as a teen and reading it has me sobbing, so you right",
                                                    "score": 413,
                                                    "author": "bobbybrownstoilet",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "same ;-; this would have been life-changing to have as a kid from a parent.",
                                                            "score": 137,
                                                            "author": "justasadtransboy"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Glad it’s not just me!",
                                                    "score": 12,
                                                    "author": "softbutton"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Agree. Some sort of text like this should do the trick.",
                                    "score": 258,
                                    "author": "Igotfivecats"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "His bf doesn't have a good relationship with his parents, and he's staying with you for quarantine.\n\nMight it be that bf's parents found out he's gay and didn't accept it? And that your son doesn't want to lose the relationship he has with you by coming out and having you react like bf's parents?\n\nI'm just guessing, but it seems to fit. If you did not accept it, your son would lose his only rock.\n\nIf you let them know it's ok, they will love you and be thankful forever.",
                            "score": 310,
                            "author": "Dark_Tsar_Chasm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 21,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Love the text idea! Please let us know how it goes. Best of luck!",
                            "score": 311,
                            "author": "emeeez",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I sort of had the opposite experience, so I'd like to amend this a bit; I'm straight, and my dad made a lot of effort to make it known that he'd be fine with it if i was gay. I dont think he did it for either of my brothers, so i think that meant he really thought i was into dudes. If i received this text from my dad about a close male friend, I'd probably just be exasperated. Which is to say; you should allow for the possibility that you're wrong. Amend this to:\n\n\"You never have to admit anything to me that you’re not comfortable with, and I apologize if I'm making any assumptions. But if &lt;name&gt; was ever more than a friend, I’d want to make sure &lt;they&gt; knew &lt;they were&gt; loved here too”.",
                            "score": 1036,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My best friend was gay in high school and I told my mom, who was totally fine with it and then got quiet and said “if there’s anything you wanted to tell me I’d be fine with that too” and I was like no mom I’m not gay I’m just fat and ugly and no guy wants to date me, trust me I’ve tried",
                                    "score": 1004,
                                    "author": "Skittle_kittle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I had the same thing happen to me as a teen! My parents sat me down TWICE to give me the “we’ll love you no matter who you love” speech (which is honestly sweet) but it got old after a while. I just didn’t want to date gross high school boys!!",
                                            "score": 109,
                                            "author": "pegmatitic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "One of my best friends in college was a lesbian so obviously we spent a ton of time together and my mom sent me a text like, \"I love you no matter what and I love your friend too!\" My friend and I laughed about it for a long while but then we both thought it was super sweet of my mom to let us know she loved us no matter what. I'm straight and my friend had a girlfriend and I told my mom that but thanked her for being so sweet and accepting.",
                                                    "score": 64,
                                                    "author": "AlexandriaLitehouse"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My mom did the same, although under slightly different circumstances. My best friend and I told our parents we were staying the night at each other's houses every single weekend, and sometimes during the week. We weren't staying at either house, we were having a good time elsewhere, usually in the company of our respective boyfriends. I just kinda did the \"mo-om\" eye roll and let her think I was gay until we got caught. I feel a little bad about it now, but we got away with it for almost a whole school year.",
                                            "score": 310,
                                            "author": "JuniperHillInmate",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's hilarious. You should definitely feel bad, of course, for lying to your mom and using her good will against her. But it's still hilarious!",
                                                    "score": 93,
                                                    "author": "jemidiah",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My mom and dad implied I was gay and that it was okay despite me bringing over several girlfriends...  apparently I punched above my weight class.",
                                            "score": 118,
                                            "author": "TheKillstar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"He's clearly *her* beard, too\"",
                                                    "score": 29,
                                                    "author": "SerpentineLogic",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hahaha I had a similar experience.\n\nMy parents (bless them) tried really hard to let me know that it was fine if I was gay and I could always bring home a girlfriend.\n\nNope. Not gay. Just so unattractive that guys wouldn't even want to be seen with me as a friend ¯\\\\\\_(ツ)\\_/¯",
                                            "score": 58,
                                            "author": "zzeeaa",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My mom flat out asked me if I liked girls when I was 13. I did and still do. But mom, I like boys too. Not gonna tell you about that though.\n\nI'm 27(m) and still haven't told anyone in my family, because while theyre very kind and understanding, I haven't been in a long term relationship with a man nor had any real desire to tell them or bring so's home.",
                                            "score": 29,
                                            "author": "forever_a-hole",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 133,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did your mom at least split the bet she won with you?",
                                            "score": 50,
                                            "author": "brabarusmark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 63,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Skipped town, eh? Well, for someone who wanted grand kids, she sure as hell fucked up her chances of having a relationship with them. That’s the justice",
                                                            "score": 43,
                                                            "author": "wavetoyou",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Did you miss the part about them snuggling? Lol paging r/sapphoandherfriend",
                                    "score": 225,
                                    "author": "Hazelnutpie19",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You don't know if they said no homo first though",
                                            "score": 378,
                                            "author": "no_reddit_for_you",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And after. People tend to forget saying it after, and then they wake up gay the next day. That's how they get ya!",
                                                    "score": 204,
                                                    "author": "Jazst",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You don't know if they looked at each other in the eyes. THE LOOK is what makes you gay.",
                                            "score": 18,
                                            "author": "Elcatraca"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I (a straight dude) have snuggled with another straight dude before. It's not bad.",
                                            "score": 99,
                                            "author": "CapuchinMan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 41,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You always gotta kiss the homies g'night. Why not make sure their dreams are great as well?",
                                                            "score": 72,
                                                            "author": "FunkMeSlideways",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Platonic snuggling with dudes is wonderful.",
                                                    "score": 72,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My one note might be not to suggest that you know they're couple until he says it first. It's one thing to suspect. It's another to imply that you know for certain. Just feels like it gives him more room to breathe and make him feel less like he's late to the party and more like you'd like to be invited to his party if he'll have you.",
                            "score": 103,
                            "author": "dfinkelstein",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s so sweet",
                    "score": 185,
                    "author": "tahsii",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That's the best thing a mom could say. I love that.",
                    "score": 348,
                    "author": "offandwalking",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was. Because it took all focus off of me. It wasn’t like OMG my mom knows, it was like “oh my Mom wants to make sure my girlfriend is comfortable. It’s easier to let the focus be on someone else.",
                            "score": 546,
                            "author": "MommaBearJam",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I literally just teared up. How sweet!",
                                    "score": 135,
                                    "author": "KristenDoesntKnow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same 💖💖",
                                            "score": 27,
                                            "author": "suzieQueue"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "hijacking the top comment to ask you to post an update after you talk to your son!!!",
                    "score": 135,
                    "author": "just-lurking1123"
                },
                {
                    "level": 1,
                    "comment": "My sister is bi and my mom said something pretty similar when she was dating a woman. It definitely helped her to know my mom had her back and supported her always, but wasn’t going to force her to talk about it.",
                    "score": 88,
                    "author": "MotherFuckingCupcake"
                },
                {
                    "level": 1,
                    "comment": "I'm bisexual and made an effort to conceal my past same sex relationships from my parents. I personally feel that this message from a parent would make all the difference in the world to me.",
                    "score": 283,
                    "author": "evehawksleytrio",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "^ the only response you should go with. You’re quarantined for god knows how long, play it safe don’t shake the boat too big",
                    "score": 96,
                    "author": "radicallysunny"
                },
                {
                    "level": 1,
                    "comment": "Goddamn who's cutting onions",
                    "score": 61,
                    "author": "wokka7",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Im on some meds right now that make me super emotional, but this made me straight up ugly cry in the absolute best way. I love your mom and I wholeheartedly believe that she deserves the best things in life.",
                    "score": 21,
                    "author": "jobobbooty",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I love this idea! I think it would also give your son time to process that you know and are accepting and then hopefully will get the courage to tell you.  Whatever happens good luck!",
                    "score": 14,
                    "author": "sprinkleofmagic"
                },
                {
                    "level": 1,
                    "comment": "I've been awake for five minutes and this comment made me cry. Thanks!",
                    "score": 12,
                    "author": "lydocia"
                },
                {
                    "level": 1,
                    "comment": "I love this idea! That's super sweet ❤️",
                    "score": 21,
                    "author": "your_ex_girlfriend-"
                },
                {
                    "level": 1,
                    "comment": "And now I am crying that is beautiful.",
                    "score": 26,
                    "author": "cakes_lollies"
                },
                {
                    "level": 1,
                    "comment": "This is definitely the perfect response, how sweet!",
                    "score": 23,
                    "author": "iwannaboopyou"
                },
                {
                    "level": 1,
                    "comment": "Man, this made me tear up!",
                    "score": 11,
                    "author": "Evie_St_Clair"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would love an update! You’re an amazing parent and your son is lucky to have you in his life! I have a 7 month old and I hope and wish I’m like you when she’s older! ❤️",
            "score": 1072,
            "author": "RawrCookieess",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes please keep us updated! I have no doubt you’re an amazing dad and your son is so lucky to have such an encouraging and accepting parent. I’m positive you’ll find the perfect words to say it",
                    "score": 91,
                    "author": "12Lyster12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would love an update once you do tell him .",
            "score": 1767,
            "author": "L1lB1tt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second this! I need to hear more of this story. You sound like a great dad.",
                    "score": 274,
                    "author": "Meowkith",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I third this! This is absolutely amazing! I need to know how it ends!",
                            "score": 60,
                            "author": "airelien_",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A simple way would be a little note. I like the text idea, but I’m a sentimental person and if my dad had left me a note saying how proud he is of me, and how welcome and wonderful my partner is, I think I’d probably cry (happily) and keep it forever.\n\nEdit: wow!! Thank you so much for my first award kind anon!",
            "score": 4462,
            "author": "zephdreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wholeheartedly second the note idea. A little scrap of paper is so much easier to save as a keepsake than a text in a phone. And having your own parents handwriting saying such loving and accepting things will last long after you are gone. Cards and stuff are overrated imo. It’s those quick jotted honest thoughts on random scraps of paper that really hold the thought. “I love you and I love who you love” \n\n\nYou’re some good beans. \nLove y’all.",
                    "score": 919,
                    "author": "plutoizaplanet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Another good thing about the note idea is that he doesn’t have to acknowledge it immediately. A text... you can only pretend you haven’t looked at your phone recently for so long... especially when you’re in quarantine and no one has any real space from each other.",
                            "score": 202,
                            "author": "famishedhippo27"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A short and simple note: *I know ~~what~~*  **who**  *you did last summer.*",
                    "score": 199,
                    "author": "PotahtoSuave",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*my songs know what you did in...your beeeeeed*",
                            "score": 54,
                            "author": "zephdreams",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This. A note would definitely mean a lot, and I agree, he’d probably keep it for years to come.",
                    "score": 51,
                    "author": "spotandclaw"
                },
                {
                    "level": 1,
                    "comment": "I love the note the best too. Just having something physical to remember the special moment",
                    "score": 15,
                    "author": "ganked_it"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have so many things to say about this post. First my God you are an amazing human and father to get your life together and get your kid out of a terrible situation!!! You are awesome.\n\nYou are also awesome to accept your kid for who he is. Sadly that still doesn't happen and your willingness is fantastic.\n\nAs to answer your question, maybe just quietly let your son know they don't need to hide their relationship. I wouldn't make a big deal of it.",
            "score": 4425,
            "author": "cats4evr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you you're incredibly sweet.",
                    "score": 1547,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was going to say the same thing! You are so totally awesome! And I could read a book about you and your sons story. \n\nAnother commented recommended to send a text and I really like that idea! Good luck and stay safe and healthy.",
                            "score": 244,
                            "author": "joywynter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "seriously.... between getting his shit together to take care of his young son and the way he gushes about him, appreciating everything good about the boy, not to mention the love and willingness to be open to what his son's life is (in direct opposition, sadly, to so many parents) is incredibly refreshing.....great son, great dad.",
                                    "score": 91,
                                    "author": "miss_trixie"
                                },
                                {
                                    "level": 3,
                                    "comment": "I know. I’d love to see the movie. Could OP Play himself?",
                                    "score": 20,
                                    "author": "Gruffstone"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I agree with this. Like the comment about the mom sending a text. Just tell him you're happy for him and they don't have to hide it.",
                    "score": 37,
                    "author": "offandwalking",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "First of all you sound like such an amazing father and this post is so sweet. I wish all of us LGBTQ folk had parents this supportive.\n\nI always had trouble bringing up my romantic situations to my mom, partly because I am (a closeted) bisexual but also because it’s not something she’s ever asked me about. Try to give him clear opportunities to open up about his love life, or drop little hints that you think his ‘friend’ is a keeper or that you think they have a sweet connection.\n\nI wouldn’t pressure him to come out to you if he isn’t ready, but you could always ask him about it while letting him know he doesn’t *have* to tell you what’s going on, but that you’re there to support him no matter what. He might be relieved to have that security of knowing how you’ll react before he has to gather the courage to bring it up.\n\nSidenote: this post really made me wanna come out to my mom, so thank you for that as well",
            "score": 245,
            "author": "TheConcerningEx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm glad this post empowered you! If your parents aren't supportive I can adopt you too if you like haha",
                    "score": 212,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I‘m in a similar situation to the person you replied to and just wanted to add: you can also let them know you’re okay with it by talking about LGBTQI rights and gay couples you know or see on TV in a positive way.\n\nI’ve always known my family would accept me no matter what, because my parents have been very pro gay rights my entire life and always use gender neutral terms like “partner” or “someone” if they  ask about my love life. It particularly hit home when a family friend who is my age brought home another girl. Her mother called my mother and was a bit sceptical and really unsure how to handle it, and my mother just replied _”but aren’t you happy she has found someone she loves and wanted to bring home?”_. My mum didn’t see anything problematic in the situation, she was just so happy for our family friend. And knowing that really reassured me that my parents would accept me no matter if I brought home a girl or a guy.\n\nMaybe that could be something you could also do? Just to make an LGBT-positive environment when you open the discussion about dating.",
                            "score": 11,
                            "author": "squash1887",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 377,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If your dad isn't good, I'm your dad now haha\n\nThank you for your kind words.",
                    "score": 465,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My dad's cool too.. I am straight tho... but can you be my Godfather please?",
                            "score": 156,
                            "author": "Known_Depredator",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course haha",
                                    "score": 184,
                                    "author": "throwralovemygayson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Please give us an update on how this goes! I'm sure you're getting a lot of notifications at this point, but I'd love to hear how all this turns out.",
                                            "score": 44,
                                            "author": "GriffinGoesWest"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Damn you OP, you bought tears to my eyes. This is how parents should be. I wasn't so lucky and got really abusive parents, still dealing with ways to get away from them and I'm still in college. Be my dad too OP, I'd appreciate it very much :'\"\"\")",
                            "score": 25,
                            "author": "beginneratten",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm adopting everyone in this post who has a shit dad haha",
                                    "score": 111,
                                    "author": "throwralovemygayson",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He might not be ready to come out yet but you could just tell him you’re proud of and think his friend is a keeper. He’s likely been debating with his friend on whether or not you know they’re together and he doesn’t want to risk upsetting you and getting his friend kicked out. \n\nSo I really think you should just let him know in whatever way is natural to you. I can tell based on what you’ve written here that you’re a wonderful parent and would find the perfect words to use on your own. It’ll save him them both some unnecessary stress and take a major weight off his shoulders.",
            "score": 886,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And they were roommates!",
            "score": 129,
            "author": "kanch89",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like this is a reference I don't know haha",
                    "score": 74,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I found out about it 2 days ago! This lady was talking about a gay couple and they were roomates. \n\nhttps://youtu.be/4ZuydxEUpFM",
                            "score": 42,
                            "author": "kanch89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So, you're half there. That video has no gay context to it, it's just a fun way to say it. The joke is that, in history lessons, there are many historical figures who \"lived with their roommates\" for many years and into old age. Knowing what we know today, most of those cases are likely gay and lesbian couples. But you'll never hear that in a history lesson; you'll only hear \"they were roommates\"",
                                    "score": 27,
                                    "author": "pototo72",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 105,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll adopt you I'm your dad now haha",
                    "score": 130,
                    "author": "throwralovemygayson",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "With all the mess that's going around it's great having people like you around OP, you make life worth it.",
            "score": 74,
            "author": "Pretty_Biscotti",
            "replies": [
                {
                    "level": 1,
                    "comment": "What an extraordinarily kind thing to say. Thank you very much!",
                    "score": 60,
                    "author": "throwralovemygayson",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would recommend just telling your son what you’ve mentioned about him here in this post. That you love him, are proud of him, and have noticed a few things about him and his guest that lead you to think there’s something more going on. And that it’s okay, there’s no need to hide from you, in a place that your son calls home. \n\nThe big thing is just to reaffirm that he should feel comfortable being as he is around you. That he should not have to hide who he is.",
            "score": 337,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Holy shit dude. This post made me cry. If you're not comfortable with telling him face to face, just send him this link. The way you described your son is so amazing. \n\nOn a side note, our mistakes make us better people. You've made past mistakes and you can tell you're a better person and father. I will always say tell your kid what you said.",
            "score": 67,
            "author": "UTX_Shadow",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Obviously he feels some awkwardness. If it were me, what I would want it to just act as if you’d known all along..maybe ask your son how they first met, etc. and act like it’s already a “known” thing and take the pressure off that way.",
            "score": 113,
            "author": "likeaferriswheel",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m no advice expert, just wanted to say nice job cleaning up for your son. I have a lot of friends who haven’t talked to their dads in years. Dads are important👍🏻",
            "score": 55,
            "author": "zebrahydrant"
        },
        {
            "level": 0,
            "comment": "We are all now fully invested in waiting for part two. Please update. \n\nLove the text idea too.",
            "score": 54,
            "author": "Starting2018"
        },
        {
            "level": 0,
            "comment": "Hearing about people like you gives me hope for the future.\n\nI kind of had this in reverse, I didn't really develop an interest in girls until I was about 19 or 20, didn't like boys either but seeing as I was always around my male friends and was training to be a nurse a lot of people thought I was gay.\n\nMy mum and some family members made homophobic comments around me a lot, but never my dad.  He's always been the quiet, stoic type that doesn't speak unless he needs to. One night he came into my room and said \"you know, whoever you turn out to be, I'm proud of you\" and walked off.  A few simple words but I really felt proud to be myself.\n\nMy dad is my best friend, still barely speaks though.\n\nAlso you mentioned rugby - league or union?",
            "score": 56,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "League, obviously. And because I know it will be your next question, Rhinos haha",
                    "score": 39,
                    "author": "throwralovemygayson",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You might be interested in r/askgaybros. We LOVE this shit over there and will give all the advice you could ever need or want...",
            "score": 78,
            "author": "icefisher225",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a really good idea- many comments here are great but asking the gay community would definitely give even better advice on the whole “not wanting to force them out” thing",
                    "score": 27,
                    "author": "Bloody_Flo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Slip little things into conversation that are subtle indications that you’re aware. Then it’s like a slow transition into this new reality and they won’t feel any need for some big “coming out” moment.\n\n“You’re lucky to get to quarantine together, a lot of couples are being separated now and it’s really hard for them.” That kind of thing, non-chalant. If you’re wrong (you’re not) they’ll be quick to correct you, and if that happens just be like “oh ok mybad, whatever.”",
            "score": 141,
            "author": "darthliki",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this would be cute because it would be a shared moment between the three of them",
                    "score": 28,
                    "author": "BoldOneKenobi69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't really have much advice other than the usual, be gentle, not too direct, right out of the gate \"so I know you're gay\"/\"I know you're together etc...\" Don't try to steal his coming out from him. Speaking as a lesbian, not being able to just say the words yourself is awful, and I've experienced a bad situation where I've been outed.\n\n But most importantly, pretty obviously, be there for him, comfort him, no matter what emotions come tumbling out. You sound so sweet, and it's clear you love your son so much. So, keep loving him as always, and support him, and I'm sure, everything will work out.",
            "score": 33,
            "author": "lilacghostee"
        },
        {
            "level": 0,
            "comment": "Just let them know. I wouldn't make a big deal about it. When they come down for breakfast, tell them they can share a bed and save you some laundry.\n\n(Disclaimer: have no personal experience with coming-out type stuff.)",
            "score": 174,
            "author": "slvstrChung",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do have experience with coming out and if my dad had said that to me I would have found it hilarious lol",
                    "score": 114,
                    "author": "sherlockedfan_221b",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was thinking it has to be based on the family dynamic already there. I have no experience with coming out or not being a cis/hetero person. But if this was my son in my house, it would just be \"hey, since you're not using the guest room, is it cool if I set my drums back up?\"\n\nETA: a critical word was missed",
                            "score": 62,
                            "author": "JuniperHillInmate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I think if they have that type of relationship it’s fine. The way my dad was actually very serious in bringing it up shocked me because he’s usually sarcastic, but I think we wanted to make sure I knew he was serious. Little bit different for me though because I just threw a pride flag up on my door and was like “ehh I’ll see what happens”.",
                                    "score": 27,
                                    "author": "sherlockedfan_221b",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, when the smartass gets serious, shit's about to get *real.* Hope things are well.",
                                            "score": 20,
                                            "author": "JuniperHillInmate",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yup, all good with my dad. He doesn’t understand but he’s very supportive. Not so good with my mom but what can you do.",
                                                    "score": 11,
                                                    "author": "sherlockedfan_221b",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Better hilarious and happy my friend :)",
                            "score": 11,
                            "author": "nikflip"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I never really came out to my parents until I was in college though I never had girlfriends, girl problems, or many girl related things I ever brought up to them or had in general so I’m pretty sure they knew. But what they’d do multiple times through high school was to pull me aside at any time (though the jury is still a little out on whether or not any time is a good idea) and just tell me \n“No matter who you fall in love with or have sex with or spend time with outside of a friendship you’re loved we love you.” And then they’d also apologize cause those conversations can be embarrassing in the best way. But just letting him know and reaffirming it whenever you can is super helpful",
            "score": 27,
            "author": "uhidkreally"
        },
        {
            "level": 0,
            "comment": "Gay guy here, with accepting family members.  So I have personal experience on this one. I'm also seeing some advice that I wouldn't necessarily recommend, so here's my experience.\n\nMy mother just casually mentioned one day when the subject was relevant that she'd be okay with it if I turned out to be gay.  Later, when I found out that I was, in fact, gay, and fell in love with my long-time best friend, I had no trouble coming out soon after that.  I took a couple of weeks to figure things out but that's it.\n\nAfter that, we discussed who else in the family would be accepting and who we might want to hold off on telling.  My immediate family is accepting, but the further into my extended family you go the less accepting they get, so my grandparents still haven't been told 3 years later (honestly they probably know, but won't say anything and none of them are severe bible thumpers to the point where they'd actively seek it).  So that's a point you'll have to consider going forward.  My boyfriend's family is in another state and are more likely to be a problem if they found out, so we established a cover story that he is sleeping on the couch/in the spare room.  Helping them keep the secret from anyone else they don't want to know is important, too.  I don't imagine you'll have many visitors for a while, but if the stay becomes longer term (hell, it's the situation I'm in), work on a cover story if your son/son's BF deem it necessary.  My stance on this isn't fully shared by everyone -- some people would rather just be open about being gay and let any unaccepting people sort themselves out.  So let him decide this, and be ready to support him with his choice.\n\nThat all worked well for my family, and it may work well for yours.  It might just be that my family likes to communicate with subtlety (like I'm absolutely sure she was telling me that she suspected that I was gay then, but apparently my parents saw a gay couple kissing on their honeymoon and talked about what if they had a gay son), and an open approach would work better since you already know, but... dropping the hint in a non-forced way is the best thing you can do for an LGBT person in your family, because unfortunately secrecy is the only reliable shield we have, we never know if someone will be accepting or hurl abuse at us if we come out unless we have some hint.  It turns everyone into a potential threat, and honestly I hate that I have to keep it secret from others in my family.  Just make it clear that it's safe for him to come out, and I'd recommend letting him save face by coming out on his own terms which I can assure you will not take long, and ask who else (if anyone) he wants to know about it, and you will have his eternal gratitude.\n\nTL;DR: My family just mentioned that they'd be okay with me being gay, and that helped me come out safely years later.  The more direct approach might work if that's what your family is used to doing, but either one would get quick results.  It's possible he may want to hide this from other family members -- let him decide what he wants to do in that regard, and offer your help and support with that.  Also get in the habit of knocking before entering if you haven't already.",
            "score": 27,
            "author": "drhead"
        },
        {
            "level": 0,
            "comment": "I think it makes sense to discreetly say something to your son. \n\nI'd go with something like \"I get the impression \"Bob\" might be more than a friend.  If so I'm OK with it.  I want you to be happy and comfortable when you're here.\"",
            "score": 123,
            "author": "tralfaz57",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is nice. Although I'd add \"I want you *both* to be happy and comfortable while you're here\"!",
                    "score": 65,
                    "author": "vampireondrugs"
                },
                {
                    "level": 1,
                    "comment": "This. No indirect talk, just upfront, discreet and sensible acceptance. What else could one want?",
                    "score": 26,
                    "author": "OphrysAlba",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"y'all hella gay tho, right?\"",
                            "score": 50,
                            "author": "Abshalom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You sure he's gay and not just after your meth and tigers. That's a thing.",
            "score": 68,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this a reference to that Netflix thing my coworker keeps telling me to watch haha",
                    "score": 78,
                    "author": "throwralovemygayson",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly. Show him exactly what you wrote here. \n\nThis post show how much you love him and how proud you are of him.\n\nLove it",
            "score": 105,
            "author": "gordon_18",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe leave out the part about opening his bedroom door...\n\nBut otherwise yes!",
                    "score": 44,
                    "author": "PluckyPlankton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I loved that part. It shows the dad sees him as still his little boy when he used to check in on him when he was younger",
                            "score": 43,
                            "author": "gordon_18",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He'll always be my little boy",
                                    "score": 79,
                                    "author": "throwralovemygayson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man this was exactly the thread we needed right now",
                                            "score": 30,
                                            "author": "Amf2446"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably not tremendous advice but I'd just play it cool. \n\n\"Here wee man, I know you're pumping him. It's fine. What you both wanting for dinner?\"\n\nI feel like acting as if it's no big deal at all, barely worth discussing, is the best play. If he'd brought his girlfriend home there wouldn't really be a conversation to be had. You're totally cool with it, clearly, so just let him know that. He probably knows you're ok with it anyway, or he'd be a bit more worried about getting caught.",
            "score": 23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How delightfully Scottish haha",
                    "score": 24,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahaha, we wear kilts and were colonised by effete arseholes so our sons having boyfriends isnt a big deal.",
                            "score": 13,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Show him this post. If I knew my parents were a 10th as proud of me as you are of your son I wouldn't have hesitated in coming out. Please tell him all the good things you said about him here.\n\nIf that is a bit confrontational for you, just slip in a convo something like \"do you and your Mr want pizza for dinner tonight?\" That way there is no awkward sit down and talk. It's a very subtle way of saying \" I know and it doesn't bother me in the slightest\".\n\nBut please consider showing him the first half of your post.",
            "score": 19,
            "author": "zackary8765",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Please update 🥺",
            "score": 19,
            "author": "ifokinlovepotatoes",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt;What I want advice on is this; how do I let my son and his boyfriend know that I'm okay with them being a couple and they don't have to feel like they have to sneak around in my house? I want them to be comfortable here and I want them to know I support them both no matter what.\n\n\"I'm okay with you being a couple and you don't have to feel like you have to sneak around in my house. I want you to be comfortable here and I want you to know I support you both no matter what.\"",
            "score": 18,
            "author": "demonachizer"
        },
        {
            "level": 0,
            "comment": "Well in my experience hiding your relationship from your parents causes alot of unnecessary stress and can even negatively effect the relationship negatively. \n\nJust sit down for breakfast one morning and ask if he will be joining you for Christmas as well. When they answer say one of the following. \"fantastic, everyone will be so excited to meet your new bf\" or \" I was just thinking you would want to introduce your new bf\". then ask the poor terrified kid to pass the salt. Haha \n\nor if you want to tread lighter. \n\nJust tell your son you love him no matter what. And you really hope he brings his bf back for the next family get together as it's been a pleasure getting to know him.",
            "score": 70,
            "author": "Faithjacal",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hi can you please adopt me 🥺❤️🥰 you sound like such a kind person haha",
            "score": 20,
            "author": "stranger1235",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes absolutely I'm adopting everyone who doesn't have a good dad and I love all of my new children haha",
                    "score": 37,
                    "author": "throwralovemygayson",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is exactly the kind of parent I'm determined to be for my trans son. He struggles so much because of the closed-mindedness of where we live, and I'm pretty much the only family member who knows and 100% supports him. We're surrounded by the \"ultra religious conservative small town\" mentality. It's hell. I LIVE for the day I can proudly shout to the world that my beautiful son is a fucking GIFT to behold. \n\nSo I'm here for the mom side. If any of you have a shit mom for being LGBTQA, I'll adopt you too. 💜",
            "score": 19,
            "author": "aireac0de",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're right your son is a gift and he's very lucky you treasure him like one. Peace and love to you, friend.",
                    "score": 16,
                    "author": "throwralovemygayson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, i got a new son in Quarantine too!",
            "score": 16,
            "author": "breyedgrl6786",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just casually say: \"you guys are cute\" when they're preparing their one meals. Dont make it obviously and get some chips or someone and then walk out of the kitchen.",
            "score": 99,
            "author": "elegance_of_night",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; some chips or *someone*\n\nCasually picks up the boyfriend and walks out of kitchen. Son is left very confused.",
                    "score": 60,
                    "author": "ugghhh_gah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crying",
                            "score": 14,
                            "author": "Blackshells"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A series of texts: “Son, I’ve noticed some things about your friend . . .\n\n and I hate to be blunt about this . . . \n\nbut once it’s out in the open, we’ll all feel more comfortable . . . \n\nplease just be honest with me . . . \n\nI promise not to react weirdly . . .\n\n I just need to know . . . \n\n Is your friend . . .\n\n Canadian???????”",
            "score": 56,
            "author": "Lostpurplepen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just start referring to his friend as his boyfriend:\n\n“Does your boyfriend like pineapple pizza?”\n\n“Do you and your boyfriend need more TP in your bathroom?”\n\n“Your boyfriend keeps leaving his thongs in the dryer, can you do something about that?”",
            "score": 311,
            "author": "Herdnerfer",
            "replies": [
                {
                    "level": 1,
                    "comment": "This made me l.o.l",
                    "score": 163,
                    "author": "throwralovemygayson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you please update this post after you talk? It's so wholesome",
                            "score": 62,
                            "author": "Sip_of_Sunshine"
                        },
                        {
                            "level": 2,
                            "comment": "That’s a little too dramatic but you could work it into a conversation like “I guess if the world has to end there are worse ways for me to go than being roommates with my son and his partner.” \n\nHow was being gay treated in your home when he was with you? We had gay friends so my kids were exposed to it and even though my kids have serious relationships with opposite sex partners I still tell them it’s ok to be gay. \n\nI do think the best way to deal with it is to take their relationship as a given. Take a picture of them together, print it out and put it on the fridge. Tell your son you enjoy having his friend quarantine with you.",
                            "score": 33,
                            "author": "VROF",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Being gay was never really directly discussed, honestly. I do have gay friends, though I'm not sure if he's aware they're gay, and his best friend from school came out as a lesbian in their final year and she was always welcome in our home so I hope he knows I support LGBT people.",
                                    "score": 68,
                                    "author": "throwralovemygayson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Knowing that you support LGBTQ-people in general is different from knowing you'd be fine with him being gay. \n\nAnd sometimes it's more about yourself rather than how other people act. \n\nBy that I mean I had a really bad relationship previously and sometimes I expect my current SO to act/react like the crazy one. Not because of anything my SO has said or done, but just because of my history. \n\nSo your son might be logically aware that you wouldn't have a problem with him being gay, but emotionally it's still a big deal coming out to you.",
                                            "score": 28,
                                            "author": "TheRealSamVimes",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol the last one, yassss",
                    "score": 44,
                    "author": "eek2020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe big up an lgbt topic from the news and talk about approving of the lgbt community and sympathizing with their struggles (like having to be weary that their families won’t accept them) around your son and then mention that you would have his back no matter what.",
            "score": 23,
            "author": "ButterWithTime"
        },
        {
            "level": 0,
            "comment": "He’s Canadian he’s just being nice",
            "score": 30,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This made me l.o.l",
                    "score": 26,
                    "author": "throwralovemygayson",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro can't two homies just chill in bed and kiss eachother good night without being called gay.",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not gay if they at least have socks on.",
                    "score": 17,
                    "author": "YUSOFABULOUS",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just let him read this. \n\nThis is lovely.",
            "score": 10,
            "author": "grahamg1983"
        },
        {
            "level": 0,
            "comment": "It sounds like your son had a rough childhood, if you were able to completely remove him from his mother’s household then I’m assuming he has some trauma in relation to that? This is a very personal, vulnerable part of him that he may not be ready to share, more so because of the number his mom did on him. He may be thinking that even though you’ve been a great dad, if this happens to be the ONE THING you’re not okay with then he’ll have no one, and is either again abused by his only remaining parent, or out on the street with his partner during a pandemic. \n\nI’m making a lot of assumptions based on vague text I know, I’m just talking as a previously abused child who’s learned self-preservation to an unreasonable level. I would lead the convo with you making sure he know you’re accepting of the LGBT+ community, no matter what. He should at least have that reassurance and come out to you when he’s ready.",
            "score": 21,
            "author": "cactuskirby"
        },
        {
            "level": 0,
            "comment": "Seeing this post filled me with far more anger than it should have. You're a fantastic father and person. I just can't even explain the anger and resentment I feel knowing I'll never feel loved or wanted the way you'll make your son feel.",
            "score": 27,
            "author": "StrayMiqitten",
            "replies": []
        }
    ]
}