{
    "id": "gbzt6z",
    "score": 35172,
    "title": "[UPDATE] My (20F) sister's (28F) behaviour towards my boyfriend (21M) is horrendous",
    "author": "[deleted]",
    "date": 1588391161.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/gbzt6z",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/relationship_advice/comments/g9j503/my_20f_sisters_28f_behaviour_towards_my_boyfriend/?utm_medium=android_app&amp;utm_source=share"
    ],
    "postText": "Previous post:\nhttps://www.reddit.com/r/relationship_advice/comments/g9j503/my_20f_sisters_28f_behaviour_towards_my_boyfriend/?utm_medium=android_app&amp;utm_source=share\n\n(i'm on mobile. i apologize for any mistakes)\n\nHi. First of all, I'd like to thank each and every one of you for your help. I'm really grateful for the support I've received here and all those little messages some of you sent me really made me understand the situation I was in. The many MANY comments I read here gave me the strength I needed to talk to my sister. Thank you, guys.\n\nI should probably tell you that this might not be the perfect badass ending you all were expecting, and I apologize for that. I've always had a hard time standing up against my sister. Like I said in my original post, my boyfriend doesn't like confrontations either and he's also a huge people pleaser which makes this situation harder for both of us.  \n\nNevertheless, I finally decided to talk to my sister yesterday. She was actually sitting in my living room in her underwear and bra, and I completely lost my shit. I told her multiple times to wear some clothes but she said it was too hot which it was not. She then made a small comment about me being insecure about my bf liking her or something like that, and that made me angry.\n\nI sat her down and we talked. I told her she was making me uncomfortable. She was making my boyfriend uncomfortable, and we wanted her to leave. She looked very shocked by it because I don't think I have ever talked to her like that. She immediately apologized though. She said she didn't know or some bullshit which I wasn't going to fall for this time.\n\nI gave her an ultimatum. She needed to pack her shit and get out in three hours. She looked very emotional and she apologized a lot, said \"sorry\" a lot and told me she loved me. She said she would never intentionally try to hurt me. If I \"misunderstood\" her actions, it wasn't her fault. She kept saying she didn't know. She said she was just trying to be \"friendly\" to my boyfriend which is not true at all. \n\nI asked her if sexually harrassing someone was \"friendly\" to her, and she started crying. By this time, my bf who was in our bedroom (avoiding my sister and her skimpy clothing) came to support me. She kind of directed her questions towards him. She asked him if she was making him uncomfortable (He said yes) and she cried and apologized. She then tried to gain his sympathy by saying that I was kicking her out when she had no place to go. She also lied that I was always mean to her. She completely ignored me and asked him if she could stay. She had nowhere else to go.\n\nOf course he said no. What the fuck did she think. I will forever remember the look on her face.\n\nSo yeah, she actually refused to leave, cried a lot and said she was jobless and she didn't have money, no place to stay, no friends etc. I told her she had no friends because she was a bitch (the first time I said something like this to my sister) She then tried to guilt trip me to let her stay by repeating the words \"I'm your sister\" \"family\" \"I love you\" etc. Me and my boyfriend helped her pack all her stuff and put it next to her car. I told her that she can stay in her car, I didn't care. I wanted her to go.\n\nIt wasn't really \"epic\" like some of you wanted. I was actually crying a little while I was shouting at her because I was shaking so much. At one point my bf had to tell me to calm down. It was just so overwhelming. I'm just glad she's gone.\n\nShe did leave eventually. She was calling someone and I'm pretty sure she went back to her own flat. Thank god she's not going to my parents because I don't think she knows how to quarantine. I know she won't quarantine and this was the main reason I was hesitant to kick her out.\n\n2-3 hours after she left, my mom called me and yelled at me for kicking her out. I shouldn't have been shocked when she accused my bf of bothering my sister. My mom also asked me what kind of man I was dating, I should leave him etc. I should've expected that, really. I tried to reason with her but my mom was just angry at me. She asked me things like \"how can you do this to your own sister\" and similar bullshit she should be asking my sister. At that point I was so fucking angry. I was in tears and shaking. I just told her to fuck off in anger and hung up.\n\nIt was just a weird day. I'm proud of myself for finally standing up to my sister, but I also don't really feel like getting up from my bed. My bf is back to his cheerful self and I'm happy about that, but I just feel like such an idiot. I should've realized my mom would never take my side a long time ago.\n\nI just don't understand what I did to make my mom so angry at me. Why doesn't she love me? I have done everything she asked me to do, but she never takes my side in things. I just want her to fucking love me and support me for once. It just never happens and I feel like I'm a fucking idiot for even trying. I think she regrets I was even born. \n\nAnyway fuck that. I'm done trying to reason with them. My mom will never believe me. Pretty sure my sister lied to her so mom keeps calling and trying to speak to my bf.\n\nI'm currently thinking of cutting off all of my family. All they do is make me feel like shit. I deserve better than that. My boyfriend deserves better than that\n\nI apologize for venting. What's done is done. I don't regret it. I'm glad I have my boyfriend and he loves me unlike my family and we finally have some alone time. He's been so moody, but right now he's actually cooking and stuff and he hasn't done that ever since sister came here so yeah. I'm glad she's gone. My boyfriend is glad she's gone. I finally have some peace and quiet in my home.  \n\nThank you so much to everyone. I don't think I can thank you all enough. Some of you talked to me, sent me messages and it really opened my eyes. I'll take care of myself and my boyfriend now. Thank you :)\n\nEdit: thank you everyone. I've been reading your comments. I'm still shocked by the support I've received here. Please know that I appreciate it so much, even though I may not be able to reply. Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "You said not to expect a badass ending but you were a stone cold badass. I'm so proud of you for self-advocating and for protecting the man you love from a sexual predator. I know that must have been incredibly painful but the worst part is over. The infections gone. It'll still hurt, but keep yourself 'clean' and away from her and you'll make it. Well done!",
            "score": 16771,
            "author": "IxamxUnicron",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for saying that. I'll remember this whenever I need some extra courage in the future.",
                    "score": 1611,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude you kicked her out on her ass and told your whole family to fuck off, if that's not badass I don't know what is. I guess you could have thrown her shit out the window and blown up her car or something.",
                            "score": 782,
                            "author": "vfxninja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Totally fucking badass!",
                                    "score": 105,
                                    "author": "carrieberry"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Might I also add the subreddit r/momforaminute? If you just need a bunch of people supporting you and telling you what a wonderful daughter they are, they’re great.",
                            "score": 534,
                            "author": "BakingGiraffeBakes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't know about this sub and wow thanks. ❤️",
                                    "score": 109,
                                    "author": "orangefox423"
                                },
                                {
                                    "level": 3,
                                    "comment": "That is the most wholesome fucking thing I've ever seen on this site. I had to click out of it because I didn't want to cry.",
                                    "score": 58,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ditto. Great place to recommend.",
                                    "score": 28,
                                    "author": "natwriter85"
                                },
                                {
                                    "level": 3,
                                    "comment": "From the moment she said \"why doesn't she love me\" that's what I was thinking!",
                                    "score": 23,
                                    "author": "FixinThePlanet"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It sounds like your sister (and mom!) are narcissists. There are subs for that. I didn't write this, it's been around for awhile. In case you haven't seen it - \n\n\nA Narcissist's Prayer\n\nThat didn't happen.\n \nAnd if it did, it wasn't that bad.\n\nAnd if it was, that's not a big deal.\n\nAnd if it is, that's not my fault.\n\nAnd if it was, I didn't mean it.\n \nAnd if I did...\n\nYou deserved it.",
                            "score": 135,
                            "author": "conamo"
                        },
                        {
                            "level": 2,
                            "comment": "OP you are amazing and strong. It is completely understandable that you are overwhelmed by the rejection of your mother, that is deep down pain that cuts to the bone. It is healthy for you to mourn and process your grief. Your sister is your mother’s “golden child”, and this pitting children against each other is a common tactic of narcissistic and abusive parents. For your own sanity I would go no contact for awhile and focus on healing. I would look up resources in your area and see if you can talk to a counselor, and check out some self help books as well. There are also some good subs like r/justnofamily and r/raisedbynarcissists with people who have been through the pain you are experiencing and can help with advice. Sending virtual hugs your way, you will come out of this a stronger person!",
                            "score": 216,
                            "author": "jzdelona"
                        },
                        {
                            "level": 2,
                            "comment": "I am UNBELIEVABLY proud of you OP!!!! You did exactly the right thing, don't cave. Definitely take a step back from your family. Ignore their calls for a few weeks, you owe them NOTHING based on how unfairly they treat you and your sister. \"Family\" doesn't mean shit if they don't treat you like family should! Keep your chin up, and allow yourself to grieve your past. You have a better, brighter future because of your actions today &lt;3",
                            "score": 52,
                            "author": "Artemistical"
                        },
                        {
                            "level": 2,
                            "comment": "Bravery is not the absence of fear. Bravery is acting despite feeling very afraid. You don't need more courage, you have more than you think.",
                            "score": 42,
                            "author": "eunonymouse"
                        },
                        {
                            "level": 2,
                            "comment": "I was going to joke about how there weren’t any big explosions that you walked away from without looking back... but then I realized that’s exactly what happened (metaphorically speaking).\n\nTime to put on some sunglasses.",
                            "score": 24,
                            "author": "rabbitwonker"
                        },
                        {
                            "level": 2,
                            "comment": "Being badass is doing what needs to be done, especially when it’s terrifying.  You did good.\n\nThat scene was very familiar to me.  My brother is a narcissist and my mom was his enabler.  Everything your sister and mom did and said is straight out of their playbook, though it manifested differently.  I’m very glad you stood up for yourself and your boyfriend.  Sadly, your mom may never be able to admit what your sister is.  But you can make your own family, one that will not bully and gaslight you, but will love you for yourself.\n\nThe next few months will be hard, but give yourself some recognition.  You’re on your way to a better future where you matter.",
                            "score": 17,
                            "author": "BootsySubwayAlien"
                        },
                        {
                            "level": 2,
                            "comment": "Badass as fuck! Remember this always.",
                            "score": 8,
                            "author": "rkl1313"
                        },
                        {
                            "level": 2,
                            "comment": "I'd buy you a congratulatory cake if I could. You did extremely well. I know you're going to feel like shit for a while, but you're on the way to NOT feeling like shit. I promise that when that happens, you will be so, so happy for what you've done.",
                            "score": 8,
                            "author": "CuteCuteJames"
                        },
                        {
                            "level": 2,
                            "comment": "Fucking champion 👍",
                            "score": 7,
                            "author": "phaz3"
                        },
                        {
                            "level": 2,
                            "comment": "Don’t downplay your success, OP! Even badass people need to cry after doing something hard",
                            "score": 7,
                            "author": "GrowingApathetic1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't understand why the sister couldn't stay at her own flat during quarantine in the first place.",
                    "score": 333,
                    "author": "istara",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually have no idea. She said she didn't have a job or money (for groceries) and so she can't survive quarantine on her own.",
                            "score": 342,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tf your sister is a leech",
                                    "score": 416,
                                    "author": "Kindaconfusedbutokay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tapeworm. At least leeches drop off by themselves eventually.",
                                            "score": 211,
                                            "author": "vandragon7",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tapeworms by comparison latch on and contaminate everything with pieces of themselves attempting to sow their seeds in anyone willing to eat bullshit.",
                                                    "score": 98,
                                                    "author": "greenwrayth"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She'll be fine. People like that always look out for themselves.\n\nYou did a heroic thing, seriously. You should know that. It is not easy to stand up against toxic relatives, but it must be done if you want to protect the people you love. And you did the right thing by standing up to your mom. She's abusive.",
                                    "score": 161,
                                    "author": "herrobp"
                                },
                                {
                                    "level": 3,
                                    "comment": "She's a grown woman, no matter how much your mom made you feel like it is, she is NOT your responsibility. Don't feel guilty for kicking her out, if she can't be an adult it's of her and your mother's own doing. \n\nYou're the one your mother should be proud of, clearly you are doing well on your own despite your upbringing. Why she would be proud of an adult who can't take care of themselves is beyond me. You did well by standing up for yourself and your boyfriend. You don't have to keep in contact with them just because they are your family. Toxic is toxic. You would be better off without them in my opinion!",
                                    "score": 112,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "At first glance, I wouldve said that she was scared and wanted to be with her sister/best friend, but through your post we know that isnt the case. It looks like her need to be the center of attention is why she was there, doing anything she could to capture the attention she so desperately craved. We all couldnt be more proud of the way you stood up to her though, you are a badass!",
                                    "score": 56,
                                    "author": "gassito"
                                },
                                {
                                    "level": 3,
                                    "comment": "What baffles me is that she didn't stop her renting contract. She says she can't afford it but she didn't actually move out of there, she just stayed somewhere else. So she's still paying rent with money she's claiming not to have? If groceries are the problem your parents might as well have send her $30 a week for some milk and eggs rather than suggest she move location completely.",
                                    "score": 53,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "It sounds and looks like your sister and your mom sadly have many things in common.\n\nYou did well. Learn from it, heal together with your boyfriend and come out even stronger!\n\nI‘m sure you‘ll make it! Cheers &amp; Love",
                                    "score": 21,
                                    "author": "-Master--Yoda-"
                                },
                                {
                                    "level": 3,
                                    "comment": "I feel like you would have helped her if she respected boundaries. You showed that. What is she expecting, that you'll just pay for her food and apartment while she tries to humiliate you? (The humiliation you avoided by kicking her out is totally worth it. Your BF sounds like a cool guy, but she was actively trying to make something happen with him. )\n\nYou're a badass.",
                                    "score": 14,
                                    "author": "willy_der_schwimmer"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah your sister is a loser and your parents know it. be proud that you're not your sister, you are sooo much better!",
                                    "score": 10,
                                    "author": "Artemistical"
                                },
                                {
                                    "level": 3,
                                    "comment": "I was worried about sister, super-skank that she may be, until I understood that *she has her own damned place*.  She can go quarantine there just like the rest of us single people.  \n\n(Or not, she can be stupid and go get herself and/or other people sick, since OP says she “doesn’t know how” to quarantine. I didn’t realize this was something hard to comprehend...)\n\nIf she doesn’t have a job, she should be eligible for SNAP (food stamps).  She should also be eligible for different food banks.\n\nIt was just easier to freeload off OP.\n\nThe line about the boyfriend “liking her better” really sold me that she knows exactly what she was doing.\n\nOP, you managed to completely change my mind. I think it’s good that you held your ground.  Your sister is going to be fine.  If worse comes to worse, I’m positive your mom will “rescue” her with  grocery money.\n\nAs for your mom....she’s not going to change.  If she can’t respect your decisions and the reason behind them, I think no contact is the way to go.\n\nNo one should make you feel sad, small, and inferior.",
                                    "score": 10,
                                    "author": "LEGOmaniac66"
                                },
                                {
                                    "level": 3,
                                    "comment": "She didn't have a job, yet her mortgage/rent somehow magically paid itself? Or I'm guessing.... your parents paid it?",
                                    "score": 3,
                                    "author": "SalsaRice"
                                },
                                {
                                    "level": 3,
                                    "comment": "Roughly how old is this sister of yours? 20-25? 25-30? North of 30? I mean some people can be immature in their early 20s but if this person is in their late 20s early 30s I doubt they are going to change. Most people are well set in their ways by then unfortunately...",
                                    "score": 3,
                                    "author": "AnBearna"
                                },
                                {
                                    "level": 3,
                                    "comment": "If money for groceries was the problem, your parents could send her some money, not send her to leech off you. It's no problem living solo during quarantine when you're healthy.",
                                    "score": 3,
                                    "author": "Mountaingoat101"
                                },
                                {
                                    "level": 3,
                                    "comment": "So she wanted to mooch off of you. That's despicable.",
                                    "score": 3,
                                    "author": "your_moms_a_clone"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah wtf? Why is she even there? She's all like Waaahhh I have nowhere to go... **how bout your own damn flat?!**",
                            "score": 124,
                            "author": "Fatlantis"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I’m sorry (not really) but sis is 28, aka a grown-ass woman. She can definitely stay by herself.",
                            "score": 59,
                            "author": "Schmelectra",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree; very badass!  Things will get better with time.  I’m sorry OP’s family is so toxic.",
                    "score": 1721,
                    "author": "YayBooYay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Was gonna say the same thing that was badass as shit good job standing up for yourself!",
                            "score": 333,
                            "author": "3liBillNye",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Was also Gina say the Same! So badass!",
                                    "score": 85,
                                    "author": "azuldelmar"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly. How was that not 'epic'. I was expecting some lame backtracking and acceptance of apology. Just threw her shit out on the street!",
                    "score": 643,
                    "author": "IGrowGreen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely! I think it's because op thought her crying would ruin it? If anything it makes it way more epic and badass because she did what needed to be done even if it was stressful for her. This was epic on titanic proportions.",
                            "score": 160,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Same here! Out she went. Legend.",
                            "score": 73,
                            "author": "sarsar69"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kudos to you OP! I'm so damn proud of you!! That level of badassery should be applauded and you should be proud of yourself too!\n\nScrew your sister and your Mum. Sorry to say but if your Mum can't even listen to your reasoning then screw it! If you have recorded videos of your sister's behaviour, send that to your Mum and ask her if she would and could withstand such behaviour.\n\nIn the future, you do whatever you feel is right to feel at peace.",
                    "score": 235,
                    "author": "Petitelechat"
                },
                {
                    "level": 1,
                    "comment": "There's only so much a person can tolerate. She may not learn her lesson, but she may learn that there are limits to other people's generosity.",
                    "score": 146,
                    "author": "czhunc"
                },
                {
                    "level": 1,
                    "comment": "On the back of this, I’d advise OP to read They F*ck You Up by Oliver James. It might give her insight into why the sister is favoured. It’s a lost cause to chase the mother’s love over the sister as she clearly favours her. It hurts but it’s no reflection on OP.",
                    "score": 74,
                    "author": "Caribooteh"
                },
                {
                    "level": 1,
                    "comment": "When she said that the ending wasn’t going to be satisfying, I kept waiting for her to just agree to let her stay for one extra day or whatever, but nope! She stuck to her guns, even when she was in brand new territory! That is, word for word, the definition of badass. You did it, even when you were terrified. It the stakes weren’t high and valuable to you, then doing it wouldn’t be badass. It would be just a regular Tuesday. Stepping into the fear is what makes it badass. Good job, sister!",
                    "score": 24,
                    "author": "Ihaveapeach"
                },
                {
                    "level": 1,
                    "comment": "Agreed. Very bad ass ending indeed. I’m glad you stood up for yourself, your bf , your relationship and most importantly your peace of mind. \n\nRemember....you shouldn’t keep people\nAround who hurt you just because you share a family name and some chromosomes. If they’re toxic to you and your mental health, cut them off no matter who they are. Period. \n\nEnjoy your newly earned shiny spine!",
                    "score": 23,
                    "author": "juice_109"
                },
                {
                    "level": 1,
                    "comment": "Amen, she was badass.",
                    "score": 34,
                    "author": "Pamplemousse991"
                },
                {
                    "level": 1,
                    "comment": "I second this. And third - up till countless, true heroes do things they’re scared of. And you did it!",
                    "score": 15,
                    "author": "Danoontje4321"
                },
                {
                    "level": 1,
                    "comment": "Came here to say this! What you did was gutsy as fuck. And really mature. Good on you.\n\nAnd you can’t get out of bed bc your mom isn’t being fair. I’m sorry that you feel she doesn’t love you. I’m sure that’s not true. She just had a weird bias to your sister. But it must suck for it to be so obvious. Take your time in bed and be gentle with yourself as you process that. \n\nTry to reflect on the good of this situation, someone im was treating you badly and you stuck up for yourself in a calm and mature way. Keep doing that and you’ll go far in life and find yourself surrounded by good people.\n\nGood luck with everything!",
                    "score": 12,
                    "author": "lestypesty"
                },
                {
                    "level": 1,
                    "comment": "If I got the same result out of my conflict resolution, I'd walk around with a \"I am a badass\" shirt around all the time.\n\nWay to go girl",
                    "score": 12,
                    "author": "Aintee"
                },
                {
                    "level": 1,
                    "comment": "Agreed. This was totally badass. I'm proud of you for sticking up to yourself. Don't let your family emotionally blackmail you, cut that shit in the bud.",
                    "score": 10,
                    "author": "Eirwel"
                },
                {
                    "level": 1,
                    "comment": "Strong agree - I was expecting a let down but that was competent badass. Standing up to family, friends or loved ones is one of the hardest things to do. Your family is toxic and no matter what happens with your boyfriend in the future don’t hurt yourself by maintaining ties with them.",
                    "score": 10,
                    "author": "mkkreuk"
                },
                {
                    "level": 1,
                    "comment": "Stone Cold!",
                    "score": 18,
                    "author": "oneknocka"
                },
                {
                    "level": 1,
                    "comment": "Seriously!!! I got so nervous when I read that first part about it not being badass because to me that translated into her letting her sister stay... But then I was pleasantly surprised!!! OP is freaking awesome!!!",
                    "score": 5,
                    "author": "peachykweene",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What?! This was absolutely badass! Yeah maybe you didn't wear a cape, but not all heroes... Something something.\n\nHere is what you did do:\n\n - Put the person you loved most, first. And stood up for him. He will be eternally and rightfully grateful.\n\n - Learned where you stood with your family (which sounds like it was under the sole of their shoe)\n\n - Set boundaries\n\n - Set yourself up for long term happiness.\n\nNot all families love equally OP. I had to cut my parents off. For me it wasn't super difficult, so in that sense I can't sympathize. I don't have any happy memories of them, hah. However, what I can say is that while blood ties may be stronger than traditional relationships, they are not immune to constant neglect or abuse.\n\nI'm proud of you. I remember your last post. I was worried and upset for you, and I'm happy you were able to handle it. When the shaking and anger and rawness pass, you will feel better about everything. I promise.",
            "score": 4654,
            "author": "smexyporcupine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly! OP fucking killed it \n\nShame that the mom doesn’t know how morals work though",
                    "score": 514,
                    "author": "Domonero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, people need to learn that just because you're related to someone doesn't mean they get leeway, especially when they treat you like shit. You owe your parents nothing for bringing you into the world. You only \"owe\" your parents if they show you unconditional love and support and the best way to repay it is to show the same to your own children.\n\nFUCK YOUR SISTER &amp; MUM. Now I know it might hurt that she's not in your corner, but your boyfriend is, don't hold it in. Talk to him about it, go see a therapist if you feel you need to. You'll be a much better mum than are and that's all that should matter.",
                            "score": 155,
                            "author": "TheFactsAreIn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just want to say that, as a Mom, I'd be so damn proud if you were my kid. The self-awareness and moral support you gave to OP is really wonderful. Your parents are missing out on a great person. They deserve each other.\n\nThey were lucky to have you.\n\nAnd OP, as a mom, I'd be so damn proud of you for sticking up for yourself and wondering where I went wrong with my oldest kid. If you were my kid and told me what your sister did, I'd order her to come home so I could whoop her ass verbally (I don't believe in corporal punishment). However, there would be tears involved along with a telephone call to you apologizing for being a bitch to her own sister.\n\nTl;Dr: I'm very proud of both of you.",
                    "score": 55,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I’ve know many people raised by toxic families who go on to form close familial bonds with friends who love and support them, which is great. You can find a new family with people who uplift you! This is a good opportunity for op to foster relationships with friends and develop closer bonds with kind people, once the current health crisis has passed start fun activities like movie and dinner nights to help fill the void left by her blood relatives.",
                    "score": 16,
                    "author": "jzdelona"
                },
                {
                    "level": 1,
                    "comment": "Chiming in that the expression \"The blood of the covenant is thicker than the water of the womb\" originally means the opposite of what most people now think.\n\nThe \"blood\" is with whoever you go through the shit of life with.\n\nThe \"water\" is with whoever we happen to share genetic material.\n\nChoosing to stick with whoever loves you and cares about you in a healthy way? Valid and healthy life choice.",
                    "score": 119,
                    "author": "DeerBunniesExist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Chiming in that the expression \"The blood of the covenant is thicker than the water of the womb\" originally means the opposite of what most people now think.\n\n\nThat in itself is actually incorrect. The original and correct phrase is \"Blood is thicker than water\". A good breakdown of it all can be found here: https://english.stackexchange.com/a/508940.",
                            "score": 32,
                            "author": "Formergr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of this linked discussion seems very much of the \"we're not sure\" variety overall in terms of where the phrase comes from and what meanings have been ascribed to the phrase.\n\nIt seems like many meanings have been common at various points for \"Blood is thicker than water\" or \"The blood of the covenant is thicker than the water of the womb\" or \"Blood is thicker than milk\" or \"Blood is redder than water\", etc.\n\nI don't know Aramaic or Arabic, haven't studied the Talmud, and don't know enough to read the 1180 book by Heinrich der Glîchezære. It seems the blood proverb has been repeated a lot in many places and publications since then, too, so it ends up getting into folkloric hearsay that we now continue with internet discussions.\n\nIn any case, the important thing:\n\nOP is making valid life choices. There are and will be people who support those decisions. It really is okay to find those people outside of your own genetic pool.",
                                    "score": 37,
                                    "author": "DeerBunniesExist"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right! I think OP that just because she was emotional about it she wasn’t badass, or something. If you weren’t feeling emotional you wouldn’t be human, OP. What you did is hard. The fact that you did it despite the emotions is exactly what makes this so badass!",
                    "score": 5,
                    "author": "YouKnowYourCrazy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What I really suggest is that you keep these two posts somewhere safe, so that you never forget what your sister did to you and how she tried to manipulate you when you confronted her. And how she immediately went to your parents and tried to turn what she did around on your boyfriend. \n\nI had to cut off my sister about 2 years ago, and sometimes I think that if she tried to reconnect, I would want to do that. I miss her terribly, we had some really great times and were close for most of our adult lives, but she really hurt and betrayed me. Luckily, I have all the texts she sent me and even a letter she sent me while she was being awful, so any time I think I miss her, I remember who she really is and why I could never have a relationship with her again. \n\nAlso, remember that your mother immediately took her side, didn't even ask for your version of the events, and immediately attacked your boyfriend. These people don't actually care about you, they simply want to use you. It's extremely sad and hard to come to terms with, but it's the truth. Please don't allow them to worm their way back into your life. Don't even consider apologising to any of them (an extremely hard thing to stop yourself from doing when you've been trained to your whole life). None of this was your fault or your doing. Your sister thought she could walk all over you and you would never do a thing about it because that's what she's been doing your whole life. You've stood up for yourself now, so please don't let them manipulate you into thinking it was your fault or that you should apologise. One last thing, also do not let them rug sweep this. Don't let them pretend this didn't happen. They should both be apologising to you, so if they contact you again, that should be the first thing out of their mouths or you hang up/shut the door/walk away.",
            "score": 6887,
            "author": "Merihn",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP please do this! Print off both posts here and any nasty texts they send you.  Don't keep them out and look at them all the time, but hide them somewhere safe and later when they try and contact you and offer to \"forgive\" you for how you behaved (and they will) take it out and look at it.\n\nYou were a TOTAL BADASS!! If I had gold, I'd give it to you.  There's nothing harder than cutting off family, especially your mom.  I know this.  And once you get past the trauma of it, you'll feel so much better.  Just block them all, and don't look back.  They're already trying to manipulate and gaslight you. \n\nYou will end up mourning them, and that's OK.  You're mourning what your relationship *should* have been.  Not the actual assholes you had to deal with your whole life.  Treat them as if they are dead, because they are to you.  It's not fair, and what they are doing isn't right. Go ahead and cry about it, then move on.  Don't fall into the trap of feeling sorry for yourself about it.  You're better than that.  The hardest thing is standing up to your family, and you did that.  You've found your voice!!",
                    "score": 1367,
                    "author": "Purple-Tumbleweed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; You were a TOTAL BADASS\n\nThat's what I thought when I read this! Wtf is she talking about, not a badass moment? She was able to stand up to everyone that was using her and take some control back. Of course, they weren't being easy, otherwise, it wouldn't have been a badass moment!\n\nShaking, crying, feeling drained afterward, these are all completely normally ways to react after having such a stressful encounter. I've never *not* felt that way after having to stand up for myself and maybe tell a few people off. It means that you're a naturally-friendly person who maybe needs a kick of adreneline when push comes to shove.\n\nI agree with the comment OP- print these posts out, and never forget how your family treated you and the person you love.",
                            "score": 142,
                            "author": "_ShakashuriBlowdown"
                        },
                        {
                            "level": 2,
                            "comment": "Exactly! Keep a log to remind yourself of what happened. People like this are very good at manipulation and inserting doubt. They may have you questioning your resolve. But don't let them get to you, you did what was right for yourself and your boyfriend. \nYou don't need to apologize for venting. I apologize if I'm reading into your comments too much but it kinda sounds like a little of what your going through is grief. You had hope and ideas, however large or small, that your family would do right by you. Its looking like that may not be the case and that's a painful realization. It's okay to be sad or down about things ending. However, you know this now and it's a good start for you. I would suggest talking with a mental health provider if you can. Based on experience it helps to have a third party to talk to, someone non judgmental, that can help you or just be there to listen.",
                            "score": 119,
                            "author": "wwwtf20"
                        },
                        {
                            "level": 2,
                            "comment": "r/kindbrokeredditors",
                            "score": 7,
                            "author": "DennisX11"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You’re spot on with suggesting OP keep these posts as a reminder. When I cut my brother off I would sometimes feel like what he had done in the past wasn’t really that bad and maybe he wasn’t a horrible person. Now that he’s back home for quarantine it’s the same thing. I’ll go a few days and think “maybe he isn’t shit” and sit down for a family dinner and realize “no, yeah. He is a shit.” \n\nKeeping a reminder of the bad things in the past is hard and painful, we don’t like remembering things that hurt us. But sometimes it’s necessary to be in a bit of pain to save ourselves from even more pain.",
                    "score": 192,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. If I hadn't kept the actual words my sister had sent to me, over time I would have wondered if it had really been that bad, or that I overreacted. Then I read what she sent to me and there's no way to hide from how bad it was. \n\nIt's better to have a reminder of how bad it was rather than returning to a relationship that hurts you and letting those people keep hurting you.",
                            "score": 74,
                            "author": "Merihn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OP should maybe also keep the posts documented in case her sister is really crazy and tries to do anything with the police (since she seems to be making false claims to the mom about the bf). Not that they'll clear him,  since it'sjust OPs word still, but it's *something* that helps back up the truth.",
                    "score": 92,
                    "author": "koyawon",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I agree with this post completely. OP, please consider these advice. As time goes on, we tend to forget the bad things and reminisce the good things. This makes us this of the abuser in golden light. While we are thinking of them in golden light, the person does not change its stripes and likely remains the same. Keeping these posts and reading them periodically should help with that.\n\nReading both your posts, there’s one thing that I noticed. Your sister is demonstrating behavior that could fit the description of a “golden child” and (I don’t know about your dad but) your mom is Showing some of the characteristics of a narcissist. Please look up the golden child syndrome. Also visit the subreddit https://www.reddit.com/r/raisedbynarcissists to see if any of that feels familiar to you.\n\nEdit: thank you for the replies. I went back and reread what I wrote. In the writing I was trying to be more definitive in diagnosing the problem where I’m not really qualified to diagnose it at all. Reading the op pouring her heart out about how she was treated by her family made me feel for her. I’ve modified the statement above so as to guide op in the direction instead of being forceful about it. Once again, thank you for pointing it out.",
                    "score": 34,
                    "author": "AveenaLandon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! I came to the comments looking for this. Definitely narcissistic and golden child.\n\nCutting my mother off was the best thing I’ve ever done for myself.",
                            "score": 16,
                            "author": "mizzamandamarie"
                        },
                        {
                            "level": 2,
                            "comment": "^ Yes on this subreddit. ^ \nI know you’re not supposed to “diagnose from afar” but I’ve been through a similar situation with narcissists (including legal stuff, long story). I had to do a total cutoff but my life has been the better since. You’re going to have to do a lot of retraining your brain, and the best way to start is to cut off. You’ll give yourself a huge shortcut if you cut off. Not easy. I also have archived emails, texts, etc. I had to refer to them while these people pleaded with tears to get back in my life. I’d look at the past evil emails etc and remember that no, I need to cut them off, ignore them.",
                            "score": 10,
                            "author": "ConstantlyLearning57"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;They should both be apologising to you, so if they contact you again, that should be the first thing out of their mouths or you hang up/shut the door/walk away.\n\nYou should recite this ten times every morning as a daily mantra.\n\nLetting go of abusive people is hard when you still love them, but it's the most loving thing you can do.",
                    "score": 29,
                    "author": "Lovecraftian_Daddy"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Sometimes your worst enemy is your own family. They truly will never realize their own faults even when you say it to their face. Keep your head up and the morals YOU want to live by. Don't let your family sway you in any way. Be happy in your own skin with the bf you love (and who clearly loves you). \n\nRealize that families that get divorces often do the worst things to eachother, their pets, and their children. This is no different than a divorce. You \"left\" your sister and she will lie to the rest of the family just to validate herself. What does she have to lose now? Nothing, so shell try to tear you down. Don't be afraid to ask your bf for help. He doesn't like confrontation but he will support you at tough times.\n\nGood luck. Times heals things best.",
                    "score": 8,
                    "author": "Capacho790"
                },
                {
                    "level": 1,
                    "comment": "💯 agree with the above OP do this ^",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your mother and sister are narcissists. \n\nIt’s not your fault. You did the right thing. Enforcing your boundaries is a big step. A therapist can help you work through this if you feel stuck at some point but you absolutely did the right thing.",
            "score": 1834,
            "author": "OmnibusToken",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 439,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Man that’s a real shit situation. Your mother shouldn’t have such favouritism and frankly the fact that your sister was so hyper-aware of much she prioritised her says a lot. Honestly I’d never forgive my mom if she did something like that, but you do what is best for you. I hope everything goes well for you.",
                            "score": 132,
                            "author": "CatchTheAzyr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just know that you’re perfectly within your rights to be upset and there’s nothing wrong with it.",
                                            "score": 50,
                                            "author": "CatchTheAzyr"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Feeling like the less-loved child has one really good side to it: it means that OP is not a narcissist like mom and sister, and won't pass that on to her own kids.\n\nAlso given a choice I'd much MUCH rather be around people like OP and her bf than her mom and sister. They are clearly better people.",
                            "score": 45,
                            "author": "anomalous_cowherd"
                        },
                        {
                            "level": 2,
                            "comment": "I wish there was an adoption agency for adults. \n\nNarcissistic or abusive parents?  \nOrphaned adult and feeling lost?  \nNeed a family for holidays, birthdays, and celebrations?  \n\nMeet these people who have shitty/deceased/no children and want to legally adopt you. \n\nI’m sure there’s thousands of ways it could go wrong, but imagine if it went right.",
                            "score": 14,
                            "author": "whimsyNena",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would be up for this, I’m so tired of being alone on holidays. I remind myself that holidays are just another day and move on. It would be nice to have nice, happy holiday families though.",
                                    "score": 4,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The worst thing about narcissists is they stick together. No wonder OP's Mom and Sister are 2 peas in a pod.",
                    "score": 149,
                    "author": "sum_wanker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like OP’s sister is the “golden child” and op is the scapegoat child.",
                            "score": 96,
                            "author": "PushoverMGEE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that comment about her thinking her mom did not even want to have her and the fact the OP’s family wanted the difficult sister to stay with her... sounds like mom wanted a second child so the first one had a punching bag other than the parents.",
                                    "score": 8,
                                    "author": "whimsyNena"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Your mother and sister are narcissists.\n\nIt seems obvious to me.\n\n/u/ThrowRAsoangry can have a look at /r/raisedbynarcissists and /r/EstrangedAdultChild \n\n&gt; I'm currently thinking of cutting off all of my family. All they do is make me feel like shit. I deserve better than that. My boyfriend deserves better than that\n\n[About one mother in ten have no contact with one of their child](https://www.bbc.com/future/article/20190328-family-estrangement-causes), so /u/ThrowRAsoangry would not be alone. About a third of families have members estranged one from another. This is so common, and nobody talks about as it is a bit of a taboo.\n\nIf /u/ThrowRAsoangry do decide to do go no contact, please be assured there is not shame in taking a break, permanent or not, with her family of origin. It will probably do her and her boyfriend (her actually family) a lot of good.",
                    "score": 23,
                    "author": "Chansakuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So proud of you dude. I think that’s a badass ending. You handled it in a very mature way. Also just because we are blood related to someone doesn’t make them family. They are toxic and they are not your family.",
            "score": 513,
            "author": "daniellenicole18"
        },
        {
            "level": 0,
            "comment": "YOu don't have to apologize for anything here. I suspect your people-pleasing button was installed by your mother, which is why she's making you feel like crap even though you were clearly in the right. With some people like your mom you have to stop asking \"why\" and behave according to their own behavior, which is cut off people who continually make you feel like crap while you beg for their love/acceptance? Good luck.",
            "score": 380,
            "author": "AuntyVenom",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Way to freaking go! Cutting ties and going no contact with people who bring you down can really help your mental health! Go check out /r/RaisedByNarcissists if you want better insight into what you and others are going through and have gone through! It may give you solace to know you are not alone! Glad you have someone there for you! Enjoy the rest of quarantine in peace!",
            "score": 340,
            "author": "bigtitsampson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much. I'll check it out. I could use some support right now.",
                    "score": 152,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m curious to know if you plan on cutting your sister off entirely and if you will also but cutting off your mother. \n\nDo you need anything from your parents? It doesn’t sound like your mother holds anything over you regardless, just her blindness over your sister. \n\nYou don’t mention your dad, is he the same, does he see it, and go along with it?\n\nI wonder if the act or threat to distance or cut off would be enough for “if you want to hear what actually happened, please let me know.  Otherwise, we have nothing left to discuss.”",
                            "score": 10,
                            "author": "EclecticVictuals",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I wonder if the act or threat to distance or cut off would be enough for “if you want to hear what actually happened, please let me know. Otherwise, we have nothing left to discuss.”\n\nTrying to convince a narcissist that they're wrong is a losing battle, no matter what you put on the table.",
                                    "score": 13,
                                    "author": "one-joule",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It takes great wisdom at 20, to recognize the toxic energy that was in your space and take the steps needed to get it out. You paid attention to your boyfriend's menral health, you communicated with each other, you recognized sexual harrassment and called it out. I have a son a year younger than you so, as a Mom...I am so fucking proud of you. You are mature beyond your years.\n\nNow, it's going to take time to heal. Narcissists can really do serious damage and it's gonna take a little while for your home to settle back into a new normal with her gone. Be gentle with yourselves right now. Let your mom and sister navigate their storm and I personally wouldn't engage for awhile. You and your bf just keep supporting each other and know we all support you too.\n\nI'm proud of you kiddo. 💞",
                            "score": 7,
                            "author": "brainonvacation78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Check this out, OP. It's not just favoritism, your mom (and probably your sis) is a narcissist. Sis is the golden child. There's no changing them. Ever. \n\nYou did good!",
                    "score": 18,
                    "author": "asphodele"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You *are* a total badass, girl! Good for you! \n\nI'm sorry your mother is acting as if your sister is the victim. I hope in time this resolves with EVERYONE knowing how your sister took advantage of you. \n\nYou're so strong!",
            "score": 217,
            "author": "IChooseYouSnorlax"
        },
        {
            "level": 0,
            "comment": "Um, no, this is *completely* badass. Badass doesn’t mean beating up your sister or burning her stuff. You enforced your boundaries and did what you had to do for both your and your boyfriend’s mental health. Even if your mom doesn’t believe you, you know you did the right thing.",
            "score": 115,
            "author": "terrible-aardvark"
        },
        {
            "level": 0,
            "comment": "Courage is being afraid, but doing it anyway. This was absolutely bad-ass.  \n\n\nThe most bad-ass people I've ever seen all did what they had to with tears in their eyes or streaming down their face.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIn regards to your mom... you can only control your own actions, she may never listen. That has no bearing on your worth as a person.",
            "score": 101,
            "author": "Festernd"
        },
        {
            "level": 0,
            "comment": "OP: \"Don't expect a badass ending.\"\n\nAlso OP: Stands up to her family, stands up for herself and her boyfriend, holds her ground against her mom and sister, refuses to let her sister's manipulation get to her, allows herself to feel whatever emotions she's feeling without letting it cloud her judgement, is absolutely a badass throughout the entire encounter.\n\nSeriously, you did great. I have no words of advice here, but I hope that once things die down, you're able to think about what kind of future relationship you want with your mom and sister with some clarity. But for now, enjoy this win. Standing up for yourself is never easy, but you did it.",
            "score": 217,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know right, she is totally badass.",
                    "score": 30,
                    "author": "ndcdshed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uhh, that WAS badass. I'm sorry your family sucks. But your bf doesnt, and that bitch is OUT of your home. Well done girl.",
            "score": 113,
            "author": "Dickduck21"
        },
        {
            "level": 0,
            "comment": "Your sister is abusive and your mum is an enabler. I'm sorry, they'll never be on your side.\n\nYou absolutely did the right thing, and you were totally badass! You stood up for yourself and your boyfriend and put your foot down, you didn't cave because of the fear of your sister throwing any tantrums and emotionally manipulating you and your boyfriend with every dirty trick in the book (her gaslighting, crying, guilt tripping and lying are absolutely disgusting, not to mention how she turned to your boyfriend to get his sympathy) and your mum getting mad. That's a very healthy and brave thing of you to do, be proud of yourself.\n\nTake your time to work through this emotionally and mentally. Talk to your boyfriend, he's thankfully completely on your side. Maybe even consider therapy, it'll help you with the future stuff in your family which is bound to happen.\n\nOverall, you've done the right thing, even if your family won't understand. Even if they will paint you black and your sis will smear you with lies. Take confidence in that, and never forget that.",
            "score": 44,
            "author": "FlinnyWinny"
        },
        {
            "level": 0,
            "comment": "If there was an emoji for a standing ovation, I would put it here!\n\nYou and your bf handled this outstandingly!",
            "score": 80,
            "author": "thefixer123456",
            "replies": [
                {
                    "level": 1,
                    "comment": "👫🧍‍♂️👭🧍‍♂️🧍🏼🧍🏽‍♀️🧍🏼🧍‍♂️👩🏾‍🤝‍👩🏿👩🏻‍🤝‍👨🏾🧍‍♂️🧍🏼🧍🏽‍♀️👭👩🏽‍🤝‍👨🏼👬👬\nMy attempt at a standing ovation emoji",
                    "score": 55,
                    "author": "CandenzaMoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For some reason.... This chain of emojis made me want to join a pyramid scheme.",
                            "score": 33,
                            "author": "THE_PHYS"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great job. Freedom at last.",
            "score": 90,
            "author": "eswag69"
        },
        {
            "level": 0,
            "comment": "Ladies and gentlemen...\nWe got’em",
            "score": 73,
            "author": "Joesada9"
        },
        {
            "level": 0,
            "comment": "Maybe write your mother a letter. Describe everything your sister did to warrant her to be kicked out. Tell her how you feel less loved and accepted then your sister and why. Write down all the things you been feeling during the years and if you can give examples. \n\nAnd then be done with it! You did all you could, your mom will know why you might not want her in your life as much and if she chooses not to try to mend things you know where you stand.",
            "score": 23,
            "author": "efridas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or, send them both these posts and let them read it and the comments so they know that not only does it not fly with OP, but most people also think they're being nasty people too.",
                    "score": 20,
                    "author": "queenxboudicca",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That might not go as well as you expect because it will give them more than one opportunity to blame shift and change the topic. \n\n“I can’t believe you told people about a private matter!”\n“Think of your sister’s reputation!”\n\nBlah, blah, blah. \n\nAll the while ignoring the fact that the sister has sexually assaulted someone - a crime - and been a garbage house guest.",
                            "score": 13,
                            "author": "whimsyNena"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with this. It's hard for you to say what you need to say and for people to truly listen in the heat of the moment.  Writing allows you to take your time and word your thoughts exactly how you want without being on the defense. Be honest and emotional and tell your Mom how much your sister's and your Mom's behavior has affected you and how awful they have both treated you. Lay it all out, really speak your mind . It will be cathartic! Send it and be done with it. It will be a weight lifted off you because you'll finally get to say everything you've held inside or they couldn't/wouldn't hear!!! \nI know this has been hard for you but them making you feel less loved and respected hurts more.",
                    "score": 3,
                    "author": "pescabrarian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I should probably tell you that this might not be the perfect badass ending you all were expecting\n\nUM you're wrong, that was totally badass. You held your ground, you and your bf stuck together, you called her a bitch, and you made her leave. Badass on all accounts.\n\n&gt;I just don't understand what I did to make my mom so angry at me. Why doesn't she love me? I have done everything she asked me to do, but she never takes my side in things. I just want her to fucking love me and support me for once.\n\nStop it. Your mom chose to take your sister's side instead of yours and that is not at all your fault and I'm sorry. Stop blaming yourself for your sisters problems. \n\nI'm proud of you. Your original post left feeling uneasy and worried for you and I'm so glad you were able to do this. Allow yourself to be angry at them or happy she's gone. You've earned it. And what you lack in a mother, you gain in a boyfriend. (If that makes sense)",
            "score": 22,
            "author": "Lilcheebs93"
        },
        {
            "level": 0,
            "comment": "You feel like this, in the end, because you love them, and your heart finally realized that all your hopes to have respect from them was an illusion, because it hurts to withdraw yourselve from the ones you love.\n\nIt will take time to adjust, and move on. You got the courage to stand up for yourself, take pride in this accomplishment. You can finally allocate all this energy pool that was sucked out by these vampires to achieve things:\n\nYour wellbeing and happiness.\n\nWe're proud of you,\nRedditors.",
            "score": 84,
            "author": "PathsofConsciousness"
        },
        {
            "level": 0,
            "comment": "Dude, this is the best update!!\n\nI’m so happy for you and your boyfriend, OP! You two did great standing up for yourselves!\n\nYour sister seems like a very entitled person and was a sexual predator towards your boyfriend. She is manipulative so of course she lied to your mom. I think you should cut your family off; take some space because they are toxic. They make you feel bad, they do not support you.\n\nIt’s great that you and your boyfriend have your own space back, where you feel comfortable and loved. Kudos!",
            "score": 40,
            "author": "OneTwoWee000"
        },
        {
            "level": 0,
            "comment": "The hell do you mean “don’t expect a badass ending”???\n\nThis was was definitely badass. You didn’t take any of her shit, and neither did your BF. Some of the jellyfishes that post on here could learn a thing from you.\n\nYou did great. Absolutely great.",
            "score": 55,
            "author": "IamJacobSeed"
        },
        {
            "level": 0,
            "comment": "In my experience families can become weird little messed up echo chambers where one family member starts acting like a dickhead and the others cover for them because they’re faaaaamily so the original dickhead starts to ramp up the behaviour and everyone else continues to cover for them until all kinds of crazy shit is normalised. Then when someone sensible tries to bring some normality to the situation they lash out because they usually don’t want to have to face how insane they’ve all been behaving. Your mum lashed out at you because facing your sisters behaviour now means facing allll of your sisters behaviour and I doubt she can do that. By any sane persons normal meter she shouldn’t have done that and should absolutely side with you over the sexual harasser but I’m willing to bet that she’s been excusing her shit for so long that this doesn’t even seem that bad to her and SHE makes excuses for you sister so why can’t you because she’s faaamily.\n\nWell done for not caving to that shit and standing up for your boyfriend, kicking your sister out was the most loving thing you could have done for him. I’m honestly really sorry your mum screamed at you, my grandmother behaves in the exact same way and it’s awful to have a family member that’s angry at you when you’ve done nothing wrong and I don’t know your sister or your mum, maybe there’s a chance you could reason with them, maybe there’s not but my advice as someone who’s survived a few big family blow outs is that they’re not always worth it. Sometimes it’s more cathartic to just say que sera sera and move on with your life while they all stew in their insanity pit. I’m sorry for the essay but good luck I wish you the best.",
            "score": 17,
            "author": "spooky_luigi",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what happened with my younger brother. He dates children, spends all his money on partying, can't keep a job, is violent to his siblings and parents, drives under the influence, and just makes really bad decisions. He once even pulled a tazer on my boyfriend \"as a joke\" and got mad at us for being upset that he would do that.\n\n When I was still living at home, he came into my room on two different occasions and asked me to do his chore for him. I told him no, as on both occassions I had my friend over, and he immediately became aggressive, squaring his shoulders and walking towards me, yelling profanities, telling me how much my parents hated me and making up fake conversation he'd had with them where they expressed these things, to the point I was shaking and crying in fear. My friend no longer came over if his car was there because she is scared of him now. \n\nI told my mom the second time it happened, and she told him to stop. As I was dropping off my friend at the end of the night, I got a text from him telling me he wasn't being aggressive, but if I kept \"lying\" to mom and dad about what he was doing, he would show me aggressive. My parents told me they couldn't do anything because they didn't see it happen and didn't want to look like they were taking sides, despite a threat to my physical safety. So I went to stay with my boyfriend and his parents that night, and stayed over anytime I could. \n\nAny time my brother and I fought after that, my parents told me I needed to work it out with him instead of protecting me when he became violent. They told me I must be enguaging him, or egging him on, and that if he started anything, I needed to just ignore him. If he comes into my room and throws the books off my shelf because he wants me to do dishes for him so he can go get drunk, *I* have to ignore him, and just go to another room. They wonder why I don't come around anymore, and tell me I need to get over my differences with him because it takes two to have a fight, and as family we have to learn to get along. \n\n If a man physically a foot and a half taller than me comes into my space and starts throwing things, threatening the safety of my friends, trying to manipulate me by telling me about fake conversations he has with my parents, and threatening to attack me, of course I'm not going to want to stay in the house. Of course I'm not going to want my friend to come over. Of course I'm going to stay somewhere else, and of course I'm not going to talk to him. Yet I hold an equal part in our \"fight\"? No, fuck that. Control your man child.",
                    "score": 12,
                    "author": "Chaotic_Useless"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You probably don't feel badass because setting boundaries and cutting off toxic family is really a painful process. You expect to feel triumphant or relieved at the very least, but mostly you just feel depressed and kinda guilty. That's perfectly normal and please don't think that because you feel shitty that you did the wrong thing. It hurts you because you still love them and that's ok. Just never forget that they are actively harmful and toxic to keep in your life. You did the right thing, and you are a badass.",
            "score": 17,
            "author": "theskyhurts"
        },
        {
            "level": 0,
            "comment": "You know what, you were a lot more \"epic\" than you thought. You kicked her out and stood up for yourself. From your description I thought she was going to still be in your apartment!!\n\nSeriously, you did great, keep it up! :) This is an update that makes me happy to read (for the most part. ) I am so sorry for the problems with your mom. You may want to try r/raisedbynarcissists or r/raisedbyborderlines or r/insaneparents. I don't know those subs well, but it strikes me that you need extra support that way.",
            "score": 35,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "CHANGE YOUR LOCKS, GIRL.",
            "score": 13,
            "author": "magictubesocksofjoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This needs to be super duper upvoted. Also if you think she is capable of it, maybe check for cameras or anything. Expect her to want to get revenge. Freeze your credit.  Put passwords on all your shit - bills, accounts, everything. Change your passwords for everything.  Make sure your devices don’t have anything that shouldn’t be on them.  Make sure she didn’t take anything you need or value when she left.  \n\nI would also block them on everything so you can’t see what they’re saying about you - gear up for a smear campaign, but stick to your guns and don’t let the flying monkeys guilt you into anything. Cut them off if they won’t stop harassing you on your sister/mother’s behalf. Good luck.",
                    "score": 8,
                    "author": "throwa347"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"She then made a small comment about me being insecure about my bf liking her or something like that...\"\n\nYour sister knew exactly what she was doing, probably thought she was tempting your boyfriend, which was causing troubles between you two, and purposely said that to rub salt on the \"wound\", your sister was wrong ofc, but this probes she's a liar and a manipulative person, who clearly doesn't care about you, she only cared about staying in your flat and having a man around to flirt/make out (even tho it would've only happened in her dreams).\n\nYou did a really brave thing cutting her off, that's something really hard to do, and you might feel bad about it for a while, but just remember how awful she's been your whole life.",
            "score": 14,
            "author": "chickenmeh"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 53,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for sharing this. As a scapegoat for my entire life I was aware of some of these things at a first glance. But this read is really eye opening for the parts you don't even fully recognize.",
                    "score": 8,
                    "author": "100percentflesh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That WAS the badass ending we were hoping for! Good on you for sticking to your guns and getting her out of there, back to some peace and normality for you and your boyfriend.\n\nAlways remember: our true family are the people that we meet along the way, and choose to keep around. \n\nSorry that your mum and sister are such narcissists.",
            "score": 12,
            "author": "sh4dfox"
        },
        {
            "level": 0,
            "comment": "“I’m pretty sure she went back to her own flat”\n\nWhat? She had her own place this whole time?\n\nEdit: sorry, also meant to say great job!!",
            "score": 11,
            "author": "starrynight75"
        },
        {
            "level": 0,
            "comment": "So predictable that she would start saying I love you when called out on her bullshit.   \n\n\nOP, this may be hard to hear, but it’s something that I think you need to start realizing...your sister does not love you. She resents you, she’s jealous of you, she probably wishes you were never born. That’s all on her though, those are her issues not yours.   \n\n\nShe‘s selfish, mean, and manipulative and frankly she is not capable of actual love for anybody. Pity her for that, but keep her at a distance, she is toxic poison and would love nothing more than to ruin your relationship or even your life.   \n\n\nSource:  my sister is the same way",
            "score": 11,
            "author": "dragonfliesloveme"
        },
        {
            "level": 0,
            "comment": "You’re amazing!!!! I’m 20f with a mom with borderline personality disorder. There’s so much pain with parents like that and it always takes something drastic to realize you need space. I haven’t talked to my mom since I was 17.  It’s hard at first but it’s get better.  You realize it’s not your fault they act like that and see how much better you are with out the pain and drama in your life. You are 100% a badass and I think what you did is awesome. Don’t sell your self short, you’re incredible!!!!!",
            "score": 25,
            "author": "hedwig24601",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, the pathological lying (e.g., lying to cover another lie, lying even when you know the other party knows you're lying, etc) along with splitting, trouble keeping friends, and job problems immediately made me think BPD. It's very hard to deal with, even with proper intervention. It's ridiculously hard to develop and maintain a relationship with them even as family. OP is totally a badass in dealing with this so well and firmly.",
                    "score": 15,
                    "author": "PreMedinDread"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats on some peace and quiet in your own home. Be prepared that your sister might start lying to your family and accuse your boyfriend of things. It's better to get ahead of the story with friends and family before they do.",
            "score": 33,
            "author": "oskibeer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt; It wasn't really \"epic\" like some of you wanted\n\nBuuuuuullshit. This is about as epic as it gets without you punching her out, and we didn't want that!",
            "score": 18,
            "author": "FBI_Wiretap_Van"
        },
        {
            "level": 0,
            "comment": "Sounds like you won two major battles yesterday.  Be proud of what you accomplished, because you should be.  \n\nI will say you need to explain to your mother what your sister did.  If she doesn't take your side, then cut her off entirely.  Just my 2 cents though.",
            "score": 10,
            "author": "Aleric1977"
        },
        {
            "level": 0,
            "comment": "There's nothing you did to make your mom hate you. Some people are just awful parents.\n\nI really really suggest joining r/raisedbynarcissists and r/justnomil\n\nBoth of them are support subs for people who have parents and siblings like your mom and sister.\n\nI also suggest getting some therapy. Your mom and sister have twisted you and gaslit you so badly that you believe standing up for yourself and setting boundaries is wrong and bad.\n\nI'm afraid that if you don't seek some form of help that you mom will eventually get you back under her thumb and you'll be hurt again.",
            "score": 9,
            "author": "Ariyanwrynn1989"
        },
        {
            "level": 0,
            "comment": "Family can easily be the worst people you can have in your entire life. They can take advantages of you and never feel bad for it. Cut them off. Is just a sinkhole, get out asap",
            "score": 11,
            "author": "BlueRareChicken"
        },
        {
            "level": 0,
            "comment": "Take some space for yourself &amp; give yourself a break. I hope you can breath again :)",
            "score": 17,
            "author": "_Spicy_Lemon_"
        },
        {
            "level": 0,
            "comment": "&gt;It wasn't really \"epic\" like some of you wanted.\n\nIt was epic. You stood up for your boyfriend and stood up to your sister and completely refused to listen to or accept her absolute bullshit.\n\nThat's epic and badass in my book.",
            "score": 9,
            "author": "HoboJack"
        },
        {
            "level": 0,
            "comment": "Your boyfriend is your family now. You have a great family who loves you. Forget all the others. That isn’t live and it isn’t family.",
            "score": 14,
            "author": "yonk182"
        },
        {
            "level": 0,
            "comment": "I am only an internet stranger, but I AM SO PROUD OF YOU. You overcame your aversion to conflict, and you stood your ground. You championed your boyfriend and stood up to your predatory sister. \n\nAs far as your mother goes: you can't change her pattern of favoring your sister over you. I am one of two sisters, the younger one, and just like with you, my older sister was the golden child who could do no wrong while I was the one my parents were always mad at.",
            "score": 8,
            "author": "thumb_of_justice"
        },
        {
            "level": 0,
            "comment": "First off, your parents' perception of the situation does not have any relevance in what happened and what will happen. If they want to be helpful or want to interject themselves in any way to your life, it is entirely up to you to what capacity they can. They do love you, but they also are using you to ease their own stress. If they knew what's right, they wouldn't have raised your sister that way - and they wouldn't continue to control your life.\n\nSecond, don't expect your family to change. You can only change yourself and your own situation. It is great that your boyfriend is receptive and understanding of what is going on. The fact that you trust each other and mutually experienced the whole thing just solidifies the reality of it. Don't allow anyone to gaslight you and don't second guess yourself.",
            "score": 6,
            "author": "pocketjaffar"
        },
        {
            "level": 0,
            "comment": "&gt; I told her she had no friends because she was a bitch.\n\nMore girls out there should hear the harsh truth. You did the right thing.",
            "score": 42,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tough thing is that the people who most need to hear messages like that are also going to be the least willing to listen and consider the truth of it.",
                    "score": 9,
                    "author": "TheBlankVerseKit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They always think your talking to/about someone else!!! I hate this.",
                            "score": 3,
                            "author": "pescabrarian"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Girl there’s nothing wrong with cutting off your family I had to cut my dad out of my life because all the drama was bad for my physical and mental health....",
            "score": 7,
            "author": "lilbilly96",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. Being related does not give anyone the right to treat you like shit.",
                    "score": 3,
                    "author": "Lespecial"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your mom is a bitch for not even asking for the other side of he story. Maybe that’s where your sister got that c unt gene from.",
            "score": 7,
            "author": "KonstantineKidsClub"
        },
        {
            "level": 0,
            "comment": "I’m so proud of you! You ARE a badass! That was way more cool than what I would have done, seriously!!\n\nAnd as for your shitty family, I’m so sorry. I strongly recommend blocking their numbers. You can decide for a time to cut them off, it doesn’t have to a permanent thing if you’re not totally ready. Although, I’m sure you’ll find if you have to talk to them somewhere down the line that you’ll quickly be reminded why you wanted (and probably really needed) to cut contact. It took me a while, because I wanted to hope they could change and at least be reasonable. Logical. But nope, they make no fucking sense and want me to condone their shiftiness. I’m so much happier with just me and my husband.\n\nAgain, I’m so proud of you. You who need some time to feel better, but soon you’ll be happier too and able to join your boyfriend in doing things together again.",
            "score": 7,
            "author": "littleloversopolite"
        },
        {
            "level": 0,
            "comment": "I really wish I could give you a giant hug.  It sounds like you’re emotionally exhausted.  Please take some time out to self care - whether that’s an activity, having your favourite food (if you can get it) watching a movie.  Be gentle with yourself.  This is in no way your fault.  Your sister has obviously told her side of events - no one is ever the villain in their own tale.  I would leave it a couple of day’s, and if you want to reach out to your mum cool.  If you decide you want no further contact, that is an entirely valid course of action to take.  Sending you lots of love, you did really good.",
            "score": 11,
            "author": "Esme-Weatherwaxes"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 10,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Actually your update was more badass than I was expecting. You stood up to your sister and got her out of your home where she had been harassing your boyfriend. I'm sorry that your mother is being so horrid to you though.\n\nYou and your boyfriend are a family regardless of anybody else. Being blood related does not mean that you need to maintain a relationship with people like your sister or mother.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Also, if you're looking for an explanation, consider whether your mother and sister have enough narcissistic tendencies to have full-on Narcissistic Personality Disorder, Borderline Personality Disorder, or something else similar.\n\nI've gone low-contact (almost no contact) with my sister. She probably has one of the disorders above, possibly both. She has no respect for boundaries. Anytime I've asked her not to do something, she has ignored it. For the past few years, I've quietly weaned her off of me. I'm gradually feeling less and less guilty.\n\nYou have been repeatedly emotionally manipulated for your whole life. You're realizing that it's not right. Stay strong. Get help. Best of luck for future years and decades.",
            "score": 5,
            "author": "DeerBunniesExist"
        },
        {
            "level": 0,
            "comment": "And OP, she’s not homeless. You’re not putting her out onto the streets. She has her own flat. If she chooses not to social distance, then that’s an active choice she made that she did NOT have to make. You did the right thing.",
            "score": 5,
            "author": "tomis2003"
        },
        {
            "level": 0,
            "comment": "Just set firm boundaries with your mum, hun. Tell her there's two sides to a story and if she's just going to believe your sister, without even asking your side first, you don't want to speak to her. Tell her when that changes and she's able to listen to you, listen to everything you need to say, then and only then will you speak to her again. Start with one family member at a time. Don't try and put your case forward to all of them. And keep your distance, until they can be trusted. Just chat over the phone, don't go to see them in person. You can do this, and be proud, gorgeous heart! What you did, standing up for yourself, is so hard, especially in the face of life long conditioning.",
            "score": 14,
            "author": "riverkaylee"
        },
        {
            "level": 0,
            "comment": "So happy to hear about your update, but... You should be careful with your sister, she will probably will demonize you and your boyfriend and might even acuse both of you of terrible things that might hurt seriously your image, keep evidence of everything that you can in case that all hell seriously brakes loose",
            "score": 11,
            "author": "Marinna0706"
        },
        {
            "level": 0,
            "comment": "First of all thank you for posting an update I always love hearing how these story’s end even if it’s not really my place to care second as a stranger on the internet I’m very proud of you for standing up for yourself and your man you are much more of a women for doing so much more then your sister for sure and I’m glad you can get back to your usual life",
            "score": 5,
            "author": "tjake123"
        },
        {
            "level": 0,
            "comment": "Late commenter here... what you did was the best move for you and your boyfriend, but mostly you. \n\nI can tell you from personal experience that I had a similar problem with my mother and older brother... no matter what happened his side was always taken and mine always ignored. \n\nAfter so many years of trying, fighting and emotionally destroying myself trying to get her approval, to be listened to for once and not just be blamed... I gave up (thanks to my wife, she helped a lot) I have never felt better, I have never felt so little stress about family, it was hard but much needed. \n\nI went full no contact with my mother, I was full no contact with all of my family for about 3-4 years prior to this (similar thing). \n\nIt’s hard but you will be much better in the long run.",
            "score": 5,
            "author": "The1EyedPig"
        },
        {
            "level": 0,
            "comment": "Don't let them dull your shine .\nYou did the right thing.\nWell done for being brave 💪\nI wish you nothing but happiness now.\nGod bless you 🙏",
            "score": 4,
            "author": "misha2711"
        },
        {
            "level": 0,
            "comment": "So proud of you. I wish I had cared about myself and my life even half as much as you do even at 40 years of age as you do at 20.  Please don’t ever question what you have done.  You are taking control of your own life and doing what is right for you.  Family is meaningless when they treat you like your feelings and livelihood don’t matter.  What matters is surrounding yourself with people that do, and it sounds like you’ve got a great guy that does.  Live your life by your rules, no one else’s.  Any guilt you may feel comes from a place of how you were raised to feel. It has nothing to do with being a good or bad person.  You’re a good person by loving yourself first and treating others with love, as well, but it never means you should ever put up with anyone’s bad treatment of you no matter who they are. Really great job!\n\nEdit: I wasn’t going to say anything but can’t help myself lol. I just have my first reddit gold to you because I’m so impressed with you. You are inspiring to  all the people-pleasers that just can’t say “no” and care way too much.  No pressure but keep up the good fight 😊.",
            "score": 4,
            "author": "Sparrow75"
        },
        {
            "level": 0,
            "comment": "Maybe I missed it but I can't find a single comment talking about how awesome this boyfriend  sounds. He's clearly very loyal.",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Listen.\n\nI strongly suggest you file a report with the police about your sister. I'm not suggesting you press charges. But *file a report*. Your sister might take it to the next level.\n\nIf she lied to your mom about your boyfriend then she might try to take it to police to reinforce that \"shes right\".\n\nJust file it with police so theres an official paper trail of what happened. You want there to be a record, because people are more likely to believe women over men in cases of sexual harassment.\n\nI'm still really proud of you for all you accomplished, but I'm still worried.",
            "score": 3,
            "author": "CuteThingsAndLove"
        },
        {
            "level": 0,
            "comment": "At this point I wouldnt be surprised if your sister started accusing your bf of sexually assaulting HER, or at least telling your family that. Be prepared.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kind of agree here. Not just sexual assault accusations, it could really be anything so definitely be prepared for any further shitstorms.",
                    "score": 3,
                    "author": "xBerryMewx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look  up Narcissism. In the family  dynamic with the parent being the  Narccist  usually one child  will  be the  Golden child  and groomed  to be a future  Narccist (your sister) and one is the  scapegoat(maybe you) who doesn't get recognized  for  achievements and maybe blamed for things  that you didn't do. It's very toxic and will usually never change so the healthiest  option  is Usually  to  go  no Contact if this even applies to you. But it's a place to  start  looking for answers.",
            "score": 4,
            "author": "3pnt14XrSq"
        },
        {
            "level": 0,
            "comment": "If you cut someone who is toxic from your life, you don't lose anything. You gain peace. Family is chosen, not forced. \n\nI'm really happy for you. It's never fun being in a scapegoat/golden child situation. What's important is that you make this decision for yourself and do not go back on it. Enforce those boundaries and block those numbers. You hold all of the power.",
            "score": 3,
            "author": "wowdrama"
        },
        {
            "level": 0,
            "comment": "I'm glad you were able to smget your home back and live a somewhat normal life again.\n\nIn regards to your mum, I would consider writing her a letter explaining what happened with your sister and they way she makes you feel. Finish off by saying something to the effect of \"if you want to have a reasonable conversation then call me. If not, do not contact me again.\"\n\nPretty brutal but you will know where you stand afterwards.",
            "score": 3,
            "author": "kcfromuk"
        },
        {
            "level": 0,
            "comment": "Thanks for the update.  It's a good ending in my book.   You did well. and Kudos to your bf for being straight with answers to your sister and having your back",
            "score": 8,
            "author": "rydendm"
        },
        {
            "level": 0,
            "comment": "That was badass.  Also your mom is a bitch.  Glad you stood up for yourself.",
            "score": 7,
            "author": "JustSomeGuy422"
        },
        {
            "level": 0,
            "comment": "Good on you! You don’t have time to waste on people who don’t care about you. You stood up for yourself and your boyfriend against your toxic family. Also I didn’t realize your sister is the older one. Jeez. I know people like her and it’s all drama all the time. It’s often a result from the way they were parented. Unfortunately, you can’t expect her or your mom to change. But you can change yourself, which you already have and you should be proud of yourself. If you can stand up against your family, then you can stand up against anyone. You’re becoming a strong woman OP.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You did great OP, you are a badass. I know it’s really easy for a bunch of reddit strangers to say “yeah, cut off all family ties, fuck ‘em,” but I really don’t think your mom or sister are ever going to give you the respect you deserve. What about your dad if he’s in the picture?",
            "score": 3,
            "author": "Etna5000"
        },
        {
            "level": 0,
            "comment": "Woo! So proud of you, OP! We support you :)",
            "score": 3,
            "author": "jbeanszz"
        },
        {
            "level": 0,
            "comment": "You are an epic badass! I salute your badass badassitude of badassness",
            "score": 3,
            "author": "RoricNormannum"
        },
        {
            "level": 0,
            "comment": "That *was* epic OP, ur a total badass.",
            "score": 3,
            "author": "tajajaja"
        },
        {
            "level": 0,
            "comment": "YOU DID WELL! \n\n&gt;I just don't understand what I did to make my mom so angry at me. Why doesn't she love me? I have done everything she asked me to do, but she never takes my side in things. I just want her to fucking love me and support me for once. It just never happens and I feel like I'm a fucking idiot for even trying. I think she regrets I was even born. \n\nThis part hits me because I feel the same way very often. And IT'S NOT YOUR FAULT AND NEVER YOUR FAULT. When I read your first post the first time you posted it, I got so pissed I showed the post to my fiance, calling your sister lots of names. I am glad you took action! Good for you and for your partner. Thank you for this update. I laughed a lot when I read the part where you told your sis that she has no friends because she is a bitch LOLOL that's the BEST LINE EVER.",
            "score": 3,
            "author": "MeleeYAH"
        },
        {
            "level": 0,
            "comment": "IM SO FREAKING PROUD OF YOU!!!!! THAT WAS TOTALLY BADASS!\n\nYou've been on my mind since the first post. I was worried you'd let her run all over you, but you stood your ground like a champ. Even stayed strong when your mom tried to be a tyrant, too. That took alot of guts.\n\nThere's no good reason your mom picked a favorite. Most likely she just enjoys the way your sister eats up all the affection. Maybe she's even subconsciously realized that your sister becomes happier when she's shitty to you. I understand your pain (I wanted my mom to be a good mother, too), but fuck, it will just not happen. It's healthier to just accept she will never do right by you than it is to try and try to make it work. Giving up on my family was both the most painful thing I've ever done, and also the best decision of my life.\n\nYou'll come out of this better, I swear. And if you ever want your own family you'll know exactly what NOT to do. Best of luck to ya, and don't give in!!!",
            "score": 3,
            "author": "Puppinacup"
        },
        {
            "level": 0,
            "comment": "You stood up against two family members gaslighting the ever living hell out of you and freed your home of a disgusting monster! I was really hoping we'd hear from you again, you found your inner badass and took the trash out. The most important thing is you and your boyfriend will never forget this moment. Take time to celebrate this weekend!!!",
            "score": 3,
            "author": "Munchkin525"
        },
        {
            "level": 0,
            "comment": "You need to send a link of both of these posts to your mom, and tell her you will not speak to her again until she reads them and all of the comments.",
            "score": 3,
            "author": "capfedhill"
        },
        {
            "level": 0,
            "comment": "You absolutely bossed it! You should be so proud of yourself. Standing up for yourself against family can feel near impossible but at the end of the day you have every right to put yourself first and your sisters behaviour was unacceptable. \n\nIn regards to your mum, I’m sorry. It’s crushing to do the right thing but get penalised for it. My mum is very much the same and no matter how much of a “perfect” daughter I am she will still always find fault and manage to play the victim at the same time. I’ve had to learn to take it with a pinch of salt, you’re all adults and you don’t need anyone’s approval before you make your decisions/live your life. You cant please everyone and shouldn’t have to. Just live your life now and be happy.",
            "score": 3,
            "author": "swag-team"
        },
        {
            "level": 0,
            "comment": "Your sister got what she deserved. Do not let her swindle herself back into your home. “Ooh I didn’t know!” Bullshit. She sounds like the type that will try to one up you on everything and that includes trying to prove she’s “better” by trying to sleep with your boyfriend in your own fucking house while you’re doing her a favour. DO NOT apologise to her.\n\nAnd fuck your mum too. Honestly how dare she try to pin the blame on your boyfriend while your sister is lounging around in her underwear and touching him at every opportunity.\n\nYou don’t need these people. And showing them that you will not tolerate their bullshit and they cannot manipulate you is badass as fuck.\n\nContinue to set boundaries and as soon as any of them try to cross them, stay strong and firm, and put them straight back in their place.",
            "score": 3,
            "author": "ndcdshed"
        },
        {
            "level": 0,
            "comment": "I'm so impressed by the way you an your bf handled this!  You both stood up for yourselves. The fact that your sister is now accusing your bf of bothering her, says it all. She is not a good person.\n\nI'm sorry your mother reacted that way.  Maybe the next step is setting boundaries for her. If she can't respect them, there will be consequences. It will be up to her if she is allowed in your life or not.",
            "score": 3,
            "author": "Lizzyrules"
        },
        {
            "level": 0,
            "comment": "C O N G R A T U L A T I O N S   ❤️❤️❤️",
            "score": 3,
            "author": "Kleos296"
        },
        {
            "level": 0,
            "comment": "Ouch. I’m sorry you had to go through all that. Ultimately, your happiness and well being are most important. Just remember, family are those who treat you like family. I hope everything works out for you, take care.",
            "score": 3,
            "author": "rcookerly"
        },
        {
            "level": 0,
            "comment": "You go! Great job doing something hard, OP.  You are amazing, both you and your BF.  Let yourself lie in bed and feel all the feels. It's complicated for you because as long as you backed down and accommodated, your mom would be at least generally OK with you. When you stuck up for yourself to the \"Golden Child\", you knew both she and your mom would gang up on you.  I'm so sorry, OP, that your mother is not a better person. However,  you set boundaries, you did it! Perhaps, once the dust settles,  this will lead to them respecting you.  Even if it does not, you did it, and should be very proud of yourself",
            "score": 3,
            "author": "explodingwhale17"
        },
        {
            "level": 0,
            "comment": "I'm here to give you validation &amp; praise as well.\n\nMy mom raised me to be a people pleaser. Always be polite and amenable, always smile, never cause a scene, etc etc. Im 40 and I only recently started asserting boundaries with her. It's been very difficult, and she has behaved like a toddler at times.\n\nMy brother tends to be extremely opinionated on Facebook and he goes onto forums especially designed for arguing with people. He likes to troll pages that are the opposite of his viewpoints. One day recently I challenged his viewpoint by saying something objective &amp; my mom gave me the silent treatment, told me she was disappointed in me &amp; trashed me for \"doing that to family\".\n\nYou're lucky that you've broken the pattern 20 years before I did. That's amazing work 👏",
            "score": 3,
            "author": "spark_of_light_"
        }
    ]
}