{
    "id": "i5d1vr",
    "score": 38412,
    "title": "My girlfriend said something to me yesterday that felt like a punch to the gut",
    "author": "ThrowRA394817",
    "date": 1596803927.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/i5d1vr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Me (17m) and my girlfriend (also 17) have been going out 8 and a bit months. We didn't have sex together straight away and first did it only a few weeks ago. I was a virgin before that so I'm not experienced at all and so far I've not been able to make her cum.\n\nBefore dating me, my gf was dating my brother. It was awkward at first but we're all okay now. Anyway so last night I tried my best to make her cum but in the end she told me to \"just stop\" so I did. Then she said \"your brother turned me on so much more than you do\". I was so shocked by her saying that I didn't know what to say back. She got dressed and left the house and we haven't spoken yet.\n\nI just feel so confused about how I feel. I know I'm not as attractive as my brother but I didn't think she would say that. Am I just being a baby and getting upset over nothing? I understand she's probably fed up and she might have just said it in the moment.",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;Before dating me, my gf was dating my brother.\n\nWhat the fuck.\n\n&amp;#x200B;\n\n&gt; your brother turned me on so much more than you do \n\nAlso what the fuck.",
            "score": 14288,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? This whole situation is a dumpster fire.",
                    "score": 4800,
                    "author": "missmatchedsocks88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s true with like 99% of the posts here. In our minds, OP is usually “one of us” and is a normal person. But then you gotta remember that:\n\nA— no normal person would come to this site for relationship advice lol, and\n\nB— whenever you read a story about an awful partner, think “birds of a feather...”\n\nAlthough imma give a 17 year old the benefit of the doubt on this one.",
                            "score": 1958,
                            "author": "Buy_An_iPhone_Today",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In my teenage socially inept days I would turn to r/teenagers for advice all the time. The anonymity of Reddit made me feel way more comfortable asking questions that I would never vocalize to anybody I knew in real life. \n\nLooking back, 99% of the advice was absolute shit that boiled down to “just be yourself” and “act confident” and the interactions with other users over IRC and teamspeak are where I really developed a basic set of social skills. I couldn’t imagine asking for advice on the internet about interpersonal relationships now, but kids need an opportunity to establish a baseline and forums are a great asset in that regard. \n\nTotally agree with cutting OP a little slack, even if the setup for this entire situation is fucking bonkers to begin with.",
                                    "score": 720,
                                    "author": "Elite_Jackalope",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Just be yourself\" works for people that understand nuanced social dynamics - when it is and isn't appropriate to bring up certain topics. Someone who has a lot of weird kinks but doesn't understand those social dynamics might take \"just be yourself\" advice as \"bring up everything about yourself in every situation\" - which is of course horrible advice.\n\n\"Act confident\" also only works for people who understand the nuances of confidence, why it works, when it's appropriate to be confident vs. humble, etc.",
                                            "score": 242,
                                            "author": "OneMostSerene",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can confirm, used to get this advice, found out why it wasn't working very well when I got diagnosed with autism lol",
                                                    "score": 155,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m sorry bro but this made me lol so hard",
                                                            "score": 26,
                                                            "author": "Callmebigpahpa"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\"just be yourself\" really means \"learn to shut up and stop being akward\" for most and \"act confident\" really just mean \"don't sweat like a pig when immitating a telephone pole and try to smile now and then. Also, keep shutting your mouth\".\n\nI don't know for most but usualy when i need to ask friends for advices it means that  i have fucked up at some point by opening my mouth trying to be too much of myself.",
                                                    "score": 75,
                                                    "author": "Kaining",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I wish I had this website to come to as a teenager. The net advice is way better than my idiot friends.",
                                    "score": 39,
                                    "author": "unipolar_mania"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey I have come here for advice because I have nobody to talk to for advice and I’m a pretty well rounded person, and so is my boyfriend. Also I’m not a teenager, I’m an adult.",
                                    "score": 103,
                                    "author": "snapekillshansolo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Me too. The times I have asked, it was because I wanted an outside,  unbiased opinion. I know my friends will agree with my parents are legit Switzerland. They take no sides. Their response is to try to understand the other person and come to an agreement. That's not always feasible.",
                                            "score": 11,
                                            "author": "BooBooKittyKat1044"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mom here, but not your mom. \n\nOP, in case you aren’t getting what people are telling you: she’s dating you because of your brother. You’re either a stand in or revenge. Dump her.\n\nAlso, no matter what anyone says sex takes time and experience to be great. Nobody knows what they are doing in the beginning. In her case, she’s bad at it because she’s selfish. So, even if the fireworks weren’t there they never would be with this girl.",
                    "score": 2952,
                    "author": "Nylonknot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome mum reply!  Thumbs up 👍",
                            "score": 324,
                            "author": "ohicherishyoumylove",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "From a 23 (m) year old old who’s had his share of dumpsterfires, listen to this",
                                    "score": 90,
                                    "author": "domingo_josh",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I guess I’ll chime in with a Dad reply: \n\nQuit playing on reddit and do something about it",
                                    "score": 19,
                                    "author": "hudsonbuddy",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dear OP. This is the only advice you will need and ignore everything else. \nOk this it.......\nRead the golden post from our honorary mom which is above. Follow the advice. Do it nicely. Do it quickly.",
                            "score": 145,
                            "author": "garloot"
                        },
                        {
                            "level": 2,
                            "comment": "As an older brother, here's some older brother advice.\n\nAnyone who loves and/or cares about you would take the time to communicate what they need or want. Those who do not love and/or care about you will leave you in the dark so they can blame you later on.\n\nIf they terminate your chance to improve then it is apparent that they are acting in THEIR interests and not yours.\n\nAlso, like mom said, no one starts off as a sex god. It takes time to learn what you like, let alone what your partner likes. When you find a partner that has the capacity to be emotionally and physically intimate with you then you should discuss their sexual needs and wants as well as your own.\n\nAs for your girlfriend, you should really consider breaking things off with her. I won't claim what her motives are but her behavior is indicative of someone who is using you, not loving you.\n\nI hope this helps and that you come to a much better situation than what you started with!",
                            "score": 38,
                            "author": "DeuceEx2",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Another mom here seconding this excellent perspective. It may hurt to hear, but what you need to understand is that you deserve better.",
                            "score": 59,
                            "author": "LunaKip"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Make matters worse read in another comment. They are twins lmao. Wtf, shit was doomed from the start",
                    "score": 429,
                    "author": "xj_tj_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously. can't believe I had to search the comments this far to find this",
                            "score": 102,
                            "author": "FuturisticChinchilla"
                        },
                        {
                            "level": 2,
                            "comment": "What! Shiiit no wonder she went for him hahaha. What a wreck.",
                            "score": 15,
                            "author": "Intencex"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She's only dating OP to be close to his brother.",
                    "score": 73,
                    "author": "Samazonison"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1) Don't date any of your brother's or friends' exes.\n\n2) It seems pretty obvious she is/was dating you to stay close to your brother \"just in case\".",
            "score": 7038,
            "author": "Just_an_Empath",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1337,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, she'd definitely rub it in his face. He's already shown he'll put up with anything by not immediately kicking her ass to the curb. Now she's going run roughshod over him until he gets a clue.",
                            "score": 194,
                            "author": "LupoSolitarioOoOo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you! I don’t know what OP was thinking! I really wonder what made him think that it would be a good idea to date his twin brother’s ex.",
                    "score": 263,
                    "author": "yoursistershouse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s 17. These kinds of things come from experience. It seems obvious when he’s written it down like this too, but living it, for the first time, can make one really question their worth.",
                            "score": 240,
                            "author": "JennIsFit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can kinda see that.\n\nI just feel like a lot of the comments aren’t getting at the real issue here which is that she’s his brother’s ex.  Most of the top comments talk about him needing someone who is patient with him and isn’t horrible and rude like she is.  Which is all true.  But a big reason (if not the entire reason) this situation is as messy as it is bc she’s his brothers ex. \n\nEven if OP had been a sex god, he still would’ve been constantly compared to his brother.  I feel like that’s the main issue here that people are overlooking.",
                                    "score": 70,
                                    "author": "yoursistershouse",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Definitely don’t with a family members’ Ex, but depending on where they live, they might only have a small circle of choice. In some small towns there are only 40 people in your graduating class, so you all tend to date each other.",
                    "score": 36,
                    "author": "high-jinkx"
                },
                {
                    "level": 1,
                    "comment": "1) Don't date any of your brother's or friends' exes.\n\n2) Those words are mean to the point where breaking up should be very easy.",
                    "score": 12,
                    "author": "0tevet0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dump her and find a girl who will be happy to show you the way or have fun learning together. Nobody is great at sex in the beginning, it takes practice :)",
            "score": 14644,
            "author": "PearrlyG",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely this! You can find a girl who's so much more caring and gentle and helps you through this. No one is ever good their first few times, I promise!\n\nDump this rude bitch, that remark is unforgivable.",
                    "score": 2692,
                    "author": "Chelbalicious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 419,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "totally agree. and even once you have lots of practice, we can’t all be great every time! communication is so key. finding a partner you can be open and honest with about sex is so important.",
                            "score": 212,
                            "author": "mymorningbowl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also to give you a head start with the next girl. Check out omgyes website. However you may need to be 18 to get a subscription.",
                                    "score": 39,
                                    "author": "OGrouchNZ"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Totally this. It’s an appalling thing for her to have said!!",
                            "score": 294,
                            "author": "Rimini201"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly, you need someone that will communicate their needs and how to get there, not someone that’s gonna shit on you when you’re trying.",
                    "score": 294,
                    "author": "ohklahoma02",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unless they're both into that, because some people are ¯\\_(ツ)_/¯",
                            "score": 75,
                            "author": "apriliasmom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Technically true",
                                    "score": 34,
                                    "author": "T_oasty",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's a very important lesson for the OP actually. This gf may have soured it a lot but sex should never be taken too seriously. If you can't laugh during sex you're probably with the wrong person.",
                    "score": 192,
                    "author": "KrazyKatz3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m 35, and began to date my now husband when I was 17. We had sex pretty quickly, so I can confidently say we’ve been having sex for 18 years. To this day there are still times when someone accidentally knocks someone, farts, gets the giggles, can’t cum, etc. Sex is a time to relax and feel loved, not a time of intense pressure with a a schedule and a job to accomplish!\n\nEDIT: I still want to make it clear that I love sex with my husband, lol. We are still learning and trying new things, and the fact that I can be so comfortable and feel no pressure with him...well, it means that it’s a really fun and relaxing time. I didn’t mean to make it sound like a disaster 😂 Although in all honesty, once in a while it is, and then we just laugh and do it again later.",
                            "score": 278,
                            "author": "married_to_a_reddito",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This comment right here is what the OP has to see",
                                    "score": 61,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Omg yes! I have been with my BF for 3 years and There is this one time I farted on him and sex had to be put on hold for an entire HOUR cause I couldn’t stop giggling. I felt so bad lol",
                                    "score": 34,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I really like that phrase you said at the end, you're totally right. If you can't laugh and everything is tense and you feel like you're in an exam in which you must demonstrate your habilities otherwise there'll be consequences, there's something wrong.",
                            "score": 29,
                            "author": "Renzo172839456"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly she’s lucky he’s even trying as a 17 yo boy. Most women don’t get that reciprocity from male partners until much later in life.",
                    "score": 220,
                    "author": "mycophyle11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Luckily I think this is becoming less the case!!",
                            "score": 38,
                            "author": "UrgentPigeon",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Noooo she's not lucky for that. That should be expected. \nAnd in my experience untrue, selfish lovers don't get seconds, but I've rarely had a selfish lover even in one night stands.",
                            "score": 34,
                            "author": "FlimsyDimension",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To tack onto this, the longer he stays with this girl, the more it's going to fuck up his self esteem for future relationships.",
                    "score": 29,
                    "author": "Solstyx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guess you brother was the one that broke up with her. She's not with you for you man, she with you for your brother, if she liked you she would teach you. Leave her.\n\n\n\nHow old is your brother?\n\nEddit: thanks for the gold, kind stranger.",
            "score": 14928,
            "author": "victoraug19",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's 17 as well. We're twins (not identical)",
                    "score": 7686,
                    "author": "ThrowRA394817",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She set ya up bro. This relationship was doomed from the beginning. Dump her. Move on. She's an asshole anyway.",
                            "score": 11365,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm sorry, but the game was rigged from the start",
                                    "score": 2819,
                                    "author": "robertogarufi1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ain't that a kick in the head",
                                            "score": 727,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "More like a shot",
                                                    "score": 261,
                                                    "author": "robertogarufi1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Kinda seems like an 18 karat run of bad luck tbh",
                                                            "score": 189,
                                                            "author": "GloriousQuint",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ave, true to Caesar !",
                                                                    "score": 53,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Degenerates like you belong on a cross.",
                                                                            "score": 23,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "So you're the courier who has caused so much trouble for my legion...",
                                                                                    "score": 20,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Patrolling the Mojave almost makes you wish for a nuclear winter.",
                                                                            "score": 13,
                                                                            "author": "bigmeatyclaws117",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Worst day of your life so far ;)",
                                                            "score": 37,
                                                            "author": "ForceGlittering",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Best day of his life. He figures it out and moves on.",
                                                                    "score": 36,
                                                                    "author": "CharlieECHOdelta42"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Its a New Vegas reference",
                                                            "score": 47,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "At least he had sex. Got to get the awkward first time out of the way with someone who ultimately won't matter.",
                                            "score": 227,
                                            "author": "JediJofis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "See, there's always a bright side",
                                                    "score": 70,
                                                    "author": "Unfrozen__Caveman",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Patrolling the Mojave almost makes you wish for a nu- ahh nvm",
                                            "score": 45,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah she’s just working the bloodline",
                                    "score": 100,
                                    "author": "Lou-Spalls",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed.  She isnt with you for the right reasons.  Especially if your bro dumped her.  She's probably thinking since you are twins it will be the same.  I'm sorry but good sex needs an emotional connection too and if shes still hung up on your bro... Well its her problem not yours.\nFind a girl that deserves you and isnt using you.",
                                    "score": 88,
                                    "author": "we_are_all_crazy",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Before we offer one, rather obvious potential response: does she have a twin sister?",
                                    "score": 98,
                                    "author": "IQLTD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hell yeah family dick-nic time, I’ll bring the plaid blanket you bring grandpa’s 2 foot black ass blaster 🤗",
                                            "score": 17,
                                            "author": "CursedForLife22",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "She was probably just waiting for that moment. Also, side note, girls do not always have orgasm from sex. It takes time and experience. My husband is the only man to have ever figured it out, and it took him probably two years, is now extremely consistent. Before that, I enjoyed the shit out of sex anyway. So your performance isn’t some dire anomaly, it’s just part and parcel of learning to have good sex. It’s normal.",
                                    "score": 103,
                                    "author": "madsjchic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also it's 100% okay to communicate with your partner on how you can give them the most pleasurable experiance. I was a virgin with my gf and I was getting more and more anxious about how I would perform and how bad it'll be for her and then I just decided to leap an tell her about my anxiety and we talked about what she likes, that to her it didn't matter if i came in 10secs or 10mins (though I am thankful it wasn't the former) and when we were having sex she would give communication when needed, people might think it sucks to be given direction and seem like yiu have no idea what your doing but our first time was one where we both came, had a very pleasurable experience and now I know how and where to touch her i don't need that direction. \n\nLearn your partners body, learn what they like and then once armed with the knowledge the gates are open to you.",
                                            "score": 21,
                                            "author": "TeaKnight"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My wife is more experienced than I am. She’s had threesomes, was a bit of a wild chick in college. I was the first one to make her orgasm. Her words,  not mine. It takes time, patience, and trust,  none of which she had before.",
                                            "score": 7,
                                            "author": "Freefallisfun"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Remember that there are always more fish in the sea, but you only have one brother.",
                                    "score": 33,
                                    "author": "YusselYankel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If this girl keeps up working the family tree OP could have multiple more brothers in the coming years..",
                                            "score": 16,
                                            "author": "WallabyInTraining",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I usually don’t say dump her but this one is 100% a case where you should. Why? You’re young and you can find another girlfriend if you’d like. You’re wasting your time on someone that isn’t emotionally mature. If she said that, she’s too dense to understand how it would make you feel, especially because he’s your brother. You deserve better. \n\nTo be honest, I wouldn’t be surprised if your relationship went downhill if you happened to stay with her within the next 6 months. It may feel hard to break up with her if she’s been your first serious relationship, but what helped me get through my first breakup was reminding myself that being alone is better than feeling weighed down emotionally. And that he wasn’t the only person in the world and I could find someone that cared about me the way I care about others.\n\nEither way, good luck and I wish you the best!",
                            "score": 722,
                            "author": "veggiesaregreen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly, we all deserve to be with someone who cherishes and respects us. Dude deserves so much better. \n\nOP, none of this is about your sex performance.  You are just trying with the wrong woman.  Move on and find someone who treats you well and appreciates you for who you are.  \n\nAlso, sex tips for newbies:\n\nDon't skip the foreplay \nMany women can not achieve orgasm without extra stimulation (usually light rubbing of the clitoral area) \nDon't be afraid to ask what works for them... every body is different\nPorn sex is not the goal.  Slow works great, pounding away all the time isn't as enjoyable for women as porn makes it appear to be\nThat said, when you're young everyone is still trying to figure out what works for them.  There is no shame on not starting off as a master. It takes patience and practice. \n\nBest of luck",
                                    "score": 46,
                                    "author": "LeeLooPeePoo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your advice is well meant, but labelling rubbing of the clit as 'extra stimulation' is not cool. The clit is where the lady party is. Thinking of it as extra or foreplay is not the best idea. It is front and centre, literally and literally.",
                                            "score": 9,
                                            "author": "SAHM42",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You'll learn as you go why people don't date their friends and families ex girlfriends. Its not just an honor code it's also to keep crazies at bay.",
                            "score": 166,
                            "author": "Terok42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. The real reason is to avoid the type of absolute psychos that are totally down for trying swinging around your family tree.",
                                    "score": 51,
                                    "author": "ckm509",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Never date your bro’s ex. #BroCode",
                            "score": 879,
                            "author": "swaggerhound3000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude...this. I don't care what your gender identification is. Don't date your family's ex (blood or chosen, either way). You got set up homie. That girl used you as a prop in her little revenge scheme. Sorry, man. Move on, there plenty of women out there that wouldn't pull this kind of shit.",
                                    "score": 145,
                                    "author": "existentialhissyfit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He deserves it too. What dick head dates his own literal bro’s ex?",
                                            "score": 55,
                                            "author": "thegypsyqueen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Seriously why are people not talking about this point more? Maybe his family is different idk, but if that was my brother i would have so much trouble forgiving that",
                                                    "score": 28,
                                                    "author": "Stoopkid31"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I agree. Part of me wants to blame it on his age &amp; just chalk it up to being a dumb, horny teenager with limited life experience. But the other part of me feels like this should just be common sense for anyone who gives a shit about the people in their life. I'm not sure why he would have been ok with dating her in the 1st place.",
                                                    "score": 27,
                                                    "author": "existentialhissyfit"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My bfs ex started dating his bro a few months after my bf dumped her and we got together. Shes just trying to remain part of his life IMO. My bf and his ex were together for 7 yrs too... bfs just pissed cos he wants her to fuck off. But yeh, caused a major rift between the brothers. Dont ever date your brothers ex!! Theyre only doing it to hang around 99% of the time.",
                                    "score": 12,
                                    "author": "bishhpls",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yikes. Ya, sorry dude, but she only dated you because she wasn't over your brother",
                            "score": 48,
                            "author": "Lilcheebs93",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "For this comment, I will give you the benefit of the doubt and assume that you are being truthful about this whole situation....\n\nWHY would anyone date their brother’s ex?? Especially their twin brother??? And especially especially when she treats you like this??You’re better than that. Everybody is better than that. Have some self respect. Dump her.",
                            "score": 91,
                            "author": "Vintage_Antfarm"
                        },
                        {
                            "level": 2,
                            "comment": "If I am honest, I think you served to her as a \"back up guy\", someone she has fallen onto after her break up with your bro. Her reaction doesn't speak love to me. It really sucks she was your first partner.",
                            "score": 33,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "I’m sorry friend. She used you. You should not have been dating your brothers ex in the first place. Take this as a lesson and move on.",
                            "score": 31,
                            "author": "Dave_the_Chemist"
                        },
                        {
                            "level": 2,
                            "comment": "Why did so many people downvote this? He answered the question..",
                            "score": 101,
                            "author": "cheesypuzzas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know I don’t get this as well! Who are these people that downvoted him for nothing and the person who called him a POS?",
                                    "score": 48,
                                    "author": "Rimini201",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why you all downvoting his answer?  Its honest.",
                            "score": 27,
                            "author": "cautionjaniebites",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yikes... sorry dude, but she dated you for your brother. \n\nBro Code, never date your brothers Ex. \n\nThis is why.",
                            "score": 25,
                            "author": "BrosephSenpai"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 19512,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like she was using this poor kid to try to make his brother jealous and probably get back together.\n\nOP, I'm sorry, but she just isn't into you and you shouldn't take this kind of verbal/mental abuse.\n\nYou can do much better. Please don't compare yourself to your brother in any way. I guarantee that there are women who will find you attractive and think your brother is just ok.\n\nFind yourself a person who wants you for you. \n\nThis is one reason dating a friend/family member's ex isn't a good idea.  Too much drama and suspicious motives. Good luck!",
                    "score": 558,
                    "author": "Crazhy_Lie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "immediately thought this too. like u/sand_diamond said, ditch the bitch.",
                            "score": 46,
                            "author": "uhimsyd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She needs a one way ticket to Dumpsville. 17 years old, and old enough to know that was a fucking horrible thing to say.\n\nDraw a boundary and get out of that shitshow. If she calls you a baby, call her a cunt and say do one.",
                                    "score": 25,
                                    "author": "DataSomethingsGotMe",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 9518,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She was also probably dumped by the brother and using OP to get back at him.",
                            "score": 4671,
                            "author": "Adhdicted2dopamine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Came here to say this^ as well. I feel like this is a “get back at OPs brother” type of situation. OP already has insecurity issues; “I’m not as attractive as my brother.” So it seems she’s taking advantage of that and OPs niceness and dating inexperience to spite his brother/try to get back with him.",
                                    "score": 1895,
                                    "author": "callthewinchesters",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lmao I dont know how this is even an idea in her head. i would never get back with a girl if she dated my brother or best friend aftewards. It would just be another nail in the coffin to that relationship.",
                                            "score": 438,
                                            "author": "HolyInf3rno",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "loads of women do that stuff, i literally met a girl who fucked all her exes friends to get back at him.",
                                                    "score": 238,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's like salting the earth on your way out.",
                                                            "score": 157,
                                                            "author": "yoyoyo_its_me",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;It's like salting the earth on your way out.\n\nWell, something is receiving loads of salt but it probably isn't the earth..",
                                                                    "score": 91,
                                                                    "author": "WallabyInTraining",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Boom roasted.",
                                                                            "score": 21,
                                                                            "author": "yoyoyo_its_me",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "In a row?\n\nThat guy must be the shittiest judge of character of all time.\n\nEdit: And now I'm wondering if it was two guys, or like 30? Which would be worse?",
                                                            "score": 31,
                                                            "author": "arstin",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He should get back at her by dating his brother",
                                    "score": 227,
                                    "author": "Covetous1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or by dating her mother and turning her on instead",
                                            "score": 90,
                                            "author": "blazing420kilk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "FINALLY some mature suggestions!!11",
                                                    "score": 11,
                                                    "author": "Newtmittens"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep. Came here to say this",
                                    "score": 23,
                                    "author": "Bbehm424",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Thinking this too. Dump her ass now and get this nightmare over with before it starts..",
                                    "score": 43,
                                    "author": "scrubm",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Exactly what i was thinking",
                                    "score": 27,
                                    "author": "sendme_pugs",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A for accuracy",
                            "score": 523,
                            "author": "TheWho22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But not an up vote... “harsh”",
                                    "score": 109,
                                    "author": "91blue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "...but fair.",
                                            "score": 53,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should be able to understand that regardless of whether or not you’ve been through it. She’s a cunt.",
                            "score": 413,
                            "author": "_Cyclops",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a woman I totally agree. OP needs to dump her and run. She’s probably already found a cousin of his by now...",
                                    "score": 177,
                                    "author": "65crazycats",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that happened to my family. a guy who was in high school sent one of my cousins a DM on facebook asking if she wanted to see a nude because he was \"big\". she told him to fuck off because she was married and newly a teacher for an elementary school and wanted NOTHING to do with that as he was a minor (and you know....not her husband).\n\nlo and behold, a year later, that guy is dating her younger sister.... who previously had dated that guy's older cousin. younger cousin and DM guy ended up dating for over a year. eventually they broke up and he tried to slide in my OTHER cousin's DMs, which she swiftly rejected. \n\nLast I heard, he ended up doing gay porn for one of the biggest gay porn companies out there and had to leave the state because everyone who knew him found out.",
                                            "score": 64,
                                            "author": "mooseythings"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This needs to be the top comment. Straight to the point.   Please take my measly up vote  it is all I have.",
                                            "score": 14,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Exactly, she isn't 13 she's almost a fucking adult. She should know that words can hurt",
                                    "score": 202,
                                    "author": "StelleBest",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes! Having started to reddit not long ago and reading people's stories, I started to realize how people lack empathy. This is just another case.",
                                    "score": 24,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "You might know it’s wrong, like you know fire is hot. But until you get burned, you realize you never understood how much it would hurt. \n\nNot an excuse, but it’s valid.",
                                    "score": 63,
                                    "author": "sideoftortilla",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She may be almost an adult but in no ways is she one. By 17 you have a pretty decent understanding of basic right and wrong. This wasn’t a time where she was in a rough situation \nShe was literally having sex which releases endorphins, and yet she still reacts. imagine how  she’d react if it was in a more difficult situation",
                                            "score": 43,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This. Go after her mom in retaliation. Then make the same comment back. \n\nIn all seriousness time for her to go, especially after she jumps from one brother to another and says that. \n\nThen def try to bang her mom.",
                            "score": 164,
                            "author": "antz1104",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That is not an excuse of course she’s being a dumb teenager but it’s still an awful thing to say",
                            "score": 50,
                            "author": "icemankiller8"
                        },
                        {
                            "level": 2,
                            "comment": "Or how has been insulted in a similar way and is projecting.",
                            "score": 9,
                            "author": "flexon_teflon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. Ditch the bitch. Not even remotely ok to say this. If she thinks it's OK to verbally compare you to your bro, God knows who whose she will verbally compare you to next (yes most ppl compare, but in our heads!) . Not good for self esteem",
                    "score": 97,
                    "author": "Sand_diamond"
                },
                {
                    "level": 1,
                    "comment": "Nasty chic who bounces from one sibling to the next.",
                    "score": 126,
                    "author": "loujules17",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit dude no you are definitely right to be upset, that's a disgusting thing for her to say.\n\nDump her, she's an awful person.",
            "score": 7832,
            "author": "TippyBooch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed! That’s .. who does that??!! Sorry this happened, tell her goodbye. We all start out as virgins and knowing what to do doesn’t magically happen.",
                    "score": 1521,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Agreed! That’s .. who does that??!! \n\n\nSomeone who dates their exes brother",
                            "score": 997,
                            "author": "hellnospyro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "do you think these types of people only date the sibling to stay close to the ex?",
                                    "score": 292,
                                    "author": "peagoddess",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think thats definitely a contributing factor. At the very least, she certainly doesnt have a problem remaining close to her ex.",
                                            "score": 195,
                                            "author": "hellnospyro"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Bingo",
                                            "score": 41,
                                            "author": "2embarrassed2bme"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Honestly dating your brother's ex is worse",
                                    "score": 111,
                                    "author": "HappySaurusRex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True Eskimo brothers.",
                                            "score": 30,
                                            "author": "TheAveragestOfWomen",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh, for sure. Both are sus though",
                                            "score": 31,
                                            "author": "hellnospyro"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed... weird family dynamics going on here. I would never date someone who fucked my sibling. It’s weird as hell.",
                                    "score": 25,
                                    "author": "randomaccount_wpg",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Guessing the dad is next.",
                                    "score": 51,
                                    "author": "divisiveindifference",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah! I can see this getting worse from here. \nKeep us updated OP of you want. She sounds like a piece of work.",
                                    "score": 8,
                                    "author": "Collins1916",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You know she probably is only dating this poor fellow because it’s her ex’s brother and it’s likely a, f-you to her ex. OP please dump her. She likely wants that anyways considering she had the audacity to say this to you",
                            "score": 16,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not. Worth. It.\n\nShe may have been riled up and frustrated and it just came out, but this is her showing her true colors. Believe her the first time.\n\nI hate when people usually say this, but you're probably not going to be with her forever, so you might as well save yourself or her the future heartbreak and break it off now.",
                    "score": 37,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 194,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;IMO you a damn fine catch who’s gonna keep googling sex tips (we all did while things were relatively new)\n\nBack when I was first learning to do sex you couldn’t google sex tips. You just had to do whatever weird things popped into your head and see what happened.",
                            "score": 38,
                            "author": "Scaryassmanbear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or pretending you didn't mean to be in that book section at Chapters...",
                                    "score": 10,
                                    "author": "RosemaryMB"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, that is cruel!\n\nI bet he‘s a rebound for his brother or that chick uses him to make him jealous/still be close to big bro.",
                    "score": 98,
                    "author": "SenpaiRanjid",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Take out the trash",
                    "score": 17,
                    "author": "Matrixx22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude. Regardless of how frustrated she might be, there’s NO excuse for that. Straight up leave her ass. That crosses a line that your relationship come back from.",
            "score": 1534,
            "author": "Spoopyyyyyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "THIS. Everything she’s done is uncalled for. And truly, it’s not that hard to be patient with someone &amp; give them tips on what you like sexually, especially when you know you’re with a Virgin. She sucks.",
                    "score": 56,
                    "author": "spookycasserole",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brah why are you dating your twin brothers ex in the first place???",
            "score": 227,
            "author": "slushez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Revenge, which unfortunately may be the case here :(",
                    "score": 18,
                    "author": "AmyHeartsYou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im gonna say the same thing others are saying but In another way. \nYou’re young so you may not really understand this. \nGirls who dated close friends or family are not an option. \nI’m not talking about random hook ups. I’m talking about full on “relationships”\nBut to be honest I would avoid those also unless you honestly come from a small town where there aren’t options. \nShe sounds sexually frustrated because of your inexperience but that wasn’t cool for her to say. \nDefinitely you should not feel ok with that.",
            "score": 680,
            "author": "zorro1701e",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd still be wary of random hookups",
                    "score": 57,
                    "author": "MichaelSkott201",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your smashing your bros ex? ..You set yourself up for that one bro.",
            "score": 1360,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even worse, he's smashing his twin bros ex.",
                    "score": 578,
                    "author": "Stabini",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is more like r/WTF",
                            "score": 182,
                            "author": "AngeloPappas",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My thoughts exactly, he was doomed from jump",
                    "score": 175,
                    "author": "throwawaylike_shit",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Eskimo bros.\n\nBut also\n\nReal bros",
                    "score": 10,
                    "author": "justjoshingu"
                },
                {
                    "level": 1,
                    "comment": "THIS",
                    "score": 10,
                    "author": "elizacandle"
                },
                {
                    "level": 1,
                    "comment": "congratulations, you played yourself.",
                    "score": 7,
                    "author": "redditatworkatreddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just some advice for the rest of your life. Don’t ever date your Brother’s ex.",
            "score": 188,
            "author": "adecadeundr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, just stop wasting time and date your brother. Stop using middlemen",
                    "score": 47,
                    "author": "ActualWhiterabbit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You now have my attention. Please go on.",
                            "score": 8,
                            "author": "FourthBanEvasion"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah... it's *never* a good idea for family members to date the same person. You just learned one of the reasons why. \n\nYou're young, you'll bounce back. But don't date you brother's sloppy seconds again.",
            "score": 1002,
            "author": "widespreadhammock",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 364,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This whole situation just seams off.",
                            "score": 42,
                            "author": "cbwtfz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look, maybe she's just being honest, maybe she's being a bitch. Either way, you shouldn't be dating. \n\nAlso, why the fuck would you date your brothers ex gf?",
            "score": 499,
            "author": "theragingcactusman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed, I’m finding it hard to sympathize with someone who dates their siblings ex. Is it bad that I feel like this is kind of karma?",
                    "score": 144,
                    "author": "CAgirl17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's only 17. There are so many mistakes he's still allowed to make, just let him learn from it and move on.",
                            "score": 76,
                            "author": "magnetard",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Frankly, I do not know what you were expecting when you dated your brothers ex. That’s so low. Even if he said he was cool with it, it’s so effing low. Now, you definitely didn’t deserve to hear what she said, it was downright awful. That would have been terrible to hear regardless, but I can’t help but feel that it’s major karma for shagging your brothers ex. Come on dude, just come on. Do better.",
            "score": 932,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 231,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ha, reminds me of my friend in highschool, he dated a girl, and his brother dated her best friend.\n\nEventually my friend and his girlfriend broke up, and so did his brother and his GF.\n\nThen about 6 months later, my friend started dating his brother's ex, and then about a month after that, his brother started dating my friend's ex.\n\nHis brother and his ex are still together over 10 years later and have two kids together now, I couldn't imagine how awkward that would be at family gatherings and the like.",
                    "score": 105,
                    "author": "abra5umente",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My exact thoughts. It was instant karma. They're 17, so hopefully he learns some morals, some self-esteem, and learns to make wise decisions.",
                    "score": 81,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "OP has done major mental gymnastics to convince himself that the girl actually wants him and isn’t just interested in making the brother jealous. She’s just not that into you bro. She said it herself in an incredibly rude way. Move on.",
                    "score": 25,
                    "author": "snarky_spice"
                },
                {
                    "level": 1,
                    "comment": "facts 17 is old enough to know better",
                    "score": 7,
                    "author": "queenreinareyna"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a general word of advice, it's probably best to not date the ex of someone extremely close to you (i.e. a twin brother). That is setting yourself up for major issues/unnecessary drama in the future. You're extremely young, I think it's best to move on from someone who would even consider saying something like that.",
            "score": 95,
            "author": "Nidro",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ew who dates their siblings ex anyway? Way to many girls out there for you to be kissing the same mouth that sucked your brothers dick. Sorry not sorry but that was a no from the start.",
            "score": 85,
            "author": "dangerous-dungeon"
        },
        {
            "level": 0,
            "comment": "The fact that she would date brothers is a bit suspect to begin with but saying that directly to you.... She is not right for you. You will always have to live up to your brother and his experience with her.\n\nAs far a pleasing a woman it takes time and practice and some need different types of stimulation. As an inexperienced 17 year i had many really bad techniques too. You won't be a master overnight and the female orgasm is so much more than just a physical thing like us simple men.\n\nGet a good GF who wants to be with you not your brother and explore and grow in a sexual relationship together.",
            "score": 75,
            "author": "Ares0926",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not just brothers, twin brothers! Not identical but still very weird!",
                    "score": 32,
                    "author": "Cat_of_the_cannalss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 32,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "HAHA",
                                    "score": 8,
                                    "author": "therestissilence117"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That was a crappy thing to say. She sounds toxic. Run now.",
            "score": 122,
            "author": "JMarie113"
        },
        {
            "level": 0,
            "comment": "why tf are you  dating your brother's ex? also, how old is your brother?",
            "score": 13,
            "author": "gunners_1886",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And that is why u dnt date your brothers ex",
            "score": 35,
            "author": "Risen_17",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As messed up as it is, you really had no business dating your brothers ex. Not saying you deserved such an awful comment but there was a boundary there that should have been respected.\n\nThat being said: find someone else.\nA comment like that is gonna hurt. A lot. You’re probably feeling a lot so it’s hard to describe it. Someone who is alright with hurting someone that severely isn’t worth anyone being with. Find someone who’s ok with your vulnerabilities. Someone who understands you’re a rookie and maybe someone who’s a rookie themself. \nObviously you aren’t gonna begin a pro at this, so find someone who realizes that.",
            "score": 34,
            "author": "Suspicious_Loan8041"
        },
        {
            "level": 0,
            "comment": "Break up with her immediately",
            "score": 19,
            "author": "GlairUi"
        },
        {
            "level": 0,
            "comment": "Few questions to ask yourself \n\nDo you love her?\nDoes she make you happy? Genuinely?\nWas this a one off? \n\nAnd the way to spot a toxic relationship is to ask yourself, would you ever imagine yourself saying or doing the things they have? \n\nSaying that sort of thing after your first time having sex with a virgin seems way too unnecessarily cruel, as it is always a sensitive situation, and if someone is toxic during sex, what won't they be toxic with? \n\nThis is a major red flag OP, my advice is to take time for yourself, assess your priorities, think thoroughly about what benefits you're getting here from this relationship, and then go for a conversation with her, if she does make you happy, if you are getting something out of the relationship and if this was a one off in the moment remark, then maybe you can work things out, and if you aren't, or the cons outweigh the pros, or if she doesn't realise what she did was wrong on so many levels, then please, get yourself out of that situation quickly, because if you don't, it will only hurt harder if it eventually fails. I wish you the best, and hey even if it doesn't work out, and you guys do break up, then at least you have something to bond with your brother over.",
            "score": 28,
            "author": "The-Clever-Idiot",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Does she have a sister?",
            "score": 47,
            "author": "opinion8edputz",
            "replies": [
                {
                    "level": 1,
                    "comment": "lmao this comment killed me",
                    "score": 13,
                    "author": "MyCatsAJabroni"
                },
                {
                    "level": 1,
                    "comment": "Yo, stop right there. We are the good people here.",
                    "score": 34,
                    "author": "FlyingRaccoon85",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahaha, fair enough. Just a thought...",
                            "score": 11,
                            "author": "opinion8edputz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is a horrible thing to say to someone! If she wasn't enjoying herself what she should have done is  say 'That's not working for me, I'll give you direction to make both of us enjoy this more.' Communication is key to making sure both of you enjoy each other.\n\nInstead she snapped at you. But from how you've written this it sounds like she wasn't into it and had something going on in her head. She seemed to be frustrated and took it out on you. This still isn't ok and could have been handled better.",
            "score": 33,
            "author": "StillWaitingToLive",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There's pretty much no coming back from this one.  I mean at this point the best thing would be for you to end it with her and cut contact (and if your brother finds out about this if he is a decent person he will do the same).  For her to even let those words come out of her mouth, well it says a lot about the type of person she is.  Now show her what type of person you are, which is hopefully a man with self respect that won't tolerate being treated like that.\n\n&amp;#x200B;\n\nIn the future don't date people who have dated family or REALLY close friends.  It's probably going to cause more drama than anything else and it's just not worth it.",
            "score": 16,
            "author": "1776MinuteMan"
        },
        {
            "level": 0,
            "comment": "Fantastic way to gain a complex the rest of your life. Jesus.....\n\nI’m a 32yr old female and even at 17 I would have never said this to someone. Age does play a part, but your character lacking like that is also a good indication of who you are. Hopefully she apologizes, but that won’t take away any of the insecurities OP has now gained from this experience. What a fuckin douche she is.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Oh sweetie! Mom of a 17 year old boy here!! She’s playing you my dear boy. Either trying to \nmake your brother jealous or you’re her stand in until she’s over your brother. \n\nYou need to break up with her and find a girl who likes you for you, not because of your brother. \n\nAlso, what she said about your brother was rude, inappropriate and inconsiderate.",
            "score": 8,
            "author": "ang_hal"
        }
    ]
}