{
    "id": "iftqhw",
    "score": 30990,
    "title": "Terrified that my (25F) husband (28M) has been having sex with me while I'm asleep. Now I'm pregnant.",
    "author": "ThrowRA1668",
    "date": 1598290833.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/iftqhw",
    "media_urls": [],
    "other_urls": [],
    "postText": "For some  context, I have a serious medical condition that requires some pretty heavy medication. It does a lot of things, including destroy my sex drive, and knock me out for long periods of time. My husband and I were married before I was diagnosed, and he's supported my through diagnosis and treatment. He's a wonderful man.\n\nWe used to have a very active sex life, and it has been a considerable strain on our marriage that I never feel in the mood. I feel like a terrible wife in this regard, and I miss being able to do what we both enjoy.\n\nTo be clear, when I take my medication, I am dead to the world. You could blast a fire alarm next to me, and I wouldn't wake up. You could pick me up and toss me around, and I might not wake up.\n\nLately I've felt worse than normal. Really sick, dizzy, uncomfortable ect. I went to my doctor, scared I might be sick with COVID, and it turns out I'm pregnant. 5 weeks.  But I haven't had sex with my husband in at least two months. Maybe more. I did not cheat on him. I was not assaulted by anyone, anywhere, that I know of. This was not immaculate conception.\n\nI told my husband and he was surprised. It's probably a million in one chance I got pregnant, due to the medication I'm on, and my condition. He was shocked, then excited, and I was just so relieved he didn't accuse me of cheating that I didn't stop to consider why he didn't.\n\nIt's been a few days. I've been thinking about when I first started taking my medication. It was hard for him to adjust to me not wanting to have sex, and he used to joke that I could just lay there and watch tv while we do it. Or, and here's what makes me scared, he used to joke that he could just have sex with me while I'm sleeping, and that way I don't have to deal with it, and he can be satisfied. He's mentioned this a couple of times, but always lets it drop when I'm not okay with it.\n\nI've started thinking about all the times I woke up in the morning and had uncomfortable pelvic pressure that usually only comes for me after I have sex--my husband likes to be rough and I don't really mind, we were always pretty wild in bed or adventurous. Or bruises I've had that I can't explain.\n\nI confronted my husband about this. About me being scared he did this to me, and at the least why he wasn't surprised the dates don't match up. He was angry I would accuse him of something so horrible, and insists that I'm just misremembering the last time we had sex. The medication does play with my memory sometimes, but I remember the last time we had sex. I remember every time we have sex now because I don't enjoy it.\n\nI don't want to panic. I don't want to talk myself into being convinced he's been having sex with me while I'm asleep, and I don't want to talk myself out of this possibility just to protect our marriage. But I'm terrified. This is the only possibility I can come up with. And if it's true, I don't know what to do. I've been heartbroken for a while over the idea that I wouldn't be able to have kids. Now I'm going to have a baby and I'm so, so happy. But what if this baby happened because of what my husband did?\n\n&amp;#x200B;\n\nTL;DR: I think my husband has been having sex with me while I'm asleep because of my low sex drive, and now we have a miracle baby that may be a byproduct of it.\n\n&amp;#x200B;\n\nEDIT: I just wanna say the response to this has been insane. Thank you so much to everyone. I'm really lost and I don't know what to think or do. I'm going to take some time to think about this, get additional information and resources depending on however this is going to go, and figure it out.  Just to be clear, however, because there are too many responses to answer directly, NO, I have never given permission for my husband to have sex with me while I'm sleeping. YES, I have asked him if I have ever instigated something while asleep, sleep walked, sleep spoke, or did anything in my sleep related to sex, and he answered no we have NEVER had sex outside of a time when I was fully cognizant and aware of what's happening. And YES, I am keeping the baby regardless of what happened. If people are interested, I'll post an update when there is something to write. Again, thank you, thank you for all the support and opinions. They all matter. ",
    "comments": [
        {
            "level": 0,
            "comment": "Have you had a dating ultrasound yet? The first appointments generally use your last period date along with general ovulation dates to determine how far along you are, and then they will do an ultrasound to see what stage the fetal growth is at to confirm.\n\nBecause 5 weeks and 7-8 weeks (with your estimate of 2 months), I just wonder if perhaps you're a little further along? I don't want you to doubt yourself,  but a couple weeks is not a lot to be off by... \n\nI also would talk to your dr to figure out your memory lapses, because sex a week or two later and remembering it a little off could be possible.\n\nBut listen to your gut, you know you and you know your husband. Cover all of your bases until you feel safe.",
            "score": 16313,
            "author": "SSOJ16",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was my thought too. Especially because a lot of people have wonky ovulation times, it can be quite off. I was told I was 7 weeks and then when we went to the ultrasound, i was so early that there wasnt anything to see, so about 4 weeks. It can happen the other way too. \n\nYou should be due for a scan soon and that'll give you more answers. As for all the other stuff like the pain you've been feeling, I cant explain that. Maybe put a camera in your room?",
                    "score": 3476,
                    "author": "dananky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also she mentioned the medicine making it difficult to have kids. \n\nI don’t know if she just meant in the philosophical sense of the word. But if the medicine has actual effects on her fertility then there’s no telling what it could be doing to her cycle. (Of course her doctors should know any possible side effects and hopefully communicate them).\n\nAs far as I know it’s not that uncommon for medicine to have side effects that mess with your periods, really common stuff like Aspirin have blood thinning effects and things like antidepressants can have some quite unpredictable effects such as missing a period or irregular lengths.",
                            "score": 1183,
                            "author": "KyleKun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't also forget that first trimester symptoms can include implantation bleeding.  It's possible that the medication causes lighter periods, or a bloodier implantation discharge, causing implantation bleeding to be mistaken for a period.\n\nShe could think 5 weeks but her last \"period\" date was actually the implantation and she's closer to 10.",
                                    "score": 358,
                                    "author": "JasonDJ"
                                },
                                {
                                    "level": 3,
                                    "comment": "Now I wonder if she is allowed to keep taking the medication while pregnant, and if she has to stop, how she will cope...sounds like a fail-fail situation.",
                                    "score": 96,
                                    "author": "sapere-aude088"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah. With my first son they told me his bday was going to be 12-12-12. It ended up being 10-25-12. He was full term and not early.",
                            "score": 238,
                            "author": "develyn507",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn, I wish I got birthday presents and a shit ton of candy in the same week growing up lmao",
                                    "score": 31,
                                    "author": "SmudgeKatt",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For one of my pregnancies, my last period was in January. Positive pregnancy test in end of May (all tests taken in previous months were negative). I was only 5 weeks along. I ovulated 3 months late. \n\nHad a mini heart attack thinking I was somehow 4 months pregnant.",
                            "score": 43,
                            "author": "yellatchamps",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Welp, that would've been absolutely terrifying haha. But also a small blessing... skipping half the pregnancy sounds like itd be a dream the second time around",
                                    "score": 16,
                                    "author": "dananky",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I couldn’t explain the bruises, but maybe it’s possible the pelvic pressure she is feeling is caused by the baby? That’s of course given the pressure has only been occurring within recent weeks.",
                            "score": 239,
                            "author": "Whitemagickz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, its possible? Early pregnancy comes with a loooot of constipation too. Not invalidating OP at all, I'm just desperately hoping that her husband raping her in her sleep isnt the case here. I really hope we get an update after her next scan :(",
                                    "score": 293,
                                    "author": "dananky"
                                },
                                {
                                    "level": 3,
                                    "comment": "I get bruises all the time I can't explain, and I'm sure other people do as well. \n\nOP: I don't at all want to downplay your fears but also don't jump to conclusions. The rape scenario would be my last resort after all other options are exhausted.",
                                    "score": 118,
                                    "author": "kittycate0530",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Low iron gives me all kinds of bruises.",
                                            "score": 40,
                                            "author": "LaminatedLaminar",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I back this. My SIL was told she was further along than what they thought, 3 times in the initial stages. It changed by an entire month.",
                    "score": 1036,
                    "author": "keeganatthepark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes that happened with me, my due date was off by 2-3 weeks.",
                            "score": 326,
                            "author": "Kggcjg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was out by a month! Found out at 13 week scan i was in fact 17 weeks",
                                    "score": 214,
                                    "author": "velofille",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Does that feel like fast forwarding through the pregnancy? Seems pretty convenient",
                                            "score": 44,
                                            "author": "threemo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For me i was stoked - 1 less month to be pregnant!",
                                                    "score": 52,
                                                    "author": "velofille",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same here. My period dates were wonky but I knew my ovulation date as I'd been testing. Was told my due date was 2-3 weeks earlier than I knew it was based on ovulation. This didn't seem like a huge issue at first but then baby kept measuring an average between the 2 dates(I have small babies) so they kept the first date. Then I went into preterm labor and they wanted to transfer me out of town because I was 33ish weeks and our hospital would only handle 35 weekers. I kept trying to explain that the baby WAS a 35 weeker but they ignored me. Luckily baby held on a few more weeks because we didn't have a reliable car or childcare for our older kids at the time. I would have been stuck in a strange city with a preemie baby without any support since my husband would have had to stay with the kids.",
                                    "score": 47,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a great point. The only time I’ve ever been pregnant, I thought I was four weeks along initially, based on the date of my missed period and when I believe I ovulated. It wasn’t until I received an ultrasound that I was told I was actually six weeks. For some reason I got pregnant within days of my last period. Didn’t even know that was possible.",
                    "score": 379,
                    "author": "ruubi_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Since sperm can live for up to three days (from what I’ve been taught), it’s definitely possible if you ovulated early.\n\nEdit: it appears that they can sometimes live up to a week !",
                            "score": 129,
                            "author": "TrueRusher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've read that they can live for 5 days",
                                    "score": 27,
                                    "author": "peachez200",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "8 days",
                                            "score": 11,
                                            "author": "tyler_durrrden",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When they date you, they count from the first day of your last period, not a couple weeks later when you likely ovulated. Could this be why you were \"further along\" than you initially thought?",
                            "score": 70,
                            "author": "MiyagiWasabi",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Ive never been pregnant but I think they date you to when you start your cycle, so two weeks before you ovulate or you have sex. That is based on a regular ovulation time. \n\nI don't know if this is wide spread but im told this bc people think it's silly how you're considered 2 weeks pregnant when in reality you just conceived.",
                            "score": 46,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree.  My friend's doctor was off by four weeks and very much confused her and her husband who deploys quite often in the Navy.",
                    "score": 77,
                    "author": "thisthingwecalllife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg that could be alarming.",
                            "score": 14,
                            "author": "Johnnyring0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not a woman or a Doctor, but is it possible that the drugs you are on mess with your cycle etc too?",
                    "score": 66,
                    "author": "The_0ne_Free_Man",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This must be the absolute most important thing to understand!",
                    "score": 63,
                    "author": "cawo1981"
                },
                {
                    "level": 1,
                    "comment": "And some women still get the first period when they’re pregnant. I did. It was much lighter but didn’t think pregnancy was possible and just brushed it off until I missed the next one.",
                    "score": 128,
                    "author": "Sawa27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This happened to my wife. We were bummed at first, because we had been trying a lot to get pregnant and that first period kind of made us wonder if this was going to be a challenge. Then when she did get pregnant we found she had been pregnant since before that first period when we thought she hadn’t gotten pregnant yet.",
                            "score": 50,
                            "author": "bingbobaggins"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even ultra sounds aren't that accurate. When my partner was pregnant, we were placed in a position where we needed an emergency ultrasound. The place we had been going to couldn't fit us urgently, so we went somewhere else. The good news is there was nothing wrong, but the new place gave us a due date was nearly 2 weeks earlier than what we had and wouldn't budge. When we back to our regular clinic they also wouldn't budge after being told about it. \n\nWe were 5 days overdue on the latest date we were given. So who knows who was right.",
                    "score": 47,
                    "author": "skadootle"
                },
                {
                    "level": 1,
                    "comment": "Plus the pelvic discomfort may be due to the pregnancy and OP's now changing body.",
                    "score": 60,
                    "author": "kittycate0530"
                },
                {
                    "level": 1,
                    "comment": "Yes! This happens a lot &amp; the dates can be off significantly enough to cover the spread mentioned here, especially if your periods are inconsistent. Some women also experience ovulatory spotting or implantation bleeding, which can confuse matters. With my last pregnancy, I had what seemed like a completely normal period, save for the fact that it just stopped completely on day 3 &amp; then started up again for two more normal-seeming days. It was strange, but I was like, oh well, bodies are weird. Turns out I was pregnant &amp; it didn't even occur to me to take a pregnancy test until I three months along due to that weird false period.\n\nI HOPE this is the case for you, OP. Good luck.",
                    "score": 25,
                    "author": "youhaveonehour"
                },
                {
                    "level": 1,
                    "comment": "I wanted to ask for clarification on this as well. It sure sounds like you’ve been assaulted when in a state where you were unable to give consent. But in hopes that there is nothing so horrible going on, when was the last time you remember having sex?  At 5 weeks (that count starts from LMP, at least in my country), you’d most likely be just starting to feel symptoms. Where as if it was 5 weeks past conception, you’d expect symptoms. And 5 weeks past conception could mean that the baby making sex happened close to 6 weeks prior whereas 5 weeks pregnant (here) means the baby making sex happened somewhere in the 4-2 weeks ago range. It’s pretty inexact unless you know exactly when you ovulated. If you have irregular cycles, the dates could vary even more. \n\nThis is definitely something you should discuss in private with your ob/gyn and there’s plenty of info on how to make that possible without making your husband suspicious.",
                    "score": 311,
                    "author": "Choo_choo_taa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FWIW it’s pretty common for symptoms to start around 8 weeks. I’ve been pregnant 8 times and the only symptom I had at 5 weeks was a missing period and some mild period-like cramping.",
                            "score": 121,
                            "author": "dean_and_me98",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Every person is so different!  I did IUI and I started having lower back pain about 3 days later which lines up with implementation and then started migraines soon after.",
                                    "score": 30,
                                    "author": "Ignoring_the_kids",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same, just to add to the list of people saying it could be this.\nMy estimate of when I last had sex was October because I hadn’t seen my ex husband all of November (we were separated at the time). But the doctors estimated me to be like 6 weeks when I found out but I knew we hadn’t been together in around 9-10 weeks. Ends up I found out the last week of my first trimester.",
                    "score": 17,
                    "author": "alianaoxenfree"
                },
                {
                    "level": 1,
                    "comment": "I was further along by about three weeks myself. The first dating ultrasound I had done was wrong. A very real possibility.",
                    "score": 10,
                    "author": "InstantElla"
                }
            ]
        },
        {
            "level": 0,
            "comment": "5 weeks pregnant does not mean 5 weeks since you had sex. It could mean 2-3 weeks depending on when you ovulate/ your cycle length. Or 7-8 if you had implantation bleeding and pain you mistook for a period. Also I take some similar heavy duty psych meds which knock me out cold, but they also knock my memory off if I'm woken up in the middle of the night. He can initiate sex in the middle of the night and I won't remember, I know I'm the morning because well you know if you've had sex but I won't always remember it.",
            "score": 640,
            "author": "earplugsand",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you got pregnant that means he isn't using protection. If he isn't using protection then semen is involved. If he's having sex while you're asleep, wouldn't there be signs of semen?\n\nWhen you get out of bed in the morning does any of it come out? Is there any on the bed or in your underwear? I've never known semen to not come out at some point, especially if you have been laying down since sex.\n\nJust another data point to consider.  Not sure if it helps. Sorry you are going through this.",
            "score": 2814,
            "author": "aGentlemanballer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I’ve stayed in bed for a whole hour before getting up and... well most of us know that waddle to the toilet.",
                    "score": 1264,
                    "author": "Mamasan-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes, the snail trail.",
                            "score": 805,
                            "author": "stalechips",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Glaze the floor!",
                                    "score": 201,
                                    "author": "ericnutt"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh no... why did I read this...",
                                    "score": 101,
                                    "author": "MrsTrustIssues"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I did not think I'd be laughing in this thread, lol.\n\nFor real though. It's a whole thing.",
                            "score": 220,
                            "author": "DothrakAndRoll"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 46,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "plop.......",
                                    "score": 33,
                                    "author": "leahthelemon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lmao this thread",
                                            "score": 23,
                                            "author": "Dr_Mobius1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes for me it usually leaks every where after and the next day like I would wake up super wet and have to change underwear. It also smells like bleach? And the next few days throws off my ph balance. It’s not something I would not know for sure!",
                    "score": 562,
                    "author": "texasmushiequeen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can’t believe that anyone else is not mentioning this. You probably would be able to tell if someone has finished inside of you. It’s leaks out, and we have to assume as well that she is lying down so when she gets up obviously his fluids will also move downwards.",
                            "score": 460,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it’s very very noticeable it’ll drip down your legs the next morning lol",
                                    "score": 168,
                                    "author": "texasmushiequeen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then it’s also a possibility as well that conception date is wrong or that she may not even remember.",
                                            "score": 126,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes that is. Rape is a huge accusation. I want to know also how she can take care of a newborn on medication like that? They get up every two hours or so to eat. And also for other reasons throughout the night",
                                                    "score": 157,
                                                    "author": "texasmushiequeen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah that’s a good point as well. Since she suffers from memory loss and sleeps through anything she would have to have someone with her all the time as well.",
                                                            "score": 60,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "If this is real, which I highly doubt, there are extended release forms of some medications such as Seroquel that reduce somnolence. There is no reason not to name the medication or conditon because this is anonymous and also her husband would completely recognize the situation by other details anyway.",
                                                            "score": 10,
                                                            "author": "GlitterBirb",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Or, this being the internet, it's entirely fabricated by a 13 year old boy",
                                                    "score": 48,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You realize close to 100% of the trending posts on this sub are blatantly fake, yeah?",
                                    "score": 30,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This was my first thought as well. \n\nThat stuff drips out the next morning sometimes. My wife never goes to sleep without cleaning up because of the mess that results from putting it off.",
                    "score": 132,
                    "author": "thecoldedge"
                },
                {
                    "level": 1,
                    "comment": "He wouldn't need to fully ejaculate for her to become pregnant. You don't need to fully ejaculate for a pregnancy to occur due to this pesky thing known as \"pre-cum\". \n\nTo put it bluntly, he easily could have 'dribbled' enough pre-cum before pulling out and orgasming elsewhere. \n\nPre-cum can and easily does creates pregnancies since it can contain sperm cells. \n\nHappens all the time and it's a shock to those involved because.. \"I pulled out!\" or \"He said he pulled out!\".\n\nIt's the cause of many a teen pregnancy because they're under the false impression that full ejaculation is needed for pregnancy to occur.\n\nEdit: grammar",
                    "score": 316,
                    "author": "fleagymnastics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean yeah but that's a lot of things going against this possibility. She already is less likely to get pregnant probably ovulating irregularly on top of that he gets her pregnant by precum? It's actually very difficult to get pregnant in general the vagina is a hostile environment for sperm. Like it's possible but how likely is it that that happened",
                            "score": 70,
                            "author": "elaerna"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another thing to ask your doctor is if there is a possibility that the medication can make you sleep walk.  I had a ex that took medication every night and refused to believe me that she would get up and do stuff in the middle of the night. Sometimes it was just getting up and going to the bathroom but othertimes she would get something to eat or turn on the tv.  I ended up setting up a camera to show her and she was shocked becuse she had absolutely no memory of doing stuff.  We never had sex or anything when she was like that but maybe you have something similar going on.",
            "score": 8254,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My ex has sexomnia. Yes, I know it sounds made up, but it's real. She would wake me up by giving me hand jobs, but she was still asleep. She didn't believe me for 6 months when I finally recorded her while doing it, then woke her up and showed her.\n\nThe first time I thought she was awake, just keeping her eyes closed, so I reciprocated, which woke her up. Neither of us usually minded being woken up like that, I only had a problem with it when it was in the middle of the night when I had work the next day. I knew she couldn't help it, but I'd have to wrestle her off me until she gave up, and sleeping people are surprisingly strong",
                    "score": 1137,
                    "author": "DarkChimera",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I finally have a word. My ex did this ALL the time, but he also didn't initiate during waking hours often. One time, I thought he had just kept his eyes shut since he making noises, talking, and had woken me up with the initiation. I eventually got on top and when he really woke up he was mad at me. I've carried a lot of guilt (he put a lot on me) for messing with him while he was asleep. For the rest of our marriage he would wake me up and I would just kind of wait. I eventually hated it, but well, it wasn't the healthiest of relationships to begin with.",
                            "score": 430,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He got mad at you for reciprocating sex when you thought he was awake?",
                                    "score": 196,
                                    "author": "ritamorgan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I imagine the issue was the he didn't think she was reciprocating. As far as he was concerned she was initiating something while he was asleep.",
                                            "score": 252,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah yeah that makes sense. It just seems like when she explained what had happened it would have cleared everything up. But things aren’t always that easy.",
                                                    "score": 90,
                                                    "author": "ritamorgan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Unfortunately things were never that easy with him. It was very toxic.",
                                                            "score": 39,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m so sorry you had to deal with that! Hugs",
                                                                    "score": 9,
                                                                    "author": "ritamorgan"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Better sexomnia than murderomnia I always say.",
                            "score": 65,
                            "author": "Sengura"
                        },
                        {
                            "level": 2,
                            "comment": "People sleeping don't really have the inernal strength limiters you have while you are awake.\n\nPeople sleep walking or sleep-doing-anything are basically following automated commands in their brain. You will have an extremely difficult time forcing them to not do it because they **will** physically overpower your attempts to stop them. Although they will often times wake up long before you actually have to seriously put strength into stopping them",
                            "score": 28,
                            "author": "TheKappaOverlord",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's so weird, but absolutely believable after seeing it myself. She would be super strong while still asleep, then if I woke her up she would immediately be super tired and have no more energy than anyone else who just woke up.\n\n She somehow never woke up while I was wrestling her off of me unless I intentionally woke her up, and when she finally gave up (still sleeping) she would lay down with a huff, literally, with her back against me. In a way that was actually really cute XD",
                                    "score": 9,
                                    "author": "DarkChimera",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That legitimately sounds like a condition made up for a porn plot wow",
                            "score": 12,
                            "author": "eccentricrealist",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My mum used to cook complicated meals in her sleep. She also used to light the fireplace, smoke cigarettes, and once drove the manual transmission car out into a field to walk the dog. One morning she woke up with shoes and socks on but no underwear, and we never found the missing pair, not even in the bin-- leading us to believe she either burned them or went for a night time walk and dumped them in the street somewhere.\n\nMy boyfriend has full conversations with me sometimes, and he frequently tries to initiate sex while he's dead asleep.\n\nOP, it sounds to me like your husband has been assaulting you in your sleep, but don't rule out the possibility that you've actually been doing things yourself.",
                    "score": 1565,
                    "author": "BraveMoose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 810,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of the last times he did it, I even asked him \"Are you awake?\" before we started and he said yes. But he was lying, because he came to partway though and was like \"what the hell is going on?\"\n\nThankfully he's okay with it, otherwise I'd never feel safe to have sex with him.",
                                    "score": 599,
                                    "author": "BraveMoose",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When my husband and I first started dating he initiated late at night and I consented but I had zero memory of it, I was totally just dead asleep; it's normal for me and I've had conversations and shit while asleep that I don't remember, used to fully sleepwalk growing up, so I didn't mind at all. \n\nPoor guy practically went white when he brought it up next morning and I was like \"pardon?\"\n\nI had to reassure him so much the next day that I was completely cool with it and if anything was bummed I didn't remember it cause like, sex - but he's never initiated in the middle of the night again, hahaha.",
                                            "score": 159,
                                            "author": "the_greatsarcasmo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I feel like it's a common new relationship type of thing when the lust is especially strong, when my GF and I first started dating we had a few nights where we woke up on top of each other already fucking and we had no idea who started it but we just finished and went back to sleep happy as can be.",
                                                    "score": 113,
                                                    "author": "HOMES734",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I always have discussions about consent and implied consent in new relationships.  My most recent ex and I both like to have the occasional drink, and edible, occasionally together.  Not screwing because the other may be half asleep or intoxicated?  That seriously hampers both our enjoyments. \n\nMy go to is don’t try anything new if you or your partner may be past consent stage.",
                                                            "score": 47,
                                                            "author": "TMKIIISSSTTTIIILLL"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When my boyfriend and I first started dating, we were in bed, I was messing around on my phone and I thought he was dead to the world (he’s one of those people who pass out the second their head hits the pillow—lucky bastard). I then felt his hips pressing into my butt and his hand wrapped around my neck and he started to squeeze. I thought he was trying to get some so I let him know I was ready to go with a little booty wiggle and his hand squeezed tighter. He never choked me before, he’s a “gentle giant” (his words), so I was really turned on... until his hand wouldn’t stop getting tighter. I almost passed out and I managed to kick him and woke him up. He felt soooo bad about it (still does) and he’s still afraid he’s going to accidentally kill me in his sleep.\n\nHe’s the gentlest, sweetest person I’ve ever met but he’s violent when he sleeps, and a bit mean. I’ve been kicked, punched (jaw, nose, mouth, stomach), squeezed, booty bumped off the bed, etc.",
                                                    "score": 10,
                                                    "author": "tokieofrivia",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "i think lying is a pretty strong term for someone who is not even conscious, what do you even expect a person to say in such a state? \"no i am sleeping\" 😂",
                                            "score": 492,
                                            "author": "Dan_the_Marksman",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He has actually said that in the past lmao\n\nHe also called me by one of his co-worker's names and said that \"Your problem is that you're being a little bitch, Tom\"",
                                                    "score": 676,
                                                    "author": "BraveMoose",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sorry this entire post is about something serious but that's hilarious.",
                                                            "score": 378,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m sorry, but that is too funny, and would have woken up my husband right away, and asked him exactly what Tom did that made him such a little bitch.",
                                                            "score": 174,
                                                            "author": "sourgirl64",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Tom is such a tease.",
                                                                    "score": 92,
                                                                    "author": "coldfu"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "My sister used to sleep walk and when I would ask if she was awake she'd give vague responses like, \"I think so\" or \"I'm pretty sure I am,\" but wouldn't remember in the morning.",
                                                            "score": 85,
                                                            "author": "Twopoint0h"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Classic Tom.",
                                                            "score": 27,
                                                            "author": "SAFTA_MMA"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I used to talk and mumble in my sleep a lot. It’s always when I’m having a vivid dream and I think talking to somebody, I’ve even heard people talking in real life and my dream will contour to what I’m hearing in real life, sometimes triggering a response. \n\nI sometimes also have dreams where I try to run and my legs give out. I think that’s because I’m actually kicking my legs around in bed and the covers are weighing them down.",
                                                            "score": 12,
                                                            "author": "Drugsrhugs",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I always ask my husband if he's awake. When he answers yes, I know that he is not awake. When he looks at me like I'm an idiot, he's awake\n\nDon't feel too bad about the accidental sex. Happened to is too before I figured out how to know if he is actually awake. Thankfully he was immediatly in to it when he woke up with me on top of him and we still laugh about it",
                                            "score": 63,
                                            "author": "Perfectmess92",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Is it really “lying” if a sleeping person tells you they’re awake?",
                                            "score": 67,
                                            "author": "Magnetic_Eel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't sleepwalk but I can be dead asleep and if someone asks me if I'm awake I will always answer affirmatively",
                                            "score": 30,
                                            "author": "ElGosso",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My husband has done this before too. He’ll grab my boobs or grind on me in his sleep. I mentioned it when we first started dating and he was super embarrassed by it.",
                                    "score": 64,
                                    "author": "SilverLullabies",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh yeah I do that to my girlfriend quite often, I am a very heavy sleeper and don’t usually remember it. One time I put a finger in the cooch and asked (while asleep), «where is button fourteen?».. I don’t think this is too uncommon",
                                    "score": 45,
                                    "author": "AOVragnarokr",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Please tell me what her reply was. \"It's one over to the left\" ;)\n\n&amp;#x200B;\n\nI apparently do this too. I initiate things while dead asleep. My partner (who let me know) would cautiously continue and either that would wake me up (lovely btw) or he'd just go back to sleep and wake me up later haha. I felt very lucky that I don't do that in weird sleeping situations with other people...",
                                            "score": 20,
                                            "author": "macaron_eater",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I loved that my wife initiates sex while I'm asleep. It was almost a year into the relationship that I learned I was the one sleep fondling her. I guess I start rubbing on her and then \"pass back out\" (even though I'm not awake for any of this) by that point she's all hot and bothered so what she does ends up waking me up for real.\n\nI thought she was fucking with me when she first told me.",
                                    "score": 157,
                                    "author": "WingersAbsNotches",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean... she **was** fucking with you...",
                                            "score": 65,
                                            "author": "LimitlessMoonlight"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have sleep-cooked while on Ambien as well. It scared the crap out of me and I have zero memory of it. My husband has seen me do it a few times as well now. Op, is your husband on any medication that could make him do things while he is asleep? If the husband is on medication too, then things could be really misremembered on both sides.",
                            "score": 111,
                            "author": "Vancookie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, a visit from the Ambien Walrus",
                                    "score": 58,
                                    "author": "blazetronic",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's also the possibility the husband is doing stuff in his sleep as well, but that's a step too ludicrous for me.",
                            "score": 23,
                            "author": "Alarid"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The only problem I see with this is why wouldn't her husband have mentioned this to her like wow that was great last night or I was so surprised you initiated or when she said she is pregnant and she questioned it wouldn't he have said oh must've been that one night or w.e like I feel like it would have come up if it was some type of sleep walking or talking",
                    "score": 377,
                    "author": "Dovahkiinkv1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 160,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This, its totally possible that OP appeared concious to her husband and agreed without actually being conscious enough to remember, so when she asked him if she's ever initiated in her sleep he wouldn't consider that occasion. \n\nAnd like, most long term serious couples don't discuss consent every single time they have sex. If both parties are engaging it suggests both are concious enough for consent, then consent is assumed. So unless she was truly dead to the world asleep and her husband went for anyway, then nothing is that concerning. \n\nIf she WAS though, that is a serious violation and the fact that she's considering it a possibility is itself concerning",
                                    "score": 88,
                                    "author": "kwolff94",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Eh, you never know what someone is capable of, no matter how well you know or trust them, so its not as wild as you think it is that she fears this possibility. Ive known of way crazier shit than this happening in marriages, and early pregnancy hormones are a BITCH so that alone could cause some strange thoughts. \n\nAnd like, its not impossible that she's actually right. This is not the first relationship advice post I've seen on this topic and some involved women waking up in the middle of it.",
                                            "score": 15,
                                            "author": "kwolff94"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When my wife and I have sex we don't generally discuss it the next day. Even when either of us have been near deathly ill for months and have that one off time we're feeling well enough, still no discussion about it the next day.",
                            "score": 282,
                            "author": "Codi_The_Scout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 209,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think it’s weird to talk about it, or not to talk about it. The only time it’s a problem is if there’s a huge issue that you can’t resolve because you feel too awkward to talk about sex.",
                                            "score": 81,
                                            "author": "emthejedichic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, people shouldn’t assume everyone is just like them. Sometimes other people do things differently than you and it doesn’t mean they are wrong or weird.",
                                                    "score": 20,
                                                    "author": "ritamorgan",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 51,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Really? My husband and I are in our 40’s, and we always drop in jokes or something about the previous day/night’s sexually activities. \n\n“Oh you had a good day at work? You’re welcome for that 2 AM booty! &lt;wink wink&gt;!” \n\nOther people don’t do this?! You totally should because it’s fun! 10/10, would recommend!",
                                            "score": 15,
                                            "author": "ragingfeminineflower"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I dunno, outside of something eventful happening, I don't think my wife and I have ever talked about the previous sex",
                            "score": 24,
                            "author": "Am_I_Bean_Detained",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But wouldn't the husband tell her if that's what happened? He's not the one on medication. He knows that when she takes the meds she's dead to the world (judging by his jokes) so if she was walking around or having sex after taking her meds he would at the least have told her. \n\nI sleep walk and sleep converse, and everybody who has ever experienced it tells me about it. They either think I was doing it on purpose or they realise I was still asleep, but either way they realise it isn't quite what they would expect, and bring it up.",
                    "score": 102,
                    "author": "documentremy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Sexomnia is a documented disorder though I’m not entirely sure it could be caused by medication.",
                    "score": 100,
                    "author": "GentleChaoticNuetral",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is DEFINITELY a documented thing that has happened to people using Ambien. They've even driven their cars around with no recollection after.  Medication can absolutely have this effect. OP should consult with her Pharmacist and Doctor, in that order.",
                            "score": 122,
                            "author": "moronicuniform",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep it happened to both my wife and I when we were taking ambien sex and cooking food are some of the crazier ones.",
                                    "score": 35,
                                    "author": "XOTIK_11C"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ambien for sure can do that. When I was prescribed it I downed an entire bottle of Robitussin and I faintly remembered a dream where I felt as if I had a cold. I woke up to vomit everywhere in my bathroom and I was tripping balls when I became fully conscious. I didn't remember a thing besides the vague recall of the dream, but I did take a shit ton of selfies apparently. I never took Ambien again after that experience.",
                                    "score": 33,
                                    "author": "poptartmonkeys",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 44,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If she does this, she needs to be aware that if he finds the camera, and he has been raping her, this could lead to possible escalation and place her in even greater danger. I understand the desire to offer this suggestion, but I think it needs to be offered with a caveat regarding her safety, if it's offered at all.",
                            "score": 77,
                            "author": "Ebbie45",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had a girlfriend who while sleeping tried to have sex with me. She wasn't on medication or anything and nothing else like it ever happened again.",
                    "score": 19,
                    "author": "pig_smart"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I do not at all want to discount the possibility of rape here. \n\nWhen you see your physician alone, please talk to them about how pregnancy is dated. It is a calculation based on average time of conception and gestation for most women; it is not a specific amount of weeks counted from the date of conception. Because of how pregnancy is calculated, it can be up to two weeks off of your actual conception date. The formula is based on your last period and an average ovulation date of 15 days later. If you have irregular periods, ovulate early or late, or conceive on another date, it is still calculated this way. If you know your specific conception date, it is still calculated this way. \n\nI wanted to make sure you have this information, as its not commonly discussed and is super confusing, and may affect your calculations of when conception happened. But it doesn't change that you should consider going somewhere safe, getting counseling, and exploring all possibilities to ensure your safety is the utmost priority.",
            "score": 2977,
            "author": "starrynightt87",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is exactly what I wanted to say. It would not be 5 weeks from the conception date but 5 weeks from the last period. I truly hope this makes a difference to OP and everything turns out alright!",
                    "score": 529,
                    "author": "TaylorPlease",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Upvoting &amp; awarding because OP really needs to see this response. \n\nConception dates early on in pregnancy are a sophisticated guessing game and can change through pregnancy. There is a good chance she conceived her child when she last remembers having sex with her husband. Sperm can also live in the vagina for up to 5 days after intercourse which can also make determining the exact date difficult when were talking weeks. I would recommend OP discuss with her doctor in private the concerns she has to see what the doctor says and if it's a possibly she conceived this child around the last time she remembers having sex.",
                    "score": 132,
                    "author": "Aniseanemia",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Was going to say this. My wife and I just had a kid last December and his conception date kept moving around at the ultrasounds. At first they thought he was 8 weeks along, then they thought he was 5 weeks at the next appointment, then 6 at the next. At the early stages of pregnancy the conception date is super inaccurate as it's too hard to tell with such a small embryo.\n\nI also want to emphasize that I am not discounting the possibility of rape either, just want to add my personal experience with early stage guesswork OB-GYNs go through until finally determining a true date at the later stages of pregnancy.",
                    "score": 227,
                    "author": "RyseToPro"
                },
                {
                    "level": 1,
                    "comment": "I wondered about this too. Figuring out conception date seems to be very imprecise unless the woman has been tracking her ovulation for months etc. If OP is actually 7 weeks pregnant, that puts conception at about the time frame that she last remembers having sex.",
                    "score": 66,
                    "author": "Platypus_Over",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I was thinking this as well. Certainly don't want to discount the possibility of your husband having done this, OP, because it's very scary and a real possibility. But I know pregnancy dating can be really iffy sometimes. It's possible they got it wrong, especially since the difference is a matter of weeks - 5 weeks pregnant, 8ish weeks since you last had sex.",
                    "score": 19,
                    "author": "zsttd"
                },
                {
                    "level": 1,
                    "comment": "Yep. Came here to say this, as well. I'm pregnant and technically my baby is 23 weeks from my last period but is measuring at 24 weeks. I ovulated early. OP needs to talk to a doctor and see if they can get the first ultrasound earlier. First trimester measurements are not as accurate, but mine was showing up a week larger around 8 weeks, as well.",
                    "score": 15,
                    "author": "brydizz"
                },
                {
                    "level": 1,
                    "comment": "I wanted to add that some women still get a period when they are pregnant (I did with my first pregnancy) and that can make the assumed conception date incorrect. I realize that it is very, very rare, to the point that having been assaulted is more likely, so I’m not discounting that possibility at all. Please bring your concerns to a doctor.",
                    "score": 33,
                    "author": "77pearl"
                },
                {
                    "level": 1,
                    "comment": "I was looking for your comment. 5 weeks from missed period. Conception can indeed be a lot earlier. Giving you a reward so OP might notice this comment",
                    "score": 26,
                    "author": "d-o-m-lover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it's calculated from the start of your last period (not the missed one).",
                            "score": 11,
                            "author": "bluemoonrune",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sorry if this thought is obvious (or wrong!) but I’d be very confident (90%?) that a medical test could be off by 3 weeks, and that you could in fact be 8 weeks pregnant. I think the test checks your hormones, and everyone’s different, perhaps especially with heavy duty meds. Keep an open mind about that option :)",
            "score": 417,
            "author": "tokyobandit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Either he had sex with you without your consent, or you have problems with your memory (possibly caused by your medication). You should try to rule out memory problems. For example by talking to your doctor and asking whether your medication could do that.",
            "score": 3913,
            "author": "Northlumberman",
            "replies": [
                {
                    "level": 1,
                    "comment": "&amp;#x200B;\n\nI do absolutely admit that I have issues with my memory because of the medication. It makes things I did or said really hazy. Almost like it happened in a dream and not in real life? But I'm very, very aware of when I'm having sex and when I'm not. The medication makes me very tired which is part of why my sex drive is gone, so when I do agree to have sex it's more of a service I'm performing for the benefit of my husband, than anything else. All the enjoyment is gone, so I remember when it happens, because it's just a chore, and one I don't enjoy.\n\nThis is a normal side effect of the medication, as well. Nothing abnormal.",
                    "score": 2338,
                    "author": "ThrowRA1668",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve been on medications that knock me out cold. My partner has woken up before saying that we had good sex the night before. There’s been times I don’t remember at all (when I’ve initiated) Other times he’ll give me small details about what we did and it’ll start to come back to me. It could be a memory issue.",
                            "score": 437,
                            "author": "LadyDys",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s happened to me, it was....almost surreal.",
                                    "score": 154,
                                    "author": "imSOsalty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not a medication I take regularly now...so I let my partner know ahead of time if I’m taking it. We have good communication and I trust my partner not to take advantage if I said no.",
                                            "score": 61,
                                            "author": "LadyDys",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s good, it happened with my parter and I wholly trust him so once we talked about it and came to an understanding that I had to verbally say yes everything felt a lot better. Apparently I was just very...vocal and he thought I was initiating by touching him",
                                                    "score": 17,
                                                    "author": "imSOsalty"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I hate to agree but if you were on medication that caused that severe exhaustion and put you out people have been known to get up do to bodily needs and even had half dead conversations. If he has always been faithful and never done anything like this that could be a possibility. Check meds and go from there. Honestly this is a hard one because you have every right to be worried but keep objective as well.",
                                    "score": 101,
                                    "author": "FourbiddenNova",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This. My wife does this because of the psych med she is on. We had an entire 20 minute conversation about the grocery list and when I was going to be shopping the next day. 30 seconds after she stops talking, she's snoring. I get out of my chair to get ready to leave, and she comes around and is confused as to why I'm leaving the house. Completely didn't remember the convo. She calls them brain snaps, and brain fogs.",
                                            "score": 63,
                                            "author": "derpsalot1984"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hide a camera in your bedroom.  Next time you wake up and feel sore, check the recording.",
                            "score": 2112,
                            "author": "mcal47",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are also sleep apps that record noises all night. They are to help you track your sleep and the recordings only come on once it picks up background noise",
                                    "score": 788,
                                    "author": "indigo_tortuga",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sleep as android.\n\nAlso a general suggestion if you love good sleep and a good way to wake up.",
                                            "score": 68,
                                            "author": "GhostSierra117",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ugh, I can't imagine the horror you'd feel when you play that recording and hear grunting (and I'm a dude, to be a woman and hear your husband do that, Jesus...) 😰",
                                            "score": 339,
                                            "author": "thebalux",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 61,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "*If* she chooses to do this, she needs to be aware that he could discover it and if he has been raping her, then obviously he's abusive and discovering a hidden camera could lead to further escalation. In addition, there are certain locations where video recording is illegal in places where someone has a reasonable expectation of privacy. I am not saying that being charged or convicted of such is worse than rape. But it's important that when making suggestions like this to possible DV victims, that all considerations are put forth. Especially the possibility of escalation from her husband.",
                                    "score": 1194,
                                    "author": "Ebbie45",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Worth noting that in a lot (if not most) Western countries, you absolutely would NOT be prosecuted for filming someone raping you. Do check your local laws, but don't be put off on this basis without checking. \n\nThat said, please be careful that he doesn't find the camera/ recordings as it could be dangerous if he turns violent as Ebbie says.",
                                            "score": 86,
                                            "author": "sanguine_rose_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That really, really depends. \n\nIn Oregon, a rape victim of a prison guard was jailed for weeks because the DA was \"concerned\" she wouldn't testify. Even though rape victims are supposed to have the option to drop charges or not testify if they don't want to or change their mind. \n\nApparently this also happened in Louisiana.",
                                                    "score": 19,
                                                    "author": "Babybutt123"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’ve been reading your comments for quite some time now. I truly think you are an amazing, compassionate human being! I just want to thank you for all that you do!",
                                            "score": 210,
                                            "author": "TsarinaAlexandra",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "U/ebbie45  is a superhero and noone can change my mind.",
                                                    "score": 13,
                                                    "author": "MishaRenard",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm glad you mentioned the legalities.",
                                            "score": 49,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Uh... if my SO put a camera in the bedroom without my permission I'd be getting a divorce immediately.  That's like 99 kinds of fucked up in a relationship.",
                                    "score": 11,
                                    "author": "Valdrahir_Mendrenon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am not defending your husband as what you are thinking could definitely be a possibility. But I also want you to consider the memory issues. I have trouble with my memory and there was a point when I was still at home when an event came up that I was 110% sure had happened. I had experienced it, lived it, had detailed accounts and even wrote it on the calendar until my mother pointed out there was nothing on the calendar.\n\nI have never again to my recollection had such a severe mental lapse but absolutely anything is possible especially with medication. \n\nI’m not sure how you would find out the truth but I hope you all the best.",
                            "score": 119,
                            "author": "Terra_Ferrum"
                        },
                        {
                            "level": 2,
                            "comment": "The medication isn't Ambien is it? If it is, it's well known for sleep walking/amnesia, so it's possible that you did have consensual sex from his perspective, but that you had no awareness or no memory. I've taken it before and wouldn't believe what my partner said I'd done after taking it because I would carry out complex tasks but have absolutely no recollection the next day. \n\nEven if this is the case, unfortunately that doesn't rule out the possibility that he is waiting for you to totally zonk out before having sex with you though",
                            "score": 58,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, if it's fucking Ambien then it's straight up *likely* she's initiating sex then forgetting it.  Ambien is some fucked up shit.\n\n\"I'm on medicine that causes memory problems, but I definitely 100% remember the last time I had sex.\" \n\nNot how that works.\n\nThere's too little information to tell if something's fucky or not, but I'm definitely leaning towards \"lady on medicine that causes you to do weird things with no memory does weird things with no memory.\"",
                                    "score": 117,
                                    "author": "Accomplished_Hat_576",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you are sure then there is only one explanation. A doctor might also confirm that the medication couldn’t have made you forget something like that.",
                            "score": 119,
                            "author": "Northlumberman",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Or you could be “awake” on your sleep meds and initiate. I know it sounds wild, but my ex told me about me doing things like that. He didn’t think anything of it BC it was normally middle of the night or nearer to morning when he was waking up. \n\nWhat woke us both up the the problem (lol) was when I got up to go to the bathroom and fell into the mirror, waking him up in the process. It was shattered, I was sliced up pretty badly. Had a thick glass shard stuck deep in the back of my hand. Kept insisting it was ok. I don’t remember any of this, but I apparently freaked out about going to the hospital and he took care of me at home. I woke up covered in butterfly bandages and sore as hell, with absolutely no recollection. Freaked us both the hell out. \n\nAlso, I used to tell my ex in college (while I was studying) “just don’t disturb my reading”. Lol. To be fair, though, I’ve been lucky enough that a lack of sex drive has never been a side effect of any meds I’ve taken. \n\nHonestly, it could be anything. But talk to your doc first.",
                            "score": 37,
                            "author": "ellefemme35"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd talk to a pharmacist more than a doctor. I recently found out that my doctor had no clue what the serious side effects of a medicine they were prescribing to me were. When I got them they said \"that can't happen. Where did you hear that?\" And I tell them literally on the website for the medication. He goes \"I've never heard of that. You'll be fine.\" Meanwhile the pharmacist told me it's a serious ide effect and I need to stop taking it and talk to my doctor right away. Needless to say I'm switching docs.",
                    "score": 24,
                    "author": "Rickrickrickrickrick",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is such a weird question, but what about cleanup here. Like my girlfriend has to sit on the toilet for a solid 5-10 after after a cumwalk to the bathroom. I'm just saying if he's doing this, how is he getting away with the mess it would make. Is memory really a big problem here? Did you happen to have sex with him and just don't remember? If he is having sex with you while you sleep, that is rape, but I'm just confused at how he can just cum inside and leave no mess behind.",
            "score": 472,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It doesn’t make sense! Look, many people saying here is the trust her guts. I am not dismissing that fact that she might be right. \n\nBut they don’t answer the questions.\n\nHow in the world there is no semen spill? If he is ejaculating inside of her there has to be some evidence of the semen spilling out of vagina. You mean to tell me that the husband clean so good inside of her? That she wakes up she sits in the toilet and nothing? You mean to tell me that her panty doesn’t have some sort of spill of semen? Any position you lay down, semen spills out. Why ain’t no one answering this question?",
                    "score": 245,
                    "author": "Lusterkx2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "(because its a bullshit story for karma farming)",
                            "score": 61,
                            "author": "corfish77"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel this should be hire up. Not trying to discredit OP, this is definitely a real thing that happens, but it would be pretty much impossible to not feel it the next morning. I sometimes feel it dripping down my leg long after I initialially “let it drain out”.",
                    "score": 63,
                    "author": "ThrowRA9393",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of people telling her to trust her gut and listen to her body, which, yes, agreed. BUT the two most worrying clues, which alarmed me too, are pelvic pain and bruising. Pelvic pain is common during early pregnancy. It’s one of the earliest symptoms, so even if it wasn’t common for her before, well it’s common for her current condition. According to WHO, women have high rates of anemia (over 30% compared to 12% of men), which makes bruising very easy. I constantly have bruises and have no idea where they came from. My ex-boyfriend used to insinuate I was cheating because how else would I be getting all these bruises I couldn’t explain? It just wasnt in his frame of reference that a person can bruise without something painful and memorable happening to them because that’s never happened to him. \n\nWell, you know who has even higher rates of anemia than a woman like me...A PREGNANT WOMAN. Nearly 42% of them. A lot of women develop conditions that lowers platelet counts, which again, makes bruising much easier and more frequent. \n\nI’m not saying to discount anything OP is saying, but it’s kind of hard to read a bunch of people telling a woman in an incredibly emotionally vulnerable situation, that she has absolutely been raped by the man she loves. There are so many questions that need to be asked and explanations that need to be explored before anybody just flippantly throws out accusations that will destroy 3 lives. Most people use this as a sounding board, “my boyfriend did x, and I feel y, but should I feel that way?” She wants to process it, she wants to talk to different people who may have different views and experiences and make her see or think about things differently. Nobody has the right answer and it’s downright cruel to present your uninformed opinion as the only correct conclusion. \n\nThe people going further than telling her she’s definitely been raped and that she shouldn’t keep her rapist’s baby...you do realize this is a real person and not just some story on the internet that you can use for your performative outrage. It’s easy when you don’t know or care about the person, and it’s just some stranger on the internet, but the person reading this might start to believe you when you convincingly tell her you know she’s been raped. You are lying when you state it is rape as a fact, because you know that YOU DO NOT KNOW with certainty what the true reason is. Worse still, you’re using that lie to influence the OP’s perceptions, if a few people told me a sexual encounter I had was rape, I’d start to color it differently in my head too. I’d start to look for other signs too. How could you not? You’re not trying to help her and please sit with what really prompts you to respond in this way to a woman asking for help in a very unclear, hazy, nuanced situation, where we also know that we do not have all the information to make conclusions. These responses are just as bad as telling her it’s in her head, she’s not remembering correctly or that she’s wrong for even questioning whether her husband raped her. \n\nIf I came to my friends, distraught and confused, and told them this exact story, there’s no way they’d say “sorry girl you were raped and that’s your rapists baby.” They would ask me questions, let me talk, let me process, wrestle through each plausible explanation with me, while also making sure I’m safe and getting me the help I need. We should treat anybody, internet stranger or sister, in exactly the same way. I can’t imagine how she’s feeling having to wrestle with these thoughts and then further doubting her own memory, perceptions and basically her entire reality as the conclusion you’re quick to throw out would mean her entire relationship with her husband is a lie. Be empathetic and constructive, not alarmist and out to prove a point. This is what o hate about reddit threads like this.",
            "score": 92,
            "author": "turkeytrotsky",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I agree that you should talk to your doctor about the potential impacts this medication could have on your memory and if it could plausibly lead to such a significant memory gap. I also think you should consider staying with a friend or family member if possible while you wait for that appointment; **definitely do not attend a doctor's appointment with him.** Others have suggested confronting him again, but **if he did rape you, confronting him a second time (especially after he was so angry before) is not a safe idea.** I understand that leaving to stay with a friend or family member for awhile could have a very negative impact on your marriage if he didn't rape you, but if he did rape you, it's better to be safe and away from him.\n\nI also hope the \"my husband likes to be rough and I don't *really* mind\" was just written in a slightly off manner and that rough sex with your husband has always been fully consensual and you haven't made yourself participate if you don't really want to.\n\nOthers have also suggested setting up a hidden camera. Which could of course answer your question, but if he is raping you, then setting up a camera and remaining in the home could result in you being raped again and/or him discovering it and escalating any abuse. Ultimately it is your choice whether you go that route with a camera, but please be aware of the potential risks. I think this is a situation in which it is far safer for you to talk with a doctor and if worst comes to worst, a domestic violence advocate.\n\nNo one here can know for certain what happened, but at the very least please put together a safety plan if you choose to remain in the home with him. [The National Domestic Violence Hotline has a sexual violence safety plan for individuals living with an abusive partner](https://www.thehotline.org/2015/05/28/safety-planning-around-sexual-abuse/).\n\nAlso consider writing out/noting the details, dates, and times of everything (when you visited the doctor first, any dates you can remember in which you woke up with pelvic pressure and bruises, any dates you remember in which he made jokes about raping you) and take injuries of any bruising you currently have, though maybe you don't have any. Keep any documentation in a safe place where he can't find it.\n\nI hope it's an issue with your medication impacting your memory, but keep yourself safe while you wait to talk with a doctor again.\n\nEdit: If he has been raping you, the [National Domestic Violence Hotline offers an amazing and thorough set of pregnancy safety plans](https://www.thehotline.org/is-this-abuse/pregnancy-abuse/) for remaining physically and emotionally safe during pregnancy, planning for a safe childbirth, and during the post-partum period. **If you are being abused, pregnancy is often a time of escalating abuse and can lead an abusive partner to have additional control over you.**",
            "score": 1701,
            "author": "Ebbie45",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the advice about going to the doctor. I'm just not sure how to go without him? We're both out of work because of COVID and since he found out I'm pregnant he's hyper aware of everything. I don't mean this to come off in a creepy way, it's just very hard for either of us to do anything without the other knowing. He wants to do everything with me related to the baby, including all doctors appointments--he's very happy and excited. And if I try and go for a reason other than the baby, I think he'll be very suspicious.  I don't want to fight with him until I figure out what's going on.\n\nAs for our sex life, I can say he's never hurt me, that has never happened. And it's all consensual. I just meant I'm not turned on by sex getting a little rough, that's his kink, and since it doesn't both me and he indulges me in other ways, I'm fine with playing along. He doesn't like to slap me or anything (not to kink shame, to each their own), he's just into manhandling a bit. He's just very strong and very athletic, and he likes to utilize that during sex. \n\nI don't have anyone to stay with outside of some friends, but due to COVID I don't want to put them at risk or not socially distance, so I have some options to think about while I stay at home with him.\n\nThank you for all the help you've provided!",
                    "score": 662,
                    "author": "ThrowRA1668",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk where you are, but my OBGYN is not allowing anyone to come into the appointment with you due to COVID. I was there today actually and saw a few men sitting outside the office because they won't even allow them in the waiting room. Even if this isn't the case with your office, maybe you could use that excuse.",
                            "score": 652,
                            "author": "sexy_corpse",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "On your question about how you would go without him: I am currently pregnant and many practices are not allowing partners to attend appointments due to COVID. Even if your practice does, this would be a plausible reason for you to attend without him.",
                            "score": 227,
                            "author": "globewanderess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same here. 25w pregnant and my husband hasn't been allowed in any of my regular appointments - he's not even allowed in the waiting room and has to sit in the car if he comes.",
                                    "score": 85,
                                    "author": "TrustyBobcat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You are welcome. Others have already offered good suggestions regarding leaving home for an appointment. I work in the domestic violence field and we have heard of many survivors finding creative ways to safely leave home, including \"going to get groceries\" or going to a park, picking up meds, going for a long walk, going to help an ill family member, etc. and using all those as pretenses to seek help or medical care. Obviously if you made up an excuse to get groceries you would need to actually get them, and if you made up an excuse to visit a park, for example, you should plan out ahead of time what park it could be and what you \"did\" there.\n\nAlso, telehealth visits are an option as well, though I know in-person is more ideal. You could possibly do a telehealth visit via phone at a park, in your garage, in a private place at a store, etc.\n\nIn addition, what u/globewanderess shared is true. Some clinics and hospitals are only allowing the patient in for appointments and no one else due to COVID.\n\nI am glad as well that your sex life has been fully consensual. I just wasn't sure whether it was something you made yourself engage in or whether he pressured you at all, so thanks for clarifying.\n\nAlso, another resource that may be helpful is this [COVID-19 domestic violence safety plan put together by survivors, for survivors](https://sanctuaryforfamilies.org/safety-planning-covid19/) specific to safety planning strategies during a pandemic.\n\nGood luck!",
                            "score": 402,
                            "author": "Ebbie45",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You can go to the doctor alone if you just tell him you're going to Target or grocery store, grab something on the way home so it's plausible.",
                            "score": 238,
                            "author": "sxyazn"
                        },
                        {
                            "level": 2,
                            "comment": "You can try telling him that you have to attend OBGYN appointments alone due to COVID-19 restrictions. That's actually true in a lot of places even if it's not necessarily true where you are.",
                            "score": 48,
                            "author": "seedypete"
                        },
                        {
                            "level": 2,
                            "comment": "Tell him that the doctor’s office, BECAUSE OF COVID, is not allowing additional family members for your visit. This should be believable because it is the policy at a lot of (?most) places including the hospital where I work.",
                            "score": 21,
                            "author": "j_ivy3"
                        },
                        {
                            "level": 2,
                            "comment": "When you go to the doctor and are at the front desk checking in, you can slip them a note asking to speak with you alone?",
                            "score": 57,
                            "author": "generic_eve1991"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe tell him that he can drive you there but can't go inside because of COVID",
                            "score": 19,
                            "author": "ciaoravioli"
                        },
                        {
                            "level": 2,
                            "comment": "You could always say it’s a regular GYNO exam, so you don’t want him in there. I think that’s reasonable since it’s not baby-related, but more about your vagina, cervical cancer, STIs &amp;/or STD related.",
                            "score": 15,
                            "author": "ssnowangelz"
                        },
                        {
                            "level": 2,
                            "comment": "I think the fact that he would be suspicious if you asked to go to the doctor alone is a red flag, OP. My husband would never find my request for privacy with my doctor suspicious. He might be curious why, but it would go no further than that. \n\nYou need to seriously look at his behaviour going forward with a critical eye. What you have described is not normal.",
                            "score": 82,
                            "author": "someonessomebody",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;He wants to do everything with me related to the baby, including all doctors appointments--he's very happy and excited. \n\nIf this is in the US, you tell the front desk he is not allowed to come in.\n\nIf you are afraid of  doing this in front of your husband, then I think we need to raise the red flags a bit higher.",
                            "score": 76,
                            "author": "SingleDadGamer",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "For the sake of your mental health, I think you should go to the doctor without him. Otherwise, you'll never fully figure this out without him in your ear the entire time.\n\nAlso, why would your husband have sex with you knowing how you are while on the medication? Knowing your memory isn't so great while on it? Knowing you don't enjoy it? If he's in such a need to ejaculate, he has a hand.\n\nGood luck and please be careful.",
                            "score": 20,
                            "author": "FemShepForRealz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Given the time frames stated, it is very possible that you got pregnant the last time you guys actually had sex with each other. Doctors are only guessing when they tell you how far along your pregnancy is. \n\nAlso, do you really think it's in your best interest to have a child if you are taking medications that make you completely dead to the world?\n\nEither way, counseling seems needed here.",
            "score": 76,
            "author": "Namasiel"
        },
        {
            "level": 0,
            "comment": "I don’t know what medication you are on, but I used to be prescribed Ambien, and sometimes I literally would not remember having sex at all. My boyfriend would tell me the next day we had sex and I would have no recollection. For me, I was okay with that, because I told him ahead of time that it is okay to have sex with me while on Ambien. But before I told him that, he wasn’t okay with us having sex while I was on Ambien. Unless you have had a specific conversation with your partner about consenting to sex while on sleeping medication or even consenting to sex while sleeping (some people have this kink) than what he did is NOT okay.",
            "score": 88,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Info: when did you start with this medication exactly? Dates for weeks on pregnancy aren’t always exact put are very close estimates. We ovulate differently deep ending on our cycles. Most woman have have 22 day cycle or whatever it is. I personally have a 31 day. I also dealt with irregular period when not on BC so it was a pain then too...outside of that depending on when you started taking your meds, and when the last time your had sex...if they are sometime close...plus it effects your memory, this may be something you want to talk with your doctors about before you accuse your husband of this. An accusation like this could put a huge strain in your marriage when you are both already dealing with a lot. I totally understand why you would want to make sure though! You always want to feel safe and have the right to. \n\nCongrats on the pregnancy, and I hope everything works out for the best!",
            "score": 23,
            "author": "njx6"
        },
        {
            "level": 0,
            "comment": "My OBGYN is not allowing any visitors at appointments. Husbands are not allowed. You can use that excuse if you want; it’s very common around the US right now.",
            "score": 75,
            "author": "lilmil92"
        },
        {
            "level": 0,
            "comment": "How people acting like it’s a sign he was guilty that he was angry. It’s all perfectly normal if even for the most patient person to be angry if, I don’t know, the person you love accused you of RAPING them in there sleep. I don’t know if the man did it or not but let’s not immediately jump to conclusions.",
            "score": 76,
            "author": "mstate32",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, some psychologists have argued that you're most likely to be angry when you're not lying because of the shock / being disgusted by the fact that someone accuses you of doing things that you would never do.  Of course, it might also be a sign that he got caught lying and he's trying to turn the tables. But people need to stop acting like being angry is a sign that someone is lying.",
                    "score": 21,
                    "author": "arj347"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you know you are 5 weeks pregnant? What kind of tests did the doctor do?",
            "score": 59,
            "author": "spugzcat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was wondering if there could be a mistake on dates, too. Maybe I'm just wishing for the best solution.",
                    "score": 38,
                    "author": "Lena0001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They can usually be off by the dates by weeks. It will change a couple times during pregnancy. I found out my first was 3 weeks more than what was first predicted. So my due date changed. I would be 100% before cutting ties with spouse.",
            "score": 31,
            "author": "Scnewbie08"
        },
        {
            "level": 0,
            "comment": "It's insane seeing the amount of comments saying that she should consider aborting and running away, she's made it clear that she wants the baby, it's honestly kinda rude to keep telling her that.",
            "score": 40,
            "author": "ValiantCharizard",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Having been with a husband who used to take advantage of me while I slept. That's exactly what it sounds like to me. But double check with your Dr about the memory issue. I ended up sleeping in my daughter's room to keep him from having sex with me while I slept after he wouldn't respect my boundaries to not do that to me. Didn't matter that I slept on the floor next to my daughters bed. I just felt safer to sleep there as he wouldn't come in there to try anything. I found out much later in life that it is considered marital rape since consent can not be given.",
            "score": 288,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm really sorry to hear you had to experience that. You deserved better.\n\nBefore now I'd never even heard of marital rape. I'm unfortunately learning a bunch of things right now that I never knew existed before.",
                    "score": 177,
                    "author": "ThrowRA1668",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy fuck. That’s intense. Are you supposed to be having those reactions to the medication? Like is that normal to be completely passed out? Also, him joking about having sex with you while passed out is very scary. I would ask him again. I would say you don’t understand how you could be pregnant because you haven’t had sex in the past 5 weeks. Don’t let him make you think you’re crazy or misremembering",
            "score": 155,
            "author": "blauve",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm definitely in the minority with the severity of my reaction to the medication, but even with what it does to me sometimes, it's still the best option for my treatment. \n\nThe thing is, when he was joking around about having sex with me when I slept, it never came off as outright creepy. I mean, the idea is creepy, but he never sounded creepy or sinister or anything like that. It was always playful and with laughter. He never made me feel outright uncomfortable and I thought we were just joking. \n\nWhen I confronted him it didn't seem like he was attempting to gaslight me about the dates not matching up. He seemed sure I was misremembering because of my medication, but I absolutely know we did not have sex 5 weeks ago. At least sex I participated in.",
                    "score": 116,
                    "author": "ThrowRA1668",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Being five weeks pregnant DOES NOT MEAN SEX FIVE WEEKS AGO. It means a doctors guess based on your last period. You easily could have conceived the cycle prior. It’s very upsetting that this wasn’t explained to you.",
                            "score": 44,
                            "author": "cakeycakeycake"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 134,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want to add to this that semen can still be active 5 days after sex, with the potential to impregnate. She knows they had sex 8 weeks ago but the doctors rough estimate is 5 weeks. I mean the timeline is so close the people jumping to conclusions scare tf out of me.",
                    "score": 20,
                    "author": "jraw692"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also.... double check your home carbon monoxide levels? Just to be sure that’s not adding to confusion and nausea. Unlikely but worth a mention.",
            "score": 62,
            "author": "snowboard7621",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think you have already talked yourself into thinking he has done this terrible thing. You said in your post “what my husband did”. \nThe pelvic discomfort may have come from sleeping through needing to urinate for too long. The pregnancy may be further along than anticipated. At five weeks you likely havnt had a confirmation scan, just a blood test. The hcg levels in your blood drop the further you get along in pregnancy, so bloods aren’t always accurate. You may also have had sex in your sleep where you presented as being fully alert to your husband and were not actually awake. \nThis is a pretty big thing to accuse someone of. I’m 100 per cent not victim blaming but there are so many variables here that could mean he is completely innocent and you might destroy your marriage by accusing him. \nPerhaps set up a secret camera to record. Chances are if he has done this terrible thing, then he will do it again and you will see it on camera. You may also need to prepare yourself that you are doing things as well without knowing and that’s a whole brain bend on its own. \nCheck in with your doctor regularly as your medications may also affect the foetus. Insist on dating and welfare/monitoring scans for the foetus. \nSource- Am a nurse who used to work in a fertility clinic. We got many people through the doors who were well further along than anticipated because they went for bloods and not scans. Also, ex husband was on a sleeping med and he got up and drove, cooked, had sex all while fully asleep and had no memory of it.",
            "score": 29,
            "author": "9300fathoms"
        }
    ]
}