{
    "id": "iperqj",
    "score": 43396,
    "title": "UPDATE: My (40m) ex wife (40f) wants me to be with her in her last days",
    "author": "throwRA-extyz",
    "date": 1599653837.0,
    "url": "https://www.reddit.com/r/relationship_advice/comments/iperqj",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/relationship_advice/comments/ieage6/my_40m_ex_wife_40f_wants_me_to_be_with_her_in_her/?utm_medium=android_app&amp;utm_source=share"
    ],
    "postText": "Link to my first post: https://www.reddit.com/r/relationship_advice/comments/ieage6/my_40m_ex_wife_40f_wants_me_to_be_with_her_in_her/?utm_medium=android_app&amp;utm_source=share\n\nQuick recap: My ex wife, who Ive known since I was 10, cheated on me but is now dying and wants me to be around before she dies.\n\nIt's been almost 3 weeks since I've posted and a lot has happened since. I got some solid advice from a lot of you guys, especially some who messaged me their personal experiences. I'd like to thank you guys from the bottom of my heart. \n\nSo here's what happened... \n\nAs many of you guys suggested, I talked to my wife. We had a long discussion about the whole situation and I assured her that no matter what, she is and always will be my first priority. I also assured her that while I wanted to say my good-bye, I would never act like her husband. It would be more like me seeing a childhood friend or something like that. I also told her I would never spend the night nor would I be alone with her. \n\nShe was more comfortable after our talk and was pretty ok with the idea of me seeing my ex again. As you guys guessed, she really felt like she was forced into being ok with it when my sister asked but this time, she really was ok. \n\nSo I talked to my sister and after a long, long heated discussion about what my \"role\" would be in the visit, she agreed to the boundaries my wife and I set. \n\nA week later my sister and I came over to our old marital home. It was surreal cause while the emotions from years before came back to me, I didn't feel any sadness nor hatred or anything negative. I saw my ex, who was waiting for us in the living room and she cried when I walked in. Most of you suggested she was faking it but while she was still strong, you could tell almost immediately something was wrong with her. I indulged her with a hug and we talked for a few hours while my sister made lunch. I showed her pictures of my kids and told her stories about what they're like. Honestly, I didn't know how I would react after I saw her again but it just feels like seeing an old friend you haven't seen in a long time. There was no hate or anything like that. \n\nI walked around the house and it was pretty much the way it was when I left over a decade ago. Im not really sure how I feel about our wedding photos still framed and pictures of us still all over the house but it wasn't really my place to say anything. \n\nThe three of us had lunch and played board games all afternoon. It honestly felt like we were back to when we were kids and the three of us would hang out together. It was nice. \n\nI left at around 6. She was sad but she understood. When I hugged her good-bye, she whispered \"I love you\" to me but then said how she's happy I was able to find the happiness she couldn't give me. That part got to me to be honest and I was fighting back tears. I told her I'd see her again soon and she asked if I could bring my kids next time. I told her I would and left to pick up dinner for my family. \n\nI told my wife everything that happened and she was quite happy about the outcome. I guess it helped that I brought home her favorite food but she also agreed to let me bring the kids next time. \n\nOverall, it was a great experience seeing her again. I feel like I needed that and would've regretted not doing so. \n\nAgain, I'd like to thank everyone who gave me advice. Also, please don't roast my ex too much. She made a mistake and paid the price but it doesn't mean shes an evil person. \n\nThis will be my last update. Thank you very much, reddit.",
    "comments": [
        {
            "level": 0,
            "comment": "You should thank your current wife.  Flowers, card, something for being strong enough to handle it.",
            "score": 5646,
            "author": "Orange_Adept",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1196,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think for the children it would be more like visiting their aunt's best friend, and nothing more because they're so young.",
                            "score": 247,
                            "author": "ciddlefush",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 239,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I actually hadn't thought of it like that. That does make it a bit weirder bringing the children over with all the photos still up. Perhaps taking them down first?\nOP and current wife have made it abundantly clear they're just old friends, so I don't see why it would be a problem for the ex-wife to take the photos down for a visit or two.\n\nThen again I don't have children and am not married, so I don't have much else to say.",
                                            "score": 95,
                                            "author": "ciddlefush",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She wants to roll play that they are her kids most likely.",
                                            "score": 35,
                                            "author": "meleeturtle"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The problem with having kids around dying people is that it can seriously effect them. My grandpa was dying and my parents wanted me to say goodbye, I was about 10 and didn't really understand the concept of death. But I did understand the fear in his eyes, him struggling to breath and him begging a hallucination of his mother to let him live and how he didnt wanna die and wasnt ready.\n\nNow that was terrible for me, I realized about 10+ years after what that actually did to my mental health, I have PTSD which I have been working through but its been real rough. I just wish I could feel like I am immortal like other young people my age (early 20s) but my mortality is a constant thing in my head, and a lot of the times it takes complete control of all of my thoughts.",
                                            "score": 15,
                                            "author": "Reddituser8018",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Exactly. Plus she even said it’s all because ‘’she wanted to feel like my wife again’’. I mean there’s being respectful to a dying woman, whereby the adults have decided, then there’s indulging a fantasy (the photos)  &amp; bringing your kids (who can’t make an informed decision), into the equation. Jeez!",
                                            "score": 5,
                                            "author": "crippled_lucifer_"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "have y’all never had an amicable break up? someone you used to love and was a big part of your life is dying and you can’t bring yourself to spend a last moment with them because of your current relationship? \n\nthat’s weird to me but i also only have one ex and there was no cheating involved.",
                            "score": 135,
                            "author": "chief_keish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have been cheated on twice and I actually never felt that searing eternal hatred that everyone associates with it. Yeah sad, betrayed and heartbroken but I didn't hold on to it. I just think of it as we are not the right person for each other anyway, so it actually worked out in my favour because I get to move on. After many years, I honestly wouldn't mind having a drink with them and discuss it with hindsight we have now.",
                                    "score": 46,
                                    "author": "breakupbydefault",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have been cheated on twice too and I have no ill will towards neither of those men and I am friends with the sister of one of them still so I see him occassionally, everything civil and normal. However, if my husband cheated on me I am sure it would take me years to recover from that if ever. He is my closest confidant, my best friend, our finances are intertwined, our circles of friends overlap a lot, we share a pet and kids might happen later too. I am sure he feels very similar. I can't imagine hurting him that way and being able to see myself as a good person after.",
                                            "score": 6,
                                            "author": "bienebee"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "On reddit, cheating is akin to raping and murdering toddlers: it’s unforgivable and no amount of regret, love, or forgiveness matters. The person may as well kill themselves because they’re irretrievably broken and worthless.\n\nIn the rest of the world, shit happens. Hell, in many cultures outside of America, having extramarital relations is *expected and normal.* No, not “because misogyny.” Because of complex human behaviors. It’s almost like there isn’t only one righteous and perfect moral code that all humans must follow from the beginning of time until the apocalypse...\n\nNope. I’ve never cheated on anyone. I had a boyfriend cheat on me once. I don’t think he’s a horrible person. I think our relationship had other problems and we remained friends after breaking up. \n\nI recommend listening to Esther Perel’s podcast for a more nuanced understanding than the one presented by modern American society.",
                                    "score": 75,
                                    "author": "sk8rgrrl69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In general, and at least for me, it's not about cheating itself. It's about honesty and trust. Regardless of how you may feel about it individually, for most people, when you marry someone, you are effectively making a promise. In many cultures (specifically Catholicism or similar), it's not even effectively, it's literally. You're promising to stay faithful and true, and you're making that promise of your own free will, to someone you have chosen. I absolutely agree that the Western insistence on Catholic style marriage practices is silly, but if you agree to something with someone you claim to love, and then go back on your word, that's on you, not on the general culture that led to that promise.\n\ntldr: Cheating isn't bad because it's having relations outside of your marriage, it's because you're breaking a promise (explicit or implicit) to someone you say you love.",
                                            "score": 32,
                                            "author": "Aendri",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Specifically Catholic countries are ones where infidelity is the most normalized. I was raised Catholic. It’s nothing to do with religion and everything to do with the culture.",
                                                    "score": 12,
                                                    "author": "sk8rgrrl69",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Current wife is honestly something else. WTF how can someone be this perfect.\n\nI wouldn't have allowed that tbh.",
                    "score": 140,
                    "author": "soliz_love",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not even when the person is terminally ill? Sometimes I think we forget the person we’re with had a life before us, and it doesn’t mean they can’t be cared for when knowing they’re dying. I agree that under normal conditions, no visit, no way! But when the final days are approaching, it would make sense to let it go and allow closure for the one dying. Consider being compassionate and understanding of the one dying. Just a thought; we all have our own tolerances. Life events, such as watching a family member slowly die of cancer can change how we think.",
                            "score": 182,
                            "author": "Welcome2Bonetown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the person is referring to the Ex’s wants and requests. If you read the original post, ex wanted OP to be her husband again during her last months. Physical contact and all. Totally disregarded and disrespected OP’s current wife. \n\nJust because you’re dying doesn’t mean you get to have everything you want. \n\nSo try again, if you were OP’s wife knowing his ex requested your husband to go act like her husband again. Would you be okay with that? It’s up to you if you are or not... everyone has different boundaries and relationship dynamics. \n\nI would not be okay with that as a wife.",
                                    "score": 102,
                                    "author": "WellyJellyBelly",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As you noted in the OP, you were over the marriage.  No reason not to be there for a friend.  I'm glad you went through with it.",
            "score": 9399,
            "author": "joe-dirt-1001",
            "replies": [
                {
                    "level": 1,
                    "comment": "I honestly have no idea how I would have handled a situation like this. But OP has done this admirably.  I’m glad things have worked our so well.",
                    "score": 1523,
                    "author": "incenseandelephants",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree.",
                            "score": 175,
                            "author": "joe-dirt-1001",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 125,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Moral grayness is a hard concept to understand",
                                    "score": 5,
                                    "author": "TheFakeSlimShady123"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah this whole situation is rough and a mess. No idea what the \"right\" answer is, but sounds like OP and his family are doing a great job.",
                            "score": 27,
                            "author": "TheSilverFalcon",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly. It would be different if there were lingering feelings on OP's part, but I think this is possibly the best outcome. Everyone seems to be handling this with maturity and grace. I sincerely hope the for the best for everyone in this situation.",
                    "score": 85,
                    "author": "AcidRose27"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My goodness, what a good outcome. I.. might be crying a bit over here.",
            "score": 3860,
            "author": "SweetDangus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? OP sounds like such a kind human.",
                    "score": 725,
                    "author": "andandandetc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who is cutting onions right now?",
                            "score": 233,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's just allergies, I swear!",
                                    "score": 106,
                                    "author": "sh4dowed",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That's me, sorry. I'm making sushi.",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry not post related but... Who tf puts onions on sushi??",
                                            "score": 78,
                                            "author": "bunsiescheeks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm a bad cook.",
                                                    "score": 83,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I lived in Japan and they do put onions on sushi - especially the salmon guacamole ones that you’ll find in Japan’s version of fast food sushi restaurants 🍣",
                                                            "score": 35,
                                                            "author": "Rimini201",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's validation I don't think I wanted lmao.",
                                                                    "score": 27,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ha ha ha! I did say it sort of tongue in cheek!!",
                                                                            "score": 5,
                                                                            "author": "Rimini201"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah man, seriously. I have a Zoom meeting for work in like 10 minutes and I'm pretty damn emotional right now over reading this. Jfc.",
                    "score": 102,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I think what makes it better is that if you look at the OP all the top comments are “DON’T DO IT!!” I’m glad that this guy was able to be there for this woman as a friend without the world ending like people were thinking.",
                    "score": 66,
                    "author": "Cheese464",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I try to think of how I'd feel if I were in their shoes. \nImagine how hard it must be to be dying &amp; ask your ex (who you hurt) to be with you in your final days. \n\nThat's some of the saddest stuff I've ever heard. I can't imagine.",
                            "score": 43,
                            "author": "arielleassault",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is a really bittersweet story, like 99% bitter. Sounds like she was truly sorry, and it really was a mistake. I understand why he left, and I would've too. But she spent the rest of that time hoping he'd change his mind, waiting for him to come back. Now she's dying, and he's happily had a family since, and all she wants is her soul mate back. It reads like a scorned lovers ultimate fantasy, but when actually realized, it's just sad.",
                                            "score": 37,
                                            "author": "mrdubbz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thats what hit me so hard about this. Ive seen revenge stories on cheaters where their lives, reputation, financial stability, etc. get destroyed and felt good about it. So when I started on this one i was expecting more of the same, but by the time I got to the end I just felt this deep sadness in the pit of my stomach. \n\nI hate cheaters, i find the lack of respect for your partner disturbing and I dont think I've ever considered the instances to be legitemate \"mistakes\" like they so often claim. This is perhaps my one exception. I genuinely, really feel this only happened the one time and she genuinely realized how bad she fucked up, and the fact that she had the balls to tell him I do respect. This actually destroyed her, but not in the violent explosive sense, the quiet sad and pathetic sense. So pathetic I legit feel bad for her.\n\nAll that said OP still had every right to leave her and should feel no responsibility toward her, she still made her bed.",
                                                    "score": 7,
                                                    "author": "Longjumping-Voice452"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In some cultures, when you’ve got a terminal illness, doctors don’t tell you: they tell your family and allow your family to decide whether or not to tell you the prognosis. In those cultures, without the knowledge of death imposing on life, patients report higher qualities of life (less depression, less stress, for example) than patients with similar diagnosis and prognosis in places where they are fully informed. Patients also tend to live longer in the former. \n\nMeanwhile, there are people like Jon Kabat-Zinn who found that patients who learn mindfulness meditation also report higher quality of life and have longer lives despite terminal diagnosis. \n\nWhat some scientists and doctors believe is that the mind has the ability  to drive the success of treatment or the damage of disease. This isn’t saying “you can will away a terminal disease” but more “your mindset can help your body by way of hormones” or ‘your mindset can create additional havoc by way of hormones.” \n\nWhen I imagine spending my life in a living mausoleum of the one great relationship I had, knowing that I ruined with it cheating, it feels absolutely crushing. \n\nTen years. Ten years of looking at your photos, remembering the life she had and threw away. An entire lifetime of a relationship, ruined. Here, in the last months her life, the thing she wanted most was to be able to have new memories with you. \n\nSurrounded by daily reminders of her mistakes, knowing how she hurt you, and being so close to how you have a life she wanted (even if she is the one who messed it up) so much can’t have been healthy. \n\nI applaud you for putting the relationship you had with your friend over the negativity she caused as your wife in order to practice  empathy. it’s a great tribute to the relationship you have with your current wife that she understood and feels comfortable enough in your marriage to allow it.",
            "score": 1488,
            "author": "xtlou",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is a great movie about a family whose grandmother has a terminal illness, but the family decides not to tell her. At first, the idea of not telling someone they have a terminal illness seemed totally unethical to me, but after seeing the movie, I have a different perspective. \n\nThe movie is called The Farewell.",
                    "score": 310,
                    "author": "Marvena0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Funny story: my favorite example of this when I’m talking to my clients and trying to encourage them  was a story I heard on NPR’s This American Life, which is what The Farewell is based on.\n\nhttps://www.thisamericanlife.org/585/in-defense-of-ignorance",
                            "score": 96,
                            "author": "xtlou",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Also I heard that the woman learned of her terminal illness years later after the movie came out. Like she’s still alive",
                            "score": 30,
                            "author": "rythmicbread",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow. What a crazy life!",
                                    "score": 4,
                                    "author": "Marvena0"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This was a GREAT movie. Everyone reading needs to check it out.",
                            "score": 6,
                            "author": "Apeckofpickledpeen"
                        },
                        {
                            "level": 2,
                            "comment": "There is also a bittersweet Christmas movie from years ago called, \"The Gathering,\" which starred Ed Asner as a man estranged from his family and he finds out he is dying.  While about closure, forgiveness and reconciliation, I don't remember it every going sappy or syrupy.",
                            "score": 4,
                            "author": "White_Terrier"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just absolutely grief stricken is how I feel about this. The crushing remorse she’s had for all these years. I can’t even process this right now it’s too much. Reminds me of my ex and what we had",
                    "score": 126,
                    "author": "Nblearchangel"
                },
                {
                    "level": 1,
                    "comment": "Amazing that they made a movie about and she still doesn’t know that she is sick",
                    "score": 72,
                    "author": "LegacyofaMarshall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The movie is a fictionalized version of a real story, which happens to be one of my favorite examples of this concept, in fruition. I first heard about it on This American Life:\n\nhttps://www.thisamericanlife.org/585/in-defense-of-ignorance",
                            "score": 36,
                            "author": "xtlou"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I really love this response. Very well explained",
                    "score": 12,
                    "author": "Blue_Shadow__"
                },
                {
                    "level": 1,
                    "comment": "So perfectly stated!!!",
                    "score": 11,
                    "author": "scoobynoodles"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I began to think of houses as mausoleums when a friend’s wife died. Time moved on and he remained living in her dream home, surrounded by the paint she chose, the curtains she made, with every dish and spice where she decided it should be stored. A year or so later, he moved his girlfriend in and she complained that she didn’t feel like she was in her home, but more like she was visiting a relative. He wouldn’t let her change anything. This went on for several years. I realized it was a giant memorial and she was living in it. Even the calendar on the wall was set to the month when the wife had died. \n\nThere was something about OP’’s story of his exwife leaving the house exactly as he’d left it while she sat by and died that make me think of it, of how much a tortured existence it was, but it was what she chose for herself. \n\nUltimately, we may make really bad mistakes and hurt people around us. In a perfect world that wouldn’t happen. In a closer to perfect world, though, we see what we’ve done and work to never repeat our actions. The realization, the working towards being better, and the follow through are probably as close to that perfect world we can hope for.",
                            "score": 43,
                            "author": "xtlou"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Goosebumps reading your reply and this entire post in general. \n\n\nI want this situation turned into a movie and a spinoff sequel told from the ex wife's perspective. Lots of lessons in this tale. It would really teach others about compassion's place within complex decision making, the importance or family, fidelity, trust, we can go on and on. Wow.",
                    "score": 4,
                    "author": "Give_AkiraYamaoka_SH"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Made me upset that everyone was responding that you shouldn't do it because \"there wasn't anything in it for you.\" Thanks for doing something anyway OP. It was a nice thing to do and brought a dying woman some happiness.",
            "score": 8066,
            "author": "Airrfit",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1688,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a gamble he took. I would not risk the wellbeing/satisfaction of my current wife and kids because of somebody from the past. Nevertheless.. Respect !",
                            "score": 280,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The wife said she was ok with it though. Idk, I would never date a women who says \"I'm ok with x\" then gets upset when I do \"x\", that sounds awful.",
                                    "score": 176,
                                    "author": "MajesticMaple",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Life isn't that simple. Well, initially it is - and you can weed out the batshit crazy people.\n\nHowever, life gets complicated.\n\nThis could be one if those situations where you say \"Ok\" and then later have regrets.\n\nHowever, it is more common as you get older to say \"Yes\" to something not really thinking about it - and then later have unexpected bad memories from childhood or other things get triggered  \"as a result\" of having said Yes.  \n\nLife is busy. We don't always think thru every consequence. \n\nBut yeah, definitely a good thing to avoid if you see it happening while dating. No self-reflection is bad in a partner.",
                                            "score": 142,
                                            "author": "VanillaCookieMonster",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The wife said that when the sister asked, she felt pressured to say she was ok with it even though she wasn't. Not everything is a clear cut case of agreeing or not agreeing in an emotional vacuum, and when there are a lot of external factors (what the family wants, not wanting to seem like a bad or selfish person, someone your spouse cared about dying), it is absolutely the right thing to do to talk these things out instead of asking for an answer right away.",
                                            "score": 48,
                                            "author": "Thecatswish"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He says in the post that his wife felt forced to feel \"ok\" with it when the sister asked.",
                                            "score": 73,
                                            "author": "Archangel_TS",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was concerned since it seemed like the ex really wanted to simulate something that didnt exist and that OP may do something he regrets, but the way he described it seemed much more like catching up then emotionally cheating on his wife\n\nI never thought he SHOULDNT go, just that ground rules needed to be set",
                            "score": 7,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd strongly disagree that there's nothing there for him, it can be very cathartic and as OP said, it's like meeting an old friend and bringing them joy on their last days. That in it self can be very healthy for someone's mind and I think that can even strengthen his current marriage when his wife sees how caring, loving and compassionate her husband can be.\n\nDon't know if this made any sense, English is not my first language :D",
                    "score": 91,
                    "author": "Alttiss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Don't know if this made any sense, English is not my first language :D\"\n\nYou use it well.",
                            "score": 26,
                            "author": "PiersPlays",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Not to mention healing a part of his past that remains raw and open could allow him to be a better husband and father in his present and future. That’s what’s in it FOR HIM.",
                            "score": 18,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 332,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This sub is filled with edgy kids with very little real world experience, which is why it's so hilarious to watch people ask for advice here.  Legit children here pretend to be worldly adults, and you're surprised they're selfish and ignorant?  Every day it becomes even more obvious to me how few people here have lived... at all. They're living off of after school specials and shitty movies. What they *think* real relationships are like.   The fact anyone is surprised by this is shocking. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n/u/1sagas1 said it best. \"Reddit is filled with children  so it's not surprising \"",
                            "score": 203,
                            "author": "CBTomatoes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is why I wont be posting my problems on this sub. Some of the responses can be hateful, and this just encourages more followers, and zero objectivity. Absolute shit show.\n\nFair play to OP. Its hard to know what is right. It's a wholesome outcome too.",
                                    "score": 21,
                                    "author": "DataSomethingsGotMe"
                                },
                                {
                                    "level": 3,
                                    "comment": "A good indicator of the general audience of a sub is going through \"new.\" AITA new was mostly highschool drama when schools were in. This sub is mostly late teens/early 20s going through the growing pains of learning relationships. My problems are way above their pay-grade.",
                                    "score": 6,
                                    "author": "raven12456"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m migrating over to more 30+ subs because of this. It’s too obvious that teenagers and early 20s are giving marital advice like they know anything about it, and I get downvoted whenever I acknowledge any shade of grey amongst the black and white responses. It’s super clear in parent/kid relationship posts who‘s only seeing it from the kid’s perspective and who is seeing it from the parents’. \n\nCome on over to 30+ subs, they’re great even if they’re a bit quieter.",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm actually a new person here and I don't know any reddit history, so I'd be quite interested to hear your stories sir",
                            "score": 29,
                            "author": "popupro21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Reddit Lesson #1: People exaggerate, dehumanize, and often don't care to actually understand each other. It's tempting to fall into that same behavior (ask me how I know...), but try not to. I think it's ultimately destructive.\n\nHolding libertarian ideas doesn't necessarily mean that somebody is a heartless wretch, as described here. I don't doubt that some people were being pretty heartless about this particular situation, but the labeling that's going on here is not helpful. I wouldn't straight label myself a libertarian (there's a lot of baggage that comes with any label), but I do have some libertarian beliefs for sure, and wouldn't describe my beliefs as \"fuck you, got mine\". Personally, as somebody who is \"pretty libertarian\", I found this story to be quite heartwarming. Choked up a little bit and all. Because some of us do actually have hearts, you know.",
                                    "score": 25,
                                    "author": "BlackDeath3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lesson no. 1 has been learnt from amino around 2 years ago",
                                            "score": 4,
                                            "author": "popupro21",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; And then I realized they are alive and well in relationship\\_advice and amitheasshole.\n\nMost definitely.",
                            "score": 30,
                            "author": "hdmx539",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " Just joined those subreddits to read the comment threads to past time",
                                    "score": 6,
                                    "author": "Xivanax",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And conspiracy, and actualpublicfreakouts (anything with \"actual\" in the name)...",
                            "score": 13,
                            "author": "itsacalamity"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "While I completely agree that the \"there wasn't anything in it for you\" was very inappropriate, the original plan was him to be basically the husband for a while, which is way different than spending an afternoon with an old friend who happened to be his ex wife.\n\nThe original plan and the pressure put on his current wife made everyone tell him to not do it. \n\nBut with boundaries set in place, I think OP did the best possible action by seeing his ex wife and old friend, well done !",
                    "score": 31,
                    "author": "Gyle13",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "A lot of people don't understand how love can be so selfless, how it needs to be, sometimes.\n\nLove comes in many forms and I think OP got it right by coming as the childhood friend and not the ex.",
                    "score": 22,
                    "author": "ExtraLucky13"
                },
                {
                    "level": 1,
                    "comment": "This. One of the top comments in the other thread said how little was in it for you. What a limited view on the world, proven by this outcome. Giving someone happiness, having closure, spending time with old friends is so much to gain.\n\nI agree that it was a risk and it could have been different, but, OP, you are a great person, and I think both your wife and your sister and even your ex are great. People make mistakes, but people also sometimes change, show regret and remorse. You made someone happy that day!",
                    "score": 54,
                    "author": "CardinalHaias",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Of course they responded like that. Reddit's hardline, life is black and white teenagers with no significant others always  know best.",
                    "score": 22,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Reddit is filled with children so it's not surprising",
                    "score": 41,
                    "author": "1sagas1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Felt the same, in the original I wrote a comment that he at least should give it a try and just talk to her and I was downtvoted and insulted over that...\n\nSo OP it makes me happy that you were able to resolve this, with a good feeling for everyone. You sound like a wonderful person. Happy you didn't listen to all that negativity in your original post",
                    "score": 16,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's definitely the \"wants to feel like we're married again\" part that was weird here. Wanting to see someone from your past that you were close to for a long time? Makes perfect sense. Wanting some closure on a relationship that ended badly? Makes sense. But the whole wanting to be able to feel like you're still married? That's just sort of weird. \n\nIt sounds like what happened was much more normal than that, thankfully. Maybe a better way to put it is that she wanted to feel a sense of normalcy, in the way that she defined it for so much of her life? It makes me very sad for the ex-wife to think what small scraps she wants at the end of her life: to be able to pretend that a person who is openly not interested in her still is just for a moment. \n\nIt may be that leaving her childhood sweetheart was the right thing to do (he certainly seems much happier), but it makes me sad to think that she didn't go on to have better relationships in her life after that. It's a good reminder to learn to live with our choices, and make the most of the time we have.",
            "score": 50,
            "author": "undisguisedpinetrees",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why not bring your wife next time?  It seems like she can handle it and the ex can see how well y’all get along together.",
            "score": 739,
            "author": "tercer78",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 381,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Doubt she's up for walking into a house with wedding pictures framed on the walls of her husband and this other woman. Wonder how the kids will feel about this too.",
                    "score": 304,
                    "author": "azumi77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are a lot worse traumas for children to endure. While it would be an atypical experience, sometimes life is an atypical experience. I don’t see any problems with the kids being exposed to this.",
                            "score": 136,
                            "author": "queenoffingevrything",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it should be up to the kids.",
                                    "score": 20,
                                    "author": "prometheus867"
                                },
                                {
                                    "level": 3,
                                    "comment": "I agree. Almost no one _actually_ exists in a perfect fairytale rendition of a nuclear family. Families are weird and complicated. And kids get along quite fine, adapting to the complexities of it all. :)",
                                    "score": 60,
                                    "author": "PlatypusPerson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\nKids also will have a lesson: this is what you do for people in need. We are only as good as we treat and are treated by the people around us. An afternoon of kindness is not a high price for them in these circumstances, since she seems to have good boundaries.",
                                            "score": 79,
                                            "author": "gariant",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its so refreshing and nice to see more human responses here instead of the pseudo libertarian stuff given as advice.",
                                                    "score": 23,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm really concern about letting the kids around her tbh; she's dying so she literally have nothing to lose... people are way too quick jumping into the \"nothing wrong with it\" but are forgetting she's the woman who cheated on him, tried to mess with his relationship, wanted him to go live with her as her husband until she dies and now wants his kids around after being disappointed cause he's not gonna sleep there while whispering love confessions in his ear. Fuck that noise, I wouldn't let my kids close to someone that showed time and time again that she's quite selfish.",
                            "score": 38,
                            "author": "apinkparfait",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 162,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Do this maybe. Absolutely do not bring the kids. That's weird",
                    "score": 34,
                    "author": "Aeon1508"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 66,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But how is fulfilling a husband/wife fantasy and whispering in his ear that she loves him so the sister doesn’t hear not trying to make an inappropriate love connection?",
                            "score": 57,
                            "author": "MoJoMoon5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The husband/wife fantasy is something every party is aware of, including OP's current wife.  That's how this whole thing started. OP set some boundaries to discourage that and still met up with her.\n\nThe ex-wife wanted a more \"realistic\" experience but she isn't getting it.  She doesn't seem to have delusions that she is going to steal OP away.  Whispering \"I love you\" was too much but she's trying to relive a happy time in her life in her dying months, not rekindle a romance imo.\n\nTBH I wouldn't be comfortable as any person in this story... but it went about as well as it could have without anyone blowing up boundaries.",
                                    "score": 27,
                                    "author": "akatherder",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "^ Yes! I would also add that telling someone you love them when you’re dying isn’t necessarily about wanting or expecting that love to be reciprocated. It’s about making sure the people you care about know that they’re important to you and will always have a place in your heart and sometimes it’s about making sure they know you aren’t holding onto any anger or resentment or ill feelings towards them and letting them know you feel they are valuable, worthwhile, and deserve to be happy. It’s not about starting something new, it’s about closure and peace of mind.",
                                            "score": 19,
                                            "author": "Lostin1der"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kind of creepy about the wedding photos still being up in the old marital home though...",
                    "score": 8,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I was wondering about that..\n\nAs friends, it's rather strange she didn't invite the whole *family*\n\nThe pictures on the wall, her whisper, and I mean the fact that she refused to move on after so long and asked him to \"play house\" initially! \n(Which to me feels like a huge disrespect towards OPs current marriage..)\n\nMy inner cynic tells me she's wanting to continue the fantasy with the kids ..\n\nI suppose it might also be too much for someone like the ex to bear ,\nhopefully I'm just thinking too much into it...\n(and if the OP's wife is fine with it, no harm done)\n\n\nI dislike how it seemed OP was being pressured into doing something he obviously wasn't too confortable with..\n\nbut I'm really happy that it turned out well  for them in the end and that the childhood friends were able to have their closure!\n\n--\nThe importance of setting and respecting boundaries",
                    "score": 24,
                    "author": "Oatygarbage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me being a cynic wonders if he told the wife about the framed wedding photos and how she said she loved him. If he didn't and asked to bring the kids that doesn't sit well with me..",
                            "score": 13,
                            "author": "DisguisedAsMe",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone looking at the replies in the original post would know that this sub's most popular answers can be pretty terrible advises.",
            "score": 426,
            "author": "ToTTenTranz",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\^ truth. the advice in this sub is often very cold, selfish and close-minded. forgiveness is almost never considered. people brush away complex webs of relationships. I really wonder how mature the people giving advice on this sub are.",
                    "score": 259,
                    "author": "serpentax",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. A lot of the sound advice in the original post were heavily downvoted as well. I recently saw an AITA where a guy asked if he was being an AH for not sharing his hoodie with his gf, people hounded him to break up with his gf, and they broke up...over a hoodie (I guess?). Sometimes things sound worse over paper and there are situations that call to be harsh but sometimes that isn't the case, and people are a bit cold.",
                            "score": 68,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I replied to a post the other day on here. By OP's account the relationship was great but the boyfriend had been struggling with his mental health during the pandemic. First message \"huge red flag\". Astounding, really.\n\nhttps://www.reddit.com/r/relationship_advice/comments/inqzz8/comment/g498lhi?context=1",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man two years of relationship is something more than a fling. The responses are.. interesting",
                                            "score": 13,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think Reddit is at least half under like 22 or 23, so that might be a lot of what’s contributing to it. When you have some life experience, you pull yourself out of the black-and-white mindset so many young people seem to have.",
                            "score": 27,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Stupidity and immaturity are no longer limited by age. Reddit is full of shit.",
                                    "score": 5,
                                    "author": "hectorduenas86"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly. I mean for all we know a 17-year-old is giving a 35 year old marriage advice. I read the sub with the perspective that it’s a giant exchange of ideas and thoughts with people from different walks of life. Obviously it’s the OP’s choice ultimately and context is everything",
                            "score": 20,
                            "author": "TepidPen",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Something like 70% of redditors are between 16 and 25.\n\nSo something like 70% of the comments are from people with very little experience in long term relationships or marriages. \n\nSo something like 70% of the people voting on the comments are from people with very little experience in long term relationships or marriages.\n\nThis sub is great to read about drama, and possibly get a wide variety of views to consider. But thats all you should do, CONSIDER. Never take the anecdotal crap that people taut in here as some infallible truth.",
                            "score": 5,
                            "author": "chugz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm not sure I agree. Yeah, it happened to turn out well this time, but that doesn't mean that it wasn't just as likely, if not more likely to go poorly. (I'm not saying I know what the odds are of anything happening.)\n\nHad this all gone terribly, we'd all being telling op 'Told ya so.' And that would have been a post-hoc rationalization as it is now. \n\nWe don't operate with perfect knowledge, we can't see into the minds of these people. Heck, I'd say it can be difficult to articulate what's going on in your own head often enough, but maybe that's just me. There was a possibility that this meeting ignited old feelings about his partner. There was a possibility that his current wife felt strong-armed in this whole situation. I mean, who wants to be the bad guy that's gonna deny somebody their dying wish? \n\nIt worked out now, and it seemed to work well and I'm happy for OP. But in no way was this a sure thing. Perhaps the advice to not go see his ex was a bit heartless, but it was also in the effort to prevent the tanking of his current marriage and his most important relationships. \n\nI wouldn't know what I would have done in a similar situation when the OP posted this, and I feel like I can somewhat confidently say I still don't. This is way above my (and I would argue most of our) pay grade.",
                    "score": 18,
                    "author": "TrumpDaBuilder"
                },
                {
                    "level": 1,
                    "comment": "To be fair, the original post is full of red flags, some that are still present in this update. The main concern I saw from commenters is that he's risking damaging his marriage over someone he hasn't talked to in a decade. The way his ex \"never got over\" their marriage and the way his sister pressured him and his wife were both pretty concerning. It's very clear that his ex-wife didn't deal with their divorce in a healthy way and this meeting had every potential to go sideways, based on the info provided. I'm glad it all worked out for him, but I can't say the people who said maybe this was a bad idea were unfounded.",
                    "score": 48,
                    "author": "yeezusKeroro",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This whole sub is an example of the hive mind. It’s all benifiting OP and never a YTA situation. Sorting by controversial makes my day sometimes",
                    "score": 16,
                    "author": "AngryWhale94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you do visit again and show the ex wife the kids.. make sure you bring the actual wife so that she does not feel isolated.",
            "score": 48,
            "author": "timleykis101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, op is playing with fire. \n\nDying wish is great, he did it. Now he is literally playing with fire. \n\nBringing the kids is a horrible idea, and he should not do it. IF he decides to go back (shouldn't, imo), then he should 100% bring the wife. His ex fucking said, \"I still love you\" and has their old wedding pics on the wall. she never moved on and has been honest about this one thing. This almost certainly will be very traumatic for the kids and there is zero reason to bring them around her. she's going to try something ,if this is real. \n\nPeople like to make excuses, but when there are strong feelings like his ex has, and she has already proven to be untrustworthy and obsessed with op, he is reallllyyy playing with fire here. \n\nHe's gotta stop now, or he probably will get burned. either by his wife getting really upset and remembering this, or his kids being like wtf is going on, or worst case.. he could catch feelings and fuck up his great life he has going on.",
                    "score": 17,
                    "author": "Lyssa545"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it’s sad she’s stayed obsessed with you so many years and she hasn’t found love with anyone else",
            "score": 64,
            "author": "djam2391",
            "replies": [
                {
                    "level": 1,
                    "comment": "I find it funny she could stay \"loyal\" for 12 years after her split but not during her marriage\n\nAnd a month long affair isn't a \"mistake\"",
                    "score": 9,
                    "author": "william_wites",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s what I have a hard time understanding. She chose to have an affair, and when they split, she regretted it so much that she willingly stayed alone instead of finding someone new. Like if you’re gonna regret it that badly, don’t do it in the first place. Maybe it’s a hindsight 20/20 thing, just seems like an incredibly destructive choice, especially if that’s the outcome.",
                            "score": 7,
                            "author": "sdr79"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes she most definitely has some deep issues and mental health problems. If she was not suffering from a terminal illness, I think the best move anyone could have done for her was get her a therapist or maybe even a psychiatrist, so she can finally move past the relationship. Her being stuck on this and not moving on for over a decade is depressing as hell. She is definitely suffering from some sort of disorder of obsession or delusion. It is good that OP is giving her joy and humoring her during her last days while managing to compromise with his wonderful wife, he is a good man. A better man than most.",
                    "score": 6,
                    "author": "Naxugan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would draw the line with the kids. She wants to role play with you as her husband, and now wants to pretend your kids are hers it sounds like. She was super disrespectful to your wife in the past and is now. Dying is not a forgive-all sort of thing that justifies her wishes. I would have told her if she wanted to meet up, it could be a public place to get food or coffee. Your wife sounds like an angel but she’s a human being with feelings too. If she said something she’d look like the bad guy in this situation. Maybe she is okay with it but I doubt most people would be.",
            "score": 22,
            "author": "Jdog1805"
        },
        {
            "level": 0,
            "comment": "Glad this worked out, but don't bring the kids. Think about how weird and confusing that would be for them.",
            "score": 49,
            "author": "Apatheticforcredit",
            "replies": [
                {
                    "level": 1,
                    "comment": "It'll be really weird for them to see all the framed pictures of him around that woman's house, expecially the wedding pictures. It can be explained of course but it'll be really weird for them, I knew my dad had a first wife when I was a kid but I never met her or anything, the kids will likely have a bunch of questions after the visit.",
                    "score": 15,
                    "author": "tiffi_333"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for your update.\n\n100% I think you did the right thing",
            "score": 194,
            "author": "AusFrosty",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You went along with the ‘wanting to feel married again’ act? After so many years? After your marriage with another person? Why?\n\nAnd now you’re going to take your kids so she can play house and pretend you’re all a big, happy, loving family?\n\nYou’re not the slightest bit creeped out that your wedding photos are still up? \n\nYou’re either writing some wattpad story or this woman is obsessed and that one visit is enough because the more you feed her wishes, the bigger the fantasy she’ll create.",
            "score": 14,
            "author": "Maya-euphoria"
        },
        {
            "level": 0,
            "comment": "Why would you bring your kids though? Especially without your wife? Does your ex want to pretend they're hers or something?? Like I'd understand if she wanted to meet your family including your wife, but she doesn't, she wants you to bring your kids over. And think about the kids for a second, do you think they will enjoy going over to a dying stranger's house? Do they like hanging around with terminally ill strangers, is that a fun day activity for them? Will you make a habit out of treating your children like emotional support dogs, sending them around to people's houses to make them feel better?? \n\nAs someone else said, yeah she's dying but she doesn't have to get everything she wants. You've done her a massive favour already.",
            "score": 176,
            "author": "Right_Gas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Facts, imagine his kids seeing their wedding photos up. Like wtf are they supposed to think? NGL, if I was OP I wouldn't have gone in the first place. If she wanted to keep him around as a husband and have him support her in her dying days, she shouldn't have cheated on him in the first place.",
                    "score": 30,
                    "author": "whitelife123"
                },
                {
                    "level": 1,
                    "comment": "I don’t know why these comments aren’t higher. If I’m his current wife, there’s no way this dying woman is seeing my kids without me present. He’s given her more than he should have already, bringing your kids to see her will only be confusing for them. They’re not her kids, she doesn’t have any because she did something disgusting and awful to this man. Do not take the kids.",
                    "score": 95,
                    "author": "CrabMom15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed especially because she wants to re-live a fantasy of them being married. I’m surprised more people are supporting this. Obviously it’s a nice gesture, but I can only see bad coming from this unless he really lays it down that he isn’t playing a husband role for her and he starts bringing his wife.",
                            "score": 43,
                            "author": "snapekillshansolo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s what I thought as well, *especially* since she still had their framed wedding pictures all over. It seems like the kids will be there just to fit into her fantasy of “happy family with OP”.",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly! He needs to bring his wife over and he should mention that his ex’s behaviour is quite creepy and her attachment is a little weird. Idk maybe it would be harsh, but he shouldn’t allow his marriage to be ruined by an ex wife that cheated on him, she had a choice but she blew it. I really hope that ops marriage isn’t ruined from this.",
                                            "score": 20,
                                            "author": "snapekillshansolo",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Come on, kids, we’re gonna be visiting daddy’s ex-wife before she dies!” How did your wife go from not wanting you alone to go to being perfectly fine having your kids go too? And what will your kids think of all those photographs around the house? This story smells.",
            "score": 53,
            "author": "LogMeOutScotty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, he leaped a giant chasm from his original post. Which was weird enough. Now I’m smelling creative writing.\n\nAt Christmas “c’mon, mom, dad, sis and kids! One last Christmas before she goes!”  “I’ll bring you back a special Christmas dinner, honey!”",
                    "score": 20,
                    "author": "PictureFrame12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm glad you feel like it was a good experience. \n\nI guess you're at peace with where you are, so there isn't much to be said. But I can't resist saying that your sister is the creepiest aspect of this. Your ex-wife not getting over a past love I get, but it's weird for your sister to be so involved and to think she gets to negotiate the boundaries of your relationship. I mean, ewww.",
            "score": 132,
            "author": "Reliant20",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah and the utter disrespect she had towards current wife is gross.",
                    "score": 90,
                    "author": "JillyBean1717",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a good way to put it. That's another thing that bothers me big time.",
                            "score": 32,
                            "author": "Reliant20"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They've been friends since 10 and were a trio of friends together. I'm sure that the sister is just hurting seeing her friend dying and just trying to get her to have some peace before passing on. \n\nDoesnt make the disrespect any better, but i can see where she's coming from.",
                    "score": 55,
                    "author": "smatdesa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The sister got into a \"heated discussion\" with him over the boundaries he set. Basically, she was demanding that he pretend to be his ex's husband (emotional cheating, IMO) and hold her (access to his body). \n\nI'm sure the sister is hurt seeing her friend dying and wants her to have some peace, but that's not \\*just\\* what's at work here. There's sickness behind her demands (and, from the telling, they were demands), not just friendship.",
                            "score": 38,
                            "author": "Reliant20",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your current wife is very kind and giving. I think you’ve extended her enough. DO NOT take HER children over so your ex can play house with them. That is so disrespectful towards your wife. Also, don’t you think they’re going to get confused seeing photos of you with a woman who is not their mother all over the place. \n\nYou’ve done enough. Prioritize your family now.",
            "score": 80,
            "author": "JillyBean1717",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I think he is being cruel to his wife to expect this! I mean his ex has wedding photos framed and said she loves him. He went once, he does not need to go back. It's just disrespectful tbh.",
                    "score": 35,
                    "author": "DisguisedAsMe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely cruel. Why jeopardize his future happiness with his family over the ex who cheated on hims wishes.  His wife’s kindness and goodness aren’t limitless and they aren’t license to run over her.",
                            "score": 26,
                            "author": "JillyBean1717",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also he told ex that he would bring the kids before even having a discussion with the wife!",
                                    "score": 18,
                                    "author": "DisguisedAsMe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hopefully he will rethink that. His wife is giving a lot of leeway and I don’t think he fully appreciates her sacrifice.",
                                            "score": 14,
                                            "author": "JillyBean1717"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your kindness is beautiful and I’m in tears from it",
            "score": 59,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm glad this has some positive outcomes, but is anyone else uneasy with the sister's response? Like heated when she doesn't get her way? Sounds like she has some boundary issues bc, sorry girlfriend, but no does mean no. It doesn't mean to pitch a fit in order to get what you want.",
            "score": 8,
            "author": "oneLES1982",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wow OP, your story sounds very close to what my Father just went through with my Mother, his ex.  \n\nThey knew each as kids, got married, had 2 children.  After a while the marriage broke down and my Mom ended up cheating on my Dad.  They would eventually divorce.  My brother and I stayed with my Mom and I saw my Dad on weekends.  \n\nMy Mother was a very difficult person all her life.  She was always one to try and get a free meal by complaining, or would always find one way or another not to work.  Stuff like that.  My Dad was very much the opposite, so you can see why things didn't work. \n\nMy Dad remarried and has been for almost 15 years now.  All the time since my parents divorced my Mother never took care of herself and became addicted to opiates, all stemming from a back injury she had. \n\nAbout a year before my Mother passed, which was this last July, she started to really reach out to my Father just to talk to him.  Not sure if it was because of he lack of friends, or just that she felt most comfortable with him.  She never changed her last name from his and also never removed photos off the wall.  That kind of thing.  \n\nMy Dad proceeded much as you did, with precautions in place.  I haven't really had a chance to get his take on things recently, but I know he is happy that he spent that extra time with her.  Not because he missed their Marriage, but because he remembers who that person was to him at one time, and he is a good enough man to give that to someone before they die.  I look up to my Father for what he did with my Mom in her dieing days, regardless of the shitty things she always did to him.  Be proud of how you are handling this.  It takes a big man.",
            "score": 7,
            "author": "Chris8674"
        },
        {
            "level": 0,
            "comment": "You’re a good person.\n\n\nHowever, I find extremely odd that your ex-wife still has pictures of both of you still hanged around her home after being apart for a decade, and especially asking you to bring your children to visit her. \n\n\nI would recommend not bringing your and your wife’s children into this. It is not fair of your ex asking you to continue this situation, I guarantee it WILL cause turmoil in your marriage at a later date.\nYour wife might say she’s ok with you visiting her, but it’s not decent to ask her to continue being ok with you keeping a on going relationship with a ex-wife that said “I love you” to you recently, on top of taking y’alls children to her home.",
            "score": 8,
            "author": "CheesyMoonlight"
        },
        {
            "level": 0,
            "comment": "I’m glad that went well but why do you want to bring your kids but not your wife? Your ex has no business meeting your kids tbh.",
            "score": 172,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If my high school girlfriend was dying and wanted to see me to say goodbye, I'd have no problem bringing my kids and wife.  IDK why that would happen, we're friends on facebook, but like most \"friends on facebook,\" we haven't spoken in 17 years.  Sure the kids wouldn't understand the situation, but they're kids, they don't understand most adult relationships, like why do they need to meet my boss?  Kids will just go along, and then later they might ask \"who was that?\" and you say \"just an old friend who's sick and won't be around much longer.\"",
                    "score": 69,
                    "author": "steampig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 55,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He’s not bringing his wife though, just his kids. That’s the thing I find weird.",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "People think they have to formulate complex diagrams to explain things to children when half of it is so simple",
                            "score": 16,
                            "author": "avantgardeaclue"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cause the story is fake.\n\nAlmost none of it rings true.",
                    "score": 5,
                    "author": "Overlord1317"
                },
                {
                    "level": 1,
                    "comment": "I was confused when OP mentioned that part. Showing ex wife pictures? Sure, okay! But physically bringing them to meet and hang out with her? Uh... why? If you want to bring the kids, why not bring your current wife too. I’d be uncomfortable with that.",
                    "score": 61,
                    "author": "WellyJellyBelly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes me think this is fake, to be honest. He might be over it, but she's not. She has the pictures of him framed and put everywhere after 10 years. That's a little bit creepy. \n\nThe kids do not know her, and introducing her as only a \"childhood friend\" is dishonest. There's pictures of him and his ex all over that house.\n\n Be a good dad, and don't take them to a dying stranger's house dude.",
                            "score": 41,
                            "author": "RJWolfe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The entire thing sounds fake.",
                                    "score": 9,
                                    "author": "Overlord1317"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I gotta say man this isn’t the right way to go about it. If my husband were doing this I would be very conflicted, even if I believed he wouldn’t cheat on me. She’s still has pictures of you up in her house, that’s a little weird. She also wants you to play a husband-like role which is also weird. Your wife might be okay with it now, but I have a strong feeling that she is going o start to grow uncomfortable with it, especially if you don’t invite her over sometime. You don’t owe it to your ex to play house, she cheated on you and that’s her fault. Also you should really urge her to take down the photos especially if your kids are coming over (or even your wife) that would really freak them out. I’m sorry your childhood friend is dying, and it’s fine to be there for her, just don’t give in to her little fantasy of wanting to be “married” to you again. You’re a good person OP, and it’s clear you have good intentions, but there are a few red flags popping up",
            "score": 14,
            "author": "snapekillshansolo"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 66,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you bring your kids next time it may be confusing for them to see your wedding photos with your ex. You might want to address that. Good luck!",
            "score": 14,
            "author": "StarksAndRec"
        },
        {
            "level": 0,
            "comment": "Do not bring your kids there. They have nothing to gain from that visit and they should be your priority. It will only confuse them.",
            "score": 150,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 145,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also they will see wedding pictures of their dad and this woman?? Just bizarre",
                            "score": 70,
                            "author": "SquirrelChieftain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm always really confused by this act, of leaving up pictures of you and your ex as a couple hung up on the walls. It's like you don't WANT to get over your ex emotionally.",
                                    "score": 11,
                                    "author": "trueriptide"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s a good point. They’re basically thinking about the kids as tokens of good will when you get down to it, but they’re people.",
                            "score": 34,
                            "author": "wozattacks"
                        },
                        {
                            "level": 2,
                            "comment": "I wanna go play xbox fuck this place",
                            "score": 8,
                            "author": "LittleTmmy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty twisted your going to take your kids dude.",
            "score": 56,
            "author": "jazzy3113",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also he agreed to BEFORE talking with the mother of said kids... even if the wife is fine with it, still disrespectful, not to mention expose the kids to it is messed up.",
                    "score": 27,
                    "author": "apinkparfait",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "THIS is what makes it the worst. Does the wife even know about the framed wedding photos or that the ex said I love you?! And exposing the kids to that is just wrong.",
                            "score": 21,
                            "author": "DisguisedAsMe"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "you have an amazing wife today OP",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Obviously whatever choice you’ve made is great and I hope you’re happy and content with your decision but reading through the original post your ex is really disrespectful to your current wife, just take care of her - make sure she’s comfortable and feels loved.. also, your sister is a creep for trying to convince you to act like your ex’s husband again - that’s weird as hell",
            "score": 12,
            "author": "AGreggory"
        },
        {
            "level": 0,
            "comment": "You, good sir, are what we call the superior man. Take my fake gold.\n\n🏅",
            "score": 33,
            "author": "m0nday1"
        },
        {
            "level": 0,
            "comment": "OK well, I'm the outlier I guess but there is no way in hell I'd take my children over there to visit a dying person who continues to disrespect my marriage.",
            "score": 69,
            "author": "Spoonbills",
            "replies": [
                {
                    "level": 1,
                    "comment": "THANK YOU.\n\nNo respect for his wife or marriage by his ex and sister. All that matters to them is her wish.",
                    "score": 11,
                    "author": "That-Dutch-Mechanic"
                },
                {
                    "level": 1,
                    "comment": "I second this. I wouldn't even go there myself.",
                    "score": 17,
                    "author": "lalasoundasleep"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like you struck a really good compromise. You did something kind for a dying woman who once meant something to you. And you kept your wife happy too. I will say that your sister has some serious boundary issues. This was NOT her decision to make or push on you. And you certainly didn't need to \"set the rules\" with her. This is totally your decision to make and to follow through with as you felt comfortable. And to spend \"hours\" arguing with you about it? You need to disengage with her when she does that sort of thing. It's not healthy. I also think that maybe a visit with your wife and kids might be nice to consider. But that's your call.",
            "score": 7,
            "author": "woodsbookswater"
        },
        {
            "level": 0,
            "comment": "Not sure if you'll see this, not sure if you've already done this, or even if this has come up. But, you and your wife are amazingly strong and I know folks have already talked about the relationship with you and your wife and connections with your ex and all that. It sounds like you two have or are making strides towards peace, which I hope is great for all of you, and wish nothing but the best to you all. Fingers crossed on things going well if you take the kids!\n\nBut I'm looking at your sister. \n\nYour sister, who is your twin, and knows the whole story, probably saw and (though you didn't mention as much as I'd have asked about with the support through all this, *hopefully*) was torn about supporting her best friend and you as two people she cared about... your sister who has seen you fall in love and be happy and become a parent and all this. Who has known your wife for something like at least 7 years and still felt alright with pressuring the two of you to accept this, especially knowing your history with concerns about marriage vows and fidelity and feeling fully engaged in your loving, happy new life. I would really be looking at the boundaries or lack thereof that made her feel comfortable negotiating your boundaries between you and your ex wife. Like, WHAT? Heatedly arguing with you by phone and in your own home regarding you being asked to fulfill the dying wish of her best friend? Also, from the way you say it, it sounds like she implied obligation or requirement on your part to save this person's feelings. Yes, this is a terrible position for all involved, but I really would encourage you to look at the way Sis regards your feelings and safety as opposed to her ends or others she holds dear. \n\nYou're obviously a strong person, as well as your wife, and it takes a strong emotional maturity to walk into a situation like this with someone else's good at the forefront while maintaining and safely checking your boundaries. Even with all that, this is probably exhausting for all parties, and I wish you the best. And I also hope I'm wrong about your sister. Maybe you two are notorious for blunt and direct interventions, and involvement in each other's relationships is par for the course. But it feels like there's something there on that emotional lack of cognizance or at least of consideration of you, and I'd keep an eye on that. Take care, OP",
            "score": 11,
            "author": "laqueerdo"
        },
        {
            "level": 0,
            "comment": "The bring your kids next time is super weird. I wouldn’t , as your wife, be ok with that. That’s strange- even more so now that we know she still has photos of you and her all over her house. That makes me feel like she wants to pretend to be your wife and those are y’all’s kids. While she’s dying and some may feel it’s harmless - you ain’t playing house with my kids. I would draw the line there for sure. I mean do these kids even know who tf she is?",
            "score": 11,
            "author": "woodardmamaof2"
        },
        {
            "level": 0,
            "comment": "Well, this is just the saddest thing. A pretty persuasive lesson against cheating though.",
            "score": 25,
            "author": "omninode",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe, but I think the bigger lesson should be to move on. The ex failed to move on. It's just sad on her part. Cheaters don't feel as much guilt, tbh no amount of lessons will prevent from them cheating. This particular women belongs to a tiny fraction.",
                    "score": 38,
                    "author": "nap-aholic",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bringing home food is never a bad idea",
            "score": 5,
            "author": "catplumtree"
        },
        {
            "level": 0,
            "comment": "This hits home a little bit too much.  I'm glad you went to visit her.\n\nMy husband passed away a few weeks ago from a terminal condition.  I knew he'd maintained a friendly email relationship with an ex of his over the years, but hadn't seen her in a decade.  It was fine and I was secure in our marriage.  \n\nA couple weeks before he passed I saw she had emailed him checking in so I spoke with her and asked if she wanted to come see him in person.  They had a beautiful visit and she was a lovely person.  I'm glad old friends got to say their goodbyes to each other.",
            "score": 6,
            "author": "BurnerAccount-shhhhh"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 67,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right?  The sister should’ve pushed this chick to move on.",
                    "score": 30,
                    "author": "JillyBean1717"
                },
                {
                    "level": 1,
                    "comment": "She didn't succeed in guilting him into playing house, but not for lack of trying on her part and the sister's (which, weird). \n\nBut yes to the rest of it. The ex has clearly nurtured her obsession and made a choice not to move on. And she just happens to be best friends with the sister of the man she's obsessed with? And there's something weirdly incestuous about the sister's interest. Were the \"heated\" arguments along the lines of, \"No! You WILL cuddle her and let her pretend you're married!\"\n\nThe sister's weirder than the ex, whose mental unhealthiness at least takes a familiar form.",
                    "score": 36,
                    "author": "Reliant20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Uhm, OP is going to take his children to meet this crazy lady. Yeah they’re playing house.",
                            "score": 35,
                            "author": "Creighshawn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good for you, OP for handling this in a mature manner.\n\nAs I always say, you don't forgive someone to make THEM better. You forgive someone to make YOURSELF better.",
            "score": 3,
            "author": "TheTask2020"
        },
        {
            "level": 0,
            "comment": "Your wife is a legend I’m so glad she’s being supportive all the way! Good luck Mr!",
            "score": 4,
            "author": "ykawai"
        },
        {
            "level": 0,
            "comment": "You do you, but that is just creepy.",
            "score": 4,
            "author": "Parkon98"
        },
        {
            "level": 0,
            "comment": "I think it’s important to not lose sight of the fact that this woman, the ex-wife, is still very much in love with OP and has never moved on from their relationship. I know everything seems like sunshine and roses right now, but clearly this person has found it impossible to move on and consenting to spend time with her (even though it felt good) may exacerbate her mental state in ways that are difficult to predict.",
            "score": 4,
            "author": "Zekumi"
        },
        {
            "level": 0,
            "comment": "Hey man...I know this comment is late and will get lost, but feel like I have to respond. \n\nLong story short...my wife cheated on me with one night stands over the course of 3 years.  Our marriage had basically ended before that but we stayed for the kid.  I never cheated but it's probably because I was a mess of a person...riddled with panic attacks that didn't help things.  When I found out about the affairs, we had just conceived our 2nd so she was pregnant (yes it's mine).  It rocked my world and the only reason I stayed is for that baby girl inside her.  \n\nOver the pregnancy we fixed things...fell in love...and 4 years later are in a spot neither of us would have guessed. \n\nBut I struggle...nearly daily with the fallout.  Existing poor self image coupled with the ammo of the affairs really shits on me.  \n.\nI really enjoyed reading your story.  It has so many angles.  For me, I can tell she was sorry.  It doesn't take any bullshit away...but to feel the remorse she felt in your story really hit me. It's SO HARD to feel like my wife is sorry no matter how many times she's proven it.  I guess I'm too close to the fire to see it.  But seeing it in someone else helps me see it in my wife.  \n\nI've really fucking struggled the last 2 weeks.  Remote teaching sucks, I gained weight during the pandemic, and I've felt generally shitty about myself.  Snapped at my kids, my wife...and would rather be alone.  I think reading your story, and seeing her remorse...as well as the support your current wife showed you really helped me.  I needed a change of perspective and you provided that.  \n\nSeeing the way you handled it... without the \"fuck you\" attitude you could have had ...is awesome.  Sometimes I have that fuck you attitude and it helps nothing",
            "score": 4,
            "author": "SouthJerssey35",
            "replies": []
        }
    ]
}