{
    "id": "128pdzf",
    "score": 1,
    "title": "Placed in a waiting list for MSc in Machine Learning",
    "author": "TheThinkerBigger",
    "date": 1680362369.0,
    "url": "https://www.reddit.com/r/kth/comments/128pdzf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello there! Like several people who write in these days I got \"reserved\" as result of my KTH application. In particular I am in the BEFR waiting list with the number 15, for the MSc in Machine Learning. I was wondering, is there any chance to have an offered place in this situation?",
    "comments": [
        {
            "level": 0,
            "comment": "50 people accepted for the BEFR group. Assuming an overintake of 10%, this means that 20 people would need to give up so you could be offered a place. It's possible, just highly unlikely.",
            "score": 2,
            "author": "raijenki",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am the number 2 in the waiting list for BEFR group. How likely is it for me to be accepted?",
                    "score": 2,
                    "author": "OtherwiseWest1506",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who knows. Odds might be in your favor, but they have until august to call you and there’s also the overintake. A colleague of mine was #1 for CS and was not invited few years ago.",
                            "score": 4,
                            "author": "raijenki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how many of his group had been accepted that year?",
                                    "score": 1,
                                    "author": "OtherwiseWest1506"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for the reply. Right now, I'm trying to estimate how much would be worth to wait for KTH, since ML is my first choice at Admission.se. This also because I got a place in Chalmers University for Data Science &amp; AI, and I didn't understand very well if It exists a deadline to drop a place offered from swedish universities.",
                    "score": 1,
                    "author": "TheThinkerBigger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AFAIK there’s no deadline to accept, it is a given that you will go to the accepted program. You can keep waiting until the beginning of the semester if you want.",
                            "score": 3,
                            "author": "raijenki"
                        }
                    ]
                }
            ]
        }
    ]
}