{
    "id": "av04m3",
    "score": 5,
    "title": "ICT Bachelor's Programme",
    "author": "anubhavg8",
    "date": 1551191881.0,
    "url": "https://www.reddit.com/r/kth/comments/av04m3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys,   \n\n\nI am an International Student who has already applied to the Bachelors of ICT at KTH. I have couple of questions:   \n1. What is the acceptance rate? Or how hard is it to get into the KTH Bachelors ICT programme?   \n2. Is there any upcoming student community at KTH? I am also applying to Delft and we have a 100+ students in the Discord Channel  \n\n\n&amp;#x200B;",
    "comments": [
        {
            "level": 0,
            "comment": "Hi there!\nI used to study ICT programme at KTH.\n\n1) It's not that hard to get into KTH's bachelor programme. If you have good grades from your highschool, you should be fine. Personally, I had to pass IELTS in order to get accepted, but this is not the case for everybody (depends on how English gets accredited in your country). However, this ICT programme is very difficult and demanding, so be ready to study a lot (I mean REALLY A LOT). I don't want to discourage you by no means, but many students leave after a few semesters or a year. This degree is highly valuable and opens up many opportunities for you which is definitely worth your time and effort.\n\n2) No clue.\n\nAlso, here are some tips:  \n- To make life a bit easier at KTH, you should start learning the basics of programming (unless you already know it)\n- KTH likes to change the structure of the exams, so every exam is quite different in comparison with the previous one. You will have to know a lot of material which some of it you might not have been covered during lectures\n- Don't get scared, if you fail exams. You can usually retake them at the end of the semester\n- Don't rush to buy all of the books, because you can either find them online, or ask 2nd-3rd year students and they will give you a link/tell you where to find it.\n\nMost importantly, don't miss the very few weeks when all of the events happen. Not much studying at the beginning, so you should party with your new classmates and get to know each other. Appreciate that time, because the exams will come in just around a month and a half🙃\n\nHope it helps! Cheers!\n",
            "score": 2,
            "author": "artik147",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey!   \n\n\nThank you so much. Apart from my 12th year, all my high school grades were pretty much on point since I had got into a couple of extra-curricular activities which are still going on. (I am a gap year student) Although my 12th grade marks are way above the minimum required grades.\n\n&amp;#x200B;\n\nI am talking to another student and she said that there are 35 students in ICT. That makes the program sound really competitive and exclusive.   \n\n\nWhat are your views on that? \n\n  \n\n\n&amp;#x200B;",
                    "score": 1,
                    "author": "anubhavg8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As far as I know, there used to be more students last year. As I said, many students leave/change the programme in the first year.\n\nThere's the same programme given in Swedish which has many more students than the international one.",
                            "score": 1,
                            "author": "artik147",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alright. I think that's the case with a lot of universities. I mean, TU Delft has a 50% dropout rate which is weird.   \n\n\nI think the best I can do is wait for 15th April.   \n\n\nThank you so much. ",
                                    "score": 2,
                                    "author": "anubhavg8"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our student community is a bit more offline, as we usually gather in the chapter hall for actives and pubs. But there is a thriving community of people engaged in the chapter, and stuff outside the chapter as well.\n\n&amp;#x200B;\n\nWe usually have pubs and big parties, gasques as well as non-alcohol events where we play games and just hang out. We have a sports committee who do sporting events like football (not the american kind), floorball, etc. If you join one of the mastery's, who're in charge of the pubs there is a plethora of fun things to do internally and externally like cruises, gasques, etc.\n\n&amp;#x200B;\n\nTHS, which is the umbrella organisation for all the chapters hosts a lot of activities as well, from photography to light and studio equipment and even rocket launching!\n\n&amp;#x200B;\n\nWhen you're accepted (fingers crossed) the best way to see all of this is the reception, where you'll see a bit of the silly old-fashioned KTH-student culture (won't spoil it too much, but it's a lot of fun and a lot of cringe). It's a 4-3 week introduction to student-life, it's a great way to get to know your peers as well as the older students (like me, I'll be one of the organizers).\n\n&amp;#x200B;\n\nI don't really know that much about the international acceptance rates nor the exclusivity or competitiveness, but the international programs are usually almost as big (student-wise) as the Swedish version. But, I'd turn to the student-outreach people [(here)](https://www.kth.se/en/studies/bachelor/information-communication-technology/interview) and email them this question. They're more suited to answer this sort of thing\n\n&amp;#x200B;\n\nAll else, like the student life - I'm your guy. If you have any more questions, just ask!\n\n&amp;#x200B;",
            "score": 1,
            "author": "ICABONUSKUND",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey!\n\nThank you so much for the detailed answer. Really relieved to get an insight into the student community at KTH.\n\nI will surely get in touch with you, post 15th April. Hoping to get in KTH.\n\nCheers man.",
                    "score": 2,
                    "author": "anubhavg8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problems dude, when you get in, during the reception I'll be one of the peeps taking a bunch of photos :)\n\nCheers!",
                            "score": 1,
                            "author": "ICABONUSKUND"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's some selective procedure.   \n\n\nWhat's up with 5% acceptance rate. I hope I get in. ",
                    "score": 1,
                    "author": "anubhavg8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a really good insight. I think my application was then decent enough since I was 6 points above the minimum requirement. (IB points)  \n\n\nThank you so much for this! ",
                                    "score": 1,
                                    "author": "anubhavg8"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I briefly looked through the comments and don't think I saw any about this topic. Not 100 % what you're asking for but I think it's great to know! \n\nTHS has an international reception for all the new international exchange/master students. There are always a lot of new students so if you want to attend the activities and events they fix you need to sign up early! I've been one of the welcome buddies and I'd totally recommend attending as many events as possible! ",
            "score": 1,
            "author": "whatdz"
        },
        {
            "level": 0,
            "comment": "Sorry, I'm a bit late. Have you gotten into KTH Royal Institute of Technology? I'm interested as well, because perhaps, I will apply to mentioned university this year.",
            "score": 1,
            "author": "arnasp13"
        }
    ]
}