{
    "id": "eklkeh",
    "score": 4,
    "title": "How Programming intensive are MSc courses at KTH?",
    "author": "ThatOneGuy2k17",
    "date": 1578269591.0,
    "url": "https://www.reddit.com/r/kth/comments/eklkeh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, \n\nI am currently on the last year of my Computer Science BSc degree and am looking at different universities to apply for a MSc.\n\nOne thing I have found during my time at university so far is that I am not someone who loves to code and I am much more interested in the theory part of IT. I find coding boring and stressful and I am much better at theory.\n\nWhen looking at the list of MSc Programmes at KTH the ones that seem the most appealing are:  \n\n# ICT Innovation \n\nand\n\n# Communication Systems\n\nMy question is how much does one have to code in order to do these MSc degrees?\n\nI'm not saying I can't code at all, I can but I would prefer a programme that is more theorethical. \n\n&amp;#x200B;\n\nThanks for the help.",
    "comments": [
        {
            "level": 0,
            "comment": "https://www.kth.se/en/studies/master/ict-innovation/courses-1.609476\n\n\nhttps://www.kth.se/en/studies/master/communication-systems/course-overview-1.268645\n\nHave you looked through these lists of mandatory courses? They should give you a grasp of how much programming is in each master program",
            "score": 3,
            "author": "Wassaren"
        },
        {
            "level": 0,
            "comment": "I took a few KTH data science courses in an Exchange. They had a theoretical part, but I'd say half of the work involved coding at least. There were labs where we had to implement algorithms from the course, and a project where we needed to experiment with techniques from research papers given by the profs. I managed because I was used to coding, but it still took me some time.\n\nFrom my (short) experience and what I've read in some places, KTH is often very applied, though you also need to understand some theory of course.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}