{
    "id": "g5l1jj",
    "score": 4,
    "title": "Exchange student KTH in 2021",
    "author": "darkcham0",
    "date": 1587494831.0,
    "url": "https://www.reddit.com/r/kth/comments/g5l1jj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just have been accepted to KTH today !!\n\nI will be Studying electrical and Informatics Engineering as an exchange student in 3rd year (I'm from EPFL Switzerland).\n\nI have a lot of Questions:\n\n  \\- Concerning the accommodations: I've asked for accommodation directly on the campus but I'm not sure to have a spot, where can I search (I've heard of Blocket ? any Facebook group?)\n\n  \\- Great things/Spot to visit or to know in Stockholm: I used to study in the library, is it free in Stockholm? good places in the city or district to stay ( I think my course will be in Kista)\n\n  \\- Trip planning: I've heard that the expeditions in the north of Sweden are really cool to do, any advice on what to do?\n\nLast thing: I'm a stoner from France where it's not legal I think in Sweden would be approximately the same, do you have experience with weed in Stockholm? how to buy it, how do the cops react, possible to smoke at school parties? etc...\n\n&amp;#x200B;\n\nAny advice from someone who experienced the life of studying in KTH would be welcome.\n\nThanks for reading me, Take Care.",
    "comments": [
        {
            "level": 0,
            "comment": "Don't smoke weed at school parties, pls - it'll mess with our permit, and that's the only thing I personal care about. \n\nBut else wise, we've got quite the active party-life - even in Kista. Two pubs each week, one more from another school up the road - when not in the corona times - and really cheap, but good beer, drinks and food :) \n\nThey're a great way to unwind and grab a beer after school or get so fucked up you won't remember how you got home or with whom. It's really up to you. We've got the full range.",
            "score": 2,
            "author": "ICABONUSKUND",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll add on to this that most people would probably react negatively in response to someone smoking. Not all, but most.",
                    "score": 2,
                    "author": "hebo07"
                },
                {
                    "level": 1,
                    "comment": "ok thanks for the advice ! what are the names of the pubs ?",
                    "score": 1,
                    "author": "darkcham0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, we call them pubs but it's the same place - they're hosted in Kistan 2.0 by TMEIT &amp; QMISK, which have Facebook pages :)",
                            "score": 1,
                            "author": "ICABONUSKUND"
                        }
                    ]
                }
            ]
        }
    ]
}