{
    "id": "jyt3j7",
    "score": 1,
    "title": "Should I apply to the ICT program? I know nothing about computer science but I love algebra",
    "author": "healthyfitme",
    "date": 1606038088.0,
    "url": "https://www.reddit.com/r/kth/comments/jyt3j7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im considering to apply for this bachelor's program (start next fall). Im kind of lost and dont know what I want to study. Which is why I am taking a gap year right now (I graduated from high school in June). All I know is that maths was my favorite subject and still is (the algebra part and not geometry). I have no knowledge of computer science or programming but I might enjoy learning it. But it's not a passion of mine or such.\n\nShould I go for the ICT? Or are most students there really passionate about the program? How hard is it? How much work time should I expect to put in every week?\n\nPs. I come from a french school so graduated with a baccalauréat ES with my best grade being in mathematics (19/20). (If that helps)",
    "comments": [
        {
            "level": 0,
            "comment": "you're applying for bachelors. You don't need to know much if anything before",
            "score": 3,
            "author": "Milosmilk"
        },
        {
            "level": 0,
            "comment": "&gt; Should I go for the ICT?\n\nSure, go for it if you want to.\n\n&gt; Or are most students there really passionate about the program?\n\nYes. Very passionate. In my experience since here in Sweden salaries do not differ by much after you graduate people tend to study things that they are interested in, rather than things that they perceive will make them upper-middle class or wealthy like they do in my country (the United States). So in my program at KTH (MS in Computer Science) I have found that people are very passionate about what they study and the subject matter is genuinely interesting to them. \n\n&gt; How hard is it?\n\nThis is highly personal and it will depend on you as a person.\n\n&gt; How much work time should I expect to put in every week?\n\n40 hours per week for full-time studies, including all the homework, lectures, etc.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}