{
    "id": "13khtl6",
    "score": 1094,
    "title": "The US only has $25Million left before it hits its debt ceiling!!!",
    "author": "RoyalMecca",
    "date": 1684366215.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/13khtl6",
    "media_urls": [
        "https://i.redd.it/17njm3fjpi0b1.jpg"
    ],
    "other_urls": [],
    "postText": "What’s next I wanna hear some thoughts 💭",
    "comments": [
        {
            "level": 0,
            "comment": "That should last us like… 7 minutes?",
            "score": 518,
            "author": "kodaksdad2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depends on how many B52, F22, F35, B1, B2 KC-135, KC-46, P8s are up in the air.",
                    "score": 136,
                    "author": "interstellar-dust",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you suggesting a nuclear power with no hostile border threats should not be spending 850 billion dollars on \"defense\"? What.. do you hate democracy or something?",
                            "score": 176,
                            "author": "EmergencyFair6786",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When the USS Massachusetts and her five sister battleships *(with a price tag of 300 million dollars, 6 billion in today's money)* were discussed in Congress in the 1890s the government was brought to a halt and there were fierce debates for over a month because a lot of politicians wanted to understand why a country without any imminent threats needed 6 battleships, and if that money wouldn't find a better use expanding the country's industry and infrastructure. Many politicians didn't want to fund any imperialistic ambition. \n\nSeems like a completely different country.",
                                    "score": 91,
                                    "author": "Arcosim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Seems like a completely different country.\n\nThat was before men like John D. Rockefeller, Andrew Carnegie, and Cornelius Vanderbilt found that war was extremly profitable.",
                                            "score": 44,
                                            "author": "ScumbagInc",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I really can't think of any other reasons between 1900 and say 1950 that could explain it.",
                                                    "score": 17,
                                                    "author": "AmbitiousEconomics",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "To counter this, there haven’t been any significant wars that threaten our democracy since then. Minus our own internal population doing that for us.",
                                                            "score": 5,
                                                            "author": "What_Yr_Is_IT"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Someone must have had an idea that all Heil was about to break loose.",
                                                            "score": 2,
                                                            "author": "SO_Teric42"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "THIS 👆",
                                                    "score": 2,
                                                    "author": "Ok-Candle-6859"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did we need or use them in WWI?",
                                            "score": 2,
                                            "author": "dr-uzi"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yea all the defense contractors consolidating in the 90s/early 2000s and combining lobbying budgets really tends to mess with us “defense” strategy.",
                                            "score": 3,
                                            "author": "NexusI7"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The reason why their was so much debate is because battleships can take years to build so if you get into a war you can’t just build a bunch quickly very easily, the US would later use those ships for both the First World War and the Spanish American war which were both unforeseen conflicts at the time",
                                            "score": 3,
                                            "author": "MechanicalTrotsky"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No no you got it backwards, we aren’t spending *enough*! \n\nI suggest we increase income tax to 100%, then apply a 106% annual wealth tax + 7.9% surcharge, and use all the money to build and launch an endless stream of bombs at everyone else. This will show the world that the U S of A doesn’t fuck around",
                                    "score": 70,
                                    "author": "OG-Pine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah just threaten other countries and sell treasuries to them to pay for the weapons we threaten them with. Then sell them movies about a better world so they migrate here and work off the debt we owe their country. How hard is it to understand how the world works, folks?",
                                            "score": 45,
                                            "author": "JustPlayin1995",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Haha yeah exactly everyone’s an idiot! \n\nNot us though. Yeah, us two are smart. *We* got it figured out",
                                                    "score": 21,
                                                    "author": "OG-Pine"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Why would they want to piss people off that much when they can just print it and then have a fake treasury auction the Fed just internalizes? Milk is gonna go to $20 a gallon all by itself, now is it?",
                                            "score": 2,
                                            "author": "MeatStepLively"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you think our geography would solely protect the US without our military force you’re dead wrong.",
                                    "score": 2,
                                    "author": "Asleep_Special_7402"
                                },
                                {
                                    "level": 3,
                                    "comment": "We are not a democracy. Yes I hate real democracy, it is mob rule. We are a Republic, it protects your individual liberty to show your ignorance. Real national security comes from the second amendment and a good moral people. And we should only be defending the US and it's territories. Not every Tom, Dick, and Jerry of a country that we decided to make allies with just to build a military base. Unless we are protecting U.S. Citizens on U.S. soil we shouldn't be having our military there. If their resources that are being exploited in another country, that country should be defending itself, the corporation providing its own defense via contractors from its own budget, or the U.S. claims that territory to secure the resources for our use and they become U.S. citizens.",
                                    "score": -4,
                                    "author": "CheekJiggle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You called me ignorant, but I don't think we disagree. I'm aware we're technically supposed to be a Republic. I don't think we are any longer. At some point we became a uniparty dictatorship dressed up to look like a Republic. The democracy comment is based off the neocons mantra of wanting to spread democracy. \n\nAs for the rest, I agree. I'm a huge advocate of our second amendment rights. That's also a driving factor for being anti military. Our government, both parties, are hostile. Plain and simple.",
                                            "score": 6,
                                            "author": "EmergencyFair6786",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You are right. We don't disagree. I apologize for calling you ignorant.",
                                                    "score": 3,
                                                    "author": "CheekJiggle"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Please don't say that you're an advocate of the 2nd Amendment.  There is no reasonable basis for it.  \n\nEvery other developed country in the world has gotten rid of guns and their death rate plummeted as a result.  Gun ownership does not prevent a dictatorial government.  (Guns are prevalent in Russia but that didn't stop Putin's dictatorship!)  Americans want guns for a simple reason.  American gun owners love its entertainment value.  They love shooting them on weekends.  Please reconsider your stance.",
                                                    "score": -1,
                                                    "author": "AltRumination",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't consider myself a better visionary than the Founding Fathers, who set into motion additional rights I also support. The threat of violent reaction by a population means something. Whether you deny that or not doesn't change that reality.\n\nAlso, the death rate and murder rate means nothing in the discussion of 2A. 2A is about our rights. Murder rate is about our culture.",
                                                            "score": 2,
                                                            "author": "EmergencyFair6786",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;\"The threat of violent reaction by a population means something.\"\n\nDo you think this threat of violence in any way hindered Putin from taking power?  Russians love shooting guns perhaps even more than Americans.  Did Russia's widespread gun ownership prevent Putin's dictatorship?\n\nDid gun ownership prevent Trump supporters from storming the Capitol and overthrowing the government?\n\nIf an American president happened to refuse to relinquish power, incited his supporters to rise up, convinced every single American general to side with him, and then take control, do you believe that American citizens with guns can do anything to stop this?  The US Army has helicopters, tanks, and sophisticated military equipment.  Do you think guns would stop their takeover?\n\nPalestinians have no problem procuring guns.  Even Palestinian teenagers carry guns.  Has this prevented Israel from completely subjugating them?\n\n \\----------------------------------------------------------------------------------------------\n\nOf course, the death and murder rate is relevant to a discussion of the 2nd Amendment.  If a right significantly increases the death and murder rate, then we need to think about changing it.\n\nMurder is not about culture.  It's about poor critical thinking.  Humans are dumb and emotional.  Actually, about 30% of the population is astoundingly stupid.  They make poor, impulsive decisions.  For example, a penniless person with limited options will use a gun to steal, not thinking things through.  Or, a [road-rage driver](https://www.youtube.com/watch?v=saQ72NZtrS0&amp;t=1s) will shoot at another car for merely cutting him off.  Or, consider the [shootings](https://www.youtube.com/watch?v=4GylQTGBH4E) in the last month that simply dealt with innocent people just going up to a person's door or accidentally driving up to the wrong house to ask for directions.\n\nNo background check can screen out for stupidity or impulsiveness.  [Look](https://www.youtube.com/watch?v=UaWtmSGJ5vE) at this cop who shot and almost killed an innocent teenager.  The cop did this even despite his rigorous training.  You can't cure stupidity.\n\n \\----------------------------------------------------------------------------------------------\n\nYou give our Founding Fathers too much credit.  They may have graduated from top colleges but their classes probably had the same rigor as today's high school.  More importantly, do you believe that our Founding Fathers were infallible?  They could anticipate all the needs of modern society?  Or, do you believe that our best and brightest haven't learned anything in the past 250 years?\n\nSome Americans' blind devotion to the Constitution is no different than their blind devotion to the Bible.  It isn't based on reason.",
                                                                    "score": 0,
                                                                    "author": "AltRumination",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Truthfully, we are not a Republic, either. We are an oligarchy. The wars we fight are those which benefit the few in power.",
                                            "score": 8,
                                            "author": "skunkerdoodles",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Annnnd it's gone",
                    "score": 12,
                    "author": "hammilithome"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gonna submit my FAFSA requesting the max amount rn just to see what happens",
            "score": 472,
            "author": "yoyooobaba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol Lfg",
                    "score": 78,
                    "author": "proteccstaccs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aaaand it’s gone.",
            "score": 519,
            "author": "ItsRalphy69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Update: *It never was there.*",
                    "score": 158,
                    "author": "EverybodyStayCool",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kenny how do you do it?",
                            "score": 12,
                            "author": "Always-hungry"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We’ll we can just take that federal money and put it in a consolidated housing debt fund…  \n  \n#AND ITS GONE",
                    "score": 25,
                    "author": "IJustW0rkHere0k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bank of America is going to hit them with some serious overdraft fees.",
                            "score": 2,
                            "author": "MagicChemist",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "🤣🤣🤣",
                    "score": 23,
                    "author": "OkUnderstanding9992"
                },
                {
                    "level": 1,
                    "comment": "Came here to say the exact same thing",
                    "score": 18,
                    "author": "meanathradon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not sure I follow your math, but it does say those digits are millions",
            "score": 176,
            "author": "OldJackRose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it look like those numbers are trillions but I’m not sure which number gets subtracted from the 31 trillion limit to get how much is left to spend.",
                    "score": 62,
                    "author": "JareBear805",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Line 11-Line 10= 25 million",
                            "score": 29,
                            "author": "GreenMedics"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it does say in millions, so we are good for couple more weeks",
                    "score": 13,
                    "author": "fofcheg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crisis averted!",
                            "score": 6,
                            "author": "_khanrad",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Statutory Debt Limit- Total Public Debt Subject to Debt Limit= Remaining Public Debt before Statutory Debt Limit.\n\nIt's around 25 million remaining. But it's been that way since the start of the month soooo",
                    "score": 32,
                    "author": "GreenMedics"
                },
                {
                    "level": 1,
                    "comment": "Look at the two numbers in the bottom left.",
                    "score": 4,
                    "author": "InsouciantBadger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This says Monday and not shit has happened",
            "score": 164,
            "author": "the_love_man",
            "replies": [
                {
                    "level": 1,
                    "comment": "We’ve must have been responsible with our spending this week…",
                    "score": 70,
                    "author": "twb51",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No guac this week",
                            "score": 74,
                            "author": "_khanrad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Skipped the Starbucks too.",
                                    "score": 26,
                                    "author": "BlackLeader70",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Instant noodles for dinner.",
                                            "score": 7,
                                            "author": "speculativedesigner",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "PB&amp;J for breakfast.",
                                                    "score": 7,
                                                    "author": "halffullreesee",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "One ply TP stolen from the office.",
                                                            "score": 10,
                                                            "author": "Cristinky420"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "no chips",
                                    "score": 6,
                                    "author": "Artistic_Passion394"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its almost as if we don't have all the information.",
                    "score": 9,
                    "author": "Ghawr"
                },
                {
                    "level": 1,
                    "comment": "Yep. Should be like only a few days left.",
                    "score": 7,
                    "author": "SuspiciousStable9649"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let’s cancel pay for congress &amp; senate if no deal. Let’s also either way get rid of their “health care for life” bull shit &amp; watch how fast those costs drop for everyone.",
            "score": 239,
            "author": "RealtorLV",
            "replies": [
                {
                    "level": 1,
                    "comment": "The pay wouldn't affect most of them much, they're on the take for much larger sums from their true masters.\n\nThe health care, on the other hand, would probably make most of those half-dead geriatric hearts palpitate.",
                    "score": 117,
                    "author": "semisolidwhale",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't forget the insider trading profits",
                            "score": 31,
                            "author": "Nichoros_Strategy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And those longs will be in place when they pass whatever they are going to pass and everything goes green.",
                                    "score": 2,
                                    "author": "Iron0ne"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're literally all millionaires.",
                    "score": 3,
                    "author": "Dramatic_Ir0ny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "May be they should stop buying avocados and make coffee at home",
            "score": 104,
            "author": "okheay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well that's a bit harsh, don't ya think?",
                    "score": 11,
                    "author": "Original_Wall_3690"
                },
                {
                    "level": 1,
                    "comment": "IDK. Avocado be really cheap nowadays.... Maybe JUST eat avocados 🤷🏼",
                    "score": 5,
                    "author": "Redditadmindoc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "long avocados, short eggs",
                            "score": 10,
                            "author": "bufonia1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You think any of these politicians could make a latte?",
                    "score": 2,
                    "author": "IJustW0rkHere0k"
                }
            ]
        },
        {
            "level": 0,
            "comment": "##",
            "score": 45,
            "author": "forahive",
            "replies": [
                {
                    "level": 1,
                    "comment": "‘Negative growth’ always gets me. I mean, I know they did it because of the trauma of the Great Depression.. but it’s such a stupid phrase",
                    "score": 8,
                    "author": "IJustW0rkHere0k",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It’s funny that people take it so seriously. There isn’t any true debt ceiling and the numbers don’t even make sense. The govt controls those variables and can change it as they please as we go towards infinite debt",
                    "score": 1,
                    "author": "jadedmonk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they don’t control those numbers, which they aren’t doing, then the US defaults on it’s debt. This would have a catastrophic in the world economy, mostly because the US is considered one of the safest investments worldwide and if that confidence is broken then the market goes to shit. It’s all la la land until the people start feeling the consequences. We’ve come close to doing this before and they always figure something out but you don’t wanna find out the other end of the tunnel.",
                            "score": 2,
                            "author": "alejandrocab98",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think you’re missing my point - the US govt will never default on their debt because they’ll always raise the debt ceiling. We have been through this many times. These numbers aren’t even real at a certain point. I remember when people were freaking out as the total debt reached 7 trillion a long time ago, but there were no consequences because there are never consequences when it’s the govt themselves making up the limits it can go to. If you told someone back then that by 2023 the US debt will be over 31 trillion then it would be unbelievable, yet here we are. In 20 years we’ll be pushing 100 trillion and it won’t even matter",
                                    "score": 3,
                                    "author": "jadedmonk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guys this debt ceiling situation happens every six months and they always end up raising. This time will be no different.",
            "score": 42,
            "author": "darreldeboi",
            "replies": [
                {
                    "level": 1,
                    "comment": "We didn’t always have a freedom caucus with MGT as a leader.   There was a time that dumb people wouldn’t speak for fear they be discovered as dumb let alone run for public office and win.  Our populace is composed of both lazy and ill-informed people that have lost the fear of voicing their opinion.",
                    "score": 29,
                    "author": "QualifiedCapt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is the part that is different. The MTG cohort strikes me as sufficiently immature to let the US default. I can imagine them talking themselves into it by confusing their asinine belief in rugged individualism and American exceptionalism with reality. Not to mention they probably believe only liberal cities would be affected because everywhere else is completely self sufficient.",
                            "score": 2,
                            "author": "mashpotatodick"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;lazy and ill-informed \n\nAnd we're just levying that onus on the people huh? Years of strip malls and unrequited rising credit card debt and we're just gonna shit on the citizens like they wanted this? The owners of today's bloated assets wanted this.",
                            "score": 3,
                            "author": "breatheb4thevoid",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amen. Am I right to remember that with Trump there was like a month of shutdown before they actually agreed on something?",
                    "score": 2,
                    "author": "funmx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wrong decade.  There was no debate when trump accounted for 40% of our current debt.  It was passed 3x easy peasy.",
                            "score": 9,
                            "author": "QualifiedCapt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hate to break it to you but, this is how politics have been for centuries…",
                    "score": 1,
                    "author": "darreldeboi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You really have absolutely no clue what statement you’re looking at and how to read it, right?\n\nUs reached the debt ceiling months ago. Right now they’re spending down their treasury general account with $154bn in it as of last week. That money is expected to last couple more weeks.",
            "score": 8,
            "author": "vinylbond"
        },
        {
            "level": 0,
            "comment": "They will raise the debt ceiling like they always do",
            "score": 16,
            "author": "Kossef",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Did your family or basic education teach you how to read a bank statement? \n\nYou are reading this totally wrong. \n\nThat is not what is happening. You also fail to take into account the positive cash flow.",
            "score": 47,
            "author": "Dannysmartful",
            "replies": [
                {
                    "level": 1,
                    "comment": "FR!",
                    "score": 6,
                    "author": "blackicebaby"
                },
                {
                    "level": 1,
                    "comment": "The financial illitracy in this post is literally the only reason I know I am going to be just fine in retirement.",
                    "score": 1,
                    "author": "Background_Cash_1351"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Either they Raise the ceiling depth higher or *were fucked* (**Deep recession**)",
            "score": 41,
            "author": "DaBoi_IFS",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s funny thinking that inventing more money to spend somehow stops the economic problem",
                    "score": 7,
                    "author": "Low-Classroom7736",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It puts the problem on the citizens by devaluing our money",
                            "score": 10,
                            "author": "Dependent-Plate-6253",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "why is this downvoted, he/she isn't wrong.",
                                    "score": 1,
                                    "author": "leibniz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s reddit",
                                            "score": 7,
                                            "author": "Dependent-Plate-6253",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "ahh , i put too much hope in reddit i guess:/",
                                                    "score": 1,
                                                    "author": "leibniz"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Only people who are fucked are government employees and bond holders",
                    "score": 12,
                    "author": "Dependent-Plate-6253",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bunch of those bond holders are tied to retirement funds and pensions. Going to be spicy.",
                            "score": 25,
                            "author": "darthnugget",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Something has to give. You can’t have 30+ trillion in debt and have no viable way of reducing it",
                                    "score": -15,
                                    "author": "Dependent-Plate-6253",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean… the rules are made up and so is the score.  So yeah you can",
                                            "score": 39,
                                            "author": "SignalIssues",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The rules are only made up at the top. For you the rules are very clearly defined. You can only have so much debt before a bank refuses to give you more. Like I said something has to give. Most likely the dollar will be worth less and less until everyone is a millionaire and being a millionaire means nothing.",
                                                    "score": -2,
                                                    "author": "Dependent-Plate-6253",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well we’re talking about government debt so that is the top. So they do make the rules. So his point is correct. As long as people have faith that the US will pay its debt in theory you can have unlimited amounts of debt. Obviously at some point there will be doubt the US could pay its debt if it gets large enough",
                                                            "score": 10,
                                                            "author": "khalid1234569",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This has already begun. China has been drastically reducing the amount of USD it holds for over a year now. Russia has been doing the same thing. Saudi Arabia recently struck a deal with China to trade oil in yuans, while India has been buying russian oil in rubles and rupees for months. Those countries have very little need for USD anymore. Most countries in South America have been trying to escape the USD's hegemony for 30 years, and now that El Salvador has succeeded, many others will soon take action. Argentina is talking of adopting Bitcoin just like they did. Brazil is building a partnership with Russia, China, South Africa and India to use the chinese yuan as international settlement currency (the BRICS system). Most of Africa is also fed up with the dollar, with many of the countries over there turning to China for international trade, while their populations are adopting Bitcoin at the fastest pace on the planet. The United States will default on their international debt eventually, because hyperinflation will destroy the value of the dollar. No one wants to be there when it happens and all the smart kids are escaping the boat before it sinks.",
                                                                    "score": 1,
                                                                    "author": "CryptoBehemoth",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lmao you think Brazil India China and other small countries can take on the US dollar in the international market? The US dollar is involved in approximately 90% of international FX transactions. China is at like 3 percent.\n\nExplain to me how a bunch of 2nd and 3rd tier countries are going to come together to overthrow the US dollar. China and India are not even political allies. \nSaudi Arabia?? They only have regional power because the US gives them weapons.\n\nWhat are these BRIC countries going to back their  currencies against. The faith of their Governments? Highly doubt that. China would first have to open up their banking sector to the world. That ain’t gonna happen anytime soon.\n\nThe US dollar is stronger than ever and will only continue to strengthen. Especially now that China has no allies that are economic powerhouses. \n\nStop being such reactionary on topics you have no business discussing. I suggest you read a book first instead of listening to the fear mongering from cable news.",
                                                                            "score": 3,
                                                                            "author": "End_of_capitalism",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Read that last sentence you wrote again. That’s my whole point in a nutshell. The debt isn’t getting smaller it’s getting larger and at an unsustainable rate.",
                                                                    "score": 0,
                                                                    "author": "Dependent-Plate-6253",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "But it’s not like you or me having debt. The US doesn’t have to get the debt to 0. It just needs to keep it where people think they are capable of paying them back. It’s all about faith and not letting what happened to Greece happen to us",
                                                                            "score": 8,
                                                                            "author": "khalid1234569",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Then the idea is to stop spending less....not spend and walk out on the bill.",
                                                                            "score": 2,
                                                                            "author": "Pi99y92"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Legalize weed mannnnnn",
                                            "score": 7,
                                            "author": "alpachalunch",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This. Let us all be high for when the next depression happens",
                                                    "score": 7,
                                                    "author": "Dependent-Plate-6253",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They do say marijuana is a depressant",
                                                            "score": 1,
                                                            "author": "ROBINHOODEATADIK"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "3% rich tax, a sin tax for weed, raise the cap of SS and we should be gravy.",
                                                    "score": 5,
                                                    "author": "Upstairs_Hospital_94"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Many banks hold US treasuries, as evidenced by SVB and FRC",
                            "score": 6,
                            "author": "d3nv3rite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you’re not rich and have less than 250k you should be fine if your bank collapses",
                                    "score": 1,
                                    "author": "Dependent-Plate-6253",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You know how the big banks are too big to fail because they’re “systemically important?” They came by that label because they’re so intertwined with the US Treasury that the US government finances would be harmed if one of those banks failed. Imagine what will happen to those banks if the US government fails. It’s a 2 way street.",
                                            "score": 8,
                                            "author": "Imaginary_Scene2493"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Basically this. It’s the whole reason ultra rich people with deposits in SVB were losing their minds at the time. This shit don’t affect us poors, we’re already getting fucked by the economy.",
                                            "score": 7,
                                            "author": "mellowyellow313",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes but don’t worry some 900yr old woman named Janet Yellen will put us on the right track 😂 she couldn’t get a job in anywhere except government",
                                                    "score": 2,
                                                    "author": "Dependent-Plate-6253"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So markets should ROAR higher",
                                    "score": 1,
                                    "author": "RedditParker2021",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Markets can remain irrational longer than you can remain solvent” -John Maynard Keynes",
                                            "score": 5,
                                            "author": "LazeeBashtard",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "BTW: the military are government employees. So are all law enforcement and fire departments...and the federal government help states and cities pay their salaries.\n\nNot to mention all the \"useless\" government bureaucrats at the Department of Transportation, FAA, FDA, VA, etc. etc\n\nIF \"default\", GOTO \"we're all fucked\".",
                            "score": 16,
                            "author": "Draker-X",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t even get me started on military spending. Because it outweighs every other department you named and then some.",
                                    "score": 11,
                                    "author": "Dependent-Plate-6253",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's true. I also think we spend way too much money on the military \n\nBut I don't think the correct amount of money to spend on it is '$0.00\".",
                                            "score": 8,
                                            "author": "Draker-X",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No one said zero. But how about less than every other country COMBINED lol",
                                                    "score": 10,
                                                    "author": "khalid1234569",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The only thing is as a NATO nation we are required to spend 2% of our GDP on our military.  Not sure what we are spending but just wanted to throw that out there",
                                                            "score": 3,
                                                            "author": "Traditional-Newt1916"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "If the government defaults on it's debt and stops paying the bills (which is what this thread is about), the amount we spend will be $0.00. On everything.",
                                                            "score": 2,
                                                            "author": "Draker-X"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The only reason why the US still has power on other countries is because of the military power they hold and you are talking about reducing costs? Maybe not leaving billions of dollars worth of equipment on the middle east or sending billions of dollars to fund a war that's not ours its the solution.",
                                                    "score": -4,
                                                    "author": "Available_Advance728"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You’re joking right? The debt market would become insane. The financial world will be over as we know it",
                            "score": 6,
                            "author": "Mindless-Location784",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good thing I've been saving my bottle caps for the last 20 years",
                                    "score": 2,
                                    "author": "DarthSpartan113"
                                },
                                {
                                    "level": 3,
                                    "comment": "If we’re 25million from the financial world being over maybe there’s a bigger problem at hand than a debt limit",
                                    "score": 3,
                                    "author": "Dependent-Plate-6253"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is an economics sub. Your statement is nonsensical.",
                            "score": 3,
                            "author": "insertwittynamethere"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's what the GOP wants.",
                    "score": -9,
                    "author": "Ontario0000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "AAA baby",
            "score": 6,
            "author": "haidachigg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Soon to be AA+",
                    "score": 2,
                    "author": "bocboc86",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Should have been months ago. We shall see. Has that ever happened?",
                            "score": 2,
                            "author": "haidachigg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, in 2011. It wasn't a huge deal. Quick correction and the year ended positive by ~1%",
                                    "score": 6,
                                    "author": "PB0351"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone claim exempt on same date.",
            "score": 13,
            "author": "SenseStraight5119"
        },
        {
            "level": 0,
            "comment": "The USA has unlimited money.",
            "score": 11,
            "author": "PharmDinvestor",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. All this is just paper loss.",
                    "score": 2,
                    "author": "Weikoko"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, I see it now.  Jesus.",
            "score": 3,
            "author": "SuspiciousStable9649"
        },
        {
            "level": 0,
            "comment": "Washington Post, a few hours ago\n\n“The government already has reached the current debt limit of about $31.4 trillion, but it has relied on special, temporary accounting maneuvers to delay the need to borrow more”\n\n“Temporary accounting maneuvers”…..",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "GOP party playing with people's lives.Under Trump they raised it three times and the moron grew the deficit by 40%.All of sudden they are worried about debt again?.",
            "score": 37,
            "author": "Ontario0000",
            "replies": [
                {
                    "level": 1,
                    "comment": "The red states are always the poorest, but the GOP somehow is going to manage a budget",
                    "score": 8,
                    "author": "Philter_Billy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was told they hate socialist policies - surely they don’t redistribute wealth from the coastal elites right into their own states right???",
                            "score": 6,
                            "author": "Admirable_Purple1882",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Socialism for me but not for thee.",
                                    "score": 2,
                                    "author": "theregoesanother"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Standsrd practice when dem is president.",
                    "score": 19,
                    "author": "TiredOfBeingTired28"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the debt that's subtracted against today debt. Technically already over the limit, minus those debts brings us to the number just $25m below the debt ceiling. But I'm also not sure this data can be trusted, just yesterday it was like $69B left iirc",
                    "score": 1,
                    "author": "arenalr",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a shitpost. Obviously OP does not know how to read financial statements",
            "score": 4,
            "author": "Bulletpr00F-"
        },
        {
            "level": 0,
            "comment": "Lol! That’s $24.632 *trillion* of debt held by the public, $6.825 *trillion* in government interdepartmental holdings, etc. In other words, this itemizes the amount of the national debt. All these numbers are in millions, so when you see $24,632,499, you need to multiply it by one million, which adds 6 zeros.\n\nIt has nothing whatsoever to do with the amount of money the Treasury has left before we default!\n\nCome on, man!",
            "score": 4,
            "author": "Alive-Working669",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what I was thinking. It literally says rounded to millions on top\n\nAlso, $25 mil for 2 weeks? That’s like $650 mil per year. How would that make sense?",
                    "score": 1,
                    "author": "ses92"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice sounds like the US Congress to me",
            "score": 2,
            "author": "Unlikely_Field1622"
        },
        {
            "level": 0,
            "comment": "This post is 1 hour old, we all know they spent that shit already 😂",
            "score": 2,
            "author": "Dazzling_Marzipan474"
        },
        {
            "level": 0,
            "comment": "Same ol same ol. Fear based media",
            "score": 2,
            "author": "logical-3"
        },
        {
            "level": 0,
            "comment": "Government playing chicken with Wall Street… gonna be spicy 😂",
            "score": 2,
            "author": "myironcity"
        },
        {
            "level": 0,
            "comment": "\"edges harder\"",
            "score": 2,
            "author": "Due_Accountant9553"
        },
        {
            "level": 0,
            "comment": "Well, Cramer said he is confident an agreement will be reached. I am not sure how I feel about that.",
            "score": 2,
            "author": "duma0610"
        },
        {
            "level": 0,
            "comment": "When will we hit the next debt ceiling?  I need to buy all the stonks while people are freaking out.   \n\nThis is a political negotiating tool.  They would never willing default.   … then again politicians.",
            "score": 2,
            "author": "Imaginary_Artichoke"
        },
        {
            "level": 0,
            "comment": "If there's anything that proves modern economy and money is just the new chain and whip is seeing how much 'debt' countries or wealthy conglomerates have but still maintain power.\n\nMoney is only here to make you feel special when you are not.  Make you feel free when you are not. And make you divided from your peers so the party in power remains so",
            "score": 2,
            "author": "chasingcooper"
        },
        {
            "level": 0,
            "comment": "So like 5 minutes after this was posted?",
            "score": 2,
            "author": "buffinator2"
        },
        {
            "level": 0,
            "comment": "The plan is for Janet to bet the last 25 million all on red to keep us afloat. Let’s hope.",
            "score": 2,
            "author": "acdcurrent",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Aaaaand it’s gone.",
            "score": 2,
            "author": "DrDease"
        },
        {
            "level": 0,
            "comment": "Idk how people expect healthcare and college for all when they can't pay the debt it has now.",
            "score": 8,
            "author": "Battlecrashers12",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the idea is to tax incomes above 450k at a federal rate upwards of 52% (according to Bernie Sanders, that would be needed if we were to have Medicare for all). Trump tax cuts lowered their taxes to 30%. The last surplus was under Clinton (and Obama!) levels of taxation, 39% for high earners, which imo is just right.",
                    "score": 6,
                    "author": "chowmushi"
                },
                {
                    "level": 1,
                    "comment": "How every other first world country does it. By not spending more on your military than every other country in the world COMBINED",
                    "score": 2,
                    "author": "khalid1234569",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like the idea of universal healthcare.  I just don't trust our government to do it.  Maybe they can offer a rider type of insurance to cover gaps in people's insurance?",
                            "score": 1,
                            "author": "Battlecrashers12",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Money machine go brrrrrrrrrr",
            "score": 5,
            "author": "FarPear1126"
        },
        {
            "level": 0,
            "comment": "And yet TGA rose today. Should make it to June then nickel and dime it to July before any real issues start.",
            "score": 4,
            "author": "Blackout38"
        },
        {
            "level": 0,
            "comment": "What is the point of the debt ceiling? It seems like any time they get close to it they just raise it. Why even set one if they have no intention of ever actually using it?",
            "score": 3,
            "author": "inthemindofadogg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Negotiating token for any future minority party",
                    "score": 3,
                    "author": "pippylongwhiskers"
                },
                {
                    "level": 1,
                    "comment": "Dems would eliminate it if they could. GOP uses it as leverage to undo programs that the Dems approved.",
                    "score": 4,
                    "author": "Imaginary_Scene2493"
                },
                {
                    "level": 1,
                    "comment": "They gotta look like they're doing something besides enriching themselves",
                    "score": 1,
                    "author": "Original_Wall_3690"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congress will only get it done once the market starts to fall, and the markets won’t react till we default",
            "score": 2,
            "author": "bocboc86",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's not true at all. The market dropped over 10% in 2011 and we didn't default.",
                    "score": 3,
                    "author": "PB0351",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was trying to say a default is what it will take for markets to react this time",
                            "score": 1,
                            "author": "bocboc86",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why would it be different this time?",
                                    "score": 2,
                                    "author": "PB0351",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In 2011 the 2 sides just seemed to be working at the negotiating harder, Obama and Boehner saw each other for months before the deadline looking for common ground. There’s the different political landscape, after 2011 dems felt it was a mistake to negotiate, and for the gop McCarthy has little room because of the conservative wings demands.  I’m sure it will come together in the last minute, but if it doesn’t that’s when markets will fall",
                                            "score": 2,
                                            "author": "bocboc86",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think you're confusing default with us passing the date at which extraordinary measures run out. Default will come much, much later than the deadline everyone is talking about.",
                                                    "score": 2,
                                                    "author": "PB0351",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They’ll send that to Ukraine.",
            "score": -3,
            "author": "Haunting-Abrocoma940",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m glad we are protecting our allies and the future of our planet",
                    "score": 13,
                    "author": "bitcoins",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who cares!!! Stop 🛑 spending money on stupid stuff!!!",
            "score": 1,
            "author": "Independent-Row8004",
            "replies": [
                {
                    "level": 1,
                    "comment": "The infrastructure bill, the CHIPS act, the inflation reduction act, the pact act, the green new deal. These sound like overdue investments in America, not investments in millionaires and billionaires. If you spent a bunch of money on investments in your 401k you would have a better future right?\n\nAll I have heard is \"Rampant wasteful spending\" but I never hear people say what they are actually wasting on.\n\nMcCarthy wants to give members a a 30k a year raise by skirting it as \"compensation\" but allows it to pay for gas, food, lodging, etc. But wants to cut Veterans benefits by 22%, medicaid and SNAP benefits.\n\nIt's despicable we raised the ceiling for Trump 3 times while he printed more money then any president in history for the rich, but Biden is spending too much and now Republicans are going to hold the world economy hostage for it. We already approved the money through Congress, pay the fucking debt and negotiate spending later.",
                    "score": 14,
                    "author": "LogicalPsychonaut84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden will give 27 billion more just to make sure we are totally screwed",
            "score": -2,
            "author": "Vladphotography_"
        },
        {
            "level": 0,
            "comment": "Lol. It’s actually billion.",
            "score": 1,
            "author": "Jabroni_16",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Do you really think that means a damn thing?",
            "score": 1,
            "author": "neildmaster"
        },
        {
            "level": 0,
            "comment": "So 12 minutes until the end.",
            "score": 1,
            "author": "HannyBo9"
        },
        {
            "level": 0,
            "comment": "Let it burn",
            "score": 1,
            "author": "bellevan87"
        },
        {
            "level": 0,
            "comment": "Can we get a loan from Nanci Pelosi’s portfolio?",
            "score": 0,
            "author": "Electronic_Permit300"
        },
        {
            "level": 0,
            "comment": "They should give the rest to Ukraine.. because why not. Let’s collapse the US economy 👍👍 right Biden",
            "score": -3,
            "author": "1mattcotrades",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Rock n roll",
            "score": 1,
            "author": "cheeeky_"
        },
        {
            "level": 0,
            "comment": "How do you find this?",
            "score": 1,
            "author": "OptionsTendieGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "[treasury’s site](https://fsapps.fiscal.treasury.gov/dts/issues)",
                    "score": 3,
                    "author": "bocboc86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’ll be raised by tomorrow/Friday",
            "score": 1,
            "author": "swouterrimempire"
        },
        {
            "level": 0,
            "comment": "Doesn't this say there's ~76Billion left to borrow?\n\nAlso this doesn't account for the current balance from income (taxes).",
            "score": 1,
            "author": "BadInvestmentAdvisor"
        },
        {
            "level": 0,
            "comment": "It already price in bro. To the moon we go",
            "score": 1,
            "author": "backruptcyfomo"
        },
        {
            "level": 0,
            "comment": "So a half day of paying part of Congress. \n\nGreat.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "We pass through it already , the roof is on fire",
            "score": 1,
            "author": "chewpah"
        },
        {
            "level": 0,
            "comment": "US US DOOMED!",
            "score": 1,
            "author": "maryjhaneIT"
        },
        {
            "level": 0,
            "comment": "If was increased on 16th December 2021 then what is the issue to increase it again after 1. 5 year?\n\nAnd increase it further in December 2024, June 2026, December 2027 etc\n\nIs there any law in economics which say you could not increase it perpetually?",
            "score": 1,
            "author": "AlexJiang27"
        },
        {
            "level": 0,
            "comment": "Oh no. We can only afford 35,000 of those over priced aluminum ladders",
            "score": 1,
            "author": "DisconnectedDays"
        },
        {
            "level": 0,
            "comment": "Posted one hour ago. Now there's only 14 million dollars left.",
            "score": 1,
            "author": "Stationary-Event"
        },
        {
            "level": 0,
            "comment": "Oh no, I’m so scared. I’ve never seen this happen before!",
            "score": 1,
            "author": "Gotl0stinthesauce"
        },
        {
            "level": 0,
            "comment": "That's enough slicing!!!",
            "score": 1,
            "author": "Adventurous_Money174"
        },
        {
            "level": 0,
            "comment": "The US is cooked",
            "score": 1,
            "author": "Electrical-Jury-1343"
        },
        {
            "level": 0,
            "comment": "thats million millions.... so its trillion ?",
            "score": 1,
            "author": "pine1501"
        },
        {
            "level": 0,
            "comment": "\"ceiling\"",
            "score": 1,
            "author": "uhwhooops"
        },
        {
            "level": 0,
            "comment": "The government spends about $435m an hour.",
            "score": 1,
            "author": "dmharvey79"
        },
        {
            "level": 0,
            "comment": "Well I guess it's time for war with our biggest creditor. I'm sure we will find a way to instigate them into throwing the first punch.",
            "score": 1,
            "author": "Sporesword"
        }
    ]
}