{
    "id": "13nahkt",
    "score": 14,
    "title": "Intel Stock Evaluation + AMD Benchmark: Price Target Rage, deep analysis",
    "author": "Charoenlai",
    "date": 1684620118.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/13nahkt",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/stocks/comments/13iao0c/give_me_a_stock_and_name_me_its_main_competitor_i/?utm_source=share&amp;utm_medium=web2x&amp;context=3),",
        "https://preview.redd.it/iw005cje521b1.png?width=1608&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2ed8a27c99a4affe2d2063f885667c4599a647a7",
        "https://preview.redd.it/o7gqz5n1521b1.png?width=898&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c2b22127b1a4828e8d1d78c54a8546c39fce8496",
        "https://preview.redd.it/oaag2xr3521b1.png?width=1826&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e24eaa55db556e91b55ac494be4d8f03cc7f28c2",
        "https://preview.redd.it/nvazw1v5521b1.png?width=2776&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=0fde6b66ef0db756e207d482b3f14f6b015191ff"
    ],
    "postText": "Hey Reddit!\n\nLast week [I asked Redditors to give me a stock and its main competitor](https://www.reddit.com/r/stocks/comments/13iao0c/give_me_a_stock_and_name_me_its_main_competitor_i/?utm_source=share&amp;utm_medium=web2x&amp;context=3), so I can do an in deep stock analysis on them and here I am! Keep in mind that what you are going to read is just a small pice of a 30 page thesis and analysis on the company, I also made a financial model too! took me a lot of time and effort, but I am happy I can deliver!\n\nJust want to know the main takes? just read the TL:DR, but for an in deep analysis of the fundamentals you need to read also the pdf paper I have, just dm me if you are curious!\n\nP.S. at the bottom you will find some pics of the financial modelling.\n\nTL:DR\n\n&gt;**INTC Price $32; Price Range Target: $29 to $36**  \n&gt;  \n&gt;**AMD Price $109; Price Range Target: $98 to $120**  \n&gt;  \n&gt;*The global chip industry is facing challenges of shortages and oversupply, leading to a decline in market capitalization. Factors such as rising interest rates, high inflation, diminished consumer confidence, and stock market retreats have contributed to this decline. The industry still faces elevated lead times and a shortage of certain types of chips. Geopolitical factors, such as the conflict in Ukraine and US export regulations, also impact the industry. Companies are implementing cost-cutting measures and reducing expenditures. There are opportunities for the industry to focus on manufacturing closer to home, digital transformation, talent management, and achieving environmental goals. Different regions have different strategies for their semiconductor supply chains. Intel, as a leading semiconductor company, faces competition from AMD, NVIDIA, Qualcomm, TSMC, and Samsung.*  \n&gt;  \n&gt;*Intel's financial performance has declined due to market conditions, high expenses, and cash flow challenges. The company is working to manage working capital, but its profitability and returns on investment have decreased. Future forecasts suggest potential growth in earnings.*  \n&gt;  \n&gt;*Based on the Discounted Free Cash Flow to Equity approach, Intel's value is estimated to be at least $148 billion, with a fair value per share of around $32. Accounting for a 10% margin of error, the fair value range is between $29 and $36. Using Graham's Fair Value model, Intel's ideal price is calculated to be $58.45. Applying Graham's Number formula, the Fair Value is determined to be $32.51, which aligns closely with the price estimated by the DCF model. Overall, the fair value of Intel's stock ranges between $29 and $58.45, depending on the methodology used.*  \n&gt;  \n&gt;*With the DCF Model AMD's value is estimated to be at least $173 billion, with a fair value per share of around $109. Considering a 10% margin of error, the fair value range is between $98 and $120. Using Graham's Fair Value model, AMD's ideal price is calculated to be $103, which aligns closely with the value estimated by the Discounted Free Cash Flow to Equity model. Applying Graham's Number formula, a Fair Value of $26 is obtained. This suggests that a significant portion of AMD's market value may be driven by market sentiment.*  \n&gt;  \n&gt;*Intel is currently facing scrutiny from investors and customers due to perceived stagnation and a lack of innovation. However, the company's strong financial position, substantial revenues, valuable assets, and favorable relations with the US government indicate that it is far from being on the verge of collapse. While competition has increased, Intel remains a powerful company capable of influencing markets and generating wealth. It is expected that this increased competition will serve as a catalyst for Intel to revive its innovation and competitiveness in the industry.*\n\nhttps://preview.redd.it/iw005cje521b1.png?width=1608&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2ed8a27c99a4affe2d2063f885667c4599a647a7\n\n# Background\n\nScientific and technological advancements have led to an increasing reliance on advanced machines in our daily lives, making us more dependent on them. Whether it's communication, connectivity, transportation, or various aspects of the economy such as finance and production, these remarkable achievements of humanity owe their existence to microchips, which serve as their brains. The significance of microchip production cannot be understated, as our modern society would be fundamentally different without them. This is why major powers like the United States of America, the Russian Federation, and the People's Republic of China prioritize the production of microchips. It not only supports their defense sectors but also boosts domestic production and consumption, thereby strengthening the overall economy. Among the numerous companies involved in manufacturing this precious resource of the 21st century, our focus in this paper is on Intel Corporation.\n\n# Purpose\n\nThe objective of this thesis is to evaluate the progress of Intel Corporation (INTC) over the previous five years, spanning from 2018 to 2022. It encompasses more than just the financial statements, encompassing a comprehensive assessment that includes a comparison to its primary rival, Advanced Micro Device (AMD), as well as an analysis of the market conditions. These efforts aim to ascertain the equitable valuation of the stock price and devise an investment strategy.\n\n# Methodology\n\nWithin this paper, the financial data utilized is sourced from SEC filings, Yahoo Finance, and other publicly accessible information pertaining to the company online. The valuation of the company is derived by considering the following methods:\n\n* Discounted Free Cash Flow\n* Graham's Fair Value\n* Graham's Number\n\n# Industry Outlook\n\n**Overview**\n\nThe global chip industry faces a challenging scenario where shortages and oversupply coincide, presenting a significant concern. As we enter 2023, macroeconomic and geopolitical factors are emerging as the dominant forces shaping the semiconductor sector. Various factors have contributed in a substantial decline in the sector’s market capitalization. Factors such as: Rising interest rates; High inflation; Diminished consumer confidence; Stock market retreats led by the technology sector; The combined market cap of the top 10 global chip companies dropped by 34% from US$2.9 trillion in November 2021 to US$1.9 trillion in November 202 The Philadelphia Semiconductor index experienced a decline of 45% since January and closed the year down by 37% in October 2022. While high-end memory prices dropped by 50% over the past year, the supply chain for phones, personal computers, and data centers has largely normalized in terms of lead times. However, the industry as a whole still faces elevated lead times of around 25.5 weeks, compared to the usual 10-14 weeks as of October 2022.\n\nMoreover, there is still a severe shortage of certain types of chips, particularly power management and microcontrollers that are crucial for industries such as automotive. Adding to these challenges, the conflict in Ukraine has disrupted supply chains, access to vital raw materials, and energy prices worldwide, particularly in Europe. These disruptions are expected to persist throughout 2023. Additionally, the US government's measures in October 2022 to tighten regulations on the export of advanced semiconductor technologies to China are likely to have a significant impact on the entire industry and its downstream customers in 2023. In response to increased capital costs, inventory drawdowns, and declining earnings, many chip companies are implementing cost-cutting measures, reducing employee headcounts, and postponing capital expenditures for additional capacity. It should be noted that while capital expenditure spending in 2023 is expected to surpass that of 2020, it will be lower than previously anticipated.\n\nDespite the challenges, there may be opportunities for the industry to shift its focus beyond merely catching up during a shortage. 2023 could serve as a moment to pause and allow the semiconductor industry to consider five significant aspects:\n\n* Bringing manufacturing closer to home through the establishment of new fabs and the expansion of existing facilities, emphasizing the use of friendshoring, where countries and regions recognize the need for trusted allies in their semiconductor supply chain.\n* Managing the risks and challenges associated with localization and friendshoring. Implementing digital transformation and digitization across various processes, including financial planning and operations, order management, and supply chain management.\n* Addressing and balancing the talent equation in the semiconductor industry, which includes shortages in certain roles and layoffs in others.\n* Establishing and accelerating progress towards achieving environmental, social, and governance (ESG) goals, with a particular focus on sustainability.\n\nIn both the United States and Europe, there is a growing emphasis on enhancing domestic industrial capacity in the chipmaking sector while acknowledging that complete self-sufficiency may not be feasible. As highlighted by Ursula von der Leyen, president of the European Commission, in introducing the EU Chips Act, no country or continent can be entirely self-sufficient.\n\nIt's important to note that \"chips\" encompass various categories, such as memory, logic, mixed signal, and power semiconductors, each serving different end markets (e.g., smartphones, PCs, and automotive). These chips require different wafer sizes, process technologies, materials, facilities, equipment, design tools, radiation tolerance, and more.\n\nThe semiconductor industry operates under two primary models: the fabless/foundry/OSAT ecosystem and the integrated device manufacturing model (IDM), which combines all three roles. Manufacturing processes are diverse, relying on multiple semiconductor materials, specialized epoxies, and a wide range of fabrication, testing, and assembly equipment. Some critical components may have only one manufacturer or source, while the concentration of facilities can increase risks associated with natural disasters, conflicts, power shortages, or other disruptions.\n\n# Main Competitors\n\nIntel, being the sole cutting-edge semiconductor firm in the United States engaged in both technology development and manufacturing, exerts a far-reaching influence on all sectors of the national economy and enjoys a strategic edge over its rivals. Moreover, it holds the distinction of being the largest publicly traded semiconductor chip manufacturer in the US. Intel's noteworthy contribution lies in the invention of the x86 microprocessor, an integral component found in nearly all modern personal computers. Despite its dominant position, Intel operates within a highly competitive landscape, contending with numerous players vying for market dominance. Presented below are a few of Intel's primary contenders in the industry:\n\n* **Advanced Micro Devices (AMD):** AMD is a major competitor to Intel in the semiconductor industry, particularly in the market for x86 microprocessors. AMD has gained market share in recent years with its Ryzen processors, offering strong competition to Intel's offerings.\n* **NVIDIA Corporation (NVDA):** While primarily known for its graphics processing units (GPUs), NVIDIA has expanded into other areas, including data center processors and artificial intelligence (AI) chips. Intel and NVIDIA compete in the data center and AI markets, where both companies strive to provide high-performance computing solutions.\n* **Qualcomm Incorporated (QCOM):** Qualcomm is a leading semiconductor company specializing in wireless technologies, particularly in the mobile and telecommunications sectors. Intel and Qualcomm compete in areas such as mobile processors and wireless connectivity solutions.\n* **Taiwan Semiconductor Manufacturing Company (TSMC):** TSMC is one of the world's largest semiconductor foundries and manufactures chips for various companies, including Intel's competitors. As a foundry, TSMC competes indirectly with Intel by providing manufacturing services to companies developing their own chip designs.\n* **Samsung Electronics (005930)**: Samsung is a major player in the semiconductor industry, manufacturing a wide range of chips, including memory chips, application processors, and image sensors. Samsung competes with Intel in various segments, such as memory chips and mobile processors.\n\nThese are just a few examples of Intel's main competitors in the semiconductor industry. The market is highly dynamic, with new players and emerging technologies constantly shaping the competitive landscape. In this paper, AMD will be the main benchmark value used to evaluate INTC.\n\nhttps://preview.redd.it/o7gqz5n1521b1.png?width=898&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c2b22127b1a4828e8d1d78c54a8546c39fce8496\n\nhttps://preview.redd.it/oaag2xr3521b1.png?width=1826&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e24eaa55db556e91b55ac494be4d8f03cc7f28c2\n\nhttps://preview.redd.it/nvazw1v5521b1.png?width=2776&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=0fde6b66ef0db756e207d482b3f14f6b015191ff\n\n# Conclusions\n\n**Disclaimer**\n\nWe shall analyse and forecast our predictions by keeping always in mind that the future is always mutable and nothing shall be taken for granted. The market sentiment, the overall status of the economy or black swans events can disrupt every analysts predictions. By knowing this, it is advisable to review ones investing strategy and goals periodically in order to top up the most recent data into the models and be always prepared for outliers. This paper is not financial advice and shall be used to support one own due diligence and research.\n\n**The Future**\n\nIntel Corporation has undergone a transformation to regain its engineering edge and focus on software and hardware engineering. Under CEO Pat Gelsinger, the company aims to reclaim its manufacturing leadership and become a chipmaker for the world. Intel's IDM 2.0 strategy involves becoming a \"systems foundry\" and partnering with TSMC and Samsung for chip design and connectivity interfaces. The company is investing in new factories and acquiring Tower Semiconductor to expand its chip offerings. However, Intel faces challenges such as managing costs, navigating geopolitical shifts, and complying with regulations. The company is advancing chip scaling, performance, packaging, and software solutions. Intel is also open to partnerships with smaller chipmakers to drive business to its factories. External customers will have access to Intel's advanced processes, including Intel 18A in the coming years.\n\n**Conclusions**\n\nINTC is going under heavy scrutiny by investors and customers due to their stagnation and lack of innovation. The Gigant that dominated the market probably is falling, we cannot be sure, but it is certain that the management will try to turn things around. With still big revenues, huge cash positions and assets, and expecially with the US Government favours, they are far from dying. The company, compare to its main Rival, it is still a powerful company capable to moving markets and generating wealth. We are certain that this little competition will awake the sleeping company.",
    "comments": [
        {
            "level": 0,
            "comment": "Whole analysis where Sir? 😉🤞",
            "score": 3,
            "author": "M-3X"
        },
        {
            "level": 0,
            "comment": "INTC is my gamble right now.",
            "score": 2,
            "author": "LiveInLayers"
        },
        {
            "level": 0,
            "comment": "So buy NVDA?   Got it",
            "score": 1,
            "author": "Level_Inspector7002"
        },
        {
            "level": 0,
            "comment": "My only concern is that you do not really break down the main technological offerings of either Intel or AMD. This may be something that you assume we know and just leave it out for simplicity sake, but a technology company needs to be analyzed by its technology.\n\nInvestors made a similar mistake to the one listed above over the last five years in Intel. Investors rely solely on the financials and ignore the underlying technologies of the business. Some things that should be considered are:\n\n1. TSMC is generations ahead of Intel in manufacturing processes\n2. Intel's main direct competitors use TSMC\n3. Intel and AMD utilize x86 chip architecture which is at a disadvantage in lower power devices such as laptops when compared to x64 ARM chips\n4. Intel's offerings are technologically inferior to AMD and Nvidia's offerings in datacenters\n5. IDM 2.0 is a massive financial risk for Intel and is utilizing billions in capital investment a year\n\nI think there is much more qualitative research that would need to be conducted to definitively make a conclusion on these businesses",
            "score": 1,
            "author": "TheMorningTraffic"
        }
    ]
}