{
    "id": "13nd7yb",
    "score": 356,
    "title": "The most expensive investing book sells for thousands and Warren Buffett is said to have a copy of it on his desk. “Margin of Safety: Risk-Averse Value Investing Strategies” by Seth Klarman (a billionaire hedge-fund manager) was published in 1991 and Klarman's hedge fund averaged a 20% annual return",
    "author": "TonyLiberty",
    "date": 1684627327.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/13nd7yb",
    "media_urls": [
        "https://www.wsj.com/articles/investing-book-seth-klarman-baupost-8cf54924"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I assume it's a collectible item, since anyone can just get the pdf here. \n\nhttps://libgen.is/search.php?req=margin+of+safety&amp;lg_topic=libgen&amp;open=0&amp;view=simple&amp;res=25&amp;phrase=1&amp;column=def",
            "score": 278,
            "author": "bendover912",
            "replies": [
                {
                    "level": 1,
                    "comment": "^(shhhh. You're going to ruin our tax write-off business expenses.)",
                    "score": 83,
                    "author": "Better-Protection-23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A company still does not earn more money with a tax write off. They still pay the expense. I’ll show you with two scenarios, in scenario B, they will buy a “book” for 10 dollars and deduct it as a business expense.\n\n\nScenario A:\n\nRevenue : 100\n\nExpenses: 50\n\nIncome before tax: 50\n\nTax: (50*tax rate) [say it’s .2]\n\nProfit: 40\n\n————————\n\nScenario B\n\nRevenue : 100\n\nExpenses: 60 (because they bought the book)\n\n\nIncome before tax: 40\n\nTax: (40*tax rate) [say it’s .2]\n\nProfit: 32 \n\n\nSo the owner of the company doesn’t get more profit, they make less. All the book does as a “tax deductible/ write off” is increase their expenses and thus lower the company’s profit and total tax paid (because they had higher expenses). It’s only useful in the sense that you can reinvest in the business with pretax money (buy a new plant to expand your business). This is exactly the point of deductions because the government will inevitably earn more as the company expands its operations. Thus tax deductions incentivize growth, because this means tax revenues will grow as well.",
                            "score": 29,
                            "author": "SeaworthinessOwn3754",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What if in Scenario A the company reclassifies $10 of its $50 in expenses into a write-off, thus saving marginal tax cost? To me, that's the crux of tax write offs; not that you go \"spend money to make money,\" but that you retroactively discount taxes on things you're already doing.",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can only write off certain things. You can’t just write off whatever you want. Ultimately in the short term the company reduces its tax liability by writing off an expense, but the purpose of the write of is that the government wants to incentivize certain business expenses. The idea being that growth will be a win win\n\nI don’t know what you mean by reclassifying a write off. A write off has no other benefit then acting as an expense.",
                                            "score": 2,
                                            "author": "SeaworthinessOwn3754",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I suppose this is a mostly pointless and pedantic discussion, but the point you made that I chose to disagree with was \"A company still does not earn more money with a tax write off.\"  \n\n\nThat statement is only true if a company chooses to go spend more money in order to gain a tax write off. The statement is not true if a law changes such that an existing expense becomes a tax write off. \"Tax write offs\" do \"save money\" when the thing that changes is what gets classified as a write off, rather than the variable being total expenses.\n\n&amp;#x200B;\n\nThe original point being made in comments above expressed a comedic fear that a law might change such that an existing expense (ie, buying the book) might no longer be classified as a write-off, meaning the tax advantage would go away.\n\n&amp;#x200B;\n\nHopefully that makes sense. I apologize for choosing to argue about something meaningless on the internet tonight.",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "^(shhh don't tell the poors that. You're too close to) [^(letting them find out about our borrowed money tax loopholes)](https://www.credello.com/financial-resources/trending/billionaires-leverage-debt-to-avoid-paying-taxes/)^(. Don't educate them.)",
                                    "score": 1,
                                    "author": "Better-Protection-23",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The idea behind borrowing money from assets not being taxable is because you can only tax an economic gain. If you pulled out equity from your house via a heloc loan, would you want the government to tax your loan? No because the 20k heloc you pull from your house is transferring 20k from equity in your house into 20k of cash via a loan. Your net worth has not changed and you have not created an economic gain. In fact, you will lose money due to the interest cost associated with the loan. \n\nAlso this system only works in very low interest rate environments and In environments where your confident your assets will increase in value. Great in 2020, not so great today",
                                            "score": 1,
                                            "author": "SeaworthinessOwn3754"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Psh, everyone knows you can't just download the book. It has DRM.",
                    "score": 13,
                    "author": "AcapellaFreakout"
                },
                {
                    "level": 1,
                    "comment": "How much does it go for unbounded?",
                    "score": 4,
                    "author": "Current_Speaker_5684"
                },
                {
                    "level": 1,
                    "comment": "True hero",
                    "score": 1,
                    "author": "Ecstatic-Passage-113"
                },
                {
                    "level": 1,
                    "comment": "I was going to do just this, I love you for beating me to it",
                    "score": -2,
                    "author": "MrMediaShill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seth Klarman has made his money investing in very specialist scenarios where no one sees value. They're often drawn out in the legal system so it's not just a buy and hold thing.",
            "score": 28,
            "author": "Jewiscohencidence",
            "replies": [
                {
                    "level": 1,
                    "comment": "Insider Trading before it was called insider trading?",
                    "score": 19,
                    "author": "01000101010001010"
                },
                {
                    "level": 1,
                    "comment": "So he invests in Deep Fucking Value?",
                    "score": 6,
                    "author": "MrMediaShill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if Cramer recommended that book?\n\n🤔",
            "score": 69,
            "author": "UrinalCakeTreats",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would collapse onto itself and turn into a black hole that instantly sucks in our entire solar system.",
                    "score": 33,
                    "author": "DoritoSteroid"
                },
                {
                    "level": 1,
                    "comment": "The matrix breaks",
                    "score": 2,
                    "author": "the_monkey_knows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yea it’s a collectible item. I wouldn’t mind owning one but it’s honestly not that great of a book.",
            "score": 37,
            "author": "Fito3005"
        },
        {
            "level": 0,
            "comment": "\n$4,942.42\n \nAdd to Cart\n$3.99 delivery May 26 - June 13. Details",
            "score": 21,
            "author": "Dealer210"
        },
        {
            "level": 0,
            "comment": "Margin of safety  huh.    That means understanding real numbers",
            "score": 4,
            "author": "batmano7",
            "replies": [
                {
                    "level": 1,
                    "comment": "My moral hazard level is over 9000",
                    "score": 3,
                    "author": "sneakysnake128"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bought a book for $999 back in the day \"Secret banking and Power of a 2nd passport\"",
            "score": 3,
            "author": "shadowpawn"
        },
        {
            "level": 0,
            "comment": "i read it and it is not that great actually.",
            "score": 3,
            "author": "Fukitol_shareholder"
        },
        {
            "level": 0,
            "comment": "Or here https://www.pdfdrive.com/margin-of-safety-risk-averse-value-investing-strategies-for-the-thoughtful-investor-e193573234.html",
            "score": 6,
            "author": "biscuits2101"
        },
        {
            "level": 0,
            "comment": "Luck doesn't come from a book.",
            "score": 3,
            "author": "Most_Sir8172"
        },
        {
            "level": 0,
            "comment": "I'll summarize the entire book for you  : Put shekels in Ass&amp;Pee etf  hurrr....",
            "score": 1,
            "author": "Flimsy_Card8028"
        }
    ]
}