{
    "id": "13szet7",
    "score": 7,
    "title": "3 reasons to buy Shopify Stock ($SHOP)",
    "author": "Ben_aid",
    "date": 1685166863.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/13szet7",
    "media_urls": [],
    "other_urls": [
        "https://preview.redd.it/zrfonsbgtc2b1.png?width=874&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d755e4fb7be589cc8569cac169151f74c2f5d8cf",
        "https://preview.redd.it/4x7sh8vltc2b1.png?width=718&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=40d4c2b5e052955246fdb8e5f8bee4e030113679"
    ],
    "postText": " \n\n* **Shopify's platform is boosting engagement.**\n* **Watch for higher margins, despite pressures from a tilt toward payments processing.**\n\n## The platform will likely see stronger earnings growth over the next few years.\n\nInvestors found many good reasons to like Shopify ($SHOP) in recent weeks. The e-commerce platform specialist reported solid operating results to start fiscal 2023, and its earnings prospects have improved with its pivot away from the costly shipping-logistics business. Shares responded by soaring in the wake of management's early May earnings update.\n\nYet investors might still be facing sticker shock from Shopify's pricey valuation. Let's look at a few reasons shares seem like a good buy, even following the latest rally.\n\n## 1. Concrete results\n\nWall Street's attention focused on Shopify's strategic pivot away from the logistics business, mainly because this move is likely to accelerate the company's return to profitability. Executives admitted to overextending themselves on spending in 2022, and the sale of the logistics platform represents an aggressive shift toward a simpler, more efficient business.\n\nhttps://preview.redd.it/zrfonsbgtc2b1.png?width=874&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d755e4fb7be589cc8569cac169151f74c2f5d8cf\n\nBut investors also have concrete reasons to be optimistic about Shopify's current growth trends. Sales volumes rose a healthy 18% through late March. The company saw strong demand for its subscription services, too, despite recent price increases.\n\n## 2. Improving cash outlook\n\nShopify is still booking losses, which remains a key concern for investors. Gross profit margin declined to 48% of sales from 53% of sales a year ago.\n\n Most of this drop was powered by its growing payments-processing service, though, which isn't as profitable as its core services. Adjusted operating loss was 2% of revenue, compared to a 4% profit in the previous quarter. \n\nhttps://preview.redd.it/4x7sh8vltc2b1.png?width=718&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=40d4c2b5e052955246fdb8e5f8bee4e030113679\n\nShopify's cash-flow trends are finally heading in the right direction. Management is calling for positive cash flow in each quarter of the new fiscal year, in fact, which would mark a big step back toward sustainable profitability. Operating expenses have now stabilized, chief financial officer Jeff Hoffmeister said in a conference call with investors. \"This directly reflects our focus ... to drive increased productivity and efficiency,\" Hoffmeister said.\n\n## 3. Customer satisfaction\n\nShopify's ability to grow into its premium valuation will depend on the platform's success at deepening its relationship with a growing base of customers. It will face intense competition on this score from companies aiming to win merchants over. \n\nBut there are signs of enduring competitive advantages in Shopify's e-commerce platform. The company's \"attach rate,\" which describes average merchant spending for a given level of sales volume, hit a record high in the first quarter. \"Merchants continue to buy more and more solutions from us,\" Hoffmeister said.\n\nCautious investors have many reasons to wait when considering Shopify stock, including its current net losses and the stock's price-to-sales ratio of 13. Microsoft shares are valued at 11 times revenue, for context.\n\nYet growth-focused investors should consider keeping Shopify on their watch lists -- if not in their portfolios -- right now. The company is positioned for a return to profitability soon, and the platform has a shot at meaningfully adding to its current market share of around 10% of e-commerce volumes in the core U.S. market. A cloudy economic outlook for the next few quarters shouldn't scare investors away from what appears to be a very positive long-term growth story for Shopify.",
    "comments": [
        {
            "level": 0,
            "comment": "I never understood the attraction to this company. It is just a shopping cart program for a website, crying out loud.\n\nSee how many are free,\n\nhttps://extensions.joomla.org/tags/shopping-cart/",
            "score": 4,
            "author": "Steve_Mellow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree - just a shopping cart….\nI turned Netflix down back when it was a penny stock because it was basically mail order DVDs —/ \nLol \n\nI bought Revlon\nI stick mainly to ETFs now",
                    "score": 2,
                    "author": "TravestyinCT"
                },
                {
                    "level": 1,
                    "comment": "For a long time the hype was \"they're building a physical logistics and fulfillment network that will rival Amazon\" which made even less sense to me given how hard that is and the capex required, but people believed in it somehow.  Now that effort has been canceled so we're mostly back to what you said.",
                    "score": 0,
                    "author": "Worf_Of_Wall_St"
                },
                {
                    "level": 1,
                    "comment": "Same here",
                    "score": 0,
                    "author": "Rare-Philosopher1791"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an employee whose store fully runs on Shopify software, I absolutely hate Shopify. Poorly designed glitchy software that only works when connected to the internet. \n\nI would never buy a single share of this company simply because I’ve seen how poorly their product performs IRL. Shopify will be the next Peloton imo",
            "score": 3,
            "author": "Ordinary_Ad7229",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same and agreed. \n\nTheir customer service is also quite terrible these days (my company is on a Shopify+ account). From what I’ve heard from their internal team, things have been a shitshow since layoffs last year. \n\nThey ship bugs into production regularly and do not give customers a heads up about issues.",
                    "score": 0,
                    "author": "paradisel0st"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1 reason to buy puts on Shopify : Cramer is bullish on it",
            "score": 0,
            "author": "bstzabeast",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great, guess I'm selling then",
                    "score": 1,
                    "author": "CombinationNo1233",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 1,538,705,027 comments, and only 291,339 of them were in alphabetical order.",
                            "score": -1,
                            "author": "alphabet_order_bot"
                        }
                    ]
                }
            ]
        }
    ]
}