{
    "id": "13v1k6t",
    "score": 14,
    "title": "El Niño is coming back and I wonder how it will turn the global market",
    "author": "superbilliam",
    "date": 1685382512.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/13v1k6t",
    "media_urls": [
        "https://home.dartmouth.edu/news/2023/05/years-after-el-nino-global-economy-loses-trillions"
    ],
    "other_urls": [],
    "postText": "I wonder what this potential turn in the weather will do to the economy.  How will it affect the markets?  \n\n\n\nFrom the article: \"The researchers estimate that the El Niño predicted for 2023 alone could hold the global economy back by as much as $3 trillion by 2029.\"",
    "comments": [
        {
            "level": 0,
            "comment": "Its going to heat things up thats for sure.",
            "score": 5,
            "author": "keldarepew",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ha!  True that 😅 Mostly ocean waters it seems like.",
                    "score": 3,
                    "author": "superbilliam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ma boy nelly said it best: it’s get in hot in her, take of all yer cloths.",
            "score": 5,
            "author": "Adorable_Ad8515"
        },
        {
            "level": 0,
            "comment": "Is that the wet one or the dry one?",
            "score": 1,
            "author": "Malvania",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depends on where you live. Dry in the northeast, warmer in the northwest, wetter on the south.",
                    "score": 2,
                    "author": "AmateurMinute"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll be watching for effects on agriculture and subsequent fluctuations in food markets.  Seems like an area that may be affected by weather abnormalities.   I really thought more people might want to discuss how we could potentially profit from this.  I suppose it is harsh to say it that way, but we all need money in retirement....",
            "score": 1,
            "author": "superbilliam"
        },
        {
            "level": 0,
            "comment": "How ironic, we are experiencing a global financial meltdown and we use weather as a distraction. How politically motivated is this? LOL 😂 It must be election season already and the “party” must be losing it.",
            "score": -3,
            "author": "RESETwithCrypto_NIO",
            "replies": [
                {
                    "level": 1,
                    "comment": "You silly…don’t you know that everything is the weather’s fault and only more taxes will save the weather",
                    "score": 1,
                    "author": "Significant_Stuff_92"
                }
            ]
        }
    ]
}