{
    "id": "13vlc58",
    "score": 0,
    "title": "Does crypto success depend on the upcoming presidential election?",
    "author": "Ben_aid",
    "date": 1685438379.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/13vlc58",
    "media_urls": [
        "https://www.coindesk.com/markets/2023/05/30/first-mover-asia-does-cryptos-success-depend-on-the-upcoming-presidential-election/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Crypto success in the U.S. perhaps, but it's here to stay in the rest of the world.",
            "score": 3,
            "author": "DAGCRO"
        },
        {
            "level": 0,
            "comment": "I bought a few $k of crypto last year, not much fortunately though as I bought near the peak. Fomo me.\n\nI don’t really understand the business case for any existing coins. None of them can ever really be used as a medium for transactions at scale. Mining crypto is kind of burning energy for the sake of burning energy right?\n\nSo is there an actual business case where any existing tokens actually generate tangible value? Or are all tokens currently in existence just waiting for a greater fool?",
            "score": 1,
            "author": "Electrical-Ad347",
            "replies": [
                {
                    "level": 1,
                    "comment": "DeFi systems already act like credit unions, aggregating deposits and making loans… without any humans or banks involved.\n\nEvery industry software has touched has undergone a revolution of _disintermediation_, and crypto will progressively disintermediate banks.\n\nThe internet took 30 years to go from ARPANET to Facebook. If you map that timeline onto crypto, we don’t even have the crypto equivalent of the World Wide Web yet. And banks are super entrenched globally so this will not be a fast revolution.",
                    "score": 1,
                    "author": "7366241494",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. I follow that. But this is my main question. You made a business case for blockchains and DeFi, which I understand are possibly revolutionary, but that is separate from Bitcoin, Ether, Doge, etc. specifically. DeFi and blockchains might very well disintermediate our financial network, but that doesn’t say anything about Bitcoin ever serving an economic function. That says something about DeFi and blockchains in principle and as general tech which has nothing to do with the specific tokens we currently own and mine. \n\nSo what’s the business case for Bitcoin, Ether, Doge, etc? Regardless of how blockchains as general tech change finance, will an Ether token ever generate value or serve a legit economic function?\n\nMy question is not about the general utility of smart contracts or blockchains or anything. It’s about the tokens we’re currently assignment a market value to. That’s always been the hang up for me. The difference between the general utility of blockchain tech and the specific utility of any of the coins in existence today.",
                            "score": 1,
                            "author": "Electrical-Ad347",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No it’s not an argument for Bitcoin. We can argue that separately.\n\nEthereum is the king of DeFi so the above is definitely an argument for Ethereum (and other smart contract platforms.)\n\nBitcoin actually had a kind of smart contract language built in from the very beginning, but it was quickly nerfed into oblivion due to security concerns. It remains to be seen if Bitcoin’s recent smart contract support will get real usage.\n\nI have no interest in Doge or the many shitcoins that prey on the ignorant. They only serve to obfuscate the true potential of blockchains, giving naysayers an easy straw man for their rhetoric.\n\nAs for Bitcoin, most now view it as a store of value rather than a payments platform. But as for payments, the Lightning Network, a layer 2 solution, is faster than swiping a credit card and at least an order of magnitude cheaper. It also scales to an effectively unlimited number of transactions per second. Anyone who says Bitcoin cannot scale to the size of Visa has no clue what they’re talking about.",
                                    "score": 1,
                                    "author": "7366241494",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting thanks. Because yeah I’m under the impression that Bitcoin and Ether just can’t ever scale to be used as mediums of exchange because it’s just too expensive. But I have heard the idea of bitcoin as a store of value, but even that seems manufactured or contrived because the only “value” that exists in that case is psychological. It still doesn’t actually do anything, like there’s no fundamental support for whatever market value is assigned to it at any given time. \n\nAnyways, I’m probly gonna hodl my coins, they’re not really worth selling at this point.",
                                            "score": 1,
                                            "author": "Electrical-Ad347",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ethereum has many layer 2 options now, including Polygon (MATIC), Arbitrum, Optimism, and more. Ethereum devs have basically stopped trying to scale Ethereum itself and instead are formally supporting layer 2’s.\n\nBy the way, multiple layers is also how Visa works. When you use your credit card, it’s actually your bank who books the debit, not Visa. Then overnight your bank nets out its debits and merchant credits and rolls up the net position to its parent entity, who rolls up, etc. Finally, top-level banks send their nets to Visa. Visa itself only does a couple thousand transactions a day, in an overnight batch.\n\nThis is exactly how blockchain layer 2’s work, but it happens every block instead of waiting overnight.\n\nLike I said, everyone who says Bitcoin can’t scale is not only ignorant of how blockchain layer 2’s work, but they’re also ignorant of how Visa actually works.",
                                                    "score": 1,
                                                    "author": "7366241494"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}