{
    "id": "140n7qg",
    "score": 0,
    "title": "Looking for groups",
    "author": "AdmirableHour5157",
    "date": 1685906302.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/140n7qg",
    "media_urls": [
        "https://i.redd.it/c3nxk4d0x14b1.jpg"
    ],
    "other_urls": [],
    "postText": "Hey guys. I’m a 21m, and I was looking for any groups to talk about the market. I often find that large sub-Reddits will often offer lousy advice. \n\nI’m not a day trader, but I posted one of my current portfolio returns. I couldn’t post my all-time return without posting my positions, but it’s up by +94%. \n\nI know this is meaningless or a small amount of wealth/evidence to many of you, but I hope it could potentially serve as evidence of someone that could be a good person to bounce ideas off of. \n\nMy DMs are open if you’d like to talk or ask questions. \n\nP.S. As I said, I posted my earnings as evidence. I didn’t mean to brag. In the grand scheme of things, I haven’t achieved anything really.",
    "comments": [
        {
            "level": 0,
            "comment": "Why do you put your age and what gender you identify as in your post?",
            "score": 9,
            "author": "PointLatterScore",
            "replies": [
                {
                    "level": 1,
                    "comment": "I barely used Reddit. I thought that’s what ppl did tbh.",
                    "score": 2,
                    "author": "AdmirableHour5157",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OK but seriously look at reddit nobody does that except in NSFW posts.",
                            "score": 1,
                            "author": "PointLatterScore"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "21F and M is a deal breaker for me. I only accept 21T",
                    "score": 1,
                    "author": "SPXLiquidated",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NICE!!\n\nBut what if 21T=21F or R21M?  What do?",
                            "score": 1,
                            "author": "PointLatterScore"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Create your own, you seem to be winning",
            "score": 1,
            "author": "EncrustedBarboach"
        },
        {
            "level": 0,
            "comment": "Every subreddit is for that. Find a good telegram or discord server",
            "score": 1,
            "author": "Apart_General_1380"
        }
    ]
}