{
    "id": "144ktvn",
    "score": 0,
    "title": "How to not be affected Physcologically",
    "author": "Senyorty12",
    "date": 1686257704.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/144ktvn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello and thanks for the advice and anything in the comments.\n\nSo basically Today I bought TSLA Calls when TSLA was at 230.10 \n\n\\- I sold for $300 profit and was happy, the sale happened around 231 I believe.\n\nIm happy I close my computer go to the gym and eat, Im at peace. However I look at close and its at 237 after hours, I sit there looking at potentially over 5k profit I could of had and Idk how to feel rn. Like dam man that's a tough one to take on the chin especially as a 20yr with 4k in the robin hood account I feel very rough right now.\n\nI know there's millions of other opportunities but how do I forget this and just be happy I took healthy profit and move on... How do I stop this from making me money hungry and chasing tomorrow?",
    "comments": [
        {
            "level": 0,
            "comment": "Sounds like your greed is starting to come out. Just remember, any profit is better than losses.",
            "score": 19,
            "author": "hoya_doing",
            "replies": [
                {
                    "level": 1,
                    "comment": "EDIT: /u/Senyorty12 edits his post so enjoy not seeing mine.",
                    "score": 1,
                    "author": "PointLatterScore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How was dinner",
                            "score": 2,
                            "author": "WoodpeckerDapperDan"
                        },
                        {
                            "level": 2,
                            "comment": "Bro stfu im tryna enjoy not seeing your comments",
                            "score": 1,
                            "author": "TheyKeepBanningMeVPN"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "best advice would be to try and imagine it was completely opposite and it tanked and if you held you would have lost it all. gotta think from different perspectives in my opinion",
            "score": 5,
            "author": "blairboii"
        },
        {
            "level": 0,
            "comment": "There will always be a opportunity to make more money than how much you made, weather that’s in that day, in that hour, or in that minute, there was almost always a better bet to make. But you have literally no way of knowing where that bet is and when to make it.\n\nNo one knows what the stock market will do least of all investors. If you made gains know you are doing better than about 80% of retail investors. I would suggest not to shoot for the top 1% of winners as that usually just means you got lucky more than anything. Dont try to time the market. Be happy you made a good move and feel good about, never feel bad that you didn’t make the perfect move (almost no one will).",
            "score": 3,
            "author": "Player_me"
        },
        {
            "level": 0,
            "comment": "If you sold at $300 profit, what makes you think you would not have sold at $500. \n\nProfit is profit. Learn to scale out of positions if you think they still have room to run.\n\nAbove all you didn’t lose money so be happy about that. Work on being a consistent winner first and refining your edge (this usually takes years) Don’t worry about maximizing winners. Just win.",
            "score": 2,
            "author": "Kakeesh",
            "replies": [
                {
                    "level": 1,
                    "comment": "yea that’s pretty true prolly would of sold at 1k max. But yea gotta just keep pushing a win is a win and shouldn’t be greedy just work hard for the next one",
                    "score": 3,
                    "author": "Senyorty12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hello, it looks like you've made a mistake.\n\nIt's supposed to be could've, should've, would've (short for could have, would have, should have), never could of, would of, should of.\n\nOr you misspelled something, I ain't checking everything.\n\nBeep boop - yes, I am a bot, don't botcriminate me.",
                            "score": 1,
                            "author": "of_patrol_bot"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; would of \n\n*would have \n\n *Learn the difference [here](https://languagetool.org/insights/post/would-of-or-would-have/#:~:text=%E2%80%9Cwould%20have%E2%80%9D%3F-,%E2%80%9CWould%20Of%E2%80%9D%20or%20%E2%80%9CWould%20Have%E2%80%9D%3F,would%20have%2C%20not%20would%20of.).*\n*** \n ^(Greetings, I am a language corrector bot. To make me ignore further mistakes from you in the future, reply `!optout` to this comment.)",
                            "score": 1,
                            "author": "LearnDifferenceBot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Live your emotion. Be mindful of it. Accept it has it comes to you. You can't not be affected psychologically, but you can feel ok about it. Take some time to recover from that emotion before taking other important decisions. There's an emotional learning that has to be made to be able to survive the game and it takes time. This is normal. Follow your plan and be grateful when the market is kind enough to give you some money.",
            "score": 2,
            "author": "Mexx_G"
        },
        {
            "level": 0,
            "comment": "I find cocaine helps me through psychological difficulties",
            "score": 2,
            "author": "Long_Jellyfish2093"
        },
        {
            "level": 0,
            "comment": "I’d turn it around and look at what made you trade in the first place. \n\nYou sound like you had no plan. What was the profit you aimed for ? If it was $300, you made 100% of it and it was an excellent trade. If it’s $600, you made 50% and it wasn’t excellent. \n\nBased on that, I’ll say feel lucky cause you went gambling and got home with $300. It could have been $0",
            "score": 2,
            "author": "gg120b"
        },
        {
            "level": 0,
            "comment": "You can never bet enough on the winning horse.   Take the money and be happy you took profit.",
            "score": 2,
            "author": "Level_Inspector7002"
        },
        {
            "level": 0,
            "comment": "This is all hindsight, if tsla tanked you wouldn’t have made this post.\n\nIn reality you didn’t miss any profits since you weren’t there to take it. There are trades that go 1000%+ every single day and you aren’t here saying I missed xyz. \n\nThe only way you could have missed that trade is if you saw the setup and didn’t execute. THATS missing a trade. Following your plan and executing it is all you have to do. Anything else is your emotions taking over your mind",
            "score": 2,
            "author": "Advent127"
        },
        {
            "level": 0,
            "comment": "I missed out on buying DWAC when it was $10 and then it went boom to $150.\n\nI buy dividend stocks now and drip.  Less stress.",
            "score": 2,
            "author": "Flimsy_Card8028"
        },
        {
            "level": 0,
            "comment": "Happens to everyone.  The rich investors always say: I sold it too soon.",
            "score": 2,
            "author": "Vast_Cricket"
        },
        {
            "level": 0,
            "comment": "EDIT: /u/Senyorty12 edits his post so enjoy not seeing mine.",
            "score": 0,
            "author": "PointLatterScore",
            "replies": [
                {
                    "level": 1,
                    "comment": "i believe the correct sentence is “you are not the target audience”",
                    "score": 2,
                    "author": "Senyorty12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "EDIT: /u/Senyorty12 edits his post so enjoy not seeing mine.",
                            "score": -1,
                            "author": "PointLatterScore",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How tf can i enjoy not seeing yours if you are commenting non-stop?",
                                    "score": 1,
                                    "author": "TheyKeepBanningMeVPN"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s a great book out there - The Hour Between Dog and Wolf- that discusses our body’s chemical reactions to trading stocks- both the euphoria of a gain and the despair of a loss.  After reading that and understanding that these are some normal physical reactions I was able to handle my winners,losers and what-could-have-been much easier.",
            "score": 1,
            "author": "kennetec"
        }
    ]
}