{
    "id": "145hbhz",
    "score": 31,
    "title": "The most anticipated recession is not going to happen until 2024/25",
    "author": "snippythehorses",
    "date": 1686345950.0,
    "url": "https://www.reddit.com/r/StockMarket/comments/145hbhz",
    "media_urls": [],
    "other_urls": [
        "https://preview.redd.it/y9w87s7xu15b1.png?width=1857&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=10510dbd28ca2f07e47b88f9dd0933725f639574)",
        "https://preview.redd.it/cz2jwdbdv15b1.png?width=667&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8ef24b6761c42a94443ad1ea5efdd2e4cddb732b)",
        "https://preview.redd.it/172ccng2w15b1.png?width=772&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a3bb45b7fa8bd8706c4323d4b1e892c924942202)",
        "https://preview.redd.it/uj1dtlbxw15b1.png?width=1862&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2054a78ffa99de0fcd309f7cfc40b2febcc3a0f9)",
        "https://preview.redd.it/68tfcr4ky15b1.png?width=1847&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b0512707869dbd3ac010dfcaacf2177eb15a2bd8)",
        "https://preview.redd.it/jxz9z3u9z15b1.png?width=943&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=665c5980c8010279b3c9ed0eea17995adc281a09)",
        "https://preview.redd.it/c76q2nf0025b1.png?width=1867&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8efe1e72f1fd804e66e5b8a4a8e4f341e2cb96bf)",
        "https://preview.redd.it/opnrrghf025b1.png?width=958&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=75fa9e76e1c35d8cf11ba08bf7649df99da8b7d6",
        "https://preview.redd.it/egd1z0mi125b1.png?width=1867&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e202aa84366856c1f9e16f052ba44b9f9095181b)",
        "https://preview.redd.it/jte9xpw4225b1.png?width=847&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5a5e756ac4edbe21d7337c62bb4da7ed519bccda",
        "https://preview.redd.it/g8gcif0y225b1.png?width=1862&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=6e706aec60fecdaacfd642e2efb1d6f6c67e2f5b)",
        "https://preview.redd.it/6rqsw99d325b1.png?width=863&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=1d584707b2196d6b64b113aed8a8e1da1d5759a2",
        "https://preview.redd.it/8zdo0way325b1.png?width=1868&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2a53b38ea7d707751aacaff05de1425165a2a9f5)"
    ],
    "postText": "May 16 of 2000, the Fed reached a peak rate of 6.5% after having raised interest rates for years leading into the tech bubble. \n\nHere  is an example of that price action leading into the final rate hike: \n\n&amp;#x200B;\n\n[Weekly chart Jan 1998 to May 16 2000 DURING HIKES](https://preview.redd.it/y9w87s7xu15b1.png?width=1857&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=10510dbd28ca2f07e47b88f9dd0933725f639574)\n\nAs one can see, the market generally went up, but it fought and generally went kicking and screaming the entire way. There was a nice sell off from July 20th to an Oct bottom in 1998 and this was actually a 22.54% decline and markets rallied off that bottom to a top of 68.87%. \n\nIt's important to note that this period was one where the fed was seemingly cutting and raising rates, but generally holding them quite high: \n\n&amp;#x200B;\n\n[You see a peak of 6&amp;#37; in this period go to 4.75&amp;#37; and then back up to 6.5&amp;#37;. The bottom in Oct actually corresponded to the feds final rate cut for almost 6 months until another hike! ](https://preview.redd.it/cz2jwdbdv15b1.png?width=667&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8ef24b6761c42a94443ad1ea5efdd2e4cddb732b)\n\nThe next set of rate activity went as follows: \n\n&amp;#x200B;\n\n[Tech bubble QE cycle](https://preview.redd.it/172ccng2w15b1.png?width=772&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a3bb45b7fa8bd8706c4323d4b1e892c924942202)\n\nFrom May 16 2000, the fed held a 6.5% rate until its first cut on Jan 3rd of 2001 which was a holding period of 7 months 2 weeks and 4 days. \n\nNow this period of trading was not very eventful. As you can see, the market close down 7.99% as of the first rate cut day (which saw the market get very excited that day) and a max high 4.73%. But the rate holding period certainly favored the downside. Especially if you subscribed to sell in Sept and go away. \n\n&amp;#x200B;\n\n[Daily chart May 16-Jan 3 2001 during FED PAUSE](https://preview.redd.it/uj1dtlbxw15b1.png?width=1862&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2054a78ffa99de0fcd309f7cfc40b2febcc3a0f9)\n\n&amp;#x200B;\n\nWith rate cuts beginning Jan 3 2001 and ending June 25, 2003. Here is how that went: \n\n&amp;#x200B;\n\n[MARKET DURING RATE CUTS](https://preview.redd.it/68tfcr4ky15b1.png?width=1847&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b0512707869dbd3ac010dfcaacf2177eb15a2bd8)\n\nFrom the very first rate cut to the very last rate cut, the market had violent periods of going down 20%, then up 22%, then down 29%, then up 25% and so forth as you can see here. \n\nNow thats just the story of the tech bubble. \n\nEnter how the FOMC handled the housing crisis. \n\nComing off the tech bubble, the fed then began a raising campaign of  rates from 1% to 1.25% starting June 30th of 2004 to a 5.25% June 29 2006\n\n&amp;#x200B;\n\n[Pre 2008 QT cycle](https://preview.redd.it/jxz9z3u9z15b1.png?width=943&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=665c5980c8010279b3c9ed0eea17995adc281a09)\n\nDuring this period of tightening, you actually saw the market overall rally 18.17%\n\n&amp;#x200B;\n\n[Market DURING HIKES](https://preview.redd.it/c76q2nf0025b1.png?width=1867&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8efe1e72f1fd804e66e5b8a4a8e4f341e2cb96bf)\n\nIn this period of QT, the market only went down about 5% and also rallied overall 24.54%. QT did not phase the markets. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/opnrrghf025b1.png?width=958&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=75fa9e76e1c35d8cf11ba08bf7649df99da8b7d6\n\nNow here, the fed paused from June 29 2006 to to Sept 18 2007 which means for 1Y 2 months 2 weeks and  6 days, the going rate was just 5.25%. Here is the price action during this pause: \n\n&amp;#x200B;\n\n[Market during FED PAUSE](https://preview.redd.it/egd1z0mi125b1.png?width=1867&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e202aa84366856c1f9e16f052ba44b9f9095181b)\n\nAs you can see, markets during this pause found a way to rally an overall 27% only hitting a speed bump of -6% along the way and another point of -12.27%. This is actually the complete opposite of the tech bubble as that saw the market overall drop 7% and only go up about 5%. However you can see the historic expectation for that previous recession play out in the 5% and 12% drops during this cycle. People overall had bouts of panic but that was it. \n\nHere comes the QE: \n\n&amp;#x200B;\n\nhttps://preview.redd.it/jte9xpw4225b1.png?width=847&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5a5e756ac4edbe21d7337c62bb4da7ed519bccda\n\nFirst cut began Sept 18 of 2007 and it finished Dec 16 of 2008. Here is how that went: \n\n&amp;#x200B;\n\n[MARKET DURING RATE CUTS](https://preview.redd.it/g8gcif0y225b1.png?width=1862&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=6e706aec60fecdaacfd642e2efb1d6f6c67e2f5b)\n\nAs you can see, not so well. It went up maybe 3% but finished out 51% down during the cycle. Overall there were multiple legs of double digit declines and even an extended rally for 14% during the cut cycle. But it did not matter because you still lost money overall if you just stayed put. \n\n&amp;#x200B;\n\nSo what can we say? Well here is our market right now. Rate cycle: \n\n&amp;#x200B;\n\nhttps://preview.redd.it/6rqsw99d325b1.png?width=863&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=1d584707b2196d6b64b113aed8a8e1da1d5759a2\n\nFirst cut took place on March 16 2022 and here is where we are during our QT cycle and lets ASSUME that the final hike is in so it all ended May 3rd of 2023. \n\n&amp;#x200B;\n\n[MARKET DURING RATE HIKES ](https://preview.redd.it/8zdo0way325b1.png?width=1868&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2a53b38ea7d707751aacaff05de1425165a2a9f5)\n\nJust like 2000's rate hike cycle, we saw a drop more than that ones (22% vs 24%). So we are actually tracking this theoretical move. Now last time during the tech bubble rate hikes, despite that 22% decline in Oct 1998, the market actually peaked from that low to a 68% rally by March of 2000 over 17 months! \n\nThis would be like SPY going from the 350's to about 590 and doing this until about March of 2024. \n\nThus I believe what we can overall conclude is that to call for a massive decline or to get extremely bearish to the point you are only betting against the markets or in all cash, you MUST see the fed not only pause but also begin to cut rates. There are no extended rate increase periods that were followed up with a successful fed cut cycle that did not do a ton of damage to the markets. Even within that cut cycle, as you could see the markets found ways to rally even on the way down. \n\nIt's possible  that the last rate hike is in and that the fed pauses right here. However, I wouldn't take that to be a signal of anything because during the housing crisis, the markets found a way to rally overall in a strong way and shrugged off any real decline attempts. \n\nSo I close this out to say, don't be surprised if you need to see SPY get to 590 before it can go back to 250 or 300. In fact, it might even be entirely necessary that the market needs a larger overall rally that makes everyone forget about the fed before it can then go much lower. The 22% crash in the tech bubble rate hike cycle ended up even being too high a price during the actual undoing of the tech bubble at its worst. The lowest price during the hike cycle during the housing crisis was around 106. Even this was too expensive in light of the actual crisis unfolding sending SPY  to as low as the tech bubble lows! \n\nThis means that we won't really find a true bottom until we go and retest those lows from the 2020 pandemic. So what could shape out here is a run up into 2024. Election occurs and that all goes hunky dorey (or not, who knows at this point tbh) and then suddenly those recession fears well out of everyones mind return with a vengeance and we retest the pandemic low of 218 in 2025/26. \n\nThis is my tin foil on why markets are not going down as many seem to expect for some reason. It seems the expectation is for markets to just decline and that doesn't seem to correspond with history at all. What do you think?",
    "comments": [
        {
            "level": 0,
            "comment": "Then in 2024/2025:\n\nThe most anticipated recession is not going to happen until 2026/2027.",
            "score": 16,
            "author": "leli_manning",
            "replies": [
                {
                    "level": 1,
                    "comment": "If we wait long enough there will be a new cycle with new lows!",
                    "score": 1,
                    "author": "drekwageslave"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if the FEDs hike again next week? Rocket to the moon?",
            "score": 8,
            "author": "ChosenJuan234",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's tough to say! History says if the fed isn't done hiking, the market is actually not done rallying. Thus if we were to get a rate hike and the market saw a good pull back, that pull back historically would only be worth buying as you'll just have higher prices available to you at some point during the pause cycle.",
                    "score": 11,
                    "author": "snippythehorses"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for sharing. This has kind of been my gut feeling all along. Things are going to get interesting.",
            "score": 8,
            "author": "kvlt22"
        },
        {
            "level": 0,
            "comment": "Aww.. I love good stuff like this 👍🏼",
            "score": 6,
            "author": "1RjLeon"
        },
        {
            "level": 0,
            "comment": "Trying to understand these markets is like walking through a prison with a blindfold and then when someone spits on you taking the blindfold off and trying to deduce who did it based on \"who looks guilty\".",
            "score": 2,
            "author": "joekerr37"
        },
        {
            "level": 0,
            "comment": "And I am still waiting to buy dips with my strategy: https://youtu.be/rZBjAJmqsKs",
            "score": 1,
            "author": "RewardsIndia",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;https://youtu.be/rZBjAJmqsKs\n\nno offence this guys english is pathetic n i m from ind",
                    "score": 3,
                    "author": "boratDaSuperHero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This seems possible. Investors in the startup world are expecting a reckoning in 2024, so perhaps that unwinds and leads to a downturn in 2025/2026",
            "score": 1,
            "author": "imlaggingsobad"
        },
        {
            "level": 0,
            "comment": "Good historical asepect.  History can replay itself.",
            "score": 1,
            "author": "Vast_Cricket"
        }
    ]
}