{
    "id": "10y4iti",
    "score": 116,
    "title": "PSA For Students Who Park On Campus",
    "author": "Papa_Kasugano",
    "date": 1675972814.0,
    "url": "https://www.reddit.com/r/CSUS/comments/10y4iti",
    "media_urls": [],
    "other_urls": [],
    "postText": "Your car goes between the two lines.",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah!!! And your truck and SUV aren’t compact 😡",
            "score": 65,
            "author": "bluespartan65",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think people know the meaning of compact.",
                    "score": 15,
                    "author": "r_a_v_e_n-"
                },
                {
                    "level": 1,
                    "comment": "I ride a bike and I totally understand the sentiment, BUT, with the amount of parking spaces I see available, there’s little option.",
                    "score": 11,
                    "author": "Double_Discussion_84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hear ya, but I park on the fourth floor and feel like some people are just lazy about it. That’s all 🙂",
                            "score": 5,
                            "author": "bluespartan65"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you park on the fourth floor? I do, since my big sedan won’t fit in most of the spots comfortably. I manage to find lots of empty spots at the higher floors mid day. I understand that there isn’t much options on the first few levels, but sometimes you gotta do a few laps lol. This isn’t me disagreeing but explaining that while your feelings are valid, some people don’t take the time to park.",
                            "score": 1,
                            "author": "bluespartan65"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw a girl back in today, and noticed she was crooked and took the time to fix it. I was impressed.",
            "score": 24,
            "author": "caelthel-the-elf",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't understand how more people don't feel obligated to do this. The way someone parks is an extension of who they are as a person and how they respect everyone's space. If they park shitty and I don't know anything else about them, well, I'm starting off with a low opinion.",
                    "score": 11,
                    "author": "Papa_Kasugano",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My thoughts exactly. Also, when people don't put their shopping carts at grocery stores away before getting in their car. It pisses me off when someone won't push their cart 5 feet to the collection area.",
                            "score": 5,
                            "author": "caelthel-the-elf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Last semester, somebody got mad at me for pulling out to adjust my car to the lines. They reved their engine and floored it down the parking structure",
                    "score": 1,
                    "author": "festivebruja",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People are so so so stupid and petty. I did the same thing, adjusted my alignment and someone thought I was leaving so they waited behind me and got mad at me when I pulled back in.",
                            "score": 1,
                            "author": "caelthel-the-elf"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m always mindblown by the people who back in and still park crooked- you take the extra time to back in but not make sure you’re in one spot??",
            "score": 18,
            "author": "harryjsadcliffe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Either they don't notice, don't care, or are idiots. None of those are mutually exclusive.",
                    "score": 10,
                    "author": "Papa_Kasugano"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And you drive too fast in the parking buildings. Why so hurry? Wanna poop?",
            "score": 13,
            "author": "Existing-Class-3234",
            "replies": [
                {
                    "level": 1,
                    "comment": "With an ear-piercingly loud engine",
                    "score": 7,
                    "author": "snarkasm_0228",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I literally heard that like a dozen times on Wednesday with a crash sound. Felt like I was back in the hood",
                            "score": 3,
                            "author": "Pepper8787"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They read online that speeding through parking structures and revving your engine so loud that it sets off car alarms will increase their pp size by 1 inch per day of driving like a tool.",
                    "score": 2,
                    "author": "caelthel-the-elf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I enjoy parking very close to assholes like that. Fuck you, I'm still parking next to you and now you can't open your door.",
            "score": 9,
            "author": "r_a_v_e_n-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Make sure you take a pic of the car next to you, cause if they swipe you and run it’ll suck.",
                    "score": 9,
                    "author": "bluespartan65",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A photo isn't proof of anything though. Better to give your auto insurance a call and make sure you're covered for the situation before it happens.",
                            "score": 3,
                            "author": "blahdiddyblahblah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Obviously not but if the person you’re parked closest to ALL day is gone and your car is swiped you at least have a plate? Better than nothing.",
                                    "score": 3,
                                    "author": "bluespartan65",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately it really isn't, because it doesn't prove anything. Odds that police actually choose to follow up (not gonna happen for a parking lot fender bender hit and run), visit the person, AND get a confession are nil. \n\nNot trying to be argumentative, just explaining why it's better to just make sure your insurance covers the situation. A plate is not going to help you, insurance will.",
                                            "score": 1,
                                            "author": "blahdiddyblahblah",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well the person can 100% make sure their insurance is covered, I don’t disagree lol. Like you said, the chances of anyone following up on the hit in run are slim. I personally do take pictures because in the off chance I see them at school again, I’d check their car for marks and I’d have a conversation. Not everyone’s approach, people can do as they please. I didn’t say the pics thing to weigh it as the better option, just that it’s something I like to do.",
                                                    "score": 1,
                                                    "author": "bluespartan65"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "my bad i thought the line goes through the middle of my car",
            "score": 22,
            "author": "Safyire",
            "replies": [
                {
                    "level": 1,
                    "comment": "Obviously you're not the only one",
                    "score": 5,
                    "author": "Papa_Kasugano"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Back when I had a shitbox I would park as close as humanely possible to these people. Hit my door bitch",
            "score": 7,
            "author": "Therapythrougharguin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm fully expecting some dings in my door tonight.",
                    "score": 2,
                    "author": "Papa_Kasugano",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anything to inconvenience a jackass",
                            "score": 5,
                            "author": "Therapythrougharguin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YES! I park in the same spot every day close to a wall and I try to get as close as possible to the wall so people have space and I don’t get hit. Its not that hard lol",
            "score": 1,
            "author": "hypanthia"
        },
        {
            "level": 0,
            "comment": "I believe their was a story about sac state spots being smaller than regulations. I noticed this whenever I had to park my mons suv. I could barely get it in some spaces compact or not. That's being said. At least make sure you're between the two lines.",
            "score": 1,
            "author": "nickthatknack"
        },
        {
            "level": 0,
            "comment": "My ram 3500 Turbo diesel would disagree",
            "score": -19,
            "author": "SayWhy2Me",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, you're part of the problem.",
                    "score": 6,
                    "author": "Papa_Kasugano"
                },
                {
                    "level": 1,
                    "comment": "how's your ecological footprint going?",
                    "score": 6,
                    "author": "caelthel-the-elf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is why I own a subcompact.",
            "score": 0,
            "author": "NotInOnYourLie_"
        }
    ]
}