{
    "id": "13j97m7",
    "score": 9,
    "title": "Suggestions for US History class",
    "author": "DebateStatus4909",
    "date": 1684252808.0,
    "url": "https://www.reddit.com/r/CSUS/comments/13j97m7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m planning to take a US history class to fulfill my US history requirement in the winter. Any suggestions for which professors I should take?\n\nThank you in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "plus exams are open note!",
                    "score": 3,
                    "author": "a11ison3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In person class?",
                            "score": 1,
                            "author": "DebateStatus4909",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh that’s great!! Thank you so much",
                                            "score": 2,
                                            "author": "DebateStatus4909"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kluchin has a lot of good classes to choose from.",
            "score": 3,
            "author": "TheF1reMan92",
            "replies": [
                {
                    "level": 1,
                    "comment": "I took her HIST18 class and we had no tests, 1 reading questions assignment about every two weeks (with lots of extensions given), and the writing final was posted beforehand so all we had to do was paste the answers in. She is one of the easiest professors I've ever had.",
                    "score": 2,
                    "author": "DR2HajimeHinata",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you write any essays? Also are the quizzes in person?",
                            "score": 1,
                            "author": "DebateStatus4909",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are no tests/quizzes at all. There are 2 essays, one at the start of the semester and one at the end (the final), but they are basically about yourself and what you think about history so it's the easiest essay topic you could have. The reading questions are normally 1-3 questions and each are about a paragraph. My classmates liked asking for extensions and she easily obliged, so it doesn't hurt if you want to ask her for some as well. The readings are very boring though, and I highly recommend looking online for free versions.\n\nAlso the final is \"pick and choose.\" She gives you about 8 topics you learned in lecture beforehand so you can prepare. There's 6 to choose from on the final and you won't know which ones they are, but you only need to answer for three. You can basically do all of the final before it's released and just copy and paste it when it does.",
                                    "score": 2,
                                    "author": "DR2HajimeHinata",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Awesome! Thank you so much :)",
                                            "score": 1,
                                            "author": "DebateStatus4909"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crowder is fantastic and is passionate about history",
            "score": 3,
            "author": "Trombownage"
        },
        {
            "level": 0,
            "comment": "I needed a WI class and chose images of America. It’s asynchronous during summer but idk about fall- however it is 0 cost and the description looks easy!",
            "score": 1,
            "author": "MeetGroundbreaking43",
            "replies": [
                {
                    "level": 1,
                    "comment": "with Dr. Bly? I had him this semester for HIST151B and i loved him! really interesting professor.",
                    "score": 1,
                    "author": "RevenueSpecialist432",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think so? I’m happy to hear it went well!! I hope I get to know him well during the summer course",
                            "score": 1,
                            "author": "MeetGroundbreaking43"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Took hist 167 with professor Anderson, only three short essays and the midterm was a discussion. Would recommend for anyone looking to fulfill the us history req.",
            "score": 1,
            "author": "Wantedx"
        },
        {
            "level": 0,
            "comment": "Images of America is a great course. Fulfilled my American history plus writing intensive plus ethnic studies requirements.",
            "score": 1,
            "author": "Szechuan_Man"
        },
        {
            "level": 0,
            "comment": "HIST 166 with Prof Gough. It's history of American Popular Culture. It's super interesting. A few quizzes, a couple essays, and that's it. He's an easy grader, and if you just take some brief notes during lectures, you'll get an A. You can pretty much write essays about whatever you want. I wrote my last paper on why Captain America became a staple of American pop culture during WWII. Nice guy, will get sidetracked sometimes, but it's always about popular culture",
            "score": 1,
            "author": "lassenyosemite19"
        },
        {
            "level": 0,
            "comment": "kluchin",
            "score": 0,
            "author": "tr3gk"
        }
    ]
}