{
    "id": "13t57h7",
    "score": 4,
    "title": "How's the Business Admin Major",
    "author": "EthanRuiLi12345",
    "date": 1685187681.0,
    "url": "https://www.reddit.com/r/CSUS/comments/13t57h7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello Hornets! I am a newly admitted student for fall 2023 and I am interested in hearing about the Business Programs from here. I am looking to probably study accounting. I am a Hornet legacy (my mom graduated from here) so Sac State is really special to me. Sac State is close to home and I know a lot of people that goes here.\n\nI have also been admitted to UCLA for Business Economics major and USC (which stands for University of Southern California) for Business Admin Major. These schools are really far away from home (I live near Sacramento) so I didn’t know too much about these schools. How does Sac State compared to UCLA and USC in terms of the business majors? Sac state and UCLA cost similarly to me btw.",
    "comments": [
        {
            "level": 0,
            "comment": "UCLA and USC are way better options for business majors but it depends what you want a concentration in.",
            "score": 5,
            "author": "RevolutionaryHeart79",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m undecided, probably anything except for Management, Human Resource, and Marketing. So probably Finance/Accounting/Operations.",
                    "score": 1,
                    "author": "EthanRuiLi12345",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you're undecided, what draws you to accounting? In terms of target campus, CSUS is the go-to for accounting, so some more discussion on what and why is going to give you a better answer. Feel free to chat/dm if you'd prefer not being in a thread.",
                            "score": 2,
                            "author": "Durnir_Danse"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you have an interest in the built environment, I’d recommend construction management. It’s like a hybrid of business management and engineering, and you make like $80k with 100% job placement at graduation.",
            "score": 2,
            "author": "Iamusweare"
        }
    ]
}