{
    "id": "13zxatu",
    "score": 0,
    "title": "help me with choosing 1st year English course pls",
    "author": "Cook9000",
    "date": 1685843838.0,
    "url": "https://www.reddit.com/r/CSUS/comments/13zxatu",
    "media_urls": [],
    "other_urls": [],
    "postText": "i want to ask those who took English 10/11 and English 5 +1 what they experienced in their first year English's course. I'm currently completing the DSP to be placed in either one but i want to hear other students experience in those classes because English's isn't my strongest subject and i have pretty bad procrastination towards it. I have a interest in English 5 +1 because completing English in one semester sounds good but how effective are the small groups and instructors there?",
    "comments": [
        {
            "level": 0,
            "comment": "Take English 5M. It’s way easier and they don’t care if your bilingual or not",
            "score": 6,
            "author": "Aryangotbandz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ayee thats smart i might check that out thanks",
                    "score": 1,
                    "author": "Cook9000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "English 5 generally means you're going to have to write a lot harder and faster. 10 is better if you feel like you'd do better in a smaller class with more attention from the teacher.",
            "score": 3,
            "author": "shadowromantic",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah im not a strong writer but id rather be done in one semester",
                    "score": 1,
                    "author": "Cook9000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took English 10m/11m with Amy Anderson I think? She was really nice and the class was a easy A,  my writing has improved since I took the course.",
            "score": 1,
            "author": "International_Dot752",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you need the multilingual class or did you do it because its easier?",
                    "score": 1,
                    "author": "Cook9000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I definitely needed it!",
                            "score": 1,
                            "author": "International_Dot752"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some say English 5 is fast pace but in my experience it’s pretty manageable depending on who you have as a professor. From what I’ve heard from other people as well, more work is actually done in 5M and 10/11 (I think this is to help with skill development) compared to normal Engl 5. I had Amy Anderson for English 5, she is super nice &amp; she will work with you so you get the grade you want to achieve. If you go with Engl 5 , I’d recommend to take the class with Amy Anderson.",
            "score": 1,
            "author": "Aidrod003",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you i will try to join her class",
                    "score": 1,
                    "author": "Cook9000"
                }
            ]
        }
    ]
}