{
    "id": "smxj6e",
    "score": 131,
    "title": "Masking issues already",
    "author": "Gappv2",
    "date": 1644259534.0,
    "url": "https://www.reddit.com/r/CSUS/comments/smxj6e",
    "media_urls": [],
    "other_urls": [],
    "postText": "In my classes today-\n\n- one student who didn’t bring a mask and sat uncovered in the middle of the class proceeded to fight with a teacher who stopped class for a few minutes and required him to wear a mask or leave.\n\n- one student decided to eat a sandwich in a packed lecture hall, leaving his nose and mouth uncovered the entire time, sitting directly next to masked individuals.\n\nSeriously, if you aren’t going to follow the masking rules in-class, please stay home so that the ones of us who are don’t catch your Covid. I’m not trying to sound overboard, but rules are rules and I don’t want to get sick. Tyvm.",
    "comments": [
        {
            "level": 0,
            "comment": "😵‍💫 stingers up",
            "score": 82,
            "author": "Retiredgiverofboners",
            "replies": [
                {
                    "level": 1,
                    "comment": "stingers down 😔",
                    "score": 50,
                    "author": "Particular_Ring_1256"
                },
                {
                    "level": 1,
                    "comment": "🐝 🐝",
                    "score": 12,
                    "author": "Gappv2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People were clearly sick in one of my classes. Coughing and sniffling, and taking off their masks to wipe off their nose during class. They weren't normal coughs either. Sick people are going to show up because they don't want to be marked absent or go through the process of making different arrangements.",
            "score": 39,
            "author": "jlpm2000"
        },
        {
            "level": 0,
            "comment": "Some guy in my class was coughing 20 min straight",
            "score": 6,
            "author": "Monte_20"
        },
        {
            "level": 0,
            "comment": "Agreed. I'm glad the teachers pushed back",
            "score": 24,
            "author": "shadowromantic"
        },
        {
            "level": 0,
            "comment": "Bruh there were students taking off their masks to laugh at some lame ass jokes during my lectures...it was packed too",
            "score": 43,
            "author": "Automatic_Pomelo_760",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol gotta let that prof know how funny their joke was by showing mouth!",
                    "score": 20,
                    "author": "Gappv2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is exactly why i was afraid to go back",
            "score": 33,
            "author": "Particular_Ring_1256"
        },
        {
            "level": 0,
            "comment": "Wear a (well-fitting) N95 mask to protect yourself.",
            "score": 3,
            "author": "BIBIJET"
        },
        {
            "level": 0,
            "comment": "So who do we email our concerns to? I had someone in my class not wearing a mask and the prof was wearing his mask below his nose. Like okay is there no covid? I swear.",
            "score": 3,
            "author": "pockiaya01"
        },
        {
            "level": 0,
            "comment": "If you see this, tell your teachers. Let them know how uncomfortable you are with having unmasked students.",
            "score": 17,
            "author": "shadowromantic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Moreso, people should email the dean of departments if this happens in their classrooms.\n\nIt’s one thing to make petitions online for keeping things virtual like we all saw going around; they probably don’t hold much weight in changing minds. However, if students are not complying with rules and people don’t feel safe and comfortable in these supposed “safe spaces”, they are more likely to respond, not with making things virtual, but making things safer for in-person. I would think so at least, anyway.\n\nIf the same issues happen again tomorrow, I’ll be letting teachers/faculty know that I don’t feel safe.",
                    "score": 25,
                    "author": "Gappv2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think this is the right approach. I could be wrong but I don’t think CSUS could just go back online considering we’re just one university in a state system. When the rules about returning to campus aren’t taken seriously there’s probably more that can be done. \nEither way I don’t understand the rush to get everyone back on campus. If we weren’t still in the middle of a pandemic I would be super excited to get back in the classroom. But since we’re not we have to deal with this. Aren’t we supposed to be learning and not thinking about catching COVID? I have personally had issues paying attention in class this week.",
                            "score": 5,
                            "author": "y2kmarina"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As an instructor, please don't complain to us. We have no say in this, and whatever we do, there are students that are unhappy and complaining. Many instructors don't feel safe in the classroom, but we've been forced to return to in-person classes by the administration. If you have complaints, please take them to the administration.",
                    "score": 18,
                    "author": "SacTeacher123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for this. It’s good to know the other side.  Teachers shouldn’t have to be the security either.",
                            "score": 3,
                            "author": "Gappv2"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; them to the admin\n\nMy wife is a professor too, and she has absolutely no problem calling students out for not following campus policies.",
                            "score": 2,
                            "author": "mn530"
                        },
                        {
                            "level": 2,
                            "comment": "Don’t instructors have the power to tell students to either wear a mask or get out? If they’ve got the authority to do that and aren’t doing that, they sound like exactly the person ti be complaining to.",
                            "score": 3,
                            "author": "morganmachine91",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure what \"authority\" they have to do it, but my wife has no problem telling someone to put their mask on or leave class.  Heck, she will call students out for texting in her class.  Yeah - she's a fiesty one.  LOL",
                                    "score": 1,
                                    "author": "mn530"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "An absurd shame that csus doesn't offer more online courses. They should be working nonstop to offer the same amount of courses online as on campus: and continue it after covid ends.",
            "score": 17,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it makes you feel any better, most lecture rooms sit empty for much of the semester.  They maybe see 3 hours of use a day for a semester, then that's about it.  If they're not going to put those to good use, don't expect online to be well maximized either.",
                    "score": 1,
                    "author": "Individual_Hearing_3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have class at three and i really really don’t want to go for this reason but i have no choice 🤷‍♀️",
            "score": 9,
            "author": "nutellachicken4"
        },
        {
            "level": 0,
            "comment": "Mask mandates are ending on the 15th anyway.",
            "score": 1,
            "author": "HatoriiHanzo",
            "replies": [
                {
                    "level": 1,
                    "comment": "My understanding is that the state is ending the mandate.  However, the CSU system can still require masks.",
                    "score": 2,
                    "author": "mn530",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CSU can still require masks, but the question is will they?",
                            "score": 1,
                            "author": "Ninjaguy5555"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can a man not eat a sandwich in peace?",
            "score": -21,
            "author": "jondostroix",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought this was sarcasm",
                    "score": 4,
                    "author": "MikaylaTheScrub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So did I",
                            "score": 5,
                            "author": "Gappv2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait, what is the alternative to eating? Like, do we have to eat alone? At the WELL we are allowed to take our masks off to eat, thats the rule we follow.",
            "score": -8,
            "author": "StellarInterloper",
            "replies": [
                {
                    "level": 1,
                    "comment": "The alternative to eating in class when you’re packed in with people who can’t leave is to eat outside of class. Is that really that hard to figure out?",
                    "score": 17,
                    "author": "morganmachine91",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't have to insult my intelligence. I am presenting a contradictory claim, as the WELL has a rule that it doesn't matter where you are at, you can eat food without wearing a mask. Not a soul has any problem with it, so I am wondering why this is such a concern here on this thread.",
                            "score": -6,
                            "author": "StellarInterloper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m not insulting your intelligence, I’m responding to how ridiculous it is that you’re pretending like you can’t understand something because you don’t like its premise. Obviously nobody is claiming that you can’t eat. You clearly know that there are a lot of areas that it’s fine to take your mask off and eat. The claim is that it’s selfish and rude to be eating in a cramped lecture hall where masks *are* required.\n\n\nI don’t know how you’re claiming that you can’t figure out an alternative to eating in class, while simultaneously claiming that you’re allowed to eat in The Well. Sounds like you’ve answered your own question.",
                                    "score": 11,
                                    "author": "morganmachine91",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am not trying to fight you. However, you are ignoring my point, and I think its right to pursue this. The WELL is a seriously cramped space- why is it that it is alright to remove my mask and eat there, but you are saying it isn't alright to do it in the lecture hall? It is the same pretense.",
                                            "score": -14,
                                            "author": "StellarInterloper",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m not ignoring you point, I couldn’t tell what your point was. In your first comment, you made it seem like you didn’t understand that you can eat on campus, or didn’t understand where to eat.\n\nPlaces like The Well and The Union are totally voluntary. Students who are at-risk or who have family who are at risk can avoid the areas that don’t require masks, or at least stay distant from unmasked people. That’s not even to mention professors, who absolutely have rights too.\n\nLectures are frequently mandatory, and once class has started, it can be hard to find a new seat. It’s selfish and rude to unmask when you’re in an area that masks are required, and that the people around you can’t leave.\n\nI understand that you’re not trying to argue, but it’s concerning to me that this isn’t obvious to you. I don’t think you’re unintelligent, but I do think that you’re not putting in effort to think critically about something that you have an ingrained bias against.",
                                                    "score": 15,
                                                    "author": "morganmachine91"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When should we be done with masks? Wheres your threshold?",
            "score": -15,
            "author": "KeyAd981",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t have an answer to that, because it’s not about being “done with masks”. It’s about adhering to sac state policy which requires masks to be worn in classrooms, and none of the students present said anything about “religious exemptions” either. \n\nI won’t get drug down the path of arguing about what we should or shouldn’t be doing, because that’s been debated over and over here and elsewhere.",
                    "score": 12,
                    "author": "Gappv2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OBEY.",
                            "score": -12,
                            "author": "KeyAd981",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or don’t attend 🤷🏻‍♂️. Welcome to the real world.",
                                    "score": 24,
                                    "author": "Gappv2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, Ill just wear it below my chin doesnt bother me too much. Especially since, people like you dont really seem to have an answer to when this mask thing all ends. Just, OBEY.",
                                            "score": -16,
                                            "author": "KeyAd981",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Again, I don’t have an answer. Last I checked, I’m not a biology major, a doctor, a scientist or an infectious desease expert. If you are, happy to hear your expert opinion. 🤷🏻‍♂️",
                                                    "score": 14,
                                                    "author": "Gappv2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well. Just conform then. Im sure theres nothing that you disagree with the government about. Wear a cloth mask and all that I hear they work, but also dont work. Depends which month it is or what is convenient at the time.",
                                                            "score": 0,
                                                            "author": "KeyAd981",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Of course they work, that's never been debated. Even 60% efficacy is 60% more effective than your own body's natural defense mechanisms.  \n\nOne conclusion is very clear from this conversation: you absolutely need more education, so that's great to hear you're attending college classes. Bless your heart, best of luck.",
                                                                    "score": 9,
                                                                    "author": "ExistentialKazoo",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They just implied it was going to be over when we got vaccinated. Now its boosted. I'm asking. When? What will have to happen?\n\nI dont need more educated, I am informed enough to know that Im ready to take my mask off. Youre not informed enough to tell me when that is for you. I got my vaccines and recently has covid. I have immunity. I dont need a mask. When does that occur for you?",
                                                                            "score": -3,
                                                                            "author": "KeyAd981",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "By \"they\", are you referring to campus administrators? I'm confused who you mean.  \n\nEvery person on earth could use more education, but those confused about basic health and safety could use a bit more.   \n\nIf you're asking my opinion, considering that some students live with elderly grandparents or children too young for the vaccine, and considering that many required courses are now in-person only without virtual flexibility, and that our regional hospitals have had 0 ICU beds since the second week of January, I'd recommend staying strong on mask policy, at least until those hospitalization rates drop down to more reasonable levels. My sister works in ICU and it's near- impossible to provide proper ICU-level care when patients are extended to other wings and floors of the hospital. We could also be doing more non-mask mitigation techniques to keep airflow moving better indoors on-campus with fans and forced air, but I haven't seen any ideas like that in 2 years.  \n\nI'm sorry to hear you got sick, that is crummy. I hope you feel better, and just FYI I know a fair amount of people at this point who've had it twice. So there's no reason to lay your mask down too early, unless you enjoyed getting sick.",
                                                                                    "score": 8,
                                                                                    "author": "ExistentialKazoo",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard LÁ is doing away with masks once hospital cases subside. It’s time.",
            "score": -14,
            "author": "quentinislive",
            "replies": [
                {
                    "level": 1,
                    "comment": "Funny you say that, I'm from LA and I just got an email from my old CC that they're requiring surgical masks or K / N95 masks on campus. They're giving them away to students too.",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can’t risk getting Covid, stay home.",
            "score": -75,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m following the rules laid out by sac state, these individuals are not, and in some cases starting fights. Therefore, I shouldn’t be the one forced to “stay home”, but nice try.",
                    "score": 62,
                    "author": "Gappv2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OBEY.",
                            "score": -11,
                            "author": "KeyAd981",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gtfo with your creepy ass",
                                    "score": 2,
                                    "author": "repsychedelic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol right back atcha",
                                            "score": 0,
                                            "author": "KeyAd981"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can’t stay home, the classes I need to graduate are ONLY in person. I really don’t mind being in person, but I expect everyone to be wearing masks to keep myself and my family safe.",
                    "score": 24,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Cringelord got his serving of attention",
                    "score": 27,
                    "author": "osinitsa"
                },
                {
                    "level": 1,
                    "comment": "We didn’t elect to go in person you know and it’s not as easy as that when we are required a particular class to graduate when this is supposed to be your last semester.",
                    "score": 28,
                    "author": "AJRgamer"
                },
                {
                    "level": 1,
                    "comment": "Take this L",
                    "score": 13,
                    "author": "zombiebait90"
                },
                {
                    "level": 1,
                    "comment": "Lol. Agreed.",
                    "score": -9,
                    "author": "KeyAd981"
                }
            ]
        }
    ]
}