{
    "id": "v2yl45",
    "score": 182,
    "title": "who else loves outlook?",
    "author": "Rickity_Recked",
    "date": 1654137281.0,
    "url": "https://www.reddit.com/r/CSUS/comments/v2yl45",
    "media_urls": [
        "https://i.redd.it/g706hj7ud4391.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "During the semester I received about 20 emails a day. Maybe one of them was actually relevant to me or my studies.... maybe.",
            "score": 37,
            "author": "Papa_Kasugano"
        },
        {
            "level": 0,
            "comment": "I appreciate the mission of the college, but those emails are a bit much. I don't know if that is his way of justifying his (inflated) salary or if he really believes in the mission that much.\n\nDoes anyone else think that every time he talks, he sounds like he is about to cry?",
            "score": 36,
            "author": "blooniemania",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's probably both: believing in the mission and justifying an outrageous salary",
                    "score": 15,
                    "author": "shadowromantic"
                },
                {
                    "level": 1,
                    "comment": "Lmao yes!",
                    "score": 4,
                    "author": "LeadingAppearance562"
                },
                {
                    "level": 1,
                    "comment": "Hot take: I get what you're saying but I think it's genuine.  \n\nI received zero emails like that from my undergrad school - none about internships or career fairs and certainly none from my school president. He was a controversial curmudgeon who hid in a mansion near the school, I never interacted with him.  \n\nIs Nelson going full cringe and trying so hard that it comes off as tone-deaf? Yes. Indifference is way, way worse though. The emails show that he or at least people on his team are thinking about us, and I have to hand it to him - email is the most effective way to get in touch with me.",
                    "score": 10,
                    "author": "ExistentialKazoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You might like it, but when it adds to communication noise, I realllllllly don't want unsolicited emails.  I want to be able to pick and choose who sends me emails so that what I get is relevant.  There is also the issue that anything from companies that I WANT a job from tends to get filtered out by the school which is even more agravating.",
                            "score": 6,
                            "author": "Individual_Hearing_3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "lol I didn't say I like the emails! I'm just saying I think it could be a lot worse. That last bit is pretty annoying - good luck with the job hunt though!",
                                    "score": 3,
                                    "author": "ExistentialKazoo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The last president literally embezzled funds if i remember correctly. If anything, him being going full cringe support has been part of his MO since he took office.",
                            "score": 4,
                            "author": "GreenMirage"
                        },
                        {
                            "level": 2,
                            "comment": "I agree. I used to go to another csu and the president there did a horrible job at addressing important things that happened on campus.",
                            "score": 2,
                            "author": "General-Detective709"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You made my night",
            "score": 16,
            "author": "plantlover415"
        },
        {
            "level": 0,
            "comment": "My friend set his outlook to reroute anything with the keywords \"Diversity\" or \"Inclusion/Inclusive\" straight to Trash. No one else knows they can do this?",
            "score": 11,
            "author": "Cosmic_GhostMan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently not",
                    "score": 4,
                    "author": "omega_apex128"
                },
                {
                    "level": 1,
                    "comment": "Genius",
                    "score": 5,
                    "author": "BluThoughts"
                },
                {
                    "level": 1,
                    "comment": "Lol, I do that",
                    "score": 3,
                    "author": "Individual_Hearing_3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is HILARIOUS. Yes! 😂",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "🥴",
            "score": 1,
            "author": "mikeruffin88"
        }
    ]
}