{
    "id": "14464fg",
    "score": 3992,
    "title": "When is the Yuumi rework that was supposed to remove her from pro play going to be released?",
    "author": "katsuatis",
    "date": 1686222085.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/14464fg",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/leagueoflegends/comments/14464fg/comment/jnfpy66/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/leagueoflegends/comments/14464fg/comment/jnfpy66/?utm_source=share&amp;utm_medium=web2x&amp;context=3)"
    ],
    "postText": "I heard that they are planning something that will make her more of a new player champ instead of a pro play pick or ban, anyone knows when it goes live? I'm kinda bored of watching pro play with Yuumi every other game.\n\nEdit: Phreak's response so it's not buried\n\n[https://www.reddit.com/r/leagueoflegends/comments/14464fg/comment/jnfpy66/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/leagueoflegends/comments/14464fg/comment/jnfpy66/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
    "comments": [
        {
            "level": 0,
            "comment": "It turns out, even if you delete yuumi’s skill expression, the ability to be an extra two items for Ruler is pro-skewed",
            "score": 3211,
            "author": "Illustrious_Night126",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fact that they removed her old passive that made her jump off to procc the shield is so asinine to me.",
                    "score": 1164,
                    "author": "NommySed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Riot said it was not fun for Yuumi players and they don't like to unattach.\n\nYeah, turns out having a weakness was not fun for Yuumi players. Oh no :S",
                            "score": 2094,
                            "author": "Jozoz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At some point, Riot made a very abrupt about face regarding Yuumi. One minute, they're describing her as a deceptively high skill expression character, the next Riot says she was always supposed to have been a very easy champion to pick up and learn. The whiplash was wild.",
                                    "score": 933,
                                    "author": "chaser676",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That *\"Yuumi is as hard to master as Akali or Qiyana\"* post seems like just another post in a long list of Riot showing selective data do push a narrative.\n\nIt should go without saying that when a company shows data that says \"look how good our product is!\" you should be very skeptical.\n\nThere's a reason why so many auditing and standardization requirements exist to stop companies doing this in more traditional fields (e.g. reporting on carbon footprints). \n\nDifferent example obviously but the concept is the same. If there's no transparency or external review, don't trust the claims made.",
                                            "score": 553,
                                            "author": "Jozoz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I believe it, have you ever opgg’d a master yuumi player? They’re all smurfs on Talon, Rengar, Kha’zix, Qiyana or Nidalee",
                                                    "score": 364,
                                                    "author": "TurboGrafx_16",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They seem to be amazing at Draven too. It's wild.",
                                                            "score": 173,
                                                            "author": "Jozoz",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Support so hard that you turn into the main ad carry. \n\nHorseshoe theory at work",
                                                                    "score": 99,
                                                                    "author": "Yongaia",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Maybe Yuumi players just have enough time to watch Draven guides on their second monitor while playing /s",
                                                                            "score": 83,
                                                                            "author": "Jozoz",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Or they're all secretly Draven players who main Yuumi with their feet",
                                                                                    "score": 59,
                                                                                    "author": "Yongaia",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I have a friend who was hard stuck plat 4 jng. Once he switched over to one tricking yuumi he got to diamond.",
                                                            "score": 20,
                                                            "author": "ladend9",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I liked the narative of \"Yuumi is hard because sometimes she has to worry about things other champs worry about *all the time*\"",
                                                    "score": 170,
                                                    "author": "Nathremar8",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All I see Yuumi players are worrying about is flaming their teammates in chat because their hands are always free to type",
                                                            "score": 22,
                                                            "author": "Ok-Eye2695",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I remember over 5 years ago or so when supports were the punching bag, like jungle is now, they used to say this. And everyone was like \"...yeah we do all that too\"",
                                                            "score": 8,
                                                            "author": "DownhillDino",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I mean the argument is that supports are squishy and if they mess up positioning, the cost for their failure is greater than if say... A tank like Poppy, a bruiser like Darius, or someone with dashes/blinks like Zed.\n\nThe cost for poor positioning is definitely greater for ADCs, though, who have to actively enter danger to contribute, while squishy supports can usually hover around the edge, assuming their team is playing front to back.\n\nYuumi got the counterplay for enchanters (which is to quickly delete them since they have no stats but can add huge stats to others) completely removed. Enchanters do require *some* measure of awareness/skill (ofc so does every role).\n\nYuumi is the literal stereotype of what people think enchanters are. No awareness or skill required. It might help, sure, but the price of inefficient play is minimal because you're always out of the fight unless your *host* misplays egregiously.",
                                                                    "score": 10,
                                                                    "author": "GameConsideration"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s as if almost Yuumi players are mental.",
                                                            "score": 4,
                                                            "author": "Craft_zeppelin"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I think that post was the maddest Riot ever made me. Literally a gaslight article trying to convince millions upon millions of players that pigs can fly. Sorry Riot, I have hands, eyes, and am not suffering from any debilitating mental disabilities, you'll never convince me the character that requires one hand to play is skilled. Not to mention that stats the pushed were easily explainable by the fact that higher elo ADCs obviously benefit from the extra gold and survivability that Yuumi GUARANTEES compared to low elo ADCs, as proven by pick or ban presence in proplay since release. I hate Yuumi so much it's unreal.",
                                                    "score": 3,
                                                    "author": "InsertPoptropicaName"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Old yuumi was legitimately hard to master, despite popular consensus. You needed to take advantage of her ability to trade absurdly well levels 1-2 thanks to her old passive and get good at detaching in mid-late game team fights to proc your passive and body block skill shots while never getting hit by any stray cc because you’ll die instantly. If all you did on old yuumi was hop on one person and never detach you weren’t playing her even close to her full potential. New yuumi is much more of an abomination imo, because she requires doing much less for more reward.",
                                                    "score": 93,
                                                    "author": "parrot6632",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Okay, but now imagine you're a different support. You make all those *exact same decisions*, choosing when to pressure with an auto, make use of your passive, and body block shots and damage for your ADC while also having to independently manage your own position and HP bar. Yuumi has the advantage in all of those situations because she's right next to the other person fighting in the lane, and can juke when she gets low, becoming un-targetable. \n\nYuumi's real difficulty is in warding, vision control, and roaming. Things your ADC isn't going to want to participate in, but you have to do anyway because trading in lane isn't the only thing a support is supposed to do - but Yuumi's not a real character by herself. In all of those trading situations, Yuumi had an *advantage* over a standard support, and that's what pro players are pushing.\n\nThe \"mastery\" of Yuumi is just realizing that you can't always be a blob and have to actually do things ... it's a bit of a hard sell that that's real skill and not just adjusting to the weirdness of Yuumi.",
                                                            "score": 59,
                                                            "author": "Outfox3D",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They are arguing that the margin of error of a mastered Yuumi is slimmer than other mastered supports.\n\nI don't think it's controversial to say that Braum or if you want an enchanter Lulu is easier to play to perfection than Yuumi.\n\nOld Yuumi was skill expressive. I don't think that takes anything away from her obnoxiousness. Zeri is most definitely hard to play, but is still badly designed in my opinion.",
                                                                    "score": 4,
                                                                    "author": "algebraic_humanist"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I'm not sure what people are struggling with here. Riot removed skill expression from her because it was making her too strong in pro play while also taking up too much of her power budget for low elo players.\n\nRemoving the jumping off nerfs her for pro players while letting them put power into the more passive gameplay in low elo.",
                                                            "score": 51,
                                                            "author": "HazelCheese",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I mean that would be a viable argument if the majority of low Elo Yuumis weren’t just playing her because they got auto filled support didn’t want to actually do anything and weren’t spending half the game plus watching Netflix or grinding in another game. The gap wasn’t because of some deeps complex skill expression or anything it was one skill group using her because she was busted as fuck without doing much and the other was because she basically let you afk",
                                                                    "score": 35,
                                                                    "author": "Kyhron",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t think that qualifies for making a champion “hard”. Yuumi was never forced to trade early because she needed an early advantage because she scaled well.\n\nAlso, ADCs usually have to constantly dodge every skill shot or else they blow up.\n\nChampions like Azir, Orianna, Riven, Kalista, etc are much harder IMO because on top of doing all of what you listed, they have additional requirements (managing sand soldiers, positioning the ori ball, constant animation cancelling and auto weaving, properly using passive to kite)\n\nWhat you’ve listed is “My champions is hard to master because they need to poke levels 1-2 and need to position well in fights and peel” which applies to almost every enchanter that has ever existed, but even others like renata have other requirements like properly timing W.\n\nI know what a braindead easy champ is, I play Malzahar, you’re one of us.",
                                                            "score": 17,
                                                            "author": "DoopyBot",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "riot probably realised that if they nerf yuumi, their players just quit instead of learning other champs. Its in their financial interest to keep yuumi strong",
                                            "score": 95,
                                            "author": "Blank-612",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Shoutout to all the times Yasuo/Yone got pre-buffed before some systems change.",
                                                    "score": 156,
                                                    "author": "Jozoz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You know they literally released Yone to drop Yasuo’s presence lol.\n\nThey made an entirely new champion just to get mains to stop only playing Yasuo.",
                                                            "score": 69,
                                                            "author": "FairlyOddParent734",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Mainly just to get people to stop banning Yasuo because now they know if they do they'll just be playing against Yasuo2 instead.",
                                                                    "score": 87,
                                                                    "author": "HazelCheese",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You will deal with our champion design and you will LIKE it.",
                                                                            "score": 36,
                                                                            "author": "Saephon",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "watch me and my duo ban both",
                                                                                    "score": 3,
                                                                                    "author": "peaivea"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I believe they added more variations of Yasuo's bullshit wall just so people stopped whining about him.",
                                                                    "score": 5,
                                                                    "author": "Sbotkin"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Also so the poor Yasuo mains have a backup option if someone else dares to pick him, and because sometimes the enemy team decides to oppress them by banning their champion.",
                                                                    "score": 16,
                                                                    "author": "Halbaras",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's funny because they literally admitted originally Yone was supposed to be a 1:1 Yasuo clone. They were supposed to be THE SAME EXACT CHAMPION in a game where bans exist.\n\nYou could not make that up. Just the fact that that thought crossed their mind and they spent development time on it is insane.",
                                                                            "score": 24,
                                                                            "author": "EnjoyerOfBeans",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It was even so bad that initially if Yasuo and/or Yone would get buffed or nerfed, the other part would receive the exact same buffs/nerfs.\n\nLike we get it Riot, stop trying to shove those champs in my face.",
                                                                                    "score": 13,
                                                                                    "author": "Juliandroid98"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nilah too, she basically exists to give Yasuo/Yone players the option to queue Bot as their secondary role so that they don't cry when they don't get Mid every single game",
                                                                    "score": 21,
                                                                    "author": "waytooeffay",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You can already go bot as yas and they don’t even play the same in the slightest",
                                                                            "score": 24,
                                                                            "author": "Dominationartz",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I mean, you can read it in Riot's own words if you'd like, they made two separate blog posts about her development: [Here](https://www.leagueoflegends.com/en-gb/news/dev/champion-insights-nilah/) and [Here](https://www.leagueoflegends.com/en-gb/news/dev/nilah-designing-league-s-first-melee-bot-laner/)\n\nBoth mention within the first 60 seconds of reading that their main inspiration was to create a champ for Yasuo/Yone players to take bot without Riot needing to worry about balancing them around both bot and mid.",
                                                                                    "score": 27,
                                                                                    "author": "waytooeffay",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Its was the opposite. Because everyone kept banning Yas they released Yone.\n\nInstead of considering why everyone was always banning Yas regardless of his WR….",
                                                                    "score": 10,
                                                                    "author": "Jstin8",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "To be fair what you’re describing is high skill cap low skill floor which is possible (Ezreal for example is easy to not feed on but hard to be super broken with). But also that’s a lie regarding Yuumi anyways.",
                                            "score": 13,
                                            "author": "StoicallyGay",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dude, not even tin foil hat here. Riot is just a classic over bloated mess of overly righteous engineers that joined an already successful company having larger than life ego's about **everything.**  \n\n\nI can almost smell exactly how their internal meetings go down. It's just Riot employee A talking to employee B in the most verbose language possible about how users are wrong and it's their job to show them the light.  \n\n\nPro tip: The reason League got so big is because the OG core game just catered to an immediate player desire",
                                            "score": 10,
                                            "author": "DatTrackGuy",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Being intended to be A and then turning out to be B is pretty natural. Still, expecting CertainlyT to create champion that will not be problematic for the next few years is just stupid.",
                                            "score": 13,
                                            "author": "Dragonatis",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Mate, she is just not your tempo.",
                                            "score": 10,
                                            "author": "Flikky1988"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That doesnt seem incompatible at all to me. From the start they always wanted to make her an easy beginner champion. But they failed horribly and made her one of the most skill intensive champions in the game instead. Now they have to somehow turn her into what they originally wanted her to be with the significantly reduced design freedom of a rework. While also having the problem that her established playerbase now wants a high skill champion.\n\n(Essentially the same thing happened with kalista btw)",
                                            "score": 17,
                                            "author": "r_xy",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As a former Yuumi Main i loved that mechanic. It was actual skill expression and was high risk reward play. Tanking an Ez q or a Brand Q for my adc was so much fun. New Yuumi feels like actual trash",
                                    "score": 19,
                                    "author": "FloorImmediate9220",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "New Yuumi is strong, but just mind numbingly boring",
                                            "score": 5,
                                            "author": "MadMeow"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I actually enjoyed that part about Yuumi. As it actually made you observe enemy cooldowns and time shit in teamfights.",
                                    "score": 14,
                                    "author": "NommySed",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "300k yuumi main. That was the only part of her kit I enjoyed. Hoping off in combat for the extra shield to save a life felt really nice. I've played maybe 5 games with her after rework. Boring ass champion and killed my drive to play her.",
                                    "score": 38,
                                    "author": "Shin_mmi",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The funniest thing is that Yuumi players wanted the opposite, it's way more fun to time detachments and jump between champions than AFK most of the time and just press 2 buttons every once in a while, sometimes 3. I'm not a Yuumi main but looking through their sub this seemed to be the sentiment",
                                    "score": 50,
                                    "author": "LightIsMyPath",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;The funniest thing is that Yuumi players wanted the opposite\n\ndon't think that what you see on reddit is what is indicative of the playerbase. reddit is a tiny, literally insignifcant portion of the playerbase and this has been shown time and time again where reddit is clearly the outlier.\n\nfor all the yuumi players here who wanted her to be constantly jumping, i bet there's 5 yuumi players who are happy they aren't gimped because now they can sit on their eboyfriend full time\n\nregardless, making yuumi a more active champion would only push her more towards pro play which is explicitly what they wanted to avoid. obviously it didn't work out anyways, but their reasoning was sound.",
                                            "score": 21,
                                            "author": "SamiraSimp"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean that's just the players being short sighted. Say that Riot did promote the more active playstyle where you need to hop off and on. What ends up happening is that Yuumi becomes even more pro play skewed and she needs to be nerfed even more, making her worse in solo queue just to be balanced in pro play. Instead of the playerbase being happy they cry about their champion being gutted for casuals. Does this sound familiar? It should because it's literally what happened every single time riot buffed Yuumi's passive - aka the skill expressive part of her kit. \n\n&amp;#x200B;\n\nIf you promote the AFK style of Yuumi, at least she can be played in solo queue. If you promote the proactive Yuumi, she's horrible in solo queue but godly in pro play.",
                                            "score": 26,
                                            "author": "Specter-Eye",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think we’ve learned she’ll be godly in pro play regardless tbh. If nothing else riot leaning into the more active part of her kit might’ve at least made her more interesting to watch.",
                                                    "score": 15,
                                                    "author": "parrot6632",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s not what riot said. They said pro players were able to abuse the passive way more than solo queue players and were way better at detaching and proccing it, so leaning more into that aspect wasn’t going to solve the issue.",
                                    "score": 29,
                                    "author": "Crazhand",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s almost like pro players were actually trying to play the champ and solo queue players were using her as an excuse to afk for most of the game",
                                            "score": 17,
                                            "author": "Kyhron"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But how is it not fun to have skill expression in taking a small risk every minute or so just so you can use your passive? Its like they rly need to watch netflix while playing",
                                    "score": 4,
                                    "author": "saimerej21"
                                },
                                {
                                    "level": 3,
                                    "comment": "Um, no, don't blame us Yuumi mains for this. We've been complaining about passive nerfs since day 1. We hate this rework even more than you do. Riot did that abomination of a rework thinking about proplay (and failed), not about us or you.",
                                    "score": 20,
                                    "author": "theteaexpert"
                                },
                                {
                                    "level": 3,
                                    "comment": "That part was basically the only interesting part of her old kit lmao",
                                    "score": 3,
                                    "author": "anupsetzombie"
                                },
                                {
                                    "level": 3,
                                    "comment": "Bullshit. What they said was that the detach incentive made her overbearing in high level play where they play her perfectly. It was removed because it WASN'T a weakness in pro, it was a strength. It was only a weakness in low ELO where the players detach at the wrong times and die.",
                                    "score": 3,
                                    "author": "BlaxicanX"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yuumi subreddit was spammed every day after rework release with posts that they want old passive back lol",
                                    "score": 3,
                                    "author": "orzel320"
                                },
                                {
                                    "level": 3,
                                    "comment": "That's not true. Every yuumi main I know fucking hated the passive change",
                                    "score": 8,
                                    "author": "Syeglinde"
                                },
                                {
                                    "level": 3,
                                    "comment": "This is such a lie (from Riot) though?\n\nWhere and when did anyone say that, playing Yuumi was actually fun if you were active in lane, that's one of the reasons i read in comments about changing Yuumi, a bad yuumi was useless in lane but a good one dominated.",
                                    "score": 13,
                                    "author": "quanticInt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can watch Phreak's Yuumi changes video. He talks about what made Yuumi OP in pro was her ability to detach poke auto and re-attach again and he made it clear this would be changed. Also just a great look back at all the Youtube video saying this killed Yuumi.",
                                            "score": 14,
                                            "author": "Azncheesy"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;This is such a lie (from Riot) though?\n\nRiot Games would never! /s",
                                            "score": 3,
                                            "author": "Sbotkin"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I have absolutely 0 clue who even said that, even the yuumi main subreddit is complaining about how dull the rework is, and it's not like old yuumi was a fiesta either. They wanted to make yuumi so mind numbingly boring that they hoped no one would ever pick her",
                                    "score": 2,
                                    "author": "MrsKnowNone"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I believe the argument was that pros maximized its effect too hard. But then again, don't pros do that with every ability that has skill expression?",
                            "score": 50,
                            "author": "Runic_Bistro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yuumi just had deceptively good base stats. She could trade fairly well in lane which is why Zeri / Yuumi could contest Lucian Nami early on and usually get the push. \n\nMost players didn’t / weren’t able to leverage these as good as pro play where comps are drafted much more intelligently than SoloQ.",
                                    "score": 12,
                                    "author": "Alex_Wizard",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I remember phreak saying that yuumi could actually trade an auto with draven (q active) up until level 5 and win the trade. kind of crazy if you think about it.",
                                            "score": 9,
                                            "author": "MydadisGon3",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, that's exactly it. A lot of Yuumi's power was gated behind hopping off and autoing, which pro yuumi's do really well, and average yuumi's do poorly. Thus, in order to shift her power from pro play to average play, they removed that. In theory, this means that the gap between pro and average is smaller (because now her power should be in places that average players are relatively better at accessing), and so you can have yuumi at 50% winrate for average players without pro presence. Its solid theory, they just need to pull some more balance levers to get there.",
                                    "score": 77,
                                    "author": "Lunarahi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is true.\n\nHowever the other issue is that by reducing the frequency with which she needs to hop off, they effectively increased her untargetable uptime, and an untargetable force multiplier enchanter is also MUCH stronger in co-ordinated play than normal play.",
                                            "score": 30,
                                            "author": "The_Bazzalisk",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don't know about solid theory. It's only solid theory under the assumption that Yuumi being untargetable is not an issue.\n\nI don't think most people would buy into that assumption.",
                                            "score": 28,
                                            "author": "Jozoz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean I've always found Yasuo's windwall deleting me from teamfights an issue as an ADC player but eventually I just had to suck it up and accept it's always going to exist.",
                                                    "score": 19,
                                                    "author": "HazelCheese",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wait a second. I haven't played in a few years. They REMOVED the only mechanic that she had? That's a fucking bruh moment",
                            "score": 4,
                            "author": "Reliquent",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As someone who plays yuumi from time to time, I agree. It was fun skill expression and good risk reward. Her autos still being super short range makes it feel way too risky to hop off for such a pitiful reward.",
                            "score": 3,
                            "author": "ScTiger1311"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There exists a timeline where Skarner is reworked and Yuumi isn't an enchanter.",
            "score": 702,
            "author": "Entrah",
            "replies": [
                {
                    "level": 1,
                    "comment": "We saw the non-Enchanter Yuumi meta. She dragged Garen botlane or latched onto Talon jungle and built full damage.\n\nIt was not any healthier than her enchanter existence.",
                    "score": 390,
                    "author": "F0RGERY",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "seing half the healthbar of the ADC deleted by a Qspell was more hype than the disengage button she is right now",
                            "score": 96,
                            "author": "HairyKraken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah but being the ADC being nuked by a guided fucking missile launched by a character you literally cannot interact with made me want to strangle the rioter who made that article saying she's as hard as akali.",
                                    "score": 211,
                                    "author": "MaridKing",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It is only normal that a Ilaoi main would take pleasure in seeing smb chucked to half hp after landing a spammable skillshot",
                                    "score": 40,
                                    "author": "BlakenedHeart",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i plaid guilty",
                                            "score": 16,
                                            "author": "HairyKraken"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's the timeline where Riot releases Norra in League instead and she's Bard 2.",
                    "score": 17,
                    "author": "Spriter_the_Sentinel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think these upcoming Lulu and Milio nerfs will only increase her presence in pro. She's fundamentally the most broken enchanter and once Milio is less overtuned teams will likely favour her more. Unlikely these upcoming Milio nerfs reduce him below 100% presence though since it doesn't really target pro play, unlike the Lulu nerfs.",
            "score": 477,
            "author": "Vars_An",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aware",
                    "score": 92,
                    "author": "katsuatis"
                },
                {
                    "level": 1,
                    "comment": "She is getting nerfed too",
                    "score": 41,
                    "author": "Xey2510",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup but Riot only cares about winrates and once they are both nerfed to have the same winrates in soloq it's likely Yuumi will take priority in pro play. She held 100% winrate and presence in Worlds last year with something like 47% winrate in soloq, Milio is currently sat at around 53.5%.",
                            "score": 41,
                            "author": "Vars_An",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Yup but Riot only cares about winrates\n\nCategorically incorrect.\n\nPickrates are very important too.\n\nRammus is unpopular and not picked much. Historically; he's been fine as high as 55%~56% for long periods. Why? Because when he is picked:\n\n1: He's picked into situations where his niche excels *and he is expected to win*\n\n2: People who pick Rammus usually know how to use Rammus.\n\n3: Due to his unpopularity; a lot of people don't really know how to fight Rammus.\n\nContrast Ezreal; who frequently gets nerfed at 48~49% because he is stupid popular; while his winrate is also dragged down by people bad with him, building the wrong items on him [or the wrong items in the wrong situations], and him being so popular people know how to fight him because they do it often.\n\nA champion isn't gonna get nerfed because they have a 100% winrate in pro if they were picked twice as a counterpick.\n\nHell; at one point Riot said they were gonna rework Yasuo because of his *banrate*. This never happened however and instead became Yone; who Riot outright said was a \"Yasuo Echo Fighter\" to \"give the Yasuo players something to play when Yasuo is banned\".",
                                    "score": 77,
                                    "author": "raikaria2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup also there was also a post here not too long ago about zilean which haven't been touched for over 7 years and allowed to be really broken all this time because no one plays zilean.\n\nedit: Forgot how long 2750 days is",
                                            "score": 27,
                                            "author": "hutre"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Funny thing is she already clowned on milio before the nerfs",
                    "score": 9,
                    "author": "WiddleWilly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any day now, Riot will remove the untargetability /s\n\nThis champion cannot both be untargetable and have meaningful supportive abilities while not being a problem in professional play.\n\nBeing uninteractive is just a fundamentally too strong characteristic for a champion to have.",
            "score": 1040,
            "author": "Jozoz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, people often compare her to IO from Dota2 but a better comparison would be Divine Rapier rush Arc Warden\n\nIt wasn't even that strong of a strategy but playing against a champion that would sit in base and perma split with this clones was so uninteractive it got removed from the game \n\nWhile you're not literally sitting in base with Yuumi the only way you ever get punished and die outside of laning phase is if your entire team is dead, if a champs only counterplay is waiting untill the rest of their team gets wiped, or exactly Soraka silence and Singed W, you have to wonder wtf the designer was thinking",
                    "score": 26,
                    "author": "VariableDrawing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They set her up to be an all or nothing. If she's useful at all, she's broken due to her being untargetable 90% of the time. And if she's less productive than other supports she's completely useless. \n\nI genuinely think banning her from pro play altogether might be the best call. It would be unprecedented and Riot will never do that, but either she's playable or not. There's really no in between is there?",
                    "score": 273,
                    "author": "soccerpuma03",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where’s the line if they ban her from pro play though?  Is she still playable in challenger/masters/etc?  Will pro’s who face her in soloQ complain to Riot about how they now experience “unrealistic” games when they’re trying to practice?  \n\nI feel like the cleanest path is for Riot to clobber her with the nerf stick and just accept that they made a fundamentally problematic champion.  Ain’t never gonna happen unfortunately.",
                            "score": 155,
                            "author": "Strappwn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is the way. They have done it in the past. Problematic champions need to be nerfed into the ground until a solid idea on how to approach a rework comes up. Not banned, simply unplayable.  \nOld Heimer and old Eve were F-tier for YEARS before Riot reworked them. Old yorick was so toxic to play against (besides weak) that they removed him from free champion rotation for years.  \n\n\nNobody but Yuumi mains like Yuumi. That is a problem.",
                                    "score": 102,
                                    "author": "TheWraithlord99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Old yorick was so toxic to play against\n\nAh a classic... Yorick walks into a bar. There is no counter.",
                                            "score": 30,
                                            "author": "_Deinonychus_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gotta miss old league",
                                                    "score": 8,
                                                    "author": "TheWraithlord99"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean tbf nobody but shaco mains like shaco either",
                                            "score": 56,
                                            "author": "Calistilaigh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "True, nobody likes Shaco. But, while playable in soloq, he is shit tier in competitive and always has been. Also, to be fair, it takes quite a bit of skill to play Shaco effectively (box placement, clone management, wildly different itemization options) and he has plenty of hard counters. Lastly, he has outplay potential. Yuumi is downright a noob friendly champ that should not do OK in competitive.\n\nYuumi just enforces a non interactive playstyle: you cant counter Yummi, you have to counter whoever she is attached to. She is the go-to champion for eloboosting and toxic combos like the Zeri-Yuumi botlane.",
                                                    "score": 61,
                                                    "author": "TheWraithlord99",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Ain’t never gonna happen unfortunately.\n\ni mean, they were willing to dumpster azir/kalista/ryze for essentially years at a time (less so for ryze) with sub 45% winrates.\n\ni just wish riot had the cajones to do that to yuumi, she currently is meta in pro with around a 50% winrate. i'd like to think/hope that if they nerfed current yuumi to a 40% winrate champion, that she would be bad enough to not be meta in pro, but still \"playable\" for new players",
                                    "score": 15,
                                    "author": "SamiraSimp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s true, they threw azir in the bin for a long time, though at least with him the bugs helped justify it.  I think they’ll probably end up going with some version of your approach - hurt her enough to keep her out of the meta, while leaving her available as some token offering to new players.  Then behind the scenes they’ll retool her again because they are stubborn.",
                                            "score": 8,
                                            "author": "Strappwn",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Will pro’s who face her in soloQ complain to Riot about how they now experience “unrealistic” games when they’re trying to practice? \n\nI dunno, sounds like a Champion's Queue issue to me.",
                                    "score": 31,
                                    "author": "Redryhno"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh I totally agree! The problem is Riot wants her to be a good \"beginner pick\", but nerfing her out of pro play makes her a terrible beginner pick because she's too underwhelming. And if you make her switch between targetable and untargetable while using abilities, she now has way more mechanical skill and decision making needed to be effective. Which ruins the beginner identity. That's why she's the ultimate all or nothing lol. There's no way to balance around a kit based on a mechanic that is so 100% or 0%.",
                                    "score": 7,
                                    "author": "soccerpuma03",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It would be interesting to see only half of champions allowed into pro play in summer, while changing to the other half in winter. And have all champions viable for worlds.",
                                    "score": 3,
                                    "author": "PreLubricatedPenguin",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Obviously the line would be not letting her be a competitive champion, or in other words no ranked either.",
                                    "score": 11,
                                    "author": "WoonStruck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d be down with this.  One hell of a pill for Riot to swallow though.",
                                            "score": 8,
                                            "author": "Strappwn",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think they would then have to address almost all of their new champs have been problematic and counter intuitive to a moba. I haven’t played much since yuumi’s release but the direction league has been going with champion kits is fucking absurd",
                                    "score": 2,
                                    "author": "Bisquix"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think one of the problems is that pro play picks are very inertia-heavy. A champ with high presence in pro play needs to be nerfed significantly for pros to stop playing it because they've already put so much time into getting good at it, building comps with it, etc. It's why people are still defaulting to Azir, Wukong, Vi, Jayce, etc despite all of them receiving pro play focused tuning.\n\nA second problem, for specifically Yuumi and Lulu, is how good they are with Zeri. As long as Zeri is still a pro-pick, Yuumi will be good because their synergy is Xayah/Rakan levels. I think if you nerf Zeri to oblivion Yuumi will fall out of pro play naturally with minimal tuning.",
                            "score": 10,
                            "author": "downvoted_throwaway"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Untargetable enchanter just doesn't work. The counterplay to enchanters is to dive them first. Make an enchanter that only dies if your *entire* team dies first? Predictably, frustrating to deal with.",
                    "score": 90,
                    "author": "Ikea_desklamp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, so predictably she needs to do less healing/supporting/utility than other enchanters to be \"balanced\". But that feels bad for Yuumi players.\n\nIts almost like being a playable item isnt good design.",
                            "score": 44,
                            "author": "thatedvardguy"
                        },
                        {
                            "level": 2,
                            "comment": "It can work but it has to be much higher risk. They don’t want her to be higher risk because she’s supposed to be basic.\n\nThat’s the main issue. They want her to be easy but usable. That conflicts with the untargetable side.",
                            "score": 6,
                            "author": "50-Minute-Wait"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was convinced that's where they were going with her rework. Maybe it could work off a tether system where she has some freedom to reposition but gets dragged along by whoever she's attached to. Imagine if she could actually choose to block skillshots while attached, and could use her healthbar as a resource.",
                    "score": 3,
                    "author": "Halbaras"
                },
                {
                    "level": 1,
                    "comment": "They could make her recieve like 150% damage from AoE spells while attached to shake up the support meta and make mage supports viable again. Think Lux Brand or Xerath with their respective AoE spells maxed",
                    "score": 30,
                    "author": "SuperWoodpecker95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or just AP MF, and yuumi with a 0% wr",
                            "score": 26,
                            "author": "P1pslyTheGreat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are making me wet. Stop.",
                                    "score": 16,
                                    "author": "Agitated-Two-1909",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nonono, keep going...",
                                            "score": 5,
                                            "author": "SuperWoodpecker95"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Patch Notes:\n\nYuumi no longer deals any damage, provides any healing or shielding, or is capable of crowd controlling any champion for any length of time.\n\nHowever, when you lock in Yuumi, regardless of which nexus explodes first, your screen will display \"Victory!\"\n\nThis does not affect the actual win or loss.\n\nBoom fixed her hire me Riot.",
            "score": 291,
            "author": "GD_Insomniac",
            "replies": [
                {
                    "level": 1,
                    "comment": "let this man cook",
                    "score": 63,
                    "author": "MaridKing"
                },
                {
                    "level": 1,
                    "comment": "https://youtu.be/Z1UmbZ2_ylk",
                    "score": 6,
                    "author": "RobbinDeBank",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shh I'm trying to pass this off as my original thought, don't share my sources with all the zoomers!",
                            "score": 6,
                            "author": "GD_Insomniac"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not going to happen until Phroxzon and the rest of the balance team accepts that Yuumi's untargetable attach mechanic is the most inherently broken and unbalanceable gameplay concept to have ever existed and rework her in a way that removes it. Yuumi is not a champion, she is a playable buff. Someone saying they're good at Yuumi is like saying they're good at red buff. Until Riot admits that, Yuumi should stay perma'd for pro play. It's boring for the player, boring for the enemy team and boring for the viewer.",
            "score": 506,
            "author": "Fun-Consequence4950",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yo wdym?! I'm an excellent red buff! I'm constantly fucked by the jungler on spawn",
                    "score": 149,
                    "author": "Drogatog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This comment taken out of context sounds kinda sus",
                            "score": 23,
                            "author": "MoscaMosquete"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Someone saying they're good at Yuumi is like saying they're good at red buff.\n\nNeeko mains crying",
                    "score": 13,
                    "author": "Many-Cat-3140"
                },
                {
                    "level": 1,
                    "comment": "Kinda a rant, but holy fuck what is it with yuumi players and their ego during games. Always typing as if they did anything the entire game but sit on the most fed champ and press R every fight.",
                    "score": 61,
                    "author": "SnipersAreCancer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They have a lot of extra time to type because they don't actually have to play the game.",
                            "score": 101,
                            "author": "Rizalelan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I honestly wouldn't even mind if it was banter or something, but gawd damn the amount of yuumi players i've seen type \"?\" in all chat (or other forms of bm) is astronomically higher than the amount of times a yuumi player presses any gameplay-related keys during a game.",
                                    "score": 31,
                                    "author": "SnipersAreCancer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, I've never had as much bm from an enemy support than from yuumis! Just their way of keeping apm up I guess",
                                            "score": 8,
                                            "author": "Critterting"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[I cannot imagine why Yuumi players act like that](https://www.youtube.com/watch?v=9wtvXoXh0VU)",
                            "score": 10,
                            "author": "PlacatedPlatypus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "this whole thread is making my day lmao. u guys are hilarious. good at red buff XD",
                    "score": 5,
                    "author": "crowgift"
                },
                {
                    "level": 1,
                    "comment": "It's not the attach mechanic, it's how it's implemented. Hots is not league but abathur is totally fine and people were begging for him to be put in league. Well they got what they wanted. Are they happy?\n\nForcing the cat to detach frequently at all stages of the game in order to access its power is the right move, but the balance and design teams clearly have way too many conflicting opinions about that. I'm sure you have like 4 dudes trying to salvage yuumi by making her the new player support, 2 of em trying to gut her entirely, and 1 who keeps asking for her to be at least occasionally targetable.",
                    "score": 47,
                    "author": "PsychicFoxWithSpoons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anyone saying abathur is totally fine never played anything other than QM. This guy was perma banned in even diamond+ amateur leagues due to how broken he was.\n\nHots and balance in general should also just never be mentioned unironically in the same sentence. HotS had broken heroes that were so broken they literally would be off the charts of how problematic they were compared to league champions. We're talking 60-70% win rates and left that way for MONTHS AND MONTHS while bans were controlled by a single person on your team.\n\nTake akali rework on release, give her across the board buffs to literally everything (damage, healing, durability, MS, CD, etc), leave her in that state for months, and you've got an idea of what hots balancing was like.",
                            "score": 8,
                            "author": "rta3425",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Hots is not league but abathur is totally fine and people were begging for him to be put in league.\n\nBro HUH? A good Abathur was easily worth 2 heroes. Man could show up to map objectives with his possess while farming xp in the far lane bush. You'd be on Blackheart Bay jockeying the turn in for 3 minutes and come out 2 levels up with the topside turret dead because Abathur was just slow pushing it the entire time while still contributing.  He was NUTS unless you didn't have a character for him to buff up on your team. People picked ults specifically to hunt and kill Abathur because if you let him exist outside of his base wall you'd lose the game.\n\nWant to point out the Irony that Abathur remains significantly more interactive than Yuumi ever has been, by the way. High skill expression macro support play where taking risks and exposing your extremely weak self to potential punishment is rewarded correctly by providing benefit you otherwise wouldn't to your team.",
                            "score": 30,
                            "author": "pallypal"
                        },
                        {
                            "level": 2,
                            "comment": "Abathur was broken in pro unless at 43% winrate in SL. Just like Yuumi. \n\nRight now Yuumi is only strong because of Lucian and Zeri's strength and the current pro meta. She will be weaker next patch and likely in a good balanced state with those two being nerfed. Milio and Lulu are better enchanters with everyone else except Sivir who isn't meta right now.",
                            "score": 31,
                            "author": "joetothejack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Shit even Wisp in dota was super broken despite the low winrate in pubs for a long time because of the value tether stun and heal had. \n\nYuumi basically being a nontargetable wisp means she will always have value if she is even slightly decent",
                                    "score": 29,
                                    "author": "moonmeh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For wisp I'd argue the ult was the biggest factor",
                                            "score": 11,
                                            "author": "Moresty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh true that. Man old wisp was super broken, how did tether stun last for so long",
                                                    "score": 3,
                                                    "author": "moonmeh"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "IO is still bonkers even if it's garbage in soloQ, just look at the last major with Witch Doctor (a support) + IO duo lane stomping everyone or Leshrac+IO",
                                            "score": 2,
                                            "author": "TheAnnibal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "IO and destroying tournaments. Name a more iconic duo.\n\nAh yes Tiny and IO destroying  tournaments.",
                                                    "score": 3,
                                                    "author": "BlakenedHeart"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Correction: Abathur was only broken after they changed the entire game to fuck over specialists, then removed the specialist class, then reworked his talents to make his support build clearly the best build, then added multiple super mobile hyper carries from Overwatch to the game.\n\nSo basically he was fine until Blizzard murdered HotS and shat on the corpse in an attempt to create an esports out of a for-fun game.",
                                    "score": 12,
                                    "author": "trapsinplace",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I bet they are begging the executives to remove it, but they are like lol no, this champ is a money printer",
                    "score": 39,
                    "author": "katsuatis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's the sad thing as well. The Rito execs must be cucking so many good decisions. What will sell is content that is actually good with heart and passion put into it. If they want to be remembered for churning out skins as long as possible until the cash cow keeled over, thats on them. I think League's longevity needs to come from a better place.",
                            "score": 23,
                            "author": "Fun-Consequence4950",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Execs are not always making bad decisions. Look at all the game studios like Bioware floundering in the last decade when companies like Microsoft and EA gave them an extremely loose leash.\n\nGood game design comes from a combination of smart executive pressure and strong designer vision. Without either you end up with an unfinished mess or design by committee.",
                                    "score": 10,
                                    "author": "HazelCheese",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I said it was the most incompetent, out of touch and infuriating rework of all time from day one.\nThe mains hated it, and players hated it.",
            "score": 44,
            "author": "Swawks",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hated it. It removed her ONE reason to hop off and become targetable. Literally all of her risk/reward was removed.",
                    "score": 6,
                    "author": "olican101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just delete it.",
            "score": 63,
            "author": "Riley_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "please just disable her in pro, how much more does this cancer have to grow",
            "score": 175,
            "author": "AzerFraze",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't wanna fucking deal with her either.",
                    "score": 61,
                    "author": "HolypenguinHere",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s time they paired amount of time Yuumi can attach and buff people to her w level. If you wanna stay attached forever, you need to max w first and sacrifice the damage and shielding abilities that you can share with you ally. \n\nHaving lower ranked w force her to detach after like 10-15 seconds (scaling up to permanent) would add a degree of skill expression to her that doesn’t take away from optimal gameplay, but gives enemies opportunity to attack her or the adc when she is forced to be detached and w is on cooldown. \n\nI will parrot this idea until someone from Riot sees it and comments",
            "score": 58,
            "author": "nitko87",
            "replies": [
                {
                    "level": 1,
                    "comment": "This only helps in lane. Team fights last like 4 seconds especially in the late game. \n\nYou need to be able to kill her or disable her even when she's attached to a champion.",
                    "score": 8,
                    "author": "BlaxicanX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The core issue with the champion is her laning phase being too safe, enabling late game carry champs with built in safety like Zeri, Ezreal, or Sivir to never have a weak point in the game to exploit for a lead. \n\nForcing the Yuumi to choose between early combat power or early safety means that you either opt into a laning phase with no priority, giving enemies the chance to dive, or you be a higher risk combat machine that can buff the adc, but only for a few ability rotations before you’re back off and vulnerable. \n\nLate game, Yuumi should be able to play on her highest carry potential champion without too much fear of being knocked off in my opinion.",
                            "score": 10,
                            "author": "nitko87"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A long time ago on this sub someone posted a concept for a champ very similar to Yuumi that tethers to a champion and orbits around them, but wasn't untargetable. They had a very low cd ability that would allow them to rotate around the champ they're tethered to so they could evade or block skillshots etc. I don't see why Yuumi can't be like that",
            "score": 90,
            "author": "--lately",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're sort of describing Io/Wisp from Dota 2, they tether to other heroes and share a percentage of healing/health regen to their tether, as well as being able to temporarily teleport the both of them somewhere and then back. Of course, Io is targetable at all stages of the game...",
                    "score": 46,
                    "author": "Obeast09",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Imagine if IO was in the game. Or we had a champ like lifestealer who can hide inside another champ without anyone noticing. Lol",
                            "score": 10,
                            "author": "canonlyplayyasuo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Once upon a time you could essentially do that with Twitch/Eve + Shen. Was called a submarine and was lots of fun.",
                                    "score": 4,
                                    "author": "beefstake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t I know it, I spent a good bit of decade and some in this game sadly. But lifestealer can do it for a long time.",
                                            "score": 3,
                                            "author": "canonlyplayyasuo"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because they want her to be a braindead champion with no skill required. Its sad but that's what we're dealing with. They do not want to stress the Yuumi player with such a burden as putting in effort.",
                    "score": 5,
                    "author": "HolypenguinHere"
                },
                {
                    "level": 1,
                    "comment": "Yea bro but IO is alrdy in DOTA",
                    "score": 4,
                    "author": "BlakenedHeart"
                },
                {
                    "level": 1,
                    "comment": "Abathur in HOTS did it well. He actually had a body he had to abandon somewhere in order to attach to other champions. This meant that if like an assassin found his body in a bush and killed him while he was stuck to the marksman, he blinked out. A similar concept could be done with Yuumi, though they could give it a fairly large range similar to TF's R so that she can cover a wider area, but can't just globally go wherever she pleases by bouncing between champions.",
                    "score": 51,
                    "author": "Oleandervine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People in League would absolutely combust into flames if Abathur's kit made into game. \n\nLeague doesn't have the same xp-shared soaking mechanics, so it wouldn't matter if Abathur got zero exp sitting in spawn so long as they continually hatted the Kha or Udy Jungle as it continually invaded or ganked for ensured kills.",
                            "score": 70,
                            "author": "KatyaBelli",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's why I did specifically mention giving it a range, rather than global. If Abathur had to continuously move his body to keep his hat where the action would be, that would mean he'd have to progressively keep scooting towards enemy territory, which would make him vulnerable. On top of that, it would prevent the hat from zipping from unit to unit if they were out of range, and possibly even require the hat to return to the body if the host was killed, effectively removing them from combat and turning what was a 3v2 to a 1v2.",
                                    "score": 10,
                                    "author": "Oleandervine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's Io, not Abathur. Abathur's whole schtick is omnipresence.",
                                            "score": 5,
                                            "author": "KatyaBelli"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Until you got to lategame and he just sat in fountain because he didn't need to be out on the map anymore.",
                            "score": 18,
                            "author": "esports_consultant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even early game in pro he just sat under fort inaccessible to basically all champs in that game. I feel like people who suggest this Abathur shit have never actually played HotS outside of QM nor watched any games of HGC where he shitted up pro play for far too long.",
                                    "score": 33,
                                    "author": "Thundermelons",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aba and Medivh banned every game, those were the days &lt;3\n\nLol actually imagine if there was a champ like Medivh how people here would handle it.",
                                            "score": 8,
                                            "author": "esports_consultant",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Imagine if pre q nerf garrosh made it into this game people would actually fucking lose it that might be the most broken shit ever.",
                                                    "score": 11,
                                                    "author": "snipamasta40",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "1v5 infinite heal Thrall is up there.",
                                                            "score": 7,
                                                            "author": "TheAlmightyV0x",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "the preferred nomenclature for that is green Jesus",
                                                                    "score": 11,
                                                                    "author": "esports_consultant",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It was just lore-accurate Thrall, guys",
                                                                            "score": 6,
                                                                            "author": "Thundermelons"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Or Bye Bye Chromie lol",
                                                            "score": 3,
                                                            "author": "esports_consultant"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m honesty not mad if they just remove her from pro play. MSI was dank.",
            "score": 25,
            "author": "azaza34"
        },
        {
            "level": 0,
            "comment": "Hear me out. For 12 years I was one of the most honorable players. Always honor level 5, even got the Santa Baron and some others icons for being top 20% honorable before honor system was introduced. And I was always a bit chippy and toxic, yet I've never gotten a single ban/chat restriction, not once in 12 years. Come year 13, I've been repeatedly chat restricted, last thing typed were lyrics to a gay version of Slipknot's Psychosocial song, and for a whole month this time. I realize that previous years I was toxic only towards other people, Summoners if you will. But starting this year I went after the game itself and the way Riot is managing it. It's simple to blame your teammate for going 0/5, but /allchatting that his lane opponent is unhealthy for the game is the most I've chatted about. Riot is forcing different champions every patch, making them S tier, and one ban is simply not enough for the majority of matches. Their ranked system is flawed, it's always a coin flip for me as a support - I either get carried or they carry me, and it's always someone abusing the meta, or a higher ranked player smurfing the game. Stating the obvious here, but why come down on a simple player expressing this in a chatbox \\*\\*in your game\\*\\*? Why is it that this bothers them so much?  \n\n\nRiot wants to shut you up.",
            "score": 5,
            "author": "HomoSapiens_v2"
        },
        {
            "level": 0,
            "comment": "She used to have a pretty silly heal on her E which is now a shield and her perpetual shield passive is now a heal. The issue with Yuumi is that when paired with a really good ADC, there is no counterplay to her but when paired with a low-elo ADC, it’s a free double kill every time the ADC gets grabbed.",
            "score": 4,
            "author": "AhriMainsLOL"
        },
        {
            "level": 0,
            "comment": "Is it wrong to just have her disabled in pro play? MSI was just so much better because of it.",
            "score": 22,
            "author": "sheriffceph",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would be Riot admitting they did something wrong",
                    "score": 24,
                    "author": "zenekk1010"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't understand why this champ exists. Not even talking about pro, there isn't a single champ in the game I hate seeing more than Yuumi, regardless of which team she's on or how strong she is. The fact that someone can possibly win a game with such little effort instantly tilts me whenever she's picked. I know I've got the Garen flair and \"hurr durr spin2win faceroll champ\" or whatever, but what I enjoy about playing Garen is finding different ways to use his extremely basic kit to overcome all the crazy shit in this game, and at the very least you have to pay some form of attention to where your character is on the screen.\n\nI don't know why Riot wants to make Yuumi a \"new player champ\" either - does anyone really think that playing Yuumi is going to be a proper introduction to playing LoL, and if they do can I have some of what they're smoking? Yuumi straight up removes the need to pay attention to your own positioning, which is an important part of playing literally every champion besides Yuumi. And after playing with some \"Yuumi mains\" when they're on another champ, you can tell they never learned to play League as a real champion because they do not look at their own positioning at all. When you play Yuumi you're playing like half of the game, and I don't understand why a champ that does that is being branded as something meant for new players. If you tell a new player to start as a support they already do not learn to last hit, and with Yuumi Riot is saying they shouldn't learn to move either.\n\nPersonally, whenever I've introduced a new player to this game I always tell them to start as an ADC because it allows them to learn the fundamentals of positioning and last hitting without having to think about more abstract concepts like jungle pathing or roaming. You also rely on your team a lot more as an ADC than other roles and usually don't have to take the initiative, which takes a lot of difficult decision making off the shoulders of someone just trying to learn the basics. I would never tell a new player to start with Yuumi, not only because I despise the champion's very existence, but also because it does not actually teach them anything about the game. I know there will be people who disagree with this and have their own preferred method of introducing people to the game, but I hope we can all agree that playing a champion that simply ignores core game mechanics like Yuumi is a terrible way to do it.\n\nTL;DR Yuumi is an abomination and completely fails Riot's stated intentions of being a \"new player champion\" because she prevents new players from learning anything besides pressing their abilities.",
            "score": 20,
            "author": "Dainurian"
        },
        {
            "level": 0,
            "comment": "They’re removing pro play rather than yuumi from the looks of things",
            "score": 21,
            "author": "FourteenFCali_"
        },
        {
            "level": 0,
            "comment": "Just make the shitty cat drop if the player she is attached on gets hard hard cc, for example stun/supression. Also if this happens, her W goes on cooldown.",
            "score": 99,
            "author": "LKZToroH",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or at least make it so she's affected by cc. Her host is stunned or silenced? She can't cast spells. Her host is rooted she can't W. Her host is zhonya'd she can't do anything, etc.",
                    "score": 180,
                    "author": "varntvaar"
                },
                {
                    "level": 1,
                    "comment": "&gt; Just make the shitty cat drop if the player she is attached on gets hard hard cc, for example stun/supression.\n\n*Ministuns the person Yuumi is attached to*\n\nFree 300 gold!",
                    "score": 38,
                    "author": "raikaria2"
                },
                {
                    "level": 1,
                    "comment": "I cant believe people keep saying dumb shit like this as if it hadnt already been pointed out why this does the opposite of what you want. Do you know what happens if you do this? Pro Yuumis simply detach at the last moment, and reattach immediately. New Yuumis dont. Guess what that does to her skill floor.",
                    "score": 67,
                    "author": "UNOvven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh no it might raise her skill floor. being harder to play than afking is a desirable outcome imo",
                            "score": 20,
                            "author": "AluminiumSandworm",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Then give a cooldown to individual champs, if you left the adc, you have to wait x seconds before jumping on him again, also make so you can't attach to cc'd allies.  \nYou all in this discussion acting like I care for what happens to yuumi, for me she could be deleted for ever and I wouldn't give a shit",
                            "score": 31,
                            "author": "LKZToroH"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Just make the shitty cat drop if the player she is attached on gets hard hard cc, for example stun/supression\n\nYou do realize that that is such an extreme nerf that to compensate they would have to give her rather large buffs elsewhere to not instantly put her in old evelynn tier? Buffs that would probably make her far more worse to deal with for anyone without consistent hard cc?",
                    "score": 30,
                    "author": "SuperKalkorat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to mention it skews her further towards proplay which has been the biggest balance problem. Like who do people think is going to be best at using her W around hard cc? A pro player or your average gold soloq player?",
                            "score": 42,
                            "author": "EgonThyPickle"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;You do realize that that is such an extreme nerf that to compensate they would have to give her rather large buffs elsewhere to not instantly put her in old evelynn tier?\n\nTo be completely honest, if their point is to make a champion that you can literally play other games while piloting her, it would ONLY make sense if she was old evelyn tier.",
                            "score": 32,
                            "author": "Black_Truth",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "New rework on Yuumi, she has been deleted now",
            "score": 3,
            "author": "ROI_MILLENAIRE"
        },
        {
            "level": 0,
            "comment": "Whenever they remove the untargetability",
            "score": 34,
            "author": "SevenShortHours",
            "replies": []
        },
        {
            "level": 0,
            "comment": "delete yuumi",
            "score": 15,
            "author": "DSThresh"
        },
        {
            "level": 0,
            "comment": "-Make her unable to press E while host is stunned.\n-Give her E two charges. Half the shield value. 1 second cooldown in between casts, per target. \n\nEncourages changing target to shield, meaning you can catch her mid jump. Decreases ability to block burst.",
            "score": 17,
            "author": "MarkDirtt",
            "replies": [
                {
                    "level": 1,
                    "comment": "But Yuumi is a champ that is designed to be for new players and new players can´t do those things. You just need to nerf yuumi so hard that she is REALLY ONLY for new players and thats it.",
                    "score": 3,
                    "author": "TheAllMakerReal",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude, I’ve been saying this ENTIRE time, this rework had no intention of doing that, it just made her what everyone THOUGHT she was. Old Yummi, yeah W was her main thing, but she HAD to stop using it if she wanted to be good. Let’s break it down.\n\nWith Old Passive, You HAVE to auto attack(implying recasting w) to get a shield for your Ally AND regain mana. The counter play, is that if you can catch her out while she’s reaching for that auto, you can cc her, stopping her from using her W for 5 secs.\nWith New Passive you just stay on ONE person, their your best friend. You do anything else unless they’re dead, you’re throwing.\n\nOld Q and New Q is like whatever, they don’t change her gameplay that much, they just made it more like Vex Q, but you can direct the direction after it’s cast, which makes it A LOT harder to doge, but then being on your BEST FRIEND, makes it so MORE damage and SLOW.\n\nOld W Gave adaptive force, so like she’s still technically doing consistent damage, so that’s fine. New W, is JUST for her passive, which BEST FRIEND BONUS just makes her heal harder on that ONE PERSON.\n\nOld E, a pretty sizable E, that took a PERCENTAGE of your Mana, which, guess what? incentivized you to use your old passive, so once again, you were FORCED to HOP OFF to get benefitted. New E? Just turns it into a shield, which is worse than a heal, but it doesn’t matter because new W just HEALS PASSIVELY, and even if it did, the new E also REFUNDS MANA REGENERATION on your W’ed ally GIVES ATTACK SPEED, like WHY.\n\nOld R, an ability you have to aim, hit a target 3 times to root them, and if you miss, or they get outa your R before the 3rd hit, oh well, guess you fudged it, so if it’s strong when you hit it, it’s fair right? NOPE because New R does that AND EVEN MORE, EASIER, it may be smaller sure,  it you can change its direction while it’s going, every hit slows, so agreeably better than just 3rd hit root AND IT HEALS. And guess what? 130% effectiveness when on her best friend.\n\nLet’s talk about gameplay styles now, yeah? \n\nOld Yuumi, was an agile Cat, who when need be, would get off her ally to proc her passive, or even to just jumped to another ally, at BOTH points she is vulnerable to damage and stuff, because she has an active hurt box when switching allies, so one accidentally bad switch during an AOE cc, dead. She had to choose the best time to switch allies, save her heal for the just enough speed boost to catch an enemy or the barely enough healing to save someone, aim her q, proc her passive for mana, because she had actual mana problems, and try to hit EVERYONE(which was most of the time 3 people in a team fight anyway because they were spread out) with her R, 3 TIMES, which was surprisingly hard because in this new Meta there are like, 100 blinks and dashes, even Melees could tank like 2 hits and walk behind her or her attached ally, and it’d be ineffective STILL. The skill gap between a good and bad Yuumi was HUGE because if people just Stayed on an ally the whole game, you lost SO MUCH VALUE of the character, because she was designed to be, for lack of better words, an Active Background Character, like my boy Kirishima from BNHA. Speaking of just staying on an ally for the whole game… \n\nNew Yuumi gameplay, just be on your best friend and profit, no switching, because you lose value, no getting off because you lose value, just press all your abilities because the shied is alaways beneficial because Attack Speed is always beneficial, and if not the Mana Regen definitely is, and just press R the moment a team fight starts, you can change it’s direction anyway and you passively heal now so it’s like I guess you don’t need to worry about your bestie’s survival. Now she really CAN win by just staying on one person.\n\nThe Yuumi rework wasn’t about making her better, it was about making her what everyone else from the OUTSIDE in, THOUGHT she was.\n\nTL;DR Yuumi used to have an actual Skill Floor and Ceiling, because she was forced to do things besides sit on one person, now sitting on one person is the ONLY thing she needs to do.",
            "score": 13,
            "author": "Far0Lands"
        },
        {
            "level": 0,
            "comment": "Lol yuumi players shouldn’t even be considered that they play league.",
            "score": 24,
            "author": "BellyDancerUrgot",
            "replies": [
                {
                    "level": 1,
                    "comment": "It sounds like a joke but you can actually play yumi decently with your feet. I should know, we tried it.",
                    "score": 4,
                    "author": "RockRoboter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honest question: Does anyone think Yuumi is a good champion for new players if you do not even learn to move your character while playing?  \nWouldn't a rather weak Enchanter with big dashes and big AoE speels be better for learning the League Basics?",
            "score": 20,
            "author": "Der_Finger",
            "replies": [
                {
                    "level": 1,
                    "comment": "She is not good for learning the game. She is good for being able to play the game without needing to learn the game. Which is a fucking terrible design paradigm in a game like this unless she is only available in Bronze and normal mode.",
                    "score": 23,
                    "author": "HolypenguinHere"
                },
                {
                    "level": 1,
                    "comment": "She's less of a \"learning\" champ and more of an accessibility champ. I can bring in my girlfriend with 0 knowledge of the game, or any paticular interest in the game, and she can pilot yuumi in games above her ability. This also removes the need for me spend months of games playing with her where she is bad until we can play at similar levels.",
                    "score": 39,
                    "author": "kids_sketchy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What you said highlights why she should be barred from ranked and pro play.\n\nAnticompetitive champion design.",
                            "score": 27,
                            "author": "WoonStruck"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Doesn’t matter how new player champ she is, as long as she in an enchanter that acts as an untargetable steroid for a champion, she will be too strong. I’m telling you, there needs to be a mechanic that incentivizes her to get mana back with auto attack.",
            "score": 8,
            "author": "Turbulent_Diver8330",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i still cant believe there are yumi mains out there, even in normals ppl willingly pick her and have thousands mastery pts, thats disturbing to me, humanity is indeed doomed",
            "score": 37,
            "author": "Linajke",
            "replies": [
                {
                    "level": 1,
                    "comment": "That but with Shaco.",
                    "score": 7,
                    "author": "BlakenedHeart"
                },
                {
                    "level": 1,
                    "comment": "It's just a video game, man.",
                    "score": 32,
                    "author": "EgoSumV",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yuumi is affecting climate change and also atomic entropy",
                            "score": 57,
                            "author": "HolypenguinHere"
                        }
                    ]
                }
            ]
        }
    ]
}