{
    "id": "144zkkk",
    "score": 134,
    "title": "LPL PSA: A \"Prove-It\" Weekend",
    "author": "LPL-Official",
    "date": 1686299730.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/144zkkk",
    "media_urls": [],
    "other_urls": [],
    "postText": "After nearly a couple weeks of LPL action, things are still somewhat up in the air. This weekend is going to be that first tack on the board on the long road to playoffs - solidifying what teams will certainly be our favorites and who might have to fight hard in the future!\n\n**RNG vs OMG, 9:00AM CET Saturday**\n\nLet’s be honest - most of us wrote off RNG after their offseason debacles left them with a shell of a roster compared to the giant they once were. On the flipside, many of us wanted to see a fan-favorite OMG roster succeed like they did in Spring.\n\nWell, RNG currently sits at 2-1, and OMG at 1-2 after two tragic series against our MSI attendees. This is a chance for OMG to prove that this record is a result of schedule luck, and that they still are going to be a dominant team in Summer. On the other hand - it is an even better chance for RNG to break their current perception, and prove that they are an org that will never leave the LPL spotlight.\n\n**EDG vs JDG, 1:00PM CET Saturday**\n\nEDG, like OMG, have faced a very strong early strength of schedule facing BLG and TES, and as a result are sputtering into the split with a 1-2 record. Now they are hitting yet another high hurdle, the current best team in the world JD Gaming. \n\nWith recent events, it will be very interesting to see who gets the call for EDG in the botlane, and if they can punch themselves through into a decent split start - or risk falling into a deep early deficit.\n\n**TES vs WBG, 1:00PM CET Sunday**\n\nWeibo Gaming could be legit. They’ve smashed the top two teams on many of our analyst’s power rankings, JDG and LNG, both in 2-0 fashion. Their loss to OMG meanwhile, was hard-fought - and their opponent was nothing to scoff at.\n\nAs well Top Esports may very well be back - they themselves whipped EDG into shape and took LNG to the wire.  Two teams with massive fanbases, there is both pride and record on the line in one of the most exciting matches of the opening weeks!\n\nDon’t miss any of the action! Tune in on Twitch or YouTube, and watch some of the best of the world duke it out live!",
    "comments": [
        {
            "level": 0,
            "comment": "Is uzi playing this week?",
            "score": 18,
            "author": "magus1324",
            "replies": [
                {
                    "level": 1,
                    "comment": "dont think so, i believe EDG have promoted TheSnake",
                    "score": 23,
                    "author": "other_batman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doinb said on stream that people should really look forward and see the match between EDG and JDG. Also EDG should announce Uzi today",
                            "score": 22,
                            "author": "non-edgy_crustacean",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "hopefully they do, but just as a precaution their website indicates theyve promoted TheSnake",
                                    "score": 12,
                                    "author": "other_batman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Website had uzi first lol, wouldn’t be surprised if they made exception for him",
                                            "score": 1,
                                            "author": "Hide_on_bush"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LPL is doing a phenomenal job at building hype, and these posts are a huge part of it. Thanks for making these!",
            "score": 31,
            "author": "Agami_Advait"
        },
        {
            "level": 0,
            "comment": "People worry about uzi current form when hard inters like theshy is still in the league",
            "score": 1,
            "author": "Hide_on_bush"
        },
        {
            "level": 0,
            "comment": "&gt; Weibo Gaming could be legit.\n\nnot surprising in the slightest, they are BORN TO WIN",
            "score": 1,
            "author": "Tfc-Myq"
        },
        {
            "level": 0,
            "comment": "https://www.youtube.com/watch?v=XRvpGGc9Jv8",
            "score": 1,
            "author": "kloricker"
        }
    ]
}