{
    "id": "1457k86",
    "score": 38,
    "title": "As a Teemo main, I'm excited for the ASU, but I still feel like he needs his kit adjusted; not just his design.",
    "author": "R-BINS-N",
    "date": 1686322831.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/1457k86",
    "media_urls": [],
    "other_urls": [],
    "postText": "Take everything I say here with a grain of salt: I'm only ranked silver, and I play the game semi-regularly at best. Honestly, maybe I'm asking for advice on how to play him better more than anything, but either way, I have some thoughts on Teemo.\n\nI'm really looking forward to the Teemo ASU, but I'm a little disappointed he isn't getting a broader rework. I'm not sure he needs it: Due to my inexperience I don't really have the right to make that claim. However, I'd still like to open the conversation up. Hopefully I'm not repeating anything that's been said a million times. \n\nFirstly, his *W* feels quite weak to me. Maybe in the earlier days in the game, that passive/active move-speed would've been huge, but now everyone has some sort of movement ability, and more importantly, Teemo's *W* only grants move-speed, while Miss Fortune's *W* for example provides an attack-speed buff as well. I usually use Teemo's *W* to engage on an enemy if a shroom is popped, or when I'm trying to escape. Maybe there are more uses for it that I'm not seeing, so if so, let me know!\n\nSecondly, his passive and ultimate are both directly countered by a free item: Sweeper. Or, if you're rich, a control ward for 75G. The problem is, I don't know how you'd make shrooms or his stealth balanced if Riot were to change them so they simply can't be seen by those trinkets: They'd be too strong. I know my shroom placement is fine for a fact, and I can play around auto-attacking enemies looking to damage a visible shroom, but that's about it. I know I don't utilize his passive enough, but that's less of a kit issue and more of a player issue. It feels like these parts of Teemo's kit feel so close to being good: The numbers are ok, and they feel good to use and work with generally, but these abilities get countered so hard that they aren't really fun to use. Also, changing his passive and especially his ultimate entirely doesn't feel like the right choice. Yes, believe it or not, even players in silver know how to buy a sweeper or control ward. Maybe I could be using them better, so again, if you have a suggestion, suggest away!\n\nLastly, his *E* just doesn't have a lot going on. It's a core part of his kit, and it's the first ability you max out, but it just feels like another passive rather than it's own unique ability. Like everything else, the numbers seem fine, but I just wish it was just his passive so he could have an actual ability to cast in that *E* slot.\n\nTo conclude, I don't think Teemo needs a full rework: The ASU is fine, and I'm satisfied with any update my little war criminal gets. His kit just feels a little dated to me, and I wish there were a few changes to his kit to go along with his ASU. Maybe it's my inexperience shining through, but every time my ultimate ability is countered by a free item, I cry a little on the inside. \n\nIf you read all of this, thanks for that!",
    "comments": [
        {
            "level": 0,
            "comment": "Teemo was proposed for a rework a long time ago, included by not limited to moving while stealthed, his W being a dash/roll and a lot of rebalancing to his kit overall (his E was shifted to his passive and his passive was an active ability on his e as well).\n\nBut a lot of Teemo lovers didn't like it and it was scrapped (Tho still used for Wild Rift.)\n\nTeemo is a tough cookie because he's without a doubt a very \"outdated\" design, but also a design that works in an awkward kind of way which isn't *that* toxic for the games health.\n\nTeemo players like yourself, also really like Teemo as he is, and many would likely abandon him given a major rework. It puts Riot in a tough position of, should they leave him well enough alone, or try and update something that rightfully feels like it needs modernizing.",
            "score": 5,
            "author": "FruitfulRogue"
        },
        {
            "level": 0,
            "comment": "Have you played wild rift Teemo? That’s likely what they’ll do with this ASU. TLDR stealth is active on E, W is a roll + MS, poison is on passive.",
            "score": 34,
            "author": "Stubrochill17",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought the ASUs were strictly for updating champion visuals, not actual kit changes. I have played the Wild Rift version of Teemo, and it's a lot more fun for me to play overall. Unfortunately though, it's just the mobile game: I'd rather play on PC. In addition, Wild Rift is similar to LoL in many ways, but I'd wonder how the differences between the two games would effect Teemo if the ASU ends up changing his kit to match Wild Rift.\n\nIf you're right about the ASU actually factoring those changes in, I'd genuinely be fully satisfied!",
                    "score": 19,
                    "author": "R-BINS-N",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "~~Well ASUs are things like Ahri update (MS on W, ult charges reset), Ezreal (entirely new W), Morg (MS on R Channel) - things like that.~~\n\n~~Sivir got a visual update recently and I guess they technically changed her E (spell shield), so idk if that counts as an ASU or not. Caitlyn got a visual only update recently iirc.~~\n\n~~VGU is something like Fiddlesticks/Sion/Volibear/etc.~~\n\n~~So I think it’s pretty reasonable to expect them to just make PC Teemo the same as WR Teemo. Only reason it’ll take a long time is he has soooo many skins, several legendaries as well.~~\n\nIgnore me",
                            "score": -9,
                            "author": "Stubrochill17",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Those are mid-scopes, ASU is strictly visual like what Caitlyn got last year.  Ahri got a mid scope that updated abilities then a few months later got her ASU, same thing happened with Jax, which can make differentiating between mid scopes and ASUs confusing.  Sivir didn’t get a visual update, just a new splash art",
                                    "score": 12,
                                    "author": "TGrumms",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah yeah that’s right. Well weird they wouldn’t give Teeto a midscope when it already exists in WR. That would do just fine in league. Maybe the Teemo mains don’t want it, idk I won’t pretend to know lol.",
                                            "score": 1,
                                            "author": "Stubrochill17",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A fairly similar rework to wild rift on the PBE got iceboxed ages ago when a bunch of Teemo mains complained about it.\n\nWe're unlikely to see any significant changes if that sentiment is still there.",
                                                    "score": 8,
                                                    "author": "Sakori_Dusk"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yea - the WR was a PBE a while back but Teemo players didn't like it so they reverted it",
                                                    "score": 2,
                                                    "author": "Koma60"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I like it but I never play Teemo so 🤷‍♂️",
                                                    "score": 0,
                                                    "author": "TGrumms"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think his passive and ult being \"countered\" by a item with over 100s CD and only for 6 seconds is a bad thing. First his passive is invisibility so nothing besides true vision will show him, yes Sweeper shows his outline but you still can't target him just with this. Second, his shrooms lasts for 5 minutes and you get a new one every 30s at least and is reduced by AH and Teemo most popular items give him enough to have a new one every 15s, by the time someone can use it one time, Teemo already had enough to place 6 new shrooms and unless you placed all of them in the same place and there's a full team together they wont be able to clear all of them.",
            "score": 3,
            "author": "Haoszen"
        },
        {
            "level": 0,
            "comment": "His new W should be a small dash that lets him bounce off shrooms. It can't go through walls naturally unless he gets a bounce off a shroom. Shroom bounces can be chained like they already can when throwing your R out. Distance scales as ult scales.\n\nThe animation can be him bringing his knees to his chest while bouncing off shrooms with his ass.",
            "score": 12,
            "author": "CasualRascal"
        },
        {
            "level": 0,
            "comment": "Despite teemo’s vulnerability, he is kept balanced by his disgusting e damage in lane and the insane late game power of his shrooms for map control. To me, teemo’s unique niche is the latter. I wish they’d play into his scout theme by gutting his damage in exchange for mobility and shroom utility",
            "score": 4,
            "author": "ElevatedDunker"
        },
        {
            "level": 0,
            "comment": "I've been trying to play teemo more recently and while I enjoy playing him, I do struggle to make him work. I think Kennen is just a much better execution of a similar play pattern, at least in lane phase.\n\nCan't help but notice Kennen's abilities feel much stronger. The problem is that Teemo has reliability that Kennen doesn't. If I miss my Q with Kennen during an all in, I'm potentially dead. You can't 'miss' anything with Teemo, and his E has a 100% uptime.\n\nSo they'd probably need to make his E a steroid instead? But then that kinda kills on-hit teemo. And so there's the problem, there's a bunch of different teemo builds, on hit, grasp-mo, shroom-mo, and changing him would for sure kill off some of those builds, which would drive people who enjoy him off the champion who is, by all numbers, fairly functional if very slightly weak.\n\nI wouldn't mind a small roll on his W but if they have to then nerf his MS to balance it, it might be weaker. There's more than a few matchups where at levels 7-8 you put extra points in W and you get a lot of power for doing so. *always* being faster than your opponent is great if they really can't catch you, but that's not always.",
            "score": 2,
            "author": "Shacointhejungle"
        },
        {
            "level": 0,
            "comment": "Teemos W is his strongest ability probably lol",
            "score": 1,
            "author": "Vegetable-Painting-7"
        }
    ]
}