{
    "id": "146hwu8",
    "score": 0,
    "title": "10 games 100 bans 78 jungle bans",
    "author": "HomerFlanderz",
    "date": 1686449772.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/146hwu8",
    "media_urls": [],
    "other_urls": [],
    "postText": "My last 10 games in Diamond have featured junglers being banned 78 out of 100 bans.  Jungle is OP in high elo.  Jungle needs nerfed so other roles can have more impact.  Ask any top laner, which is more important outplaying your enemy laner or getting the jungler.  100/100 top laners will tell you getting the jungler is better.  This level of banning means that tons of non junglers are banning junglers because there's just so many that are OP and in need of nerfs.  All of this and Khazix is the only jungle nerf next patch you just can't make this up lol\n\nMid lane has devolved into support whatever your jungler is doing or lose and it sucks.\n\nIf your against a mid jungle smurf duo you might as well FF.\n\nJungle and support just has way too much impact and agency in any elo above gold.  I'm not an expert on how exactly to fix jungle but I do know it's OP and in need of nerfs but instead the devs are wasting time on a Teemo ASU.",
    "comments": [
        {
            "level": 0,
            "comment": "As a toplaner I always ban a jungler when I know I have counterpick. I dont need my ban so I help the team.",
            "score": 11,
            "author": "TheXavierIngram",
            "replies": [
                {
                    "level": 1,
                    "comment": "Off-topic, but I dont really like the new pick order swap. Before it was 50/50 if I got to counter pick or not, but now I get counter picked like 75% of the time. If I am blue team, I get counter picked every single time.\n\nIf I am red team, its a 50/50 if the last pick will actually swap with me. If its a mid with last pick, he will just almost always refuse to swap, and if its anyone else its basically a toss up.\n\nDoes most top laners just threaten to run it down if they dont get last pick, or how do red team tops make sure to always get last pick? Its basically a 50% chance for me with everything added up",
                    "score": 2,
                    "author": "KingBob3922"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as a midlaner i always ban junglers and botlaners.\n\nbut even if you ban 10 broken junglers its not enough, it is what it is.",
            "score": 5,
            "author": "Ok_Regular_9436"
        },
        {
            "level": 0,
            "comment": "yea because the designer working on teemo's ASU is the one doing balance patches\n\n&amp;#x200B;\n\nnah, are you guys for real?",
            "score": 3,
            "author": "Boudynasr",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;True but maybe instead of spending money on Teemo ASU people we let them go and add more nerf the jungle people.",
                    "score": -4,
                    "author": "HomerFlanderz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They revert mid lane gold nerf so that's something",
            "score": 2,
            "author": "katsuatis",
            "replies": [
                {
                    "level": 1,
                    "comment": "100 bonus gold at 10 minutes if u cs perfectly doesnt do shit",
                    "score": 1,
                    "author": "Important-Town-9283"
                },
                {
                    "level": 1,
                    "comment": "True now they just need to go and take 10 gold from every jungle camp.",
                    "score": -5,
                    "author": "HomerFlanderz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So we're back to perma ganking meta?",
                            "score": 6,
                            "author": "katsuatis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's better than the trash jungle meta we have now.",
                                    "score": -4,
                                    "author": "HomerFlanderz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "what are you on about, gank meta is one of the worst metas. Laners hate it and half the junglers dont like it. Its so lame.",
                                            "score": 7,
                                            "author": "Neptyunu"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You've just made jungle stronger and worse to play. GJ",
                            "score": 1,
                            "author": "Elrann"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jungle is the most op role when played right and at the same time the shittiest they made.\n\nAnyone can full clear but god forbid there is any form of micro expression rather than macro.\n\n\nYou could do 2 camps at once if you were good enough? Removed cause people who dont play jungle cant do that and its unfair to them\n\n\nYou could have healthy and faster clears as machete user if you knew how to kite? Removed cause it takes too much to learn the pathings for non experienced junglers and its toxic.\n\nYou can be up 50-60cs and 3/4 kills that you'd only be 1 or max 2 levels ahead on the enemy jungler.\n\nThe only reason jungle is \"op\" is because now anyone can play the flavour of the month champ and do as good as anyone else cause jungle skill expression is not a thing anymore, the only form of skill there is right now is macro, every mechanic that good junglers could pull have been taken out of the game in favor of \"expanding jungle's player pool\" while it still is n°1 autofill role along toplane",
            "score": 1,
            "author": "TheWarmog"
        },
        {
            "level": 0,
            "comment": "it feels so shitty it's like you can ban 10 junglers and still get cancer anyways",
            "score": 1,
            "author": "cdssoares"
        },
        {
            "level": 0,
            "comment": "well because jg is the most overpowered role, but people on this subreddit cope for some reason?",
            "score": 0,
            "author": "Ghost-Mechanic"
        },
        {
            "level": 0,
            "comment": "Ok you \"know\" it's op. I \"know\" it's not. Now what? Both of us can say whatever we want without any base and it's your opinion against mine. Give some basis with numbers and trends in worldwide games then we shall see.",
            "score": -8,
            "author": "DSHUDSHU",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes surely people are banning junglers because they think they're weak lol",
                    "score": 4,
                    "author": "HomerFlanderz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't care what people in ur small sample size of games are doing. I play jg and have Perma banned kayle for years. The champ must be op and not just annoying to me!",
                            "score": -8,
                            "author": "DSHUDSHU",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Perma banned kayle for years\n\nlol",
                                    "score": 4,
                                    "author": "okitek"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;I play jg\n\nThink you might be just slightly biased here bro?",
                                    "score": 3,
                                    "author": "HomerFlanderz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Of course. But I am not claiming a role is op or balanced. I am just saying how stupid a post without empirical data is.",
                                            "score": 0,
                                            "author": "DSHUDSHU"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "True but maybe instead of spending money on Teemo ASU people we let them go and add more nerf the jungle people.",
                    "score": 0,
                    "author": "HomerFlanderz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are people not banning yuumi and milio over there? In KR diamond, yuumi, milio, lucian, zeri, and sometimes some grab supports are all banned almost every game. It’s rare for them to get through and have someone not dodge.",
            "score": 1,
            "author": "Mountain-Crazy69"
        },
        {
            "level": 0,
            "comment": "I'm not sure why you are telling me this",
            "score": -5,
            "author": "TrulyPositivePotato"
        }
    ]
}