{
    "id": "146jo1k",
    "score": 0,
    "title": "Normals queue has been much more toxic than normal lately, considering uninstalling.",
    "author": "KiraDesu14",
    "date": 1686455339.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/146jo1k",
    "media_urls": [],
    "other_urls": [],
    "postText": " I pretty regularly play normals because ranked stresses me tf out, but lately idk what been going on but my games have really sucked. I was trying to learn a troll AD Morgana build for a bit (miss ad yuumi mid, used to have a decent winrate on it suprisingly before they reworked) and my games have gotten horrible even after stopping queuing for ad morgana mid. Is there a troll queue or something, because out of the last 10 games I've played, 8 time someone dc'ed within 8 mins of the match starting, most games FF15, and both teams were super toxic in all chat. Is this just me, or is this something people have also been noticing? ",
    "comments": [
        {
            "level": 0,
            "comment": "\"I'm trolling and people are being toxic to me\"\n\nAm I reading this right?",
            "score": 24,
            "author": "SevenShortHours",
            "replies": [
                {
                    "level": 1,
                    "comment": "he is playing a non meta build, in the NORMALS mode, aka non competative.  \nhe never said he is trolling, he even said he had surprisingly good win rates,  \n\n\nnormals are for fun.  \n\"troll builds\" are absolutely fine if you still play seriously.  \n\n\nIMO this should be okay even in ranked, but i know there are some silvers who value their lp more then their family and expect everyone except themselves to play like korean pros...",
                    "score": -6,
                    "author": "TeacanTzu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The point of playing any game is having fun, and the point I'm trying to make is that even in Normals, the place where nobody should be caring too much about whether or not they win, people are much less tolerant of less than optimal strategies compared to other games. Whenever I wide flank in valorant from the start of the match with a shorty, I don't get told to kms by both teams in all chat, yet I do even when playing meta stuff, like Azir. This toxicity has gotten even worse for me lately, and I've had to take a couple breaks for my mental health and while I love this game, if this keeps going I either quit or actually kms.",
                            "score": 2,
                            "author": "KiraDesu14"
                        },
                        {
                            "level": 2,
                            "comment": "You’re worse than derankers",
                            "score": -1,
                            "author": "V8_Only",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re addicted to a bad game that you only have incorrect thoughts about and you live a sad life ^^",
                                    "score": 2,
                                    "author": "Iplaylikefourchamps"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Playing off meta shit is fine within reason but AD Morg is like playing AP Garen or something, it doesn't really make that much sense, especially when Neeko is right there if you want to make a weird AP champion with an AD build\n\nBut normal games are a shitshow in low MMR, like 1 in 4 games I play is filled with people telling each other to die, and people leaving in two to three deaths, people doing 4k player damage in a 45 minute game, etc",
            "score": 2,
            "author": "Lyoss"
        },
        {
            "level": 0,
            "comment": "idk i just like to manipulate myself into thinking there's a losers queue where all the toxic people get put into",
            "score": 2,
            "author": "sillybitch333",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always joke that I'm the team therapist but I keep getting filled into jungle. I'm never toxic, and I only get a toxic teammate maybe once in 6 or 7 games.\n\nUsually the toxic guys are better than their rank and just are stuck lower than they should be because of mental weakness. Half the time I can pull them back from the cliff and we pull off a win. \n\nI definitely think there's a queue for people who get reported for toxicity+ a lot.",
                    "score": 1,
                    "author": "Ride901",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i see it in lower ranks a lot more as well because people don't care that much about being bronze",
                            "score": 1,
                            "author": "sillybitch333"
                        },
                        {
                            "level": 2,
                            "comment": "Wow, once in two is my rate",
                            "score": 1,
                            "author": "Jedstarrr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i think its pathetic how people in normals are so toxic towards people who don't play like its the world finals.  \n\n\nuncommon midlane pick... IN MY NORMAL GAME?! nah!, ban this guy!  \n\n\nand yet these losers are too afraid to queue ranked mode.  \n\n\nignore them, /mute all and think back to a better time before every scrub thought he was faker, only being held back by bad teammates.  \n\n\n  \nI've played VI adc, Ivern or yi mid, brand top etc in ranked for a while now. people have become so ridiculously toxic over the years. It happens way too often that I get blamed and reported for losses while im the only one doing well in the team.... but my pick is the problem...  \n\n\nPeople used to be so chill. AP Udyr bot? cool! full AP Sona mid? nice! adc janna top? interesting!  \n\n\nnow people cry if they haven't seen an asian pro team play your pick on the specific role with the exact item build.",
            "score": 0,
            "author": "TeacanTzu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Op.gg or shoosh",
                    "score": 0,
                    "author": "mustangpirate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean feel free to build troll shit in normals, but are you genuinely surprised that you're encountering toxicity while doing so? I understand being frustrated about the games where you're not playing AD Morgana, but it sounds like that's just a couple of unlucky games, the ones you are troll building you should probably expect some toxic teammates.",
            "score": 1,
            "author": "theyeshman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used to play a lot of AD Yuumi Mid, after a while of practicing I got a 54% winrate and people were nowhere Near as toxic as now. It's gotten so much worse, both sides spamming in all chat, death threats, etc. I really liked playing AD Yuumi Mid, and I'm just trying to find something that also makes league fun to play, but when every single game I'm bombarded by toxicity, makes it pretty hard to actually have Fun, which is the point of playing games in the first place.",
                    "score": 0,
                    "author": "KiraDesu14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Next time try ad Renata. She even has a gun",
            "score": 0,
            "author": "Car-and-not-pan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Her AA animation is so cute like pew pew lmao",
                    "score": 1,
                    "author": "spicykitten123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nerf gun literally",
                            "score": 2,
                            "author": "Car-and-not-pan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "try crit Mundo headbutts of hell",
                    "score": 1,
                    "author": "funslammer"
                }
            ]
        }
    ]
}