{
    "id": "146s562",
    "score": 233,
    "title": "T1 vs GEN | LCK Summer 2023 | Pentakill",
    "author": "harthn",
    "date": 1686484772.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/146s562",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "A Pentakill I wonder which champion got it?",
            "score": 269,
            "author": "Informal_Skin8500",
            "replies": [
                {
                    "level": 1,
                    "comment": "Z _ R _",
                    "score": 36,
                    "author": "Aschentei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nerf Zyra",
                            "score": 153,
                            "author": "icantbelievudonethis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Now I'm just imagining a 5 man zyra R followed by like 8 plants just melting everyone for a penta",
                                    "score": 6,
                                    "author": "afedje88"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Zoro is in Lol now!?",
                            "score": 7,
                            "author": "HowardDean_Scream"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Such a boring champion to watch because its been overplayed since release and everybody and their grandmom got penta with her",
            "score": 313,
            "author": "ItsKaZing",
            "replies": [
                {
                    "level": 1,
                    "comment": "i remember when pentas were a rare occurrence... now it seems every series a zeri gets a penta",
                    "score": 151,
                    "author": "Quirkybomb930",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "kaisa was dominating pentas, now zeri is even worse with it\n\nit's all about mobility for pro play",
                            "score": 90,
                            "author": "icatsouki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://lol.fandom.com/wiki/Pentakills/Statistics\n\nKai'Sa (150) - 2018\n\nJinx (106) - 2013\n\nZeri (71) - 2022\n\nEzreal (68) - 2010\n\nAphelios (62) - 2019\n\nLucian (61) - 2013\n\nlol. If Kai'sa got the same amount of pentas per year as Zeri she'd be at over 400",
                                    "score": 131,
                                    "author": "bondsmatthew",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No no! Get out of here with your facts let t1 fans cope",
                                            "score": -98,
                                            "author": "failworlds",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Think you're a bit confused haha",
                                                    "score": 65,
                                                    "author": "MrMadCow",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think he thinks that this is a list of most pentas in one year or something so he thinks Kai'Sa got 150 in 2018 lmao.",
                                                            "score": 9,
                                                            "author": "My-Life-For-Auir"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "can you read?",
                                                    "score": 37,
                                                    "author": "JezieNA"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can you read?",
                                                    "score": 12,
                                                    "author": "Ok_Apartment_8913"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can you read?",
                                                    "score": 9,
                                                    "author": "3IC3"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can you read?",
                                                    "score": 7,
                                                    "author": "jojo340"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "At least watching Kai'sa divebomb or outplay the enemy was always fun. Zeri just facetanks everything while 1v9ing",
                                    "score": 125,
                                    "author": "Ophelia_Of_The_Abyss",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "also kaisa didn't get to play with 10K  hp",
                                            "score": 83,
                                            "author": "icatsouki"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was not fun AT ALL seeing a kaisa jumping in 1x5, bursting the enemy adc, and just pressing zhonyas while her team arrives to cover her lol.",
                                            "score": 43,
                                            "author": "cadaada",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah but Kaisa was never permaban status. You couldn't 1v9 like you can on Zeri, you need a team to play around you.",
                                                    "score": 11,
                                                    "author": "CzarcasticX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I wonder if we all watch the same pro scene where zeri can 1v9. Even in this video, she needs a fuck ton of peel lol.",
                                                            "score": -9,
                                                            "author": "Le0here",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What do you mean, even through hook and charm she doesnt die. She facetanks after the blitz hook? No peel.",
                                                                    "score": 12,
                                                                    "author": "HatBlender",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Peel doesn't always have to be as straight forward as tanking for the carry, positioning correctly by the other members matters a lot to deter the opponents. Anyway I worded my original comment wrong, she needs a fuck ton of peel usually but it's true that this video can't be described as \"fuck ton\" but it cannot be in any sense be called a 1v9.",
                                                                            "score": -7,
                                                                            "author": "Le0here"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "she literially got hooked by blitz and face tanked 5 members and won, stop lying to urself",
                                                                    "score": 7,
                                                                    "author": "Quirkybomb930",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's a 1v9?",
                                                                            "score": -7,
                                                                            "author": "Le0here"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Idk the way people used to play around the old Kayle Kaisa combo in 2018 or 2019 world's was much more fun and exhilarating than seeing a Lulu or yuumi turn zeri into an unkillable tank with the mobility of a ghosting singed and the dmg of a kog.\n\nKaisa at least felt like you had actual counterplay and imo required more skill as her fighting was a lot riskier than whatever Zeri is with her million hp builds.",
                                                    "score": 16,
                                                    "author": "krackenker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol i forgot about that. Sadly no one ever tried doing it again in pro.",
                                                            "score": 2,
                                                            "author": "cadaada"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You mean counterplay to her shooting W two screens away and it taking 70% of your HP?",
                                                            "score": -7,
                                                            "author": "Yongaia",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That was ap mid Kaisa poke and was an entirely different thing",
                                                                    "score": 11,
                                                                    "author": "krackenker",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The champ has been cracked through many different iterations. Her being able to instantly delete a target with mixed damage while being able to build both zhonya and guardian angel wasn't any better.\n\nPeople's memories are so short it's crazy. You'd swear everyone was praising her back then with the way some of y'all talk.",
                                                                            "score": -1,
                                                                            "author": "Yongaia",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It was way less bad lol, of anything she was vastly overplayed because people didn't play her counters (kog/mages) and she existed because of engage supports being cracked and she can only function with them.",
                                                                                    "score": 2,
                                                                                    "author": "krackenker",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No, people just correctly remember Kai'sa being less disgusting than this eloboosting champ that Zeri is. Kai'sa actually requires some semblance of coordination, and was actually possible to kill, while also having next to no real escapes, just short range reposition tools. Zeri can easily 2v5 while being nearly immortal and having some of the best mobility in the entire game. \n\nTeams could claim credit for being good at playing Kai'sa, just because of the coordinated effort it took to make her truly broken. No player deserves praise for \"being good\" at Zeri.",
                                                                                    "score": 1,
                                                                                    "author": "Minutes-Storm"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "People forget so quick",
                                                    "score": 12,
                                                    "author": "thedudeode"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am very curious about the results of that match. Both are great and really not losers.I'm just waiting for the results of your last match. Maybe I'll just watch your game on YouTube, if someone has posted it.",
                            "score": 2,
                            "author": "320500"
                        },
                        {
                            "level": 2,
                            "comment": "The hype of pentas back in the day was unreal. Now it’s just like a penta a week with Zeri lol",
                            "score": 1,
                            "author": "TiddyTwizzla"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Grandmom said: 'Never back down from a fight.' Bless that woman!",
                    "score": 8,
                    "author": "Grandidealistic"
                },
                {
                    "level": 1,
                    "comment": "The fight between those two groups was great. Who will win forever? I didn't finish it because I lost my internet connection.",
                    "score": 2,
                    "author": "jhdbot"
                },
                {
                    "level": 1,
                    "comment": "Based flair",
                    "score": 2,
                    "author": "Verdant_Gymnosperm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dogshit champ",
            "score": 265,
            "author": "povertyregion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got cc’ed, got hooked, got charmed, doesn’t matter. It’s zeri gaming everyone",
                    "score": 140,
                    "author": "RobbinDeBank",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus Christ I thought you were joking. Thank god nobody in my elo even plays Zeri lmao",
                            "score": 9,
                            "author": "oberg14"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Goat pfp",
                    "score": 5,
                    "author": "Karlsefni1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Has any good team in LCK or LPL lost on Zeri in this split yet?",
            "score": 97,
            "author": "prongs17",
            "replies": [
                {
                    "level": 1,
                    "comment": "HLE is 0-2 this split with Viper on Zeri. LNG/GALA lost one today against FPX. That's pretty much it. Not a lot of opportunity for top ADCs to play Zeri lately.",
                    "score": 76,
                    "author": "KappaccinoNation",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And those 2 losses by HLE were single-handedly by Clod hard inting",
                            "score": 117,
                            "author": "Lonely__goose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Clod LMFAO",
                                    "score": 63,
                                    "author": "pizza_and_cats",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "brain clot",
                                            "score": 20,
                                            "author": "Freesin"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I too hate Clodsire",
                                    "score": 13,
                                    "author": "Fancydudehero24",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ATTENTION PLAYER! 市民请注意!\n\nThis is the Central Intelligence of the OverUsed Council of Smogon. 您的浏览记录和活动引起了我们的注意 YOUR ACTIVITY HAS ATTRACTED OUR ATTENTION. 同志們注意了 you have been found playing hyperoffense!!!!! 這是通知你，你必須認同我們將接管台灣 serious crime 以及世界其他地方 100 elo have been deducted from your account 這對我們未來的所有下屬來說都是重要的機會 stop the hyperoffense immediately 立即加入我們的宣傳活動，提前獲得救贖 do not do this again! 不要再这样做! if you do not hesitate, more elo ( -11115 elo)will be subtracted from your account, resulting into the bans of your favorite pokemon. (由人民供应部重新分配 smogon) you'll also be stalled by our landos at April 2 20STALL. 如果这还没有改变你，我们将把你驱逐到台湾省，你将被禁止进入中国!!!!\n\n为党争光! Glory to Finchinator!",
                                            "score": 9,
                                            "author": "2HoursofSleep_"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Literally get viper a better jg he deserves some success",
                                    "score": 1,
                                    "author": "Aschentei"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ah, I see that it is the T1 HLE games that gave T1 the false confidence to let her through in pick ban.",
                            "score": 18,
                            "author": "prongs17"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "HLE went 0-2 against T1 earlier but that's because clid inted so hard the whole series",
                    "score": 10,
                    "author": "SnooGuavas8376"
                },
                {
                    "level": 1,
                    "comment": "KT lost with Zeri vs Gen.G using Twitch ofc",
                    "score": 7,
                    "author": "SwayNoir"
                },
                {
                    "level": 1,
                    "comment": "zeri just lost 2-0 in TES vs WBG",
                    "score": 6,
                    "author": "Justatourist123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but Light didn't play well that series the man was eating every skill shot.",
                            "score": 4,
                            "author": "Informal_Skin8500"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Balanced",
            "score": 29,
            "author": "xDUmb1"
        },
        {
            "level": 0,
            "comment": "All the cc landed, doesn't matter it's zeri",
            "score": 23,
            "author": "ukrokit2",
            "replies": [
                {
                    "level": 1,
                    "comment": "She had more hp than a fed sion btw",
                    "score": 1,
                    "author": "HowardDean_Scream"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fine with glass canon zeri since if you catch her she dies probably, but this bruiser zeri shit is so brainless. Dodge nothing and facetank everything because you have 4k hp while still dealing a million damage. Fuck this bullshit champ.",
            "score": 20,
            "author": "Outrageous_Driver_14"
        },
        {
            "level": 0,
            "comment": "most normal zeri moment",
            "score": 51,
            "author": "ShiRonium"
        },
        {
            "level": 0,
            "comment": "HELL YEA ZERI. SO FUN WE ARE WATCHING HER DO PENTAS SINCE HER REALSE. THIS BALANCING TEAM SURELY ISN'T CLUELESS POG.\n\nBUT DON'T WORRY SHE GET NERFED NEXT PATCH AND PROBABLY BUFFED BEFORE WORLDS AGAIN SO WE CAN SEE HER AGAIN.\n\nAbsolute disgusting paycheck stealers at this fucking company. Adc going fucking bruiser build but azirs laning was a huge issue when he was never close to being as dominant as zeri.",
            "score": 140,
            "author": "Ashankura",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s ok Phreak is gonna show you some nitpicked stats to “prove” that it’s actually your fault that Zeri beat your ass",
                    "score": 65,
                    "author": "TwMDa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also yuumi has a rly high mastery curve we think she has a high skillcap here is a chart of somethihg with non labeled axes\n\n\\^________^",
                            "score": 23,
                            "author": "Makomako_mako"
                        },
                        {
                            "level": 2,
                            "comment": "Riot: So here's a graph.",
                            "score": 17,
                            "author": "ThisOneTimeAtLolCamp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Riot: Nevermind the fact that we never labeled the axes, just trust us",
                                    "score": 9,
                                    "author": "APKID716"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I totally forgot phreak moved to the balance team at the start of the year that's how forgettable that department is . It almost make dota balance seem like they are doing a better job .",
                            "score": 9,
                            "author": "zirenyth"
                        },
                        {
                            "level": 2,
                            "comment": "But but but my wholesome caster patch breakdown.\n\nthe game totally isn’t all about botlane right now guys!",
                            "score": 1,
                            "author": "kamparox"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Draven did over 6k that fight as well. At what point do we finally admit that putting a guy who ONLY sees the game through an ADC’s lens in charge of the balance team was a bad idea?",
            "score": 9,
            "author": "dofun400",
            "replies": [
                {
                    "level": 1,
                    "comment": "He isn't in charge of it but yeah",
                    "score": 1,
                    "author": "Tulkor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ZERI RIOT",
            "score": 25,
            "author": "EvilPotatoKing"
        },
        {
            "level": 0,
            "comment": "How OP is Zeri? I think this answers it \n(:",
            "score": 27,
            "author": "crisvphotography",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sidenote: I've never seen T1 have a 6K gold lead at 20+ minutes and be LOSING, only because Zeri has 4K hp/shield, bullshit range/movement speed, dash through the walls... They just can't kill her? You have a fed Draven?? Cool he is nothing compared to Zeri!! We all knew exactly how the game would go at the 20th minute mark.. Soo unfun to watch, just like every other Zeri game today -_-",
                    "score": 25,
                    "author": "crisvphotography",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They caught her, she just didn't die",
                            "score": 10,
                            "author": "MrZeddd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Zeri Gaming",
            "score": 9,
            "author": "WheyProteinIsolated"
        },
        {
            "level": 0,
            "comment": "Broken champ lol",
            "score": 22,
            "author": "Ninothewhite"
        },
        {
            "level": 0,
            "comment": "I miss the days of a penta post on Reddit being an actual mechanically exciting play. Now it’s just Zeri or Aphelios with an enchanter and they dash in and kill everyone while taking almost no damage because of shields and heals. It completely takes the thrill away from watching a penta",
            "score": 82,
            "author": "FergyBoy23",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude put Aphelios there like we wont notice",
                    "score": 51,
                    "author": "lcm7malaga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Remember release though. All his one man pentas where he just presses R vaguely towards a baron with infernum active. \n\nGood times.  I'd take that over bruiser zeri",
                            "score": 2,
                            "author": "HowardDean_Scream"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How many aphelios pentas we actually had this year?",
                    "score": 31,
                    "author": "cadaada",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "10 if you include tier2 leagues, just 2 if you only count tier1 leagues. When i say tier1 league i mean a league that has worlds/MSI seeds. Tier2 would be challengers, 2nd leagues or the regional leagues in EU.\n\nSource: https://lol.fandom.com/wiki/Pentakills/2023\n\nSo long story short, its only a few compared to Zeris 35. Aphelios' Penta number (pentas/year) is still inflated due to release Aphelios before Flamethrower R got nerfed. Which is why his pentas have a bad rep.",
                            "score": 6,
                            "author": "lolKhamul"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find Zeri fun to watch, but the champ existing makes so many other ADC's obsolete and it's sad that we don't see them. (Kog, Vayne, etc)\n\nMobility makes things strong, adding in tankiness (see Aatrox, Jax, etc) and you have issues. Add in ranged as well and you have Zeri being busted.",
            "score": 6,
            "author": "RDKi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dravens at least gotta work for that damage.",
                    "score": 3,
                    "author": "HowardDean_Scream"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Phreak balance team diff",
            "score": 57,
            "author": "Agreeable_League2969",
            "replies": [
                {
                    "level": 1,
                    "comment": "My man quit his job on the caster desk to go chill in the balance team (we all know they have no work to do there), so he can grind lost ark all day now. Dream job",
                    "score": 10,
                    "author": "RobbinDeBank"
                },
                {
                    "level": 1,
                    "comment": "But remember guys phreak was mid diamond in season 4 and 5 and therefore he is an EXPERT on the game rather than an overly-opinionated chinstrap-rocking turbo-chode being condescending in a nasally voice",
                    "score": 9,
                    "author": "Makomako_mako",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this balance team is killing the game , It's just sad idk what to say",
                            "score": -4,
                            "author": "Agreeable_League2969"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some champions should just get removed from pro play for being impossible to balance for pro play and normal league.",
            "score": 4,
            "author": "litnu12"
        },
        {
            "level": 0,
            "comment": "ZERI MOMENT",
            "score": 3,
            "author": "LZH14"
        },
        {
            "level": 0,
            "comment": "Balance team is a joke.",
            "score": 4,
            "author": "mcdonaldsfanatic"
        },
        {
            "level": 0,
            "comment": "Nerf Zeri",
            "score": 14,
            "author": "hazelnutcoffee16"
        },
        {
            "level": 0,
            "comment": "Pick zeri win the game 1v9. Fucking trash design by riot, thank god im not playing this game anymore when this shit exist.",
            "score": 19,
            "author": "Patriaslo92"
        },
        {
            "level": 0,
            "comment": "Better top wins",
            "score": 13,
            "author": "cromatkastar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah counterstrike was pretty good that game",
                    "score": 1,
                    "author": "Verdant_Gymnosperm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Saw Zeri get the first kill and closed the clip",
            "score": 2,
            "author": "PeaBrainBoy"
        },
        {
            "level": 0,
            "comment": "I always hated the zhonyas Jax build. And I still do in 99% of cases. But gotta hand it to Doran. He realized he was way behind and he used it to perfection throughout the game to maximize his impact by just delaying T1 and giving Zeri more time.",
            "score": 6,
            "author": "SuccessionFinaleSux",
            "replies": [
                {
                    "level": 1,
                    "comment": "With how much damage there is in the game, 2.5s of invulnerability beats the amount of time an actual tank item would give. On top of also giving offensive stats that Jax actually uses quite well",
                    "score": 1,
                    "author": "WaveCore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Buff her range, nerf her sticking potential.\n\nRemove power from her ult. She is utterly useless as an ADC when the ult is down, but completely broken when the ult is up.\n\nThe ult should just be reworked entirely and her E could give a small MS boost after dash.\n\nThey should also heavily consider removing the wall jump aspect from E or balancing it somehow. It makes her extremely difficult to gank.",
            "score": 5,
            "author": "calvinee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bro her effective range is already super high. Most people don't realize it, but being able to throw your auto attacks out without having to click on anything is super broken. Makes it almost impossible to get in her range without being chunked to hell and also makes Zeri's kiting way too easy and strong. Pair that with her movement speed and mobility and you get the abomination that this Champion is.",
                    "score": 30,
                    "author": "nusskn4cker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "exactly, if anything i think her range should be nerfed given how extreme her mobility is",
                            "score": 8,
                            "author": "icatsouki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it’s better to all in on either her range or mobility. Give her longer range (like 25 range or sth), but absolutely gut all her mobility. Make her a long range but immobile adc like caitlyn. Or gut her range and make her the dashing adc like lucian or vayne. If they can’t do balance her like that, I’m fine with this pos being removed from the game (along with the cat)",
                                    "score": 2,
                                    "author": "RobbinDeBank"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My point on buffing her range is in conjunction with nerfing her mobility. It was just a small suggestion anyway.\n\nHer sticking potential is the real problem, and her current ult is the root cause of that.\n\nI think they should transfer power from her ult to the rest of the kit, because Zeri without ult is not overpowered.",
                            "score": 0,
                            "author": "calvinee"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "please for the love of fucking god don't increase here range even more lol",
                    "score": 1,
                    "author": "Baldude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gen G wins with Zeri: Disgusting\nT1 wins with Zeri: Amazing! Deserved! Better player!",
            "score": -30,
            "author": "LeBronze_James_23",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am a GenG fan and I didn't enjoy T1 Zeri win, nor GenG Zeri win.",
                    "score": 36,
                    "author": "Krakens0v",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i am a fan of both and i hated them both",
                            "score": 25,
                            "author": "Valuable-Village-458"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Go check game 1 thread . Don’t be salty for no reason",
                    "score": 7,
                    "author": "Theonewhoknows000"
                },
                {
                    "level": 1,
                    "comment": "Said no one ever except like a 1% troll minority lol stop baiting",
                    "score": 39,
                    "author": "Satan_su",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did u listen to the cast today? Lol",
                            "score": -18,
                            "author": "Ticket_Constant"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "no one said that lmao how are u this fkn stupid",
                    "score": 10,
                    "author": "Agreeable_League2969",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Youre just salty you lost. Again.",
                            "score": -4,
                            "author": "LeBronze_James_23"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Stop lying. The post-game thread for game 2 is still there.",
                    "score": 4,
                    "author": "dhxnlc"
                },
                {
                    "level": 1,
                    "comment": "Tis the LCK way",
                    "score": -3,
                    "author": "ShoulderSalty6531"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Zeri with this build is hella broken but this teamfight wasn't that much of a Zeri thing. Replace her with almost any one of the ADCs and GenG still win.\n\nI thought Riot had this build gone. How is it back now?",
            "score": 0,
            "author": "Jan7742"
        },
        {
            "level": 0,
            "comment": "LCK caster all over T1's dick. So happy that GEN won",
            "score": -35,
            "author": "IcyHot4You"
        },
        {
            "level": 0,
            "comment": "Fckk zeri",
            "score": 1,
            "author": "RekZz11"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Release date diff",
                    "score": 7,
                    "author": "LaCampanellaAgony"
                },
                {
                    "level": 1,
                    "comment": "Zeri gap , like everytime this champ make no sense to not delete it",
                    "score": 7,
                    "author": "Kaldrinx"
                }
            ]
        }
    ]
}