{
    "id": "146s3dl",
    "score": 2,
    "title": "So...why is bot on priority queue?",
    "author": "noodleben123",
    "date": 1686484597.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/146s3dl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! see the title. now that bot's got its new set of borked-ish items, youd think that botlane would be absolutely SWARMING with players. and yet...it isnt\n\n&amp;#x200B;\n\nbots marked as priority (like support) and queue times are near instant. why is this??",
    "comments": [
        {
            "level": 0,
            "comment": "Laning with another person sucks ass",
            "score": 153,
            "author": "Conscious-Scale-587",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unless duo, yep. And even then it can break friendships.",
                    "score": 28,
                    "author": "4skin_Gamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Why'd you ignite the karma! I was going for the jhin!\"\n\n\"Bro i hooked the karma, i'm gonna try to kill the karma\"\n\n\"And jhin just kills you in the meantime?\"\n\n\"No, i'll...\"\n\nBased on a real story",
                            "score": 29,
                            "author": "Conscious-Scale-587",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"I'm backing. Don't greed for plating, they'll come back and kill you.\"\n\n\"Nah, it'll be fine.\"\n\n*proceeds to die*\n\n\"What'd I tell you?\"\n\n\"MAYBE IF YOU STAYED IT WOULDN'T HAVE TAKEN SO LONG!\"\n\n\"You're fucking stupid.\" *Disconnects from discord*\n\nAlso based on a real story",
                                    "score": 26,
                                    "author": "4skin_Gamer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Getting 3-4 manned every 5 minutes also sucks ass.",
                    "score": 19,
                    "author": "ADistantFallenStar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's my kink, being dominated by 4 men. Wait that sounded wrong",
                            "score": 1,
                            "author": "Peroniko"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just had a morgana sup with 19 deaths 👍\n\nShe gave 8 passive procs to ennemy adc draven in 14minutes\n\nI hate playing adc solo in draft",
                    "score": 4,
                    "author": "BOSS_Master7000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because being forced to play with another player the whole game, who you do not even know, is how players get checked into a mental asylum. \n\nThere is no worse feeling than you pinging to go in because you know you win the 2v2 and your Nautilus support is sitting under tower saying \"lane is lost ADC is noob FF go next fast\" so you get zoned off every wave and end laning phase down 50cs. Then the whole team turns on the ADC because supports are never held responsible for bot lane's outcome. \n\nSame is true of supports. No worse feeling than trying to fight when your ADC isn't on the same page or they want to fight and you have to spam back ping because you know jungler is coming. Nothing worse than warding perfectly for an objective and then your team decides let's give up all control of the objective for no reason...\n\nBot lane is the duo-or-die role. Nobody wants to play with another random because there's no guarantee they will be on the same page as you.",
            "score": 85,
            "author": "Hyragon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah it's not the same for support, support is competing with jungle for the most impactful role in the game with the most agency to win the early game for your team. Your adc sucks? Who gives a shit, just roam. People are just stuck in the Season 3 mentality of \"support places wards\" and don't realize how fucking OP that role is.",
                    "score": 35,
                    "author": "LegolasProudfoot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you, albeit I think it depends on the support you pick. For example, if you pick Lulu/Milio/other enchanters and your ADC isn't even willing to take trades, then it's going to feel a bit miserable. And you can't roam as efficiently as a Rakan or a Pyke, for example.\n\nStill the lowest risk, highest reward role, though.",
                            "score": 12,
                            "author": "TuxSH"
                        },
                        {
                            "level": 2,
                            "comment": "You are right that support is the 2nd most impactful role, but the other guy is right that garbage supports literally never get blamed. I started playing sup in ranked because it is so damn cool being literally carried and people insulting each other instead of insulting me. Sups are cowardly people in real life who know they can get away with avoiding conflict",
                            "score": 2,
                            "author": "Olimandy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh that part is absolutely true, yeah",
                                    "score": 1,
                                    "author": "LegolasProudfoot"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I will never forget the one game I played as Leona support with a pacifist jinx adc last season. It was almost enough to make me switch lane (still ended up switching to mid eventually tho.)",
                    "score": 9,
                    "author": "npri0r"
                },
                {
                    "level": 1,
                    "comment": "You forgot about the classic where the support plays so far back you have to miss half the Cs or take infinite poke",
                    "score": 2,
                    "author": "Snoo-2046"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Playing ADC solo vs ADC + Supp that's duoing sounds super fun",
            "score": 10,
            "author": "__v1ce"
        },
        {
            "level": 0,
            "comment": "I play fill only and here are my estimate for roles i've been filled to:\n\n86% Bottom\n\n10% Support\n\n3,99% Jungle or Top \n\n0,01% Mid\n\nI've gotten pretty good at adc as a result of this but I swear adc is so hard (not necesarilly mechanically more-so than other roles, but mentally). Keeping good mental on adc is so much harder than on other roles. You depend so much more on your teammates to peel for you, be aware of you, help you get that big damage out. + one mistake doesn't cost you the whole fight as much on other roles as it does adc.",
            "score": 8,
            "author": "As4realreal"
        },
        {
            "level": 0,
            "comment": "You don't realize those \"new\" ADC items are meant to(and do) nerf ADCs do you.",
            "score": 26,
            "author": "bns18js",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats why they all build lethality now 💀",
                    "score": 1,
                    "author": "scrubbfoxx0069"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably because it's the most variable/frustrating lane to play without a duo.\n\nIf you play any other lane, imagine the times when someone else on your team showed up and died to your opponent without netting you anything or even costing you resources. Not only is it frustrating and makes the lane harder/impossible but it usually happens at times that make you wonder \"why were you here in the first place?\" Playing bot lane is like having that as a constant possibility.\n\nPart of the problem is that while botlane is strong as a set of roles and a lane in terms of its proximity to dragons, it rarely feels like you are the one who determines your strength while also feeling like you need to be disproportionately strong to compete with any of the other lanes. Obviously, the degree of agency scales with the player's skill so a Challenger ADC/Support will utilize what they do have more effectively. The flipside to that is those ADCs/Supports also have significantly better teammates that enable them to do so.\n\nThe other, and arguably, bigger part of the problem is botlane is made of two roles (usually played with strangers) that have such a drastically different experience of the game at all points.\n\nADCs are gold/item dependent champions that generally have weaker base damages on their abilities. Being slightly ahead in-lane as an ADC MIGHT feel like you're on par with the other 3 lanes. Being slightly behind in-lane as an ADC feels like your opponent is miles ahead. And when you get behind, you will spend the entire game fighting your team for resources to catch up. Playing ADC is literally the only time I've played games where me and my counter-part on the enemy team were the weakest parts of our team and there was nothing, by that point, we could do about it. It becomes practically an unspoken agreement to just let each other farm if we happen to meet in a sidelane. It doesn't help that solo queue players want to act in the timeline where they feel strongest and that is almost always before the ADC wants to unless they've been handed a fair number of kills. It's the role that can feel the most miserable to play even if your team is winning.\n\nSupports have a wider range of experiences because of how many class/subclasses get played. As an Enchanter, you rarely feel behind in terms of being useful but you end up in situations where you know you'd be more useful anywhere else but you also know, based on how they've played, that your ADC will die and blame you if you leave. There are also times that you know, with almost 100% certainty, that you cannot save them if a fight starts but also know that they don't have the presence of mind to realize you living is more valueable than the warm and fuzzies they get from you trying to save them and dying. Engage/peel champs are strange. When you are ahead, you feel like God on cocaine. The problem is that you're also item dependent for tankiness. While you're still useful for CC, being behind feels like a knife edge where you have to clutch everything or you die every fight.\n\nI'm giving damage and mage supports their own spot because they're weirdly divisive and they have probably the most unique experience. Pyke feels great when ahead and okay when behind because he has useful CC and his ult always provides opportunity. Senna definitely can feel bad when behind but it has the silver-lining of knowing there isn't much opponents can actually do to stop you from catching up if the game goes on long enough. Mage supports, and by that I mean played with the intent of supporting, and not that stupid \"hurr durr, I'm a carry\" thing that lost midlaners do, feel the best and...most like a support...when ahead. You have the damage to create space and safety for your ADC to farm while getting the enemy into easy kill range for them. They also feel pretty good from behind. They have solid base damages, AP on economy items is pretty decent, and they provide a moderate amount of soft/hard CC. The issue with being behind is there's always that gremlin in the back of your head that's saying \"If you'd taken/take that kill/cs...you could get us back in the game.\" Maybe but not usually, and always at the expense of the ADC. Good supports ignore the gremlin and be useful. Bad supports high-five the gremlin and choose to make the game absolutely miserable for their ADC for a chance at winning.",
            "score": 5,
            "author": "TexasMonk"
        },
        {
            "level": 0,
            "comment": "It sucks to play until you get reasonably good (\\~diamond).\n\nYou are stuck in lane with a random for \\~15m, to later being stuck farming and avoiding 1v1's because almost everyone beats you (minus supp/adc) until you get 3-4 items (game usually over by then). ADC shine in team-fights and things aren't much better (in SoloQ), everyone plays for themselves and a single mistake usually means instant death. \n\nThe role is really punishing and somewhat boring, but it's considered broken by most because of pro-play and how snowbally the lane can be.",
            "score": 22,
            "author": "Awyls",
            "replies": [
                {
                    "level": 1,
                    "comment": "it sucks even in diamond+",
                    "score": 2,
                    "author": "BakaMitaiXayah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One thing I never liked is if the bot lane doesn’t go well it’s always “adc diff” to your team. It’s never support diff if your hypothetical 0/8 karma fed the enemy botlane. It’s like if you were on a bus with someone who smelled bad and everyone thinks you smell bad by proxy",
            "score": 6,
            "author": "LilTempo"
        },
        {
            "level": 0,
            "comment": "Who thinks ADC is OP vs who wants to play ADC",
            "score": 16,
            "author": "KogMawOfMortimidas"
        },
        {
            "level": 0,
            "comment": "Soloq being filled with assassins, being the most team reliant role, and having another person decide ur lane all means the role is very frustrating to play so even when it’s strong the play rate is low.",
            "score": 19,
            "author": "Tron_Impact"
        },
        {
            "level": 0,
            "comment": "Tbh it dosnt matter how good adc is, if you swap lane because adc is good, then you have to relearn Champs, the role etc and it wont give the Result that people expect.\nSo some will try for 10 games, drop elo and then go back to Main.\nAlso imo bot is the lane where you tilt the most. Im a mid Main and in general pretty chill when i play mid, when i play adc in normales or flex, i get so angry and have to Mute myself.\nI think other people might be the Same",
            "score": 3,
            "author": "Itsdumbledore"
        },
        {
            "level": 0,
            "comment": "Cuz playing solo as adc is unplayable unless you are able to farm 10cs (never miss a last hit ever)\n\nAs a support you can roam or play with adc but your team will have to bring the win eventually. \n\nBoth roles are team dependend. Thus less popular.",
            "score": 3,
            "author": "xMisuto"
        },
        {
            "level": 0,
            "comment": "Because if you're playing bot, your lane is mostly dependent on how good your support is. Then whose jungler comes bot the most and so on ... \n\nYou may be a god late game, but if you get there or not, is mostly out of your hands.",
            "score": 7,
            "author": "Kezmark"
        },
        {
            "level": 0,
            "comment": "Coz Bruisers beat Tanks, Tanks beat Assassins, Assassins beat Adcs, and Adcs beat their meat.",
            "score": 15,
            "author": "Krystalizing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ur on some wild shit if you think adcs are weak right now",
                    "score": 3,
                    "author": "Getjukedm9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Adcs arent weak, HOWEVER they require coordinated play which is not gonna happen in soloq.",
                            "score": 17,
                            "author": "imdacki"
                        },
                        {
                            "level": 2,
                            "comment": "they are not weak, but their built path is so damn awkward rn that almost every ADC wanna build Triforce to spike early, hell even Ashe wanna build Triforce just because how awkward her current crit build is.",
                            "score": 4,
                            "author": "Peroniko"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s different for each elo. But usually below plat is adc sup fill and above plat is top supp fill.",
            "score": 2,
            "author": "Regectedgamer"
        },
        {
            "level": 0,
            "comment": "2v2 means way more variables and you’re in a role that needs to prevent the enemy ADC from carrying at the very minimum with your matchups which gets very tricky when your support doesn’t know what they’re supposed to be doing. \n\nSupports also have to deal with dumb ADCs who can’t stand not being the center of attention for a whole minute when they found a good roam timer and pinged it out. \n\nI play ADC most of the time, almost exclusively solo, and when you aren’t a fantastic player mechanically to squeeze water out of stone there’s just so much miscommunication in the 2v2 that make it frustrating. You don’t have time to ping the all-in when the window for it is in the milliseconds but if the other part is required for that play you just get punished for trying them which is true for both parts of the lane",
            "score": 2,
            "author": "yung_xd"
        },
        {
            "level": 0,
            "comment": "ADC is super strong and a team that properly coordinates around one wins the game. Except this is league and outside high elo no one properly coordinates, so the adc dies every fight to an assassin while their tank is off chasing vladimir",
            "score": 2,
            "author": "alreadytaken028"
        },
        {
            "level": 0,
            "comment": "What borked items lmao",
            "score": 2,
            "author": "Snoo-2046",
            "replies": [
                {
                    "level": 1,
                    "comment": "i mean the new items, which make adc alot stronger",
                    "score": -3,
                    "author": "noodleben123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ad is weaker with new items",
                            "score": 9,
                            "author": "Snoo-2046"
                        },
                        {
                            "level": 2,
                            "comment": "They literally just shifted adc mythics to make them a lot weaker.",
                            "score": 3,
                            "author": "Angel-Dove"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because bot lane doesn’t matter anymore. Only solo laners matter because they get solo xp and will easily out level and out scale bot by 4+ levels. Also dont even build adc items. Lethality is OP and it outscales armor. Idk if these changes were intended but thats why nobody wants to play bot.",
            "score": 2,
            "author": "scrubbfoxx0069"
        },
        {
            "level": 0,
            "comment": "if you have marksman mechanics you are instantly plat+, below are the shit marksmen who can't kite, get frustrated and quit the role to play garen top",
            "score": 2,
            "author": "macrotransactions"
        },
        {
            "level": 0,
            "comment": "Here's my take on bot as an adc main. Playing adc is a double-edged sword. If you do too well in lane and have a 700g bounty on your head, you're sure gonna need a diaper change because that 3 lvl lead 5-0 Jax, Hecarim or Yone is going to come after you and snowball even more.",
            "score": 4,
            "author": "Budilicious3"
        },
        {
            "level": 0,
            "comment": "You dont have good impact, even when ahead you can't go to clear ward solo, 2-10 Rengar will one shot you. Ahead or behind you have to run after your jungle and support and thry could be absolute zero skill but you have no choice.",
            "score": 2,
            "author": "No-Video1797"
        },
        {
            "level": 0,
            "comment": "its priority queue in low elos, but plat higher it isnt. One big reason is Adc is one of the hardest roles but it has really good rewards what high elo or plat and above players know how to abuse while Gold and below dont know how to utilise or make the best out of ADC (building paths, macro, micro) which will make them go towards a less stressfull lane.",
            "score": 1,
            "author": "Documented-iM"
        },
        {
            "level": 0,
            "comment": "Because the role is weak. The champs aren't that strong. They need teammates to play for them, and even then more often than not you're relying on those teammates actually being able to play half decent.\n\nrole is literally team diff and the majority of the games aren't even ones where you get to express any level of skill.",
            "score": -18,
            "author": "yastie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unironically saying that the role is weak, is just cope. The role is unbelievably broken  and has been for a couple of patches now. \n\nBut yes, you need your team to play for you, and not themselves, which, ofcourse, poses a problem in soloq, as most people rather have fun themselves than winning the game at all costs ( which is completely fine).\n\nAs an ADC player myself, not an insanely good one, but still, I get why people complain about getting oneshot all day, but that's just how it is, mate.",
                    "score": 7,
                    "author": "KatanaOfTheLight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Broken in proplay has an argument. Broken in solo queue is just false. ADC probably has the least agency and influence over a game out of all roles(either that or top).\n\nThe better jungle/mid/support will all win before the better ADC wins in most games.",
                            "score": 5,
                            "author": "bns18js",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does that make the role weak tho? If it is regarded as op in high elo and in proplay the role is not what's flawed, but rather the circumstances in lower elo are",
                                    "score": 8,
                                    "author": "KatanaOfTheLight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Considering the question is why ADC is the least popular role in solo queue by the OP, yes it means exactly that.\n\nIn the vast vast majority of ELOs in solo queue, ADC is a weak role that has less influence over the outcome of the game than others. It's a major reason why people don't play it as much.",
                                            "score": 7,
                                            "author": "bns18js"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "if things are purely optimized for pro play then at least 90% of the playerbase is going to be paying the cost for that in every game they play.",
                                            "score": 1,
                                            "author": "yastie"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "if bot role is only strong if the team plays around it  \nand the team will almost never play around it outside of a very narrow band in solo q  \nthen it's weak in solo q  \nsimple as",
                                            "score": 1,
                                            "author": "HedgehogHokage",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; if bot role is only strong if the team plays around it\n&gt; and the team will almost never play around it outside of a very narrow band in solo q\n&gt; then it's weak in solo q\n\n1) That's true  \n2) Adc is strong because the answer to \"is bot role is only strong if the team plays around it?\" is no.",
                                                    "score": 0,
                                                    "author": "backelie"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ADC and support will duo most often of any roles and they will almost always be facing a duo bot lane as well. Prio on bot lane roles is good to keep queue times down for solo ADCs and supports.\n\nWe don't really know how popular different roles are as Riot rarely releases that info, but whenever they do ADC is usually doing good (top 2) playrate wise.",
            "score": 0,
            "author": "Maximum_Web_9827",
            "replies": [
                {
                    "level": 1,
                    "comment": "Priority role is based on playrate.",
                    "score": 8,
                    "author": "backelie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did Riot say this somewhere?",
                            "score": 2,
                            "author": "Maximum_Web_9827",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The entire reason for the existence of priority roles is to incentivize the least played role(s), to minimize queue times for everyone.",
                                    "score": 7,
                                    "author": "backelie"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "it shows adc and sup every single day in prio mod, idk why, i only know it's clearly bugged. cuz when i queue up mid/top i get top so many times, but when i q up mid/adc or mid/sup i almost never get adc or sup. Same thing goes for fill. I only get filled top majority times, yet the system keep saying adc and sup needs players.",
            "score": 1,
            "author": "FoxGoesBOOM"
        },
        {
            "level": 0,
            "comment": "You get priority queue for roles people don't want to play, if you ask why people don't want to play adc I'm guessing it's because aside from a few on-hit abusers like kog'maw adc overall got weaker with the recent changes and assassins are also super broken right now which is no fun as an adc.",
            "score": 1,
            "author": "itaicool"
        },
        {
            "level": 0,
            "comment": "What borked items lmao",
            "score": 1,
            "author": "Snoo-2046"
        },
        {
            "level": 0,
            "comment": "the patch was explicitly intended to be an adc nerf, IE got made a mythic without being buffed.",
            "score": 1,
            "author": "StJe1637"
        },
        {
            "level": 0,
            "comment": "Once you get to plat, ADC is the most queued for role in the game.\n\nhttps://www.leagueofgraphs.com/champions/main-stats",
            "score": 1,
            "author": "APlogic"
        },
        {
            "level": 0,
            "comment": "I play fill in norms and would get bot carry 80% of my games , now after the changes I probs get it 65-70% now. Can’t imagine many of those players transferee over to playing it in ranked tho.",
            "score": 1,
            "author": "DaddieDerek"
        },
        {
            "level": 0,
            "comment": "U have to actualy think about ur build now. And u cant spam the same build all day to easy 60% wr with the best meta adc that easy.",
            "score": 0,
            "author": "OutOfPosition-1"
        },
        {
            "level": 0,
            "comment": "Bot lane is super weak rn.",
            "score": 0,
            "author": "Angel-Dove"
        }
    ]
}