{
    "id": "146vmnd",
    "score": 0,
    "title": "Question: Why don’t pros do GA’s like they do in CoD for OP stuff?",
    "author": "AIIahSnackbar",
    "date": 1686494452.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/146vmnd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Full disclosure, I’m an idiot\n\nIn professional CoD, pros sometimes come to a GA (gentleman’s agreement) if something is stupid OP, like the M4. Once something is GA’d, no team is allowed to use said GA’d gun/attachment/lethal/etc.\n\nI know that league has a different system, but what if they GA’d things like Zeri or Yuumi? Seems frustrating that teams have to waste bans on champs like these, who have seen pro play relevancy for quite some time. Not saying this is an easy fix or something—just sort of thinking out loud and wanted to start a discussion.",
    "comments": [
        {
            "level": 0,
            "comment": "Lol Esports is completely based on playing the most op champ/combo/team synergy possible. Why else do you think we see the same 20 champs for the past 2 years being played? This will never work",
            "score": 46,
            "author": "dEleque"
        },
        {
            "level": 0,
            "comment": "Why would the team that is the best on zeri/yuumi agree on doing that ?\n\nWhy would a team A whose only chance to beat team B is to pick zeri/yuumi agree on doing that ?",
            "score": 26,
            "author": "mewimewii",
            "replies": [
                {
                    "level": 1,
                    "comment": "in actual split games it doesn't make sense, winning games is too important for playoff / worlds qualification. but in scrims I bet teams come to a gentleman's agreement so they can actually practice other comps and try out new pick/ban strategies, especially if the champions that are OP today will get nerfed down the road and that practice actually comes in handy.",
                    "score": 8,
                    "author": "lawfulkitten1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They certainly do !",
                            "score": 1,
                            "author": "mewimewii"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Why would the team that is the best on zeri/yuumi agree on doing that ?\n\n&gt; Why would a team A whose only chance to beat team B is to pick zeri/yuumi agree on doing that ?\n\nIf you want to know the answers to these questions, ask why they *do* this in CoD and other sports. It's for the health of the game. \n\nSports and tournaments often suck when \"winning at any cost\" is the aim. Just look at how Football is played, with everyone diving just for a chance at a free kick.",
                    "score": -1,
                    "author": "AstraLover69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Sports and tournaments often suck when \"winning at any cost\" is the aim. Just look at how Football is played, with everyone diving just for a chance at a free kick.\n\nWhich isn't the case in LoL",
                            "score": 5,
                            "author": "mewimewii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then why wouldn't teams agree to GA certain champions that make the game unhealthy, stale and boring to watch?",
                                    "score": 0,
                                    "author": "AstraLover69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Why would the team that is the best on zeri/yuumi agree on doing that ?  \n&gt;  \n&gt;Why would a team A whose only chance to beat team B is to pick zeri/yuumi agree on doing that ?",
                                            "score": 2,
                                            "author": "mewimewii",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Repeating what you've said isn't going to sort out your contradiction.",
                                                    "score": 0,
                                                    "author": "AstraLover69",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There is 0 reason for a team who is good at X to accept not doing X, they're not going to lower their chances to win because you find the game \"boring\", they're here to win. And as I said, the game doesn't start to suck because a team plays zeri yuumi. If anything it would be more intelligent to complain to riot since they would listen and change it rather than to have this manlet agreement that would require all of the 300ish players who could be attending worlds to accept it, after all you don't want to arrive at worlds and face a team who plays zeri yuumi while you didn't play it for the sake of a GA.",
                                                            "score": 2,
                                                            "author": "mewimewii"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Riot games is held more accountable since they dish out a patch every fortnight. You should 100% blame the game, not the players abusing it.",
            "score": 10,
            "author": "LeafBurgerZ",
            "replies": [
                {
                    "level": 1,
                    "comment": "What does this have to do with Fortnite? \n\n\n/s",
                    "score": 7,
                    "author": "4skin_Gamer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because banning a bunch of shit is really boring. This is exactly why I dislike pro CoD. League has a mix between pro and casual balancing where as CoD is balanced for casuals only. This is why they need to ban a ton of stuff. What it does is severely limit the amount of variance that can be seen in a match where metas are already somewhat stale . It's really boring and disconnects players from pros even more. You should wondering why Riot is doing nothing about a goo brain, alleged noob champ being top tier at pro level.",
            "score": 7,
            "author": "ADistantFallenStar"
        },
        {
            "level": 0,
            "comment": "Because banning champs does not only influence the champs that are banned. In CoD it doesnt matter if for the Scar if the M4 is banned or not. Its just another gun, with one that is better being banned away. If you banned Zeri Lulu you would make other picks possible that then cant be answered properly, because the champs you need to answer them are banned.   \n\n\nIm not really deep in the pro meta currently but lets say Draven Leona is hard countered by Zeri Lulu. If you then ban Zeri Lulu Draven Leona becomes infinitely better because a possible countermatchup is banned away. It might even become OP enough that this lane would have to be banned aswell and then you start going in circles",
            "score": 6,
            "author": "LEAVE_LEAVE_LEAVE"
        },
        {
            "level": 0,
            "comment": "The real answer to this question is that league is constantly updating and balancing compared to COD. Riot does this for us eventually.",
            "score": 2,
            "author": "Sutsnacks62"
        },
        {
            "level": 0,
            "comment": "Because League pros are not fucking stupid",
            "score": 5,
            "author": "zeero88"
        },
        {
            "level": 0,
            "comment": "Another relevant answer I’m not seeing here is because only one team has access (at least in the world of champs)\n\nLeague has an asynchronous design. In CoD it may be in both teams best interest to GA a gun because both teams can pick it and it warps the whole game, in league only a single team can pick it (blue side) so whichever team has blue side more often in a series has no benefit in GAing a broken champ",
            "score": 1,
            "author": "Abarn279"
        },
        {
            "level": 0,
            "comment": "The difference between an op gun and a less op gun in cod isnt as big as the difference between op and less op champs in league. You cant get behind in resource in cod because they dont have them and in csgo after a few save rounds youre basicly reset.\n\nDoing ga's is way to big on league",
            "score": 1,
            "author": "JeBoyBarend"
        },
        {
            "level": 0,
            "comment": "Because that would be dumb. I’m sorry, but competition is about winning, and winning is about finding and using the best strategies available. Doesn’t matter if it makes the game boring for others or anything like that. If that’s an issue (and I know it is, fuck zeri/yuumi) then it’s on riot to shake things up.",
            "score": 1,
            "author": "kagekitsune116"
        },
        {
            "level": 0,
            "comment": "The fuck would you willingly decrease your chance at winning?",
            "score": 1,
            "author": "ASURA_IIXV"
        }
    ]
}