{
    "id": "146ybi4",
    "score": 14,
    "title": "How to scale cursor to 200% now?",
    "author": "PermaDerpFace",
    "date": 1686501056.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/146ybi4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Used to be able to scale the cursor past 100%, doesn't seem possible anymore. Editing CursorScale in the config files has no effect either. I find it really hard to follow the cursor in team fights, not sure why they removed a basic QOL feature",
    "comments": [
        {
            "level": 0,
            "comment": "I highly recommend Yolomouse, you can change the cursor color and size, I dont lose my cursor in teamfights anymore, and no more getting myself killed when I accidentally click on the minimap when pathing. One of the best 5 bucks I ever spent",
            "score": 8,
            "author": "Lensecandy",
            "replies": [
                {
                    "level": 1,
                    "comment": "To fix that last part you can turn off minimap interactivity in the options. It also makes it so you no longer accidentally launch a skill in the completely wrong direction because you're touching a single pixel of the map. To further this, I personally also prefer champion portraits on the left side (since you can do the same thing with mousing over a single pixel of those and accidentally waste abilities or path wrong as a result), as well as the fact that that's where they were originally (their position above the minimap was a change many older players did not agree with, and they also later went on to add the option to move it back to its original placement which was frankly necessary).",
                    "score": 5,
                    "author": "lactosefree1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a good tip. I tried turning off the minimap click to path, but it is useful feature, I just had a hard time seeing the original game cursor so I clicked on it by accident a lot x)",
                            "score": 1,
                            "author": "Lensecandy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For long distance pathing it's better to just unlock and look where you're going. You'll still see the ability range on the minimap when mousing over/holding to check range indicators (if you use that option).",
                                    "score": 2,
                                    "author": "lactosefree1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'll check it out thanks!",
                    "score": 2,
                    "author": "PermaDerpFace"
                }
            ]
        }
    ]
}