{
    "id": "1473ui8",
    "score": 2,
    "title": "Can anyone explain to me how my LP dropped that low out of nothing? Or is this just a nother bug I found out about?",
    "author": "Tmg_080",
    "date": 1686514025.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/1473ui8",
    "media_urls": [
        "https://v.redd.it/vblskqqm3g5b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Lol that's funny\n\nI think Nunu used Q on you and since you were a minion it did more damage than it should",
            "score": 22,
            "author": "Mazuruu",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wouldn't call it \"more damage than it should\", cuz this is correct amount of damage.",
                    "score": 8,
                    "author": "Matthias1410",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kind of yes and kind of no, because normally you only should be able to take as much damage in minion form before transforming back, as the minion has LP. Or am I wrong?",
                            "score": -1,
                            "author": "Tmg_080",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well u got transformed back, and it all came in one hit. But yeah, i think it is bugg, there were lot of things like this on realease [https://youtu.be/YTi6mecdsWI](https://youtu.be/YTi6mecdsWI)",
                                    "score": 1,
                                    "author": "Matthias1410"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think the damage is relative to your own hp? So if nunu deals 80% of a minions health with q it also does that to yours",
                    "score": 0,
                    "author": "AdministrativeAge421",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "nah if thats the case that neeko would be dead, since nunu q would just one shot the minion at that point in the game.",
                            "score": 5,
                            "author": "fabton12"
                        },
                        {
                            "level": 2,
                            "comment": "No nunu just does 900 true damage straight",
                            "score": 1,
                            "author": "Ap0colypse"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You took Nunu Q minion damage that forced you out of passive because the minion would have died. It looks like a case where riot was too lazy to fix all the shapeshift interaction and saw they were kinda funny so they left it like that, so it's technically not a bug. The same way, smite deals you 1200 true dmg if you turn into a jungle monster.",
            "score": 6,
            "author": "Kebabed"
        },
        {
            "level": 0,
            "comment": "so nunu q does more damage to minions, monsters, epic monsters etc etc.\n\nneeko for all purposes as a minion is fully checked as a minion for things hitting her to not give her away. so nunu q did the damage it would do to a minion to her.\n\nnunu is level 6 so 3 points into his q that is 800 true damage, this is also confirmed because he got the minion heal which is increased and nearly double the normal heal amount.\n\ntldr; nunu q treated neeko as a minion since she was a minion.",
            "score": 3,
            "author": "fabton12"
        },
        {
            "level": 0,
            "comment": "I think it's because before chomping a minion, nunu picks it up, and maybe that's regarded as a cc, or maybe a brief displacement which blew your cover. and if that nunu is full ap I think a chomp can do big damage, or maybe the 'damage to minion' gimmick still held even after transformation wore out.",
            "score": 0,
            "author": "OppaiDaaisuki"
        }
    ]
}