{
    "id": "147kr1z",
    "score": 0,
    "title": "cant really find a suitable champ for me",
    "author": "Sin-FFX",
    "date": 1686565817.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/147kr1z",
    "media_urls": [],
    "other_urls": [],
    "postText": "im bronce/silver elo and im playing league now for a almost 9 months i think.\n\ni play mainly top lane but i can also do jungle and mid. \n\ntop i like sett(but have a abysmal winrate with him) and thats why i give up on him(he is also frustating to play since i cant get away from enemy and he gets kited so easily.)\n\n&amp;#x200B;\n\nmid i enjoy playing Zed but when i see sometimes my plays(ult and dont hit q afterwards with my shadow) it makes me cringe and quit him playing. i also play garen but lets be honest he is boring to play.\n\nin jungle i enjoy viego but i dont know all the abilitys of every champ so there is that and he is rather hardto play(hit w is the most imporant and ult).\n\n&amp;#x200B;\n\nany recommendation you think can fit me? i tryed veigar mid, malzahar but i also dont enjoy them.(malzahar yes but he is to team dependent.)",
    "comments": [
        {
            "level": 0,
            "comment": "Don't give up on champions you like because you make mistakes. You'll make mistakes on every champion even when you're good. Instead you should try to improve on them and game in general.",
            "score": 8,
            "author": "x6SexGod9x"
        },
        {
            "level": 0,
            "comment": "I’ve been a top main for almost a decade, so I’ll do what I can to help. \n\nIt’s not the most popular role because it’s the most punishing for mistakes - but that also means it’s the most rewarding if you learn what those mistakes are and how to be the one punishing them. If you aren’t a fan of variance (I.e higher highs and lower lows) than top isn’t for you and there’s nothing wrong with wanting a bit more consistency in your relevance within the game. \n\nIf you’re still keen on playing top, I’d say start with champions that are known for dominating the laning phase and play them until you’re doing exactly that in 90% of your games. Darius, olaf, renekton, Kled are all good examples. The best resource I can recommend is Skillcapped YouTube (search for their top guides). Once you’ve learnt the basics, you’ll find that opens up so many options that people will complain about in champ select and mysteriously shut up as it becomes clear you know what you’re doing. I have pretty insane winrates with picks like soraka, Annie and lillia (obviously inflated because I’m picking them into matchups I think are free).",
            "score": 2,
            "author": "arguewithsomeoneelse"
        },
        {
            "level": 0,
            "comment": "It sounds like the problem is in your attitude not in the champions you play. I feel like no matter what champion we recommend, you will give up or find an excuse as to not play that champion anymore.\n\nMy personal advice is, find a champion you enjoy playing and have fun with and stick to that champion. You think the best players in the world don't struggle with their main champions from time to time or miss skillshots? The best Zed player on the world sometimes misses his Q or messes up a combo, it's the nature of the game.",
            "score": 2,
            "author": "ImprovementNo5096"
        },
        {
            "level": 0,
            "comment": "Its a game, play Sett if you like playing it, you will get good. Watch some pro players Sett full games from youtube, learn to map control your top side, if you crush your enemy at top, roam enemy jungle, if you are not against splitpusher like Sion, trynda, Jax, Yoric, Nasus etc, gank mid and help him win the lane. When you start to handle top mechanics for 1 champ, learning curve for other top laners will be shorter!",
            "score": 2,
            "author": "Justpispsu",
            "replies": [
                {
                    "level": 1,
                    "comment": "(pro/high elo)",
                    "score": 0,
                    "author": "Justpispsu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I play malz with DH makes him a bit more team independent.",
            "score": 1,
            "author": "Technical-Mixture639"
        },
        {
            "level": 0,
            "comment": "Zac support",
            "score": 1,
            "author": "TrulyPositivePotato"
        },
        {
            "level": 0,
            "comment": "You just need to understand the game more. Watch some sett mains like Autolykus and see how he plays and you'll pick up a lot of tricks he does and eventually you'll just start winning and understanding matchups and what sett does better. Don't give up on the champs you like!",
            "score": 1,
            "author": "QuePastaLOL"
        },
        {
            "level": 0,
            "comment": "If you are calling malzahar team dependent, I honestly don't think any champion in this game is team dependent except for yuumi.\n\nI would recommend playing kled or pantheon top.",
            "score": 1,
            "author": "gangplank_main1"
        },
        {
            "level": 0,
            "comment": "You dont find a main, a main finds you. Example, I HATED shaco, so I started playing him to learn how to counter. Now Im a filthy shaco sup main",
            "score": 1,
            "author": "BurrStreetX"
        },
        {
            "level": 0,
            "comment": "Play all of the champions you own for 5-10 games in top and see which champions you do well with. This will give you an idea of what champion type your playstyle naturally gravitates towards. I'm a defensive minded person first, I feel more comfortable when I have to defend aggression than when I have to be the aggressor so I play late game scaling champions because it fits that mold perfectly. You might be the opposite. You might be in-between.",
            "score": 1,
            "author": "GeorgySniper"
        }
    ]
}