{
    "id": "147t6on",
    "score": 221,
    "title": "Invisible Neeko Interaction with Illaoi Tentacle",
    "author": "RhodesMachine",
    "date": 1686592407.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/147t6on",
    "media_urls": [],
    "other_urls": [
        "https://reddit.com/link/147t6on/video/8fbxt2fcfn5b1/player)",
        "https://reddit.com/link/147t6on/video/5zvkwienlm5b1/player)"
    ],
    "postText": "Unexpectedly, my friend found out that neeko went invisible when he turned into an Illaoi tentacle during his ranked game. Same view from red side as well. Was super weird so had to share.\n\n[Red Side View](https://reddit.com/link/147t6on/video/8fbxt2fcfn5b1/player)\n\n[Neeko Interaction](https://reddit.com/link/147t6on/video/5zvkwienlm5b1/player)",
    "comments": [
        {
            "level": 0,
            "comment": "Illaoi tentacles despawn when she's not in the area, so maybe it could be that since there is technically no illaoi that controls you, and you can't just get despawned, you went invisible?",
            "score": 161,
            "author": "Infinity_tk",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not the OP, but I am the person in the clip; I would say that makes the most sense.\n\n&amp;#x200B;\n\nDisguising as a tentacle fresh after taking it presents normally, but sitting on it for a bit, I assume with the tentacle being despawned, allows for you to become an invisible tentacle.",
                    "score": 58,
                    "author": "Arbiter008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah exactly, although it would be cool to check if your tentacle turns invisible if you're in the area illaoi was when you stole it. For example, if you transform into a minion, even if it dies you can turn into that minion because it can exist anywhere on the map. But for illaoi tentacles, because they can only exist within a certain area of illaoi, if you're not in that area when you transform, you go invisible.",
                            "score": 12,
                            "author": "Infinity_tk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where is the \"red side as well\"  \nI really expected that to be included.",
            "score": 31,
            "author": "Challenge419",
            "replies": [
                {
                    "level": 1,
                    "comment": "Until there's a better visual, here's the red side that I took at first. Let me know if it works. \n\n[https://imgur.com/AIRTvE1](https://imgur.com/AIRTvE1)\n\nI don't know if the healthbar is visible, but it's still a notable perspective.",
                    "score": 29,
                    "author": "Arbiter008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lmao at the random healthbar moving around",
                            "score": 12,
                            "author": "goonbandito",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah; really wish I had an answer on whether the hp bar was visible or not on the player end. It is on the replay, so I think it is for players.\n\nIt is amusing though; Malphite did not react to it.",
                                    "score": 6,
                                    "author": "Arbiter008"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just added it, should be available to view now.",
                    "score": 8,
                    "author": "RhodesMachine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmfao at the audio",
            "score": 12,
            "author": "clownysf"
        },
        {
            "level": 0,
            "comment": "IIRC, you're immune to illaoi E while you're a minion/ward as well.",
            "score": 3,
            "author": "WoonStruck"
        },
        {
            "level": 0,
            "comment": "was expecting refferences to neeko's trip to freljord",
            "score": 3,
            "author": "OSRS_4Nick8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah, she was the one wielding the tentacle there... Oh your right, that does line up about right",
                    "score": 1,
                    "author": "stuffslols"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love me some Neeko and tentacle action",
            "score": 5,
            "author": "Amblypygi12"
        }
    ]
}