{
    "id": "147v9g2",
    "score": 0,
    "title": "Is Yasuo ADC viable? Best Support to pair with him?",
    "author": "Saachii_",
    "date": 1686597815.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/147v9g2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I usually play passive early game and farm until jungle comes or they overextend. Then we go zoom boy dash dash on em.",
    "comments": [
        {
            "level": 0,
            "comment": "I think it's viable to an extent as long as you know how to Yasuo.\n\nBest supports are those that are aggressive with him and allow him to snowball early. Someone like Janna may seem interesting but it's not my preferred pick with that. My personal favourite is Pyke for him, actually. If he can snowball early and shut down enemy ADC he wins.\n\nI used to run Yasuo + Pyke bot a real (s9-s10) while ago and it's genuinely very fucking fun if you can play it, it's nasty. Certain displacing supports (I know for sure Pyke, but Naut also works. Idk about Thresh, probably not) actually count as a knockup, and you can use your ultimate with it if you need. Naut is probably best. (EDIT: Forgot Rell, might be best supp for him) \n\nYasuo is generally a massive fan of playing aggressive, it's his entire playstyle (there's a dose of reason behind his 0/10 meme). Yasuos just beat their head against the wall until their play works and they become good enough at the champ that it works most of the time.\n\nHowever, if you want to play him more like a scaling carry in some way, you can try playing more passive with, once again, someone like Janna or some enchanter I GUESS can work. I didn't try that.",
            "score": 9,
            "author": "Dm_Me_TwistedFateR34",
            "replies": [
                {
                    "level": 1,
                    "comment": "Once I find a duo well try pyke 👹👍🏻. I had nautilus last night it was pretty easy kills.",
                    "score": 1,
                    "author": "Saachii_"
                },
                {
                    "level": 1,
                    "comment": "Thresh flay is a knock up that’s pretty easy to see coming if you’re the yasuo.",
                    "score": 1,
                    "author": "oberg14",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I forgot abt his flay lmao, was thinking about only hooks in the moment. Yeah flay works.",
                            "score": 1,
                            "author": "Dm_Me_TwistedFateR34"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alistar. Since nobody mentioned him.",
            "score": 6,
            "author": "Frosttidey"
        },
        {
            "level": 0,
            "comment": "Its viable if there is setup.\n\nCombine it with a Gragas or a Rakan and it can go pretty well.",
            "score": 9,
            "author": "CinderrUwU"
        },
        {
            "level": 0,
            "comment": "Rell works excessively well with Yasuo. She has a load of CC to peel for him, and her W is a knock up. Her new E is also a great tool to help him engage with her.",
            "score": 3,
            "author": "Oleandervine"
        },
        {
            "level": 0,
            "comment": "Yas adc is free elo",
            "score": 2,
            "author": "Patrickstarho"
        },
        {
            "level": 0,
            "comment": "he is too viable tbh. they need to revert his and yone recent buffs, cant believe bad players gaslit riot into hotfixing them two hours into a patch.",
            "score": -7,
            "author": "yastie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uh he's not really overperforming atm... and Galeforce is holding him where he is right now, and they're gonna be reworking it to be bad on Yasuo again next patch (changing its crit chance ratio to a bonus ad ratio) so he's about to get a big slap in the face anyway.\n\nThe hot fix was even pretty reasonable entirely being towards durability rather than damage.",
                    "score": 4,
                    "author": "UngodlyPain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "especially considering that the only reason they hotfixed yasuo and yone is because shieldbow isn't a mythic anymore and it fucked them over hard, really hitting their durability",
                            "score": 1,
                            "author": "Dm_Me_TwistedFateR34"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Its good into some matchup. Engage support like alistar and rakan are insanely good. Enchanter are ok, esp lulu and nami are pretty decent. Mage support don't really work well with yasuo unless you have a zyra support.",
            "score": 1,
            "author": "ipppppi"
        },
        {
            "level": 0,
            "comment": "Zac. All of his CC contains a knockup.",
            "score": 1,
            "author": "TrulyPositivePotato"
        },
        {
            "level": 0,
            "comment": "Funnily enough, any time I was support and got Yasuo ADC on my team, the best success I found wasn't to lock in a knockup, but to help equalize lane prio and let him farm. Karma-Yasuo helps you establish pressure, poke from range, shield Yasuo to farm, and the root can set up a guaranteed knockup. Couple the shield with windwall and you're actually pretty safe for a lane with a melee ADC.",
            "score": 1,
            "author": "Blueexx2"
        },
        {
            "level": 0,
            "comment": "Oh I love Yasuo adc, and honestly he's pretty support flexible, as long as you adjust your play style for it. \n\nBut some baselines are:\n\nHook supports like Blitz, Thresh, Pyke, Nautilus are great. Very obvious how you play around them. They hook, and you attack targets in your face. Windfall behind them, and you force 2v1 fights that the 2nd enemy laner has to watch or walk into.\n\nDiving supports are a lot more hit or miss, but the idea is mostly the same... these are your rakan, Leona, Alistair, etc. \n\nEnchanters? Besides yuumi. You're gonna have to play really far back with them, and go for winning via attrition. Cause if you go in? Your support can't easily follow you. Yuumi? Makes you feel God mode once you get like level 6 and Zerker greaves.\n\nMages? Similar to enchanters you're gonna play back. But once they land something big? You follow them up... and not much can survive a mage+yasuo on them.",
            "score": 1,
            "author": "UngodlyPain"
        },
        {
            "level": 0,
            "comment": "Yasuo taric tech is broken, you e in wave with stun. Windwall etc and just perma fight meanwhile taric autos minions to heal constantly. Yasuo wins 1v2 with those heals",
            "score": 1,
            "author": "Straight_Rule_535"
        },
        {
            "level": 0,
            "comment": "depending on your Elo. I'm pretty sure you run it down in Plat or whatever because neither you master yasuo in this elo to play him as adc ( or mid doesn't matter ) , nor your team knows how to play around it. So if you want to do yourself and your team a favor don't do it. if it's a normal game anyways and \"you wanna play for fun\" .. do it i guess because noone cares anyways",
            "score": 0,
            "author": "KASSAAAAA"
        }
    ]
}