{
    "id": "147zl3g",
    "score": 0,
    "title": "Collaborations for skins?",
    "author": "Holiday_Nothing3263",
    "date": 1686609079.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/147zl3g",
    "media_urls": [],
    "other_urls": [],
    "postText": "Why haven't we had any collaborations for skins with other franchises yet, like it happens in a lot of other games like fortnite, clash royale and so on? \nOkay we had Louis Vuitton some years ago and an unofficial Rammus-Bowser skin back in the days, but thats it. \nWhere is the Kisame-Pyke skin? Where is the Prince of Persia-Talon skin? \nJust wondering if there is a reason the greatest MOBA in history never partnered with other great franchises.",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly I wouldn't like if we started doing collab skins. Collabs can be cool if done right but if not done right it can make the game feel like a billboard.\n\nI remember playing smite some months back and the ARAM i played had every person sans me on some collab skin. It felt like I was playing a toned down version of fortnite.\n\nIn fortnite it works well because the individual identity of each person doesn't matter, all you need to know is that they have a gun and you should kill them before they kill you.\n\nIn a moba it's pretty important to know who you're fighting at a glance so you know how to play against them, believe me when I say I got very frustrated very quickly since I had to figure out who Ruby Rose, Korra, Optimus Prime, The lead singer of Slipknot and the gnome from Runescape was at their core since it wasn't apparent to me visually. \n\nI'm sure we can agree that league already suffers from clarity issues with many of it's offered cosmetics, leaning further into that would just make it worse, imo.",
            "score": 10,
            "author": "Scykotic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, at least the current skins still have the original character as their core identity, just in an alternate universe. I don't want to have to do the extra mental work to convert Aang to Merlin, you know?",
                    "score": 5,
                    "author": "Jragon713",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very true, good point!",
                            "score": 2,
                            "author": "Holiday_Nothing3263"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They have an Eleven from Stranger Things skin for some champion in Smite. People on this sub has a breakdown over Lee Sin and Ezreal having the same hair color on certain skins",
                    "score": 1,
                    "author": "controlledwithcheese"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because riot has nothing to gain from stuff like that.",
            "score": 6,
            "author": "SNSDave",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tencent owns half of gaming industry, shouldnt be hard to get a good deal done, and collaborations are a very popular and hyping advertisement, like you can see its done in fortnite very successfully.",
                    "score": -3,
                    "author": "Holiday_Nothing3263",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah and league has been out for...what...7-8 years priors to fortnite with no issue? It's already the most popular with Moba with Dota2 still a good deal behind it.",
                            "score": 1,
                            "author": "SNSDave"
                        },
                        {
                            "level": 2,
                            "comment": "As far as I'm aware Tencent gave Riot 100% creative freedom. It's possible they can push them to do some stuff like Wild Rift but when it comes to actual in-game designs they can't do anything about it.",
                            "score": 0,
                            "author": "BioticFire"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why collab when you can take 100% of profit by making your own skin.",
            "score": 5,
            "author": "ipppppi"
        },
        {
            "level": 0,
            "comment": "just   no",
            "score": 5,
            "author": "AtlasKitson",
            "replies": [
                {
                    "level": 1,
                    "comment": "You against the idea in general or just against my examples given? \nYou have some collaborations you would like to see?",
                    "score": -5,
                    "author": "Holiday_Nothing3263",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No.  I can't imagine why I'd want more ads in my games, because that's where this would go.",
                            "score": 3,
                            "author": "caravaggibro"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Eh, would rather not have even more corporate advertising of piss-poor quality garbage in games anymore. I have enough of them in TV or in cinemas.\n\nBesides, fat chance of Riot planning to do something unique. Specific-unique skins like French Maid Nidalee are a thing of the past. Everything has to be a part of series now, usually recycled PROJECT shit where half of characters are impossible to distinguish (or even worse knockoffs of it, Galaxy Slayer/PsyOps etc.).\n\nHaving a John Wick Lucian could be entertaining but knowing Riot they'd make it forever recurring series for 5 champions each year. Would kill anything unique. Rather stick to fun flicks like Forecast Janna or Firefighter Tristana that are probably not coming back anyway.",
            "score": 1,
            "author": "ElementalistPoppy"
        },
        {
            "level": 0,
            "comment": "I actually hate the idea of that. The only thing i wouldn't mind is maybe Valorant inspired skins. I.m.o It doesnt belong in League. I dont mind League characters appearing elsewhere though like in Fortnite",
            "score": 1,
            "author": "JumpscareRodent"
        }
    ]
}