{
    "id": "147zauq",
    "score": 30,
    "title": "How heavily are player reports weighted vs automation?",
    "author": "Suburan",
    "date": 1686608286.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/147zauq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been getting a ton of 'a player from your game was punished' messages lately. Have they changed how heavily they are weighting player reports? I recently received a warning for the following chat logs, which I would have thought would be missed by automation (bolded the direct insults)  \n\n\n&gt;gj ww  \n&gt;  \n&gt;gj  \n&gt;  \n&gt;wp  \n&gt;  \n&gt;fool really went for ward instead of 2 waves under tower &lt;-- *this was about the enemy*  \n&gt;  \n&gt;u 2  \n&gt;  \n&gt;=(  \n&gt;  \n&gt;fuck me i guess  \n&gt;  \n&gt;A+  \n&gt;  \n&gt;u right we win that 2v3  \n&gt;  \n&gt;**u a clown.**  \n&gt;  \n&gt;hard shove wave so i cant farm safely, then get caught rotating  \n&gt;  \n&gt;see ya  \n&gt;  \n&gt;gg  \n&gt;  \n&gt;**except morg she bad lol**",
    "comments": [
        {
            "level": 0,
            "comment": "It feels like every time i get a warning i get the chat logs from my previous chat restriction. Feels like it should reset?",
            "score": 29,
            "author": "Straight_Rule_535",
            "replies": [
                {
                    "level": 1,
                    "comment": "True.",
                    "score": 1,
                    "author": "classteen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s bugged, it keeps sending me reports of old messages",
            "score": 23,
            "author": "Early_Permit_2072",
            "replies": [
                {
                    "level": 1,
                    "comment": "Had one toxic game 3 years ago it keeps rubbing my face with. Then there are virtually no toxicity in the following logs. One game had me type \"baron now\" 5 times and the system found that disgraceful.",
                    "score": 6,
                    "author": "BannedCuzSarcasm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "« please fellow teammates, would you kindly having the opportunity to pay some attention to the baron? »",
                            "score": 2,
                            "author": "Early_Permit_2072"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're wrong, you didn't get a warning for calling someone a clown or calling someone bad. You got a warning for the following:\n&gt;fuck me i guess\n\nHow do I know you ask? I got a warning twice in 1 week for saying 'fuck me' without saying anything else. I've stopped saying 'fuck me' and stopped getting warnings.",
            "score": 7,
            "author": "Lulullaby_"
        },
        {
            "level": 0,
            "comment": "Idk what riots doing with their punish system, u get chat restricted/warned so frequently now it’s insane. But u can run it down and get no punishment.",
            "score": 38,
            "author": "Komsdude",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its really pretty simple to figure out.\n\n\nIts very easy to recognize naughty words with simple \"automation\" (which is just basic pattern matching).\n\n\nIt is much more difficult to recognize intentional trolling.\n\n\nRiot is just running a simple chat filter, and then publicly patting themselves on the back and claiming they are doing a great job addressing toxicity.",
                    "score": 20,
                    "author": "basics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s not about the filter.\n\nIt’s about frequency. If you are a fast typer you get banned in absolutely no time. If you spam chat enough you can write not a single trigger word and you are banned, like what happened to Hai a year ago. If you shotcall in the league chat which is pretty rare but some people do it then you are at a really high risk of getting banned if your apm is too fast",
                            "score": 0,
                            "author": "RavenFAILS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree that high rate (not even really \"spamming\", or maybe we should say Riot's idea of \"spamming\" seems very low) of typing can *also* trigger a ban/warning. \n\nHowever most infractions are simple filter hits.",
                                    "score": 1,
                                    "author": "basics"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "flagging \"clown\" and \"bad\" is more than a simple filter. They must have some sort of intent logic",
                            "score": -10,
                            "author": "Suburan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You didn't get the warning for those two words mate",
                                    "score": 2,
                                    "author": "Lulullaby_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "okay, then what did I get the warning for? full chat log is posted",
                                            "score": 1,
                                            "author": "Suburan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[See my other comment](https://www.reddit.com/r/leagueoflegends/comments/147zauq/how_heavily_are_player_reports_weighted_vs/jo0t20n/)",
                                                    "score": 2,
                                                    "author": "Lulullaby_"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Must have should have",
                                    "score": -1,
                                    "author": "ponterik"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This argument keeps coming back yet these are very different issues and can't be enforced the same way.",
                    "score": 2,
                    "author": "Kalienor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a period a year or so ago where I was reporting everyone after the game no matter what because I'm absolute human garbage and the amount of confirmations I was getting about people being reprimanded made me think it was just giving me fake messages. I'd regularly play 4-5 games and log into 5-10 messages the next day.",
            "score": 21,
            "author": "GeorgySniper",
            "replies": [
                {
                    "level": 1,
                    "comment": "it’s defo just bullshit, or players you played with before that eventually get banned that didn’t say anything in your game",
                    "score": 6,
                    "author": "NoFeey"
                },
                {
                    "level": 1,
                    "comment": "It was bugged, basically showing you the same notification over and over, just like honor changes (at least according to someone who is \"known\" to exploit the client in twitter)",
                    "score": 4,
                    "author": "-SNST-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "the ban bot provably thought the \"fuck\" was also used as a direct insult so it triggered the ban",
            "score": 3,
            "author": "aj95_10",
            "replies": [
                {
                    "level": 1,
                    "comment": "i got flagged for saying that i was dumb when i did a missplay",
                    "score": 3,
                    "author": "Avavago"
                }
            ]
        },
        {
            "level": 0,
            "comment": "With how many of these I get now a days it's making me thing either noone else is reporting people or I'm somehow immune.\n\nI don't say anything bad but with the frequency of punishments you'd think you could get banned for feeding or saying normal things like _stfu and we can win_ followed by muting all",
            "score": 2,
            "author": "dentastic"
        },
        {
            "level": 0,
            "comment": "Chat detection is automated and doesnt take context into consideration, just saying any of fuck/fool/clown/bad is enough to get a restriction and/or ban.",
            "score": 2,
            "author": "Torkl7"
        },
        {
            "level": 0,
            "comment": "I’m never turning chat on again. Any game that has buggy AI and ability to brigade report for flagging = fuck no",
            "score": 2,
            "author": "Anarchontologist"
        },
        {
            "level": 0,
            "comment": "I played kayle top into a riven smurf in silver and got dove over and over and got a two week ban for my trouble.  The system us busted.",
            "score": 2,
            "author": "thegoodcat1"
        },
        {
            "level": 0,
            "comment": "I will be honest I have been restricted like 10 times since the system came out, but last time and I swear, many of you will not believe me, but the system literally restricted me again because I typed the equivalent of \"For fucksake Malphite can you fucking ult\" in my language (it isn't worse than that in my language).\n\nMaybe it still isn't something that shouldnt be said but I thought that it was ridiculous and was about to lose my shit after I got a notification that I got chat restricted (Again) after barely speaking this last week but I wasn't restricted after all and that was the buggy ass client showing me for some reason all my logs from last year lol.\n\nCopypaste from a recent post about the chat that someone deleted, but I guess that it's pretty much automated since my last chat restriction was as I said, asking for my top to engage.",
            "score": -2,
            "author": "Hoshiimaru",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; \"For fucksake Malphite can you fucking ult\" \n\nWhat if malphite cannot, in fact, ult? Ableism is a serious problem! Maybe they only have one finger.",
                    "score": -3,
                    "author": "LongFluffyDragon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remove the chat all together. Or the game. Or the company at this point.",
            "score": -1,
            "author": "classteen"
        },
        {
            "level": 0,
            "comment": "I think auto bot react only for hard flame.",
            "score": 1,
            "author": "Justiqt"
        },
        {
            "level": 0,
            "comment": "Last Night I logged in for some ARAM with Friends and got a total of 7 or 8 Warnings/Chat Restrictions/whatever, most of them over several Months old, only one of them recent. More often than not it just goes for the automated System. In my Experience simply chatting a lot or saying something that your Team might find offensive enough to report you for usually leads to some Punishment.",
            "score": 1,
            "author": "Unknown_Warrior43"
        },
        {
            "level": 0,
            "comment": "I get pops and I don't even remember if the last game even required an report. \n\nI don't know if its because I have higher standard for whats toxic now or if I just don't care. \n\nFor the record, I don't see toxic message in your chat.\n\nI also never got any sort of warning aside 1-2 afk warning when my laptop disconnected.",
            "score": 1,
            "author": "UnhappyDeparture5202"
        },
        {
            "level": 0,
            "comment": "I get the pop-up and I don't report",
            "score": 1,
            "author": "fbgrimfate"
        },
        {
            "level": 0,
            "comment": "I got warned for 2 game logs. Both I asked my jungler if their room temperate and iq were the same number. I get people have bad games but forcing a gank mud when your asol is oom and in an easy asol matchup only to got 0 for 2 then doing into again is stupid\n\n2nd game my jungler just pissed me with his less stupid play\n\nIf riot doesn’t want us to flame when people make stupid ass plays that common sense should tell you not to make them raise the fucking requirements for ranked",
            "score": -3,
            "author": "ratzy88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeahh, no: that's the sort of toxic attitude this community should get rid of.\n\nIn both cases the warning was correct, you flamed a teammate purely because they did a play you didn't agree with.\n\nLeague's macro is an insanely complex game, and it is very normal that players have different opinions on what is the correct/best one. And this discrepancy will only increase the lower the elo.\n\nOn top of that you should keep in mind you are matched with players of similar skill level. They will make mistakes, you will make mistakes.\n\nIt is not your place, your job, your right ot whatever to flame them for making those mistake.\n\nThe problem is introspection is hard, it's easy to blame allies for making mistakes and blaming them for your inability to climb/win games. It's much harder to look for your own mistakes, and more importantly your own lack of abusing the enemies mistake. Because those are also people of similar skill, making the same amount of mistakes.\n\nAnd yes it's frustrating that a decent amount of games will be decided just by #mistakes your team &lt;&gt; #mistakes enemy team, regardless of how you play.\n\n\nBut I never understand the point of flaming someone for a \"mistake\", and I deliberately quote it, since it's you thinking they made a mistake. They likely think it's the correct play. It's just shitty behavior to flame people.",
                    "score": 6,
                    "author": "gjerdsen"
                }
            ]
        }
    ]
}