{
    "id": "148h594",
    "score": 0,
    "title": "How high can I climb with shitty CS?",
    "author": "Dr_Kee",
    "date": 1686667702.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/148h594",
    "media_urls": [
        "https://www.reddit.com/r/leagueoflegends/comments/148h594/how_high_can_i_climb_with_shitty_cs/"
    ],
    "other_urls": [
        "https://op.gg)",
        "https://www.op.gg/summoners/na/Dr%20Kee](https://www.op.gg/summoners/na/Dr%20Kee)"
    ],
    "postText": "Curious about thoughts on this. I'm a bronze/silver player that mainly plays Syndra / Veigar / Viktor, though I'm proficient on Akali, Zed, Karthus (mid), Azir, Malzahar also.\n\nI think I generally do pretty well in lane, esp on Syndra and can snowball pretty well from there. Issue is...I just can't CS to save my life....I can't break the 6 cs/m most of the time (partly because my style involves a LOT of roaming).\n\nI know advice would be to go into practice tool, but I just don't have the time (I'm working adult).\n\nMy question is how high do you think I can climb without improving CS?\n\n[op.gg](https://op.gg) for reference: [https://www.op.gg/summoners/na/Dr%20Kee](https://www.op.gg/summoners/na/Dr%20Kee)\n\nEdit: To clarify, I don't have too many issues with CS in lane, nor do I roam that much during laning phase. My CS drops off significantly when I roam in mid-game because I prioritize joining teamfights over side laning since I'm immobile and feel I can impact the game more in teamfights (since I'm low elo where everyone is non-stop fighting). Would appreciate tips for low elo. Or any tricks in sidelane to get more value out of it I guess?",
    "comments": [
        {
            "level": 0,
            "comment": "I mean if you can't CS well I can't really think of any worse champ to play than viktor and veigar... \n\nAlso those are not roaming champ. Roaming is cool but you gotta time it so you don't loose CS, usually by slowpushing and crashing a big wave. Most likely it's decision making hurting your cs, not mechanics.\n\nI'd say try to only focus on csing when playing mages and see if you can get around 8cs/m. If you can't then try assassins (zed with hydra maybe ?)",
            "score": 20,
            "author": "YogurtBatmanSwag",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I agree it's definitely decision making a lot of the time. I also don't roam during laning phase and can CS pretty well. It's mostly in the mid-game where I prioritize teamfights that my CS starts to drop significantly. Copying a scenario from one of my other replies. Curious how you would approach this? \n\n&amp;#x200B;\n\n&gt;Say I'm a fed Syndra with a bounty and tier 1 turrets are down. There's no objective coming up.  \n&gt;  \n&gt;There's a fat wave coming into my bot tier 2, but as I walk towards it from base, I see my overextended ADC / Sup (who are both slightly behind enemy bot duo) about to be collapsed on by the fed enemy jungler and bot duo in mid lane.  \n&gt;  \n&gt;For sake of argument, say I'm 6/0/1, my ADC is 2/4/2, my sup is 1/5/3. Enemy ADC is 3/1/2, Sup is 0/3/6, and Jungler is 5/2/1 (and both top laners are jerking off in top lane / my jungler is dead)  \n&gt;  \n&gt;In this case, should I run mid to try and turn around the ensuing skirmish to get my bot duo back in the game, or just let them die and run bot for the large wave?",
                    "score": 1,
                    "author": "Dr_Kee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let them die. They're probably worth less than a regular kill while you joining that skirmish puts you at risk of giving shutdown money.\n\nYour job is not to babysit them. Stop reacting to the map and build your own play..",
                            "score": 1,
                            "author": "Varlane"
                        },
                        {
                            "level": 2,
                            "comment": "You want to play towards your carry, so if you're a fed lategame syndra, that's yourself. When that kind of scenario unfolds, just remember \"Dip the inter\". Stay alive, gobble ressources and go for low risk high rewards plays. With that said...\n\nThe main variable in lategame is objectives. If you don't have tp and you're strong, you wanna play on the side of the objective. In that scenario if your team dying means the ennemies taking baron, you going bot is int if you don't know where the ennemies are. If there is no obj up in the next 1 min and your teamates get caught, it's not a big deal and you should just catch waves and protect towers if you can.\n\nIf you play towards an objective and you make a catch, spam ping the objective. In low elo, people are afraid of baron and let games run for way too long. If you can get your team to go for it when 4v5, or when you see the whole ennemy team chasing someone on the opposite side of the map, that's how you close games with your early game lead.\n\nIf you get 1-2 kills, there is no obj and you have waves, you can also spam ping a tower.\n\nTLDR : Play around objectives, push ahead of their spawn and group when they're spawning. When there are no obj, stay alive, get xp and don't get baited by int.\n\nBasically, try to be proactive instead of reactive.",
                            "score": 1,
                            "author": "YogurtBatmanSwag"
                        },
                        {
                            "level": 2,
                            "comment": "Roaming is a HUGE part of your play style but you *don't roam during laning phase*? \n\nWhat do you think roaming is?",
                            "score": 1,
                            "author": "CoitusEnthusiast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry, maybe that's not the right phrase. I meant in the mid-game, rather than sidelane and farm, I tend to prioritize roaming around to join teamfights / play for picks.",
                                    "score": 1,
                                    "author": "Dr_Kee"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You don't need to have 10 cs per min to win games. The important part is to not miss cs that you should get for free.",
            "score": 7,
            "author": "katsuatis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly, the goal is to have more ressource (gold and xp) than your opponent if 70 cs at 10min but your opponent has 45qm it means you kept your lead. The next step is to translate the lead into what wins you the game (objectives or another wincon which usually the most snowblly champ of the team)",
                    "score": 3,
                    "author": "7xNero7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only way to improve is practice.  If your time is that limited instead of playing one of those games a night spend time in the tool last hitting.",
            "score": 5,
            "author": "CorruptDictator"
        },
        {
            "level": 0,
            "comment": "Basically, the better you are at the basics, the easier it'll be to climb. Farming is one of the basics. In order to climb high, you'd have to be insanely good in pretty much every other category, because bad cs means you're depriving yourself of your main source of exp and gold. If your mechanics and macro are in the top of the top you'll probably still be able to go pretty high, but it's very likely if you feel like you only mostly do okay in lane at the elo you're at now, you're not gonna be able to climb past gold.",
            "score": 4,
            "author": "CityofOrphans"
        },
        {
            "level": 0,
            "comment": "easiest way is to play support",
            "score": 3,
            "author": "yastie"
        },
        {
            "level": 0,
            "comment": "i mean if you roam and dont farm you are doing somethign wrong because you only roam when you push in the wave or one shot the wave and really how can it be so hard farming when you one shot a wave with the first complete item at 9/10min mark",
            "score": 2,
            "author": "Pretend-Newspaper-86"
        },
        {
            "level": 0,
            "comment": "Switch to support, you don't need CS there",
            "score": 2,
            "author": "TrulyPositivePotato"
        },
        {
            "level": 0,
            "comment": "Be good at macro, learn support and jungke. But if you’re bronze player there’s probably no hope for you anyway. Just enjoy the game at that point",
            "score": 1,
            "author": "iH8RedditUsers"
        },
        {
            "level": 0,
            "comment": "If you're into heavy roaming, champs like syndra and Viktor probably aren't the best to play. Having said that, if you're having trouble with getting high cs numbers, you should break down where you're losing cs exactly. Each game take a look at your cs numbers at 10, 20, and 30 min. If you notice you're doing well in lane, like 70+ cs at 10 min, but falling off the longer the games go on, like 150 cs at 30 min, then your problem is probably not catching enough side lanes. In mid game, your game plan should to, when you base, look at all 3 wave states and think to yourself, \"which ones are pushing, which ones are open for me to go, which ones can I push before the next objective comes up?\". You can also do a little mini game where you challenge yourself to have 200+ cs at 30 min.",
            "score": 1,
            "author": "Infinity_tk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey thanks for the advice. I unfortunately am just really bad at roaming champions. When I say I roam a lot, it's in mid-game that I roam, not during laning phase. \n\nI definitely miss the bulk of my CS during mid-to-late game. That's because I'm constantly joining teamfights, which I've found a lot of success in during my climb so far this season. \n\nI know the advice is to try and catch side lanes, but two issues with this: (1) in my elo, people CONSTANTLY fight, and since I'm often the one ahead, I feel pressured to join these fights since I have the resources and can carry. (2) as an immobile mage, I find sidelanes to be super dangerous, and I don't want to waste too much money on buying wards to ward the jungle. \n\nWould love any thoughts here.",
                    "score": 1,
                    "author": "Dr_Kee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree 100%, with how much people are fighting in lower elo, unless you're a hard 1v5 carry champ, it's likely better to have lower cs numbers vs in higher elos, which have more structure. Of course this doesn't mean having something like 5cs/m is okay, you should try to aim for roughly 7cs/m. Another thing is knowing which fights to take and which not to take. Ideally you only want to be fighting at drake, baron, or if they're pushing your base. I'm not saying don't join every fight, but if you don't see a point to it, it might be better to just leave it alone. \n\n\nLet's say you see a 2v2 skirmish popping up in mid, but there's a wave pushing your bot tier 2 and drake is up in a minute. In most cases, that 2v2 is not gonna end in much if you just leave it alone, even if someone dies they'll be back up before drake spawns, while that wave would end up as a bunch of wasted xp and gold, not to mention you should have the lane pushed for drake control. Side laning also doesn't have to be just sitting in lane and mindlessly pushing, especially if you don't have vision. If you anticipate a fight coming up, you can always just clear a wave, go to where you think the fight will happen, then rotate back if nothing occurs. \n\n\nAs for lack of vision, i agree that buying control wards constantly is a waste of gold, but buying them once in a while is good, especially when sidelaning. You can think of it as an investment into you not dying, preventing the enemy team from killing you while sidelaning and denying them gold. If you really have no vision, then all you can do is just push the wave past the middle of the lane, then go do something else until it's pushing back to you. \n\n\nTLDR, you can think of midgame as a cycle between catch side wave, go see what's going on elsewhere, go back to sidewave, with recalls interspersed. Joining a pointless fight is generally not a good idea, and your teammates might actually play more safely if they see you're not there to back them up. Look at the minimap to see where enemies are before pushing a side lane all the way up, and get some vision down to keep you safer. If you have no idea where the enemy is, just clear the lane to the halfway point and leave.\n\n\nLet me know if anything seems unclear!",
                            "score": 1,
                            "author": "Infinity_tk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks the example is helpful! Didn't really consider that teammates would play safer without me there, but that makes sense. \n\nIf you don't mind, two questions:\n\n1) If I'm losing lane and my opponent has shoved the wave into my tower and is beginning to roam bot. I ping, but my bot is about to secure a kill under enemy turret and doesn't listen, what should I do? This is assuming I'm not THAT far behind and know I can impact the fight if I follow and potentially get my bot fed, but I'll lose a bunch of CS for it. \n\n2) In the scenario you laid out, say there's no upcoming objective and the 2v2 skirmish is about to turn into 3v2 because my overextended bot duo is about to get ganked by the enemy jungler and is ignoring pings. Again, assuming I'm fed and in a position to impact the team fight (but also assuming there's a massive wave approaching my bot tier 2), should I try to save my duo or go for the bot wave?",
                                    "score": 1,
                                    "author": "Dr_Kee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For both these questions, there's no one singular answer and it depends a lot on the context behind it. \n\n\n1. Every decision should be made around what brings you closer to winning the game. If you know there's like an 80% chance that if you get your bot fed you'll end up winning the game, then go for it. Same with the enemy roam, if you don't think it has a high percentage of working out, just ping best you can and let them take the coin flip on if it's a waste of time or not. Champs also play a large factor. Do you have lots of utility, to the point that even if you're behind your laner you can impact a fight? Then it might be worth it to go countergank as you wouldn't gain as much from the wave as your enemy laner would lose from a failed gank. Are you a hyperscaler, and can do massive damage in teamfights if you have enough items and levels? Then it might be worth it to take the xp and gold from the wave, and just ping aggressively and pray. A lissandra might go gank, because her cc is still valuable when behind, but a Viktor might stay behind and stack his passive to be relevant later on. \n\n\n\n2. Depends on who your botlane is. Ezreal for example can overextend because he has great escape with his e. This is where game knowledge comes in. Do you think your botlane can make it to safety with the adc alive? As long as your adc can survive, it's not too bad if your support dies. At the same time, how do you think that fight ends up? Will it be a clean 2 kills, or does your botlane manage to get one or two on the way out? A kill is worth roughly 15cs in gold, so if you leave that big bot wave will you manage to have more than a kill worth of impact in the skirmish? \n\n\nHopefully this answers your questions somewhat satisfyingly lol.",
                                            "score": 1,
                                            "author": "Infinity_tk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you! Yeah totally understand it's a cost-benefit analysis at each point in time and there's a million variables. Was more wondering if there are rules of thumb that people follow in these situations where the risk-reward is ambiguous...like in scenario 1 if I'm playing Syndra, who's decent at all phases of the game and has the utility to make an impact, or in scenario 2 if it's guaranteed my bot duo will die, but I'll lose 2 stacked waves.\n\nI suppose it does all come down to game knowledge though and perhaps I just don't have the intuition yet to make the right calls during these ambiguous moments. \n\nAnyway, really appreciate your time :)",
                                                    "score": 1,
                                                    "author": "Dr_Kee",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's exactly what I was going to say haha, the more you play and get to know about the game, the more experience you'll get with knowing what calls to make in ambiguous moments. I tend to not like cookie cutter solutions in league, but if I had to give one, it would be to play around your carry, because that's the best chance you have of winning. That is to say, if your bot lane is 6-0 and has a 700g bounty, forget the stacked waves you better haul your ass over to mid. Of course, knowing who your carry is at all aspects of the game takes game knowledge lol. \n\n\nHappy to help!",
                                                            "score": 1,
                                                            "author": "Infinity_tk"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You need to refrain from joining useless fights for two reasons :\n\n\\- It's bas\n\n\\- It actually emboldens them to do more of them\n\n&amp;#x200B;\n\nAnd buy the wards.",
                            "score": 1,
                            "author": "Varlane"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I know advice would be to go into practice tool, but I just don't have the time (I'm working adult)\n\nthats not an excuse. dont play on the rift and go to practice tool. it will be less frustating in the long run",
            "score": 1,
            "author": "HairyKraken"
        },
        {
            "level": 0,
            "comment": "Cs is obviously always good but it differs in importance between champions.\n\nOn assassins it's common to have less CS because of roaming and snowballing off kills is their playstyle.\n\nHowever when you mention syndra viktor veigar these are champions that should have high cs to be effective, they have expensive items that are vital for them to be useful and as late game champions they need to maintain relevance through csing since they can't reliably snowball like asasssins,  I mean in low elo you can snowball off anything but in higher elos you would need consistency and that means high csing, I would review your games to see why you are not hitting high cs, is it poor wave management? Last hitting? Waveclear?\n\nIf you roam try to push the wave before, and remembers that roaming is always a risk, staying in lane getting the wave and plates is guranteed value, if a roam fails you can lose the game from that.",
            "score": 1,
            "author": "itaicool",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I always push the wave before roaming. I think part of the bias here is so far, I've gotten really lucky this season with easy enemy games, and I've been able to get very ahead early on, so when mid-game comes, I prioritize sticking close to my other carries to try to teamfight as much as possible.\n\nI could go to sidelanes more, but I feel like I would be putting myself at risk as an immobile mage, and in low elo, teamfights constantly happen, which is where I feel like I can add the most value. \n\nIn other words, going to a sidelane to catch 2-3 waves while risking being collapsed on feels like worse risk-reward than to join my constantly fighting team to secure picks and push for objectives after that. Is this wrong even considering the elo difference?",
                    "score": 1,
                    "author": "Dr_Kee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it's normal to drop a bit of cs during the midgame especially as a mage because of your botlane moving mid and mages not being great sidelane, also you do want to group for important objectives (General role I like to do is during important objectives priortize being with my team more, but with no objective I tend to not join fights unless it's massively advantgeous to us e.g enemy caught out of position/number advantage etc, random fights midlane like an aram with no objectives are useless)\n\nThat is where tp can also come in handy as it allow you to stay sidelane and farm while still being able to quickly join your team, you should be running tp on the likes of syndra viktor veigar.\n\nAlso for farming in the midgame in sidelane as a mage it changes depending on the game, the more your team is ahead the safer it is, the less the risker it is, vision is crucial to be able to push to a certain point it's very risky without vision and if the enemy team is ahead you have less space to move far from your turret (Also if they have assassins it's extra dangerous) what I like to do is make an imaginry line from where my teammates are and not push farther than that, it also helps to track enemies so if you see certain enemies on the other side of the map it helps to know how risky it is, with all enemies missing it becomes more risky, also if the wave is closer to your turret it's safer than farther away obviously, generally you just want to clear waves fast and move back with your team, you don't want to stay sidelane for long but it is important to catch the waves and fix them so you don't fall behind in the long run but as a mage you are better off teamfighting with your team, so catch waves quickly and regroup but don't perma group/aram which is very common in lower elos\n\nAlso you can learn alot of great information about all these concepts and more from coach curtis channel, he is a great midlaner and a coach that makes eductional videos.",
                            "score": 1,
                            "author": "itaicool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks so much for the awesome tips!\n\nOne scenario I'm wondering about that happens a good amount. Say I'm a fed Syndra with a bounty and tier 1 turrets are down. There's no objective coming up.\n\nThere's a fat wave coming into my bot tier 2, but as I walk towards it from base, I see my overextended ADC / Sup (who are both slightly behind enemy bot duo) about to be collapsed on by the fed enemy jungler and bot duo in mid lane.\n\nFor sake of argument, say I'm 6/0/1, my ADC is 2/4/2, my sup is 1/5/3. Enemy ADC is 3/1/2, Sup is 0/3/6, and Jungler is 5/2/1 (and both top laners are jerking off in top lane / my jungler is dead)\n\nIn this case, should I run mid to try and turn around the ensuing skirmish to get my bot duo back in the game, or just let them die and run bot for the large wave?",
                                    "score": 1,
                                    "author": "Dr_Kee"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you want to roam make sure you follow these steps- push the wave to tower before roaming, only back on incoming cannon waves (push wave 2 and recall as wave 3 is spawning), and stop your roam if you see it’s not going to work. If you’re halfway up river and the top laner starts to back, don’t commit, return to mid and farm. You can easily push waves with your mains. Don’t waste cs with poorly timed roams, plan it around farming.",
            "score": 1,
            "author": "ToughCurrent8487"
        },
        {
            "level": 0,
            "comment": "Since you play control mages, farm is generally a bit more important for those champs. Also you really don't want to roam too much on these champs compared to for example assassin mids. You should of course always look if your jungler needs help in river, but full on roams to another lane are often not that good with control mages since they normally have low mobility. Also before you go for a roam you pretty much always want to push your wave first so you have a small time window till the next wave hits, cause you want to loose as little cs as possible. You don't need 10cs per minute (in lower elos it's often pretty much impossible since there is so much more fighting etc.), but I would recommend trying to get at least 6,5 cs per minute for now and if you should get to gold then maybe try to improve it to 7.",
            "score": 1,
            "author": "Slizery"
        },
        {
            "level": 0,
            "comment": "Play malzahar?\n\nAlso your morello buys are completely illegal",
            "score": 1,
            "author": "imavillagepeople2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the feedback. At what point is Morello worth? I buy it sometimes when I'm really ahead already for the flat pen and stats. I'll also buy it if the opponent is a bruiser with lifesteal items or an ADC with bloodthirster. Is that still not worth buying?",
                    "score": 1,
                    "author": "Dr_Kee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Morello doesn't give any additional healing reduction so you are paying 2200 gold for 60 AP and 10 magic pen \n\nLarge rod + Hextech alternater gives more damage, doesn't put your build 2200 gold behind and is only 700 gold away from shadowflame. That is *with* oblivion orb. \n\nYou only finish morello if u absolutely need the full item right now before a big fight or when u are going into late game to save inventory space",
                            "score": 1,
                            "author": "imavillagepeople2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see. Thanks for this :)",
                                    "score": 1,
                                    "author": "Dr_Kee"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hard to tell exactly when but once people notice that there's a minimap and your roaming doesn't work as well as before, you'll lose more and more games due to being behind in xp and gold compared to the opposing mid. prolly high silver or low gold people start looking more on the map (just guesstimating).\n\nthere's no way around learning how to cs properly if you wanna keep winning games in the long run. at least if you don't wanna switch to support. you actually play some midlaners that can easily waveclear and farm with abilities very early on, so I don't see how someone wouldn't be able to learn farming with them at least somewhat decent.\n\nalso you should consider that your wave management and roam timers are lacking. maybe you last hit decent but you roam at weird timings while losing tons of cs. it's possible to roam a lot AND have high cs.",
            "score": 1,
            "author": "Hased"
        },
        {
            "level": 0,
            "comment": "its not your \"style\"  ur macro is just bad. always remember to push out the wave b4 roaming, and catch the wave b4 it crashes into ur tower",
            "score": 1,
            "author": "JVKA"
        },
        {
            "level": 0,
            "comment": "Play support or jungle. Supports seldom need to CS and their items even punish you for excessively doing so.\n\nJungle requires CS but it's more about clear speed than timing last hits.",
            "score": 1,
            "author": "Clbull"
        },
        {
            "level": 0,
            "comment": "Considering you’ve been bronze silver for the past 5 years i’d say you aren’t climbing any more. Accept your fate. On the bright side though you’ll move to gold when they change the ranks.",
            "score": 1,
            "author": "panderian1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha, that's a bit misleading because I barely played last season, and otherwise, I've been Silver (tanked my winrate in 2020 / 2021 trying to play too many different champs / trying to learn azir...) I'm more focused now on my mains (Syndra, Veigar, Viktor).  \n\nI ended Silver 1 last season on my other account with positive winrate, so I think I can still get to Gold. I'm currently B1 but have a 73% winrate this season through 44 games.",
                    "score": 1,
                    "author": "Dr_Kee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you really want to climb just one trick a champ. Not 2 or 3 just one and dodge if its banned or picked. Learn the “counters”",
                            "score": 1,
                            "author": "panderian1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "if u katarina one trick with perfect mechanics u can get to diamond with 4cs/min",
            "score": 1,
            "author": "Yloo"
        },
        {
            "level": 0,
            "comment": "Probs plat/Diamond, I'm plat 1 and frequently see people with 6cs/min",
            "score": 1,
            "author": "Financial-Celery2300"
        },
        {
            "level": 0,
            "comment": "you can easily climb to plat with that cs if you play well. I'm currently plat 2 climbing as a Jhin main and Kai'sa as a secondary and I average between 6-8 cs a min (mostly 7-8 when winning hard).",
            "score": 1,
            "author": "Weppih"
        },
        {
            "level": 0,
            "comment": "i suggest downloading an app like porofessor, when you can see your cs per min whilst you play it helps u keep track of when u should farm",
            "score": 1,
            "author": "Ancient_Type_2880"
        },
        {
            "level": 0,
            "comment": "I average 6.2CS across most of my champs and I've still climbed pretty high.",
            "score": 0,
            "author": "poikond"
        }
    ]
}