{
    "id": "148nmwl",
    "score": 0,
    "title": "Can I be demoted from Silver IV to Bronze I after being promoted to Silver IV recently?",
    "author": "FootballEmotional743",
    "date": 1686684956.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/148nmwl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just climbed from Bronze IV to Silver IV and I’m wondering if I can be demoted down again if I lose the current LP I have gained",
    "comments": [
        {
            "level": 0,
            "comment": "I believe you get a demotion shield, it lasts a while even when sitting at 0 LP. You can see it on your profile when you hover over the Solo/Duo. If you don't have demotion shield then you'll demote after a couple lost games on 0 LP. Frankly it's much harder to demote than promote, especially if your MMR is higher than the rank below it.",
            "score": 10,
            "author": "112thThrowaway"
        },
        {
            "level": 0,
            "comment": "I was demoted twice from gold, you get about 5-7 games of protection at zero LP, then the shield will turn red, next loss sends you back.\n\nInterestingly, I guess the game feels bad once you do get demoted because I climbed right back up same day both times.\n\nIt's not great tho because losing while not actually losing LP hurts your MMR and will make gains going forward tougher. I often times get about 20 for a win and lose 27 for a loss now so... It's rough lol. I have made peace with being eternally gold 4. (Unless the new ranking system moves me)",
            "score": 2,
            "author": "Dawgbowl"
        },
        {
            "level": 0,
            "comment": "You can stay a few matches with 0 LP (not sure how many) but if you keep losing then yes, you get back to Bronze.",
            "score": 1,
            "author": "Hungry_Yak633"
        },
        {
            "level": 0,
            "comment": "I once got promoted to Plat 4 1 LP. Lost 6 games in a row and still didn't get demoted, so no, you probably won't get demoted.",
            "score": 1,
            "author": "nhansieu1"
        }
    ]
}