{
    "id": "148vfnj",
    "score": 1,
    "title": "Thoughts on Rumble live changes?",
    "author": "DigBick6996",
    "date": 1686707343.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/148vfnj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm Rumble mid main and tried it on my first game, felt weird because of the 150 overheat, before,  my play revolves around being overheated asap to burst enemies and surprise them with the damage. I don't know what build path to take yet. Tried Riftmaker, felt weak imo, maybe because I play to burst. Overheat to 4 secs was nice though. \n\nAny thoughts on where to properly maintain heat to overheat? 80 maybe?\n\nElectrocute Rumble is probably dead for me T-T",
    "comments": [
        {
            "level": 0,
            "comment": "This basically force rumble player to build either more cdr and hp/res to play him as a semi bruiser extender \n\nFun build would be riftmaker plus rylais and horizon focus and cosmic drive plus demonic",
            "score": 3,
            "author": "Dongster1995"
        },
        {
            "level": 0,
            "comment": "Entire change basically aimed towards nerfing Rumble mid and buffing him top. Less burst damage but more damage vs frontliners",
            "score": 3,
            "author": "EinSabo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am wondering, is the max health bonus for the enemy or your max health?",
                    "score": 1,
                    "author": "DigBick6996",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it's enemy max health.\n\nYou can easly check that. If max HP ratio is from your max HP, exact value is shown (as it can be easily calculated). It also has a green heart icon indicating source stat.\n\n If it is enemy max HP, exact value cannot be shown, as it depends on the enemy.\n\nRumble has enemy max HP ratio on flamespitter and self max HP on shield. You can see how their descriptions differ.",
                            "score": 2,
                            "author": "Dragonatis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love the changes as a top Rumble player. One thing about Rumble is historically once the enemy top builds a bit of MR and/or reaches first item he basically loses so much of his dueling potential unless hes super fed. The changes allow him to actually better duel top laners if your kiting is on point which is incredibly useful for building and maintaining leads in top lane.\n\nIncreased ult CD is a nerf that I like. While I loved having the equalizer on an obscenely short CD the new CD makes you think more about your ults and nerfs a degenerate aspect of his gameplay. At the same time all the haste in the game sitll allows him to have his ult in basically every situation he needs it.\n\nIt's harder for him to one shot squishies flat (he can still do it but it requires more skill) but he has gained the ability to go more toe to toe with health stackers and frontline characters. He feels like an amazing bruiser/mage hybrid I love the changes. However if you're a fan of his current playstyle of mid one shotting you might not be a fan of this update and find it awkward.",
            "score": 2,
            "author": "accf124",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hate it tbh. All NH build I played is defeat while all RM build is won.  6 games, won almost all lane games but rumble burst falls apart in mid to late game.",
                    "score": 1,
                    "author": "DigBick6996"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Build wise probably nothing changes. Maybe some random nashor's tooth builds, since now you get shitload of attack speed from overheating. He's just slightly worse early game against squishies, due to stat nerf and Q base.",
            "score": 1,
            "author": "Wexem1"
        },
        {
            "level": 0,
            "comment": "They said it's more aimed for top than mid/jg.",
            "score": 1,
            "author": "itaicool"
        },
        {
            "level": 0,
            "comment": "it looks interesting. i was thinking about playing him but i'm already learning two ap toplaners with kennen and azir, i don't know if i should have a third. i wonder since he's incentivized for longer fights if items like demonic become stronger on him",
            "score": 0,
            "author": "moody_P",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don' think that Azir should be played top. His weaknesses are too easily exploitable there. If I were you, I would drop Azir and go Rumble, as he is monster in good hands.",
                    "score": 2,
                    "author": "Dragonatis"
                }
            ]
        }
    ]
}