{
    "id": "1490mqz",
    "score": 0,
    "title": "Why don't we have a victorious skin vault/shop?",
    "author": "gaming_while_hungry",
    "date": 1686724769.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/1490mqz",
    "media_urls": [],
    "other_urls": [],
    "postText": "We all like victorious skins but we don't want a nice skin for a champ we wouldn't ever dare touch. With all the adjustments for skin vault/loot system, I think victorious skins should be placed in a system like the old gemstone shop. So instead of earning a skin, players earn a victorious token for a skin of their choice.\n\nLet me know your thoughts",
    "comments": [
        {
            "level": 0,
            "comment": "knowing riot they will release neo victorious skins at some point",
            "score": 5,
            "author": "Ok_Regular_9436"
        },
        {
            "level": 0,
            "comment": "Because at this point you wont be able to please the community with it , people who want the victorious skins to be a symbol/memento of you playing back in that season vs people who just want that skin now.",
            "score": 3,
            "author": "backaroo121"
        },
        {
            "level": 0,
            "comment": "The early victorious skins were way harder to get.",
            "score": 7,
            "author": "BenefitNo2525",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wym? All you had to do was hit gold iirc",
                    "score": 1,
                    "author": "Potential_Example325"
                },
                {
                    "level": 1,
                    "comment": "No they were not. \n\nYou ether were there or you weren't, had little to do with skill. You played the game, got a duo to carry you maybe you didn't. \n\nIt is anti consumer to gate skins that way, it is done to create a false sense of urgency to climb.\n\nThere's a fucking term for it in the industry \"FEAR OF MISSING OUT\".\n\nBattlepasses, timed events, shit like that, it's to keep players in that game engaged constantly.  That's all it is. That's all it ever has been. And I hope my main NEVER gets a victorious skin cause I don't want to tell other mains of my champ who just play causally, sorry, you'll never get this skin to use cause \"fuck you\". No other reason. \n\nAnd anyone that wants to stop or gate people from that, are jerks. I'm saying it. There's no reason players shouldn't have an option to get any skin if they put in the TIME and effort.",
                    "score": -10,
                    "author": "Yordle_Commander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah spoken like someone totally clueless.\n\nS1 Gold was the 2nd highest division btw. Only the top 3% could make it which is less than nowadays Diamond IV.\n\nGold used to have decay aswell and wasnt just a participation pseudoreward.",
                            "score": 2,
                            "author": "BenefitNo2525",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "S1 my guy, Remind me what season we are again? But it doesn't matter.\n\nNo skin should be forever unobtainable in the digital market because accounts can't be sold, they can't be bought, physical things that are collectable are collectible because they can be traded, you aren't allowed to trade accounts. \n\nSo again, the only reason any of this exists is because Riot wants to keep you addicted to the grind. It's not to feel a sense of \"pride and accomplishment\". If you need that to feel like you didn't waste hundreds of hours climbing, you can look at a border or rank or icon. \n\nIf players put in the time and effort, they should be able to get any skin for any champion. No one should want to gate that.",
                                    "score": -4,
                                    "author": "Yordle_Commander",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then those older skins would still be gated to Master+ players as a reward and trash like you would still cry.",
                                            "score": 2,
                                            "author": "BenefitNo2525"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "People were also not as good back then. It's all relative",
                                    "score": -1,
                                    "author": "Potential_Example325"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;And anyone that wants to stop or gate people from that, are jerks.\n\nLet's imagine you are the best in the world in doing something. You are special thanks to it.\n\nNow imagine everyone starts playing like you. You are not special anymore.\n\nBy not giving old Victorious skins away, Riot is not taking away something from me. Something that I've earned and I don't want it taken from me.\n\nBeing a jerk =/= not wanting your things to lose value.\n\nIf this hurts people, so be it. Their idea of unvaulting skins would hurt me and people who don't want it. Therefore, one party will always be hurt. And I don't see a reason why it should be me.",
                            "score": 0,
                            "author": "Dragonatis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People who cant accept that some skins are and need to remain unavailable",
            "score": 3,
            "author": "Rex_Lapis_"
        },
        {
            "level": 0,
            "comment": "Victorious skins, unlike Mythic ones, are rewards.\n\nI have Victorious Morgana, for example. Reward for Gold in season 4. It is a proof that I have played back then and I was good enough to claim Gold (or was commited enough to play 200 games, if we want to use skins like Victorious Anivia as argument in a few years).\n\nIf Riot was to unvalut this skin, it would lose its whole meaning. Now, when I play this skin, enemy is \"Damn, he plays since season 4\". After unvault, they would be \"He plays either since S4 or claimed it last week\". Impressiveness disappears.\n\nI get your point, tho. Few years ago, I was Janna OTP and I really wanted Victorious skin for her. But I wanted it for its prestige and meaning. Things that would be lost during unvaulting. So I just dealt with the fact that it's impossible and moved on.",
            "score": 1,
            "author": "Dragonatis",
            "replies": [
                {
                    "level": 1,
                    "comment": "players honestly don't care how long you've been playing though, the interest was the skin just because they cant access it or have never seen it in-game. As slow as things are these days its very inefficient for riot to make skins every year that are barely ever going to be seen. Even if they don't unlock the old skins they need to update the current system, its outdated as fuck if they think giving people a reward they wont ever use makes sense. Where's the reward in that?",
                    "score": 0,
                    "author": "gaming_while_hungry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;players honestly don't care how long you've been playing though\n\nDunno, I'm pretty proud that I can consider myself veteran and tell people stories about an ancient past. Morg or Sivir skins are kinda proof of that.\n\n&amp;#x200B;\n\n&gt;they need to update the current system, its outdated as fuck if they think giving people a reward they wont ever use makes sense\n\nAnd here I agree. It's very hard for free skin to be better than paid one due to company resources allocation. I would also like to see another type of reward/skin that actually looks good enough to choose it over other skin that was designed to be so good that people spend money on it. Just like they revamped Crime City, High Noon or Prestige, they should also revamp Victorious.",
                            "score": 1,
                            "author": "Dragonatis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Weirdos will tell you something like \"I grinded 400000 games being hardstuck in silver to get that victorious skin so it should stay exclusive\"",
            "score": -5,
            "author": "shoyooo"
        },
        {
            "level": 0,
            "comment": "I thought you meant like, you hit gold. You can choose one of the older gold skins in exchange for a new one. I'm not ever going to use victorious anivia besides rolling her in aram",
            "score": 1,
            "author": "Potential_Example325",
            "replies": [
                {
                    "level": 1,
                    "comment": "not to swap for a skin you already own, but you have a token to at least choose something you may actually use. And same I'm a jungler, I'm literally never gonna play anivia outside of aram",
                    "score": 2,
                    "author": "gaming_while_hungry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah idk why they even chose anivia. They usually pick someone meta relevant. I'd imagine zeri or something lol",
                            "score": 1,
                            "author": "Potential_Example325",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The promise of special skins going to relevant champs probably went out the window when they gave an \"ultimate\" to a brand new champ with zero justification for doing so.  Truly disappointing.",
                                    "score": 1,
                                    "author": "Pika310"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They could do that and make like special editions for the ones who got the skin the year it came out and not after",
            "score": 1,
            "author": "JumpscareRodent"
        },
        {
            "level": 0,
            "comment": "Wildrift already has it",
            "score": -2,
            "author": "AeryaCosplay",
            "replies": [
                {
                    "level": 1,
                    "comment": "wow I dont play that, I had no idea. I really wish they wouldn't continue to screw over the original game then",
                    "score": 0,
                    "author": "gaming_while_hungry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wdym screwed over. You had to hit gold in every season. The people that hit gold back in the day would just get screwed lol.",
                            "score": 5,
                            "author": "QuackologistExpert",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how often are you seeing any of those skins? not much different from the me shops situation",
                                    "score": -1,
                                    "author": "gaming_while_hungry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not that often, but that makes them special in a sense. The incentive to play ranked would just be 0 other than prestiege. I play for the prestiege and then master/gm chroma because i think that’s cool  but every one has their own motives to play\n(Edit: mistyped a word)",
                                            "score": 1,
                                            "author": "QuackologistExpert",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "because people can choose their ranked reward, the incentive to play ranked would become 0? really? I think that's an awful assumption lol id assume it to be the polar opposite. \n\nthe current system is old and gate keeping skins we all want to enjoy just like the prestige skins used to be. honestly I was all for them gating prestige skins but now I'm like what's the point",
                                                    "score": 0,
                                                    "author": "gaming_while_hungry",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s not the point. They are legacy. Unfortunate if you didn’t play that season. Deal it it",
                                                            "score": 1,
                                                            "author": "QuackologistExpert"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Personally, I never see them. Literaly every champ that has Victorious skin, has better skins. Their prestigeness is the only thing that makes them special.",
                                            "score": 1,
                                            "author": "Dragonatis"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "WR has such a better system at getting Victorious skins (as well as just having better looking skins anyways), I don't see why they don't borrow from that for PC.",
            "score": -1,
            "author": "ScythXGaming"
        },
        {
            "level": 0,
            "comment": "I feel ya I’ve been craving victorious Morgana and Elise for years",
            "score": 0,
            "author": "LordMooMilk"
        }
    ]
}