{
    "id": "1491r3t",
    "score": 0,
    "title": "champ to learn how to play passively on support",
    "author": "larksonan",
    "date": 1686728939.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/1491r3t",
    "media_urls": [],
    "other_urls": [],
    "postText": " what character will help me get used to passive gaming? because I am main thresha I managed to climb from s2 to g1 in about 2 weeks but my problem is that I play too aggressively even enchantermi",
    "comments": [
        {
            "level": 0,
            "comment": "wtf you talking about, there is nothing like play passive or agro only, you need to recognise when you can or have to be proactive or reactive, sometimes you need to wait even when playing Nautilus for enemy and peel for your team other times you have to be the engage and flash nado even on Janna",
            "score": 11,
            "author": "Diskuter"
        },
        {
            "level": 0,
            "comment": "not a champ issue u gotta remind urself every game to play less aggro u probably play most ur games on autopilot which means u do the same shit every game cuz ur used to it. try to break that and think about what ur doing and why ur doing something",
            "score": 12,
            "author": "88EXE1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good point. League requires being mindful",
                    "score": 1,
                    "author": "L2Hiku"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Full agro al the time. Always look for openings to trad/poke. Make them pay for every cs.",
            "score": 3,
            "author": "punkblastoise"
        },
        {
            "level": 0,
            "comment": "There is no such thing as aggressive or passive players, there is simply good and bad, if you aren't capitalising on enemies mistakes cause you're \"a passive player\" that's just bad play, same goes the other way, if you're forcing bad engages because you are \"an aggressive player\", it's just bad play",
            "score": 3,
            "author": "Snoo-2046"
        },
        {
            "level": 0,
            "comment": "Better overly aggro then overly passive IMO. Would you rather be a Chad and perma fight or be a Bitch and let the Enemy run you over?",
            "score": 2,
            "author": "Unknown_Warrior43"
        },
        {
            "level": 0,
            "comment": "Just learn when you can be aggressive and when you need to be peel. General idea is if you’re adc is very fed as thresh you are just being disruption for them. Whether that means letting them walk forward to do some damage and lantern ins then back or just playing in a good range to peel for targets. Or sometimes you just need to step forward and try and catch people out etc. that’s the beauty of Thresh. He’s so versatile with his kit.",
            "score": 1,
            "author": "phieldworker"
        },
        {
            "level": 0,
            "comment": "Sona, nami, Janna. I'm sure I'm missing something but most enchanters are best at sitting back and being useful from behind the team. Sona is my #1 choice cus if you misstep at all you're basically insta dead. Zilean and sera would also probably be top picks too... And probably Milo, soraka, and Renata. Karma for honorable mention. Depends on her build and match up.",
            "score": -6,
            "author": "L2Hiku",
            "replies": [
                {
                    "level": 1,
                    "comment": "With all due respect if you are playing sona, and are not being a violence incarnate (as per any other enchanter to get max value out of the kit) you are playing her wrong (when lvls are low and your positioning is good, you can whittle the enemy down during the moments in which you cannot get oneshot and win lane) and also you can be a living bait for assassins ( crescendo W passive 25% atk + the fatigue -30%-40% atk tell me how much the assassin actually deals  +the conditioning rune)\n\nNote: the only time playing passively is good is when the enemy jungler/mid is around and yours isnt and when you are trying to freeze wave (but even then that is situational as you’d only do it when losing whilst while winning you’d be the wedge between the minion wave and the enemy team preventing them from garnering xp",
                    "score": 4,
                    "author": "Your_nightmare__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;With all due respect if you are playing sona, and are not being a violence incarnate you are playing her wrong\n\nWhen did we go back to Season 3?",
                            "score": -1,
                            "author": "Pika310",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "no i’m just saying enchanters have a suprising amount of early game damage that most dont properly use. With a decent amount of experience it is possible to deal damage without  being traded back.Without presence of mind it is possible to kill as sona both enemies healthbars with q’s + 1 basic auto alone (if repeated consistently) using your base mana pool and only that",
                                    "score": 3,
                                    "author": "Your_nightmare__"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}