{
    "id": "1492wj9",
    "score": 0,
    "title": "why is it possible to remake if all 5 players were connected and playing in the beginning",
    "author": "Dedemegadodooo",
    "date": 1686733320.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/1492wj9",
    "media_urls": [],
    "other_urls": [],
    "postText": "just played a game were all 5 of us were connected and playing in the beginning, we lost the lvl 1 invade and 1 of us left afterwards. then at 3 mins it was possible to remake and my team did it. why should that be possible?????",
    "comments": [
        {
            "level": 0,
            "comment": "Funny thing, it wasn't a remake (probably) \n\nTell me, in this invade that failed, the guy that disconnected played sussy and died right? \n\nIf this is what happened, it was the player abusing a deranking method by baiting his team into a remake vote that isn't actually a remake. You lose LP for it. But the client match history may still consider it a remake, but i am not sure about it. I know most external websites assume it was a remake, so if you check the players opgg you'll see a bunch of remakes and tjink nothing of it. \n\nIf it was an actual remake where no one died then idk, thats weird. If the invade happened before minute 1:00-1:20 then it is technically possible for a remake to still happen if someone afks, but if everyone was moving after 1:30 then I am not sure a true remake can happen by then",
            "score": 6,
            "author": "Doctor_Rambo",
            "replies": [
                {
                    "level": 1,
                    "comment": "was a remake no ff",
                    "score": 1,
                    "author": "Dedemegadodooo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What you wrote and your title doesnt make sense, if 1 of you left then it is not \"all 5 players\".",
            "score": 1,
            "author": "TheBald_Dude",
            "replies": [
                {
                    "level": 1,
                    "comment": "Try again",
                    "score": 2,
                    "author": "Aggressive-Front8435"
                },
                {
                    "level": 1,
                    "comment": "????\nall 5 were playing and connected IN THE BEGINNING!\n\nafter that some1 left",
                    "score": -1,
                    "author": "Dedemegadodooo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think if some1 leaves before 1 min or 1:30 and isn't back by 3 you can still remake or smth",
                            "score": 5,
                            "author": "AlreadyRiven"
                        },
                        {
                            "level": 2,
                            "comment": "hmmm, so i guess by begining OP means that all 5 logged into the game itself while i was assuming that the  begining of the game included a couple minutes too.\n\nEither way i think the rule makes sense, you could say that you can \"game the system\" but technically your friend that left is getting fked so it is not like everyone just leaves with no consequences.",
                            "score": 1,
                            "author": "TheBald_Dude"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because a means some one went for a drink after they picked their champ and then took so long they got popped for afk and the team remade even though the person came back late.\n\nOnce flagged I think it’s 1-3 minutes after they return that you can still pop for the remake even if they return",
            "score": 1,
            "author": "Electrical_Ad_1939"
        }
    ]
}