{
    "id": "149a9ux",
    "score": 19,
    "title": "LPL 2023 Summer - The most stacked ADC pool ever?",
    "author": "GeniusFromAbove",
    "date": 1686755185.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/149a9ux",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just wanted to have discussion based on ADC's currently playing in LPL. \n\n\nThere were stacked pools in the past, especially in LCK (Pray, Bang, Deft era, etc.) but when you see what kind of players the LPL currently have and in which form those players are, it's quite possible there never was a split or not even a tournament with a more stacked ADC pool. \n\n\nSo first of all you have:\n\n\nUzi and Ruler - 2 out of 3 (Deft being third) GOAT adc's in my book. While Uzi just came back to pro play, Ruler has been on an absolute tear lately. \n\n\nHaving 2 goat adc's in league yet none of them is (arguably) CURRENTLY the best performer? That player would be Elk in my opinion. Yet another chinese adc who is in form of his life proving all the doubters wrong. \n\n\nNext one is recently revitelized JackeyLove. I've been very critical of him in last couple of years, but this year and especially this summer split, he is playing extremely well (the best i've seen him play in a long time). He is also undoubtedly one of the adc's with the highest peaks as well. \n\n\nTalking about high peaks, there is also GALA. Incredible on hypercarries, a guy who had so many highlight plays throughout his career. \n\n\nMoving forward we have Light. As avid LPL watcher, i'm just waiting for his \"Elk moment\" as well. This guy is \"the mister consistent\" (bad timing of the post given his TES series, but well, everyone can have a bad game). He has been so god damn good for multiple splits in a row now and even on some very questionable rosters. He is definitely up there with the rest of the names here. \n\n\nThat's 6 god tier ADC's so far, but we aren't done yet. \n\n\nThe guy I wanna talk about next is Photic. Bursted out on the scene with TES, nerves got better of him, got replaced quickly. Just when you thought he will fade away, he got picked up by V5 and in my opinion absolutely delivered throughout a year (baring summer playoffs) a banger after banger performance, showing everyone he is totally capable of beating top dogs and becoming one himself as well. Currently playing for very underwhelming roster, so I'm not counting his performance as much, but definitely remember his name, he will make waves in the future for sure. \n\n\nHope, hope, hopeeee. Ah. This guy I enjoyed soooo much on EDG when he just started playing in LPL. True talent as well. Had a great last year, even though many will critisice his international performance. But when he is performing good, he can definitely go toe to toe with the best and he proved it. \n\n\nEIGHT adc's who on their day can easily be (many of them were) Worlds champion player material. \n\n\nOutside of them you still have veterans and strong performers like Lwx and Able or newer players and rookies like Assum, Lp, 1xn, zhiqiuyi who are looking quite promising and can very well become the next big generation. \n\n\nOh yes, speaking about rookies, almost forgot about the best one: Leave, who just left (lol) the LPL, unfortunately due to drama and bad behaviour. But I'm fully expecting to see him back sooner rather than later. \n\n\nThere you go - depending how you describe World calibre player, you can easily pick 6-8 LPL adc's and put your hopes on them, while having additional 6-8 adc's who either already have proven themselves or they are looking to do in a next year or two. \n\n\nBest ever ADC's pool in one league? I definitely think so. Really curious to hear your thoughts!",
    "comments": [
        {
            "level": 0,
            "comment": "It's sad that only 4 of those adcs will make it to Worlds and only 1 to AG (I think they will use substitute player for jungle position).\n\nOn side note, Leave won't be back. His career got nuked harder than Bo's and EDG is doing PR masterclass with Uzi to make people not talk about him. If any LPL team picks him up they will receive hard backlash",
            "score": 1,
            "author": "non-edgy_crustacean",
            "replies": [
                {
                    "level": 1,
                    "comment": "Leave left",
                    "score": 1,
                    "author": "Learkyu2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Leave was forced to leave",
                            "score": 1,
                            "author": "noob_vert"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "what happened to Uzi? why does he need PR?",
                    "score": 1,
                    "author": "NotAgoodPerson420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nothing happened to Uzi, he’s saying EDG picked up Uzi as PR to make up for Leaves controversy",
                            "score": 1,
                            "author": "wankcat"
                        },
                        {
                            "level": 2,
                            "comment": "He doesn't need PR, UZI is good PR because everyone loves him. EDG is (correctly) assuming that playing UZI will distract from what Leave did.",
                            "score": 1,
                            "author": "ArchaeopteryxLit"
                        }
                    ]
                }
            ]
        }
    ]
}