{
    "id": "hdavav",
    "score": 28932,
    "title": "I feel like league is a game that's much more fun to think about playing than it is to actually play",
    "author": "idontlikeredditbutok",
    "date": 1592760795.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/hdavav",
    "media_urls": [],
    "other_urls": [],
    "postText": "Every time I get back into esports or see highlight clips of league i think \"wow damn, this shit looks so much fun I gotta go rank up in league!\" and then I play a ranked game and it's such a shit show that I just drop it for a few days and then repeat the process over again. Anyone else feel this way?",
    "comments": [
        {
            "level": 0,
            "comment": "I wonder what percent of this subreddit hasn't played regularly in months or even years but still regularly checks the subreddit and follows league on like social media, etc.",
            "score": 1415,
            "author": "Tropius2",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's me. I play only a few ARAMS a month but consume a lot of league content",
                    "score": 167,
                    "author": "5MoK3",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Haven’t played for a year now, last time I played (already had a break before that) I wanted the competitive rush again and just jumped into a ranked and played 3 matches. Jesus, what a dumpster fire. Everybody was just flaming each other after 5 seconds into every game. It was HORRIBLE. I‘m feeling kinda grown up now and don’t want to deal with that anymore. If I ever play again, I‘ll instantly block allchat. It honestly kills my mood when people treat each other like that.",
                    "score": 81,
                    "author": "mcm_xci",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I disable all chat and allies chat in the interface menu, so I automatically only hear teammate pings which are typically fine. Easy enough to mute someone spamming. I got sick of my favorite game being ruined by some of the world worst gamers, and not only had league been more fun the last 2 months since doing this but I’ve also gone up 4 divisions. I get much less distracted/tilted without the constant flaming.",
                            "score": 22,
                            "author": "reddito-mussolini",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 398,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty much. The amount of smurfs or accounts being elo boosted is just crazy this season. Ranked is pretty much decided by that.\n\nIronically I find normals to be harder because the match making system constantly forces me to play against premades who are around the same goddamn rank. Enjoy playing mid or adc when you're hardcore camped and coordinated against :\\\\",
                            "score": 85,
                            "author": "Shallow_Response",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel like normals are mostly more entertaining, because there are mostly no mental booms. I hate those people, that goes 0/1 or 0/2 and are done with trying....",
                                    "score": 23,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is me. I spent years playing and following the game, and still love reading about/watching it. I just don’t like playing anymore. Plus I’m a huge fan of esports and as far as esports go, league is it. CSGO esports are great to, and maybe even more fun to watch, but the rarity of the international events in league just make it so much more hype.",
                    "score": 17,
                    "author": "PrettyDopeBrah",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ranked destroys lives",
            "score": 7100,
            "author": "TheTrotter_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I went from g1 35lp to g3 0lp in a fucking day. I had told myself I'd try to get plat before july started and honestly after this bullshit I haven't even turned on my computer in a couple of days. I've been genuinely losing sleep over this and I feel so dead inside. Solo q rlly destroys lives.",
                    "score": 2657,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "take a break from the game for a week or 2 if it's affecting your life, also if you wanna stop dropping like that stop playing after 2 or 3 losses in a row",
                            "score": 1043,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "bro i took a break in early april and i’ve played like 3 games since then. just cant bring myself to soloq still.",
                                    "score": 428,
                                    "author": "knucklepuck17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 183,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "League is way more fun when you allow yourself to play for fun and not to be winning. Thats why i dont play ranked although im still fairly new to the game",
                                                    "score": 62,
                                                    "author": "DeZeKay",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I like the ranked grind to push myself to improve, but I also take frequent breaks (days/weeks) to reset my mental. \n\nI find the worst shit manifests when you’re grinding too hard. That’s when you stop losing focus of the fact that it’s a game. At least for me. \n\nI highly recommend anyone struggling with that to try it. Just don’t play for a week or two. \n\nI also play much better and more controlled after these breaks.",
                                                            "score": 44,
                                                            "author": "Icandothemove",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I played some URF and had fun then just went back to TFT. It's too infuriating to play ranked. Someone decides they can't be arsed or gets their ego hurt and the game is over.",
                                            "score": 25,
                                            "author": "stvbles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah that was what ended my ranked career as well, realizing that 90% of games are decided not by skill but by someone being a fucking asshat and either hard inting, soft inting, feeding by accident, refusing to cooperate, etc. people cannot handle like ANY adversity without quitting. Why am I gonna queue up when there’s a 90% chance it is decided by that?",
                                                    "score": 31,
                                                    "author": "Jek_Porkinz",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 182,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Silver has always been wild because of the wild differences in skill between players that get stuck there. One game you're split pushing and your team is using the pressure to move to and take baron before you issue the pings, and then the next game your mid has 3cs/min. And then there's the games where the winning play starts with the enter key.\n\nI don't really mind bad teammates, it's the inconsistency that gets me.",
                                                    "score": 220,
                                                    "author": "vooffle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Is so baffling to me how huge the gaps can be. It's so rare to see lanes that are evenly matched.",
                                                            "score": 19,
                                                            "author": "M4DM1ND",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I played a game last night in bronze 1 flex with friends. I played Nasus top, against an Irelia who ended up with 173cs and 11/1/7 after 23 minutes. Nobody else in game had more than 115 cs, their Midland ended with about 80. \n\nI went 6/5/8, with about 145cs. Had what I felt was a decent game, because I was completely forced out of lane early by a highly skilled Irelia, and I had to adapt. \nWe lost .... bad.",
                                                                    "score": 15,
                                                                    "author": "gitbse",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well I'm gonna sound like a douche but no shit. Ranked Flex is a mess we all know that. There are solo q challengers that are plat 2 in flex and the matchmaking is so unbalanced. One of my mates was in bronze 2 and was up against a plat 1 shen one trick. Not a fun game.",
                                                                            "score": 8,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 76,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Other team comp: soraka, vladimir, graves, mundo, draven.\n\nMe: let's get exec and morello's early and first.\n\nTeammates: fuck off hard stuck gold",
                                                                    "score": 115,
                                                                    "author": "hadenthefox",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "mundo and draven I get, but why do we need GW for soraka vlad and especially graves?? \n\nsource: bronze player",
                                                                            "score": 11,
                                                                            "author": "but_a_simple_petunia",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "If a Champion has GW applied and Soraka heals him, the heal is reduced. Vlad should be self explanatory since he lives of trading HP for healing and GW worsens that trade.",
                                                                                    "score": 6,
                                                                                    "author": "versipellis_",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Think about why you're grouping.\n\nOne of the most frustrating things about silver is that players don't think about the game state and just want to group and Aram as soon as the first tower falls.\n\nIf your team is down 5k gold, what is grouping going to accomplish for your team? You're likely just going to lose another teamfight, end up even further behind in gold and exp, and then lose tower you were \"grouping\" to protect in the first place. \n\nIn a lot of cases it's better for your team to soak exp in sidelines so they have a shot at catching up. Even if they're taking your mid tower, they're sharing one lane worth of gold and exp between 5 players. If you guys have 3 mid and two players in sidelines, it gives the players in sidelines time to catch up in gold and exp, and they can probably take a tower as well, trading tower for tower while gaining solo exp and gold.",
                                                                    "score": 52,
                                                                    "author": "Toplaners",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I feel you bro, i was in my silver 2 promos and went 2-18 games, i was getting -22 or -23 on a loss and +13 on a win i was busted back into bronze 1 before i went back to silver 3, and i haven't played since getting back to silver 3, that grind of losing so much lp compared to what i gain is just stupid.",
                                                    "score": 31,
                                                    "author": "Mongoose49",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Your rank gains and losses are that low because it doesn’t thing you belong in your elo. So it’s trying to get you to drop",
                                                            "score": 11,
                                                            "author": "EmbiidThaGoat",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Best advice for you in those elos is to take matters into your own hands and hard carry. Jungle and mid best roles to do so. Pick broken fotm champions (if you’re playing mid pick Galio nocturne talon basically fast clear roaming champs). Jungle I’ve personally been seeing success with sylas but u can play things like zac and olaf (or even Warwick). U need to be the rock in your team that’s going to carry them from these reliable roles. And in low gold and below unfortunately people play the weirdest champs in roles so definitely dodge the games where u get things like jhin top.",
                                                    "score": 27,
                                                    "author": "iwerson2",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I may know the Jhin top, if you're EUW",
                                                    "score": 14,
                                                    "author": "skaersSabody",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There are many, many who try this in low elo. KeepItTaco (Master tier jhin main) played it a lot in his videos so people are trying to copy it",
                                                            "score": 16,
                                                            "author": "R1pY0u",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh I didn't know, thought it was just my idiot friend that goes 15/0 but then we lose the game because we don't have a frontline and Jhin can't fight tanks",
                                                                    "score": 11,
                                                                    "author": "skaersSabody",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "i was in plat 2 at that time. I was bouncing between plat 2-3 for like 3 months so i just stopped playing, primarily because i play adc and it’s boring af right now.  The only thing that would get me playing is if i play with some friends or the next champ releases.",
                                                    "score": 13,
                                                    "author": "knucklepuck17",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "i hit diamond back in april and have only played a game a month so i don’t demote.",
                                                            "score": 5,
                                                            "author": "llNoRegretll",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If you really want to climb out of silver you have to stop relying on your team and start learning how to solo carry games. Players are not good at that elo - don’t expect them to be. The enemy team is just as bad.",
                                                    "score": 19,
                                                    "author": "JBBJ84",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You don't even need to carry lol. Just always win lane and with enough games you'll be plat ez pz",
                                                            "score": 18,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Facts. I went from iron 2 to gold 3 in 3 weeks. I spammed Caitlyn, focused on not dying and farming efficiently.  I can’t tell you how many games I should have lost but ended up winning because of MY gold lead and positioning in team fights.\n\nAlso having a 60% wr on Caitlyn helps :)",
                                                                    "score": 11,
                                                                    "author": "themetaguy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah. You don't have to play hyper carries or act like you're so mighty your team is just dead weight. Literally all you have to be is better than your opponent and you will statistically always climb.  \n\n\nWinning your lane doesn't always mean you'll win your game but always winning your lane means you will climb no matter what.",
                                                                            "score": 14,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't. I stopped playing league for a year and it was so much better, and I wasn't addicted anymore when I started playing a little again. It'a crazy how much time league takes up and you don't notice it.",
                                            "score": 7,
                                            "author": "WhyYouListenToMe"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Putting self worth into how good you are at any videogame isnt a good idea. Unless youre a pro and it actually is your life you should try to just play for fun.",
                            "score": 126,
                            "author": "IAmBadAtPlanningAhea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're absolutely right. Thank you. I needed that.",
                                    "score": 40,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Putting self worth in to my ability to improve at things is reasonable when I set reasonable goals and feeling frustrated is normal and healthy may not be the right word, but reasonable",
                                    "score": 34,
                                    "author": "phoneguy2012",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I had a similar situation a month ago. A little lower elo than you but I went from losing my gold promotionals 0-3 and then went on about an 18 game losing streak down to silver 3 0 lp. Took me forever to get back on ranked but when I did I switched roles back to top and am now up to gold 4 in about a week of playing. I really do feel like ranked queues sometimes just decides it wants to put you in a losers queue for a bit just to mess with you. You'll pop back up though. If you got to gold 1 the first time you can do it again and it's not too far a jump up to plat.",
                            "score": 20,
                            "author": "SpyrokTheDerp",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You literally just described me. Last season I was Gold 1 and permastuck there because I kept hitting my promos to plat and going 2-3 or something over and over. Eventually took a break, came back this season and got straight back up to Gold 1 super easily, then went on a huge loss streak and now I'm struggling to climb back out of Gold 4. \n\nIt's extremely frustrating because often times I lose because I played badly but there are SO many losses in-between those where I play okay or even really well but the games lost because of an afk, inter, troll or teammates shitty mental. \n\nIt doesn't help that I'm super stubborn and competitive and HATE losing so I'll keep queuing to get that W even though I'm on a loss streak. \"Next game can't be as bad as the last\". \n\nI'm not quite losing sleep over it but it's definitely got me feeling abit defeated and wondering if I'm even capable of reaching plat whereas previously I was super confident and feeling good about getting there.",
                            "score": 6,
                            "author": "GageZerk",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Lool I thought for a second I had written this. Because I, too, went from Gold 1 20lp right back to Gold 4 0lp within a week. \n\nI had targets of reaching Plat before the end of the season but that's just gone now. I guess it has shown me that I'm not a Plat player yet... but to lose that much LP is honestly demoralising",
                            "score": 19,
                            "author": "scale1v9",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If you lose more than 2 [ranked] games in a row, quit playing for the day. Its best for both your mental and keeping good habits in game",
                            "score": 15,
                            "author": "Dude_Guy_311",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was on a \"can't sleep on a loss\" mindset. When I began my climb to plat I told myself that but after about 60 games or so I forgot about that and just said \"fuck it\". Horrible decision.",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tough shit man. That mindset is cancer. I used to play like that every night. Ever since changing, I can play like 1/4 the games and climb 2x faster when i start playing again. It's honestly ridiculous how much a difference quitting after a 2x loss streak helps you climb.",
                                            "score": 18,
                                            "author": "Dude_Guy_311"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have the same mindset sometimes, especially when playing with friends. Just switching over to normals or ARAM when it gets late can help!",
                                            "score": 5,
                                            "author": "JeremyG92",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I finally gave up this season.",
                    "score": 88,
                    "author": "profirix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah im about there with you. Is it extra bad right now? I've been harsdstuck silver for years, but this year is extra not fun.",
                            "score": 27,
                            "author": "tonyo8187",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lock down players are hot garbo, the mmr for new players is too high so you get a lot of brand new level 30s  in silver-gold mmr and they just make games too coinflipy. \n\nEven a 5% surge in new players means you're getting a newbie every 2-3 games coin flipping the match at champ select",
                                    "score": 73,
                                    "author": "phoneguy2012",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; level 30s in silver-gold mmr  \n\nYep gold feels super fucking bad atm. Loaded full of freshly bought accounts who are either smurfing to dont even know how to play the goddamn game.",
                                            "score": 44,
                                            "author": "Shallow_Response",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's designed to force you to climb as long as possible. Everyone I've known who hits their goal rank basically just stops playing, and Riot knows that and doesn't want it. The longer you have to climb the more you play, the more League takes over your life, because people who log in every day are probably checking the store and eventually they think, \"Well I play League so much I could get a skin or two.\"      \n\nI get it, it's a business at the end of the day, but I do wish things were better.",
                    "score": 144,
                    "author": "Illokonereum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, I finally reached gold and the week leading up to it I was fucking **obsessed**. I told myself I would never play ranked again until next season and now I’m enjoying my fucking around in ARAM and normals. It’s so much more fun this way without the addiction of the rank ladder.",
                            "score": 38,
                            "author": "DAt42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hit gold 4 in preseason 10, which doesn't count for ranked rewards, and all I want is to hit gold again so I can just chill in ARAM and norms. Currently stuck silver 3.\n\nAfter playing since season 4 I just want one Victorious skin to show for it, ya know?",
                                    "score": 11,
                                    "author": "Fluffy017",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Riot hired psychologists to fuck with their matchmaking and ranked system (going from an ELO system of pure skill to a made up visual rank system with hidden fuckery elo behind it) to make the ranked climb as slow and drawn out as possible but giving you just enough victory to stay playing. [ roller coaster matchmaking](https://i.imgur.com/xWFOE43.jpg). Basically it gives you easy games then hard games back and forth (not a binary W/L/W/L though, more streaky). Why?  To keep people addicted and have more chances to buy RP rather than have every game be as close in skill as it can. It got to the point that the most efficient way to climb according to most people was to just look at team match history in champ select and see if your team is win-streaking or lose-streaking and dodge accordingly. Obviously skilled players can still climb normally, but it's less enjoyable than it should be and makes games more toxic. \n\nLot's of video game companies are looking to get more money via psychology these days and it's really hurting the games themselves.",
                            "score": 106,
                            "author": "SelloutRealBig",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just a lurker now days but I haven't really played league in 4 to 5 years and those issues were pretty common then. I don't believe in ELO Hell, but Riot basically designed a matching making system as if they were creating ELO Hell. There's no worse way for ranked players to feel mentally than to win a bunch of games, go into Gold/Plat/whatever and then lose 8 games and fall back down. I don't know if promotion series are still around but it's the single most stress inducing thing in that entire game. I remember giving up and not playing my promotion series for diamond because the disappointment of losing them was worse than taking the opportunity to play the games. Of all the competitive ladders/systems if its ESEA/CS:GO, Dota2, Overwatch Competitive, etc, there isn't and probably never will be a game that makes ranked play feel more shitty than league. Me and my buddy we both quit playing back a couple years ago after trying to grind out ranked for a while, it just wasn't fun and it kind of killed any enjoyment we had for the game. It's funny because we always joked about Riot fixing our matches because of how used to this nonsense we were, we wondered if we were going to get queued up with our Silver friend because we won a game. It's kind of crazy after a couple of years people still talking about these issues.\n\nFor what it's worth I think Riot has a gold mine on Valorant but I just hope they don't introduce shitty system into that game and hopefully care a bit more on the balance aspect of the game.",
                                    "score": 12,
                                    "author": "TaxWizard69",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "More people need to be aware of this.\n\n  \n\n\nThis is why I'm always advocating for abolishing the ranked system, but some idiots always argue against it because \"it looks so much better than just 1 number\"",
                                    "score": 34,
                                    "author": "freakahontas",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This system is in normals too. Normals has hidden mmr",
                                            "score": 11,
                                            "author": "SelloutRealBig",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Everyone I've known who hits their goal rank basically just stops playing\n\nYep, got Diamond 2 last season and I said no way in fuck I would do that climb again and get masters.",
                            "score": 11,
                            "author": "Profoundsoup"
                        },
                        {
                            "level": 2,
                            "comment": "But that is just the result of the horrid climbing system currently in place. The reason why I myself decide to quit once I hit my goal is just because it takes an unreasonable amount of grinding to get to that point to begin with.\n\nOnce I hit my Gold the first thing that goes through my mind is \"thank fuck, now that is finished I can go back to playing the game\", instead of feeling enticed to continue my climb because what is the point? It already took me too much time to get here, so I'm sure as fuck not spending as much, if not more, time sifting through who-gets-the-afk simulator if there's not a way for me to climb effectively.",
                            "score": 8,
                            "author": "Rawrdugun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is honestly why I quit ranked and just play norms. Like I'm never going to be Grandmaster and I'm not seeing any more opportunities to be ahead. And its not like you get an automatic seat in the LCS for being super high elo.\n\nMight as well just play the game to enjoy it as opposed to try and grind both LP and my willpower to dust.",
                    "score": 16,
                    "author": "ClocktowerEchos",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Also blind.",
                    "score": 25,
                    "author": "RaresVladescu",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It still destroys lives and people's motivation to live.",
                    "score": 10,
                    "author": "BLVCKLOTCS"
                },
                {
                    "level": 1,
                    "comment": "I have fond memories of playing dota in college when it was a mod. Then league came out and it was pretty fun. Just get 5 buds together get drunk, shoot the shit, and try dumb strats. We didn't care if we lost. Then the group fell apart and I wasn't able to find a group of people that fit my schedule with that approach. So I played solo and I tried to play right, but I don't have time to keep up and I've just gotten shittier. So I stopped playing rift because it wasn't fun feeling like you are just wasting peoples time and no one was having fun. So I picked up aram but then it kind of happened there too. Like I'm not great at the game, I know, I can't play that often but I'm trying my best. Just get verbally abused by a bunch of 14 yr olds hiding behind their anonymity. Yeah, not fun. So we don't play it at all anymore. Great game. Lots of fun to be had but the community and na pro players have fostered a really shitty attitude towards a cooperative game that is just hard deal with. So I don't.",
                    "score": 8,
                    "author": "giraffegames"
                },
                {
                    "level": 1,
                    "comment": "I lost 8 years of mine to it ahahah",
                    "score": 23,
                    "author": "_zzr_"
                },
                {
                    "level": 1,
                    "comment": "Solo queue. I rarely if ever have a bad experience when I choose the people I play with. And this goes for most games.",
                    "score": 6,
                    "author": "shadowkiller230",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Mute the moment someone starts being negative and don't worry so much about your rank and the mode becomes 10 times more enjoyable.",
                    "score": 18,
                    "author": "LoneLyon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't even wait for the opportunity for someone to flame me. I've turned my chat off in the settings so its off every game from the start. I can't trust people not to insta tilt in silver lmao",
                            "score": 12,
                            "author": "Hervis_Daubeny_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Soloqueueing with chat on made me immune to toxicity irl.",
                                    "score": 11,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i just started playing ranked recently. i like the more challenging aspect to it, but it feels like there's more pressure and people tilt a lot quicker. im low elo so people just have really weak mindsets and throw games constantly",
                    "score": 4,
                    "author": "HustlerThug"
                }
            ]
        },
        {
            "level": 0,
            "comment": "at some point, the best thing you can do is learn to enjoy the shit show",
            "score": 1461,
            "author": "evilslimeboy",
            "replies": [
                {
                    "level": 1,
                    "comment": "or quit",
                    "score": 370,
                    "author": "noahboah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "6 months sober here",
                            "score": 235,
                            "author": "InriSejenus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "3 months out for me, and I still hang out with my buddies who play in Discord, and still get to basically enjoy the game just as much without actually experiencing the shitty parts of it. Kinda hurts when I have to watch them go through it though, cause damn that shit can be rough, and they can sound so deflated, but they always bounce back somehow!",
                                    "score": 53,
                                    "author": "Schindog",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "*rookie numbers*\n\n2 years sober here. I used to be legit addicted between season 3 and season 6. I haven't played a game in 2 years and I *do not* miss the toxicity of this damn game.",
                                    "score": 41,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The shit show's the shit!",
                    "score": 121,
                    "author": "TrulliGreat"
                },
                {
                    "level": 1,
                    "comment": "Play Singed",
                    "score": 27,
                    "author": "jobriq",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Or just do something you actually enjoy",
                    "score": 25,
                    "author": "TheMilkiestShake"
                },
                {
                    "level": 1,
                    "comment": "Honestly, after being challenger multiple seasons and witnessing the same shit over and over again you just accept it and laugh at everyone",
                    "score": 9,
                    "author": "davishox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find uninstalling helps, but once a summoner always a summoner.",
            "score": 1591,
            "author": "PROOFclique",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. I usually find myself burned out, uninstalling, fighting addiction for couple of weeks and then just walking away. To return in a year or so...",
                    "score": 362,
                    "author": "kitayozamonk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For me it helped to try to find other things to do. I went through the same problems a couple times, especially high school, and a little bit in college (I’m a year out of college right now). When I really stopped for good I made a conscious effort to keep myself occupied with other things instead of just sitting around when I had nothing to do, e.g. hanging out with friends or watching science videos like I used to when I was younger. Even playing other (far less addicting) video games helped. And then over time the memory of the game just started to fade, especially with such drastic changes to the game recently. But the main issue for me the first couple times I tried to stop playing was that I got so reliant on playing when I got bored that whenever I did get bored I didn’t know what to do and didn’t make a conscious effort to find other things to do, so I would just go back to playing.",
                            "score": 79,
                            "author": "WAGUSTIN",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You make it sound ok. No it’s much darker than that, once you get into league once... you’re it’s bitch for the rest of your life.",
                    "score": 35,
                    "author": "JuniorFrostbite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can confirm. I stopped playing this game maybe 4 years ago and I really thought I was done for good. Aaaaaaaaaaaaand now I'm back.",
                            "score": 21,
                            "author": "StellarCZeller",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "uninstalled again.. my best friend wanted to play a game.. we did but everyone inted like literally i uninstalled right after and realized I hate this game.. only good thing is aram i hope Ill never touch it again lul",
                    "score": 21,
                    "author": "daystrict",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly league just feels like a big old mini game to see who gets hard tilted first and throws the game for their team",
            "score": 103,
            "author": "segzii",
            "replies": [
                {
                    "level": 1,
                    "comment": "It has been this way for the last 10 years. Season 1 was a bit more chill, but only because everyone was still awful at the game.",
                    "score": 18,
                    "author": "Whiskey-Weather",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most people are titled by their teammates but I'm tilted by how bad I am at the game. It's truly demoralisering when you realize that you're shit after playing for 1+ year. Winning games doesn't outweigh this feeling, lol.",
            "score": 898,
            "author": "chaincrackers",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate getting mid diff'd so much. Can't even respond to the flame because I know I deserve it lol",
                    "score": 384,
                    "author": "Aladin001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 150,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I used the toxicity to destroy the toxicity",
                                    "score": 77,
                                    "author": "MichiPlayz",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Flaming yourself is actually a serious tactic to avoid tilt and toxicity! It accomplishes several things:\n\n- Makes you aware of your mistakes so you can possibly fix them\n- The absurdity of flaming yourself makes you laugh\n- Teammates might get confused and laugh with you\n- You backhandedly compliment the enemy, which is good for sportsmanship\n\nOne of the things I do is ? spam myself when I miss easy skillshots or get caught out in an avoidable way. Sometimes someone else does it at the same time and there's a cacophony of pings for a bit, which is funny.\n\nBeing able to laugh at yourself reduces your ego and makes mistakes hurt less.",
                                    "score": 66,
                                    "author": "Gangsir",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*misclick Fiddle Ult by an inch*\n\n*enemy escapes*\n\n*Question mark ping myself as I dance with my Ult*\n\n/all gg jg diff",
                                            "score": 19,
                                            "author": "CustosUmbra"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I use the mastery emote only when I do huge rookie mistakes or when I die for nothing. Makes me laugh so much",
                                            "score": 9,
                                            "author": "Sl3dge78",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's made even better that you can mastery even when dead and it appears on your body...",
                                                    "score": 9,
                                                    "author": "Gangsir"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No one deserves flame, unless theyre purposely trolling or being assholes. If you enjoy playing, just go for it and you'll get better eventually, if you really want to. The game is fun if you play with the right people, if you play with assholes then rip, they gonna flame, which sucks. Best of luck in your future games, keep it up and I hope you have a blast, even tho people can be real dicks(':",
                            "score": 46,
                            "author": "Charizardreigon",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "people were way more lenient on noobs like you when the game wasnt as volitile as it is today and the early didnt matter as much. its a shit show.",
                            "score": 45,
                            "author": "TheyCallMeAdonis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not true at all. You were also flamed in 2010. And in 2011, 2012, 2013 etc. You were always flamed in LoL when you played something bad (and even when you played it good) and there is someone in the game who has the need to tell you. It isn't worse or better now, but we got tools to work with that:\nMuting and disabling chat before the game starts is the best thing Riot did for Chat-toxicity. Do yourself a favor if you tilt from the smallest sample of flame and deactivate chat. If you can handle it before it gets to a point where it's unbearable you can let it stay active and muter the flamer.",
                                    "score": 87,
                                    "author": "Kellipot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not in my experience. Flaming still occurred but only if you were feeding. \n\nNow people flame you for taking their farm, missing a skill shot, building an item they don’t think you should build, not camping their lane, ganking when they just want to stack Q, playing too aggressive, playing too passive, not ganking top even though you just took drag, not ganking not even though you got a kill top + first turret + herald, dying, living when the rest of the team died, etc.",
                                            "score": 15,
                                            "author": "musclecard54",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Big difference is before it was straight up I hope your mom dies of cancer, afk, steal your minions and afk.\n\nNowadays is \"ff15\", softinting, insulting in random ways etc just like their favourite streamers.\n\n&amp;#x200B;\n\nAlso, before people went afk or trolled over killsteals, and it's been years since I've seen anyone complain about killsteal in random shit (not a janna flashing Wing to get a kill that the adc/mid would've gotten 100%)",
                                                    "score": 22,
                                                    "author": "xsairon",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "you don't deserve flame bro",
                            "score": 15,
                            "author": "ascocendas"
                        },
                        {
                            "level": 2,
                            "comment": "When you're playing poorly you just question mark ping yourself, type in chat 'pls carry lmao fml' then /muteall.\n\nAcknowledging it is nice and you keep the well deserved flame at bay :')",
                            "score": 4,
                            "author": "Shallow_Response"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hate to break it to you but this game takes a lot more than 1 year to get really good. Everyone is different, sure, but in my case, I started on S3 and I feel I just peaked about a year ago",
                    "score": 120,
                    "author": "claptrap23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's insane cause I also have been playing since season 3 and took a break during s8 and s8 (from ranked) came back and tried out Aurelion Sol and literally started in Gold4 and climbed to plat for the first time ever.",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had the realization the other day that I've been playing since season 2 and I still die to 3:30 ganks...",
                    "score": 19,
                    "author": "Dinodouscher",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm someone who hates the feeling of being bad at stuff that I play/do consistently. Whether it's league or sports or anything. \n\nHave you considered getting coaching? It can help you improve so quickly",
                    "score": 22,
                    "author": "dankynugz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I really felt like I didn't improve at all when I first started playing. I started in about 2016, played off and on between then and 2018, feeling like I didn't like the game because I was bad at it. In 2018 I started back up in earnest and playing with friends and was still so bad that I needed help picking items when buying. It wasn't until I put genuine effort into improving that I started noticing a difference.",
                    "score": 7,
                    "author": "Illokonereum",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Sad thing is that it feels like lose streaks are inevitable. Pop off 5 games in a row and queue up for the 6th game and realize that this one is lost after looking at the scoreboard. Ah more losses are on the way I guess.",
                    "score": 22,
                    "author": "Oeshikito",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hadn’t played ranked in a month. Yesterday I queue up. \n\nFirst game, I mute all just out of habit. Jungler is 6/0, I’m crushing too, other lanes are slightly ahead.\n\n18 minutes jungler and mid afk. I unmute to figure out wtf happened. Mid was mad at jungler for not ganking more. That’s right, the 6/0 jungler wasn’t ganking enough.\n\nWe lose that game.\n\nSecond game, enemy team gets first blood. Of course my team starts spamming GG at 5 minutes because who wants to play the game at all unless you are absolutely crushing the enemy at all times.\n\nMoral of the story, ranked is full of people with no competitive spirit, at all. Not fun",
            "score": 256,
            "author": "DatTrackGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "any scaling champ dies twice \"ff15\"",
                    "score": 108,
                    "author": "Baji25",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\\*top laner gives first blood 4 minutes in while jg is botside\\*\n\n\\*top laners spams ? pings on jg location\\*\n\nMid: ff at 15\n\nadc: get me out\n\nme: /fullmute",
                    "score": 62,
                    "author": "AppleWedge",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Exactly, I remember when video games were supposed to get harder as you go, and you had to figure out how you could win. Being behind in league isn't much different",
                    "score": 19,
                    "author": "KilowZinlow",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[yes](https://imgur.com/nzZlQEi)",
            "score": 140,
            "author": "J_Roll_Tebany",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeap exactly this, I watch lec cool teams cool plays, Im right alright lets get this bread and play ranked... and then its all feeders, trolls, inters, flammers etc...\n\nI used to watch soccer without actually playing, maybe same will happen with league",
            "score": 727,
            "author": "Kuromajo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah same, I used to watch casual streamers/LEC and always ended up wanting to play, played and felt bad.\nI actually stopped playing now and I just enjoy watching others, the game is interesting but playing is just too much for me.",
                    "score": 120,
                    "author": "DragonBadBreath",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yesterday I got back in after two weeks of not playing, played 3 arams and hopped in a normal and it was toxic af. Gonna take another 2 week break.",
                            "score": 17,
                            "author": "HyperShadow95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I regularly get flamed on Aram for trying to have fun with wacky builds or not being good at champs I don't play. Games way too toxic.",
                                    "score": 18,
                                    "author": "Rikomomo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Flame ? ..... In ARAM ?\n\nWell , the world has changed !",
                                            "score": 9,
                                            "author": "IIWild-HuntII",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People started retreating to ARAM from SR because of how toxic it has become, but the competitive mindset is hard to break, i've had to check my friends because of this. The way my duo and I set things up was on SR get mad at each other for dumb stuff, push each other, theorycraft etc. because we both know we are just scratching that competitive itch, but ARAM is anything goes, dumb builds are half the fun.",
                                                    "score": 7,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 85,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed. Playing the game in an actual 5v5 team-based setting is really fun. Soloqueue is a fucking drain unfortunately.",
                            "score": 17,
                            "author": "Shallow_Response",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;League is a team game where you're not given the tools to play as a team.\n\nThis, but also I'd say that League is a game where your teammates are bigger enemies than your actual opponent.  Its not a team game at all.  Turning off the chat entirely is almost mandatory for this game.",
                            "score": 11,
                            "author": "daswef2",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not even ranked mate, watched Jankos play Reksai absolutely smurfing so I first time her in fking NORMS, got hardcore flamed even though it was a close game the entire time. Haven't even played since. Honestly I wouldn't even be mad if I got flamed in rank but in norms I'm just trying to play for fun. At this point whenever I play again I'd probably just stick to champs I know.",
                    "score": 27,
                    "author": "hansantizor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to just laugh at people when they flamed me and it didn't bother me at all but in the past couple years I just get angry and start typing insults myself so I disabled chat completely and it made the game 10x less of a drag to play instantly. \n\nYou should try it, won't see any flame ever again and can just mute all the ping spammers if need be.",
                            "score": 18,
                            "author": "dystopi4",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's what happenned to me, I've almost stopped playing League (only a game once in 1/2 months) and what I do is watch LEC and SLO, I'm having more fun this way.",
                    "score": 22,
                    "author": "NachoGQ",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thing is I enjoyed playing soccer just as much as watching it tho, probably much more so. These days maybe not as much since I'm out of shape as fuck and I haven't played in a while. League on the other hand, I love watching LCS, LEC, but every time I press \"accept\" on league, I risk making myself really unhappy for the rest of the day.",
                    "score": 11,
                    "author": "Luftwagen",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Im glad im not the only one that has felt like this. Even before quitting League, my passion from competition and FUN was always in fighting games, specifically King of Fighters. \n\nEver since then, im still practicing to compete in tournaments, learning information from other players, and having the ability to improve myself by reaching out for advice or grinding hard, all of this while having FUN. I just love the high-difficulty games like KOF and TEKKEN, it drives me to further discover how i can improve! \n\nLeague looks cool and interesting to watch when the LEC/LCK/LPL pros do it (i think im forgetting one major region), but try to log in and climb ranked? Definitely not worth the negativity/toxic environments.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The big issue is games dont feel rewarding at all anymore, you either smash and other team flames eachother and goes afk or it happens to you. Everytime you play a 50min long game with good teamfights its the best game in the world, but with the shift in meta it just isn’t that way anymore. I genuinely enjoy losing long tryhard games more than winning easy ass games.",
            "score": 109,
            "author": "Kharaix",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a dota player, i think i can pinpoint league's problem to the surrender button. Every time my friends want me to play league with them, when we start to lose they immediately want to surrender ASAP. Every time we're winning the enemy surrenders ASAP. Even when they have a comp that will clearly outscale the enemy if they hold the fort for just a few more minutes, theh don't care. They want to forget about it and move on to the next game. Very few games actually reach lategame in my experience. This does a few things to the game as a whole. \n\nFirst, it tilts the statistics that riot can work with into the early mid-game games. This means that the statistics used to balance the game will tell you that champs that are essentially lane bullies as well as champs with good early fight potential will see higher winrates because of their early advantage leading to surrenders, while late-game characters that would rely more on holding the fort long enough to make a comeback will see lower win rates. Riot COULD then use these stats to balance the late-game champs around the surrender timer, but that would make them severly overpowered in the late game... \n\nThis bias for games to end earlier than necesarry wil also lead to the earlier champ smasing popularity trends, which only serves to exacerbate the problem. Players past their powerspikes wll be much more likely to surrender a winnable game. So the more early champs are played, the earlier players will potentially want to surrender\n\nCompare this to dota, no surrender button. Late game characters are just as popular as early ones. Even hyper-late carries like spectre see their time of day. Comebacks happe quite often due to powerspike timings. A snowballing queen of pain may destroy your team for the first, 20 minutes of the game, but if your anti-mage can farm his items he WILL put her in her place. Early game compositions are FORCED to push and end early or suffer the late game of wrath of their opponents.",
                    "score": 32,
                    "author": "degameforrel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not even that people want to surrender when they start loosing, they give up when your team is up 10 kills, dragon and 3 towers because their montage yasuo play didn't work out. \n\nIt's insane that someone is refussing to get carried and have a free win if they just play and would rather intentionally loose.",
                            "score": 20,
                            "author": "Th_Call_of_Ktulu",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's because League Of Legends is extremely competitive and when someone loses there is a chance he takes it on a personal level. It's like sports, when you play it casually with friends you can have fun, but on the field against opponents you will not, you will only think to win.\nAt least this is what i think :)",
            "score": 290,
            "author": "OnlineAsnuf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Idk if this is an unpopular opinion or not but the competitive nature of the game is the main reason I play. As someone naturally very competitive I use league as my outlet for that competition since I don’t have much time for sports anymore with my work/school schedule.",
                    "score": 173,
                    "author": "thejabel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 116,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have found the same thing with a few exceptions. I can play Nintendo games like Mario oddessey, botw etc. and be perfectly content because it feels like I’m making progress in an actually interesting and fun story. Same with Skyrim even though I’ve played it a million times. On the other hand I used to love borderlands and I can’t play the most recent one to save my life. I feel like the issue is some single player games cap your progression and tie it directly to the story. That’s why games like botw and Skyrim are fun for me because you can level at any rate you want without regard for the actual storyline and it still feels fun and interesting.",
                                    "score": 26,
                                    "author": "thejabel"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's just not true, I genuinely enjoy playing soccer and watching it and am more competitive in it than I am in League. League just matches you with a bunch of randoms that won't even try half the time which never happens in real sports.",
                    "score": 25,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're both right. Any game is only competitive to the extent the player finds it competitive. What OP was talking about was the design or objective competition. Pitting two teams against each other in any game is going to breed competition, by design. Like you said, there are factors that make League less competitive to you, and I would agree. Good competition has character development. It has people invested in each other. This is League's problems in a nutshell, but what creates the problems also has other purposes like feeling more individually powerful. You get to carry in League because you see your teammates as dumb randoms.",
                            "score": 7,
                            "author": "ConTejas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "League's problem is that there's a huge lack of camaraderie between teammates. No respect for the fact that other people are trying just as hard, that everyone makes mistakes, and that there are multiple ways to win.",
                                    "score": 13,
                                    "author": "flUddOS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, if you wanna boil it down even further, you could say that there's nothing stopping people from acting selfishly to the detriment of their team. This is why the best League experience is probably playing with a team of friends.",
                                            "score": 4,
                                            "author": "ConTejas",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it’s BECAUSE people take it on a personal level that the game becomes unfun. Being competitive and playing against challenging opponents is fun - but when someone stops playing competitively whether that be they stop playing seriously or flames is when the game stops being fun.",
                    "score": 7,
                    "author": "Leash_Me_Blue"
                },
                {
                    "level": 1,
                    "comment": "People don't tend to deliberately score own goals and then leave the pitch when somebody fails a pass too many times in soccer though",
                    "score": 5,
                    "author": "RussellLawliet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here's some advice for ya'll. Do not put any value on what rank you are and play the ranked mode to have fun, competitiveness, and improvement.  Seriously you will never be fully satisfied with what rank you are, it's an endless carrot on a stick that you will never catch.",
            "score": 111,
            "author": "Shazland",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. Like it is disappointing when I lose, and a little upsetting when I go on long lose streaks when I feel like I am playing well, but I don't play the game to get a high rank. I play the game because I enjoy it and I strive to get better.",
                    "score": 12,
                    "author": "Ferromagneticfluid"
                },
                {
                    "level": 1,
                    "comment": "the one thing i don't get is why people on reddit put so much value in rank.. if someone's not diamond, their opinion doesn't matter, as if there couldn't be players with way better game knowledge than any dia player, but they play like once a week, or just don't care if they win or lose.",
                    "score": 14,
                    "author": "Baji25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As much as I love the game I just stick to watching pro play and reading the discussion, when I play video games I prefer to have fun 100% of the time, with League it's around 60-70%.",
            "score": 23,
            "author": "IdeaSecure",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Appropriate comic! https://i.imgur.com/3bKOe7N.jpg",
                    "score": 16,
                    "author": "zerovampire311"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I play Aram almost exclusively. And it's awesome. I occasionally play ranked with some friends and they're so serious about the game.\n\nOf course they won't be having fun, they're taking it way too seriously.",
            "score": 155,
            "author": "milkermaner",
            "replies": [
                {
                    "level": 1,
                    "comment": "It also depends on what you consider to be \"fun\". Some people like the adrenaline rush of competitive environments.",
                    "score": 113,
                    "author": "Delves",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nothing tops that heart pounding outplay that wins you the game tbh",
                            "score": 72,
                            "author": "rheureddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In the same vein, my friends and I had a clash game where our macro was perfect the entire game. Vision was strong, we rotated for objectives, no one got picked off and it felt SO damn satisfying",
                                    "score": 38,
                                    "author": "TheCoker12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely! I love when I can see my team with all 20+ vision score.",
                                            "score": 15,
                                            "author": "rheureddit"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ARAM only is the ascended path. Very short queues and champ selects, you get right into the game, even when you’re behind you can be very useful, and snowball makes a lot of boring team fight champs really fun\n\nThe only thing I ever miss is landing phase but then you play a normal and get camped and remember it’s not as fun as you’d think",
                    "score": 55,
                    "author": "TSOD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sometimes you get like 5 games dodged in a row. If you aren't ready to play any champion, please stop playing Aram.",
                            "score": 7,
                            "author": "TheRealDorkSpork",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even 5 dodged games in a row don't take much longer than a ranked game to start. I'm only bothered if I was really looking forward to playing with the Champions I got.",
                                    "score": 4,
                                    "author": "GGABueno"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I tried getting into League and got pretty discouraged pretty fast and then I found ARAM. All my League playing friends bash on me, but I'll only play ARAM now. I find it quite fun and much less toxic.",
                    "score": 20,
                    "author": "chibijudoka18"
                },
                {
                    "level": 1,
                    "comment": "Honestly, this. I started played League about a year ago and I main ARAM because people on Summoner's Rift (and I even only tried normals) are just way too serious.",
                    "score": 33,
                    "author": "mackasan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is just an example of a clear clash of Goals. There is people that strive of improving at the game, Where there is a clear goal defined - that being going up the ladder. Mastering a champion, training up your apm etc. Then there is people like you just focusing on the single aram game and enjoying yourself. I am not saying that there is anything wrong with that but you just cannot combine these two mentalities and expect that everyone will enjoy themselves.",
                            "score": 11,
                            "author": "Chillyanesy0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At the end of the day if you aren't playing to enjoy yourself I think that's the biggest problem.\n\nYou can play to win &amp; have fun! The 2 absolutely can coexist, but I feel a large majority of league players exclusively play to win. If they don't win they can't feel good about anything that happened that match.\n\nJust my opinion, but it shouldn't be that way. There's a balance.",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Some people only have fun when they win. Winning should be a reward for the fun you had playing, not the other way around. Close friends to me told me that they just couldn't enjoy a game if there was no victory. That's sad because the reason being of video games is having fun. There's quite a paradox.\n\nVictory junkies use video games to get those victories at home. But i don't feel like we can truly call them gamers. They could do anything else and still only want to win, be it chess or sports or even arguments.",
                                            "score": 7,
                                            "author": "Noprimal"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ARAM is basically my perfect LoL game mode.  I played summoners rift for years, and even normal unranked was toxic half the time.  The worst you get in most ARAM games is just \"gg ez\" for a split second in all chat at the end. \n\nAlso, you can fit multiple games in the amount of time  of one decently long summoners rift match, and its basically just everyone beating up on each other for 15 minutes.  I've thought about playing summoners rift again, but I just keep going back to ARAM",
                    "score": 6,
                    "author": "HoboSkid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Y'all should really start actually playing the game instead of playing to win. Stop using champs that are unfun for you. Believe me, if you start playing to have fun and not to boost your ego, the game feels a lot healthier. The game is only draining to play because y'all take games personally. It's just a game, it doesn't define your intelligence, it doesn't define you as a person, it doesn't define your worth.",
            "score": 17,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "thissssss... everyone is obsessed with kills. Not even the point of the game. So annoying. The surrenders, the dodging before the game even starts, mind numbing.",
                    "score": 7,
                    "author": "sterry84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's also way worse this year, at least in my opinion. I've never had this much damn toxicity, to the point that it is making climbing so much harder. I've gotten to plat several seasons in a row without problems, now I have trouble in gold.\n\nGold which I considered the more chill elo due compared to Plat. Toxic/Afk almost every single game just makes me not want to play. Never had this much afk and just giving up.",
            "score": 36,
            "author": "Myllis",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've seen accounts that were diamond last season with 1,000 games in gold 2. Honestly I feel bad.",
                    "score": 18,
                    "author": "rheureddit"
                },
                {
                    "level": 1,
                    "comment": "I agree its almost every game at least 1 inter/afk and they just go unpunished.",
                    "score": 5,
                    "author": "Lighirit",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t follow competitive anymore - most of the players and teams I cared about are long gone and the excitement just isn’t there.\n\nMy online friends list has dwindled to nothing and my irl friends quit playing years ago.\n\nI haven’t played a real game in seasons and I’ve stopped bothering with patch notes and map mechanics. \n\nThe metagame has shifted to something I’m completely unfamiliar with and new mechanics feel foreign and so unlike the League I used to know.\n\nI still play ARAMs every few nights while I’m drunk because I have ten years of muscle memory built on this game.\n\nIt’ll happen to you.",
            "score": 110,
            "author": "EatingFlies",
            "replies": [
                {
                    "level": 1,
                    "comment": "When riot went too professional and copied the NBA type of casting it lost a lot of charm. Also a majority of the pros from the Dyrus Pillow era are no longer part of the scene and the new teams shuffle through imports so much it's not worth investing my time.",
                    "score": 22,
                    "author": "SelloutRealBig",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A generation dies and another one comes , it's a bad cycle but reality.\n\nI remember I saw a 10 year old boy in the internet cafe in front of my apartment picking Yasuo , and who knows what he did to his teammates !\n\nThis game won't die easily.",
                            "score": 18,
                            "author": "IIWild-HuntII"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im feeling this right now. Watching the new LCS season start but im on a break from league thats lasted 8 months now. My girlfriend started playing...and i can just feel myself being dragged back in.",
            "score": 30,
            "author": "Fharmacist",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's happening brother. The relapse is inevitable. Settle in and get ready.",
                    "score": 22,
                    "author": "St1rner",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I had stopped league completely after S7, even went so far as selling my PC. got into a new relationship at the start of S9....and got a computer a few months later because she played league. Now I'll regularly play 150-200 games a month.",
                    "score": 8,
                    "author": "rheureddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just had my G3 promos as ADC. Both games I had a Bronze 2 support with less than 20 games played this season. Both games they died in a really dumb level 1 fight and generally didn't understand the matchups and how to play the lane. I lost both games and -42 LP out of promos for it. Feels unbelievably shitty.",
            "score": 12,
            "author": "LagOutLoud",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is such a big problem. I'm silver 1, and it seems like every other game there will be some random bronze player who is level 31 and has a 25 percent win rate. Like, I don't blame you for being worse than me, but why are you in my game?",
                    "score": 24,
                    "author": "AppleWedge",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "We EVE Online now.\n  \nMore seriously, I am still having a lot of fun in League - much more this season actually, than previous ones. The previous season I played very few ranked games and more ARAM/Draft, for fun. However the lack of competitive pressure actually made the game feel very stale to me. Now, I am all for removing trolls/flamers/smurfs from the game, but personally with the current state of the game, SoloQ is where it's at for most fun, for me.",
            "score": 49,
            "author": "aircarone",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Gold is like every 3 games you will have someone trolling or inting on purpose. And no matter what lane you are in, another will feed every other game, and you will feed the other",
            "score": 51,
            "author": "Ghenorius",
            "replies": [
                {
                    "level": 1,
                    "comment": "3am-6am Gold 3 league of legends is the exact same 40 people playing, and if one of those is tilted or inting, you can gain LP so fast.",
                    "score": 32,
                    "author": "rheureddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I developed the bad habit of playing between 1am-4am a while back and it was smurf duos every other game in low-mid plat, so either you stomped hard or it was a ff15 game. Since then I've stopped playing after 1 am.",
                            "score": 5,
                            "author": "Ahrix3",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imo, this is reddit more than anything. Most people enjoy the game, but play it too much and you put too much stock in the results. That's why people hate ranked. You do ranked when you care about the results. Enjoying league means not caring about the results 50% of the time.",
            "score": 25,
            "author": "komanderkiwi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "For me league was way more fun when everything was new and unexplored.I used to build the most expensive items and max w on yi and that shit was fun.The more i learned and the  more i knew it began to annoy me when someone missplays or does something wrong.",
            "score": 16,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I was going to disagree, then you said ranked.  Best choice I made is giving up on ranked entirely. Im not going to the LCS.",
            "score": 8,
            "author": "mildobamacare",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Gold elo is the new diamand 4 this season...unplayable",
            "score": 7,
            "author": "Jiggo824",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yup. Being handcuffed to players having a bad game  and not being good enough to overcome the deficit they put you in is too frustrating for me. Others are able to get over the hump and learn, but I just get too tilted. \n\nThis is why I liked 3’s more. Less variance.",
            "score": 16,
            "author": "Chrisfit"
        },
        {
            "level": 0,
            "comment": "Yep. Can't play. When ever I play ranked I always mute chats, play some music... but it's still annoying to try to keep a good win rate you have to carry pretty much every/ every other game. Can't do that all day, every day just to rank up...\n\nIt's way more fun to play with friends in normals man",
            "score": 5,
            "author": "xijnnjix",
            "replies": []
        },
        {
            "level": 0,
            "comment": "just play off meta shit in normal games and occasionally play ranked. that’s the only way to enjoy the game atm",
            "score": 6,
            "author": "BlasphemyXDDD"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "no i actually enjoy playing league too",
            "score": 49,
            "author": "fallgout",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dislike the game sometimes and that's when I take a break. Then I return a week later and like it again. I think some people queue too much even when they don't want to play.",
                    "score": 15,
                    "author": "NahDawgDatAintMe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I dislike the game sometimes and that's when I take a break. Then I return a week later and like it again.\n\nI've been doing this for almost 10 years. I take between a week and a few months off a couple times a year, I feel none of the frustation that everybody raves on about. I think a lot of people are just heavily addicted tbh.",
                            "score": 15,
                            "author": "hej_hej_hallo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I haven't played League in just over a year. Before that, I played every day (probably 6 hours ish per day) for 7 years. \n\nSometimes I miss playing but I know it won't do me any good. Watching LCS is infinitely more satisfying than playing the game.",
            "score": 4,
            "author": "MiserableSpaghetti",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The game has seriously lost its touch now. Ever since season 4-5 (best seasons btw) where everyone was mediocre at the game and silver was the standard point for players. Now most of the player base can play the game now and built this “im right, your wrong” ego, which will result into if someone see a bad player, they’re just gonna give up. \n\nThis doesn’t even include the fact that smurfs are roaming the low ranked areas and seriously demoralized those players. The game is seriously dying and im even starting to take a long break from it just because I cant have fun with it no more.\n\n#MakeLeaguegreatagain",
            "score": 4,
            "author": "bkdxpride"
        },
        {
            "level": 0,
            "comment": "I used to be playing ranked for hours on end, somehow I managed to just get by on aram once every few weeks now. Only really play it with friends too. The game is not fun in ranked anymore, I've played it for like 10 years and it pretty much ruined a large part of my life.",
            "score": 6,
            "author": "n0vad"
        },
        {
            "level": 0,
            "comment": "FACTS everytime I see a &lt;insert champion&gt; montage it makes me wanna play the game. But when I actually play... Let's not talk about that.",
            "score": 9,
            "author": "EverydayEverynight01",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I agree. Been playing for 7 years but finally let the game go. It's more fun for me to watch and finally see C9 taste success than it is for me to actually play. I have gotten into shout casting and I really find that fun",
            "score": 13,
            "author": "Tope8"
        },
        {
            "level": 0,
            "comment": "They don’t punish afks harshly enough. They’re too concerned about beta bitches getting their feelings hurt with bad words, despite there being a mute button",
            "score": 40,
            "author": "Morbys",
            "replies": [
                {
                    "level": 1,
                    "comment": "you can call me your entire list of swear words, and i'll just laugh at how mad you are, but when you int my lane, it's the worst shit ever.",
                    "score": 15,
                    "author": "Baji25",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometime i feel like clash is the only true way of playing league, the 10 chickens without heads and too much ego running around that is ranked feels like shit.\n\nIts so sad that the best way to play a team based game is by playing for yourself and think of your teamates as bots",
            "score": 4,
            "author": "EmilianoR24",
            "replies": []
        }
    ]
}