{
    "id": "lpsbhk",
    "score": 34246,
    "title": "The Color Blind Experience",
    "author": "IvyClora",
    "date": 1614010427.0,
    "url": "https://www.reddit.com/r/leagueoflegends/comments/lpsbhk",
    "media_urls": [
        "https://v.redd.it/uyj33fmmz1j61"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I forgot I've had League set to color blind mode for years until I saw this video. Always liked the color scheme of it better. There should be more support definitely, especislly because there's different types of colorblind",
            "score": 2373,
            "author": "Tacomuncher117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ye I always thought singed gas was blue and thought it was a really wierd design choice considering poison is green in the game",
                    "score": 669,
                    "author": "Dubnos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish there was a way to have everything in its default colors except the healthbar. I really like the yellow healthbar, I don't know why, but I do.",
                            "score": 161,
                            "author": "PopsicleIncorporated",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly current colorblind mode should be the default while there should be ACTUAL colorblind modes that'd change the entire colorscheme.\n\nThe bare minimum they could do is put on a filter",
                                    "score": 35,
                                    "author": "Terra_Zina",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"But no ew doesn't make money and takes time ew\" - probably riot at one point",
                                            "score": 7,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just standsout better. Tbh it recently dawned on me that the yellow health bar isnt the default, ive just played with color blind mind for so long",
                                    "score": 102,
                                    "author": "keag124",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I thought Singed's gas was purple until I realized I had turned on color blind mode for the past seasons",
                            "score": 9,
                            "author": "Exxotiz",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I still remember seeing Sneaky midlessly walk into Xayah feathers at worlds and thinking that he was inting.   \n  \nThen I found out that he actually couldn't see the feathers due to his color blindness. It's honestly ridiculous that being colorblind gives you such a huge disadvatage and Riot doesn't do anything about it.",
                    "score": 724,
                    "author": "Fuzzikopf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 319,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I legit thought that new Lee Sin skin's Q was an Ashe ult, look at it: [https://youtu.be/VS4bi0KW3tA?t=67](https://youtu.be/VS4bi0KW3tA?t=67)\n\nThe state of new skins is becoming unacceptable.",
                                    "score": 23,
                                    "author": "Gnarmaw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let's play a game of [Yorick, Jax or Mordekaiser](https://www.mobafire.com/images/champion/skins/chromas/jax-mecha-kingdoms.jpg)",
                                            "score": 5,
                                            "author": "StenfiskarN"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Steel legion lux where the spells look the exact same right?",
                                    "score": 61,
                                    "author": "mymindpsychee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "base elementalist I think, really hard to tell apart q and e",
                                            "score": 18,
                                            "author": "snake4641",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And dark cosmic is also really hard to see",
                                                    "score": 3,
                                                    "author": "Emotional-Umbrella"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Steel Legion used to be Lux's most pay-to-win skin. Then Star Guardian came along, and ever since, most new Lux skins have been at least as unclear",
                                            "score": 51,
                                            "author": "PM_ME_UR_THROW_AWAYS"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's actually a major peeve of mine,  8% of all males are colorblind and game devs ignore accessibility.",
                            "score": 99,
                            "author": "pand-ammonium",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All the shit EA deservedly gets, you gotta admit that they have one of the best colorblind settings in the industry.",
                                    "score": 38,
                                    "author": "SuspecM",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed, in apex you can basically change the colour of every HUD asset you want to your desired colour, and I think that's really cool",
                                            "score": 3,
                                            "author": "RemIsWaifuNoContest"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some games are better about it than others. LoL does the bare minimum.",
                            "score": 131,
                            "author": "JourneymanJingle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "World of Warcraft have a whole giant section of their settings dedicated to colourblind. Not only is there a preset for each kind of common type, but there is the a be to customise the stength depending on your own needs. I'm not colourblind so I cannot explain it well enough but it seems like it's so damn good.",
                                    "score": 34,
                                    "author": "nadejha",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not really as big but a nice tidbit; Wow also has subtitles with music description for deaf people. Some people complained about because it's set to default and I found it weird at first because I didnt know what it was for, but I now think it's pretty nice.",
                                            "score": 11,
                                            "author": "why_are_you_black",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For a game that makes mad money, backed by a filthy rich company such as tencent it’s gross to see such bare minimum effort",
                                    "score": 51,
                                    "author": "NeoBlue22",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sneaky was really fucking good.  \nEspecially internationally, I think he even held the record for highest DPM at worlds for a period of time.",
                                    "score": 18,
                                    "author": "Fuzzikopf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "His mental was always godlike too. Dude never got resources in game and got a ton of flack from the community for getting carried. Dude never let it bother him, and when it mattered most, he showed up at World's every time.",
                                            "score": 11,
                                            "author": "Alakazam_5head"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there a filter that can show us what this video looks like to someone with your colorblindness?",
            "score": 2449,
            "author": "Dookman",
            "replies": [
                {
                    "level": 1,
                    "comment": "[https://www.youtube.com/watch?v=K6d29LJZG6E](https://www.youtube.com/watch?v=K6d29LJZG6E)",
                    "score": 1745,
                    "author": "Fakecabriolet342",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's pretty crazy that Cloud 9 had three colorblind players at once. I had no idea.",
                            "score": 1064,
                            "author": "Shimmy_Diggs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol when I first read your comment I thought the video would be a fail highlight of them walking into Orianna ultimate or something.",
                                    "score": 468,
                                    "author": "reigningwaffles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He said c9 not TSM",
                                            "score": 101,
                                            "author": "pinkshift",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think I remember hearing from Sneaky that Kench was a massive issue for colorblind players  because they couldn’t see his grey hp and then he would get a full hp shield out of no where.",
                                    "score": 349,
                                    "author": "KingAt1as",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can confirm. The colorblind mode is garbage. It helped me a little but during teamfights everything just turns into a pile of movement and I can't distinguish anything. I tend to play Champs that dive in and do whatever needs to be done inside the pile with no real discrimination like Leona or Malphite. I lose my pointer at least 5 times per match.",
                                            "score": 252,
                                            "author": "fistofwrath",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have this same problem in teamfights without being  colorblind.",
                                                    "score": 318,
                                                    "author": "BanjoStory",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha I feel ya man, once there's more than 4 champions involved my brain just stops working.",
                                                            "score": 64,
                                                            "author": "GrilledGril",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Better than me. Once there’s two champs involved my brain stops working.",
                                                                    "score": 21,
                                                                    "author": "h8rcloudstrife",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Please for the love of god let me disable enemy skins.\n\nIts a giant issue even if your not color blind. Having to readjust to skins every single game is annoying. Theres a reason LCS/Worlds had a ban list for skins. Some give a distinctive advantage that no one seems to talk about.\n\nEasiest example is elementalist lux.\nIt is absolutely fucking bullshit, for 12mins ive been dodging red colored skill shots and when I go to gank bot a Blue skill shot comes out of fog of war during the gank and I get pinned into being 100-0rd because I had to process who could of possibly been attacking me.\n\nSo i end up dieing because a brand new colored skill-shot came out of fog of war. And I decided to dodge a different skill and died for it cause lux changed her colors mid match.\n\nIts actually to the point where if enemy team has a lux with OG visuals it throws me off so hard cause its so hard for me to see them now.\n\n\nPLEASE LET ME DISABLE ENEMY SKINS! HEAR MY CRYS PLEASE.",
                                                    "score": 109,
                                                    "author": "BouncingDonut",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Standard enemy models\" has been a life-saver in \"large scale\" MMO battles (large as in, 50 to 100 on each side). Fuck your skins.",
                                                            "score": 35,
                                                            "author": "ProjecTJack",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But if people can disable your skins then there's a chance you might not buy them and give rito money :(",
                                                                    "score": 10,
                                                                    "author": "DragonOfDuality",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "And now we know why MMOs like GW2 abandon PvP! Because PvPers disable skins and thus the game mode doesn't make profit!",
                                                                            "score": 5,
                                                                            "author": "ProjecTJack"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Rito please. Because when they release like 5-10 skins from different champs and they all look the same... boy.",
                                                            "score": 15,
                                                            "author": "SpiritMountain",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have no idea which skin line but the recently new skins that makes karma almost 100% look like classic kalista.",
                                                                    "score": 4,
                                                                    "author": "BouncingDonut",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Or raka skin whose E looks like Lux's E and i wonder why i can't flash it.",
                                                                            "score": 5,
                                                                            "author": "SpiritMountain"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "There are a few straight up obvious advantages to skins in this game too. Not even subjective ones like Project Ashe or Elementalist Lux clarity issues. But like, for example, about half of Caitlyn's skins make her traps completely invisible behind terrain/towers, which is not supposed to be the case.",
                                                            "score": 4,
                                                            "author": "Dryad_Queen",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If it makes you feel better there is a huge clarity issue for everyone in 2021 league. Riot has just gone so overboard with some of the skins lately (dragon lightning lee sin being a good example) that team fights are just big clusterfucks of shining colors.",
                                                    "score": 68,
                                                    "author": "SelloutRealBig",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The first few times I played against that skin, I couldn't distinguish what happened. It felt like Ezreal just one shotted me but then when I checked the enemy champs, there was no Ezreal.",
                                                            "score": 34,
                                                            "author": "longinus7"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I've been playing since shortly after beta and I've always had this problem. It has gotten a lot worse, but I can't remember a time that it hasn't been a nightmare to distinguish things fast enough to react.",
                                                            "score": 19,
                                                            "author": "fistofwrath",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup it's in the video linked above.",
                                            "score": 13,
                                            "author": "GGABueno"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I also remember, I think it was his last split of play there were multiple times where he would just randomly get caught by Xayah feathers in lane and it was cause he just couldn't see them from his colorblindness",
                                            "score": 5,
                                            "author": "Detfs"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was in the video you responded to and the problem was that his grey health looked identical to normal health, so he just looked like he had full HP at all times.",
                                            "score": 6,
                                            "author": "Atheist-Gods"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Fish would never die \n\nIt was hard times",
                                            "score": 4,
                                            "author": "JourneymanJingle"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Awesome video, thanks",
                            "score": 89,
                            "author": "patmax17"
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit this really made me realize that I've been taking seeing colors properly for granted.",
                            "score": 19,
                            "author": "roombaonfire"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for sharing this, it humbled me and made me not take my vision for granted.",
                            "score": 39,
                            "author": "Rocky_Road_To_Dublin"
                        },
                        {
                            "level": 2,
                            "comment": "so they use blue colors to allow colorblind players to see the things in game better",
                            "score": 49,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i have tritanopia (blue-yellow colourblind), so colourblind mode helps me even less.    \nplaying against arclight velkoz makes me hate my life a lot",
                                    "score": 88,
                                    "author": "Aunii",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "which means, you can’t see yellow or blue?\n\nin that case yes, they should definitely enable more variations to allow for better gameplay experience",
                                            "score": 21,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You can see the colors but you can’t distinguish them - to you they look the same. It’s a seemingly minor distinction but it trips a lot of people up cuz they think “oh you just see grey there then?” or whatever",
                                                    "score": 53,
                                                    "author": "ExcellentPastries",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;You can see the colors but you can’t distinguish them \n\nThis is so hard to grasp if you're not colorblind and it's the reason I never tell anyone I'm colorblind unless it's important, it nearly always leads to awkward conversations. I just see colors and sometimes people have different names for colors that look identical to me.",
                                                            "score": 5,
                                                            "author": "hej_hej_hallo"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "i cannot see blue and yellow, that's correct.  \nyellow looks like a very very bright pink for me, almost white  \norange looks like a very grey-ish pink, purple looks like brown, blue and green look the same to me (kind of like turquoise).  \nplaying against the arclight skins is a pain. there was a time when i was so fed up of running into arclight velkoz q, w and r (his e has a red outline and a very obvious animation, so thats not the problem) that i actually started banning velkoz only. i have received a lot of flame for that because velkoz is not really the most popular champion - and there are just straight up better bans.  \nlux is very similar, especially the base form of her elementalist skin, but not nearly as bad as velkoz.  \n\ni even tried using a third party program to change arclight velkoz into his normal base model, but you can get banned for that now, so i had to stop doing that.  \ni just want to be able to play without wasting my ban on velkoz...\n\nedit:  \nthis is how you see league (assuming you have normal vision): https://image.noelshack.com/fichiers/2017/50/2/1513117695-shac-dal.png  \n\nthis is how i see league:  \nhttps://image.noelshack.com/fichiers/2017/50/2/1513107968-screen-pour-riot.png  \n\nif you look at the red buff's hp going down for example... whenever that happens to a champion i cannot tell if they somehow got a shield or if their health is just dropping which is why at the start of every game i make sure to check if there are any champions that can shield, and i press tab a lot to see if anyone can get potential shields. the amount of kills i lost in close 1v1s because i flashed away because it suddenly looked like the enemy got a big shield when that was just the damage i dealt to them... FeelsBadMan",
                                                    "score": 44,
                                                    "author": "Aunii",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This was super interesting to read. I would love to know what arclight velkoz looks like.",
                                                            "score": 5,
                                                            "author": "crescent-stars"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm so thankful I wasn't born with colour blindness. To not be able to fully appreciate the splendour of colour would be horrible, though I suppose a saving grace is that the afflicted don't know what they're missing",
                            "score": 66,
                            "author": "freekymayonaise",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And humans dont even have the best color detection available there are animals that can distinguish bewteen colors better than us",
                                    "score": 57,
                                    "author": "zmdelta09",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Well now they know they are missing out thanks to your comment...",
                                    "score": 79,
                                    "author": "Hanchez",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 64,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We're not.  We know we are missing something, but you try and imagine what other colors would look like.  It's impossible.  So, on the one hand, it sucks, but on the other, it's all I've ever known, so that's just life.  It's like wishing for x-ray vision; would be nice, but it would be weird to get sad about not having it.",
                                                    "score": 22,
                                                    "author": "LTinS"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "We are",
                                                    "score": 14,
                                                    "author": "TheDoct0rx"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Rainbows are three colors",
                                                    "score": 28,
                                                    "author": "HelloIAmRuhri",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm colorblind. I know I'm missing out on the *true* beauty of colors, but I really have no understanding of the depth of what I'm missing. I can tell red and blue apart sure, but really no idea just how beautiful red and blue can be.\n\nI did buy those colorblind sunglasses which require you to be out in the sun for about 20 minutes to get the impact. World definitely looks a little different, but I didn't break down sobbing like you see in some videos.",
                                                    "score": 7,
                                                    "author": "Sup_Computerz",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well there are people who can see more colors compared to normal color vision so in comparison normal vision is missing out on colors as well.",
                                    "score": 14,
                                    "author": "MegaFatcat100",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's time to reject modernity, and return to mantis shrimp",
                                            "score": 10,
                                            "author": "freekymayonaise",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I guess everything with green looks very green, and red doesn't exist. I googled it and saw a bunch of green, yellow, orange and red fruit and vegetables, and apparently they're all just different shades of green and yellow.",
                    "score": 42,
                    "author": "Homogenised_Milk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Red not existing is not the case. People often think that blindness means you can't see those colors. \n\nWhat it means is that you can see 100 shades of red and I can see 3 \n\nSo when reds overlap I can't see them very well cause they're all the same red. Thats why he says singed cloud looks invisible, its not cause he cant see the cloud its cause its green on green.",
                            "score": 88,
                            "author": "blorgenheim",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; People often think that blindness means you can't see those colors. \n\nPeople also think that there is only one kind of red-green colorblindness. It sounds like you have protanomaly (red cone spectrum is shifted too close to green cone), while OP suffers from protanopia (red cone absent). Even within protoanomaly the severity of the spectrum shift can vary drastically.\n\nThis is one of the major issues with colorblind support in video games. Dev team will find a protan (often an existing employee with protanomaly) and work with them to add a \"colorblind mode\" that satisfies that person's vision. They don't know that their solution only works for someone with equal or less severe colorblindness of that type.\n\nAlso, that is why the Enchroma test results say \"Strong Protan color blindness, also known as protanomaly...\" Enchroma glasses are only effective for those with anomalous colorblindness. Telling someone the truth that they have proanopia and that the glasses probably won't help is a lost sale and goes against their (deceptive) marketing.",
                                    "score": 39,
                                    "author": "sypwn",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nobody can see the cupcakes",
            "score": 200,
            "author": "WoIIo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Woah woah woah. It also changes your hp bar to yellow\n\nAnd singed poison turns from green to blue\n\nThat's four whole things total!",
            "score": 1002,
            "author": "MrWedge18",
            "replies": [
                {
                    "level": 1,
                    "comment": "it also changes thresh souls to blue, im not color blind but i like the yellow hp bar",
                    "score": 280,
                    "author": "vY3TIv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But isn't some skins blue naturally?",
                            "score": 40,
                            "author": "SoulMastte",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Imagine playing aram some abilities are just invisible for some ppl",
                                    "score": 67,
                                    "author": "justAnotherRandomP",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not colorblind but elementalist lux blue is OP in ARAM.",
                                            "score": 43,
                                            "author": "WhiteKnightC",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not colorblind but I always enable coloblind mode in competetive games. I dont think I played game where normal color palette was superior to colorblind, its straight up upgrade most of time for both visability and colors feel usualy more fitting/smoother.",
                                                    "score": 5,
                                                    "author": "PM_Best_Porn_Pls"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Warwick blood turns blue AND red",
                    "score": 27,
                    "author": "Chiccybois"
                },
                {
                    "level": 1,
                    "comment": "Changes the color of a number of abilities. The Ziggs abilities all are blue",
                    "score": 10,
                    "author": "NYNMx2021"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Windows -&gt; Control panel -&gt; Ease of access -&gt; Vision -&gt; Color filters.\n\nChanges all the color elements on your screen, not only the Windows UI. No need to enable color blind modes on any games or anything.\n\nEDIT: As u/ScaleCorrect pointed out, You need Windowed Borderless mode in League video settings for it to work!",
            "score": 2656,
            "author": "Lunitar",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who is colorblind, I really wish devs wouldn’t stop there. Blanket filters do fix some things, but they often mess with a bunch of other things too. RGB sliders for most UI elements is by far the best way to be colorblind friendly.",
                    "score": 125,
                    "author": "ASHill11",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I did the enchroma color vision test and got \"moderate deutan,\" turned this feature on and took it again and got \"normal color vision\" so thanks!  I know it's not the same (and there were still some of the numbers that I had to mark \"nothing\" and a few were guesses) as truly normal vision but it definitely helps.  Other things on my screen do look more vibrant.",
                    "score": 23,
                    "author": "PM_ME_YOUR_NOSE_HAIR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just in case you don't realize, sometimes they actually just don't put a number there, and you're supposed to click nothing.",
                            "score": 14,
                            "author": "FiveFiveOneTwo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"For the man who has nothing to hide, but still wants to.\"",
                                    "score": 8,
                                    "author": "PM_ME_YOUR_NOSE_HAIR"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This comment needs to be higher",
                    "score": 121,
                    "author": "Satan_Himselff"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 213,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My keyboard doesn't have a color filters button...",
                            "score": 82,
                            "author": "ItIsHappy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It does,  ironically,  if you're colorblind you just can't see it.",
                                    "score": 90,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "shit, that explains it then",
                                            "score": 10,
                                            "author": "ItIsHappy"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Windows search is fantastic until it decides not to find what you are looking for.",
                            "score": 7,
                            "author": "Huzah7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Windows search literally cannot find Discord when I search for it. I made a shortcut the other day just for Discord.",
                                    "score": 3,
                                    "author": "RuneKatashima",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I turned that on a couple years ago and never looked back. It's surprisingly effective.",
                    "score": 8,
                    "author": "toomuchperfume"
                },
                {
                    "level": 1,
                    "comment": "As someone with severe Red-Green Blindness, Filters often don't help at all or make it even worse.",
                    "score": 9,
                    "author": "Boredy0",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Bro you legit just changed my life a little bit holy shit",
                    "score": 3,
                    "author": "ItsTheGucc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very happy to hear that! :)",
                            "score": 3,
                            "author": "Lunitar"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What [form of colorblindness](https://en.wikipedia.org/wiki/Color_blindness#Classification) do you have specifically where this works for you? Color filters are generally only effective for less severe (anomalous) forms of colorblindness, and that includes Enchroma glasses. OP suffers from protanopia which is one of the most severe forms.\n\nSource: Friends with another protanopian who is effectively an expert on the subject and has tried every color filter known and even invented a few.\n\nEdit: Even [the Windows settings you speak of](https://i.imgur.com/YBrof2R.png) prove they don't know what they are talking about:\n&gt; Red-Green (red **weak**, protano**pia**)\n\nProtanomaly = red weak (spectrum shifted, specifically)  \nProtanopia = red absent",
                    "score": 25,
                    "author": "sypwn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im not colorblind but im using colorblind mode lol",
            "score": 89,
            "author": "fadedv1",
            "replies": [
                {
                    "level": 1,
                    "comment": "lmao same here. makes my hp bar more distinguishable.",
                    "score": 30,
                    "author": "valevalentine"
                },
                {
                    "level": 1,
                    "comment": "It feels like colourblind mode is much easier on the eyes even if you aren't colourblind",
                    "score": 19,
                    "author": "Pavlo100"
                },
                {
                    "level": 1,
                    "comment": "Same I just always had it on. I still can't see the cupcakes tho",
                    "score": 11,
                    "author": "BurkeTheKilla",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What cupcakes?",
                            "score": 3,
                            "author": "RICH_PENZOIL"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone who is color blind myself,  I need to give an absolute \"fuck you\" to whoever designed the blood moon particle effects. \n\n***[ESPECIALLY BLOOD MOON ZILEAN](https://youtu.be/fmGG3oJxxT4)***",
            "score": 40,
            "author": "Yazkin_Yamakala",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a colorblind Zilean fan myself, I completely agree.\n\nAnd it's by *far* the best Zilean skin. Groovy Zilean used to be good but [oh god oh fuck](https://static.wikia.nocookie.net/leagueoflegends/images/3/38/Zilean_GroovySkin.jpg/revision/latest/scale-to-width-down/1000?cb=20181021191639).\n\nI just bite the bullet, use the blood moon skin, and suck. I blame this entirely for me being a lifetime bronze player.",
                    "score": 3,
                    "author": "ItIsHappy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro syndras justicar skin is so freaking pay to win if you are colourblind it is insane. I am already tilted if I have to lane against that skin. Same goes for some lux skins and countless other skins. But hey people are asking for changes for years and nothing happens at all.",
            "score": 72,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That skin is banned from pro play. Always wondered why but i assume its because of this",
                    "score": 20,
                    "author": "KILLERCRACK"
                },
                {
                    "level": 1,
                    "comment": "Hard agree on the Lux skins. I can barely see half her abilities on the galaxy skin or whatever it’s called.",
                    "score": 17,
                    "author": "sillyredsheep"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Real talk you should be able to disable skins.\n\nAs someone who is color blind there are some big offenders where the effects are quite literally invisible. Wish there was more consideration taken because color blindness isn't even that uncommon especially in males.",
            "score": 1812,
            "author": "D4ZR",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 917,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But they should.",
                            "score": 313,
                            "author": "TheMachine203",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it'd be a quick fix, but one thats bad for buisiness and one that might be kinda-feels-bad for people who like showing off their expensive 1's and 0's. \n\nA more comprehensive fix would be to drastically expand the colour blind mode and apply a greater deal of discipline in future skin creation, but that takes money and effort so instead we will get nothing",
                                    "score": 263,
                                    "author": "freekymayonaise",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They already can't restrict themselves so that we can get clear animations/particles/effects and recognizable models, so I wouldn't expect them to make any efforts whatsoever.",
                                            "score": 23,
                                            "author": "amicaze"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If they didn't want to disable skins, the best option would be to completely revamp how the skins are made, and to have colorblind variants of every skin made for the game's colorblind mode.\n\nThat will take substantially more effort than disabling skins, but it would be a huge benefit. Probably even more so than giving the user the ability to disable skins. Sure, it wouldn't be an immediate profit, but it would definitely give the playerbase a boost as more people would be able to play.\n\nUnfortunately, because it isn't directly a profit it's unlikely they'd do any of these things. :/",
                                            "score": 62,
                                            "author": "TheMachine203",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I doubt that if changes were to be implemented about color blindness it would be that way, creating filters for example would make much more sense",
                                                    "score": 19,
                                                    "author": "Alleeeexx",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yea it really wouldn't take much to enable a couple color filters that apply to the entire game.",
                                                            "score": 10,
                                                            "author": "Catskinson",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm NOT colorblind, but I have a colorblind friend who says those \"entire game\" filters don't help much, though they probably vary in effectiveness depending on the colorblindness type, and of course, might be better than literally nothing.\n\nQuick edit: If you ARE colorblind, and those filters help you, I suggest digging a bit into your graphics cards driver settings, as NVIDIA has configurable filters you can apply game-wide, and AMD might have similar settings.",
                                                                    "score": 11,
                                                                    "author": "ThereBeNoNameHere"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The filters for colorblindness SUCK. I haven’t seen a good example in gaming. Might as well as have everything black and white",
                                                                    "score": 4,
                                                                    "author": "Wraith-Gear",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Especially since you can't see shit with the lens flair vfx",
                                    "score": 31,
                                    "author": "Dreamincolr"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think they mean, disable skins on your screen only. Other players can rock their skins, for everyone else to see, but all youd see is their original skins. I think thats fair/doable.",
                            "score": 56,
                            "author": "Loon_Tink",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I wear skins because I like to look at them, not for other people.",
                                    "score": 54,
                                    "author": "PM_ME_STEAM_CODES__",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Some people like to show off what they got to other people, but yeah, I think the majority does this. Theyre dope, I love seeing it, etc.",
                                            "score": 28,
                                            "author": "Loon_Tink",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You are the minority. Most people want skins so everyone can see them in their new suit.",
                                            "score": 7,
                                            "author": "Reynbou"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thats whats being discussed. The argument is people buy skins not only for themselves, but to show off to others.",
                                    "score": 29,
                                    "author": "skrid54321",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Had a dude message me after i played vs him with infernal shen. Used the whiteish chroma, he told me he was barely able to see my champ because of his colour blindness. I wasn't even aware how big of an issue this is for some people!",
                    "score": 39,
                    "author": "madmk2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "my friend has like a list of skins banned from customs just because she can’t see the effects",
                            "score": 18,
                            "author": "TrueDripDamage"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even for people with no problems, new skins all look the same, so for me at least is impossible to distinguish a riven from an ezreal before the fucker jumps on top of me and 100 to 0 me.",
                    "score": 188,
                    "author": "ch3l4s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know what drives me up the wall? Sweeping Lens. You're telling me I need to know the *silhouette* of every skin *and* ward skin in the game just to know if the thing I'm looking at is a player or a ward? Or maybe a shroom?! Why not just make players and wards and traps different colors?",
                            "score": 54,
                            "author": "lenaro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[This is an amumu in the bush and we are about to lose the game right here and there because of it](https://media.discordapp.net/attachments/699260981468987534/788529360553771028/unknown.png?width=1191&amp;height=670)",
                                    "score": 53,
                                    "author": "TipiTapi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "he smol wtf",
                                            "score": 15,
                                            "author": "ScaleCorrect"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For real, I sometimes can't tell who is who. Especially in TFT.",
                            "score": 41,
                            "author": "Andrew8Everything",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is the exact reason I went to settings and changed it to display champion name over health bars instead of player name. \n\nNever going back.",
                                    "score": 54,
                                    "author": "MaximaBlink",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wait you can do that?",
                                            "score": 9,
                                            "author": "VladYur",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yup! Go to In-game, interface, and the 3rd section down is a drop down menu called \"Show Names Above Health Bars\". You can pick none, summoner name, or champion name.",
                                                    "score": 8,
                                                    "author": "MaximaBlink"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Indeed. This new Ornn skin looks like Malphite in some chromas",
                            "score": 10,
                            "author": "Bownaldo"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, and the Dragon something Lee which looks like Lux, gosh\n\nwE cArE aBoUt GaMe cLaRiTy",
                            "score": 8,
                            "author": "leirus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i think that's by far the worst skin in the game, it looks like every other champ",
                                    "score": 7,
                                    "author": "ch3l4s"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 70,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 41,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "At least put multiple color blind modes like Activision did in Warzone",
                            "score": 7,
                            "author": "el1o",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude fuck that Shen skin that makes his ult quiet and invisible. I'm not even colorblind.",
                    "score": 7,
                    "author": "Deathcommand"
                },
                {
                    "level": 1,
                    "comment": "I'm not color blind and some of the snow day skins are egregious on Howling Abyss. Snowday Singed poison is especially bad.",
                    "score": 7,
                    "author": "Xunae",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There is also a second big reason why they should implement this feature: Beginner friendlyness\n\nNot only do beginners have to learn every single ability of each currently 153 champions, they also have to learn which skin belongs to which champion. With currently 1177 collectable skins *(not to mention all these chromas)* I don't really want to know how long it takes for somebody to actually learn this from zero.",
                    "score": 24,
                    "author": "PurerErzbengel",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Skins are garbage. I hate coming back to league and running into an aram against a team of champions that are all 5 years old but not knowing which fucking projectile I'm trying to dodge since they all have some crazy skin I've never seen before.",
                    "score": 6,
                    "author": "Huzah7",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Even if they wanted to have that option in the game (which they will never do), it would fuck up the spaghetti code in ways not imaginable.",
                    "score": 21,
                    "author": "AFKGecko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "first patch: No-skins mode added to the game!\n\nSecond patch: Game has become sentient and enslaved mankind; we are all coded as minions now, hail the great spaghetti lord",
                            "score": 25,
                            "author": "freekymayonaise"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "and then there is this new lee sin skin where you see too much and thought ezreal became a lightning dude or something",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I'm not colorblind and there are still invisible skin skills.",
                    "score": 5,
                    "author": "Burpmeister"
                },
                {
                    "level": 1,
                    "comment": "You should definitely be able to disable some skins manually. For me infernal Shen ult is completely invisible and the amount of time I died because of it is unhealthy.",
                    "score": 5,
                    "author": "ICahriyou"
                }
            ]
        },
        {
            "level": 0,
            "comment": "you'd think coding a color switch would be possible. \n\nA function that changes one color gradient to another like a filter.\n\nedit: apparently Windows 10 has  something of the sort",
            "score": 193,
            "author": "BagelJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "My friend of mine is color blind and he uses a \"Color blind mode\" on windows. As far as I know he perfectly play League of legends.",
                    "score": 28,
                    "author": "ChuzCuenca",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[Windows 10 Colorblind Mode](https://www.reddit.com/r/ColorBlind/comments/ejhkg0/windows_10_colorblind_mode/)\n\n[Colorblind Gaming](https://www.kovaak.com/colorblind-gaming/)\n\nA global solution seems ideal, the above solutions seems like they can help but even better would be something on an OS/GPU level that can be customized for your eyes specifically.",
                    "score": 11,
                    "author": "Avisanix"
                },
                {
                    "level": 1,
                    "comment": "Color blind people have like less colors right so it doesn't sound so easy since LoL uses all colors so some will have to be the same",
                    "score": 66,
                    "author": "ScaleCorrect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's more complicated, but you'd do some math and compress the visible colour spectrum, factoring in the colours you've got to omit for the colour blind players, presumably. There'd still be some clarity issues, but spread it over the remaining spectrum could probably help.\n\nI also think that's how those chroma glasses for blind people work, but this isn't my primary field of expertise.",
                            "score": 35,
                            "author": "ExtendedDeadline"
                        },
                        {
                            "level": 2,
                            "comment": "Well he's talking about implementing a filter rather than repainting all of the textures individually. So that wouldn't be that much work, I'd be more worried about performance.",
                            "score": 8,
                            "author": "DominOss",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yo I sympathize with your issues playing this game, but I don't think they'll be fixed. Riot still hasn't helped out deaf players with sion/kled ults, which is probably a way easier fix than what colorblind players need. All they'd have to do for deaf players to alert them to sion/kled ults is put a little thing in the chat like \"sion/kled ulted watch out!\" But it's not there. I can't imagine them fixing all the indicators in the game for people with colorblindness. :(",
            "score": 142,
            "author": "Baldassre",
            "replies": [
                {
                    "level": 1,
                    "comment": "while it's extremely unlikely they'll add more options for league, at least in valorant it has a bunch of more options for colorblind people\n\nso it's possible the EU servers will crash for a week if they try to implement stuff",
                    "score": 47,
                    "author": "TheExter"
                },
                {
                    "level": 1,
                    "comment": "king nidhogg is a challenger jungler that plays with no gamesound, lots of people like to disable it",
                    "score": 16,
                    "author": "soundcloudraperr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "on what account is he challenger?",
                            "score": 4,
                            "author": "Krytrephex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Orange/blue is a better combo than red/blue any day of the week.",
            "score": 117,
            "author": "Pterigonius",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’re complimentary colors orange and blue, it just makes sense",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree orange/blue looks better, but red and green are also complimentary colours.",
                            "score": 3,
                            "author": "Onyona"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Colour blind mode is made for deutans not protans unfortunately",
            "score": 10,
            "author": "hanzzz123"
        },
        {
            "level": 0,
            "comment": "There should be like 3 different options for different color blindness right ? just like heroes of the storm kinda has or i know overwatch had it like that for sure, and some others",
            "score": 16,
            "author": "StefKRah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Battlefield series has good toggles. Also there is this https://www.pcgamingwiki.com/wiki/List_of_games_that_support_color_blind_mode. League is there so YMMV",
                    "score": 6,
                    "author": "accik",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Leagues colorblind mode is pretty laughable. I've got Blue-Yellow colorblindness and honestly I don't notice a difference outside of my healthbar when it comes to the game. I made so many ranting posts on the boards about it and while I got some rioter responses each one was more lackluster than the last.",
                            "score": 5,
                            "author": "PigeonFacts"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Color-blind option is more useful for regular players than actual color blind people.",
            "score": 35,
            "author": "penguin032"
        },
        {
            "level": 0,
            "comment": "I literally have to dodge if they pick Karthus. His Q is red, and it is literally invisible to me.\n\nSo many skins as well that I physically cannot play against. Some nami skin, can't remember which, has a red bubble. I can't see it. That veigar skin in this vid, the W and E are invisible.\n\nThe cosmic jhin skin is the biggest kick in the dick. His W is sometimes blue and very visible. OTHER TIMES IT'S RED, AND LEGIT INVISIBLE. It legit just randomly changes color mid game. Fucking asinine.\n\nEvery time I play against some shit like this I just want to quit the game, they obviously just don't give a fuck.",
            "score": 43,
            "author": "z5m20i12r04a28",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jhin W changes color depending on if you got recently hit by an enemy and are thus able to be rooted by it.",
                    "score": 8,
                    "author": "ShadowBeatMelisma",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "i get what you're saying but i just want you to know that karthus Q is not red",
                    "score": 18,
                    "author": "patrickkos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The outline is if he's an enemy, that being said neither part of that skill is clear in the least and so much worse on ha where it's exactly the same color as the ground EXCEPT for the red circle which gets covered by literally anything else happening in the area (which happens all the time, cause you know 10 champs 1 lane) which is really annoying since like 5 years ago riot publicly stated clarity was one of their top priorities",
                            "score": 14,
                            "author": "riodin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Visual clarity is for fuckin' losers, just get over your disability :sunglasses:",
            "score": 86,
            "author": "dovahkonj1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean some shit in the game is hard to see even for normal people lol.",
                    "score": 34,
                    "author": "Leupateu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "elementalist Lux's E is basically invisible in her light form",
                            "score": 10,
                            "author": "freekymayonaise"
                        },
                        {
                            "level": 2,
                            "comment": "It's clearly a joke, is /s needed for every sarcastic comment? Visual clarity has been absolutely terrible for a while and it's just getting worse, especially for people with color blindness.",
                            "score": 17,
                            "author": "dovahkonj1",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean Riot is a small indie dev so what do you expect.",
            "score": 70,
            "author": "JohnTheRockCena",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sexual harassment lawsuits",
                    "score": 83,
                    "author": "WhereAreDosDroidekas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve heard they have a lot of combined experience.",
                            "score": 17,
                            "author": "goomy996",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the real 200 years was the women we harassed on the way",
                                    "score": 29,
                                    "author": "AluminiumSandworm"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Riot has an easy fix: just don't be colorblind lmao",
            "score": 10,
            "author": "yehiko"
        },
        {
            "level": 0,
            "comment": "Nearly don't play league anymore but fuck if I'm not upvoting this even though I vote in general. I've had trouble with anyone with two health bars. Pyke, Tahm Kench I basically guess how much HP they have and now I still have colorblind problems in Valorant. Video games NEED to do this better.",
            "score": 16,
            "author": "John9tv",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm not even colorblind and some skins are so hard to play against because I can't see the abilities. Sometimes it's the basic skins too.... I want more visibility please",
            "score": 9,
            "author": "PyrateLife3",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is the one thing Overwatch has over League.",
            "score": 7,
            "author": "Kdog122025",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Has anyone tried using the Windows 10 Colorblind filter with League? I just discovered it and it really makes red pop for me.",
            "score": 7,
            "author": "AsianJam",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm pro protan just like OP and I've got to say, after using the Windows 10 color filter (I use the weak Red one), after taking the Enchroma test again, I've been able to pass to a \"normal\" level. Watching OP's video on my phone vs. on my computer is like night an day now, it's actually amazing.  Can't wait to play some league so I can finally see Xayah's feather on the ground without having to focus really hard on it.\n\n&amp;#x200B;\n\nEdit: Just took it again and got Mild Deutan. Feels bad but I'd rather be able to see Red than Green since League accommodates for Deutan rather than for Protan color-blindness.",
                    "score": 9,
                    "author": "horess89",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Tried it right now and I didn’t know red was so red.",
                    "score": 6,
                    "author": "AsianJam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And as a second update I scored normal color vision instead of my usual mild deutan on EnChroma’s color blind test.",
                            "score": 4,
                            "author": "AsianJam"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "28.34s if I look at this with peripheral vision, it blends together for me.\n\nAm I broken :(",
            "score": 6,
            "author": "FACE_Ghost",
            "replies": [
                {
                    "level": 1,
                    "comment": "That vaguely green 6 on grey? Only one I had to mess around with and pauze to figure out what is was.\nSo maybe we are both broken or it's really unclear.",
                    "score": 3,
                    "author": "Firehot01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every game sucks ass at colorblind options",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "song name?",
            "score": 5,
            "author": "BrownTown123",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Riot has over a billion dollars and they care more about making a kpop girl than making the game more accessible.",
            "score": 5,
            "author": "AwesomeEmmit"
        }
    ]
}