{
    "id": "1103hqp",
    "score": 8,
    "title": "Transfer to ETSU? (Comp Sci)",
    "author": "DAsZenCat",
    "date": 1676164842.0,
    "url": "https://www.reddit.com/r/ETSU/comments/1103hqp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been thinking about the possibility of transferring to ETSU from UNCC, and wanted to see if it would be worth it. Although I do like the program here as it's pretty good, I really don't like the social/campus side of things at this school. I do really like the campus and activities at ETSU because of the friends I have that go there. Is the Comp Sci program and internship opportunities at ETSU good?",
    "comments": [
        {
            "level": 0,
            "comment": "Lots of internship opportunities. Program is highly rated. You can probably transfer in your coursework and not lose credits. Def talk to an advisor. They will help you figure it out.",
            "score": 11,
            "author": "tonypitt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm having a meeting with my Advisor soon, so will do. Really good to hear about the internship opportunities though. Thank you for the info!",
                    "score": 2,
                    "author": "DAsZenCat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s a pretty good Computer Science school. I feel like it has a good mix of theory and practical application.",
            "score": 8,
            "author": "Shawnanonymous",
            "replies": [
                {
                    "level": 1,
                    "comment": "A good mix like that is very good to hear. Thanks!",
                    "score": 3,
                    "author": "DAsZenCat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got my BS and MS there.  ETSU has a top notch program.  Highly recommend.",
            "score": 6,
            "author": "albybum"
        },
        {
            "level": 0,
            "comment": "For sure talk to an adviser about what classes will transfer. You don't want to lose a lot of progress toward a degree if you've already made it pretty far at UNCC. However, if it is only two or three repeats, then I say go for it! Internships shouldn't be a problem as the program has a special person just for that named Melinda LaPrade. She is really good at placing students with local/regional businesses for internships and with jobs right after graduation.",
            "score": 4,
            "author": "DaleGribble88",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fact that there is a special person designated for that is awesome and sounds very useful. Luckily I'm not that far in my degree, since this is only my second semester. I'll see what my advisor has to say and decide if I'll go for it! Thank you!",
                    "score": 3,
                    "author": "DAsZenCat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please don’t do it find somewhere better",
            "score": 2,
            "author": "CombinationFuture814"
        }
    ]
}