{
    "id": "g9h3tw",
    "score": 4,
    "title": "Suppose Someone Were To Sit In On Classes Without Being Enrolled",
    "author": "agwade97",
    "date": 1588050782.0,
    "url": "https://www.reddit.com/r/ETSU/comments/g9h3tw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just supposing...if they were there purely because they wanted to learn and had no desire for grades or degrees... How easy do you think it would be to just walk in on classes? Assuming the person was a small female in her early twenties who may or may not look like she already belongs in the art department anyway...? \n\nOut of curiosity...\n\nC U R I O S I T Y",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the correct answer. In 2020 there is no reason not to just use a MOOC",
                    "score": 4,
                    "author": "battle_hardend"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are not interested in pursuing a degree but would like to take an undergraduate course for professional reasons or personal interests, we would love to have you! New applicants will need to submit the non-refundable $25 application fee.\n\nIf you have previously attended ETSU, complete the undergraduate application online, and select Undergraduate Special as your major on the application.",
            "score": 4,
            "author": "semideclared"
        },
        {
            "level": 0,
            "comment": "Depends how big the class is, if it’s in an auditorium then you’d have no problem, but in a regular classroom you’d stick out like a sore thumb.",
            "score": 3,
            "author": "Beareater1"
        },
        {
            "level": 0,
            "comment": "In addition the size of the class, it would also depend on the department and the level of the class. If it's a small department and a high level class, the professor probably knows everyone in the room. If the class typically has a bunch of freshmen from you'd have a chance even in a regular room, assuming you show up the first day. \n\nEarly on if you get caught and can act like you're in the wrong room. It'll be more difficult later. You'll have to figure out how to handle tests and other work that might get turned in or returned during class.",
            "score": 3,
            "author": "Nonthares"
        }
    ]
}