{
    "id": "n6jxe9",
    "score": 5,
    "title": "Calculus based physics or naw?",
    "author": "angryhydrogen",
    "date": 1620341162.0,
    "url": "https://www.reddit.com/r/ETSU/comments/n6jxe9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I am transferring to ETSU for the fall semester and I have the choice to take a calculus or algebra based physics. I really enjoy calculus, but am not sure if I want to dive into a class that is going to take up a ton of brain space and time. I am a biochem major, so I have other intense classes I also need to focus on. Any insight?",
    "comments": [
        {
            "level": 0,
            "comment": "I mean it depends on why you’re taking physics.  If it’s part of a related major, then calc-based with Hahelburg could be great.  If you’re just taking physics as a pre-requisite course, then it isn’t worth the trouble.",
            "score": 3,
            "author": "ED_Medicine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 2,
                    "author": "angryhydrogen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "who are your options for calc based physics cause i loved my professor",
            "score": 2,
            "author": "WraithTanker",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hagelberg!",
                    "score": 2,
                    "author": "angryhydrogen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Eyy, I'm a biochem major as well and just finished up my semesters with calc. based physics I and II along with my other chem and biochem classes, however I did have it with Giroux. \n\nOut of all of my classes those semesters, they were certainly the easiest courses I had, other than a gen. ed., and it really wasn't too bad at all. Because it was online and everything though, I can't really speak for how much more of a commitment in person is going to be. \n\nI was also looking forward to using more calculus in the course too, but we really only used calculus tools as proofs and anytime we'd have our own problems we never actually did calculus, so there's that. I can't speak to how a different professor will do things though. \n\nOverall though it's still certainly not a cakewalk and there isn't a ton of benefit to taking it over algebra based. Honestly more than anything you might become just more familiar with concepts by allowing them to be presented with calculus rather than their algebra workarounds.",
            "score": 1,
            "author": "Yeet26"
        }
    ]
}