{
    "id": "onpz8k",
    "score": 6,
    "title": "How good is the food at ETSU?",
    "author": "Interesting_Grape815",
    "date": 1626737393.0,
    "url": "https://www.reddit.com/r/ETSU/comments/onpz8k",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a graduate student living on campus and I was considering getting a meal plan. But I wanted to know how good the food is and some of the dining options that the school has to see if it’s worth it get a meal plan or just cook/meal prep.",
    "comments": [
        {
            "level": 0,
            "comment": "I had the Silver Plan when I lived on campus and honestly really liked the meals there but couldn't justify keeping it when it's so expensive. If you have the money to spare and don't feel like cooking, go for it, but otherwise you're a lot better off buying your own food.",
            "score": 6,
            "author": "sad-wendall"
        },
        {
            "level": 0,
            "comment": "I'm going to copy a chunk of an answer I made a couple months ago when someone was asking about meal plans:\n\n&gt;For the 7-Day plans, there are three tiers: Silver, Gold, and Platinum. The two higher tiers are not at all worth it, in my opinion. The best way to use the meal plans are to take advantage of the Marketplace dining hall and use the dining dollars as a special treat on occasion. With the meal plan, each student is able to enter the dining hall four times per day: Breakfast, Lunch, Dinner, and Late Night. The offerings in the dining hall are, under normal conditions, greatly varied and most of the food is decent to very tasty. You and your daughters can view previous menus at [this link](https://menus.sodexomyway.com/BiteMenu/Menu?menuId=14750&amp;locationId=10481001&amp;whereami=https://etsu.sodexomyway.com/dining-near-me/resident-dining); there are some things - such as pizza/burgers/etc. - offered daily while other things rotate. There are also special themed days and events in the dining hall throughout the semester.\n\nThe upfront cost is high (because you're paying for all of your meals for months at once) but, if you take advantage of it, the cost per meal is low; the one undergrad semester I was truly able to take advantage of it, my meal cost was something like $2.57 each. My other undergrad semesters at ETSU were Spring '20, Fall '20, and Spring '21 and well...\n\nThat being said, coming back as a graduate student this Fall and as someone that will be on campus M-F most every week I'll definitely be getting the meal plan once again.\n\n&amp;#x200B;\n\nEdit: Everything above is about the dining hall (of which there is only one, but it's large for a school the size of ETSU and essentially brand new.) The other options on campus are Chick Fil A, Mein Bowl (\"Asian\" noodle dishes and limited sushi selection,) Steak n Shake, a deli in the BucMart convenience store, Einstein's Bagels in the library, a grab &amp; go sandwich/wrap/salad place that's essentially an extension of the dining hall located across campus, and a Subway in the parking garage.",
            "score": 2,
            "author": "AmittaiD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thank you",
                    "score": 2,
                    "author": "Interesting_Grape815"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It honestly depends on what type of person you are. If you're really gonna cook then just cook. But if you're like me and you're cooking/meal prep is making Mac and cheese cups then you probably want a meal plan.",
            "score": 2,
            "author": "RedditTrash319"
        },
        {
            "level": 0,
            "comment": "I graduated in 2013, so it's out of date. But I thought the food was nasty compared to my undergrad school. I wish I cooked instead",
            "score": 1,
            "author": "humm1n984D93R",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know you make it clear your information is nearly a decade out of date, but just wanted to tack onto that that the food service provider isn't even the same now as it was then. Everything, including facilities, is entirely different.",
                    "score": 5,
                    "author": "AmittaiD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol good, I'm glad it's gotten better!!",
                            "score": 3,
                            "author": "humm1n984D93R"
                        }
                    ]
                }
            ]
        }
    ]
}