{
    "id": "q1yp7b",
    "score": 6,
    "title": "Best barber in jc",
    "author": "LeatherHead2902",
    "date": 1633447437.0,
    "url": "https://www.reddit.com/r/ETSU/comments/q1yp7b",
    "media_urls": [],
    "other_urls": [],
    "postText": "Best male barber in jc?",
    "comments": [
        {
            "level": 0,
            "comment": "It's 100% the guys at JC Male. I used to be one of those that went to sports clips, etc. Kenny at JC Male transformed how I feel and look. A friend suggested him, and I just told him \"Do what you think would look good\" and thats been my look since.\n\nKenny is always booked out about a month, but his other employees usually have a shorter wait time. I'd suggest Seth or Matt if you can't wait for Kenny.",
            "score": 5,
            "author": "Hookeo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can second this! I've always gotten a great cut every time I've been. Nick has cut my hair for almost 2 years now and I've been very satisfied every time. (just got it cut today!)",
                    "score": 2,
                    "author": "chuckfandler"
                },
                {
                    "level": 1,
                    "comment": "Went to JC Male because of this recommendation. Great place. Will be my go to place from now on.",
                    "score": 2,
                    "author": "tonypitt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ay man, glad you enjoyed your experience. 😊",
                            "score": 1,
                            "author": "Hookeo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go hit my guy Jake @ King of Hearts. Keeps me crispy year round.",
            "score": 3,
            "author": "ztch10"
        },
        {
            "level": 0,
            "comment": "I went to Cherokee barber shop when I was in school up there. Believe his name was Bobby Dickens or something like that. Went to him for a few years. It’s a really good barber shop.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Second this, Bobby is the man and for $12 you get an experience and a great cut \n\n10/10",
                    "score": 1,
                    "author": "jakerysbakery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "BreakerBarber. Preston or Cody are my go-to. \n  \n [Instagram](https://www.instagram.com/breakerbarbercompany/) | [Website](https://breakerbarber.co/)",
            "score": 1,
            "author": "mcfeeben",
            "replies": [
                {
                    "level": 1,
                    "comment": "I went by there today! I had Devan! Absolutely fantastic shop and barbers. They earned themselves a regular!",
                    "score": 2,
                    "author": "LeatherHead2902",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ayy, that’s my cuz",
                            "score": 1,
                            "author": "Amazing_Counter_1534"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love breaker barber. Clara does a fantastic job",
                    "score": 2,
                    "author": "starwestsky"
                }
            ]
        },
        {
            "level": 0,
            "comment": "cloe winters at premier cosmetology (she’s a close friend figured i’d plug her lol she cuts mine i always like it a lot)",
            "score": 1,
            "author": "easternearlobe"
        }
    ]
}