{
    "id": "13419c6",
    "score": 1,
    "title": "ADHD Brain Storm: Proven Drug Free Strategies for Parenting Kids with ADHD, Anxiety, Motivation and Executive Functioning Challenges",
    "author": "PuraVida8665",
    "date": 1682884374.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/13419c6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Written by an experienced ADHD and Executive Functioning coach, teacher and parent, this book provides a wealth of practical tips, tools, and techniques that can be easily implemented at home to support your child's success.\n\nThe book covers a wide range of topics, including understanding ADHD and Executive Functioning, managing Anxiety and Emotional Regulation, promoting Motivation and Goal-setting, improving Focus and Health, and creating effective routines and systems.\n\nEach chapter includes real-life examples, exercises, and Parental Action Items to help parents and their kids apply the strategies to improve thier lives.\n\nWith ADHD Brain Storm, you'll learn how to:\n\nCreate a positive and supportive home environment\nSet goals and use proven motivation strategies\nUse effective practices to improve focus\nUnderstand and manage symptoms of Anxiety\nTeach your child how to manage their time, prioritize tasks, and stay on task\nBuild self-esteem and resilience in your child\nUnique Homeschooling tips from an experienced teacher\nAnd Much More!\nWhether you're a parent of a newly diagnosed child or a seasoned veteran of the ADHD parenting journey, ADHD Brain Storm is a must-read for anyone looking for practical and effective strategies to help their child thrive",
    "comments": [
        {
            "level": 0,
            "comment": "FREE May 1-2",
            "score": 2,
            "author": "PuraVida8665"
        },
        {
            "level": 0,
            "comment": "This link points to an ebook that is no longer free (current price: $9.99), and consequently has been marked as expired.\n\n---\n\n^(*I am a bot. If I have made a mistake, please message the moderators.*)",
            "score": 2,
            "author": "freeEBOOKS-Batman"
        },
        {
            "level": 0,
            "comment": "[When you are getting free ebooks from Amazon do not use the \"Read for Free\" button. You should use \"Buy Now\" while the kindle price is $0.00. \"Read for Free\" is Kindle Unlimited which requires payment.](https://www.reddit.com/r/FreeEBOOKS/comments/9nrez4/when_you_are_getting_free_ebooks_from_amazon_do/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FreeEBOOKS) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}