{
    "id": "13fpdb3",
    "score": 3,
    "title": "Last of the Wild Days - final day of dark fantasy free Ebook promotion",
    "author": "Tesfiends",
    "date": 1683907758.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/13fpdb3",
    "media_urls": [],
    "other_urls": [
        "https://www.amazon.com/Last-Wild-Days-One-ebook/dp/B09H6B52Y9](https://www.amazon.com/Last-Wild-Days-One-ebook/dp/B09H6B52Y9)"
    ],
    "postText": "Last of the Wild Days by Daniel J Loney - Free Ebook until May 13th\n\nA new epic dark fantasy series in a world where herbivorous Foragers live in constant fear of carnivorous Flesheaters...\n\nAgainst a setting that mirrors the beauty and brutality of our own natural world, it is a story of someone born into one way of life but raised in another, who must ultimately decide where their identity lies, what is right and wrong, and what the meanings of friendship and family truly are to them.\n\n'For Brackenhal, Merri and their last remaining cub, life in the rugged wilderness of the Storm Cairns is a continuous struggle. Plagued by hunger, exposure to the elements and carnivorous Flesheaters who are picking their fellow Foragers off one by one, they are fleeing a brutal and seemingly unending winter in search of kinder lands than their own. Along their path, they discover an abandoned fox cub lying in the snow. Despite foxes being some of the most feared and cruel of all Flesheaters, they decide to raise the cub as their own. Meanwhile, another creature born of winter itself is uniting the Flesheaters under one creed to begin a great hunt, and while the Foragers raise their orphaned cub in little knowledge of the looming threat, the Wintergazer is ever growing in both power... and hunger'\n\nAs well as for use of setting, the animals and their various values and attitudes towards one another are intended as a satirical reflection of humanity, exploring mature and complex themes from our own history that are still largely present today such as tribalism, prejudice, slavery, faith and greed.\n\nStarting today and running until May 13th, the Ebook is completely free, all you need is the free Kindle app for Android or IOS. Here's the link...\n\n[https://www.amazon.com/Last-Wild-Days-One-ebook/dp/B09H6B52Y9](https://www.amazon.com/Last-Wild-Days-One-ebook/dp/B09H6B52Y9)",
    "comments": [
        {
            "level": 0,
            "comment": "[When you are getting free ebooks from Amazon do not use the \"Read for Free\" button. You should use \"Buy Now\" while the kindle price is $0.00. \"Read for Free\" is Kindle Unlimited which requires payment.](https://www.reddit.com/r/FreeEBOOKS/comments/9nrez4/when_you_are_getting_free_ebooks_from_amazon_do/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FreeEBOOKS) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "This link points to an ebook that is no longer free (current price: $3.99), and consequently has been marked as expired.\n\n---\n\n^(*I am a bot. If I have made a mistake, please message the moderators.*)",
            "score": 1,
            "author": "freeEBOOKS-Batman"
        }
    ]
}