{
    "id": "13szqan",
    "score": 4,
    "title": "What To Do At the End of the World free 5/27 and 5/28",
    "author": "Realistic_Bite1872",
    "date": 1685167931.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/13szqan",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[When you are getting free ebooks from Amazon do not use the \"Read for Free\" button. You should use \"Buy Now\" while the kindle price is $0.00. \"Read for Free\" is Kindle Unlimited which requires payment.](https://www.reddit.com/r/FreeEBOOKS/comments/9nrez4/when_you_are_getting_free_ebooks_from_amazon_do/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FreeEBOOKS) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "C-level entertainer Jackson Wild has just found out that the sky is falling. Literally. He's been hired by the government to do a public service announcement convincing the public that everything will be okay, when, in reality, no one has more than ten days left on the planet. When one of the government scientists hides out in his home, Jack decides to take him on the run across America, in a desperate attempt to see everything they can, and say goodbye to their loved ones before the world ends. Along the way, the two ruminate on life and love, find all that's been missing, and learn to truly live. It's a funny and heartfelt adventure across America and the hearts and souls of two men with nothing left to lose.  \nThis 10th anniversary edition also features excerpts from upcoming projects.",
            "score": 1,
            "author": "Realistic_Bite1872"
        },
        {
            "level": 0,
            "comment": "This link points to an ebook that is no longer free (current price: $4.99), and consequently has been marked as expired.\n\n---\n\n^(*I am a bot. If I have made a mistake, please message the moderators.*)",
            "score": 1,
            "author": "freeEBOOKS-Batman"
        }
    ]
}