{
    "id": "13tymoi",
    "score": 2,
    "title": "The Traitors We Are #spfbo entry is free till June 1st",
    "author": "leadchainsaw",
    "date": 1685274828.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/13tymoi",
    "media_urls": [
        "http://mybook.to/thetraitorsweare"
    ],
    "other_urls": [],
    "postText": "My SPFBO9 book, The Traitors We Are, is free until June 1st. Blurb below:\n\nIn a world where writing disappears when the author dies, 22-year-old Cael Oberlan watches the last gasping breaths of his best friend. He pulls a scrap of paper out of his pocket as his friend’s signature fades. Cael only wants vengeance for his friend and to create a reality where he no longer has to bow before any man. However, the nagging suspicion that his father, who started this war, hasn't given him the whole story about his role in this conflict threatens to unravel everything he ever thought he knew about himself and the people he is fighting to free.\n\nAs nephew of the King, 24-year-old Emil Trestinsen should be a hero. He should already hear his name echoing in celebration in the streets of the capital. In a young life already full of disappointment, the lack of recognition for ridding the kingdom of \"Ruinous\" Lorcen Oberlan may prove to be the final push he needs to seize his destiny. He will prove his worth to his family and his nation. He will end this rebellion and take his rightful place as the next governor of the rebels.\n\nWhen 18-year-old Merily Oberlan receives letters from the frontlines, and the top one is blank, she is devastated to realize one of her loved ones has died in battle. She is determined to help bring an end to this bloody war and be strong for her people, a cultural and religious minority in the kingdom of Harfal.\n\nWhat started as a simple rebellion transforms into a complicated web of lies, betrayal, and difficult decisions no one should have to make. It is a race against time and death as handwriting continues to disappear, erasing the contracts and historical records necessary for peaceful negotiations.",
    "comments": []
}