{
    "id": "g5shn7",
    "score": 886,
    "title": "No idea how graphic novels work on a Kindle, but Neil Gaiman's Sandman #1 is free on Amazon right now",
    "author": "oceanrainfairy",
    "date": 1587520513.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/g5shn7",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "If this is the same deal as Comixology (which considering they're both owned by the same company, it should), there's way more than just the first issue of Sandman available. DC dropped a whole bunch of the first issues of some of their biggest stories, like Batman: Year One, All-Star Superman, Watchmen, V for Vendetta, and newer classics like Dark Night: Metal, Batman: White Knight, and Harleen.\n\nSadly I don't think there's an easy list for it on kindle, [but here it is on Comixology](https://www.comixology.com/DC-Essential-Reads/page/23690). I think you can either sign up for comixology and connect it to your kindle, or just search for the issues on Amazon/kindle store.",
            "score": 50,
            "author": "Jay_R_Kay",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do you connect it to you Kindle decice?",
                    "score": 2,
                    "author": "seething_stew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is an app for Comixology. You can create an account for Comixology, OR you can just sign in using your Amazon account. \nAmazon owns Comixology. \nYou can currently get a 60 day FREE trial to Comixology where you can basically read anything they have in their Unlimited selection. Or you can purchase items from within the Comixology App. There are TONS of items available, daily and weekly deals and as I said a lot of Free Unlimited items(typically you can read the first couple of graphic novels in a series such as Locke and Key or The Walking Dead, but then you will have to buy the later books if you want to continue)\nJust be aware that graphic novels can be pretty expensive. Like $24.99 for some books. DC and Marvel put a lot of stuff on sale for $4.99-9.99....so make sure you check prices",
                            "score": 5,
                            "author": "SoulSlayer99"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No! Don’t fall for it, it’s a trap! You see, they give you one Gaiman comic book for free, but that’s all it takes for Gaiman to get his claws into your brain and then you feel compelled to buy the next one, and the next one, and the next. If that happens then you could wind up with a three book a week habit as you steal money from family and friends to feed your Gaiman addiction.",
            "score": 74,
            "author": "Mange-Tout",
            "replies": [
                {
                    "level": 1,
                    "comment": "Falls under ‚It‘s a good pain‘ tho",
                    "score": 15,
                    "author": "El_Duderino6"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s a sad, tragic tale that I know all too well. The shelf full of Gaiman books in my library attests to that.",
                            "score": 8,
                            "author": "Mange-Tout"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a risk I'm willing to take :)",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I already bought the first three volumes. lol. Haven't started, but I'm almost certain I'll love it. I'll probably get it started after I finish *Invincible Ultimate Collection 5.*",
                    "score": 5,
                    "author": "Dvanpat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Cereal Convention is in one of the first volumes, and that’s the story that really showed me what Gaiman could do.",
                            "score": 3,
                            "author": "Mange-Tout"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I lived in a small town down south the only place to get a good coffee was a bookstore.... I've never failed that while waiting for my coffee I bought another Neil Gaiman book. The addiction is real.",
                    "score": 1,
                    "author": "blitz672"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[When you are getting free ebooks from Amazon do not use the \"Read for Free\" button. You should use \"Buy Now\" while the kindle price is $0.00. \"Read for Free\" is Kindle Unlimited which requires payment.](https://www.reddit.com/r/FreeEBOOKS/comments/9nrez4/when_you_are_getting_free_ebooks_from_amazon_do/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FreeEBOOKS) if you have any questions or concerns.*",
            "score": 20,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Why is this sub not named r/FreEbooks?",
            "score": 26,
            "author": "Roestkartoffel"
        },
        {
            "level": 0,
            "comment": "Here are all the local Amazon links I could find:\n\n\n[amazon.com](https://www.amazon.com/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.co.uk](https://www.amazon.co.uk/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.ca](https://www.amazon.ca/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.com.au](https://www.amazon.com.au/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.in](https://www.amazon.in/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.com.mx](https://www.amazon.com.mx/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.de](https://www.amazon.de/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.it](https://www.amazon.it/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.es](https://www.amazon.es/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.com.br](https://www.amazon.com.br/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.nl](https://www.amazon.nl/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.co.jp](https://www.amazon.co.jp/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\n[amazon.fr](https://www.amazon.fr/gp/product/B00CIGXTAM?notRedirectToSDP=1&amp;ref_=dbs_cmx_calw_2&amp;storeType=ebooks)\n\nBeep bloop. I'm a bot to convert Amazon ebook links to local Amazon sites.\nI currently look here: amazon.com, amazon.co.uk, amazon.ca, amazon.com.au, amazon.in, amazon.com.mx, amazon.de, amazon.it, amazon.es, amazon.com.br, amazon.nl, amazon.co.jp, amazon.fr, if you would like your local version of Amazon adding please contact my [creator](https://www.reddit.com/user/underachievingnerd).",
            "score": 20,
            "author": "amazon-converter-bot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good bot",
                    "score": 3,
                    "author": "seething_stew"
                },
                {
                    "level": 1,
                    "comment": "It’s not free on Amazon.ca",
                    "score": 4,
                    "author": "Kara_S"
                },
                {
                    "level": 1,
                    "comment": "Good bot",
                    "score": 2,
                    "author": "seething_stew"
                },
                {
                    "level": 1,
                    "comment": "Who's a good bot? You're a good bot. Yes you are!",
                    "score": 2,
                    "author": "romaxy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As someone with both Amazon and Comixology accounts, I can shed some light on how it works.\n\n###From the purchasing side:\n\nWhen you buy a graphic novel (or in the case of this link, a single issue), it gets linked to your account. If you buy it on Amazon and it's listed as \"Kindle &amp; comiXology\" then the purchase gets credited to both your Amazon account and your comiXology account as a cross-buy. This is where you have to watch out for the \"gotcha\" - Amazon and comiXology, while technically both the same company, don't always credit your purchases to both accounts.\n\nThis means that if the book isn't listed as \"Kindle &amp; comiXology\" on Amazon and you buy it on Amazon, then you only have it on the Amazon side of the equation and you have to download it through the Kindle app. The really messed up part is that cross-buy situation only works from Amazon's side of the equation. ComiXology purchases are ONLY ever credited to your comiXology account - they don't trickle back over to your Amazon/Kindle ecosystem.\n\nMy suggestion for anyone wanting to get into (legal) e-comics would be this: if you've set yourself up with both a comiXology and Amazon account, and you are browsing comiXology, head over to Amazon and check to see if the same book is listed there. While comiXology has a wider selection, if it's listed on Amazon it also might be at a different (i.e cheaper) price. The two sides of the store will frequently have different prices on the same book, and Amazon runs sales a lot more often than comiXology does. If you do decide to pull the trigger on buying an e-comic, consider buying it on Amazon if it has the cross-buy. Also, pay attention to whether you're looking at single issues versus collected volumes. Nine times out of ten it's cheaper in the long run to get the collections than it is to buy the singles.\n\n\n###From the reading side:\n\nDepending on where you bought it you can download the books either directly through the Kindle app, or you may have to load up the comiXology app if you got it over there. Either way, you'll have to wait for the download, and comic files aren't exactly small. Make sure you have enough storage space on your device to hold what you're downloading. I also recommend using a larger tablet (minimum 8\", preferably 10\") to read the books. While both the Kindle and comiXology apps allow for doing a panel-by-panel guided read that zooms in on the page, that interface can be clunky, and trying to read full pages on a smaller screen can be headache-inducing. Beyond that, the reading is about the same on both apps.\n\nHope this helps shed some light on the purchasing and reading experience through both Kindle and comiXology!",
            "score": 8,
            "author": "techparadox"
        },
        {
            "level": 0,
            "comment": "Bugger!  Not available in Australia.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Thank you! I was literally looking at this earlier today and was considering buying it!",
            "score": 8,
            "author": "halogirl492"
        },
        {
            "level": 0,
            "comment": "Nice find. Thank you!",
            "score": 3,
            "author": "fooflam"
        },
        {
            "level": 0,
            "comment": "Ty",
            "score": 2,
            "author": "lazyluffy"
        },
        {
            "level": 0,
            "comment": "The first three volumes are also available on kindle unlimited. You could easily read them with a 30 day free trial.",
            "score": 2,
            "author": "NovaAuroraStella"
        },
        {
            "level": 0,
            "comment": "Awesome! I was literally jyst reccomended this book!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "BY THE WAY: This is only ISSUE 1 of the series, not the Collected volume known as \"Preludes and Nocturnes\"\nedit: volume came out as plume*",
            "score": 2,
            "author": "SoulSlayer99"
        },
        {
            "level": 0,
            "comment": "thanks so much for sharing :)",
            "score": 1,
            "author": "human_experiment_"
        },
        {
            "level": 0,
            "comment": "Thank you!!",
            "score": 1,
            "author": "TwoDudesAtPPC"
        },
        {
            "level": 0,
            "comment": "Thank you, this is awesome way to start a day! You have guided view for graphic novels, if really quite comfortable to read.",
            "score": 1,
            "author": "hello_mellon"
        },
        {
            "level": 0,
            "comment": "And of course only in the US... Damn it!",
            "score": 1,
            "author": "kagento0"
        },
        {
            "level": 0,
            "comment": "Ty! Just finished it",
            "score": 1,
            "author": "livingaudio"
        },
        {
            "level": 0,
            "comment": "That awkward moment when I get excited to see a deal and then realize I've had it since 2013 and just never read it.",
            "score": 1,
            "author": "Arkalyn"
        },
        {
            "level": 0,
            "comment": "thanks for the heads up",
            "score": 1,
            "author": "tiny-starship"
        },
        {
            "level": 0,
            "comment": "If you use the same Amazon login for the Kindle and the Comixology app, all the comics you bought for the Kindle will show up in a 'From Kindle' section.  Just download them to the Comixology app and read them.",
            "score": 1,
            "author": "raekle"
        },
        {
            "level": 0,
            "comment": "***UNCONTROLLABLE SOBBING***",
            "score": 1,
            "author": "Billyxransom"
        },
        {
            "level": 0,
            "comment": "THANK YOU!!",
            "score": 1,
            "author": "DreamCyclone84"
        },
        {
            "level": 0,
            "comment": "Amazing, thanks!",
            "score": 1,
            "author": "RiccFerrari"
        },
        {
            "level": 0,
            "comment": "Sadly this doesn’t work for the Canadian store.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Unless you’re using Kindle Fire or a tablet with the kindle app, I don’t think it’s worth it. You get no color and most graphic novels use color, most of the kindle models are way to small for A4 or letter sized originals to get good resolution on shrinkage. \n\nI went to a good used book store and picked up preludes &amp; nocturnes For only a few bucks. I’ve decided anything with visuals is gonna have to remain in my paper library.",
            "score": 1,
            "author": "PurpleT0rnado"
        }
    ]
}