{
    "id": "i3n8d0",
    "score": 712,
    "title": "What Fox News Doesn't Want You To Know: The Nazis weren't left-wing socialists. They were hardcore right-wing capitalists. Hitler was a tax-evading billionaire who used his office to enrich himself. Sound familiar?",
    "author": "OliverMarkusMalloy",
    "date": 1596560853.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/i3n8d0",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hi friends!  \n\nHere is a reminder form your friendly neighborhood moderators - please be mindful of rule 3 of r/FreeEBOOKS: Do Not Be an Asshole.  \n\nA common way folks are an asshole is name calling, please refrain from calling one another names in the comments here. \n\nThank you for your attention.  \n\nEDIT: comments now locked, apparently we cannot avoid calling one another names.\n\nIf you are interested in looking at books that are generally less controversial in nature I recommend checking out the many older classic books that can be downloaded for free from [Project Gutenberg](http://www.gutenberg.org/ebooks/search/?sort_order=downloads).\n\n[300 science fictions short stories](https://www.reddit.com/r/FreeEBOOKS/comments/g40xb5/here_are_300_free_short_science_fiction_stories/)\n\n[200 more science fiction short stories](https://www.reddit.com/r/FreeEBOOKS/comments/g652qa/here_are_200_more_free_science_fiction_short/)\n\n[50 free books on etiquette](https://www.reddit.com/r/FreeEBOOKS/comments/elugel/here_are_50_free_ebooks_on_etiquette_and_proper/)\n\n[115 free fairy tale books](https://www.reddit.com/r/FreeEBOOKS/comments/ehvu4m/here_are_115_free_fairy_tale_ebooks_from_project/)\n\n[100 free mythology books](https://www.reddit.com/r/FreeEBOOKS/comments/9qep6e/heres_a_list_of_100_free_mythology_and_folklore/)\n\n[250 free kids and YA books](https://www.reddit.com/r/FreeEBOOKS/comments/9rkjqc/here_is_a_list_ive_compiled_of_250_free_yakids/)\n\n[200 free sci-fi books](https://www.reddit.com/r/FreeEBOOKS/comments/9tvcyj/here_is_a_list_of_200_free_scifi_ebooks_ive/)\n\n[100 free classics](https://www.reddit.com/r/FreeEBOOKS/comments/9vy4oa/the_top_100_free_classic_ebooks_from_project/)\n\n[100 free Christmas ebooks](https://www.reddit.com/r/FreeEBOOKS/comments/a5y4cg/here_is_a_list_of_100_free_christmas_ebooks_ive/)\n\n[100 free poetry ebooks](https://www.reddit.com/r/FreeEBOOKS/comments/a9u60i/here_are_100_free_poetry_ebooks_from_project/)\n\n[100 free history ebooks](https://www.reddit.com/r/FreeEBOOKS/comments/a9hsti/here_are_100_free_history_ebooks_from_project/)\n\n[100 free memoirs and autobiographies](https://www.reddit.com/r/FreeEBOOKS/comments/abaywb/here_are_100_free_ebooks_of_memoirs_and/)\n\n[50 free mysteries](https://www.reddit.com/r/FreeEBOOKS/comments/au2a1x/here_is_a_list_of_50_free_mystery_ebooks/)\n\n[100 free books about pirates](https://www.reddit.com/r/FreeEBOOKS/comments/aubgov/rfreeebooks_just_hit_400000_subscribers_heres_a/) \n\n[70 books about space and astronomy](https://www.reddit.com/r/FreeEBOOKS/comments/b4q2s2/70_free_historical_ebooks_about_astronomy_the/)\n\n[200 books about cooking and housekeeping](https://www.reddit.com/r/FreeEBOOKS/comments/bcy1ir/200_free_ebooks_about_cooking_food_prep/)\n\n[50 historical books about childbirth and sexual health](https://www.reddit.com/r/FreeEBOOKS/comments/bears1/here_is_a_collection_of_historical_ebooks_about/)\n\n[175 medical books](https://www.reddit.com/r/FreeEBOOKS/comments/bkog91/here_are_175_free_historical_ebooks_about/)\n \n[50 free craft books](https://www.reddit.com/r/FreeEBOOKS/comments/bld3ty/here_is_a_collection_50_free_historical_ebooks/)\n\n[100 free gardening books](https://www.reddit.com/r/FreeEBOOKS/comments/bnr36n/100_free_ebooks_about_plants_gardening_from/)\n\n[Free assigned summer reading books](https://www.reddit.com/r/FreeEBOOKS/comments/ccwfe2/free_assigned_summer_reading_books_this_is_a_list/)\n\n[60 free ebooks about adventure and exploration in the Arctic and at the South Pole](https://www.reddit.com/r/FreeEBOOKS/comments/da2psz/here_are_60_free_ebooks_from_project_gutenberg/)\n\n[100 free books of ghost stories](https://www.reddit.com/r/FreeEBOOKS/comments/dd9x57/here_are_100_free_spooky_ebooks_on_ghosts_stories/)\n\n[100 more free mythology ebooks](https://www.reddit.com/r/FreeEBOOKS/comments/de8gzb/here_is_a_list_of_100_more_free_ebooks_on/)\n\n[50 free horror books](https://www.reddit.com/r/FreeEBOOKS/comments/dhsxkw/happy_halloween_here_are_50_free_horror_ebooks/)\n\n[30 free Arthurian legends](https://www.reddit.com/r/FreeEBOOKS/comments/e31vrx/here_are_30_free_ebooks_on_arthurian_legend_from/)\n\n[180 free Christmas ebooks](https://www.reddit.com/r/FreeEBOOKS/comments/eaffll/heres_a_collection_of_180_free_christmas_ebooks/)\n\n[100 free books of essays](https://www.reddit.com/r/FreeEBOOKS/comments/enkcrm/here_are_100_free_ebooks_of_essays_from_project/)\n\n[50 free ebooks about inventions and inventors](https://www.reddit.com/r/FreeEBOOKS/comments/eqm1wh/50_free_ebooks_from_project_gutenberg_about/)\n\nFree audiobook collections from Librivox: \n\n[50 free classic audiobooks](https://www.reddit.com/r/FreeEBOOKS/comments/exw3gj/here_are_50_classic_books_that_you_can_download/)\n\n[50 more free classic audiobooks](https://www.reddit.com/r/FreeEBOOKS/comments/f0ybz3/did_you_know_you_can_download_thousands_of_free/)",
            "score": 1,
            "author": "Chtorrr"
        },
        {
            "level": 0,
            "comment": "Hitler had invaded several countries and took most of the wealth from everyone he went after so yeah, rich but mostly stolen.",
            "score": 67,
            "author": "bbvde350",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yeah, absolutely. That's how dictators operate. First they rob their own population, and then they invade other countries and rob the people there.\n\nDictators use an entire country as their piggy bank. They rob their own citizens. Their greed makes them dictators, because they abolish all laws that get in the way of their insatiable greed.\n\nPeople always think that dictators like Hitler must have been ideologues who firmly believed their own talking points. But the truth is, most dictators are simply greedy con men who took their con all the way to the top.\n\nThat's why dictators and televangelists are very similar. They tell lies to exploit their flock and enrich themselves.",
                    "score": 22,
                    "author": "OliverMarkusMalloy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you believe your own talking points?",
                            "score": 6,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "You’re an author yet you can’t separate the difference between their, there, and they’re?\n\nWelcome to America!",
                            "score": -47,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "but seriously, Hitler was not anywhere near billionaire status. IIRC from *The rise and fall of the Third Reich*, Hitler was poor most of his life. He never had any significant income until *Mein Kampf* started to sell a lot of copies in the late 20s and early 30s. *The rise and fall of the Third Reich* indicated that he failed to pay taxes on his earnings. Even when he was chancellor, he refused to pay taxes.\n\nDid he use his totalitarian power to increase his personal wealth? Yes. Was he a billionaire? If he was, only after he achieved absolute power. He was not wealthy before. I mean, if you have total power, why not become a billionaire lol?\n\nI am a social democrat (I am a capitalist that believes in having a strong welfare system and I am not a socialist) and I would never read the book that OP linked. The title of the post just seems pretentious. I agree that there are a lot of authoritarian actions taken by current politicians, but they are not on the same level as Hitler.\n\nThe Nazis did start off as socialists but soon became socialist in name only. I wouldn't necessarily call them hardcore capitalists. Was there a capitalistic aspect? Sure. But you can't really have a libertarian or unbridled sort of capitalism in a fascist or totalitarian society. How could you have the freedom to buy whatever you want if you can't even exist unless you fit the right profile?\n\nI would go on to say that even what we have in the united states isn't really capitalism. More like crony capitalism or some sort of oligopoly with the competition. The rich can basically bribe politicians with campaign contributions. The rich also held power in the Third Reich. Both of these examples (which the author seems to be comparing) are not really the result of hardcore capitalism, but rather capitalism within a system that allows for some degree of Authoritarian/totalitarian aspects (obviously the fascist third Reich is one extreme of this and the current US is much much much much lighter on this, so I wouldn't really compare the two just yet).\n\nIt seems that the premise of this book based on the post title (again, I have not read it and probably will not) is that fox news is dismissing socialism because they equate it to Nazism (national socialism). Therefore, if we show that nazis were not socialists, but rather capitalists, we can catch fox news in a gotcha moment, and then we can all adopt socialism to save America.\n\nThe problems of inequality facing America are not necessarily linked with capitalism or whatever economic system we would choose to have. Instead, it is a direct result of the rules of our country. When you have a democracy/republic that is designed to give everyone a vote, but then you allow rich and influential people to buy politicians with campaign contributions, you are undermining the core concepts of voting in a democracy.\n\nThe simple answer is to eliminate the ability of the rich to buy elections and officials with contributions. You don't need socialism to do this. You take the rich influence out of politics and you could potentially start to see leaders start making laws that favor most of the people again. You might see unionization rates increase again, fair wages, fair working conditions again, and better welfare programs emerge. \n\nYou can literally do all these things in a capitalist (more or less) society. Just look at the US before Reagan was president. Taxes on the rich were high compared to today, unions had a much higher participation rate, and inequality was not where it is today (I am not saying there should be no inequality, just that it shouldn't be as severe.)\n\nYes, I know that Orwell is a proponent of democratic socialism. But if you read his books, his main greivences are not with capitalism (or socialism as most americans ignorantly would say), instead it is with authoritarianism and totalitarian systems where people are dominated. \n\nSo we in the US are not to that point of totalitarianism that was achieved by the facsists in the third reich. Are there aspects of authoritarianism in Trump's actions? Absolutely. But instead of blowing up the system with capitalism as the boogieman in favor of socialism. Let's look to capitalist nations that don't have the same problems that we have to help derive a solution. I am talking about the various scandinavian countries. These are not socilist. They are capitalist countries that have a strong welfare system.\n\nWe could take some aspects that they have perfected and bring them here.\n\nIf you simply overthrow the system and make it socialist without doing much else to eliminate the potential for politicians and rich people to game the system, you will not solve the current problems. Let's look to *Homage to Catalonia* by george orwell. Prior to WW2, Orwell went to spain to report on the spanish civil war between the facists and socialist/marxists/anarchists. He soon joined the fight against the facists. He speaks of a short time where people lived in a socialist paradise. But this is short lived. The rich simply dressed like they were poor and bid their time until they could live luxuriously again.\n\nEDIT: Even if he was a billionare, I won't read this book. Just looks like a hit piece on the current republicans (who I hate). This book is basically the same coin as the likes of Ben Shapiro, just the other side of the coin. I hate reading stuff that has such an agressive and lopsided agenda. In looking into more details at this book, you can see all the liberal people that it is dedicated to. THis shows the bias (I agree with a lot of the people it is dedicated to and am even voting for biden (check my post history if you don't beleive me) but I refuse to read anything that is designed to massage any sort of confirmation bias). I think the initial premis that trump does authoritarian things is valid. Just think the tone and the agenda of this book go to far and will make the book less effective than it could have been.",
            "score": 159,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Capitalism is the function that allows for the accrual of wealth into the hands of those who own the business, rather than those who produce value within that business.\n\nI'm guessing you are looking at countries in the Nordic region, seeing they have a social economy and think that they are fairly redistributing wealth. \n\nWhat you're not looking at are these companies that have factories in developing countries who still pay pennies for labor and reap the benefits of that labor.\n\nThis is how multinational corporations work.",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Capitalism is the function that allows for the accrual of wealth into the hands of those who own the business, rather than those who produce value within that business.\n\nIf properly regulated, both the owners and the workers can gain. No one should argue that an owner shouldn't earn more. They took on the risk and deserve more. I take issue with the current level of inequality in the US. Unionization and collective bargaining have been undermined and have prevented wages from being as high as they were in previous generations. If unionization rates and real wages were on par to the pre-Reagan days, you would not have this anti-capitalistic attitude. \n\n&gt;I'm guessing you are looking at countries in the Nordic region, seeing they have a social economy and think that they are fairly redistributing wealth.\n\n&gt;What you're not looking at are these companies that have factories in developing countries who still pay pennies for labor and reap the benefits of that labor.\n\nSure. If you can outsource to another country that has a competitive advantage, you can make the products cheaper while improving the GDP of both countries. As a result, the production possibility curve of both countries is greatly expanded. The good for the consumers are cheaper, meaning they can buy more goods and have a higher quality of life, Assuming the profits are adequately distributed to the working class (like they are in the Nordic region, but not so in the US). Had unions for fast-food workers and retail workers developed as manufacturing left the US, income inequality would not have dropped off, and the increase of profits that have flowed into the US from globalism would have been shared more equitably.\n\nAs for the people making pennies in third world countries, this is more than they would be making otherwise. You should check out *Travels of a T-shirt in a global economy*. It covers this aspect of these developing countries. They have a path of development that starts off being cheap labor, but then they start to develop other specialties too. They eventually enact regulation and demand higher wages. Then the factories move and go somewhere cheaper. But these nations have their own specialties by then, so they still have more output and production than they would have otherwise.\n\n&gt;This is how multinational corporations work.\n\nAgreed, it is not perfect. I don't think it is as bad as you think it is. The wages are more than these poor people would have otherwise made. I do think that there are legit concerns over working conditions. Companies should work to improve those and often do when exposed. But I think the biggest problem is that these are designed to shelter money from taxes. Can these be fixed or improved? Probably, probably not.\n\nBut there are good aspects that you are probably overlooking and don't realize are there because of capitalism. Capitalism is the second-worst system. The worst is everything else. Capitalism should be regulated to prevent the legit critiques that Marx made in his writings. The solution is to regulate capitalism, not to replace it with socialism. I am not happy with the current \"capitalism\" in the US now. It should be improved. And that requires solutions that are more complex and realistic than Capitalism=bad, socialism=good...",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A competitive advantage except for the working class in either of those countries. \n\nOutsourced labor means less jobs in the country where the company resides. It also means low wages for the working class in the outsourced country because the only reason to outsource labor is to cut costs.\n\nThat means the difference doesn't go to the workers actually creating the product, it goes to the owners of the company and their shareholders.\n\nWhy didn't unions develop in the fast food, service, or retail industry? Could it possibly be large amounts of money accrued by the owners of large businesses using their wealth to ensure pro-worker or pro-labor laws were shredded and gutted? Have you worked at Wal-Mart where they tell you if anyone talks about a union, to disengage and immediately go tell the manager?\n\nThese countries are still developing because they've been ravaged by colonialism, having the wealth and resources extracted from them by 1st) Settler-colonial countries and 2nd) multi-national corporations. Go see what happened to Mossadegh when he tried to nationalize Iran's oil fields, Salvador Allende when he nationalized the copper mines in Chile, or Jakarta under the rule of Suharto.\n\nIt wasn't because they just aren't teched up enough, it's because they've never had control over their own resources.\n\nYou don't overturn this system with an amendment about keeping money out of politics. There is so much accrued *global* wealth that taking it out of their hands is the only way to ensure we have a future of equity.\n\nAnd I don't mean wealth in the terms of how much money they make each year. I mean ownership over collective resources we all depend on. I mean in the ownership of the means to produce those resources into goods that we all depend on; Energy, Food, Water, Housing, Healthcare, Education, etc.\n\nThere aren't tweaks to the system that need to be made. If after 400 years the system is still this unequal, it's time to abandon it and move on. We moved on from feudalism and mercantilism. This isn't working so it's time to move on from this era of Multi-National corporate Neo-colonialism.",
                                    "score": 8,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Hitler was not anywhere near billionaire status.\n\nYes, he was. It's a well documented historical fact in the German speaking world. Americans just don't know anything about it, because the information is being kept from them.\n\nAll these news articles from major news outlets in Germany and Switzerland talk about the fact that Hitler was a tax evader who hid billions on his private accounts:\n\n&amp;#x200B;\n\n**Adolf Hitler schaffte Milliarden ins Ausland**\n\n[https://www.focus.de/politik/deutschland/die-spur-des-schmutzigen-geldes-der-fuehrer-als-steuerbetrueger-hitler-schaffte-milliarden-ins-ausland\\_id\\_3949210.html](https://www.focus.de/politik/deutschland/die-spur-des-schmutzigen-geldes-der-fuehrer-als-steuerbetrueger-hitler-schaffte-milliarden-ins-ausland_id_3949210.html)\n\n&gt;Er inszenierte sich als genügsamer Soldat, doch **im Geheimen häufte Adolf Hitler ein Vermögen an**. Historikern ist es nun gelungen, die Spur des schmutzigen Geldes zu rekonstruieren: Der Diktator soll Milliarden in die Schweiz geschafft haben. Steuern zahlte er keine.\n\n&amp;#x200B;\n\n[https://www.news.de/wirtschaft/855542383/adolf-hitler-steuerhinterziehung-steuerbetrug-4-5-milliarden-euro-auf-schweizer-konten/1/](https://www.news.de/wirtschaft/855542383/adolf-hitler-steuerhinterziehung-steuerbetrug-4-5-milliarden-euro-auf-schweizer-konten/1/)\n\n&gt;Steuerunterlagen deckten Hitlers Schwindel aufHitler war in Wahrheit ein dreister Steuerschwindler. **Mittels Steuerunterlagen und Kontoauszügen war es Wissenschaftlern möglich, den Weg vom Führer-Vermögen ausfindig zu machen.**\n\n&amp;#x200B;\n\n**Hitlers Milliarden in der Schweiz**\n\n[https://www.handelszeitung.ch/politik/hitlers-milliarden-der-schweiz-632026](https://www.handelszeitung.ch/politik/hitlers-milliarden-der-schweiz-632026)\n\n&gt;Adolf Hitler hatte nach 1935 keine Steuern mehr bezahlt. Ein britischer Sender hat recherchiert, dass **der Diktator hohe Summen in der Schweiz deponierte.**\n\n&amp;#x200B;\n\n**Hitlers Schwarzgeld-Milliarden in der Schweiz**\n\n[https://www.welt.de/geschichte/zweiter-weltkrieg/article129538313/Hitlers-Schwarzgeld-Milliarden-in-der-Schweiz.html](https://www.welt.de/geschichte/zweiter-weltkrieg/article129538313/Hitlers-Schwarzgeld-Milliarden-in-der-Schweiz.html)",
                    "score": -44,
                    "author": "OliverMarkusMalloy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol you only partially quoted me. Here is the rest of what I said on that matter.\n\n&gt;Did he use his totalitarian power to increase his personal wealth? Yes. Was he a billionaire? If he was, only after he achieved absolute power. He was not wealthy before. I mean, if you have total power, why not become a billionaire lol?\n\nIf this is an example of how you sourced info in your book, then it probably isn't a good book...",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Show me where I said Hitler was a billionaire **before** he plundered the people of Germany in his role as Fuehrer.\n\nOf course he became a billionaire after he became dictator. That's the whole point of why people become dictators in the first place: insatiable greed. They climb the ladder, to rob more and more people.\n\nYou think it's a coincidence that every dictator in history is unimaginably rich? No, of course not. That's the whole point.",
                                    "score": -32,
                                    "author": "OliverMarkusMalloy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Show me a totalitarian leader that didn't make themselves richer...",
                                            "score": 27,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Show me a totalitarian leader that didn't make themselves richer...\n\nExactly. There are none, because dictators are simply con men who rob the working class.\n\nAnd when laws get in the way of their greed, they abolish them.\n\nAnd when people stand in the way of their greed, they kill them.\n\nBut the bottom line is always personal profit for the dictator.",
                                                    "score": -9,
                                                    "author": "OliverMarkusMalloy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Actually there is at least one. Stallin. He is the true dictator who wanted just power and only power. He didn’t regard money or even lives of his family only power. Rare example of a dictator who died in power. I guess it has to do with greed. These griddy bastards always fall at the end.",
                                                            "score": 8,
                                                            "author": "luka7tzar"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am not a socialist, communist or any form of marxist.",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -42,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know the difference.",
                                            "score": 19,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t care if he was left or right wing. People bringing him up privatising or taking public ownership of some industry are missing the point. He murdered millions of people! He committed genocide! His position on the public vs private ownership of X industry has nothing to do with it. \nAuthoritarianism and dictatorships are bad whether your roads are paved by private contractors or through public workers.",
            "score": 46,
            "author": "MimiDaisy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really it's probably invalid to try to cleanly place Hitler and the Nazi party on a 2020 left-right political spectrum. Politics 80+ years ago and on a different continent are too different. I think we can fairly call him authoritarian.\n\nPeople who try to claim the Nazis were socialists because it was in the name of the party are kind of amusing, though. The German socialist workers party stopped being socialist not long after Hitler took over...they put socialists in death camps. They weren't pro gun control either (unless you were Jewish, of course).",
                    "score": 15,
                    "author": "ThatFilthyApe"
                },
                {
                    "level": 1,
                    "comment": "exactly. It seems that the tone of the book is that socialism = good and capitalism = bad.\n\nIn reality it should be Authoritarianism/totalitarianism/facism = bad while freedom/democracy = good.\n\nIf anything, economic systems are nuetral and really depend on who is in power. Sure, capitalists will always try to gain more power and influence by pushing the envelope of what is allowed in society. If you want to stop campaign contributions then make it part of the rules. You don't need to make capitalism the bad guy...\n\nIf anything, the author should just show us how modern politicians are using the same tactics that the nazis used to chip away at the democratic process.",
                    "score": 16,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fox says the Nazis were socialists?",
            "score": 12,
            "author": "Murderyoga",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wtf, don't people learn about nazism in school anymore?",
                    "score": 3,
                    "author": "Tacosaurusman"
                },
                {
                    "level": 1,
                    "comment": "I literally got banned from my state's largest gun rights advocacy organization's FB group for refuting a bunch of boomers' claims in a thread that Nazis were far-left socialists with proof and marginal application of brainpower.",
                    "score": 11,
                    "author": "DemandCommonSense"
                },
                {
                    "level": 1,
                    "comment": "This was my exact question. I could see them downplaying Hitler’s actions but to actually say Nazis were socialists is mental gymnastics I could not perform.",
                    "score": 5,
                    "author": "NotLostJustWanderin"
                },
                {
                    "level": 1,
                    "comment": "Yes, it's the original lie upon which all their other propaganda lies are built.\n\nThey tell their clueless viewers that liberals and socialists are evil, because they're like the Nazis, because the Nazis were liberals and socialists, according to Fox News.\n\nAnd Trump's base believes this nonsense. That's what motivates their hatred for liberals: years of misinformation and blatant lies about liberals, by pretending that they're exactly like the Nazis.\n\nTrump's base has no idea that the Nazis hated liberals and socialists for exactly the same reasons and with exactly the same intensity as MAGA minions hate liberals.",
                    "score": 3,
                    "author": "OliverMarkusMalloy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hitler was not a billionaire.",
            "score": 34,
            "author": "cm362084",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everyone was probably a billionare with as much hyperinflation that the reichsmark experienced at that time... /s",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LMFAO hell yes !",
                            "score": 3,
                            "author": "DrMrs_Vandertramp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://www.nytimes.com/2002/08/08/world/hitler-it-seems-loved-money-and-died-rich.html#:~:text=From%20the%20time%20he%20became,investments%20and%20their%20war%20work.",
                    "score": 10,
                    "author": "Gunner_McNewb"
                },
                {
                    "level": 1,
                    "comment": "&gt;Hitler was not a billionaire.\n\nYes, he was. The fact that you (and many other Americans) don't know that is the reason why I wrote this book.\n\n&amp;#x200B;\n\n**9 Things You Might Not Know About Adolf Hitler**\n\n[https://www.britannica.com/list/9-things-you-might-not-know-about-adolf-hitler](https://www.britannica.com/list/9-things-you-might-not-know-about-adolf-hitler)\n\n&gt;Much of his money came from predictable sources—siphoning off government money and accepting “donations” from corporations. However, he also undertook more creative schemes. After becoming chancellor, he notably ordered the government to buy copies of his *Mein Kampf* to give as state wedding gifts to newlyweds, leading to hefty royalties for Hitler. In addition, **he refused to pay income tax. He used his vast wealth—which some estimated was about $5 billion**—to amass an extensive art collection, purchase fine furnishings, and acquire various properties. After the war, his estate was given to Bavaria.\n\n&amp;#x200B;\n\n**Adolf Hitler: Secret Billionaire**\n\n[https://www.thedailybeast.com/adolf-hitler-secret-billionaire](https://www.thedailybeast.com/adolf-hitler-secret-billionaire)\n\n&amp;#x200B;\n\n**Hitler: The secret billionaire**\n\n[https://www.express.co.uk/showbiz/tv-radio/485168/Adolf-Hitler-The-secret-billionaire](https://www.express.co.uk/showbiz/tv-radio/485168/Adolf-Hitler-The-secret-billionaire)",
                    "score": 1,
                    "author": "OliverMarkusMalloy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\n&gt;At today's prices the supposedly frugal tyrant who worked only in the service of his people was actually a billionaire\n\nAccording to your own sources he was not a billionaire at the time he was alive.",
                            "score": 15,
                            "author": "suddenly_rats"
                        },
                        {
                            "level": 2,
                            "comment": "When you effectively control the entire economy of an industrialized country, of course you become a billionaire.  The economic system under Hitler was extremely similar to that under all dictators.  Mao, Stalin, Castro, and all the rest were also indescribably wealthy, due to their political control.  Your \"book\" is blatantly propagandistic, and is clearly not even a passable work of scholarship.",
                            "score": 14,
                            "author": "Erfbender"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also, Hitler invaded Portland.\n\nSorry, I meant *Poland*.",
            "score": 20,
            "author": "Goldang",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol",
                    "score": 5,
                    "author": "OliverMarkusMalloy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Drumpf literally Hitler?",
            "score": 21,
            "author": "Raskolnikov117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Drumpf literally Hitler?\n\nTheir political platforms are identical. (I know you have no idea idea what I'm talking about. That's why you should read the book.)\n\nRepublicans and German Nazis are ideological twins. That's why even Twitter's AI content filter can't tell the difference between Nazis and Republicans:\n\n&amp;#x200B;\n\n**Twitter won’t autoban neo-Nazis because the filters may ban GOP politicians**\n\n[https://finance.yahoo.com/news/twitter-won-t-autoban-neo-193850606.html](https://finance.yahoo.com/news/twitter-won-t-autoban-neo-193850606.html)\n\n&amp;#x200B;\n\nNazis and Republicans literally have the same talking points.",
                    "score": -23,
                    "author": "OliverMarkusMalloy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same talking points like what?",
                            "score": 18,
                            "author": "Chrommanito"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, you included Seth Myers in the dedication twice",
            "score": 2,
            "author": "dk_jr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oops! Thanks! Gonna fix it now.",
                    "score": 2,
                    "author": "OliverMarkusMalloy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah exactly. George Orwell knew this. So many on the left after WW2 thought Stalin was good because he was a communist. Orwell was still a socialist but saw the danger of totalitarianism and dictatorships regardless of the ideology the dictator was or claimed to be.",
            "score": 5,
            "author": "MimiDaisy",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are 100% correct. Check out the preface to *Animal Farm* And he explicitly says so.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Actions speak volumes. You can apply words to anything, the only way to see the truth is to observe human behavior. If it acts like a willfully  ignorant, racist, self-centered, sexist, authoritarian, intolerant, patronizing nationalist bag of doo-doo... It's dangerous and must be removed.",
            "score": 7,
            "author": "gonzo2thumbs"
        },
        {
            "level": 0,
            "comment": "But that's the perfect definition of socialist with power... Communists on top of chain of command also live lives of billionaires. The only problem is that they get their money through coercion not by mutually willful exchange of goods and services",
            "score": 9,
            "author": "kr10n1",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;mutually willful exchange of goods and services\n\n&amp;#x200B;\n\nCapitalism doesn't work the way you think it does.\n\nHave you ever played Monopoly? It's a board game designed to teach kids capitalism.\n\nAnd what happens in the end? The winner has all the money, and everyone else has nothing.\n\nWoohoo! So much fun!\n\nThat's literally how America works. That's why there are a few super rich people who own almost everything, and tens of millions of dirt poor people who have nothing.\n\n&amp;#x200B;\n\n***“And one day we must ask the question, ‘Why are there forty million poor people in America? And when you begin to ask that question, you are raising questions about the economic system, about a broader distribution of wealth.’ When you ask that question, you begin to question the capitalistic economy.”***\n\n*-Martin Luther King Jr.*",
                    "score": 8,
                    "author": "OliverMarkusMalloy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds like pretty much every politician in DC, honestly.",
            "score": 3,
            "author": "TheHrethgir"
        },
        {
            "level": 0,
            "comment": "Lmfao my guy",
            "score": 1,
            "author": "WhyAtlas"
        },
        {
            "level": 0,
            "comment": "If you turn off the television and pick up a history book, well you already know this...he wasn’t born into wealth though like Trump . I’m not entirely certain where they come up with him being a billionaire, but I’m certain he obtained it while he had already established power. Trump is a dimwit compared to hitler, and I hate both.",
            "score": 1,
            "author": "GeneralTrasch",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Trump is a dimwit compared to hitler, and I hate both.\n\nActually Hitler was a laughing stock in his day. People mocked him for the way he looked and talked. People thought of him as a bizarre oddball con man. Nobody took him serious until it was too late. Just like Trump.",
                    "score": 5,
                    "author": "OliverMarkusMalloy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not certain what you’re reading, but what I’ve read it’s seems to me at least he was a charismatic individual that possessed leadership who knew how to manipulate and orchestrate a dictatorship. Something Trump failed to do when he couldn’t get Marshall law enacted for the riots so he could freely mobilize troops. I’m aware of Hitler’s past failure of a failed coup, and maybe that’s what you were referring to him as being a mockery?",
                            "score": 7,
                            "author": "GeneralTrasch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "**Hitler Was Incompetent and Lazy—and His Nazi Government Was an Absolute Clown Show**\n\n[https://www.newsweek.com/hitler-incompetent-lazy-nazi-government-clown-show-opinion-1408136](https://www.newsweek.com/hitler-incompetent-lazy-nazi-government-clown-show-opinion-1408136)\n\n&amp;#x200B;\n\n**In ‘Hitler,’ an Ascent From ‘Dunderhead’ to Demagogue**\n\n[https://www.nytimes.com/2016/09/28/books/hitler-ascent-volker-ullrich.html](https://www.nytimes.com/2016/09/28/books/hitler-ascent-volker-ullrich.html)\n\n&amp;#x200B;\n\nThe first time Mussolini met Hitler, he said afterwards that Hitler was \"a mad little clown.\"\n\n[https://www.independent.co.uk/life-style/when-benito-mussolini-met-adolf-hitler-1317121.html](https://www.independent.co.uk/life-style/when-benito-mussolini-met-adolf-hitler-1317121.html)\n\n&amp;#x200B;\n\n**Americans on Hitler: 'This Guy Is a Clown'**\n\n[https://www.realclearhistory.com/2020/06/22/americans\\_on\\_hitler\\_this\\_guy\\_is\\_a\\_clown\\_496826.html](https://www.realclearhistory.com/2020/06/22/americans_on_hitler_this_guy_is_a_clown_496826.html)\n\n&gt;\"What did Americans think of Hitler when they first met him in the 1920s and 1930s? You write that some of them **burst out laughing at his shrill voice and jerky hand movements and refused to take him seriously.**\"",
                                    "score": 1,
                                    "author": "OliverMarkusMalloy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your first article was opinion based so I didn’t read it. The second one seemed interesting “Some have focused on the social and political conditions in post-World War I Germany, which Hitler expertly exploited “ men who do this are not imbeciles though. They see the big picture, and will pick apart the vulnerabilities to get what they want, which he did. I could care less what Mussolini thinks about him because historically he was failure as a strategists. However, I did read it. Your fourth article I do see your point about the American populace’s first original impression of him. You have to remember though that did change quickly because we did put him on Rolling stone magazine somewhere between 1931-33.",
                                            "score": 4,
                                            "author": "GeneralTrasch",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;I do see your point about the American populace’s first original impression of him.\n\nIt wasn't just Americans and Mussolini who thought Hitler was a clown. Most Germans thought he was some sort of ridiculous sideshow freak, until he started killing people.\n\nI just showed you the first few Google results in English. There's a lot more about that from German historians in German.\n\nIn retrospect we look at Hitler as this almost superhuman villain. But that's only after we saw how many people he killed. Before the Holocaust, he was very much a Trump-like figure.\n\nTrump is Hitler before the Holocaust. Things are gonna get much uglier in November. All those federal stormtroopers in Portland were just a dry run for what he's gonna unleash on America when he loses the election and refuses to leave the White House.",
                                                    "score": 0,
                                                    "author": "OliverMarkusMalloy"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Way to defend the democrats who are tearing our country apart right now. By the way, the answer is no. Republicans don’t remind me of Nazis. Also, do some homework and see that democrats are doing the exact same thing.",
            "score": -6,
            "author": "braddrigney",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, the Democrats are not doing the same thing. \n\nWhat you're doing is called Whataboutism. You're trying to deflect form the things Republicans do by pretending the Democrats do the same thing.",
                    "score": 9,
                    "author": "OliverMarkusMalloy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OMAGAWD DRUMPF = HITLER GUYS !!!!!111!11!",
            "score": -16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Read the book. It will blow your mind. Trump is deliberately imitating Hitler, because he knows his base loves it.",
                    "score": -4,
                    "author": "OliverMarkusMalloy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no one's gonna read your book, even if you're giving it out for free. That must suck pretty bad for you,.",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually a couple of hundred people downloaded it from Smashwords in the last 2 days. And that doesn't count the thousands who're reading it right on the site. \n\nBut sure, whatever you need to tell yourself to make yourself feel better, little buddy.",
                                    "score": 1,
                                    "author": "OliverMarkusMalloy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What am I gonna find in this book that leftist media hasn't said again and again for the past four years?\n\nMaybe proper punctuation? Is that what's gonna blow my mind?",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;What am I gonna find in this book that leftist media hasn't said again and again for the past four years?\n\nPlenty of stuff.\n\nFor example, the Nazis were right-wing conservative Evangelical Christian nationalist capitalists who hated left-wingers, socialists, globalists, gays, minorities, immigrants, democrats and liberals.\n\nYou know... all the same people that **you** hate too.\n\nFunny coincidence, huh?",
                                    "score": 2,
                                    "author": "OliverMarkusMalloy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh, so just the same thing that leftists have been saying for the past four years, with a hint of what has been established historical fact for seventy five years.\n\nWhat reason do I have to read this, then?",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": -1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All you have told me so far doesn't seem like a good reason to read your book. Seems like a great reason to use it as toilet paper, though, I'll definitely consider that.\n\nI'm already done with being told the same thing over and over again about the Third Reich. It died 75 years ago and existed in a country I have no reason to care about and that is further away from me than Canada. Nothing about it is relevant to me in 2020",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "By the way, why do you immediately assume I hate all these people just because I don't think Trump = Hitler?",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fox News vilifies these groups on a daily basis. That's how fascist propaganda works: rally the minions with hatred towards \"the others.\"\n\nAnd for Nazis \"the others\" just so happen to be exactly the same groups as for MAGA minions. \n\nAll that raging hatred against liberals is a direct result of Trump (and other Republican fascists) using the same type of hateful propaganda that Hitler used.\n\nMAGA minions think Black Lives Matter are terrorists. The Nazis thought Jews are terrorists. For exactly the same reasons: propaganda told them so.",
                                                    "score": 5,
                                                    "author": "OliverMarkusMalloy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's modern politics for you. It's always the fault of the \"other\". For you, that other is the Republican Party, that in your mind is represented by Donald Trump.\n\nObama's \"other\" was the Republican Party. Bush's other was the Democrats. And so on. Vilifying the \"other\" to promote one's political agenda is exactly how politics works, regardless of the regime.",
                                                            "score": 6,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;Vilifying the \"other\" to promote one's political agenda is exactly how politics works, regardless of the regime.\n\nNo, it's not normal. You only think this is normal because this is what's happening in the US. \n\nIn the rest of the civilized world people work together. Look at politics in Germany or Norway. Sure, they have disagreements, but they don't demonize each other.\n\nThat sort of hatred was introduced into American politics by Republicans. Why? Because demonizing \"the other\" worked so well for Hitler that Republicans decided to use the same trick.\n\nDemocrats don't hate Republicans. We just think you guys are incredibly stupid for believing the lies Fox News tells you about liberals to make you hate us.",
                                                                    "score": 0,
                                                                    "author": "OliverMarkusMalloy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": " &gt; No, it's not normal. You only think this is normal because this is what's happening in the US. \n\nI'm noy even American, or live within 7,000km of the US\n\n &gt; In the rest of the civilized world people work together. Look at politics in Germany or Norway. Sure, they have disagreements, but they don't demonize each other.\n\n They definitely do demonize each other. In Germany, just being proud of being German earns you the \"honour\" of being called a Nazi and immediately associated with the man himself, Adolf Hitler. Kind of like what you're doing in this discussion, except a lot more ridiculous\n\n &gt; That sort of hatred was introduced into American politics by Republicans. Why? Because demonizing \"the other\" worked so well for Hitler that Republicans decided to use the same trick.\n\n That's a big, careless lie. This kind of demonization has been common since the times of the Continental Congress in US politics. Before that, it was demonization of the French. And before that, it was demonization of the Amerindians and the Spanish. Literally no tactic used in American politics today is new, same with the rest of the world.\n\n &gt; Democrats don't hate Republicans. We just think you guys are incredibly stupid for believing the lies Fox News tells you about liberals to make you hate us.\n\nOh, yeah, so the endless demonization of Republicans by the Democrats is just a giant misunderstanding?\n\nI dunno, I was under the impression that someone has to *really hate* something to want it erased like the Democrats want the Republicans erased.",
                                                                            "score": 6,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;I'm noy even American, or live within 7,000km of the US\n\nAnd why is it such a big secret where you live? Is it Moscow? ;)\n\n&amp;#x200B;\n\n&gt;They definitely do demonize each other. \n\nI'm German. I can tell you for a fact that German politics are NOTHING like American politics.\n\n&amp;#x200B;\n\n&gt;In Germany, just being proud of being German earns you the \"honour\" of being called a Nazi and immediately associated with the man himself, Adolf Hitler. \n\nOf course. In Germany the concept of nationalism is shunned for a very good reason. See World War 2. \n\n**Nationalism is tribalism. And tribalism always, always leads to war.** \n\nTribalism is simply the idea of \"us vs them\" which always leads to \"we are better than them\" and \"our needs are more important than theirs, because we are more important than them.\"\n\nThat always, always leads to war, because you think your own interests supersede those of other countries. \n\nAnd when the people in the other country believe the same thing about themselves, as all nationalists do, it inevitably leads to conflict.\n\nThe first thing that happened when Britain announced they'd leave the EU was than Spain and Britain got into a conflict over Gibraltar. As soon as it was no longer \"we\" but those two countries suddenly saw each other as \"the other\" they sent warships to Gibraltar and almost fired on each other.\n\nThat's why people who proudly proclaim to be nationalists are seen as ignorant morons by those of us who haven't forgotten history.\n\n&amp;#x200B;\n\n&gt;Literally no tactic used in American politics today is new, same with the rest of the world.\n\nRepublicans today are literally copying their policies from Nazi Germany. \"America first\" is just an English translation of \"Deutschland, Deutschland ueber alles.\"\n\nIt's exactly the kind of tribal thinking that always leads to war. See above.\n\n&amp;#x200B;\n\n&gt;Oh, yeah, so the endless demonization of Republicans by the Democrats is just a giant misunderstanding?\n\nHere's the difference:\n\nWhen Democrats say Trump is corrupt, it's actually true. It's a fact-based statement about a criminal.\n\nWhen Republicans say Hillary is an actual demon from hell who smells like sulphur and operates a childporn ring from the basement of a pizza parlor, that is a lie. A propaganda lie. A propaganda lie to demonize \"the other.\"\n\nSee the difference?\n\n&amp;#x200B;\n\n&gt;the Democrats want the Republicans erased.\n\nThat right there is one of those propaganda lies I just mentioned.\n\nHitler told his brainwashed minions that Jews want to destroy Germany and the white German race, and replace them with mongrels.\n\nTrump told his brainwashed minions that Democrats want to destroy America and the white American race, and replace them with mongrels.\n\nIt's literally the exact same lie.\n\nAnd you just repeated that lie to me.\n\nAnd that is exactly how Republicans brainwash you with lies.\n\nTrump literally tweeted that only a dead Democrat is a good Democrat.\n\nAnd yet, here you are, claiming that it was the Democrats who said this about Republicans, not the other way around.",
                                                                                    "score": -2,
                                                                                    "author": "OliverMarkusMalloy"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But Nazi quite literally stands for National Socialist. :/ They were quite against big business. There was plenty of propaganda against it.",
            "score": -6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, it is literally a free ebook. It isn’t unrelated",
                    "score": 10,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Here's an idea: if you don't like reading a free book about current events, and how Fox News manipulates Americans with lies, then just scroll on by.",
                    "score": 8,
                    "author": "OliverMarkusMalloy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -41,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also North Korea is a democratic people's republic. It's literally in their name",
                    "score": 49,
                    "author": "FoucaultsTurtleneck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And China and the Congo.",
                            "score": 8,
                            "author": "8020GroundBeef",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tbh the DRC is probably more democratic lol",
                                    "score": 3,
                                    "author": "FoucaultsTurtleneck"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They were explicitly for a return to a glorious past, hence the term “Reich.” They’re best defined radical authoritarian conservative.",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Very true. Their ideology and today's Republican ideology are one and the same.\n\nNazis also believed in their nation's exceptionalism. \n\n\"Deutschland, Deutschland ueber alles\" was their version of \"America first.\"",
                            "score": 10,
                            "author": "OliverMarkusMalloy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t think Republicans are “literally nazis,” (although literal Nazis would never vote dem) but the elements of rabid anti communist hysteria and even, to an extent with trumpism, anti liberalism, is common in the worst authoritarian far right ideologies, practically typifying them",
                                    "score": 6,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hitler was a famous liar. It's a well documented historical fact that Hitler lied pretty much every time he opened his mouth.\n\nHe was very good at manipulating people with his lies. He was proud of it. He used lies as a political tool. As a weapon.\n\nHe even wrote about how easy it is to manipulate people with lies in his book Mein Kampf.\n\nOne of his lies was the name of his party. The Nazis were called National Socialist, because socialism was a good thing, a positive thing, that working class people vote for, to improve their lives.\n\nHitler used the name National Socialist to trick uninformed people into voting for him, and voting against their own best interests.\n\nHe promised them all sorts of things that would improve the lives of the working class, but in reality he and his party did the exact opposite: they plundered the working class and shoveled all that money into the pockets of the super rich 1%.\n\nMany Americans falsely believe that the Nazis were somehow socialist, because it's in the name. They were not. In fact they were hardcore predatory capitalists, just like the US and Great Britain.\n\nThe Nazis did not believe in \"the people should own the means of production.\" They believed in exactly the opposite: they took things that were owned by the public, and gave it to billionaires. Just like in the US today.\n\n**The Nazis literally invented privatization**. In fact, the word privatization didn't even exist before the Nazis. The English word \"privatization\" was invented to describe what the Nazis were doing.\n\n**The Roots of Privatization**\n\n[https://daily.jstor.org/the-roots-of-privatization/](https://daily.jstor.org/the-roots-of-privatization/)\n\n&gt;“Privatization” was coined in English descriptions of the German experience in the mid-1930s. In the early twentieth century, many European economies featured state ownership of vital sectors. *Reprivatisierung*, or re-privatization, marked the Nazi regime’s efforts to de-nationalize sectors of the German economy. As Bel notes, **“German privatization of the 1930s was intended to benefit the wealthiest sectors and enhance the economic position and political support of the elite.”**",
                    "score": 11,
                    "author": "OliverMarkusMalloy"
                },
                {
                    "level": 1,
                    "comment": "No they didn't. They started as pushing for worker rights under a banner of socialism, in order to gain support from actual socialists and the downtrodden working class. Then they murdered the actual socialists who got them to power and Goebbels managed to keep people fooled until they got herded into camps. It's literally in their name because they knew lying would get them further than the truth.",
                    "score": 30,
                    "author": "ptvlm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly!",
                            "score": 6,
                            "author": "OliverMarkusMalloy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The nazi party did start off as socialist. That is true. But it was hijacked by the facists and moved to the far right before they gained power.\n\nKind of like how the current republicans claim to be the party of lincoln. It was true, lincoln was a republican, but the party was hijacked by the Dixiecrats. Now the party of Lincoln has an anuerism when confederate monoments are removed.",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "\n\n&gt;‘NAZI’ is a German acronym for national socialist workers party, it is literally in their name.\n\nI can't believe people actually think this. I thought everyone knew the Nazis were ideologically far right. Did you even go to college?",
                    "score": 2,
                    "author": "raxo06"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obviously dumbass. Fascism is right wing. Take a political science class",
            "score": -7,
            "author": "deeznutz247365",
            "replies": [
                {
                    "level": 1,
                    "comment": "Millions of Trump's MAGA minions are absolutely convinced that the Nazis were left-wing.\n\nThis book is aimed at those people. I explain the truth to them in little bite size chunks that even a child can understand... to show them that the things they believe are simply not true.\n\nI think it's our best chance to get through to them in their little bubble of Fox News propaganda lies.",
                    "score": 6,
                    "author": "OliverMarkusMalloy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "National Socialism (German: Nationalsozialismus), more commonly known as Nazism. Nah, they don't sound socialist in the least.",
            "score": -25,
            "author": "dogfrost9"
        }
    ]
}