{
    "id": "l20fb0",
    "score": 1572,
    "title": "The oldest book you will ever read! The Epic of Gilgamesh is more than 3.000 years old. It was carved in 12 tablets by the Sumerians. More of the stories in Gilgamesh have close relationship to the Christian Bible. For example the Garden of Eden and Noah's Flood seems to derive from the Gilgamesh:",
    "author": "hanslicht",
    "date": 1611242372.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/l20fb0",
    "media_urls": [
        "https://holybooks.com/the-epic-of-gilgamesh/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Fate called Gilgamesh the first hero",
            "score": 94,
            "author": "Th0uArtist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gate of Babylon too OP",
                    "score": 27,
                    "author": "PoseidonUltor"
                },
                {
                    "level": 1,
                    "comment": "King of Kings, the first (and only?) ruler of the world",
                    "score": 6,
                    "author": "LilQuasar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First time I’ve ever seen this many comments on a post here. Kudos! I remember hearing about it in college during a bible as literature English course.",
            "score": 27,
            "author": "D3ath5had0w"
        },
        {
            "level": 0,
            "comment": "I may be wrong, but I think the Bhagavad Gita is more like 5,000+ years old.\n\nAnd there is the 7,000+ year old Dispilio Tablet:\n\n\"Back in 1993, in a Neolithic lakeshore settlement that occupied an  artificial island near the modern village of Dispilio on Lake Kastoria  in the Kastoria Prefecture, professor George Hourmouziadis and his team  unearthed the Dispilio Tablet (also known as the Dispilio Scripture or  the Dispilio Disk), a wooden tablet bearing inscribed markings (*charagmata*) that has been carbon 14-dated to about 7300 BP (5260 BC).\" \n\nNote: the designation \"BP\" stands for \"Before Present.\"  It's an age as of the writing of the article, which in this case was 2012.",
            "score": 16,
            "author": "DunebillyDave"
        },
        {
            "level": 0,
            "comment": "... and he went 9 leagues and the darkness was thick around him, and he could see nothing in front and nothing behind.... \n\nRead this back in 9th grade and still remember the repetition in that part...",
            "score": 12,
            "author": "maquis_00"
        },
        {
            "level": 0,
            "comment": "So is it in the public domain or not",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m pretty sure Disney is ready to sue anyone who gets in their way of infringing in their broadway spectacular and theatrical release of Ishtar on Ice in 3D",
                    "score": 5,
                    "author": "pompatusofcheez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*Finding Utnapishtim, coming to theaters near you*",
                            "score": 2,
                            "author": "siren_bait"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't give law makers any ideas.",
                    "score": 5,
                    "author": "Marvelite0963"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did a report on this in a religion class comparing Utnapishtim's flood to that of the biblical flood for my second year of university. I was one of the guys who read and answered questions the entire class. This was in the south. My teacher had to deal with the usual issues with indoctrination and I definitely chimed in. I walked in on the final exam and sat down. He looked at me and told me I was exempt from the exam and I looked around not knowing if it was a joke. He again said I was exempt and could go. I left in disbelief but it was such a good feeling.",
            "score": 27,
            "author": "brandvegn"
        },
        {
            "level": 0,
            "comment": "We started a book discussion on the Epic of Gilgamesh just this week over at /r/ClassicalEducation - join in if you're interested!",
            "score": 26,
            "author": "peown",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did not know this subreddit existed but will now continue to lurk here...",
                    "score": 9,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anybody wonder why the original tablets are stored by the vatican? r/conspiracytheories",
            "score": 57,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The vatican when it was formed was one of the few places willing to store, file, and protect history during the collapse of the Roman Empire. \n\nThe dark ages are named so because of the lack of history relating to the era. The vatican was one of the few areas where scholars and historians could record history in relative safety during that time period. Almost all the written history in western Europe at the time was taken to the vatican to be recorded.\n\nSimply put, the vatican saw itself as the \"protector of history\" during the dark ages, especially after the destruction of the library of Alexandria. The only relative comparison at the time would be the library of Baghdad. Think of these great libraries as modern universities, except there were only a few in the entire world.\n\nEdit: Also to those who are claiming that it should've been stored in the library of Baghdad, the city and library got sacked and destroyed by the Mongols. So that history would have been lost were it kept in Baghdad.",
                    "score": 90,
                    "author": "ThermalPaper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope the Vatican releases their information soon.",
                            "score": 2,
                            "author": "olican101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same",
                                    "score": 2,
                                    "author": "phoonie98"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 67,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t know why you are getting downvoted it’s not like any other culture can lay claim. Sumerians don’t exist anymore. Also like the post says it has relations to the Bible.",
                            "score": 36,
                            "author": "VulpineJota",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "reddit hive mind go brrrrr",
                                    "score": 13,
                                    "author": "TangoCyka"
                                },
                                {
                                    "level": 3,
                                    "comment": "Not sure how much I trust the Vatican to keep potentially heretical artifacts safe, though.",
                                    "score": 2,
                                    "author": "that-writer-kid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They probably keep those even safer.",
                                            "score": 20,
                                            "author": "angleMod"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You should probably tell them your concerns. Maybe they'll let you keep the items you don't trust them with on your nightstand.",
                                            "score": 0,
                                            "author": "StraightJohnson"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Their  descendants do, they are called Iraqis now.\nAnd because the Bible copied stories from it doesn't mean the pope can have it. The tablets belong to the people of Iraq.",
                                    "score": -1,
                                    "author": "KoolD4d",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would ask why would you give one of the oldest texts in history to a war-torn country? A lot of art didn’t survive the nazi invasion, you think it would survive insurgents who give two shits about art and culture?\n\nIt’s like the Mona Lisa, The Louve is basically the Fort Knox of Europe. Let’s keep it in one the most protected places we can keep it.",
                                            "score": 10,
                                            "author": "VulpineJota",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The artifacts belong to them and part of their history and saying they can't protect them is a white man burden mentality that the colonizers used to justify stealing them in the first place.",
                                                    "score": 1,
                                                    "author": "KoolD4d",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I am an Iraqi and I can tell you  directly, NO, we cannot protect it, i come from the war torn city of Mosul and the amount of ancient history that was destroyed is staggering.\n\n&amp;#x200B;\n\nWe are a country of ancient history and so much can be attributed to that small location which is known as the cradle of civilization.\n\n&amp;#x200B;\n\nYet the vast majority of Iraqis are unaware of their own history busy fighting over what religion is yours and what family you belong to.\n\n&amp;#x200B;\n\nmany of our wealthiest people got wealthy by taking the ancient sculptures, the history of my country and selling it over seas, you can find on youtube videos of ISIS destroying statues that are 6 thousand or 4 thousand year old in the name of religion that they don't understand.\n\n&amp;#x200B;\n\nSo yes, I as an Iraqi say that it's better that our scriptures are kept safe for everyone to know about instead of wasted and destroyed so that they can be lost in the sands of time.\n\n&amp;#x200B;\n\nLong story short, if my people had them right now, they would either sell them or destroy them",
                                                            "score": 3,
                                                            "author": "GrandMagician"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Vatican has stolen all sorts of treasures from across the globe.",
                    "score": 78,
                    "author": "ChiefQuinby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So basically the British, but with more gold and child rape.",
                            "score": 55,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's the most accurate thing I've seen written today.",
                                    "score": 14,
                                    "author": "LornAltElthMer"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think that is really just because they appropriate every artifact they can get their hands on",
                    "score": 27,
                    "author": "DoDucksEatBugs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even Gold from concentration camps and art collections confiscated at the time...",
                            "score": 22,
                            "author": "Owldawg"
                        },
                        {
                            "level": 2,
                            "comment": "Bring out the ark of the covenant! I know your hiding it. Muahahaha",
                            "score": 8,
                            "author": "lHawkI"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sokath, His Eyes Uncovered!",
                    "score": 2,
                    "author": "kybarre88"
                },
                {
                    "level": 1,
                    "comment": "Because they are thieves.",
                    "score": -5,
                    "author": "Willzohh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everyone is a thief",
                            "score": 2,
                            "author": "Justantino4U",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True. There are degrees of dishonesty in all people. \n\nBut isn't their thing to be authorities for God? Kinda funny that they get to collect mega-billions from the faithful, walk in bejeweled slippers, sit on thrones of gold and steal everything of value they can get their hands on.\n\nI hope one day they are brought to justice and \"Everyone is a thief\" is the defense they try to use. That would be hilarious, don't you think?",
                                    "score": 2,
                                    "author": "Willzohh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There just more successful because of their fanatic walking wallets",
                                            "score": 4,
                                            "author": "Justantino4U",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; walking wallets - LOL\n\nThat's a new one for me! Mind if I use it?",
                                                    "score": 3,
                                                    "author": "Willzohh",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Every idea is free to use, you don't have to ask",
                                                            "score": 5,
                                                            "author": "Justantino4U"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Does it have anything to do with the Treaties they signed with Mussolini?",
                    "score": -3,
                    "author": "Owldawg"
                },
                {
                    "level": 1,
                    "comment": "Does it have anything to do with the Treaties they signed with Mussolini?",
                    "score": -8,
                    "author": "Owldawg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The story of the great flood, certainly carried across the generations around the world, although because it took place in the past, they did tend to get the dates wrong, or to co-op the story into their own mythology.\n\nThe actual flood was 12,000 years ago - the end of the last ice age, when sea levels rose by over 100 meters.  Flooding farming lands and hunting lands and forcing a great migration.",
            "score": 23,
            "author": "QVRedit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I find it doubtful that there’s an “original” flood myth. Almost every major civilization in the world spawned in a river valley/flood plain. Flooding would have been a thoroughly recognizable natural disaster, and so naturally would be emphasized and exaggerated in oral myths. Seems more likely to me that multiple civilizations developed their own myths independently of each other or any single event.",
                    "score": 17,
                    "author": "Marl_Karx_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That' wouldn't explain the similarities between all the flood myths of different cultures. Such as a chosen person building a boat or raft to keep each species from going extinct. Then using some type of bird to prove the end of the flood.\n\nWhile Genesis in the bible is a collaboration of many different religions in middle/near east, there have been similar flood myths recorded in the Americas. Which means this mythical flood was not confined to one area, but was a global event.",
                            "score": 1,
                            "author": "ThermalPaper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, firstly, those are all very surface level similarities with easily explainable reasons. \n&gt; a chosen person\n\nA protagonist of the story. If someone is going to be surviving the flood where everyone else dies off, it makes sense that said person would need to be warned by the gods/God. \n\n&gt; building a boat or raft to keep each animal from going extinct\n\nI mean they need a way to explain why the species that exist today still exist. Clearly they would have needed to survive somehow, and idk about you but I’ve never seen a deer build a boat on it’s own.\n\n&gt; using a bird to prove the end of the flood\n\nNaturally. Birds can fly, ergo see further, and don’t need to be only the land to live.",
                                    "score": 0,
                                    "author": "Marl_Karx_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; I mean they need a way to explain why the species that exist today still exist. Clearly they would have needed to survive somehow\n\nWhy? when God can just create them again? God is an all powerful being that can create humans and animals just by speaking them in existence. Why would they **need** to explain how these animals survived the flood when God could have just created them again? \n\nI would understand if this was a single explanation from a single culture, but this is a world wide phenomenon. So the Gods of cultures and people all over the world decided to flood the earth, save the animals, and create a new world? why not just flood the earth and create humans and animals again?\n\n&gt; Naturally. Birds can fly, ergo see further, and don’t need to be only the land to live.\n\nSame as my statement above, why couldn't God just let the protagonist know that the flood  is over? why do so many faiths rely on a bird to figure out if the flood is finished?\n\nThere is a story being told here, and this story is a world wide event. Genesis itself is eerily similar to creation myths of eastern religions and native American religions. To try and explain away tens of thousands of years of history based on what you know from a couple decades of living is incredibly arrogant. The life you live today is *because* of the ancestors that came before you, they lived through rougher, harder, and darker times than we can ever imagine. I wouldn't underestimate their intelligence or wisdom.",
                                            "score": 1,
                                            "author": "ThermalPaper",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "...why is this devolving into ad hominem? I thought we were just talking.",
                                                    "score": 1,
                                                    "author": "Marl_Karx_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; devolving into ad hominem\n\nReally? you think I'm attacking you?\n\nOffense is taken, not given.",
                                                            "score": 1,
                                                            "author": "ThermalPaper"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No original flood myth?  Meh - we’ve all heard that one before.",
                            "score": -2,
                            "author": "pompatusofcheez"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you trying to say that there was a global flood?",
                    "score": 3,
                    "author": "marinersalbatross",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t think there was a global flood so much as a flood that destroyed the entire area that people of the time knew of, so *for them* it was a flood that destroyed the world. There have been a few floods that destroyed huge areas of settled land. I know the [Black Sea deluge](https://en.m.wikipedia.org/wiki/Black_Sea_deluge_hypothesis) is a popular theory to explain the story of the great flood. It didn’t flood the world, obviously, but it might have caused a flood that caused the people who lived there to think that the whole world was flooded.",
                            "score": 16,
                            "author": "Nikcara",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Black Sea Deluge is very interesting. Contrary to the Biblical narrative the Quranic texts never mentioned the presence of a global flood. Noah was a prophet sent to a certain people and the ones who suffered were simply his people. It wasn’t a global flood and such natural disasters are far more feasible in a region, especially when you consider that a global flood would mean that there would be a massive change in the global ecosystem.",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, you’re going to have a very hard time convincing me that a truly global flood ever happened. Where did the water come from? Where did it all go once the flood was done? If there were only two of each animal, how did their descendants not get inbred to the point of being incompatible with life? How did aquatic life cope with the sudden change in salinity of the water? Plus plenty of other questions. \n\nBut a flood that was large enough that it *felt* like the whole world to the people writing down the story? Sure. Or an oral tradition that eventually morphs into a story of the whole world when the first iterations of it were just of a great flood? Also completely plausible. People making up a story to explain why they sometimes find old shells far away from the ocean? I’ll buy that. Entire world actually covered in liquid water that has since disappeared? No.",
                                            "score": 1,
                                            "author": "Nikcara"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes there was, but the sea level rose by around 100 meters over a period of a few years.\n\nTo anyone living on the old coastline, it must have seemed like the whole world was flooding.\nThe rate of the flood would have been slow enough that you could just walk away from it, but the next day you would have to move again, and keep moving until you found higher ground.\n\nThat would be especially a problem in areas like the Mediterranean basin.  But areas around India would also have had the same problem.\n\nThats why their culture also talks about a great flood that changed the world.",
                            "score": 7,
                            "author": "QVRedit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100 meters is 109.36 yards",
                                    "score": 2,
                                    "author": "converter-bot"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, I'm gonna need a source for this because while sea levels rose, there is no way that this flooding happened around the world at the same time.\n\nedit: funny how I keep getting downvoted and yet, no sources. Lots of claims, but no links to actual sources.",
                                    "score": -2,
                                    "author": "marinersalbatross",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The ocean level rose - the oceans are connected up - of course it went around the whole world.\n\nYou can’t increase the sea level by 100 meters in one spot without the water spreading out elsewhere - it globally rose by around 100 meters, while kilometres of ice melted away on the higher land in the Northern and Southern land masses.  When various ‘ice dams’ melted, huge surges of water flooded out.\n\nIt’s all a matter of geological record.   \nDated to around 12,000 years ago. (11,700)",
                                            "score": 11,
                                            "author": "QVRedit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oddly enough, [sea levels don’t rise evenly around the world.](https://phys.org/news/2018-12-uneven-sea-tied-climate.html) I’ll agree that it’s counterintuitive, and sea levels will rise everywhere, but not to the same levels.",
                                                    "score": 1,
                                                    "author": "Nikcara",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Spin gravity effects could explain part of that - water bulges out near the equator, and is depressed in near to the poles.",
                                                            "score": 1,
                                                            "author": "QVRedit"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The oceans of the world are all connected. Every coast line in the world would be affected simultaneously (within a few days at most).",
                                            "score": 2,
                                            "author": "steve_of"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The stories in the Bible are responses rather than derivations of Gilgamesh. Due to copyright laws, our modern literature isn't the kind of open conversation that literature in the ancient world was like.",
            "score": 3,
            "author": "tkmlac"
        },
        {
            "level": 0,
            "comment": "It was carved on 12 tablets by the Sumerians. Yea, it was carved on 12 tablets by the Sumerians. On twelve tablets was it carved by the Sumerians.",
            "score": 5,
            "author": "transmothra"
        },
        {
            "level": 0,
            "comment": "I have been wanting to read this! Is there even a way too?",
            "score": 6,
            "author": "LaciNGomez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Didn‘t look at the pdf, but there have been pretty recent new relases of scientific edits / translations. I know I ordered a german one one or two years ago that was pretty new. Included context and comments which was crazy helpful. \n\nI‘ll edit if I find it.",
                    "score": 13,
                    "author": "Ulldra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Great! That would be cool!",
                            "score": 1,
                            "author": "LaciNGomez"
                        },
                        {
                            "level": 2,
                            "comment": "Which German one?",
                            "score": 1,
                            "author": "Audiblesounds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "‚Das Gilgamesh-Epos‘, Übersetzt, kommentiert und herausgegeben von Wolfgang Röllig. \n\nReclam, ISBN 978-3-15-018686-2",
                                    "score": 2,
                                    "author": "Ulldra"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The pdf is in the link",
                    "score": 3,
                    "author": "DinosaurTomato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah! I see ☺️Thank you.",
                            "score": 2,
                            "author": "LaciNGomez"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hail Gilagamesh!",
            "score": 6,
            "author": "SomeKindOfOnionMummy"
        },
        {
            "level": 0,
            "comment": "Happy to say, I studied the Epic of Gilgamesh during my freshman year in college at the University of Toronto.",
            "score": 2,
            "author": "SageJim"
        },
        {
            "level": 0,
            "comment": "Thanks for posting this here, I absolutely love the Epic of Gilgamesh.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Mythology, Folklore, The Bible... anyone notice a trend?",
            "score": 8,
            "author": "HooverSchneef",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "🌎 👨🏼‍🚀🔫👩🏼‍🚀",
                            "score": 9,
                            "author": "NorthernLights05"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or maybe they all reference the same history and phenomena differnetly maybe the billions of people in the world who have spiritual experiences aren’t the idiots but those “scientists” who should have learned that in a universe rife with infinite possibilities you can’t look at the millimeter thick surface of things we know and go nope no such thing your all stupid the only thing we really know is that we don’t know very much.",
                    "score": -17,
                    "author": "nibck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are absolutely right in the assertion that we dont know very much.  The problem is that a great many people try to assert that the bible or religious text of their choice is all they or anybody else should need to know.  They use it as way to insulate themselves for any idea they dont like in an incredably narrow, often ironically intolerant world view.  I believe that is what the above comment is speaking to.  But I could be wrong.",
                            "score": 3,
                            "author": "bdonovan222",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you if only they said this instead they use “science” to hold exactly the same sized world view. Instead they use it like the Roman Catholic Church to corral us into the kind of lives where all the wonder is out of the universe cause they think they understand . \"The first sip from the cup of natural science makes one an atheist, but at the bottom of the cup, God awaits.\" Werner Heisenberg",
                                    "score": 1,
                                    "author": "nibck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I find the idea that science and religion are somehow mutually exclusive to be very strange.  The need each other in my opinion.",
                                            "score": 4,
                                            "author": "bdonovan222"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your point is valid but could use some fine tuning. I think at the end of the day nobody knows the truth about life, so to presume that one idea is more correct is just absurd. In my opinion us humans think way too highly of ourselves in the context of the scale of the universe, we are so so so very small and potentially insignificant but in spite of that we power on with society as if it is not the case. I’m always in awe of our ability to recognize the vastness of the universe and then turn right around and head to work for the day, suppose if that was coded into our brains we’d all just kill ourselves.",
                            "score": -6,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are new sections that’ve been recently found as well",
            "score": 1,
            "author": "fragile_cedar"
        },
        {
            "level": 0,
            "comment": "I heard about this years ago on a chat program called Paltalk by a very knowledgeable  atheist I had completely forgotten about it thanks for posting",
            "score": 1,
            "author": "Rational-Peter"
        },
        {
            "level": 0,
            "comment": "More than 3 years old.",
            "score": 1,
            "author": "teamistressily"
        },
        {
            "level": 0,
            "comment": "Has it been translated into English? Is it a free ebook?",
            "score": 1,
            "author": "leroyone1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, it is a free PDF e-book: https://holybooks.com/the-epic-of-gilgamesh/",
                    "score": 1,
                    "author": "hanslicht"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This link doesn’t work for me. I can read it online but not download it as pdf.",
            "score": 1,
            "author": "harrambeyourcouch"
        },
        {
            "level": 0,
            "comment": "George Carlin was right about Americans. Half of you are dumb and the rest of you are really dumb motherfuckers.",
            "score": -1,
            "author": "ihaveacoupon"
        },
        {
            "level": 0,
            "comment": "There's literially nothing original in the Bible period.\n\nIt's all just a copy of more successful religions of their time.  It's like a corporation that was like how can we have that level of success.....copy everyone else!!\n\n\nEDIT:\nIf you're downvoting just pick up a history book or take a theology class.\n\nLiterially take any Holiday.\n\nChristmas is German pagan worship of nature.  What do you think the tree is for?  You thought Jesus came back as a tree?\nhttps://www.washingtonpost.com/lifestyle/home/how-christmas-in-the-us-has-evolved-from-its-german-roots/2015/12/16/c904f84e-a2b6-11e5-9c4e-be37f66848bb_story.html\n\nEaster is the worship of Eostre.  You thought Jesus shat eggs?\nhttps://www.abc.net.au/news/2017-04-15/the-origins-of-easter-from-pagan-roots-to-chocolate-eggs/8440134\n\nMost of everything about Jesus is just Zoroastrianism and greek gods.\n\nMost of the bible is a worship of astrology (I'm using the anceint word not the modern).  That's why there's so many references to numbers, dates, times, sun, stars, ect,. Which was huge back before this even existed.\n\nOn and on.\n\nhttp://www4.westminster.edu/staff/brennie/Rennie%25202007%2520CSSR.36.1.3-7.pdf\n\nDon't be afraid to pick up a book. \n\nhttps://www.express.co.uk/news/science/774752/JESUS-prior-religions-CONTROL-the-people-roman\n\nhttps://en.m.wikipedia.org/wiki/Jesus_in_comparative_mythology\n\nUnfortunately it's hard to find more information without turning to text books since Christians have spent millions of dollars to obscure this fact.  As you will see if you try to google this topic.\n\nIt's literially just copying other things and mixing it in with what they wanted.  As a lovely form of control.  Mostly slave control at least during Roman times.  That's why there's so many references to accepting suffering as a clensing process for the after life.\n\nThis is why Catholics take the bible with a pinch of salt and refer to the text as a collection of parables.\n\nIn the US puritans and evangelicals have interpreted the text as 100% true as if it were written by God himself.  Except it's not these are literially a collection of chosen books from hundreds of possible choices.  Chosen by the people, written by people, obscured to whatever they feel like meaning by people.\n\nNot all Christians approach the book as an ordained object.",
            "score": -2,
            "author": "Volomon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really related but maybe  - have you read Neil Gaiman's American Gods?",
                    "score": 1,
                    "author": "Lhamo55"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok. I’m confused. When do people think the flood was to have occurred?",
            "score": 0,
            "author": "Comfortablynumb_10"
        },
        {
            "level": 0,
            "comment": "You can't see the vast majority of planets without a telescope. But hey you keep on believing whatever it is you're thinking.",
            "score": 0,
            "author": "ihaveacoupon"
        },
        {
            "level": 0,
            "comment": "So Gilgamesh and Endiku killed Humbaba in a cedar forest. Humbabas power is still there, that cedar forest is in the gulf of Mexico and where the power for voodoo comes from. They currently believe this cedar forest is in Iran but pangea has shifted since.",
            "score": -8,
            "author": "ChiefQuinby",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the cedars are meant to be those in Lebanon",
                    "score": 13,
                    "author": "coralrefrigerator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pangea shifted.",
                            "score": -12,
                            "author": "ChiefQuinby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is some next level stupidity. Congratulations.",
                                    "score": 14,
                                    "author": "beero"
                                },
                                {
                                    "level": 3,
                                    "comment": "Pangea was way, way before any human being ever existed.",
                                    "score": 9,
                                    "author": "that-writer-kid"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey - spoilers, man!",
                    "score": 7,
                    "author": "recumbent_mike"
                },
                {
                    "level": 1,
                    "comment": "Humans evolved too late to have lived on the Pangean supercontinent itself",
                    "score": 7,
                    "author": "imaginary_t-rex"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*doubt",
            "score": -5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is historical fact. Not mythology.",
            "score": -23,
            "author": "ihaveacoupon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you high? This was written by people who didn't know what the Sun was. \n\n\nChill out with \"hIsToRiCaL fAcTs\" to describe genesis stories.",
                    "score": 10,
                    "author": "OrsoMalleus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean... it‘s both. The book itself is a historical fact, while some of the mythological stories in it may hold a few historical truths - which we can‘t really identify as such due to lack of information.",
                            "score": 5,
                            "author": "Ulldra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wouldn't call that \"fact\" as much as \"hints of truth\". It's not up to us to declare what's fact and what might have a shred of truth to it without knowing the full picture, which we just don't.\n\nLike the Bible, it was written as parables- it has a moral to it and it might have literal references but ultimately I wouldn't call a genesis story \"factual\".\n\nIt's *very* unlikely that a guy and his gay lover killed a demon and then slapped a goddess with a ribeye steak, but I guess no one can say for sure it didn't happen.",
                                    "score": 7,
                                    "author": "OrsoMalleus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry, I think we both missed each others point.\n\nWith ‚historical fact‘ I meant the book itself - it‘s existence, the impact on literature and stories in general that it had throughout history. \n\nI very much agree that its contents aren‘t facts and will most likely forever be in the realm of the mythological in a broad sense, based on the fact that we have very few sources to rely on. \n\nThere might be some truth hidden in its contents, but we can‘t really distinguish those from fiction. Aside from a few smaller pieces (aka Gilgamesh likely existed or something along those lines) we will most likely not be able to tell much about how factual the storytelling in Gilgamesh is.",
                                            "score": 5,
                                            "author": "Ulldra",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We agree wholeheartedly. The book obviously exists (in PDF format nonetheless), but it's likely a work of fiction.",
                                                    "score": 2,
                                                    "author": "OrsoMalleus"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We do. There are thousands of tablets, many of which have not been translated. And just to point out that the less you find of a civilization the older it is. A great example of this is the Olmecs. They are so old that we don't even know what they were really called, so in lieu of that their name comes from the area. Look it up before you speak or respond, but I know you wont.",
                                            "score": 1,
                                            "author": "ihaveacoupon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What do the Olmecs have to do with Gilgamesh? Are you suggesting that their legends, stories, tales, parables and fables are all factual too, just because we haven't translated them?",
                                                    "score": -1,
                                                    "author": "OrsoMalleus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Alot more than you know. Their history is intertwined with Sumerian. Why don't any of you take 2 minutes and look it up yourselves? How lazy and ignorant are most of you? But I'm sure it will fall on deaf ears. My point about the Olmecs was completely wasted in this thread. Americans are lazy.",
                                                            "score": 1,
                                                            "author": "ihaveacoupon",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "*A lot",
                                                                    "score": 0,
                                                                    "author": "OrsoMalleus",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "CAPTAIN PADANTIC TO THE RESCUE!:)",
                                                                            "score": 2,
                                                                            "author": "bdonovan222",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Hey man he asked for it when he played the r/iamverysmart attitude, but you're not wrong.",
                                                                                    "score": -1,
                                                                                    "author": "OrsoMalleus",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You sure about that? Can you give me any reason you think it is?",
                    "score": 2,
                    "author": "dumthegreat18",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because aspects of it are in other tablets and recorded elsewhere by the Sumerians. Questions that Eygptologists don't like are \"if they had no high technology, then how did they know about all the planets and their orbits?\". You will find many ancient cultures have built them throughout history. You can follow the naming of planets and descriptions all the way back to the Sumerian Epic of Creation. The information is there, it's up to you, read, don't read. But most people won't, they will just retort with some BS, thinking that they are right. That's fine.",
                            "score": -4,
                            "author": "ihaveacoupon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They looked at the sky, that’s how they were such great and dedicated astronomers. If they had advanced technology we would’ve found it by now.",
                                    "score": 4,
                                    "author": "dumthegreat18",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "To be fair looking at what they had available.  As I have been for the last hour or so.  I certainly dont see a telescope as being very possible.  They had glass but incredibly primitive glass and therefore no way to make either lenses or mirrors that could be used for the purpose.  They also specifically mention only the 5 planets that can be see by eye as you said.",
                                            "score": 4,
                                            "author": "bdonovan222"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Iv thought alot about this and I dont think this is true.  Unless they figure out plastic, which they obviously did not, even the most advanced technology made from wood, metal, cloth, leather or even ceramics and glass would have been obliterated by entropy in way less than 4500 years.  Just look at what happens to a old car left in a field for 80 years.  Its largely disintegrated.  In 300 years there would likely only be glass left and even that would have been so broken pitted and polished by the elements as to be largely unrecognizable.  I'm not saying they had advanced technology but it seems like it is very possible that they could have.",
                                            "score": 1,
                                            "author": "bdonovan222"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "FACT. The Sumerians also wrote the Epic of Creation. Which if you're not high, should read. It talks about the Big Bang. Sumerians built telescopes, knew all the planets and orbits. There are several clay tablets from them proving this. I appreciate the downvotes though. Ignorance must be bliss.",
                    "score": -6,
                    "author": "ihaveacoupon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Motherfucker thinks Sumerians had spaceships",
                            "score": 6,
                            "author": "dumthegreat18",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the sumerians actually invented the ipod",
                                    "score": 11,
                                    "author": "antiquegeek"
                                },
                                {
                                    "level": 3,
                                    "comment": "LMAO. Always some ignorance on display. The facts are the Sumerians knew about the planets and their orbits. That is a cold hard fact, that your snide, rude comment won't change. No matter how much you wish a magical genie would change it. They recorded this on several clay tablets. Many programs also. A quick search on Google will show you many pictures from Sumerian where they depict the solar system. Period. FACT. Truth. Prove they didn't or STFU",
                                    "score": -7,
                                    "author": "ihaveacoupon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What clay tablets?",
                                            "score": 3,
                                            "author": "dumthegreat18"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What are you on man",
                                            "score": 2,
                                            "author": "dumthegreat18",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its called knowledge. Get some.",
                                                    "score": -1,
                                                    "author": "ihaveacoupon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Do you have proof?",
                                                            "score": 1,
                                                            "author": "dumthegreat18",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Can you read?",
                                                                    "score": -1,
                                                                    "author": "ihaveacoupon",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Can you give me a source and respond to my comment?",
                                                                            "score": 4,
                                                                            "author": "dumthegreat18"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Any sources for your information, what clay tables specifically? If there were highly advanced ancient civilizations on earth like you say we would’ve found something belonging to them, especially in orbit.",
                                                                            "score": 3,
                                                                            "author": "dumthegreat18"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Respond you coward.",
                                                                            "score": 2,
                                                                            "author": "dumthegreat18",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You obviously read the comment in order to respond. So I ask you again no less, can you not read? A coward is the one who runs away and refuses to see what's in from of them. That's not me, that's you",
                                                                                    "score": -1,
                                                                                    "author": "ihaveacoupon",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If you make the claim, you have to prove it. But knowledge of the planets doesn’t mean telescopes, human beings have been looking at the stars for eons...",
                                            "score": 1,
                                            "author": "that-writer-kid",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I already pointed out how to look for yourself. Do the work don't be lazy and just make d3mands for s9mething you can see for yourself. Americans are fucking lazy.",
                                                    "score": -2,
                                                    "author": "ihaveacoupon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hmmm see when I research it no One says they had telescopes. You can see all the planets, minus Uranus and Neptune, and their orbits with a naked eye.",
                                                            "score": 2,
                                                            "author": "watchSlut"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Ok then. Explain how they knew.",
                                                    "score": -2,
                                                    "author": "ihaveacoupon"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Downvote the one person who actually gave you real, factual, provable information? HAHAHA Americans really are ignorant.",
                                            "score": -1,
                                            "author": "ihaveacoupon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How is this provable? If they had advanced technology we would have found it already.",
                                                    "score": 2,
                                                    "author": "dumthegreat18",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That same question can be applied to the Great Pyramids of Giza.",
                                                            "score": 0,
                                                            "author": "ihaveacoupon",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They had paid workers.\n\nhttps://www.google.com/amp/s/www.history.com/.amp/news/ancient-egypt-pyramid-ramp-discovery\n\nhttps://www.discovery.com/exploration/how-the-pyramids-were-built",
                                                                    "score": 2,
                                                                    "author": "dumthegreat18"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "idk if this is reliable, send me a video of u downloading it and listen to some of it in the video too, im srry for asking this, im just not aware if this is safe",
            "score": -11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Weird ask. You can get it on Gutenberg.org if you’re worried about safety.",
                    "score": 8,
                    "author": "that-writer-kid"
                }
            ]
        }
    ]
}