{
    "id": "llwwdz",
    "score": 664,
    "title": "The Trial, one of Kafka's best-known works, is the terrifying tale of Josef K., a respectable bank officer who is suddenly and inexplicably arrested and must defend himself against a charge about which he can get no information. The novel has resonated with chilling truth for generations of readers.",
    "author": "sephbrand",
    "date": 1613575514.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/llwwdz",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Omg I had to read this in school, interpret every scene and it was part of my graduation exam. The horror. Although it wasn’t bad at all :D",
            "score": 28,
            "author": "15021993",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds exhaustive but I hope you can still enjoy it.",
                    "score": 5,
                    "author": "sephbrand"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now *this* is Kafkaesque",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I ma so glad that *that* government is gone. But the way Polish politics are going, we're about to swing into hard  auth from the right this time",
                            "score": 3,
                            "author": "JakubSwitalski"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wouldn’t call it terrifying myself. Rather, it induces anxiety.",
            "score": 9,
            "author": "tell-me-the-truth-"
        },
        {
            "level": 0,
            "comment": "I love it for taking my breath for hours asking myself: What in god's name is going on here... Desorientación in the modern world has never been described better.",
            "score": 5,
            "author": "might_not_beam_me",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's another compelling reason to read this book :)",
                    "score": 6,
                    "author": "sephbrand"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I finished this right after new years. A good book to have read, but to me who recently picked reading as an interest up again recently it can drag on sometimes. But it was very satisfying to have read it.",
            "score": 5,
            "author": "spugg0"
        },
        {
            "level": 0,
            "comment": "I read this in university and can’t say I appreciated it. Not sure what has resonated for people.",
            "score": 4,
            "author": "meeloveulongtime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Life is perplexing and paradoxical; too complex to comprehend, like being in a maze one cannot escape, &gt;!until a goat headed monster with an axe catches you and cuts your head. !&lt;",
                    "score": 7,
                    "author": "LewisLegna"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good book but makes you feel miserable while reading it.",
            "score": 4,
            "author": "imnotactuallyvegan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would say that makes it an even better book.",
                    "score": 3,
                    "author": "flumsi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember reading Metamorphosis by Kafka, but I don't believe I've ready The Trial.",
            "score": 3,
            "author": "BottlingMeUp"
        },
        {
            "level": 0,
            "comment": "Definitely a compositionally flawed novel, there are many elements in it that were clearly only a preliminary draft. Nonetheless the essence of the novel is poignant like the rest of Kafka's writing. He really grasped something unique about the modern human experience in his writing.",
            "score": 2,
            "author": "LewisLegna"
        },
        {
            "level": 0,
            "comment": "Like a dog!\n\nI had a dream the other night that reminded me of it, I was in prison and couldn't remember why. Are you really guilty if you don't know what you did?",
            "score": 1,
            "author": "Onion-Fart"
        },
        {
            "level": 0,
            "comment": "I read this in college and really liked it. But I come to appreciate it the more and more I get into the adult life.",
            "score": 1,
            "author": "Xargom"
        },
        {
            "level": 0,
            "comment": "I just read it last week. I must confess that I mostly found it annoying and wondering why it was a classic. Possibly I'm illiterate but so be it.",
            "score": 1,
            "author": "MickyC51"
        },
        {
            "level": 0,
            "comment": "I have read it, and you may say that maybe I didn't read it as it should have been, but I found the fiction artificial, like someone is forcing the story throughout the entire chapters. I understand that vagueness is the beauty of fiction; nothing is explained in an obvious manner, however, ambiguity to the point where the only thing left is an ambiguous story with characters dancing according to the writer's wishes is odd. Look at his other work, like The Metamorphosis; you will feel that no one is not forcing the story; these are the characters themselves that are leading the story. Something occurred to a character one day, and everything next was a sequel of the previous event. I found this independence of characters missing in The Trial. Every character seems to be bound by an “external” force that is controlling and manipulating them. If we try to link the story of The Trial to Kafka’s personal life, then this story does take us somewhere. There are different manifestations of this fiction's meanings, which is a sign of a great novel, but I think it may not be his best work.\n\nThe best part I like about this novel is that as you read it, you will feel suffocation and will be befuddled at everything occurring in the story. This feeling will only grow as the story progresses and will eventually reach its pinnacle at the end. Flaws of the judicial system or anything else, a marvel which has flawlessly captured a human feeling and lets you experience this as if you were Joseph K. himself.",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He never finished it, apparently, that may account for some of your critiques",
                    "score": 4,
                    "author": "imnotactuallyvegan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is correct. He died of tuberculosis before he could finish it, even order of the individual chapters is more or less guessing by his friend who edited it for print.",
                            "score": 4,
                            "author": "sdasda7777"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought the movie was excellent, but I'm not sure I want to experience it again by reading it.",
            "score": 1,
            "author": "killbeard"
        },
        {
            "level": 0,
            "comment": "It was so anxious book and took me forever to finish.",
            "score": 1,
            "author": "BlackViperMWG"
        },
        {
            "level": 0,
            "comment": "To bad it doesn’t have true ending",
            "score": 0,
            "author": "Curious_Wedding_2555",
            "replies": [
                {
                    "level": 1,
                    "comment": "BITCH?! WHYD U HAVE TO SPOIL IT",
                    "score": -9,
                    "author": "kyleforgues",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s not a spoiler, a spoiler would be knowing Josef is killed😘oops sorry bitch",
                            "score": -15,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Clicked around, didn’t get a free book",
            "score": 0,
            "author": "harrambeyourcouch"
        }
    ]
}