{
    "id": "osqcvn",
    "score": 1017,
    "title": "1984 was George Orwell’s chilling prophecy about the future. And while the year 1984 has come and gone, his dystopian vision of a government that will do anything to control the narrative is timelier than ever. Orwell’s masterpiece is a profound, terrifying, and wholly fascinating book.",
    "author": "sephbrand",
    "date": 1627403828.0,
    "url": "https://www.reddit.com/r/FreeEBOOKS/comments/osqcvn",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "1984 didn't actually take place in 1984, as far as I'm aware. The main character thought it was 1984, but couldn't be entirely sure. He knew history was being redacted and at one point stated he wouldn't be surprised if the year had been redacted / changed.\n\nI'm saying this from memory, so I could be wrong.",
            "score": 50,
            "author": "WereWolfBoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are correct.",
                    "score": 12,
                    "author": "girlwithswords",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what big brother wants you to think.",
                            "score": 9,
                            "author": "JoeSicko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We have always been at war with Eurasia",
                                    "score": 5,
                                    "author": "DrRetr0_76"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "also...\n\n&gt;dystopian vision of a government that will do anything to control the narrative is timelier than ever\n\nI often argue with people about this. They take the book as a window in to how a government controls its people. But I think that ignores the other side of the lesson; fascism creates a populace that wants to be controlled. It kind of makes better sense when you see it both ways. Authoritarianism is a symbiotic relationship. \n\nThe party had a 3 tier motto: \n\n* War is Peace\n* Freedom is Slavery\n* Ignorance is Strength\n\nReaders often act like this is some private guidebook for the government on how to fool the people. But it isn't. It is literally their outward facing motto. It's not a mantra that people are forced to repeat so they can be brainwashed. It's the appeal. The people *believe these things to be true.* And because they believe them to be true they support the party.\n\nLook no further than what's happening right now. People believe these things to be true and they rally around the people who support these ideas. \n\n* If you are a strong man who tries to bully everyone around you and constantly threatens people with violence.... well that's the path to peace. Nobody messes with you.\n* If you give people too much liberty to think for themselves and make their own choices, that expands on ideas about what it means to be a respected member of society. The idea gets so muddied down and distorted that people become literal slaves to the confusion. Nobody knows who they are or what they should be doing and are therefore easily controlled. You have more freedom of course if you fit the mold.\n* Why would you admit you are wrong about anything? Why trust scientists? Or professors? Or experts? They will just shoot down your beliefs. Sometimes the higher truth is the one you believe to be true and you shouldn't be open to criticism from people who follow narrow minded rules around 'fact-finding'. If you band together with other like minded people, who know what is true by faith then you will be impervious to the criticisms of others. That's strength.\n\nThat's my take on it anyways. The people in 1984 want to be oppressed and it only seems different because we see the story through the eyes of the one person who doesn't.",
                    "score": 9,
                    "author": "AverageLiberalJoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Brave new world, Animal farm &amp; 1984. These tell me pretty much all I need to know to get a relatively good understanding about society at present.",
            "score": 77,
            "author": "liuqibaFIRE",
            "replies": [
                {
                    "level": 1,
                    "comment": "May I suggest adding *Lord of the Flies* to this list?",
                    "score": 20,
                    "author": "blond_nirvana",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've got my next read, thankyou stranger!",
                            "score": 4,
                            "author": "liuqibaFIRE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[The nonfiction version is better.](https://www.theguardian.com/books/2020/may/09/the-real-lord-of-the-flies-what-happened-when-six-boys-were-shipwrecked-for-15-months)",
                                    "score": 12,
                                    "author": "johnabbe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s an excellent read, thanks for sharing.",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I probably first heard about it [via Kottke](https://kottke.org/20/05/the-real-lord-of-the-flies), where there's also links to more background including two Twitter threads about the kids' perspective / the culture they grew up in.",
                                                    "score": 2,
                                                    "author": "johnabbe"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That book uses a niche subculture to describe the downside to teaching humans that compliance is more important than critical thinking. Of course, maybe those downsides are preferable after all.",
                            "score": -4,
                            "author": "antmansclone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; That book uses a niche subculture to describe the downside to teaching humans that compliance is more important than critical thinking. Of course, maybe those downsides are preferable after all.\n\nMaybe we're coming from different angles, but that sounds like saying the Nuremberg defense (superior orders) is preferable.",
                                    "score": 3,
                                    "author": "blond_nirvana",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m definitely coming from a different angle. I have yet to find a single person who views the story the way I do. The Nuremberg defense doesn’t apply to my interpretation, though it is adjacent. You got the military part right. These kids lived in an environment where orders were given and followed, in a military fashion. I worked with an Army Ranger who often pointed out that in team challenges that require initiative and creative solutions (like The Amazing Race on TV, but in real life as well), teams composed entirely of veterans tend to fare not so well because those situations favor collaboration over order of command. The kids in the story were thrown into a dangerous world and did their best to replicate the only functional society they knew. That functional society failed them in that moment. That’s it. That’s the whole of the lesson. There is nuance and meaning to the imagery, and plenty to glean, but it is not the story of a supposed natural human tendency toward or desire for chaos that everyone says it is.\n\nAs for the appeal to superior orders - oof. I side with and oppose the idea in nearly equal measure.\n\nEdit forgot to add: regarding the statement that perhaps it’s preferable to have a society that follows orders over their personal qualms - antivaxxers don’t exist in that space.",
                                            "score": 0,
                                            "author": "antmansclone"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The book is sexist and Hobbesian, better left out",
                            "score": 0,
                            "author": "LabCoatGuy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fahrenheit 451 is also really really good and was quite prescient imo",
                    "score": 15,
                    "author": "NotSecretlyANarwhal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That for me was a tough read, great book. The writing style threw me off at first with a lack of clear transition from inside the mind to what is actually happening, the pacing is a slog, but the story itself and how damn close it gets in accuracy to present day is outstanding. Too bad the screen renditions have been underwhelming.",
                            "score": 5,
                            "author": "KTWM1987"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Totally! They're all must reads these days.",
                    "score": 21,
                    "author": "sephbrand",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You also need to understand them. And if you did you wouldn't be arguing that they help you understand today's society.",
                            "score": 7,
                            "author": "Prosthemadera"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fahrenheit 451, published just a few years after 1984, has absolutely chilling connections to today's media omnipotence and what it does to society as a whole. Only 150 pages, I think, but Bradbury packs in A LOT of social commentary that has truly stood the tests of time.",
                    "score": 2,
                    "author": "sandaier76"
                },
                {
                    "level": 1,
                    "comment": "Yep that's all the political theory you'll ever need!",
                    "score": 2,
                    "author": "BraveRutherford",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, just read old fiction books and ignore any modern books or opinions that may challenge your views!",
                            "score": 0,
                            "author": "Prosthemadera",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Present us some alternatives, please.",
                                    "score": 2,
                                    "author": "liuqibaFIRE",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There's so many on all aspects of society. That's another reason why your comment above is absurd.",
                                            "score": 2,
                                            "author": "Prosthemadera"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is this /r/bookscirclejerk? Because you cannot understand society today by reading an 80 year old book. Those books did not give you those views. You already had them. You're just using them them confirm your preexisting ideas about society.",
                    "score": 1,
                    "author": "Prosthemadera",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know life is not all doom and gloom, I also understand and accept a multitude of other more positive worldviews but all of these books are relatively accurate at depicting how society has and will continue to evolve in certain regards. \n\nI lived in China for a number of years where I saw that their total control and manipulation of everything people understand was very similar to these books. They recently announced a plan to create quotas of students that should go to university vs technical college &amp; into unskilled labor if that isn't brave new world then idk what is. \n\nHumans have a habit of classifying and quantifying items, including ourselves. Maybe this is the only way for an effective society to evolve, maybe not. Only time will tell.\n\np.s I didnt downvote",
                            "score": 1,
                            "author": "liuqibaFIRE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; I know life is not all doom and gloom, I also understand and accept a multitude of other more positive worldviews but all of these books are relatively accurate at depicting how society has and will continue to evolve in certain regards. \n\nNo, they haven't. Unless you're superficial and reductive. You could use most science fiction books as a comparison to something that happens today. That doesn't meant they are teaching you anything. You're just projecting what you already know into them.\n\n&gt; I lived in China for a number of years where I saw that their total control and manipulation of everything people understand was very similar to these books. They recently announced a plan to create quotas of students that should go to university vs technical college &amp; into unskilled labor if that isn't brave new world then idk what is. \n\nYou found a thematic similarity. And now what? Nothing. All you did was take something you already knew and found something similar in an old book. \n\nBut if you want to go the other direction and use the book to extrapolate what will happen in the future: That doesn't work. Just because there are similarities that doesn't mean everything will become reality. China is not the same as the world in Brave New World. \n\nI'd argue that if you use these old books then you're missing the real problems because your understanding of society is warped. How are people manipulated in China? How does Chinese history and culture play into this? What can we do about? None of that can be answered by reading these books.\n\n&gt; Humans have a habit of classifying and quantifying items, including ourselves. Maybe this is the only way for an effective society to evolve, maybe not. Only time will tell.\n\nI don't know how that relates to the topic.",
                                    "score": 2,
                                    "author": "Prosthemadera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dang, sorry dude I don't have the time to argue with a stranger on the net! Prehaps join a debate club.",
                                            "score": 1,
                                            "author": "liuqibaFIRE",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You don't have time and yet you made several comments in this thread. \n\nIf you don't want to talk then don't discuss this topic and then run away, simple. This is just like Brave New World where people only want pleasure and put no work into anything.",
                                                    "score": 4,
                                                    "author": "Prosthemadera",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I thought you said the modern world wasn’t anything like these books? \nIt’s difficult to find time with work and a family.",
                                                            "score": 1,
                                                            "author": "liuqibaFIRE"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I bet that China’s constitution is footnoted by 1984",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah the lazy anti-communism take, how shocking... I bet the \"Ignorance is Power\" tenet from 1984 would't at all fit in with Trump's America, now would it? Tucker Carlson feeds off of this principle alone.",
                            "score": 1,
                            "author": "sandaier76",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, the empty accusation take. Ever read 1984? There’s more per capita public monitoring via camera in China than anywhere in the world. They can take their “social credit” system and shove it where the sun doesn’t shine.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can you explain what the social credit system is in China?",
                                            "score": 1,
                                            "author": "BraveRutherford",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Better yet, [here’s](https://en.wikipedia.org/wiki/Social_Credit_System) a wiki link to their social credit system. There are plenty of other sources inline as well. Many (not me) think that a form of this is already in place in the US without citizen knowledge",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You are conveniently neglecting the UK, which for most of the past decade has been either beating or on-par with China in terms of surveillance of its citizenry (per capita). Funny (or scary?) that Orwell's warnings about the Big Brother state have come 'round to some extent in his *own* country. Not here to argue with ya, and I know I'm biased; I've lived in China for a decade and yes, there are cameras everywhere but it really doesn't bother me in the slightest. If you're not doing anything wrong, who cares? If you're about to do something wrong, like commit a serious crime, that camera can either prevent you from doing so or enable law enforcement to find you easier. I'll give up my 'privacy' for the fact that I know with certainty that there will be NO violent crime occurring against me or my family here in China.",
                                            "score": 1,
                                            "author": "sandaier76",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "FYI, China is now on the hunt to find every individual that booed the Chinese National Anthem during an incident in Hong Kong … their camera surveillance system is key to finding these individuals. Here’s one of the many online [reports](https://www.bbc.com/news/world-asia-china-58022068?xtor=AL-72-%5Bpartner%5D-%5Bmicrosoft%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D) describing what happened. I’m sure that any citizen that turns in his fellow neighbor will see their “social credit” score go up.",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At present?",
                    "score": 1,
                    "author": "antmansclone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "~~Is it charging anyone else $1.99?~~\n\nEdit:  I see it was applied at checkout.  I'm an idiot.",
            "score": 6,
            "author": "StealthRUs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you enter the discount code?",
                    "score": 1,
                    "author": "Mr_PersonManSir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It has been my position for decades that the only thing Orwell got wrong was the year...",
            "score": 37,
            "author": "candidly1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Every year for decades was just like 1984 to you?",
                    "score": 1,
                    "author": "Prosthemadera",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Was my statement actually that nebulous for you?",
                            "score": 1,
                            "author": "candidly1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes or I wouldn't have asked.",
                                    "score": 2,
                                    "author": "Prosthemadera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I felt that Orwell's view of governments becoming Big Brother has been developing into reality for quite some time now; I felt his views were correct but he got the title wrong. Maybe it should have been \"2024\", since we're almost there.",
                                            "score": 1,
                                            "author": "candidly1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can you explain how without arguing that the privacy issues of a private company is just like 1984? Because 1984 is a lot more. You didn't even say which country it applies. Or does it apply to all of them?\n\nIf Orwell was correct then you wouldn't be able to even make this comparison to the book.",
                                                    "score": 2,
                                                    "author": "Prosthemadera",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "While we certainly aren't completely there yet, there are places in the world that are close. There are sources that suggest every citizen in China is observed by a government-controlled video camera essentially every day of their lives. And they already  have behavior scoring where anything you do that the government doesn't like ends up being tallied against you, with varying degrees of punishment.",
                                                            "score": 1,
                                                            "author": "candidly1"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish the original inspiration for this book was more well known, it kind of irks me that the book get so much praise when while good it isn't as original as it might seem. There's a book called \"We\" by Yevgeny Zamyatin. Orwell even reviewed the book and one of the editions, I would assume the first and then never again mentioned the book.",
            "score": 5,
            "author": "Muto_Ashirogi_"
        },
        {
            "level": 0,
            "comment": "One thing throws me with this.  \n\n\nOrwell thought it would be an overbearing authoritarian government that did this to us, most likely at least sort of against our will.  \n\n\nInstead, we used facebook, amazon, and google, gave it all away willingly, and happily put these monitoring devices in our cars, our wristwatches, our bedrooms, our back pockets....  \n\n\nIt's worse than Orwell could've imagined, and we ran towards it with glee. No forcing required.",
            "score": 23,
            "author": "omaha71",
            "replies": [
                {
                    "level": 1,
                    "comment": "Orwell was a student of Huxley and this is exactly where their ideas differed. Both saw the future as dystopian. Orwell thought it would be due to an oppressive government whereas Huxley thought the people would willing distract themselves into oppression. Depending on the country/culture you look at now, either could be correct.",
                    "score": 19,
                    "author": "kinkywinky91",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Either could be correct because they aren’t prophesying the future - they’re interpreting the present age.",
                            "score": 2,
                            "author": "antmansclone"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; It's worse than Orwell could've imagined\n\nTo argue that today's privacy and personal data issues are worse than what happens in 1984 is actually crazy. Proof that you haven't read the book. Or just skimmed it.",
                    "score": 8,
                    "author": "Prosthemadera"
                },
                {
                    "level": 1,
                    "comment": "Even Orwell touched on how people willingly and happily complied. They loved Big Brother.",
                    "score": 13,
                    "author": "girlwithswords"
                },
                {
                    "level": 1,
                    "comment": "Jesus. People think the surveillance is the disturbing part of the story?!",
                    "score": 3,
                    "author": "antmansclone"
                },
                {
                    "level": 1,
                    "comment": "Facebook is the five minutes of hate.",
                    "score": 3,
                    "author": "JoeSicko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's really not. 5 minute hate was forced. \n\nIf Facebook is five minutes hate then this applies even more so to Fox News.",
                            "score": 0,
                            "author": "Prosthemadera"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Read it in 1975! Everything has become frighteningly realized",
            "score": 10,
            "author": "falstaff57",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I just came back from getting rats shoved into my face! /s\n\nGive me a break. If 1984 was real you wouldn't even be making this comment.",
                    "score": 4,
                    "author": "Prosthemadera",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tell me more.",
                                    "score": 3,
                                    "author": "Prosthemadera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Why are you refusing to explain where it's real?",
                                                    "score": 1,
                                                    "author": "Prosthemadera"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is it not letting my download it like I usually do?",
            "score": 4,
            "author": "SuperSanttu7",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's because we have produced this eBook under licence since copyright is still in effect in the United States. We're offering this edition as a limited time deal among American people to ensure they don't commit copyright infringement.",
                    "score": 1,
                    "author": "sephbrand",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It says  \"you are certifying that you are not in the United States\" under the download link. So do you mean the rest of the continent when you say Americans?",
                            "score": 3,
                            "author": "3GTEN",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean citizens of the United States.",
                                    "score": 2,
                                    "author": "sephbrand"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Ministry of Truth",
            "score": 2,
            "author": "bike_tyson"
        },
        {
            "level": 0,
            "comment": "Is this website trustworthy?",
            "score": 2,
            "author": "pistaye15",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yarp? Did you mean “yeah” ?",
                            "score": 2,
                            "author": "pistaye15",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh okay, thanks",
                                            "score": 2,
                                            "author": "pistaye15"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " I don't think the U.S. goverment ever tells the truth unless the truth happens to be good news.",
            "score": 3,
            "author": "BleepVDestructo",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ";)",
                            "score": 1,
                            "author": "BleepVDestructo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not free once in the cart: it’s $1.99",
            "score": 3,
            "author": "ewwmang",
            "replies": [
                {
                    "level": 1,
                    "comment": "Discount is applied when you check out, making it $0",
                    "score": 3,
                    "author": "jbrown383",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I freaked out when it asked me for my name and address and phone number, so i bailed!!! I want it for free and i want to remain anonymous. It’s ironic that you need to supply this information to get 1984 for free 😳",
                            "score": 5,
                            "author": "ProAvgGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed. I bailed out myself for the same reasons.  Free in this case is \"free\".",
                                    "score": 2,
                                    "author": "jbrown383",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, i was expecting free free-free free-free-free",
                                            "score": 0,
                                            "author": "ProAvgGuy"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not really relevant nowadays, at least not in the west. People who say we’re living in 1984 have almost never actually read 1984 (or realized Orwell was a socialist lol)",
            "score": 4,
            "author": "JadeHourglass",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depending on how far back you go, Nazi Germany for instance being a lot of the inspiration",
                    "score": 0,
                    "author": "LabCoatGuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I found the two minutes of hate, a vary close comparison to the tuker Carlson and Rachel Modow like shows. Where we are told who and what the problems are.",
            "score": 1,
            "author": "Strange_Travel_813"
        },
        {
            "level": 0,
            "comment": "Reading it now. Strangely corellates with situation in China, now even more when it was applied to situation in Soviet Union back in a day.",
            "score": 1,
            "author": "recontitter",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always thought it more directly applied to Nazi Germany",
                    "score": 0,
                    "author": "LabCoatGuy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish all conservatives actually read this book instead of just taking keywords from it. I swear 99% of the time I see conservatives using 1984 as an argument it's always in the wrong context or just a terrible comparison.",
            "score": -4,
            "author": "SeSuSo"
        },
        {
            "level": 0,
            "comment": "I wonder why orwell was so scared of the government, considering he gave a list of people to the british secret service. I mean, why would a man ever be so sc- oh wait, he raped multiple women. Case solved, we can go home bois.",
            "score": -23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Source? And those people were Stalin-defending commies. He fought in the Spanish Civil War for *Anarchist Catalonia* ffs.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "First of all, he did not fight for the anarchists, get your facts right, he fought for poum, a marxist Party split between trotskyists and bukarinists, and secondly, read eric and us. Eric was the real name of Orwell.",
                            "score": 0,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Also, \"the government should only step in when THEY are doing something\" is the most twitter 1984 comparison shit i have ever read.",
                            "score": -4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am so f****** sick of assholes using this and Hitler to justify arguements instead of like, ACTUAL FACTS ABD HISTORICAL BASIS?? This is science FICTION",
            "score": -29,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "One of the only books I actually finished from high school. Thanks for the link, can’t wait to get into it",
            "score": 1,
            "author": "ChefGuapo"
        },
        {
            "level": 0,
            "comment": "The Wanting Seed by Anthony Burgess is poignant as well. I have also always thought that (while not political )The Machine Stops by E M Forster was way ahead of its time as a commentary about our dependency on technology.",
            "score": 1,
            "author": "Projectahab"
        },
        {
            "level": 0,
            "comment": "Since it’s gone. I think it’s going to be a private company in 2084.",
            "score": 1,
            "author": "indiandevil3"
        },
        {
            "level": 0,
            "comment": "https://t.me/joinchat/vXa552F8Oq4zNGVk",
            "score": 1,
            "author": "Dcsmow0211"
        },
        {
            "level": 0,
            "comment": "https://t.me/joinchat/vXa552F8Oq4zNGVk",
            "score": 1,
            "author": "Dcsmow0211"
        },
        {
            "level": 0,
            "comment": "Double speak is fake news.",
            "score": 0,
            "author": "[deleted]"
        }
    ]
}