{
    "id": "10yzegw",
    "score": 1719,
    "title": "Love Potion (pink punch for Valentine's Day)",
    "author": "Elizabeth_SugarHero",
    "date": 1676054477.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/10yzegw",
    "media_urls": [
        "https://gfycat.com/livelyunhealthyaidi"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Please post your recipe comment in reply to me, all other replies will be removed. Posts without recipes may be removed. Don't forget to flair your post!\n\n##**Recipe Comment is under this comment, click to expand**\n\n##**↓****↓****↓**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GifRecipes) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Those were the most beautiful raspberries I've ever seen",
            "score": 90,
            "author": "sarahbarahboo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just normal raspberries that haven't gotten moldy. 😅",
                    "score": 20,
                    "author": "pimpmastahanhduece"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 254,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd use sparkling wine instead of vodka here, you want the effervescence (bubbles) to give it a brighter, more drinkable flavor, rather than just have it be raspberry fruit at the bottom vodka",
                    "score": 56,
                    "author": "WeDriftEternal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Both !",
                            "score": 10,
                            "author": "hurryupand_wait"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! Or replace the soda with Sparkling wine.",
                    "score": 62,
                    "author": "BunnyBunnyBuns"
                },
                {
                    "level": 1,
                    "comment": "Yeah this think is in desperate need of liquor",
                    "score": 53,
                    "author": "Superrocks"
                },
                {
                    "level": 1,
                    "comment": "Lmao, I saw the gif and first thing I thought was \"needs more alcohol.\"",
                    "score": 19,
                    "author": "polite_alpaca"
                },
                {
                    "level": 1,
                    "comment": "My first though was also where is the booze.",
                    "score": 4,
                    "author": "SinThenStir"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Think I might have try put the purée through a sieve, or maybe just blend the hell out of it. I have no aversion to seeds, but my partner dislikes them a lot. Still, a solid combination.",
            "score": 50,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Straining it would work great! Since I don’t mind them I take the lazy way sometimes.",
                    "score": 21,
                    "author": "Elizabeth_SugarHero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like them for the varied texture, but some folks have issues with them getting stuck between their teeth, and I can understand why they would not want that.",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She wore a raspberry puree",
            "score": 13,
            "author": "SteamyBriefcase",
            "replies": [
                {
                    "level": 1,
                    "comment": "Alright, take my upvote 😅",
                    "score": 2,
                    "author": "Elizabeth_SugarHero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Appreciate the non-alcoholic beverage recipe! This is something I can actually do without having to do any substitution.",
            "score": 14,
            "author": "ikarem-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome, my pleasure!",
                    "score": 2,
                    "author": "Elizabeth_SugarHero"
                },
                {
                    "level": 1,
                    "comment": "Right! Like I was thinking I should do this for my kids tonight.",
                    "score": 2,
                    "author": "MANDALORIAN_WHISKEY"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Add champagne for some class.\n\nBut in reality we are all going to add vodka to this so we can get white-girl wasted.",
            "score": 90,
            "author": "eat_with_your_fist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hah yes it’s very good with vodka! (I’ve done vanilla vodka and it was 👌🏼.) But sparkling rosé is a good substitute to keep things bubbly and pink.",
                    "score": 41,
                    "author": "Elizabeth_SugarHero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Girl, you deserve to be among the nobility! My gf is going to think I'm a love-wizard because of you haha.",
                            "score": 19,
                            "author": "eat_with_your_fist"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isnt this more akin to a float than a punch?",
            "score": 8,
            "author": "ONSFishing"
        },
        {
            "level": 0,
            "comment": "I would do a shot of vodka, a spoonful of jam (way easier), and top off with bubbly instead",
            "score": 14,
            "author": "Dotjiff",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol I first read this like you'd take shots of vodka and chase them with jam and my initial thought was \"yeah that would be easier\".",
                    "score": 22,
                    "author": "Rush_Is_Right",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm still not convinced that *isn't* what they meant, tbh",
                            "score": 10,
                            "author": "NinjaVaca"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks amazing and I'm definitely going to try it. All my favourite things!",
            "score": 3,
            "author": "LarinaRichards",
            "replies": [
                {
                    "level": 1,
                    "comment": "pro tip. Get a mixing bowl, put the ice cream in there and blend it with half of the champagne. Then fill it into the glasses and top it of with fresh champagne. I made this drink a lot of times for friends and family.",
                    "score": 5,
                    "author": "Go3tt3rbot3"
                },
                {
                    "level": 1,
                    "comment": "Thank you! Let me know how it goes!",
                    "score": 2,
                    "author": "Elizabeth_SugarHero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mmmm gonna love all those seeds stuck in my teeth after every sip.",
            "score": 0,
            "author": "StrawberryKiss2559"
        },
        {
            "level": 0,
            "comment": "So made this for Valentines day, after straining and pushing every bit of liquid through a sieve for the jam to get rid of the seeds you are left with enough for two glasses following this recipe. Tried it with a Brot sparkling wine and it worked well. Note for others trying this honestly the jam is not that important, the wine and sherbet make a float style texture and you may need to do a few smaller pours and let the foam die down each time.",
            "score": 1,
            "author": "Bresdin"
        },
        {
            "level": 0,
            "comment": "Just straight vodka and skip the pink stuff",
            "score": -20,
            "author": "AkisFatHusband"
        },
        {
            "level": 0,
            "comment": "Ah, yes. Let me just combine these ingredients, none of which are available in my country. Gin Tonic it is then.",
            "score": -13,
            "author": "Krocsyldiphithic"
        },
        {
            "level": 0,
            "comment": "Why are there more than two glasses? No one has a Valentine's party with multiple guests unless I am bitter and alone and throw a single's night. But I wouldn't serve this there, just Malort topped with bitter tears. It looks delicious though.",
            "score": -13,
            "author": "Luckychunk"
        },
        {
            "level": 0,
            "comment": "Where’s the vodka?",
            "score": -4,
            "author": "Past_Contour"
        }
    ]
}