{
    "id": "113yy3g",
    "score": 1650,
    "title": "Chicken Meatballs in Green Curry Broth",
    "author": "BushyEyes",
    "date": 1676576026.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/113yy3g",
    "media_urls": [
        "https://gfycat.com/saltydisloyalkookaburra"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Please post your recipe comment in reply to me, all other replies will be removed. Posts without recipes may be removed. Don't forget to flair your post!\n\n##**Recipe Comment is under this comment, click to expand**\n\n##**↓****↓****↓**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GifRecipes) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I use Mae Ploy as my go-to paste (but Maesri is a good vegetarian option). It's the best besides home-made. I also add a blend of fresh ginger (galangal if I can find it), garlic, and lemon grass. I blend them into the paste with chicken stock.\n\nHard to tell from the vid how long you fried the curry paste for, but it's important to fry it in oil to bring out the flavor.\n\nI HIGHLY recommend stewing a makrut lime leaf in curry dishes if you want to capture Thai flavor. It is an indispensable flavor of southeast Asian cooking that often gets overlooked in the states. Once you add it you'll realize *that's* why your dish doesn't taste like the restaurant versions.\n\nMost Asian grocery stores carry them where I'm at. Fresh ones are in the fridge, but they keep well in the freezer.\n\nEDIT: I confused brands. I only use maesri when cooking vegan/vegetarian as it doesn't have shrimp paste in it. My favorite paste is Mae Ploy.",
            "score": 51,
            "author": "piltonpfizerwallace",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I wish I had gotten makrut lime leaves — I make Tom kha with them and it’s amazing.\n\nIf you like southeast Asian cooking, Auria’s Malaysian kitchen makes a Malaysian rendang spice blend that is absolutely amazing and she doesn’t fuck around with heat — it’s super spicy but with tons of flavors from the aromatics. Not a paste, it’s a dry blend. I’ve made short ribs in it with coconut milk. Super good.",
                    "score": 18,
                    "author": "BushyEyes"
                },
                {
                    "level": 1,
                    "comment": "Also just a tip everyone about kaffir- fresh leaves can be put in the freezer and taken out leaf by leaf to use ;) same with chilis, galangal, and lemongrass (though best used in soups once it has been frozen)",
                    "score": 12,
                    "author": "only_bc_4chan_isdown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also, just one more tiny note - \"the k-word” is a [racial slur](https://en.wikipedia.org/wiki/Kaffir_(racial_term))... just a helpful FYI! Here's more [info](https://www.merriam-webster.com/dictionary/Kaffir) for the [uninitiated](https://slate.com/culture/2014/07/kaffir-lime-racist-murky-origins-suggest-a-racial-slur-might-be-responsible-for-the-fruits-name.html). \n\nI will definitely be buying them and freezing them, so that tip is super helpful!",
                            "score": -1,
                            "author": "BushyEyes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The article you linked explains that the term is likely not related to SA at all.\n\nBut, nevertheless, I'm happy to let the word die and use makrut instead. I hadn't heard that word for them before.",
                                    "score": 5,
                                    "author": "piltonpfizerwallace",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I could probably stand to do more research on it than the few articles I pulled. I’ve seen people are adamantly against the use of the word but it’s still used pretty regularly, so I’m not sure where it falls on the spectrum of offensiveness, but I’ve just removed it from my vocabulary since I’d been corrected in the past on it.",
                                            "score": 3,
                                            "author": "BushyEyes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I can't be bothered to do the research needed to have an informed opinion on it.\n\nIt's the kind of thing like... Even if you're technically right, you could still hurt someone's feelings so regardless it's good to phase out. \n\nI appreciate you bringing it up. I hope I didn't sound too dismissive earlier.",
                                                    "score": 2,
                                                    "author": "piltonpfizerwallace"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nobody that says kaffir lime leaves is going to think they are using a slur.",
                                    "score": 10,
                                    "author": "BakaTensai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, it was helpful for me to learn so I thought others may want to know. I’m not telling you what to call them, but I got corrected once and was embarrassed but still grateful because I had no idea the history or meaning of the word.",
                                            "score": 4,
                                            "author": "BushyEyes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“Corrected” that means u were wrongly using it. The previous commenter said context matter. So with context, there wouldnt be need to correct or whatever. Lets see whats actually used among various selections of people first then conclude whats an appropriate word(s) to use?",
                                                    "score": 3,
                                                    "author": "ransom_witty",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, I guess based off what I read, the consensus has been “Makrut” — you can check out the article I posted from slate and while the conclusion is that it’s not certain whether the word’s origins are a racial slur, they felt the best thing to do was put the word to rest. Some people are more adamantly against its usage but I see it used quite broadly. \n\nAgain, I’m not the word police or telling anyone what to do, I just shared it because it was helpful for me to know and I would hate to use a word that carries hurt with it.\n\nAnd by “corrected” I meant that someone said the same thing to me, IE, “hey FYI this word can be blank, here’s what I use instead”",
                                                            "score": 9,
                                                            "author": "BushyEyes"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Recipe here originally:** [**Chicken Meatballs in Green Curry Broth**](https://www.triedandtruerecipe.com/green-curry-chicken-meatballs/)\n\nFor the curry paste, I only recommend the brand I used in the video if you like a milder green curry paste. I would have preferred it to be spicier, but I thought the jar was cute; alas...twice as expensive and not as good IMO. Should have stuck with Maesri.\n\nI used a Thai/Chinese shiitake mushroom which are meatier than the more delicate shiitake caps. If using shiitakes with thinner caps, adjust cooking time as needed as they have the propensity to dry out quickly.\n\n* 1 pound ground chicken\n* 2 eggs\n* 5 cloves garlic, peeled\n* 4 Thai chili peppers, trimmed\n* 3 scallions, scrubbed and trimmed, divided\n* 1 shallot, peeled\n* 1 tablespoon lemongrass paste\n* ½–¾ cup panko or plain breadcrumbs\n* 1 tablespoon neutral oil\n* 1 yellow onion, peeled and sliced\n* 6 ounces shiitake mushrooms, stems discarded and caps sliced\n* 2 tablespoons green curry paste\n* 3 cups water or chicken stock\n* 15-ounce can of full-fat coconut milk\n* Salt and pepper to taste\n* **For serving:**\n* Lime wedges\n* Crispy shallots\n* Chili oil\n* Cooked rice noodles\n\n**Prepare the meatballs:**\n\n1. Combine the chicken and eggs in a large bowl. Season all over with salt.\n2. Place the garlic, Thai chili peppers, shallot, and 2 scallions in a food processor and pulse until minced.\n3. Add the minced aromatics to the chicken along with lemongrass paste. Use your hands to combine. Add ½ cup panko or breadcrumbs and mix to combine. If the mixture is too wet, add an additional ¼ cup of breadcrumbs. Mix until combined and let stand 10 minutes.\n4. Heat 1 tablespoon oil over medium heat in a wide pot. Add a teaspoon of the meatball mixture and fry until cooked through. Taste and adjust seasonings if needed.\n\n**Fry the meatballs:**\n\n1. Form the mixture into meatballs and fry for 3–4 minutes per side until browned all over. They need not be cooked through. Transfer to a plate.\n\n**Cook the mushrooms and onions:**\n\n1. If the pot seems dry, add another tiny drizzle of oil. Add the onions and mushrooms and cook for 7–8 minutes. Stir the mushrooms regularly and continue cooking until they brown around the edges. Season with salt.\n\n**Sizzle the paste:**\n\n1. Add the green curry paste and let it sizzle in the pot for 30 seconds. Toss to coat the mushrooms and onions in the paste. Pour in the water or broth.\n\n**Simmer the meatballs:**\n\n1. Add the chicken meatballs to the pot and bring to a boil. Reduce heat and simmer 25 minutes or until meatballs reach 165ºF. Taste and season the broth to your preferences.\n\n**Finish the broth:**\n\n1. Mince the remaining 1 scallion, keeping the white and green parts separate.\n2. Stir the coconut milk and white parts of the scallion into the broth. Simmer 5 minutes.\n\n**To serve:**\n\n1. Ladle the broth over cooked rice noodles. Garnish with the minced scallion greens, lime wedges, and crispy shallots. Add a drizzle of chili oil if you like.",
            "score": 34,
            "author": "BushyEyes"
        },
        {
            "level": 0,
            "comment": "Try frying your curry paste in the coconut milk/cream first, with a fraction of oil if necessary, until it is fragrant, and splits. And then add your liquid.\n\nNot only will it taste better, but it's also easier to get the desired consistency when you add the main liquid last.\n\nHope that helps.",
            "score": 25,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting! I’ve seen that done, but I didn’t do that because the meatballs need to simmer in the water to finish cooking since I don’t like to cook the coconut milk too long. I’ll try it that way next time.",
                    "score": 11,
                    "author": "BushyEyes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You fry the spices with only the thick/creamy part of the coconut milk (so don't stir/shake the tin before you open it). Then you add the watery milk with the other liquids/broth later.",
                            "score": 12,
                            "author": "Yessbutno"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your recipes are always fire. This looks so good",
            "score": 4,
            "author": "adrock75",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 2,
                    "author": "BushyEyes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks good! Going to give it a shot later this week.",
            "score": 3,
            "author": "HobGobblers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 2,
                    "author": "BushyEyes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is lemongrass paste hard to find, or is it something I can pick up at most grocery stores?\n\nThis looks awesome, btw - thanks for posting!",
            "score": 3,
            "author": "ramagam",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve seen it at most of the grocery stores near me — giant, Safeway, etc.  it’s usually in the produce section near the small plastic packs of herbs — usually alongside garlic or ginger paste.",
                    "score": 3,
                    "author": "BushyEyes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, thanks  :)",
                            "score": 1,
                            "author": "ramagam"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "looks great",
            "score": 2,
            "author": "claystone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "BushyEyes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curry...broth? Am I missing something? I thought 'curry' described a specific type of substance, same way \"broth\" does.",
            "score": -1,
            "author": "GooseyGhost",
            "replies": [
                {
                    "level": 1,
                    "comment": "Soup may have been a better descriptor, but AFAIK *curry* doesn't always refer to a specific dish. There are specific curry dishes (IE, *chicken curry* in South and Southeast Asian cuisine, Caribbean cuisine, and Japanese cuisine, which I think is what you're referring to). This is made from curry paste, the backbone of various Thai dishes like soup, stir fry, and stews. You can use the curry pastes for a lot of different things, like this [recipe](https://www.eatingthaifood.com/thai-gai-pad-prik-gaeng-recipe-%E0%B8%A7%E0%B8%B4%E0%B8%98%E0%B8%B5%E0%B8%97%E0%B8%B3-%E0%B9%84%E0%B8%81%E0%B9%88%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%9E%E0%B8%A3%E0%B8%B4%E0%B8%81%E0%B9%81%E0%B8%81/) which is a stir-fry curry chicken recipe.  \n\nI'm not an expert, but in terms of nomenclature, I think it would still be appropriate to call it a curry soup...or even curry broth :)",
                    "score": 3,
                    "author": "BushyEyes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Air fry the meatballs 400f 10-12 mins, so much quicker/easier",
            "score": -3,
            "author": "Hefftee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t have an air fryer and I like having them cook in the broth - they end up super moist. If you prefer your air fryer, that works too!",
                    "score": 5,
                    "author": "BushyEyes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah this post is for the people who own airfryers and want to do your recipe,  save oil, and washing a pan. They also come out super moist, and you get a great crust.",
                            "score": -6,
                            "author": "Hefftee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I get that! But just in defense of the recipe, I would lightly advise against it, personally. The meatballs fry in the pan that later cooks up the broth, so there isn’t an extra pan. It builds up a layer of flavor that I think would be missing if you throw them in the air fryer. The meatballs cook in the broth and develop a moistness and flavor from the green curry broth that you wouldn’t get from the air fryer and adding them back in briefly at the end. Just my 2 cents. \n\n\nIf you love your airfryer, by all means go for it! Just like to explain the why of the recipe so people can decide what works best for them 😊",
                                    "score": 5,
                                    "author": "BushyEyes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have an air fryer and while I love it for certain things I 100% agree in this case...you'd miss the ability to deglaze the yummy meat bits into the broth and then imbue the meatballs with the curry flavor",
                                            "score": 2,
                                            "author": "drebunny"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Fair enough, that makes sense.",
                                            "score": 2,
                                            "author": "Hefftee"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Got to try this :]~~~~",
            "score": 1,
            "author": "YojinboK"
        }
    ]
}