{
    "id": "11a22s5",
    "score": 409,
    "title": "Pasta Corned Beef Carbonara with Pumpkin - Simple &amp; Tasty Weekday Meal Recipe",
    "author": "Jamesconnect",
    "date": 1677170263.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/11a22s5",
    "media_urls": [
        "https://gfycat.com/exemplaryunlawfulcrayfish"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Please post your recipe comment in reply to me, all other replies will be removed. Posts without recipes may be removed. Don't forget to flair your post!\n\n##**Recipe Comment is under this comment, click to expand**\n\n##**↓****↓****↓**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GifRecipes) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Keep the cursed carbonaras coming",
            "score": 338,
            "author": "JustASadBubble",
            "replies": [
                {
                    "level": 1,
                    "comment": "Carbonara w/ Pumpkin, Curry, Blue Cheese, and Corned Beef. \n\nNonna might stab you if you put this in front of her and said \"Carbonara!\"",
                    "score": 136,
                    "author": "MongoBongoTown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seriously. I’ve got a generous view on what “authenticity” means in cooking, but you can’t just mash an egg up with cheese and then put anything in the pan and call it carbonara.",
                            "score": 56,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're not claiming it's authentic. The title of the dish includes the baseline and the deviations to it. Anyone complaining about that just wants to complain about something.",
                                    "score": 7,
                                    "author": "Chalky_Pockets"
                                },
                                {
                                    "level": 3,
                                    "comment": "Why not? What defines carbonara? Genuine question, because with other pasta dishes it’s the sauce but clearly people are passionate about this specifically.",
                                    "score": 13,
                                    "author": "HungryHungryCamel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As mentioned by others, a carbonara is made a specific way.  \n\nI figure you can make a couple adjustments (add chicken, for instance) and it's still basically a carbonara.  \n\nBut the more things you add and change, the more you might as well call it something else.  \nIf I said I was serving hot dogs, then served sloppy joes made of chopped up hot-dog meat, you'd probably be confused why I bothered to still call it a hotdog when it's entirely different in taste, appearance, and mouthfeel.  \nSame basic principle applies here.",
                                            "score": 7,
                                            "author": "thegimboid",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean I get why THIS isn’t called carbonara. But to your hot dog analogy - if the sausage isn’t beef it can still be called a hot dog. If I add odd toppings it can still be called a hot dog. So if I use a different cheese or add peas, why not still call it carbonara?",
                                                    "score": 5,
                                                    "author": "HungryHungryCamel",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't think I'm as picky as some people here - generally I wouldn't complain about the simple addition of peas to a carbonara, so long as it's generally otherwise what I was expect to get on my plate if I were to order a carbonara at a restaurant.  \n\nRegarding my hot dog analogy, it was probably a poor description on my part - it's been a long day here. I was imagining something that looks identical to a sloppy joe, but with the meat made of frozen hot dogs cut up into tiny slices.   \nFollowing my above carbonara rule, not a bad idea for a food, but if I ordered a hot dog and got this sloppy joe thing instead, I'd be very confused.  \n\nAt a certain point, things just need different names.",
                                                            "score": 3,
                                                            "author": "thegimboid"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "When you order carbonara at a restaurant and get the style with peas and chicken and cream, it's a different pasta dish than the traditional carbonara. They're similar,  but I'd say it's like calling an Italian sausage a hot dog. It's ground meat in a casing, and you eat it the same way, but it's not a hot dog",
                                                            "score": 1,
                                                            "author": "coffeebribesaccepted"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Carbonara is traditionally made with 4 ingredients pasta, egg, guanciale and pepper. The more you add and modify the more of the recipe you lose. Nothing against all these recipes but I wouldn’t call them carbonara as that sets the wrong expectations and idea.",
                                            "score": 17,
                                            "author": "M1573R_W0LF",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No Parmesan?",
                                                    "score": 5,
                                                    "author": "jimbo-g",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Shit, I was tired and I forgot about pecorino 😅",
                                                            "score": 6,
                                                            "author": "M1573R_W0LF"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's pretty clear here. If anything, giving a different name just for the sake of tradition would be more confusing.\n\nWhat name would you give it that would set a better expectation?",
                                                    "score": 4,
                                                    "author": "OlinOfTheHillPeople",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Past with corned beef and pumpkin... Springs to mind",
                                                            "score": 2,
                                                            "author": "BinnocentEyestander"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Not sure, changing carbonara to carbonara inspired would be enough but it might become a philosophical problem more than a cooking problem. A what point does something stop being what it is and becomes something else",
                                                            "score": 2,
                                                            "author": "M1573R_W0LF",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Be a lot simpler if people going for authenticity would put \"authentic\" in front of the word, then the purists could argue about whether it's authentic enough because that's apparently worth their time and the rest of us who know what OP means by including the word carbonara in the title can just carry on.",
                                                                    "score": 4,
                                                                    "author": "Chalky_Pockets"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ah yes the classic thought experiment, the Ship of Tortellini.",
                                                                    "score": 3,
                                                                    "author": "kazaru7",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Basically, although it steers more towards “is a ship still a ship if you add wings and jet engines and make it fly”",
                                                                            "score": 2,
                                                                            "author": "M1573R_W0LF"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Call it a waste of time, carbonara is the sum being greater that each part because they all work together it's an equation. If you mess up the ratios it can be very disappointing. If you add something extra the sum is not better than its individual parts",
                                                            "score": -10,
                                                            "author": "fmcd97",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So you're saying you don't have a better name then, right?",
                                                                    "score": 9,
                                                                    "author": "OlinOfTheHillPeople",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "As I said \"a waste of time\"",
                                                                            "score": -11,
                                                                            "author": "fmcd97",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I can see I'm dealing with a real expert in food nomenclature, lol.",
                                                                                    "score": 13,
                                                                                    "author": "OlinOfTheHillPeople"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A lot of it is the history being the dish. It’s not an old dish but it has such a specific ingredient list and method of preparation. Obviously some things can still be added, like garlic in my opinion, maybe sub the ham for mushrooms or something if you’re veg, but overall, once you drastically change the ingredients with Carbonara, it is no longer Carbonara. I think I ended up at my final point. 😂",
                                            "score": 3,
                                            "author": "jo-louw"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Youre right. Let's call this caviar.",
                                            "score": -4,
                                            "author": "WRFGC"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I feel this recipe might be a declaration of war on Italy...",
                            "score": 1,
                            "author": "Garod"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I find it funny that most carbonara experts harp on “eggs only no cream!!!” and this mf is like ok imma mix in Gorgonzola cheese and pumpkin with your eggs lol",
                    "score": 10,
                    "author": "enjoytheshow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was really hoping that he was going to scoop out a handful, throw it on bread, and call it grilled cheese.",
                            "score": 4,
                            "author": "LIEUTENANT__CRUNCH"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If cuisine wasn't allowed to adapt with exposure to new ingredients and ideas, Italian food with red sauce couldn't exist.\n\nI watch every carbonara gif and get my sodium for the day in the comments.",
                    "score": 10,
                    "author": "nipoez"
                },
                {
                    "level": 1,
                    "comment": "No more carbonaras. Coming up is octopus spaghetti (octopus needs to be boiled in advance, so takes a bit of time to make, but is really good!!)\n\nItalian Pork sausage pasta with creamy sauce\n\nProbably will make something in the oven too, not sure what. Not lasagne though.",
                    "score": 8,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oven carbonara lasagna",
                            "score": 18,
                            "author": "JustASadBubble",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oven octopus carbonara bake sprinkled with gorgonzola and cinnamon",
                                    "score": 2,
                                    "author": "Jamesconnect"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Cinnamon Carbonara",
                            "score": 4,
                            "author": "tandoori_taco_cat"
                        },
                        {
                            "level": 2,
                            "comment": "Shepard's carbonara pie.\n\nThe English Italian crossover no one asked for.",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Gino D'Acampo of food.",
                                    "score": 3,
                                    "author": "Crow_eggs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Octopus carbonara",
                            "score": 3,
                            "author": "Ohbeejuan"
                        },
                        {
                            "level": 2,
                            "comment": "Well thank god, because this was anything else, but a carbonara. \n\nUsing random ingredients, then slap some egg on it, doesn’t make it a carbonara. This was a dish made with eggs, you could’ve just said that.",
                            "score": -3,
                            "author": "Not_This_Woman"
                        },
                        {
                            "level": 2,
                            "comment": "You have a bit of simple and classic approach but aren't afraid to take a spin on it. Definitely oven-baked mac and cheese.",
                            "score": 1,
                            "author": "logosloki"
                        },
                        {
                            "level": 2,
                            "comment": "Best way to deal with octopus is to beat the utter shit out of it in a plastic bag with lemon juice and some herbs in it, leave it overnight in the fridge then sear it on the bbq.",
                            "score": 1,
                            "author": "ImeldasManolos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Which octopus hurt you, friend?",
                                    "score": 2,
                                    "author": "HoodieGalore",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The extremely delicious one!",
                                            "score": 1,
                                            "author": "ImeldasManolos",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "oh yeah, after you beat him to a *pulpo*",
                                                    "score": 2,
                                                    "author": "HoodieGalore"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "every day we stray further from god's light",
            "score": 217,
            "author": "hobbysubsonly",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dunno. Think I'm gonna try this one-maybe more squash. Wouldn't necessarily call this carbonara, though.",
                    "score": 24,
                    "author": "lilfunky87"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the weirdest combination I've seen in a long time",
            "score": 47,
            "author": "fnhs90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right?? I think what baffles me the most is the gorgonzola and curry. I just can't get those two to marry in my head. Blue cheese and curry... i mean the whole corned beef, pumpkin, and blue cheese is already interesting but I know the last two do match. But the curry   I can't get past.",
                    "score": 7,
                    "author": "phicorleone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hell is empty, and all the devils are here.",
            "score": 62,
            "author": "Cavalir"
        },
        {
            "level": 0,
            "comment": "Power to whomever likes this combination of ingredients but for me this just got worse and worse as the video went on. Gorgonzola????? And corned beef and pumpkin with curry powder???? with penne??? This in all it’s glory is just fucking baffling to me",
            "score": 68,
            "author": "Sir_Poofs_Alot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everybodys so creative 😆",
                    "score": 22,
                    "author": "sundrops14"
                },
                {
                    "level": 1,
                    "comment": "Well, the only way to find out is to try it. One of the previous videos, similar to this but with chorizo, people tried it and said it was really good. That had gorgonzola in it too, and pumpkin, and paprika.",
                    "score": 5,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Look I never try to yuck anyone’s yum but it’s just a cacophony of conflicting ingredients to me. Like pick one “custom/signature” thing to add to a recipe, like curry, OR pumpkin, OR Gorgonzola, OR corned beef. All together this is just overwhelming to most people’s taste buds.",
                            "score": 23,
                            "author": "Sir_Poofs_Alot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What is so signature about pumpkin for it not to go well with curry or corned beef? Ok for the gorgonzola, that is sort of the odd ingredient, but that doesn't mean this isn't good.",
                                    "score": 11,
                                    "author": "Jamesconnect",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At least gorgonzola is cheese. What on earth is the curry powder doing in there?",
                                            "score": 8,
                                            "author": "sharpiefairy666",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Flavour and color.\n\nEdit : ok not so much color. What powder brand do you use OP?",
                                                    "score": 2,
                                                    "author": "EnvBlitz"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Look I never try to yuck anyone’s yum but hang on while I yuck your yum across multiple comments.\"",
                                    "score": 2,
                                    "author": "zulacake"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;\tWell, the only way to find out is to try it.\n\nI like this recipe for the most part, but this statement is not true. After making things from scratch for a while and dicking around with various ingredients, you end up being able to look at a recipe and predict exactly what it will taste like. Especially when you're the cook in the family and people keep asking you to fix the thing they made.",
                            "score": 2,
                            "author": "Chalky_Pockets"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "MrCarbonara over here",
            "score": 6,
            "author": "SirTacoBill"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 16,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The food itself looks good, but you could, if you have access to editing software that will let you, do some basic color corrections.\n\nA lot of your shots have a really unappetizing grey/blue hue to them, you could improve the look of the food by lowering some of your mids, maybe bringing your some of your whites down a quarter stop or so, increasing exposures on some shots which look way darker (you cutting the bacon and pumpkin, for example), and adding a little bit of saturation and/or vibrance over everything. Boosting contrast almost never hurts.",
            "score": 14,
            "author": "Beer_Pants",
            "replies": [
                {
                    "level": 1,
                    "comment": "Finally, constructive feedback!!\n\nThankyou so much not only for pointing that out, but also it seems you know a few things about editing and actually offered your advise on how to improve.\n\nI can see that the shots are shit and I think a big reason is that I was filming at night with just normal kitchen lighting.\n\nNow I've resorted to filming during the day which seems to help. Do any of the other videos I made look any better?\n\nAlso, the photos I took for this dish, and other dishes on my website are complete garbage. To improve them I bought some nice rustic plates and I'm placing the plates on a dark background, that seems to help for the photos. Still not uploaded any of the improved photos though.\n\nI'm using final cut pro for editing, I'll follow what your advice in the next video. But I think the biggest problem in this particular video is the lighting.\n\nThankyou, I truly appreciate",
                    "score": 6,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, of course! I'm not a colorist or anything but I know some basic photoshop and NLE stuff. Like 90% of food photography and videography is good lighting. I haven't used Final Cut in a long time because I've got access to an adobe suite at the moment, and before that I was able to get a free license through my university. But based on some quick googling you should be able to do what you need. I guarantee there's a youtube video of someone with a thick accent explaining what to do lol.\n\nHappy to help!\n\nEDIT:\n\nTook a look at some of your other stuff that was shot during the day, it definitely looks a great deal better! \n\nDefinitely look into grabbing a cheap light and some kind of diffusion for it to improve the look of your food! Because I know it'd all be tasty based on what's in the dishes, but the bar has gotten really high for making food look a certain way on the internet.",
                            "score": 2,
                            "author": "Beer_Pants"
                        },
                        {
                            "level": 2,
                            "comment": "Bang some parsley in there, all very monochrome",
                            "score": 1,
                            "author": "Vegemyeet"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did you have to call it carbonara",
            "score": 71,
            "author": "Roeckler",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because \"Carbonara\" is an easy clickbait term for pasta recipes",
                    "score": 31,
                    "author": "-Defkon1-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like carbonara is becoming the martini of the food world.  \n  \nA classic with a distinctive style made of very few and very specific ingredients, which has been modified and adapted several times over the years to create new dishes inspired by the original.  \n  \nThis dish is a carbonara in the way that an espresso martini is a martini. Some people will be fine with it because it looks similar, other people will vehemently disagree with the classification because of the ingredients. Either way, it’s probably delicious.",
                            "score": 8,
                            "author": "konydanza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably this is a delicious pasta, but this is a carbonara the same way a seaplane is a ship.",
                                    "score": 2,
                                    "author": "-Defkon1-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s a pretty good comparison!",
                                            "score": 2,
                                            "author": "Roeckler"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its an easy way to explain what the dish is without having to say \"penne with corned beef, pumpkin, undercooked eggs mixed with cheese\".",
                            "score": -9,
                            "author": "Jamesconnect",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "you could just say that.",
                                    "score": 7,
                                    "author": "yr_boi_tuna"
                                },
                                {
                                    "level": 3,
                                    "comment": "That would be much less clear. Your original title was better. \n\nFuck food gatekeepers.",
                                    "score": -2,
                                    "author": "OlinOfTheHillPeople"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because I used the same method, expect adding corned beef and pumpkin",
                    "score": -32,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And curry. And garlic. And gorgonzola. And parmesan instead of pecorino. The only thing you find in a carbonara here are the eggs. There isn't even any black pepper.",
                            "score": 18,
                            "author": "Doctor-Orion"
                        },
                        {
                            "level": 2,
                            "comment": "Why are people downvoting op for answering a question they were asked? And everyone's acting like they called this \"classic carbonara\" instead of specifically calling out how it's different from the usual preparation. Food pedants are the worst.",
                            "score": 4,
                            "author": "zulacake"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[\"If my grandmother had wheels, she would've been a bike.\"](https://youtu.be/A-RfHC91Ewc)",
            "score": 16,
            "author": "muteen"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 39,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A word I like for such people is carbonarieri. A play on carabinieri, an Italian term for military police.",
                    "score": 13,
                    "author": "logosloki",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's not true, they're 1/12th Italian, 17th generation straight from Sicily. Their great great great great great great great great great great great great great great great great grandmother would be rolling in her grave, if Carbonara actually existed when she was alive.",
                                    "score": 5,
                                    "author": "Ris747"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can guarantee that the vast majority of the carbonarians aren't even Italian, probably most aren't even European.\n\nI always say it's carbonara with - whatever I add to add. That way, whoever reads the title already knows its similar to carbonara, but with additions to it.\n\nNot even the Italians themselves (like real Italians that live in Italy) really care if carbonara is made with guanciale, pancetta or bacon.",
                    "score": 0,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😂",
                                    "score": 6,
                                    "author": "Jamesconnect"
                                },
                                {
                                    "level": 3,
                                    "comment": "Mootzuhdell",
                                    "score": 1,
                                    "author": "disqeau",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's just \"mutz\" by that point.",
                                            "score": 2,
                                            "author": "Radioactive24"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "because only italians can criticize italian dishes. literally no one else. not even professional cooks.",
                            "score": 6,
                            "author": "yr_boi_tuna"
                        },
                        {
                            "level": 2,
                            "comment": "Im Italian and I care. Just because it has eggs it doesn't mean that it's a carbonara. The fourkey ingredients are eggs, guanciale, black pepper, and pecorino romano. Yes, guanciale may be substituted with pancetta since it's sometimes hard to find or plain expensive, but still. \nSure, you could add pumpkin and call it pumpkin carbonara, but this dish has gorgonzola and other stuff that has nothing to do with carbonara.",
                            "score": 15,
                            "author": "fefeboi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My last carbonara i made with Serrano ham and I used bigoli pasta 🫢 will I ever find a handsome Italian husband?",
                                    "score": 7,
                                    "author": "ImeldasManolos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Make sure to break some spaghetti noodles to fit into the pot while dating. That way you can be sure of their heart health.",
                                            "score": 6,
                                            "author": "nipoez",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I like my spaghetti big and uncut thanks",
                                                    "score": 7,
                                                    "author": "ImeldasManolos",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What if the tips are slightly trimmed",
                                                            "score": 1,
                                                            "author": "ronindog",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Carbonara inspired\" is the best term for these dishes in my opinon.",
                                    "score": 3,
                                    "author": "TheIllusiveGuy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it just me or does the spoon in the thumbnail look like a mouse?",
            "score": 14,
            "author": "Captainpatch",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's why I'm here.",
                    "score": 2,
                    "author": "Brad_theImpaler"
                },
                {
                    "level": 1,
                    "comment": "Not just you.",
                    "score": 2,
                    "author": "AlfalfAhhh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This might be the weirdest recipe I've seen on this sub.",
            "score": 8,
            "author": "ROLL_AND_EGG"
        },
        {
            "level": 0,
            "comment": "I don’t even care it’s called carbonara - I personally don’t care much for the dish anyways.\n\nBut the combo of ingredients has my mind in shambles. I feel like this must have been a fridge clean out dish, but then that wouldn’t make sense because it seems the curry was an intentional add, maybe because of the pumpkin?\n\nWhat an odd recipe to me, thanks for sharing! I hope you enjoyed it.",
            "score": 13,
            "author": "BrownButta2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, I did",
                    "score": 1,
                    "author": "Jamesconnect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. I'm down for more of these carbonara impastas\n\n2. I'm not down watching all these people fail to eat spaghetti sliding around on a PLATE",
            "score": 8,
            "author": "jal0001"
        },
        {
            "level": 0,
            "comment": "People freak out about these like the wrong combo of ingredients in carbonara is the hidden off switch for the universe.",
            "score": 9,
            "author": "OniExpress"
        },
        {
            "level": 0,
            "comment": "\\*cue Vincenzo screaming in horror\\*",
            "score": 9,
            "author": "Arkell-v-Pressdram"
        },
        {
            "level": 0,
            "comment": "Nice pasta scramble. Not carbonara. But nice pasta dish.",
            "score": 23,
            "author": "thehorns78"
        },
        {
            "level": 0,
            "comment": "This is a pasta melt, NOT a carbonara smh my head",
            "score": 9,
            "author": "Bjartensen"
        },
        {
            "level": 0,
            "comment": "If this had ham in it, it’s closer to a British carbonara.",
            "score": 5,
            "author": "stayawayfrommeinfj",
            "replies": [
                {
                    "level": 1,
                    "comment": "If my grandmother had wheels, she'd have been a bicycle.",
                    "score": 5,
                    "author": "biscuitfortune"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loooove carbonara shitposts.\n\nIf you post this calling it carbonara people will be like \"It's not carbonara!! My grandma's rolling in her grave!!!\"\n\nThen if you post this without calling it a carbonara then people will be like \"uhh.. so it's just carbonara but with xyz\"",
            "score": 6,
            "author": "MrEnganche",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly that is what I was thinking.\n\nI would assume that all hell would break loose if someone was explaining this recipe to one of the die hard carbonarians, and to simplify the whole thing they went on to say, \"the method is similar to carbonara but you add pumpkin, corned beef, gorgonzola\".",
                    "score": 2,
                    "author": "Jamesconnect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm no pasta purist, but this is absolutely not carbonara",
            "score": 9,
            "author": "SirRupert",
            "replies": [
                {
                    "level": 1,
                    "comment": "The title says its corned beef carbonara with pumpkin.",
                    "score": -2,
                    "author": "Jamesconnect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you really just call any pasta dish you add eggs and cheese to a carbonara? The name has truly become meaningless.",
            "score": 11,
            "author": "Supper_Champion",
            "replies": [
                {
                    "level": 1,
                    "comment": "I guess its the same argument with a cheese melt. You can't call a grilled ham and cheese sandwich a \"cheese melt\" but I don't see why you can't call it a \"cheese melt with ham\" or just \"ham and cheese melt\".",
                    "score": 12,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But doesn't it effectively describe the sauce being used? \n\nIt's a raw egg and cheese based sauce on pasta and warmed using residual carryover heat, describing it as a carbonara doesn't seem like much of a stretch at all to me.",
                                    "score": 0,
                                    "author": "fury420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He's making a sauce by mixing raw egg yolk, parmesan and pasta water, and tossing with hot pasta to incorporate into a sauce as the yolks and cheese warm up from residual heat, just as you do with a carbonara sauce. \n\nThis may not be an authentic carbonara sauce, but claiming it's akin to a raw egg on captain crunch is laughable.",
                                                    "score": 1,
                                                    "author": "fury420"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; You can't call a grilled ham and cheese sandwich a \"cheese melt\"\n\nYou can't? Since when? The debate here is that some people believe that a \"grilled cheese sandwich\" can only be made out of bread and cheese toasted in a pan with butter/mayo/oil/whatever fat you like. Those people think that adding anything else to that combo turns it into a \"melt\".\n\nI will grant that both arguments are silly, but I would submit that \"carbonara\" has a more specific meaning than \"grilled cheese\" does. \n\nI guess my question to you would be, is this still a carbonara if you didn't add the eggs? You could easily make a very similar sauce without egg in this. Why isn't this just Corned Beef and Pumpkin Penne?",
                            "score": 3,
                            "author": "Supper_Champion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because it has a similar sauce to carbonara.\n\nSo what you say is that I CAN'T call my recipe \"CORNED BEEF Carbonara WITH Pumpkin\" but you can call a grilled cheese sandwich WITH HAM in it just a cheese melt?",
                                    "score": 9,
                                    "author": "Jamesconnect",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dude, you can call your recipe whatever you want. I just don't think you'll get many people to agree that \"carbonara\" includes corned beef, pumpkin and gorgonzola. Simply including eggs in the recipe doesn't make it a carbonara, does it? If that's your rationale, you could also call this a \"Corned Beef and Pumpkin Cheesecake with Penne\". Cheesecake has both cheese and eggs in it, so if what we call a dish doesn't really mean anything, then you can call it anything.\n\nI wouldn't call a sandwich with ham and cheese heated on a griddle a \"cheese melt\". At the same time, I don't think that's wrong, *per se*,  it's just not very descriptive. But then again, if you offered someone a \"cheese melt\" and then put ham in it, they might be upset because they don't eat pork. \n\nPersonally, I would call melted cheese with ham inside bread sandwich a Grilled Ham and Cheese. Or, if I was feeling spicy, I might say \"Ham and Cheese Melt\". \n\nIt's okay to use the techniques and change up ingredients, but when you call it by a classic and well known name, people *expect* something. And in a carbonara, no one expects pumpkin, corned beef or the Spanish Inquisition.",
                                            "score": 8,
                                            "author": "Supper_Champion",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I would expect a corned beef carbonara with pumpkin to contain both pumpkin and corned beef in a carbonara sauce on pasta, although I certainly wouldn't expect *gorgonzola*.",
                                                    "score": 5,
                                                    "author": "fury420",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; although I certainly wouldn't expect gorgonzola.\n\nExactly my point. I've never heard of carbonara being made with gorgonzola. If the only thing that makes the sauce a \"carbonara\" is the eggs - since it doesn't contain a hard cheese or pepper - is it a carbonara sauce? \n\nLike you can't give someone a piece of roasted chicken in a bun with a some hot sauce and call it a Nashville Hot Chicken sandwich.  It might have all the same elements, but it's not the same sandwich.",
                                                            "score": 1,
                                                            "author": "Supper_Champion",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It does contain a hard cheese, he's finely grating a block of parmesan into the egg mixture at one point. \n\nIt's not just the presence of egg, it's the sauce is being made from raw egg yolks and hard cheese and pasta water that are added to hot pasta and warmed using residual carryover heat, to me the technique seems a crucial part of what makes it a carbonara sauce.",
                                                                    "score": 4,
                                                                    "author": "fury420",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ah yes, I missed that on my watch through.\n\nI don't disagree with you other point, but I do feel like you need combine technique + ingredients to get something of a specific name. \n\nAgain, if you can do eggs, cheese, pasta water as the sauce base, plus any other ingredients you want, when does it stop being carbonara? Can I add tomato, chicken and white beans and still call it a carbonara? Like I keep saying, names and words have to *mean* something. \n\nEither carbonara is a broad category of pasta sauces that incorporate cheese, egg and pasta water, or it's a dish. If it's both, then I think we just run into this problem of always having to qualify if a dish is \"traditional\" or \"authentic\". If we just say that Carbonara is a pasta dish of guanciale/pancetta, egg, cheese, pasta water and pepper then other dishes can be \"Penne with .... \".\n\nI don't really have a horse in this race, I was more just interested in a food discussion. I'm fine if people call this gif recipe carbonara and I'm fine if it's called soemthing else.",
                                                                            "score": 2,
                                                                            "author": "Supper_Champion",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I hear you, I just think that carbonara at it's core is the sauce of emulsified egg yolk + hard cheese + pasta water along with the technique of gently warming on the pasta with residual heat, just as this recipe does. There's also pancetta in there somewhere. \n\nCalling this a gorgonzola carbonara sauce might be the ideal route, since it's a flavorful departure from the cheeses typically used?",
                                                                                    "score": 1,
                                                                                    "author": "fury420"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think this dude got ripped and just made-do with what he had? There’s no other reasonable explanation. Its like a Chopped basket. I’d give it a shot, but what the hell is this??",
            "score": 5,
            "author": "littlemisspringfield"
        },
        {
            "level": 0,
            "comment": "The Pope’s Exorcist",
            "score": 2,
            "author": "DJHickman"
        },
        {
            "level": 0,
            "comment": "at least only egg yolk please",
            "score": 2,
            "author": "Sweet-Industry-9417"
        },
        {
            "level": 0,
            "comment": "Somebody woke up and chose violence today.",
            "score": 2,
            "author": "sharkbait_88"
        },
        {
            "level": 0,
            "comment": "This is the “Philly Cheesesteak” of carbonara",
            "score": 2,
            "author": "fart-nomster"
        },
        {
            "level": 0,
            "comment": "Why is this only for weekdays?",
            "score": 5,
            "author": "albert_r_broccoli2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not necessarily for weekdays only. But because it's really easy and fast to make, it works well when you need to put a meal on the table fast. So perfect for days when you don't have much time",
                    "score": 2,
                    "author": "Jamesconnect"
                },
                {
                    "level": 1,
                    "comment": "Carbonara in general is a weekday food. There's plenty of Italian dishes that take a while to make but carbonara (even this version) only takes a little longer than it takes a pot to boil. Great for lunch breaks or busy night dinners",
                    "score": 1,
                    "author": "Tayl100",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why can't you make it on a weekend though?",
                            "score": -1,
                            "author": "albert_r_broccoli2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You....can? It's called a \"weekday meal\" to describe that it's quick and easy to do, ideal for a working person on the weekday. You can cook it whenever. It's food, do whatever you want.",
                                    "score": 2,
                                    "author": "Tayl100",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can you make it as a snack, or does it have to be a meal?",
                                            "score": 1,
                                            "author": "albert_r_broccoli2"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So this sounded so good from the title, but now I have so many questions.\n\nWhy a ground corned beef? I was looking forward to seeing shredded corned beef cooking down with the pancetta.\n\nI've not cooked with pumpkin before, but it seems like it would take a lot longer for it to cook than the garlic to burn. Did you pre boil it to soften it? Usually garlic is added with only thirty seconds to go.\n\nDoes the gorgonzola not clash with the other powerful flavors like the corned beef and the curry? And bold move to not temper the egg and cheese mix with pasta water before adding it to the dish. I would end up with cheesy scrambled eggs.",
            "score": 4,
            "author": "ICWhatsNUrP"
        },
        {
            "level": 0,
            "comment": "What in the student have I just witnessed?",
            "score": 2,
            "author": "shadyjudgement"
        },
        {
            "level": 0,
            "comment": "Carbonara with penne noodles?",
            "score": 2,
            "author": "chef_bert",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol that’s the one thing you have issue with here?",
                    "score": 2,
                    "author": "joptocopter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "0 chance that pumpkin is cooked enough",
            "score": 2,
            "author": "StickmanAdmin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depends what cooked enough means to you. If you want a mushy pumpkin, no. It's not gonna be cooked enough.",
                    "score": 3,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's how I like it, but I could boil it with the pasta then fry it",
                            "score": 1,
                            "author": "StickmanAdmin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I guess that would work, adding it to the pasta. At least you don't need another pot just to boil some pumpkin.\n\nHowever, I don't think you would want to add the pumpkin at the same time you add the pasta. It would probably just get too cooked and once added to pan pan may break up.\n\nBut then again, these are all preferences.\n\nJust to let you know, the corned beef and also parmesan make this dish rather salty. So don't add any salt at any point, even for the pasta, use just a pinch of salt.\n\nOr if you want to minimize the saltiness, try using a less salty corned beef.",
                                    "score": 3,
                                    "author": "Jamesconnect",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good tips!",
                                            "score": 2,
                                            "author": "StickmanAdmin"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like to try new things, and if they're good, I'll be uploading a video. You are free to try it. But don't say it's a monstrosity purely based on, well, jus watching this video.\n\nWho ever thought peanut butter jelly would have been so good?",
                    "score": 7,
                    "author": "Jamesconnect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is some of your finest work. Genuinely will be making this tomorrow. Sans gorgonzola because despite the fact I adore it there are people in this house that don't like blue cheese. I'll probably use some of the nicer cheddar I have.",
            "score": -2,
            "author": "logosloki"
        },
        {
            "level": 0,
            "comment": "Yesssss die mad pasta purists",
            "score": -4,
            "author": "jdgamester"
        },
        {
            "level": 0,
            "comment": "Pumpkin?",
            "score": 1,
            "author": "pleeble123"
        },
        {
            "level": 0,
            "comment": "I don't think I've ever been that stoned where I came up with recipes like this lol. Bravo!",
            "score": 1,
            "author": "SeekersWorkAccount"
        },
        {
            "level": 0,
            "comment": "This has to be one of the oddest recipes I’ve seen in here but I’m intrigued nonetheless.",
            "score": 1,
            "author": "cromstantinople"
        },
        {
            "level": 0,
            "comment": "Curry powder!? Why TF not ......",
            "score": 1,
            "author": "TwoUp22"
        },
        {
            "level": 0,
            "comment": "Bit busy, innit?",
            "score": 1,
            "author": "mnyfrsh"
        },
        {
            "level": 0,
            "comment": "Hell, throw some saurkraut and ranch in there too, call it a Carubenara.",
            "score": 1,
            "author": "ennuinerdog"
        },
        {
            "level": 0,
            "comment": "I stopped at gorgonzola.",
            "score": 1,
            "author": "Yog_Sothtoth"
        },
        {
            "level": 0,
            "comment": "Everybody in this thread arguing about carbonara, but im just sitting here in the corner eating my lasagna with my hands because im the only one of yall who realizes that lasagna is a type of cheeseburger.",
            "score": 1,
            "author": "WanderingGenesis"
        },
        {
            "level": 0,
            "comment": "So far this recipe seems like a 50 - 50. Upvote score just keeps going 5 points up and 5 points down. \n\nJust decide and send it some direction so we can have a winner between die hard carbonarians, and those who just love a good meal irrelevant of the name.",
            "score": -7,
            "author": "Jamesconnect",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tbh you don’t have to be a diehard carbonara fan to find this recipe unappealing. Seems like the ingredients do not complement each other at all.",
                    "score": 16,
                    "author": "razorl4f",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t give a single fuck about authenticity or tradition or what you choose to call your dish, but this dish just sounds… unappealing, as you said. \n\nThat said, I’ll try anything once. You never know when you might be surprised.",
                            "score": 7,
                            "author": "joptocopter"
                        },
                        {
                            "level": 2,
                            "comment": "You said it right, \"Seems Like\". To be honest, when I first decided to throw gorgonzola in a previous similar dish, it just didn't seem right, but I thought, what is the worst that could happen? That blue cheese really enhanced the flavor. At least both myself and girlfriend liked it.\n\nI went so far to write the recipe on my website.",
                            "score": 5,
                            "author": "Jamesconnect"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bet this actually taste pretty good.",
            "score": -1,
            "author": "tothemax44",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is. But depending on what corned beef you use, it is rather salty. Don't add any salt, at any time. Even for the pasta water, only add a small of salt.",
                    "score": 2,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea that makes sense. Thanks for the recipe.",
                            "score": 2,
                            "author": "tothemax44"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To quote Gino D'Acampo - \"If my grandmother had wheels, she would've been a bike\" \n\nThis is not a carbonara lmao",
            "score": -1,
            "author": "Exisential_Crisis",
            "replies": [
                {
                    "level": 1,
                    "comment": "This dish is named \"Pasta Corned Beef Carbonara with Pumpkin\". So, as the name suggests, it is far from an authentic carbonara.",
                    "score": 6,
                    "author": "Jamesconnect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why even have it named carbonara then.",
                            "score": -1,
                            "author": "Exisential_Crisis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because, it works and also people can sort of expect what the thing is.",
                                    "score": 4,
                                    "author": "Jamesconnect"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If my grandmother had wheels she’d be a bike",
            "score": -1,
            "author": "bidoublef"
        },
        {
            "level": 0,
            "comment": "What's with this sub and just posting the most cursed shit ever.",
            "score": 1,
            "author": "MassRedemption"
        },
        {
            "level": 0,
            "comment": "iT's NoT cArBoNaRa!!!",
            "score": 1,
            "author": "Tralan"
        }
    ]
}