{
    "id": "13fjjbw",
    "score": 1052,
    "title": "Sticky Miso Tofu, extra saucy and packed with protein and umami-rich flavor",
    "author": "lnfinity",
    "date": 1683893905.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/13fjjbw",
    "media_urls": [
        "https://i.imgur.com/MF5zwNq.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Please post your recipe comment in reply to me, all other replies will be removed. Posts without recipes may be removed. Don't forget to flair your post!\n\n##**Recipe Comment is under this comment, click to expand**\n\n##**↓****↓****↓**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GifRecipes) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "\"we're gonna season this soybean [tofu] with some soybean [miso], and some soybean [tamari].\"\n\nthis looks tasty :) how long do you press before you can tear the tofu like that ?",
            "score": 13,
            "author": "ImaginaryCheetah"
        },
        {
            "level": 0,
            "comment": "Potential first time tofu buyer, what should I look for/be aware of with regards to tofu? Certain styles, textures, types? Looking to utilize it in similar ways to this video, mainly fried/baked.",
            "score": 24,
            "author": "Graybealz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Independent of this recipe, my go-to is medium firm tofu. I don't press mine out, but I do dry the outside so it browns better.  \nI pan fry my tofu over medium high heat for 7-10 mins per side (two sides) - enough to get a golden crust on it. This helps tremendously with the texture, as it's less mushy and has a bite to it. You don't want to be aggressive with the frying, just let it go for long enough until the browned parts have a crust. And don't move pieces until they have formed that crust, otherwise you'll have a mess.   \n\nA few recipes I like:  \nKorean [dubu-jorim](https://www.maangchi.com/recipe/dubu-jorim)  \nVarious chinese stir fried tofu recipes [in this video](https://www.youtube.com/watch?v=8vWIenK4p60). The last one is personally my favorite, but I also like the first with the spiced seasoning.    \n\nHonestly you could toss the tofu in whatever sauce or seasoning you want. The important part is to prep it properly.",
                    "score": 13,
                    "author": "Jemikwa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dubujorim is so good. I recently made Korean celebrity chef Paik Jongwon’s [recipe](https://youtu.be/Eino3yP-Wk0) (substituting fish sauce for the jeotgal and stock for the water) and it was 100% worth the absolute destruction it wreaked on my Tupperware.",
                            "score": 5,
                            "author": "lowelled"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I prefer extra firm for recipes like this that involve baking or pan frying. You may want to buy a cheap tofu press to get the water out quickly and easily. If you want to work tofu into any desserts, silken can be used for things like puddings and  mousses!",
                    "score": 11,
                    "author": "SozuRogberry"
                },
                {
                    "level": 1,
                    "comment": "I agree generally with the other comments here--look for medium firm or firm, avoid soft or silken (N.B.: those are two different things!) The only point where I differ is that I think pressing tofu is silly. I haven't found it to make much difference, and most Chinese don't do it. Nor does one need a coating of starch for frying--just a little patience, as the comment above suggests.",
                    "score": 6,
                    "author": "CuChulainn314"
                },
                {
                    "level": 1,
                    "comment": "You want extra firm tofu, it crisps better if you press it and get excess moisture out too",
                    "score": 19,
                    "author": "PailBait"
                }
            ]
        },
        {
            "level": 0,
            "comment": "### Ingredients\n\n**Tofu**\n\n*   1, ~400g block extra firm tofu, pressed and drained\n*   1 1/2 tbsp avocado oil\n*   1 tbsp tamari\n*   1 tbsp cornstarch\n*   1 tbsp nutritional yeast or 1 extra tbsp cornstarch\n*   1/4 tsp white pepper\n*   1/4 tsp Chinese five spice, optional\n\n**Sauce**\n\n*   2 tsp yellow miso paste\n*   2 tbsp light brown sugar or coconut sugar\n*   2 tbsp tamari or coconut aminos\n*   2 tbsp mirin\n*   1/4 cup water\n*   2 tsp cornstarch\n*   2 tsp avocado oil for cooking\n*   2 scallions, thinly sliced with white and green portions separated\n*   2 cloves garlic, thinly sliced\n*   1 tsp ginger, grated\n*   1 Fresno chili pepper or jalapeno pepper, thinly sliced\n\n### Instructions\n\n1.  Preheat oven to 425F. Take your pressed tofu and tear it into 1 inch chunks with your hands into a large bowl. Drizzle with the tamari and avocado oil, then evenly sprinkle the cornstarch, nutritional yeast, white pepper and five spice over top. Toss the tofu to evenly coat.\n    \n2.  Spread the tofu in an even layer on a baking tray and place in the oven to bake for 30 minutes, flipping halfway.\n    \n3.  Meanwhile, in a measuring cup add the miso paste, sugar, tamari, and mirin. With a spoon lightly mash the mixture together. Add the water and vigorously whisk together until smooth. In a separate small bowl combine the cornstarch with 2 tbsp of water, whisking well until smooth.\n    \n4.  Heat up a skillet with cooking oil over medium heat. Once the oil is hot, add the white portion of the scallions, garlic, ginger and the chilies and sauté until fragrant.\n    \n5.  Pour the miso sauce into the pan and stir well into the aromatics until it starts to simmer. Pour in the cornstarch, turn the heat low then continue to stir for about 5 mins or until the sauce begins to thicken to your liking.\n    \n6.  Stir in the tofu and coat with the sauce. Serve garnished with remaining scallions and enjoy as desired.\n    \n\n[Source](https://www.instagram.com/reel/CsABQPapIVU/)",
            "score": 45,
            "author": "lnfinity",
            "replies": [
                {
                    "level": 1,
                    "comment": "How many people does this serve?",
                    "score": 14,
                    "author": "elinchgo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just estimating based on similar recipes I've made, 2 servings if you serve it with something like roasted broccoli and white rice as in the video",
                            "score": 21,
                            "author": "RowRunRepeat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "TY.",
                                    "score": 2,
                                    "author": "elinchgo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Depends on if this is the centerpiece of the meal or a side dish.\n\nLabeled serving size for extra firm tofu is often 85g / 3oz  for 14-15g of protein so that'd work out to 4 servings but could easily be split in half if this is the focal point of the meal.",
                            "score": 2,
                            "author": "fury420"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I still don't know where the heat to heat the pan comes from....",
            "score": 3,
            "author": "elferrydavid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably a hot plate, a lot of people who make food content seem to use them since they're so portable.",
                    "score": 6,
                    "author": "greensleeves97"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm relatively new to tofu and have only pan fried it so far. How does the texture and taste of baked tofu compare?",
            "score": 2,
            "author": "IKissedAGirlOnce",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've only naked tofu a few times but it's more meat like.  More so if you freeze the tofu",
                    "score": 3,
                    "author": "discovigilantes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That random block of tofu I haven’t used is calling my name",
            "score": 2,
            "author": "lakija"
        },
        {
            "level": 0,
            "comment": "Looks very nice, will probably try one day.",
            "score": 2,
            "author": "MrRzepa2"
        },
        {
            "level": 0,
            "comment": "This looks really good, apart from the tofu. I might try this with some chicken",
            "score": -8,
            "author": "nix-xon"
        },
        {
            "level": 0,
            "comment": "What can I substitute for the hot peppers, I don’t really eat spicy food.",
            "score": 1,
            "author": "ohver9k",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably sweet peppers would be good. They have similar flavors (a little sweeter, obviously) as fresh chile peppers but no heat at all.",
                    "score": 2,
                    "author": "electric_yeti"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m gonna replace the tofu with chicken",
            "score": -4,
            "author": "Funny--Bunny"
        },
        {
            "level": 0,
            "comment": "Unrelated but please get rid of that glass cutting board. You will absolutely wreck the edges of your knives with that. \n\nRecipe looks great though",
            "score": 1,
            "author": "TheDini81"
        },
        {
            "level": 0,
            "comment": "This is more difficult to say than Arnold Palmer.",
            "score": -29,
            "author": "RealStumbleweed",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am sure that this meant something in your head, but I have no idea what that's supposed to mean",
                    "score": 14,
                    "author": "nix-xon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot of people have trouble pronouncing that",
                            "score": -5,
                            "author": "RealStumbleweed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What, miso tofu?",
                                    "score": 2,
                                    "author": "MillennialScientist"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s not?  The recipe says miso tofu…",
                    "score": 7,
                    "author": "dynobadger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Uncle Roger gonna put his leg down from chair for you tearing the tofu apart",
            "score": -5,
            "author": "OG_Alleszocker"
        }
    ]
}