{
    "id": "13jdlx3",
    "score": 79,
    "title": "Woo Can Cook | Chicken Chow Mein",
    "author": "WooCanCook",
    "date": 1684262842.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/13jdlx3",
    "media_urls": [
        "https://imgur.com/gallery/oezg5kJ"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Please post your recipe comment in reply to me, all other replies will be removed. Posts without recipes may be removed. Don't forget to flair your post!\n\n##**Recipe Comment is under this comment, click to expand**\n\n##**↓****↓****↓**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GifRecipes) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Cooking barefoot. You live dangerously sir. Love your videos",
            "score": 4,
            "author": "mcqtimes411",
            "replies": [
                {
                    "level": 1,
                    "comment": "hahaha yes!",
                    "score": 1,
                    "author": "WooCanCook"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hello! Hi everyone, Wesley here. Today we’re diving back into our series dedicated to classic Americanized Chinese cuisine with a look at the Chow Mein noodles from Panda Express. For those new to the channel, in this series, we have been deconstructing classic dishes from Americanized chinese cuisine (not unlike the plethora of dishes from the Panda Express menu), then seeing what they might look like when reconstructed through the lens of more traditional wok cooking. \n\nIn more recent memory, this has tended to be really interesting to break down dishes like General Chicken or Bejing Beef, where the dish has no real foundation in Chinese cuisine (and instead really just originates from American cuisine), because frequently, we end up with wildly unique results. For our Chow Mein today however, obviously this dish has roots all throughout chinese cuisine, meaning that we are for the most part going to be taking a look at what makes Panda Express’ chow mein unique (and make no mistake, it definitely is unique) before we construct our own attempt at the dish. Hope you try it. [**Follow the full video on youtube**](https://youtu.be/m21bJSX0VNw) for the whole story too!\n\n**Woo Can Cook** is a series where we reproduce fun foods and recipes from my childhood. Some of them are authentically Chinese and/or pan-Asian, but a lot of them are odd Americanized versions that I inherited from my parents and grandparents while growing up in the Bay Area/California.\n\n**Homebase** (Recipes, Livestream Schedule, Music and more): [Woo Can Cook](https://WooCanCook.com)\n\n**Recipes**: [Woo Can Cook (Youtube)](https://youtube.com/woocancook?sub_confirmation=1)\n\n**Music**: [Woo Cooks Beats (Lofi Beats to Cook to)](https://www.youtube.com/watch?v=DanL8H7ZKng&amp;list=PL72dM3fKnbHupDC0cIOHxaHBvjZLY3TdT&amp;index=6)\n\n**Woo Can Cook Fried Rice Pop Up (Every Thurs-Sun @ Wondrous Brewing!)**: https://WooCanCook.com/eats\n\n**TikTok** (short recipes and Woo Cooks Beats): [Woo Can Cook](https://www.tiktok.com/@woocancook)\n\n**Instagram** (pop-up schedule, music, and random Taki cameos): [@woocancook](https://instagram.com/WooCanCook)\n\n**RECIPE**\nhttps://woocancook.com/panda-express-chow-mein\n\n\n**INGREDIENTS**\n- 4 cloves garlic\n- 1 inch (about 1 tbsp) ginger\n- 4 oz baby bok choy\n- 3 medium chicken thighs\n- 16 oz lo mein\n- 4 oz bean sprouts\n- dried onion crisps (optional)\n- peanut oil\n\n**INGREDIENTS (chicken marinade)**\n- 4 tbsp low sodium soy sauce (or 2 tbsp full sodium soy sauce)\n- 1/2 tsp white pepper\n- 1/2 tsp corn starch\n\n**INGREDIENTS (sauce)**\n- 4 tbsp low sodium soy sauce (or 2 tbsp full sodium soy sauce)\n- 1 tbsp black vinegar\n- 1 tbsp oyster sauce\n- 2 tbsp shaoxing wine\n- 1 tbsp doubanjiang\n- 2 tbsp chili crisp oil\n\n**INGREDIENTS (noodle marinade)**\n- 1 tbsp dark soy sauce\n- 2 tbsp sesame oil\n\n**PREP**\n- CRUSH and mince the garlic, set aside\n- FINE MINCE the ginger, set aside\n- SLICE the bok choy into quarters, set aside\n- LARGE DICE the chicken thigh, then combine with all chicken marinade ingredients and set aside\n- PARCOOK the lo mein to package instructions, then combine off heat with noodle marinade ingredients and set aside\n- COMBINE all sauce ingredients, set aside\n\n**ON THE STOVE**\n- HEAT a wok as hot as possible, then add 4 tbsp peanut oil and long yao\n- ADD the noodles and saute for 3-4 minutes until crispy, then remove, reheat the wok, add an additional 2 tbsp peanut oil and long yao\n- ADD the chicken thigh, sear for 2 minutes undisturbed, then toss for wok hei\n- SHIFT the chicken to one side, then add the garlic and ginger to the wok surface and bloom until fragrant for about 15 seconds\n- ADD the bok choy to the wok and saute for 2-3 minutes\n- ADD the noodles and bean sprouts back to the wok and toss to combine\n- ADD the sauce mixture 1/4 cup at a time and season to taste\n- FINISH optionally with dried onion crisps",
            "score": 6,
            "author": "WooCanCook"
        },
        {
            "level": 0,
            "comment": "This looks fantastic!",
            "score": 3,
            "author": "BushyEyes"
        }
    ]
}