{
    "id": "6m908n",
    "score": 22448,
    "title": "Healthy and Hearty Black Bean Soup",
    "author": "speedylee",
    "date": 1499624470.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/6m908n",
    "media_urls": [
        "http://i.imgur.com/TLdgLRR.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "All I can see is that little bit of red pepper that didn't make it into the pot",
            "score": 1213,
            "author": "NoSirYesSir",
            "replies": [
                {
                    "level": 1,
                    "comment": "You didn't see the blender full of diarrhea pop out two wet farts, then?",
                    "score": 1566,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks to mobile reddit, I just had a r/mildlysatisfying moment where I read your comment at the same time I was actively popping two wet farts of my own. So thank you for your comment. \n\nEDIT: Corrected broken subreddit link",
                            "score": 290,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Deleted so no one knows I have wet farts\"",
                                    "score": 109,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't know who you are since you deleted your account, but I want you know that while reading your comment I popped two farts and laughed before immediately starting to worry, but then I farted a third time so everything is okay.",
                                    "score": 39,
                                    "author": "Twitch_Half",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ahahaha thanks for this haha",
                            "score": 12,
                            "author": "LegendaryWarriorPoet",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "*pluh pluh*",
                            "score": 7,
                            "author": "tirwander"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And the fact there was that one piece of onion that stayed on the chopping board? It's all I could think about. ",
                    "score": 122,
                    "author": "FindingAlaska",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is why I love reddit sometimes. After watching I thought to myself \"I bet somebody else was pissed off about that one little piece of onion that never made it into the soup even though it was on the very edge of the cutting board and could've easily been dropped in either with the knife or his hand.\" ",
                            "score": 73,
                            "author": "JRockPSU",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "...and the fact that he/she didn't use a spatula to squeegie-out the remains in the blender. &lt;sheds single tear&gt;",
                                    "score": 49,
                                    "author": "Ceilibeag",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was more distracted by them constantly scraping the 'sharp' side of their knife across the chopping board.",
                    "score": 44,
                    "author": "TurquoiseLuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I never knew that was what the other side of the knife was for :o",
                                            "score": 4,
                                            "author": "Imindless"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know, it was bugging me the entire time it was there.",
                    "score": 39,
                    "author": "DKman00",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whoa. I've never tried topping a soup with avocado, white cheese and cilantro, but I love these things, and this recipe looks super tasty. Must give this a try!",
            "score": 1183,
            "author": "giant_squid",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's usually how I top my chilli. I also like a little dollop of sour cream and diced onion. \n\nI need to not be in this sub when I'm hungry.",
                    "score": 383,
                    "author": "DoctorFlimFlam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Avocado on chili is amazing. Anyone who has not tried this needs to. Brings chili to a whole new level.",
                            "score": 102,
                            "author": "Fishyfishy220",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty much any soup can be topped with avocado. It's heavenly. Protip: keep a little bowl of avocado chunks near the soup and feed them in as you eat so they don't get soggy. ",
                    "score": 64,
                    "author": "Nevermind04",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like to do that but with thinly sliced raddishes. It adds a nice cool factor to good hot soup",
                            "score": 37,
                            "author": "classy_stegasaurus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Try dunking in tortilla chips covered in sour cream",
                                    "score": 12,
                                    "author": "CaptainJackKevorkian",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Woah. Woah. Woah. I have got to try this. ",
                                            "score": 6,
                                            "author": "ruca316",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This guy soups",
                            "score": 15,
                            "author": "Ingloriousfiction"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Black bean soup and vegetarian chili are basically the same thing. Anything that compliments chili will work with black bean soup",
                    "score": 27,
                    "author": "bandhani"
                },
                {
                    "level": 1,
                    "comment": "Try the same toppings on chicken tortilla soup. Nom. ",
                    "score": 51,
                    "author": "JeanLucTheCat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't forget the lime!",
                            "score": 25,
                            "author": "electricpuzzle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The trick is finding an avocado that's ripe enough to taste good and firm enough to cube. ",
                    "score": 23,
                    "author": "HandsandPans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In my experience that is like a 20 minute window between firm and gross, ripe and tasty, and absolute trash, when it comes to avocados.",
                            "score": 29,
                            "author": "KFBass",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same apart from the soap leaves",
                    "score": 139,
                    "author": "thegillenator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should try culantro. It tastes like how cilantro tastes to everyone who doesn't have the cilantro=soap gene. Hard to find, though.",
                            "score": 19,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought you were fucking around but [I'll be damned](https://en.wikipedia.org/wiki/Eryngium_foetidum).\n\n\n\n\n&gt;the common name culantro sometimes causes confusion with cilantro, a common name for the leaves of Coriandrum sativum (also in Apiaceae), of which culantro is said to taste like a stronger version.",
                                    "score": 16,
                                    "author": "staciarain",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm only upvoting you because I know there are people who legitimately taste soap when they eat eat cilantro instead of the light, buttery goodness that it can be, and for that I feel sorry on you.  So at least have an upvote. ",
                            "score": 105,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really like cilantro but does it actually taste buttery to you? I don't get that at all",
                                    "score": 144,
                                    "author": "Resentable",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It doesn't. It's a lemony flavor, I have NEVER heard of the buttery flavor before. Coriander seeds are from the same plant and you really get more of the citrus flavor with them. That's why cilantro is more often than not paired with lime or other things that use citrus undertones. ",
                                            "score": 33,
                                            "author": "kallen8277",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To me it just tastes cool and fresh. I've never heard it called buttery before either. Cilantro really seems to be something that everyone experiences differently though, so I'm not going to tell anybody they're wrong for describing it a certain way.",
                                                    "score": 26,
                                                    "author": "truthful_whitefoot"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 33,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Odd, ive never heard cilantro called lemon grass. usually people reserve that name for actual lemon grass.\n\nI generally think of cilantro as lemony, grapefruit, fruity, fresh cut grass kind of vibes. I'm very happy i do not have that mutation as I love cilantro. Not sure if it extends to coriander seed as well, but I love that too.",
                                                    "score": 71,
                                                    "author": "KFBass",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lemongrass is not an alternate name for cilantro.  Lemongrass is an entirely separate plant.  Also, cilantro does not taste buttery.  \n\nSomeone has been feeding you lies!!",
                                                    "score": 44,
                                                    "author": "ShineeChicken",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It tastes like soap to me but I really like the flavour. It's like... you know those cute bars of soap you really just wanna take a bite out of? It's like fulfilling that dream. ",
                                    "score": 15,
                                    "author": "Rooncake"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's very disappointing. To me cilantro tastes like I drank a cup of detergent it's so strong. There have been several times where it's ruined pho, salsa, several other foods, and, most recently, a shrimp chimichanga. I love the foods cilantro is in, but it's started to overpower everything. ",
                                    "score": 25,
                                    "author": "InvalidKitty",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Cilantro is the *real* devil's lettuce. ",
                                    "score": 10,
                                    "author": "NerdyBrando"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 422,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like your lime juice suggestion, I will finely chop half an onion and put it in a mix of lime juice, white vinegar and salt for a day or two. Then I sprinkle them on this soup with the toppings. I call them onion bombs and they are the BEST part.",
                    "score": 124,
                    "author": "floatingfoam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you know roughly how much of the lime juice, vinegar and salt you use? I really want to try this soon. ",
                            "score": 48,
                            "author": "JRockPSU",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "YOU are the only person in THIS thread to not include a fully capitalized word in their comment for emphasis. ",
                                    "score": 77,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "FUCK. ",
                                            "score": 72,
                                            "author": "JRockPSU",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sometimes, it's fuckin' WORTH scrolling down into the comments for gold like this.",
                                                    "score": 5,
                                                    "author": "michaltee"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I TOTALLY freestyle it. Usually, there are TWO limes, and a quarter to half cup of vinegar and a tablespoon of SALT. Sometimes I add garlic, or peppers or something else. The great thing IS you can use the onion bombs within hours if needed. They might be hotter, but they are still fantastic.",
                                    "score": 19,
                                    "author": "floatingfoam",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks! I'm totally going to do this next time I make big batch of CHILI. ",
                                            "score": 9,
                                            "author": "JRockPSU"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do you refrigerate this concoction? We need measurements!!",
                            "score": 10,
                            "author": "CalmBeneathCastles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. It lasts for days and gets better with each day. ",
                                    "score": 6,
                                    "author": "floatingfoam"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh I like the lime idea, I was thinking a dash of hot sauce would be good too. ",
                    "score": 10,
                    "author": "alphalightningbolt",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Healthy and Hearty Black Bean Soup](https://www.buzzfeed.com/jordankenna/healthy-hearty-black-bean-soup) by Tasty Vegetarian\n\n*Servings: 6*\n\n**INGREDIENTS**\n\n* 2 tablespoons olive oil\n* 1 onion, diced\n* 2 stalks celery, chopped\n* 1 carrot, chopped\n* 1 red bell pepper, diced\n* 4 cloves garlic, minced\n* 1 jalapeño pepper, seeded and diced\n* 1 teaspoon salt\n* 1 teaspoon pepper\n* 2 tablespoons cumin\n* 4 15-ounce cans of black beans, drained and rinsed\n* 4 cups of vegetable stock\n* 1 bay leaf\n* Avocado, chopped, to serve\n* Queso fresco, crumbled, to serve\n* Cilantro, chopped, to serve\n* Tortilla chips, crumbled, to serve\n\n**PREPARATION**\n\n1. Heat olive oil in a large stock-pot or dutch oven over medium-high heat until the oil begins to shimmer.\n\n2. Add onions, celery, carrot, and bell pepper. Cook for 4-5 minutes, stirring occasionally, until vegetables begin to soften.\n\n3. Add garlic, salt, and pepper, and continue to cook for an additional 10 minutes until vegetables are soft and the onions are translucent.\n\n4. Add cumin, black beans, vegetable stock, and the bay leaf. Bring to a boil then reduce to a simmer.\n\n5. Cover the pot and cook over low heat for 30 minutes until the beans are very tender.\n\n6. Remove the bay leaf. Transfer about 4 cups of the soup to a blender and puree until smooth, being careful not to splatter hot soup all over yourself and kitchen.\n\n7. Pour blended soup back into the pot and mix to incorporate.\n\n8. Keep over low heat until ready to serve. Garnish with fresh avocado, queso fresco, chopped cilantro, and tortilla chips.\n\n9. Enjoy!\n\nInspired by: http://cookieandkate.com/2016/spicy-vegan-black-bean-soup/ and http://newleafwellness.biz/2016/09/29/crockpot-vegetarian-black-bean-soup-panera-copycat/#_a5y_p=5819824",
            "score": 392,
            "author": "speedylee",
            "replies": [
                {
                    "level": 1,
                    "comment": "damn, blending half the soup to thicken the soup is genius, I would've never thought of this. I will definitely try this recipe this week, thanks!",
                    "score": 109,
                    "author": "Schootingstarr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really works! My mom has done that with her cheesy vegetable soup for years, and it's *perfect*.",
                            "score": 21,
                            "author": "coltsmetsfan614",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "WOAH... HOLD.DA.PHONE.  Cheesy Vegetable soup?!?  Recipe or you're a big, fat tease!",
                                    "score": 32,
                                    "author": "Ceilibeag",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't have the recipe saved... I'll have to get it from her when she gets back from vacation.\n\n-----\n\nEDIT: RECIPE!\n\n**CHEESY VEGETABLE SOUP**\n\nServings: 23 (3/4 cup = 1 serving)\n\n*Notes: My mom usually uses frozen/canned vegetables because they require less prep time, and she works. But, you could just as easily use fresh vegetables; they'll just need to cook longer. I will usually double the amount of garlic, black pepper and crushed red pepper that my mom uses, and I'll often add 1-2 tsp of cayenne powder as well. But that's just me. The recipe below is the way she makes it.*\n\n**INGREDIENTS**\n\n* 2 lbs. Birds Eye California Blend Frozen Vegetables (carrots, broccoli, cauliflower)\n* 3/4 cup onion, chopped\n* 2 tsp garlic, minced\n* 2 - 4.66 oz. tubs Knorr Homestyle Chicken Stock\n* 10 oz. 2% Milk Velveeta\n* 1 - 8 oz. can original cut green beans\n* 1 - 10 oz. can RO-TEL Original Diced Tomatoes &amp; Green Chilies\n* 3/4 tsp salt\n* 3/4 tsp black pepper\n* 1 Tbsp parsley, dried\n* 1/2 tsp crushed red pepper\n* Water\n\n**PREPARATION**\n\n1. Bring frozen vegetables and 4 cups of water to a boil in a large, uncovered soup pot.\n2. Once the water reaches a boil, turn the heat down and let it simmer for 25-30 minutes.\n3. Remove one-third of the vegetables from the pot and puree them in a blender before returning them to the pot. This helps thicken the soup and provides a smoother texture.\n4. Add chopped onion, minced garlic, chicken stock, Velveeta, salt, black pepper, parsley and crushed red pepper. You can substitute chicken bouillon cubes for the chicken stock, but you'll want to dissolve the cubes in water (1 cup per cube) before adding them to the pot.\n5. Add 2 more cups of water to prevent the soup from becoming too thick.\n6. Add canned green beans and tomatoes with chilies.\n7. Let everything simmer together for at least another 15-20 minutes before serving. The longer it simmers, the more the flavors will develop. If it needs more flavor, consider adding more stock or bouillon. (My mom said she doesn't usually have to do that, but she's done it before.)\n8. Enjoy! We often serve it with salad or rotisserie chicken, but it also can be a meal on its own.\n\n*More notes: You can always add more Velveeta for extra cheesiness. The soup keeps for at least a week in the fridge, and I'm sure it would freeze well (though I haven't tried). If you do Weight Watchers, this recipe works out to 1 SP per 3/4 cup serving.*",
                                            "score": 21,
                                            "author": "coltsmetsfan614",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ask her to make a gif. We're spoiled ",
                                                    "score": 7,
                                                    "author": "needed_an_account"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If you're sharing, could I have the recipe too? :)",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "On what planet is one bay leaf enough for a whole pot of soup",
                    "score": 159,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is Dimension C-43, so maybe you are lost?",
                            "score": 81,
                            "author": "Ord0c",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm usually cooking in earth dimension c-137 so that would make sense ",
                                    "score": 52,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Everyone knows the C-40's have very strong-tasting bay leaves",
                                            "score": 22,
                                            "author": "Dread-Ted",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sounds like my kind of dimension. I toured through the c-260s and their bay leaves had barely any flavor at all. However parsley in the c-260s is a whole different story",
                                                    "score": 15,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So, you're a cronenberg or what?",
                                            "score": 12,
                                            "author": "learn2die101",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Look cronenberg Morty, we'll fit right in here. ",
                                                    "score": 13,
                                                    "author": "TerrainIII"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Right? And a teaspoon of salt and pepper?",
                            "score": 16,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The veggie stock probably has a not insignificant amount of salt in it.",
                                    "score": 47,
                                    "author": "KlaatuBrute",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Veggie stock is salty, so are canned beans.",
                                    "score": 20,
                                    "author": "PlantyHamchuk"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "2 tablespoons is a shitload of cumin",
                    "score": 28,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 45,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Cumin disappears as you cook it, so I think this is a good amount.  I was happy to see it.",
                            "score": 20,
                            "author": "cluelesssquared"
                        },
                        {
                            "level": 2,
                            "comment": "I made a similar recipe for black bean soup the other month which was half this size. It also called for 2 tbsp. of cumin. God, that was far too much, lesson learned. ",
                            "score": 5,
                            "author": "Mitch_Mitcherson"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks super tasty.",
            "score": 232,
            "author": "Klokateer",
            "replies": [
                {
                    "level": 1,
                    "comment": "That said, i got gas just by looking at it. ",
                    "score": 190,
                    "author": "buriedinthyeyes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "reg or diesel? ",
                            "score": 113,
                            "author": "BoRamShote",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Premium",
                                    "score": 71,
                                    "author": "bioshockd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She needs Premium, dude! Premium!",
                                            "score": 38,
                                            "author": "DiaDeLosMuertos",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dude!",
                                                    "score": 11,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Easy there Snake",
                                                    "score": 7,
                                                    "author": "DroopyTrash"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you get gas from legumes, you should really work on diversifying your gut biome. Eat more fermented foods and more fiber and you should be able to digest this just fine. ",
                            "score": 65,
                            "author": "throwawaywahwahwah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "but then I wouldn't be able to sing the song",
                                    "score": 15,
                                    "author": "BooBailey808",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Can I ask why fermented foods?  Garlic and beans hit me hard and I'm not allowed to eat a lot of fiber due to gastroparesis. ",
                                    "score": 12,
                                    "author": "cncnorman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Legumes have a sugar that produces gas precisely because our bacteria is so efficient. The byproduct is gas because our large intestine is the place where the sugar finally gets eaten by the bacteria. You can have special bacteria break it down, (Like in Beano), which causes your body to absorb it earlier in the digestion process, but it spikes your blood sugar more. Has little to do with veganism I think. ",
                                            "score": 9,
                                            "author": "relationship_tom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Our bodies lack the enzyme to break down oligosacharrides, Beano is the enzyme alpha-galactosidase which helps us do so.",
                                                    "score": 3,
                                                    "author": "LurkLurkleton"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Fermented foods contain tons of great probiotics that can help the gut digest tougher things like fiber. Kimchi, kombucha, soy sauce, sauerkraut, yogurt, kefir, apple cider vinegar, miso, and tempeh are all great fermented foods to try out!",
                                            "score": 31,
                                            "author": "throwawaywahwahwah",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Does beer count too? A real question here!",
                                                    "score": 16,
                                                    "author": "starlightshower",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sour beers, lambics, wild ales etc... Lots of Lactobacillus, and Pediococcus in those. That should help.\n\nBut theyre also very expensive usually. So that kind of sucks.",
                                                            "score": 13,
                                                            "author": "KFBass",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You want things like lactobacillus, not saccharomyces.",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There are people who *don't* get gas from eating beans???",
                                    "score": 29,
                                    "author": "buriedinthyeyes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 52,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The best part about being vegan are my bowel movements. It's like an efficient soft serve dispenser with no clean up. ",
                                                    "score": 53,
                                                    "author": "Diz-Rittle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hell yeah. I go to take a shit for less amount of time than some people piss. ",
                                                            "score": 24,
                                                            "author": "Lackadaisical_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 21,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You three might have just convinced me to try a vegan diet for a bit just to see how big the difference is.\n\nI do love me efficient shits.",
                                                                            "score": 15,
                                                                            "author": "MexicanGolf",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 18,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Can confirm\n",
                                                    "score": 10,
                                                    "author": "hanzet",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mmmm I wanna dip some tortilla chips in this. If you blended the whole thing instead of half would it be solid enough for dip consistency?",
            "score": 189,
            "author": "JoeDelVek",
            "replies": [
                {
                    "level": 1,
                    "comment": "Place I used to go for Mexican food had a bean dip for chips similar to this. I think it'd be perfect as-is. The blended half should hold it together.",
                    "score": 104,
                    "author": "Dispari_Scuro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I usually sub black beans for one of the avocados in my guacamole. It's wonderful.  ",
                            "score": 29,
                            "author": "sinkwiththeship",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a good way to sneak in some protein. Do you mash them up with the avocados or leave them whole?",
                                    "score": 18,
                                    "author": "nattykat47",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If not I imagine you could just drain off the liquid before you blend the veggies, then add back however much you need to get a good consistency. ",
                    "score": 13,
                    "author": "YUNOtiger"
                },
                {
                    "level": 1,
                    "comment": "Even if you don't blend it all, it tends to thicken up after its been refrigeratorated and reheated.  Definitely works as a dip!",
                    "score": 8,
                    "author": "hornwalker"
                },
                {
                    "level": 1,
                    "comment": "I would imagine the different textures would still work as dip ",
                    "score": 4,
                    "author": "tacotuesday247",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Has anyone ever noticed a difference if they used a bay leaf or not? I've used a ridiculous amount and didn't notice a difference.",
            "score": 61,
            "author": "szlachta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe helpful - http://www.seriouseats.com/2014/03/ask-the-food-lab-whats-the-point-of-bay-leaves.html",
                    "score": 75,
                    "author": "speedylee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been advocating fresh herbs, but in this case, It's not the best idea. The Californian Bay is much more like Eucalyptus than the Turkish. Ruining a dish never got easier.",
                            "score": 17,
                            "author": "szlachta",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Heres a test for your bay leaves. Make two batches of white rice but use 1 bay leaf in one batch. Taste the difference ",
                    "score": 57,
                    "author": "tacotuesday247",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'll try that.  Rice soaks up flavors like a pro. Thanks for the tip.",
                            "score": 42,
                            "author": "szlachta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I rarely ever cook rice without a bayleaf anymore, it makes the rice so daggum good. ",
                                    "score": 15,
                                    "author": "alphalightningbolt",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bay provides depth of flavor; perhaps your bay leaves are old.",
                    "score": 28,
                    "author": "Meow_-_Meow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get it, but has anyone ever wondered. \"What's that taste.....?\" in regards to Bay? Use it or omit it, if you know what you're doing, its affect on the final outcome is minimal. Polish cooking uses bay leaf often, and if you omit if, no one ever notices.",
                            "score": 22,
                            "author": "szlachta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; its affect on the final outcome is minimal\n\nNot true - from personal experience. Parts of my family are from Eastern Europe. They use laurus nobilis in many dishes and it has a very distinct taste that will be noticed - even if you don't know that they used it. We certainly had guests asking what \"that taste is\". \n\nWe also did a few tests because I'm a nerd and love chemistry so we cooked dishes with and without bay leaf. Blind testing the food we were able to tell the difference.\n\n\nShelf life is roughly one year at room temperature and normal humidity levels - so maybe your supply doesn't taste that intensely because of wrong storage?\n\nPeople claim it is similar to oregano or thyme (the wiki states this as well), but you can taste a difference when doing a comparison as well. \n\nHowever, if certain other spices are used that are more intense this can impact the intensity, so that could be another reason why you don't notice it.",
                                    "score": 29,
                                    "author": "Ord0c",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I think this is probably the case. I got a bunch of Bay Leaves at the farmer's market a while ago and they definitely add something. ",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My secret is to omit the bay leaf and use a star anise pod instead.  It has a radically different flavor but serves the same purpose as the bay leaf.  You can absolutely taste the star anise, and I LOVE the flavor, especially in soups.",
                    "score": 10,
                    "author": "hattroubles",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 248,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "you're right homie",
                    "score": 44,
                    "author": "Boxingar"
                },
                {
                    "level": 1,
                    "comment": "It's a sweat, not a saute. You cook and soften the veg, but don't brown it. It's a common technique in soups/sauces/etc. \n\n",
                    "score": 55,
                    "author": "fixurgamebliz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So you mean cooking it at high heat for a while so things get nice and brown and caramelized then turning It down when you add the beans and stock? ",
                    "score": 26,
                    "author": "airboy1021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nice, thanks. I am trying to learn more about cooking cause first time out in the real world so just wanna make sure I start good habits. ",
                                    "score": 26,
                                    "author": "airboy1021",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also if you don't want everything else to be a mush, out of all the vegetables peppers should be in first for a few minutes, they take longer than onions for example.",
                                            "score": 12,
                                            "author": "Sergiotor9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "really? Ive always seen onions go in very first.  ",
                                                    "score": 13,
                                                    "author": "airboy1021"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Out of the vegetables... the carrots should be first right? They take far more time than peppers.",
                                                    "score": 6,
                                                    "author": "Aksama"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The trick is to slightly undercook the onions.",
                    "score": 35,
                    "author": "Ridingthestormfront",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's probably the best thing I do.",
                            "score": 10,
                            "author": "cferretti1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree. Throw the veggies, garlic, and oil into a cast iron pan for a bit first to kick this thing up a notch.",
                    "score": 25,
                    "author": "Nevermind04",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't forget a blast from your spice weasel,  BAM!",
                            "score": 131,
                            "author": "gboehme3412",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great, now I have to make this soup, then eat it while I binge futurama",
                                    "score": 10,
                                    "author": "BooBailey808",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But only seasons 7-10 😔",
                                            "score": 14,
                                            "author": "tacotuesday247",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "HERETIC!",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's all that's left on Netflix. ",
                                                            "score": 11,
                                                            "author": "moral_mercenary",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 20,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The one time I made black bean soup my brother bullied me about it for 6 months saying I was disgusting and not normal thank you reddit for letting my know I'm not crazy ",
            "score": 113,
            "author": "medeivalkings",
            "replies": [
                {
                    "level": 1,
                    "comment": "What does he prefer? Steak and fries?\n\nMore like the rest of us are crazy for wanting giant portions of meat with little to no vegetables. \n\nMmm. Meat.\n\nBut yeah, tons of people avoid veggies like the plague. ",
                    "score": 51,
                    "author": "DiaDeLosMuertos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I knew a guy who would rage at his family if he didn't get meat after getting home from work every day. So he would get his meat as often as possible, and they would eat something else because they didn't enjoy having meat every single day.\n\nI tell you, there are some crazy ppl out there.",
                            "score": 47,
                            "author": "Ord0c",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My dad is like this. Even when the rest of the family makes a meal without meat, he always has to make meat for himself and add it to his plate. At least he cooks it himself.",
                                    "score": 17,
                                    "author": "notsostandardtoaster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At least you're lucky enough to have him do that.\n\nMy dad is low-carb AND has to have meat with every meal. It's a pain in the ass.",
                                            "score": 6,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He eats two portions of meat at every meal ",
                            "score": 6,
                            "author": "medeivalkings"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 47,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd of probably just taken a potato masher and mashed some of the beans in the pot instead of dirtying a blender. ",
            "score": 50,
            "author": "MikeOrtiz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or use a hand blender. ",
                    "score": 40,
                    "author": "buriedinthyeyes"
                },
                {
                    "level": 1,
                    "comment": "Immersion blenders are a godsend for soups like this. Whiz until you get the consistency you like.",
                    "score": 32,
                    "author": "DrawDan"
                },
                {
                    "level": 1,
                    "comment": "*I'd've",
                    "score": 61,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love double contractions. I've even inserted them where I shouldn't've because they feel so efficient. ",
                            "score": 27,
                            "author": "TheOriginalDovahkiin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same. 'I would have' to 'I'd've' makes me a little hard. ",
                                    "score": 7,
                                    "author": "airboy1021",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Y'all'd've",
                                            "score": 24,
                                            "author": "Intrilaika",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*Shudders*\n\nOhh yeah baby, that's the good stuff. \n\n**contract for me**",
                                                    "score": 15,
                                                    "author": "airboy1021",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd probably add red pepper instead of cumin, and a bit of thyme as well, go with almost a cajun flair.\n\nDamn I love cajun food.",
            "score": 23,
            "author": "Atramontik",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was like \"Cool, cool, looks tasty\" and then I thought it was done after you simmered it.\nAnd then you BLENDED IT and then ADdED bACK IN\n\n10/10 Most exciting food video yet",
            "score": 9,
            "author": "nickfoose",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 73,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you had blended beans before? The texture is amazing imho. Now I can't sleep because I got hungry.",
                    "score": 65,
                    "author": "Ord0c",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah fuck it's 12:10AM and I'm starving, I'll probably do something similar tomorrow ",
                            "score": 8,
                            "author": "iVamboo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think It's to give it a creamier feel, and overall give it a more cohesive texture.",
                    "score": 97,
                    "author": "sarcasticallyserious",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I had the opposite thought.  At first, I was like, \"There's no way I'm eating beans in broth\", then after the blending I was all, \"Mmm, that's some creamy goodness.\"",
                    "score": 13,
                    "author": "numanoid"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yay, a vegetarian recipe! I love it!",
            "score": 71,
            "author": "Wishyouamerry",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not even a vegetarian and I love this recipe. Plus it looks super cheap to make, even in small quantities.",
                    "score": 27,
                    "author": "Nevermind04",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Buy your beans in bulk dried and it's even cheaper.",
                            "score": 9,
                            "author": "Mentle_Gen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Keep in mind if you do this you need to prepare the beans beforehand.\n\nNot that I've made that mistake or anything haha.  ",
                                    "score": 22,
                                    "author": "blitzbom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mmmmmmm crunchy",
                                            "score": 7,
                                            "author": "Mentle_Gen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For a non vegetarian option, I'll bet adding chicken to this would be amazing.",
            "score": 253,
            "author": "JakJakAttacks",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not vegetarian, but eating stuff like this every so often is perfectly fine by me. Not every dish has to have meat.",
                    "score": 589,
                    "author": "Dispari_Scuro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I started like this. Once you get away from the concept that every dish needs meat it's easy to discover a lot of amazing dishes. I feel like I've been really missing out by not incorporating more beans and lentils into my diet.\n\nThere's very few times where I actually crave a meat dish now. Veggies are just so much more flavorful, unique and filling.",
                            "score": 30,
                            "author": "jarret_g",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As it should be. It's a healthy and filling meal, and it's even vegan. :) \nEdit: w/o the cheese ofc",
                            "score": 144,
                            "author": "gulasch_hanuta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here's one I do regularly that I got in this sub.\n\nhttps://www.reddit.com/r/GifRecipes/comments/5ryu0k/onepot_enchilada_rice/\n\nGoes great on tortillas. I've made this one several times now.",
                                    "score": 32,
                                    "author": "Dispari_Scuro",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is there a way to make this without putting it in the oven? I dont have any pans meant for that :(",
                                            "score": 7,
                                            "author": "cuj46",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Even more, I find making soups/stews where meat isn't the main ingredient better off without meat unless it's specifically there to add flavor. Like what would really a few pieces of chicken really add that a proper stock doesn't? You've got so much wonderful food to enjoy and so many flavors already, enjoy it",
                            "score": 23,
                            "author": "AnsaTransa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or shredded pork. I like to cook dried black beans in pork stock left over from making a pulled pork...this would be a delicious way to use all those beans!",
                    "score": 33,
                    "author": "halfadash6"
                },
                {
                    "level": 1,
                    "comment": "An amazing addition is cooking with a smoked pork hock then shredding the meat into it. Adds an amazing smokey flavour.",
                    "score": 17,
                    "author": "tyrannosaurusjess"
                },
                {
                    "level": 1,
                    "comment": "I'd probably sub chicken stock but leave everything else the same. ",
                    "score": 14,
                    "author": "scoobyduped"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Tip: Use the *back* (spine) of your knives to scrape food off of cutting boards and trays; they'll remain sharper longer, and a sharp knife = safe knife.**\n\nSincerely, r/knives. ",
            "score": 39,
            "author": "devries",
            "replies": []
        },
        {
            "level": 0,
            "comment": "AAAAAAH STOP SCRAPING WITH THE SHARP EDGE OF THE KNIFE",
            "score": 15,
            "author": "StrongwalkerN7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it really that big of a deal? I would think knives get wayyy more abuse than this in commercial/professional kitchens and as long as you hit them with a steel fairly often they should  stay sharp?\n\nOr is it more about shaving some cutting board into the food? \n\nGenuinely curious as I've always done this. ",
                    "score": 6,
                    "author": "BikeNY89",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just wouldn't be the same without that bay leaf in there",
            "score": 6,
            "author": "whunersen"
        },
        {
            "level": 0,
            "comment": "&gt;Hearty\n\nLink's favorite kind of meal.",
            "score": 15,
            "author": "Ihatelordtuts",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Feel like this should have an NSFW tag for that moment when they turn off the blender...good looking soup though!",
            "score": 3,
            "author": "InvalidHyperlink",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I cannot stress this enough, I am seriously not trying to be a smart ass, but does that one lone bay leaf actually do anything or make a difference? ",
            "score": 6,
            "author": "just_zhis_guy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Made this tonight and it was excellent. Mine was soupier than yours. I simmered for another 30 minutes to reduce but it still wasn't as pretty as yours. Still damn tasty though. Thanks for sharing. ",
            "score": 6,
            "author": "AnesthesiaHood"
        },
        {
            "level": 0,
            "comment": "I feel like I would take that up to the point where you add jalapenos and mix it with rice because I'm too lazy",
            "score": 8,
            "author": "Isaiah_b",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Assuming that's a cast iron pot, how is he holding onto it?!",
            "score": 8,
            "author": "shalaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have one of these. It's a dutch oven made out of cast iron coated in ceramic. The handles don't really get that hot when you cook on an induction burner. All of the heat goes straight into the base.",
                    "score": 15,
                    "author": "AntDice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blended blackbean soup is probably the most unattractive looking food there is, it's tasty, but it really looks like Montezumas revenge....\n\nI'll try this one later :)",
            "score": 3,
            "author": "RaDeusSchool"
        },
        {
            "level": 0,
            "comment": "Instead of throwing away money on buying vegitable stock, use chicken stock bouillon cubes.  The cheap ones are just yeast extract, msg and salt so it's still vegetarian. ",
            "score": 4,
            "author": "newsagg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Careful - some of them will list chicken fat as an ingredient. Might as well get veggie stock cubes?",
                    "score": 7,
                    "author": "rp_Neo2000"
                },
                {
                    "level": 1,
                    "comment": "Or vegetable stock cubes...",
                    "score": 7,
                    "author": "atheista",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but they come in green foil and the chicken comes in yellow.",
                            "score": 6,
                            "author": "newsagg",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Vegetable stock is actually really easy to make too ;)",
                    "score": 5,
                    "author": "Blinknone",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Adding the dried spices to the oil is a great technique I learned from Indian cooking (tempering). It not only brings out the natural oils in cumin, but it intensifies your hot chili powders.\n\nAlso, a suggestion, kick up the soup right at the end when you serve it with an acid. I use lime juice, but orange juice can be nice.",
            "score": 5,
            "author": "medfordjared"
        },
        {
            "level": 0,
            "comment": "I remember one time I made this and forgot to put in the Bayleaf and I was like whoa wait a second what is this a bowl of water?",
            "score": 5,
            "author": "Moewron"
        },
        {
            "level": 0,
            "comment": "Finally a nice and simple recipe that looks good. These gems are why I subscribe. ",
            "score": 4,
            "author": "Inderoobinderoo"
        },
        {
            "level": 0,
            "comment": "I'm a horrible cook, but followed the instructions and this might have been the best thing I've ever made. I only put one tbps of cumin, was perfectly fine for me. It wasn't as thick as the gif, but also fine. Thanks for posting!",
            "score": 4,
            "author": "djamp42",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I personally think blending it makes it turn from soup to dip.",
            "score": 12,
            "author": "Cynistera",
            "replies": [
                {
                    "level": 1,
                    "comment": "You only blend a small portion in order to thicken up the entire soup. I do this w my chili and I win a lot of personal competitions w my siblings. ",
                    "score": 22,
                    "author": "oh_heeey_flip",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "New to cooking with a silly question. Does that little Bay leaf really change the dish? If you took it out, could anyone really tell?",
            "score": 3,
            "author": "jcw4455",
            "replies": [
                {
                    "level": 1,
                    "comment": "[yes](http://www.seriouseats.com/2014/03/ask-the-food-lab-whats-the-point-of-bay-leaves.html)",
                    "score": 4,
                    "author": "mk2vrdrvr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good God I'm making this bad boy tomorrow.",
            "score": 3,
            "author": "BullRoarerMcGee"
        }
    ]
}