{
    "id": "7utnac",
    "score": 47997,
    "title": "Crunchwrap Supreme Copycat",
    "author": "dumpemout",
    "date": 1517598363.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/7utnac",
    "media_urls": [
        "https://i.imgur.com/SqmxiZL.gifv"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yum! I generally drain the beef before seasoning so I don't throw away all that yummy spicy goodness though.",
            "score": 2390,
            "author": "Knitapeace",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm with you there... drain, then season. You can always add a little bit of water to the drained beef if you feel like the seasoning isn't mixing or dissolving as well as it should be.",
                    "score": 967,
                    "author": "dumpemout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 242,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For bonus points use beef broth instead of water and add a tablespoon of tomato paste. Cook it all down with the seasonings. ",
                                    "score": 532,
                                    "author": "Knitapeace",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is making me hungrier.",
                                            "score": 15,
                                            "author": "im-a-season",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 217,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It says beef, you illiterate cook! ",
                                                    "score": 129,
                                                    "author": "MasterYenSid",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I dig \"y'all'm'st\".",
                                                    "score": 20,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'd add 1 tablespoon at a time until you think it looks good.  It should thicken and coat the beef so you just add a tablespoon, let it cook down, and add more if it still looks dry.",
                                    "score": 65,
                                    "author": "Blindobb"
                                },
                                {
                                    "level": 3,
                                    "comment": "That doesn’t make you a bad cook! Just follow directions until you remember enough knowledge that you can do stuff yourself. Pretty much how everything works ever :)",
                                    "score": 30,
                                    "author": "ryanderson11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ain’t that the truth. When I first started cooking, I was like wtf do I do. Got some “5 ingredients or less” cookbooks and started working off of those. After a few months, those same recipes had 15 ingredients. ",
                                            "score": 9,
                                            "author": "resting_O_face"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "a splash.  I don't know if I would use more than a quarter cup for a lb. of ground beef.  Worst case scenario you would let it reduce until it got to where you'd want",
                                    "score": 6,
                                    "author": "Hoogabooga"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 48,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Huh, I think you changed my Hispanic food game...",
                                    "score": 24,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I like to put a jar of chunky salsa in my tex-mex ground beef tacos.",
                                    "score": 8,
                                    "author": "dirtyjoo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Smooth taco bell texture\". The phrase I needed to hear today, thank you.",
                                    "score": 8,
                                    "author": "gloopyboop",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So I was taught to cook the meat 80% of the way. Drain. Meat back in the pan. Heavily season. Toss 1/3rd of the drained off stuff in. Usually the fat cap and a little bit of liquid.\n\nSo you now have seasoned meat coated in fat. Let it warm and sizzle a bit then into the awaiting nachos or burrito. \n\nAnd if it's a burrito you keep a bit of the fat cap from the beef and toss it in a pan. Roll the tortilla tight and fry the shit out of the open end. Pressing it hard with the spatula. Flip and repeat.\n\nAbsolute perfection comes out of the pan. But all together you probably have a 1500cal burrito. Magnificent ",
                    "score": 434,
                    "author": "Rarus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s the best way to go. You can drain most of the fat so it’s not dripping out while you bite in, but still allows you to cook it and extract some fat for the spices to cling to. \n\nEdit: I would add water during that 80% part, particularly towards the end, since it breaks the meat up a bit more it seems. ",
                            "score": 63,
                            "author": "higherlogic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve found that using 90/10 beef and not draining at all is the best way for me. It’s more expensive but worth it for me. ",
                                    "score": 30,
                                    "author": "Anna_Banananana",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't drain, just add more spices.",
                    "score": 50,
                    "author": "Gian_Doe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are many paths to deliciousness, friend. Rock on with your beefy spicy self.",
                            "score": 71,
                            "author": "Knitapeace",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My man! I don't understand why anyone would get rid of all that delicious fat.",
                            "score": 8,
                            "author": "monkwren"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you can get your hands on some chorizo it's a whole new ballgame.",
                    "score": 22,
                    "author": "human_machine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "YES. \n\nFor the non-meat folks, there’s meatless chorizo at Trader Joe’s for $1.99. I serve it to omnivores all the time and have gotten them addicted as well. Great stuff. ",
                            "score": 25,
                            "author": "honkhonkbeepbeeep",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I make these pretty frequently and I have some things that I do differently that are good alternatives:\n\n\n* Instead of cutting a circle in the tortilla, cut it into quarters. That way you can use one tortilla shell for four crunchwraps. The quarter is still plenty big enough.\n* If you can't buy tostadas where you live (like me) round tortilla chips work just as well. I layer 5-6 instead of using a tostada and it's just as good.\n* Instead of oiling the pan, just use the same pan you used to cook the beef. It makes the outside tasty.\n* I put guacamole and corn salsa in mine and it's really good.",
            "score": 1864,
            "author": "speculates",
            "replies": [
                {
                    "level": 1,
                    "comment": "dang, we got a pro over here! I like the tortilla hack, I can't imagine cutting a hole out of a flour tortilla and then tossing it away.",
                    "score": 557,
                    "author": "dumpemout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, cutting a circle and wasting so much just doesn't make sense. Having a quarter is enough to cover it and more.",
                            "score": 150,
                            "author": "speculates"
                        },
                        {
                            "level": 2,
                            "comment": "Or you can cut the rest of the tortilla into strips and make bunuelo strips for dessert.",
                            "score": 36,
                            "author": "PhatDaddi"
                        },
                        {
                            "level": 2,
                            "comment": "pretty sure you just eat the rest.",
                            "score": 56,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, it can't be done, scientists are all in agreement",
                                    "score": 101,
                                    "author": "robotzor",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean....can’t you just use a smaller taco shell?",
                            "score": 9,
                            "author": "CompleteSuccess",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Make migas with the rest. It's better with corn tortillas, but it'll work.",
                            "score": 5,
                            "author": "Apmaddock"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Where do you live that you can't get tostadas? That makes me sad. :(\n\nEDIT: Living left coast most of my life, I had no idea tostadas were such a luxury. You poor bastards.",
                    "score": 117,
                    "author": "writergeek",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "North Korea.",
                            "score": 115,
                            "author": "appropriate-username",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your glorious leader sucks.",
                                    "score": 46,
                                    "author": "writergeek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 32,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "obligatory you're now a moderator of r/Pyongyang",
                                                    "score": 8,
                                                    "author": "a_very_sad_story",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Anywhere in the rural midwest. Your local convenience store in Bumfuck, Ohio is not stocking specialty Mexican items.",
                            "score": 11,
                            "author": "PhAnToM444",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "...never even occurred to me that tostadas isn't a thing everyone can buy. Like, even the big supermarkets have basic items but now I'm thinking that's just to cater to the huge Latino population. ",
                                    "score": 15,
                                    "author": "TrekMek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah seriously, I've lived in the Southwest for most of my life and never once considered that it's not normal for every grocery store to have the very basic ingredients needed to make a Mexican dish. It's just always been there. Tortillas next to the chips. Salsa with all the other dips. Hominy with the canned green beans. Chilies in the spices and produce.",
                                            "score": 6,
                                            "author": "GET_OUT_OF_MY_HEAD"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Atlantic Canada. I can't even get them on Amazon.ca",
                            "score": 29,
                            "author": "speculates",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "An illegal taco trade sounds good for Bitcoin.",
                                            "score": 15,
                                            "author": "Threeedaaawwwg",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or instead of crispy tostadas pan fry a corn tortilla in some butter. This is how I make my semi hard tacos. Amazing. ",
                    "score": 12,
                    "author": "Harmacc",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I guess I’m pretty lucky that my local grocery store has oversized tortillas that work perfect for making these.",
                    "score": 10,
                    "author": "PM_ME_UR_TANNED_BUTT",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve made these and they are the BEST! Then I started making breakfast ones with egg, bacon, hot sauce, cheese. I wanted to start a Crunchwrap food truck!! ",
            "score": 972,
            "author": "mchessher",
            "replies": [
                {
                    "level": 1,
                    "comment": "idk why i never thought to do breakfast versions. Thank you for this. Making one tomorrow",
                    "score": 294,
                    "author": "My_Little_Absol",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish Taco Bell made breakfast food. That would be so good. ",
                            "score": 115,
                            "author": "BackWithAVengance",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man, if you're being serious have I got some life changing news for you. ",
                                    "score": 563,
                                    "author": "enjoytheshow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Whatttttt I just checked. It's true! Is that an all day thing? I wish there were places that served breakfast all day. I'm always craving a mcmuffin or something at like 2-3 in the afternoon. ",
                                            "score": 170,
                                            "author": "BackWithAVengance",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well, now you've squandered 2 wishes... Don't blow the last one.",
                                                    "score": 247,
                                                    "author": "ReverseApache_Master",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"I wish there were places that brought the food to you, for those nights when I'm too drunk to drive.\"",
                                                            "score": 68,
                                                            "author": "RemnantEvil"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They've taught me something here. I'm wishing for things like winning the lottery and am bummed when it doesn't happen. I just gotta start wishing for totally reasonable things and they might come true!!",
                                                            "score": 25,
                                                            "author": "zatchsmith",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[Wish for sandwiches](https://i2.wp.com/thecuriousbrain.com/wp-content/uploads/2013/11/1456013_10151796863951969_419959157_n.jpg)",
                                                                    "score": 7,
                                                                    "author": "okwatt"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "11am I think. McDonald's does all day breakfast reduced menu now. ",
                                                    "score": 28,
                                                    "author": "enjoytheshow"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The McDonalds around here have an all day breakfast menu, not as much choice as normal breakfast but all the basics. Not sure if Taco Bell does the same though.",
                                                    "score": 39,
                                                    "author": "larevolucion"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Try the steak AM crunchwrap.  It blows other breakfast fast food out of the park.",
                                                    "score": 35,
                                                    "author": "CaptainKate757",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This might be a troll guys\n",
                                                    "score": 16,
                                                    "author": "XxBrando6xX",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But it's such a wholesome troll",
                                                            "score": 48,
                                                            "author": "othaniel",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They do ",
                                    "score": 16,
                                    "author": "9maplerose"
                                },
                                {
                                    "level": 3,
                                    "comment": "They have for years\n",
                                    "score": 12,
                                    "author": "Sephiroso",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They do, but they don't have beans available in the am, booooo ",
                                    "score": 6,
                                    "author": "cheerful_cynic",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Start a Crunchwrap food truck, seriously, do it. Sounds like a great idea.",
                    "score": 43,
                    "author": "pgneal3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crunch wraps are so underrated. I remember in college it was the station that was the most packed, other than the omelette station. Kinda surprised it’s not more obviously popular.",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You had a goddamn crunchwrap station in your cafeteria? \n\nFuck man, the pizza in mine was doughy on the bottom, the burritos used all around terrible ingredients, and were often the size of a soda can, the sandwich station was very meh, the Asian food station was only good on sushi Tuesdays *aaaaaand* that was pretty much it for me... Freshman -15 at SJSU. ",
                                    "score": 7,
                                    "author": "Schkateboarda",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I make these. It’s very similar to OP’s post except I add 2 tablespoons of crushed Ambien. ",
                                    "score": 23,
                                    "author": "bass-lick_instinct"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Honestly I’m still pretty disappointed we don’t actually have taco trucks on every corner. I feel that that would be a net societal positive. \n\nPicture all of the buildings on Wall Street, decimated during The War, their ruins covered in 200 years of growth, stripped back just enough for the taco truck delegation from each nation in the New UN. \n\nA place for the world to unite. Around tacos. ",
                            "score": 10,
                            "author": "AbrasiveLore",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do you put the hashbrowns *in* the tortilla though like TBell does? That's the difference maker",
                    "score": 29,
                    "author": "enjoytheshow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CARB OVERLOAD YES",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I literally looked up how to make the California AM crunch wrap after seeing this. Can’t wait for breakfast tomorrow morning! ",
                    "score": 7,
                    "author": "That1one_guy",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rather than cut a small tortilla out of a larger one, I would buy taco sized flour tortillas. They sell flour tortillas that are the same size as the corn ones. \n\nOne less step and you don’t waste a ring of tort!\n\nEdit/update: just went to the store and they sell GIANT tortillas that look big enough to cover the whole thing so you don’t need a second, smaller tortilla. USA! ",
            "score": 409,
            "author": "BubblyTummy",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's a great idea if you don't have too many of both left over at the end! I also think they sell burrito-sized tortillas that might be big enough to fully enclose the tostada shell on its own. I'll have to do some testing and report back.",
                    "score": 68,
                    "author": "dumpemout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I tried this and it didn’t go well. As a PSA to everyone, just stick with the cut out circle (or smaller tortilla). You don’t want to fuck with the skillet ruining your veggies or the one tortilla just totally falling apart from being over-exerted. \n\nI also have found that if you want to make several of these, just assemble them and brush the outside with some oil and then bake at ~400 for 10ish minutes to melt cheese and brown tortillas. ",
                            "score": 57,
                            "author": "jackyohlantern",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The flour tortillas last for a really long time, so unless you don't eat them very often it's usually not a problem.\n\nGranted I try not to think about why they last so long without going stale/bad.",
                            "score": 21,
                            "author": "Adezar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "flour lard salt water. you have a tortilla.",
                                    "score": 13,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "best not to ask questions, lol",
                                    "score": 6,
                                    "author": "dumpemout"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Tortillas freeze amazingly well. Put parchment paper between them, put flat in a gallon sized bag. Gently squeeze out the excess air and seal. Freeze flat.",
                            "score": 5,
                            "author": "a_stitch_in_lime"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ditch the tortilla round and just make sure that there is cheese on the top part with the hole. Just place it hole side down on the pan and the cheese melts forming a perfect cheese plug. ",
                    "score": 10,
                    "author": "Jombi42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t ever say “cheese plug” again. ",
                            "score": 14,
                            "author": "honkhonkbeepbeeep"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You could fry/bake the extra cut parts into chips maybe",
                    "score": 11,
                    "author": "browngirls",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Its actually not necessary at all. I worked at a Moes southwest and they make a better version of the crunchwrap. If you place the wrap with exposed cheese quickly onto the hot pan it cooks into a crispy self sealing layer. Then flip and cook the other side. No wasted or extra shell required. Moes also adds an exta tostada shell and queso dip to their wrap which is what makes it superior to the crunchwrap but not necessary for homemade wraps. ",
                    "score": 13,
                    "author": "pwnmesoftly",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 494,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also former taco bell employee.\n\nWhich method did you prefer for the fold? Half the people I worked with liked to do one fold at a time and go around in a circle. The other half (myself included) folded both sides in to meet at the middle, then four folds on the corners.\n\nAlso my store just used this flat grill instead of a panini press. Thing looked like ass after a day's worth of ingrediants fell out on it.",
                    "score": 148,
                    "author": "XepiccatX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "another former taco bell employee here. I always liked the fold around in a circle. And we also did flat grill as well",
                            "score": 83,
                            "author": "saccharind",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I use to work at Taco Bell too and we had the panini presses and those things never got cleaned good enough and our crunchwraps would get Stuck to the top and fall apart and we had to make a new one completely.",
                                    "score": 36,
                                    "author": "NrdKing",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "RIP your drivethru line",
                                            "score": 51,
                                            "author": "saccharind",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 29,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I had the munchies one night and ended up waiting 30 minutes for some Taco Bell. I got a free taco for not asking what took so long. ",
                                                            "score": 13,
                                                            "author": "notnotmildlyautistic",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They were pushing us to try and be under 2 minutes. Of course being based in a small Midwestern town made this easy. ",
                                                                    "score": 8,
                                                                    "author": "GengarsKahn"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\\#tacoworldproblems",
                            "score": 21,
                            "author": "kalitarios"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Excuse me, Mr former taco Bell employee, do you have any idea what's in the sauce on a steak soft taco? It's like a lime ranch dealy",
                    "score": 14,
                    "author": "SirLoin027",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The sauce came in a bag and was called ranchero lime, so I don’t know the exact recipe unfortunately ",
                            "score": 12,
                            "author": "bucherman7",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's called avocado ranch sauce, I gets delivered to us premade",
                            "score": 8,
                            "author": "TheTribeFrodo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do you think a waffle iron would work? I can’t decide if I would destroy it with all of the little waffle pockets. Maybe I should just stick with the skillet ",
                    "score": 22,
                    "author": "chipsicecream",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the waffle pockets would strain the tortilla too much and tear it, and it wouldn't even give you good contact area to brown the outside of the tortilla. ",
                            "score": 58,
                            "author": "NickyNinetimes"
                        },
                        {
                            "level": 2,
                            "comment": "Made me think.. I have a George Foreman grill. I bet this would work. May have finally found a use for that thing.",
                            "score": 16,
                            "author": "kmofosho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just don't burn your foot ",
                                    "score": 26,
                                    "author": "as_hagi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But I really enjoy waking up to the smell of cooking bacon ",
                                            "score": 6,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Y'all. Can you even imagine all the taco bell menu items with like fresh ingredients and shit? That shit would be amazing.\n\nI feel like there's a business opportunity here but I'm currently way too high to figure out the logistics",
            "score": 3011,
            "author": "allurmemesrbelong2me",
            "replies": [
                {
                    "level": 1,
                    "comment": "congratulations, you just invented mexican restaurants",
                    "score": 4490,
                    "author": "nuentes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really, taco bell is super americanized mexican food. I live in an area with a large mexican population, and your not going to find food like this here.\n\nOn a side note I've made these, copy cat mexican pizzas, tacos, gorditas, and cheesy gordita crunches. Homemade taco bell is amazing.",
                            "score": 1124,
                            "author": "Ben_Kenobi_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 357,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Best one I ever went to was on a return trip from camping on a mountain on the desert in NM. Just a random building with a sign about 20 minutes out of a ghost town called Truth and Consequences. Our server spoke very broken English and there were chickens in the back (outside).\n\nHoly fuck tho, some of the best food I've ever had.",
                                            "score": 71,
                                            "author": "MauiWowieOwie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 16,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't know what that means.",
                                                            "score": 7,
                                                            "author": "MauiWowieOwie",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lol Truth or Consequences isn't a ghost town.",
                                                    "score": 19,
                                                    "author": "pybro24",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well when we passed through it looked deserted. This was almost a decade ago, so I dunno.",
                                                            "score": 13,
                                                            "author": "MauiWowieOwie"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You aren't wrong, but I feel there is a place for both in this big world.",
                                            "score": 183,
                                            "author": "MonsterXero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a Mexican, I don’t see why people always shit on Taco Bell. Like ok, I know it’s not “real” Mexican food, but it’s 2 am and I’m fucked up and this chalupa is fucking hitting ",
                                                    "score": 131,
                                                    "author": "IAmAGoatFuckerAMA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 29,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm Mexican and sometimes I just want a fuckin cheesy gordita crunch",
                                                            "score": 4,
                                                            "author": "legakhsirE"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[Big Enough](https://youtu.be/rvrZJ5C_Nwg)",
                                                    "score": 29,
                                                    "author": "Never-enough-bacon",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Best tacos I ever had were from an unlicensed Mexican storefront where the storekeeper’s wife would hook you up with delicious shit and you sat at a card table in the back.",
                                            "score": 29,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;storekeeper's wife would hook you up\n\nOh shit, this getting good...   card table, wait...   what?",
                                                    "score": 16,
                                                    "author": "spoogeUZI",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean they are, but they’re also not “Taco Bell with better ingredients”. ",
                                            "score": 19,
                                            "author": "scoobyduped"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "...sometimes. Most of the time they’re horrible approximations of Mexican-ish food. ",
                                            "score": 5,
                                            "author": "abrahamisaninja",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Man I like real Mexican food but being from Texas, TexMex has stolen my heart and stomach for all time. ",
                                    "score": 15,
                                    "author": "Prophet_of_the_Bear"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ground beef for tacos isn’t very common for Mexican food but is for American Mexican. Those cheeses are straight up American. Sour cream used is likely American type. Iceberg lettuce is more common in American Mexican. Flour tortillas aren’t common in central and southern Mexico. ",
                                    "score": 91,
                                    "author": "daimposter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Tex-Mex\" might be the term you're looking for.  The staples of what're commonly referred to as Tex-mex, including ground beef tacos, nachos, and such.\n\nNachos were invented in 1946 by a restaurateur in Juarez who was trying to shut down his kitchen, but some drunk army waves from El Paso were in his bar, begging for something to eat.  That's as Tex-Mex as a food origin can get. (The restaurateur was named Ignacio, which gives him the nickname Nacho.)\n\nEdit: seems like I blew some of the details here, but more facts are found below.",
                                            "score": 143,
                                            "author": "Sunfried",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ignacio was a goddamn genius.",
                                                    "score": 47,
                                                    "author": "allurmemesrbelong2me"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Tex Mex is misleading. Not all American Mexican food is Tex Mex. In fact, Taco Bell is from California. California burritos are neither authentic Mexican or TexMex\n\nProbably more like southwestern Mexican?\n\n\n",
                                                    "score": 38,
                                                    "author": "daimposter",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree; I don't think anyone uses the term Cal-Mex (not in a world where plenty of people think that California is just stolen Mexican land), but there's a lot of cuisine difference between Tex-Mex and what is probably largely called \"Baja-style\" cuisine, i.e. west coast Mexican food.  There are a lot more camarónes to be had when you're on the sea!  \n\nI live in the Pacific Northwest; we definitely get more mainstreaming of the coastal Mexican in our generic mexican restaurants and burrito joints: more seafood, more crema, eating Mission-style burritos (which may not have originated in SF, but became big there), and so on.  \n\nAnyway, I didn't mean to suggest that Taco Bell is authentic, but your national Mexican chains such as Azteca and Chipotle are mainly pulling dishes from Tex-Mex and Baja (as qualified above), tweaked for the American palate.  Authenticity is not job 1. ",
                                                            "score": 35,
                                                            "author": "Sunfried",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The mexican food you enjoy is not the same mexican food throughout Mexico. Having a pissing contest about how authentic *your* mexican food is, is stupid.",
                                    "score": 43,
                                    "author": "CrazyTillItHurts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mexican living in SoCal. We have both and it’s amazing. Some days I want authentic and other days I want American tacos. ",
                                            "score": 25,
                                            "author": "masuabie",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Taco Bell doesn't even claim to be Mexican food though. They are \"Mexican inspired\"",
                                            "score": 19,
                                            "author": "Chewy12"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*- So long, and thanks for all the fish.*",
                            "score": 41,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My man \n\n(or woman, but probably my man)",
                                    "score": 11,
                                    "author": "allurmemesrbelong2me",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's basically Taco Time's schtick.  But I think that's only a PNW thing.",
                    "score": 23,
                    "author": "LeOmeletteDuFrommage",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It would fucking kill in a college town. ",
                    "score": 19,
                    "author": "enjoytheshow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You'll also have to raise prices, so probably not",
                            "score": 35,
                            "author": "IMovedYourCheese",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can confirm, shit's tasty.  Would recommend while stoned.  \n\nI replaced the sour cream with guac and I added bacon.  It was golden.",
                    "score": 53,
                    "author": "PM_ME_2DISAGREEWITHU",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It wouldn't taste the same without the self loathing though",
                    "score": 71,
                    "author": "IMovedYourCheese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've got more than enough of that to go around, mate",
                            "score": 28,
                            "author": "allurmemesrbelong2me"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I honestly actually prefer the Taco Bell taste, oddly enough.",
                    "score": 28,
                    "author": "BassCreat0r",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They spent a lot of money to make their product taste as good as possible while staying cheap.",
                            "score": 41,
                            "author": "PM_ME_YOUR_DICK_PICC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And I love them for that.  Nobody is going to Taco Bell for health food.  We go there because it's insanely cheap and yet still somehow tasty.  Diablo sauce makes everything better and now they even have *fries*.  I did not know I wanted fries with my burrito, but I do.",
                                    "score": 24,
                                    "author": "dizneedave",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can ask for stuff 'fresco' style and I think they replace cheese with salsa and stuff. It still wouldn't be as amazing as this, but makes if feel more 'fresh'",
                    "score": 9,
                    "author": "Taco_Dave"
                },
                {
                    "level": 1,
                    "comment": "I wanted to upvote you, but you're at 420 so it just didn't seem right.",
                    "score": 5,
                    "author": "TheRealGoldilocks"
                },
                {
                    "level": 1,
                    "comment": "In Atlanta Moe's or Willy's fulfills this niche. Moe's even had a crunchwrap copy cat item!",
                    "score": 25,
                    "author": "rawrledge",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; Y'all. Can you even imagine all the taco bell menu items with like fresh ingredients and shit?\n\nYeah then your $5 box becomes a $20 box with no drinks or sides.",
                    "score": 11,
                    "author": "Zexks",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I always thought a Chipotle style Taco Bell where they make everything right in front of you would be awesome. Call theme Taco Bell Fresh or something. They wouldn’t have to replace regular  Taco Bell’s but just work in conjunction with them. Put them in strip malls or airports.",
                    "score": 4,
                    "author": "excellence_wright",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do you do with the rest of the second tortilla?",
            "score": 84,
            "author": "I2ed3ye",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 375,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you looking for a job in cost reduction by any chance?",
                            "score": 155,
                            "author": "dumpemout",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 110,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know you're joking, but I once used a tortilla as a plate/napkin for eating tacos and then ate it afterwards.  \n\nAnd by \"once\" I mean \"every time.\" ",
                            "score": 18,
                            "author": "reubensauce"
                        },
                        {
                            "level": 2,
                            "comment": "Certified 6 sigma",
                            "score": 7,
                            "author": "slyguy183"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Obviously this](https://i.imgur.com/UC7fcwS.gifv)",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah this seems wasteful. Just buy another bag of tortillas the size of the tostada. ",
                    "score": 17,
                    "author": "enjoytheshow",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Slice into triangles, fry into chips or croutons.",
                    "score": 16,
                    "author": "Sunfried"
                },
                {
                    "level": 1,
                    "comment": "Let your cat wear it like a necklace obviously",
                    "score": 13,
                    "author": "No_big_whoop"
                },
                {
                    "level": 1,
                    "comment": "You could make tortilla chips out of them. ",
                    "score": 7,
                    "author": "ComradeALat"
                },
                {
                    "level": 1,
                    "comment": "i bought a pack of smaller tortillas and then just put that on top. ",
                    "score": 8,
                    "author": "BlazeMPH"
                },
                {
                    "level": 1,
                    "comment": "When cutting, offset and see if you can do 2 for each tortilla. Or buy smaller tortillas along with the big ones.",
                    "score": 6,
                    "author": "barely_harmless"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude the Crunchwrap is the best thing in the menu so imma make this later",
            "score": 133,
            "author": "TheRealC4Gaming",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crunchwrap is good, but the Cheezy Gordita Crunch is the best thing on the menu.",
                    "score": 113,
                    "author": "Mr_Jack_Burton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're both right and it's not even fucking close. \n\nCheezy Gordita Crunch    \n|   \nBreakfast Crunch Wrap    \n|    \nRegular Crunch Wrap    \n|    \n|    \n|    \n|    \n|    \n|    \n|    \n|    \n|    \n|    \n|    \n|    \nEverything else\n\n\ndont @ me",
                            "score": 80,
                            "author": "enjoytheshow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just want to let you know that you're right.",
                                    "score": 8,
                                    "author": "Yrogerg1089"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Cheesy gordita crunch with a Doritos loco taco in it. Also the chalupas are bomb",
                            "score": 14,
                            "author": "Flyingpinguinz",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I'm a big fan of the double decker tacos, not many of my friends are familiar with them but they've been a staple menu item since Shaq did commercials in the 90's.\n\n[for your viewing pleasure](https://www.youtube.com/watch?v=HgiqJQXjx6w)",
                            "score": 11,
                            "author": "dumpemout",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t fucking get how chalupas are so disrespected ",
                    "score": 16,
                    "author": "manute-bols-cock",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looking for that chalupa copycat over here 👀",
            "score": 32,
            "author": "shortcircuit15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imma need a cheesy gordita crunch recipe stat\n",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "https://youtu.be/M51zoI8j2Cg?t=478",
                    "score": 9,
                    "author": "03169102",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re doing the lords work. ",
                            "score": 7,
                            "author": "shortcircuit15",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We've made these a couple times. They come out pretty great and they're quick and easy to make.\n\nOne thing - tostada shells are not always as easy to find as regular taco shells. You can make a ghetto version of the tostada shell by just taking any crunchy taco shell and snapping it in half, removing the curved lip part, and then putting the two halves together in the middle. It still works just as well.",
            "score": 28,
            "author": "jmarFTL",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who lives in California, I never realized tostadas were ever hard to find.",
                    "score": 10,
                    "author": "Moskeeto93",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;taco bell fans, here’s how you do it!\n\nTaco Bell fans: ok but can u make it at 2am when i am dangerously not sober?",
            "score": 23,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I like it a lot better without the oil in the pan when you toast the tortilla, personally. ",
            "score": 20,
            "author": "snoopwire",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Made one of these with flank steak and it was pretty bomb (even though I’m a terrible cook).",
            "score": 9,
            "author": "Yjan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I might have to try this with flank steak or shredded chicken (crock pot)!",
                    "score": 7,
                    "author": "dumpemout",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "God that looks easy as hell to make too!",
            "score": 15,
            "author": "TheRealC4Gaming"
        },
        {
            "level": 0,
            "comment": "Well, I know what I'm eating tonight.",
            "score": 45,
            "author": "PitchforkAssistant",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ass?",
                    "score": 140,
                    "author": "Fishstixxx16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Este chico come culo.",
                            "score": 29,
                            "author": "firebreather209"
                        },
                        {
                            "level": 2,
                            "comment": "Preferably *before* eating one of these things",
                            "score": 12,
                            "author": "thegift_curse",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Use Doritos instead of tostadas....trust me.",
            "score": 7,
            "author": "Master_Winchester",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I make a variation on this where you put the tostada *on top/last* and then fold, thus eliminating the need for that extra tortilla round (unless you can get really big tortillas that fold completely over themselves).  \n  \nSidebar: lettuce inside anything that is hot/warm is freaking gross. When a stray piece goes flying in the prep line and ends up in my quesadilla from TB it's such an unpleasant surprise. ",
            "score": 9,
            "author": "DRF19",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Use a 12 inch tortilla from a Mexican market for the base and u won't need an extra one on top. Most tostada are six inches so it works perfectly. That's how they make it at Taco Bell.\n\nSource: Im working at Taco Bell right now. ",
            "score": 10,
            "author": "superlongusername"
        },
        {
            "level": 0,
            "comment": "I get that you guys are just promoting your channel and shit, but there isn't even a single recipe or instruction anywhere in the topic, and I'm not going to sub to your facebook or whatever else you're creating content on. And this is frequently a thing when delish's gifs are posted here - almost everyone else *does* post a recipe when they make something, except delish.\n\nIt should be a requirement to post the recipe/instructions. I'm not American, there are no tacos where I live, but I'd still like to be able to make this decently without murdering the recipe. What's the temp to cook? What's the ingredients and the amounts, in whatever measurement you want to use, of all the stuff someone would need to cook this? \n\nI don't know, I thought this sub's purpose was inspiration, and to get people to start cooking (new) things, not like-factories for a select few \"social media content creators\". I dunno about the rest of you, but generally when I cook a dish I don't know, I *need* a recipe. I'm not a professional cook or anything, just a regular person trying to discover new food to prepare.",
            "score": 85,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just went to the delish site and grabbed [this] (http://www.delish.com/cooking/recipe-ideas/recipes/a52078/crunchwrap-supreme-recipe/):\n\nINGREDIENTS\n\n* 1 lb. ground beef \n* 1 tsp. chili powder \n* 1/2 tsp. ground paprika\n* 1/2 tsp. ground cumin\n* kosher salt\n* Freshly ground black pepper\n* 8 large flour tortillas\n* 1/2 c. Nacho Cheese Sauce\n* 4 tostada shells\n* 1 c. sour cream\n* 2 c. Shredded lettuce\n* 1 c. chopped tomatoes\n* 1 c. shredded Cheddar\n* 1 c. Shredded Monterey Jack\n* vegetable oil\n* Hot sauce, for serving\n\nDIRECTIONS:\n \nIn a skillet over medium heat, add ground beef, chili powder, paprika and cumin. Cook, breaking the meat up with a wooden spoon, until the beef is no longer pink, about 5 minutes. Drain fat, then season with salt and pepper.\n\nCut small flour tortillas: Stack four large flour tortillas and place a tostada shell in the center. Using a paring knife, trace around the edges of the shell to cut four smaller flour tortilla rounds. Set aside.\n\nBuild crunchwraps: With remaining large flour tortillas, add a scoop of ground beef to the center of each tortilla, leaving a generous amount of space around the edges for folding. Drizzle cheese sauce over each, then place tostada shells on top. Spread sour cream over each shell, then top with lettuce, tomato, and cheeses.\n\nPlace the smaller flour tortilla cutouts in the center of each crunchwrap then tightly fold the edges of the large tortilla towards the center, creating pleats. After wrapping, quickly invert crunchwraps so the pleats are on the bottom and they stay together.\n\nCook crunchwraps: In a medium nonstick pan over medium heat, heat a very thin layer of vegetable oil. Working one at a time, add crunchwrap seam-side down and cook until tortilla is golden on the bottom, 3 to 5 minutes. Flip crunchwrap and cook until the other side is golden, 3 to 5 minutes more.\n\nRepeat with remaining crunchwraps and serve warm with hot sauce.",
                    "score": 131,
                    "author": "dumpemout",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Super appreciated, thank you!",
                            "score": 19,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Yay I was scrolling to find this! Thank you!!",
                            "score": 8,
                            "author": "Amonet15"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "cooking lettuce is making me uneasy",
            "score": 7,
            "author": "yearightt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Shit yes",
            "score": 7,
            "author": "33llikgnik"
        },
        {
            "level": 0,
            "comment": "YO WHY DID THEY WASTE ALL THAT TORTILLA\n\nJUST GET FUCKIGN SMALLER ONES\n\nTHIS IS HOW YOU CAN TELL PEOPLE THAT DONT COOK FOR THEM SELVES OR SHOP FOR THEM SELVES",
            "score": 19,
            "author": "SemiliterateShithead",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cooking for one and buying 2 types of tortillas doesn't compute. Be eating tortillas for 2 weeks",
                    "score": 7,
                    "author": "Margra",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "My coworkers and I will rotate making lunches for each other ever Wednesday. There’re four of us in on it. (One of them always forgets so we have to wait a week but whatever. Fuck you Cody.) I saw this gif a few months ago, looked up the recipe, made them, and they fucking loved em.  10/10 recommend. ",
            "score": 6,
            "author": "DOGE_in_the_dungeon"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 9,
            "author": "[deleted]",
            "replies": []
        }
    ]
}