{
    "id": "by1dmm",
    "score": 22047,
    "title": "Scotch Eggs",
    "author": "TheLadyEve",
    "date": 1559950174.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/by1dmm",
    "media_urls": [
        "https://gfycat.com/vapidillamericanrobin"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Please post your recipe comment in reply to me, all other replies will be removed. Don't forget to flair your post!\n\n##**Recipe Comment is under this comment, click to expand**\n\n##**↓****↓****↓**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GifRecipes) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have not once ordered nor eaten a scotch egg, but every time I see a gif recipe for them I watch the shit out of it. \n\n Might be time to finally try making it!",
            "score": 1661,
            "author": "dont_tip_waitresses9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. I always save recipes and gifs like these and then completely forget about them. Will add this to the pile.\n\n&amp;#x200B;\n\nMaybe someday.",
                    "score": 242,
                    "author": "Ihlita",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someday!",
                            "score": 46,
                            "author": "dont_tip_waitresses9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I say we all three commit to making them and posting pictures on [National Scotch Egg Day](https://whatnationaldayisit.com/day/scotch-egg/) which is apparently on July 27th.",
                                    "score": 68,
                                    "author": "TheAstronomer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was born on July 27th and my real name is Scott Egg!",
                                            "score": 37,
                                            "author": "Oafus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No way my dude",
                                                    "score": 10,
                                                    "author": "j0_ni",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, I lied. But imagine if it was! I’d so be the hero of this thread.",
                                                            "score": 49,
                                                            "author": "Oafus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I would have believed it if your name were Oeufus",
                                                                    "score": 10,
                                                                    "author": "spelled_latte",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Can i be part of the gang??? I wanna make a scotch egg. Im scottish too!",
                                            "score": 3,
                                            "author": "keepleft99"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What do you have against waitresses??",
                                    "score": 18,
                                    "author": "Volraith",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha nothing! I was watching Reservoir Dogs when I first made my account. It was the diner scene when Buscemi goes on his rant about not tipping waitresses and I made that my username.",
                                            "score": 35,
                                            "author": "dont_tip_waitresses9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There was an old skit on a local radio station, every day at 5pm, they'd let the lobster loose (\"Everybody get out of here, theres a lobster loose\"). I happened to be listening to some old shows and heard that when I made my username... now I hate it. It doesnt really mean anything to me and I'm pretty sure I'm mildly allergic to shellfish. People also confuse it for Theresa. But I dont want to be a new scrub around Reddit",
                                                    "score": 16,
                                                    "author": "TheresA_LobsterLoose",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I thought I first heard that on Dr. Demento.",
                                                            "score": 3,
                                                            "author": "whynotwarp10",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Mr Pink don't tip.",
                                            "score": 8,
                                            "author": "bordy"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Just took the sausage out to defrost. Can’t wait to wake up, eat cold pizza, and axe the whole idea.",
                            "score": 36,
                            "author": "prfalcon61",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks, person.  You gave me a genuine and genuinely much-needed laugh.",
                                    "score": 5,
                                    "author": "bryanodoule"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The trickiest part is getting the egg done to the degree that you prefer, but apart from that it's really very easy. Give it a try!",
                    "score": 111,
                    "author": "TheLadyEve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah that’s always struck me as the biggest challenge. I love a runny yoke so need to be wary of overcooking the egg during the fry. Might be time to finally try it. Thanks for posting!",
                            "score": 48,
                            "author": "dont_tip_waitresses9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In Scotland you would never get a runny yolk",
                                    "score": 27,
                                    "author": "Madderdan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can confirm. Never heard of a runny yolk scotch egg till today. Eating them hot for that is already out there.",
                                            "score": 9,
                                            "author": "sunnygovan",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Can confirm. Had these many times in Scotland. No runny yokes.\n\n&amp;#x200B;\n\nEven the local pub here in the States serves them fully boiled, and cold not hot.",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I have only had them cold, did not know they could be served hot...",
                                                    "score": 3,
                                                    "author": "Madderdan",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Check out Sous Vide, would probably be a great way to bring it in to exactly the temperature you want going in to the frying process to keep from overcooking it.",
                                    "score": 19,
                                    "author": "Ulairi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good call. I have a circulator so I’ll try that!",
                                            "score": 3,
                                            "author": "dont_tip_waitresses9"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Scotch eggs are something you bring to a picnic in England, so the eggs would be neither hot nor runny.",
                                    "score": 4,
                                    "author": "walkswithwolfies"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Growing up I loved scotch eggs. Yolks were of course always hard-boiled though. And I generally ate them cold.\n\nThen one day about nine years ago I had my first ever warm scotch egg with a *runny* yolk. OMG! That yolk alone was enough for me to keep coming back to that restaurant and trying other things (almost always having a scotch egg starter). And being served warm was way better too.\n\nSo I figured out how to make them like that, and started serving them pretty much whenever we had guests that I hadn’t made them for before. For a few years literally everybody I made them for was visibly amazed when they cut into it and unexpectedly found a runny yolk. Every single person asked “How did you do that? Was that on purpose? OMG can I have the recipe?”\n\nBut now if I get served a scotch egg, my first thought is “This better have a runny yolk”. If it doesn’t, I am so disappointed and my opinion of the restaurant/chef plummets. If I make them for somebody, the first thing they say is “Looks good, but does it have a runny yolk?”.\n\nThere was a time in my life when a warm scotch egg with a runny yolk was something worth living for. But the novelty has worn off and the cold harsh reality is that the introduction of the runny yolk, coupled with serving them warm, was a real game-changer that ushered in a new standard and essentially ruined one of my favourite snacks / picnic items, because I can no longer buy them at the supermarket without simply feeling disappointed when I eat them. Now when I want a scotch egg I have to take the time to make it myself (not as easy as before I had kids), or go out to a pricey restaurant. So I eat a lot less scotch eggs. On the plus side I’ve lost a lot of weight though, and that’s allowed me to start enjoying some of the other things life has to offer. So I guess it’s a bit of a mixed bag.",
                            "score": 70,
                            "author": "SineWave48",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey just so you know, my girlfriend showed me this post and gave me a tldr version your comment. She was literally crying with laughter trying to explain the hardship that you’ve lived through.\n\nI would just like to thank you for the joy you’ve brought me and my girlfriend. She’s too shy to comment here though!",
                                    "score": 30,
                                    "author": "smilescart"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They sell them early at our local renaissance fest! When done well these are the tastiest on the go breakfast treat next to tacos.",
                    "score": 23,
                    "author": "4stringsoffury",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's weird when i hear Americans talk about British food, it makes me feel like i live in game of thrones.",
                            "score": 18,
                            "author": "PmMeTheBestTortoises",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's nothing Game of Thrones about enjoying delicious Roast Pheasant on a Sunday.",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You jest, but I have done this many times in Montana. Can't wait for fall to get here- I'm out of pheasant...",
                                            "score": 3,
                                            "author": "O_oblivious"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You had me at tacos 🌮",
                            "score": 11,
                            "author": "uh60chief",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But tacos was the last word",
                                    "score": 7,
                                    "author": "keoghberry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then it's a good thing he said it.",
                                            "score": 5,
                                            "author": "TheOtherBatman"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've tried making them once. It was a nightmare, the sausage wouldn't stay on the eggs and everything was falling apart. My kitchen was a mess and I was so frustrated I gave up and made hardboiled eggs with bits of sausage on the side.\n\nI'm not a great cook.",
                    "score": 17,
                    "author": "MechaMineko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fattier sausage and let it chill for longer.",
                            "score": 8,
                            "author": "batt3ryac1d1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have eaten many a scotch egg but never ever had it with a runny yolk. This is incredibly tasty.",
                    "score": 15,
                    "author": "nomnommish"
                },
                {
                    "level": 1,
                    "comment": "Super good and crazy easy. I always boiled the eggs to slightly over soft boiled and coat in flour. Then take a Jimmy Dean breakfast sausage roll and cut it into like 6-8 pieces and just sort of mush that over the eggs, no need for rolling it between plastic or adding mustard/parsley (unless you'd like to). Then egg and breadcrumb and fry.\n\nSo goddamn good especially if you can keep the yolks slightly runny.",
                    "score": 24,
                    "author": "Metal_Massacre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone asked in a different comment, but do you happen to know if you can air fry? I love deep frying but hate smelling up my house and disposing of the oil. \n\nAlso what's the best way to keep the yolks runny? Simply not over cooking it?",
                            "score": 4,
                            "author": "TheresA_LobsterLoose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I always bake them, so air frying would be fine.  There's plenty of grease in the sausage so they still get nice and crispy.  It takes awhile to cook the sausage that way though, so you'll need to cook the eggs as little as possible if you want them runny, until they're just firm enough to peel and wrap.",
                                    "score": 7,
                                    "author": "KahlaPaints"
                                },
                                {
                                    "level": 3,
                                    "comment": "I make soft boiled / shoyu eggs all the time and have become something of an expert at this. \n\nFirst of all you put the eggs in cold water. Then turn on heat and bring to a boil, then immediately turn heat off.  Now leave them covered for another 4 minutes and 30 seconds or so and then try one. You cut it in half and put a little butter and salt on then scoop it out with a spoon (soft boiled egg). Delicious. Once you see they are the right level of cooked, drop the rest in the ice bath. Usually 4:30 to 5:00 is perfect depending on a few factors like how much water you use, it’s temperature, and how high above sea level you are (affects boiling point). \n\nBoiling the whole time over cooks the egg and makes it taste and smell like sulfur. Dropping a cold egg into boiling water makes them very likely to crack and explode. The bring to a boil and turn off the heat method results in the best possible soft texture. Eggs that are too fresh will be difficult to peel.",
                                    "score": 5,
                                    "author": "red_duke",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Boil water, add eggs, exactly 6min and 30 seconds later take them out and put them in cold water. Stable white and semi liquid yolk.",
                    "score": 6,
                    "author": "junuz19",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Scotch eggs, pork pies and sausage rolls are the food of the gods.",
                    "score": 4,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I’ll be the person to differ with the other people commenting...I also thought they sounded really good, and then I finally had one in an Irish pub. Was way too much for me. You know when you eat something that’s too sugary or too salty or something? It was like that but for sausage and egg. I ate like half of one and hit my limit. Not a bad taste, but just too much for me. Dense I guess is the word.",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it's a whole lot of calories and cholesterol and salt and fat all at once.\n\nI do love 'em though.",
                            "score": 7,
                            "author": "GanondalfTheWhite"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Irish pub\n\nWell there's the problem right there.",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're bigger than they look and even more filling. I've made them.",
                    "score": 2,
                    "author": "mackafat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have to say, this gif is on point. Very clear, well produced and actually a good watch too!",
            "score": 398,
            "author": "synthestar",
            "replies": [
                {
                    "level": 1,
                    "comment": "This guy's videos are always like this and I highly recommend them! Recipe30 on YouTube.  Straight to the point, probably the best video production on a cooking channel in terms of audio and visuals, and gives links to the written recipes too.\n\nThat said, Chef John will always be my #1.",
                    "score": 45,
                    "author": "TantalSplurge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And as always .. Enjoooy\n\n I haven't seen recipe30 I'll check them out.",
                            "score": 12,
                            "author": "A92AA0B03E"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, most are more like /r/DIYwhy but this one is excellent.",
                    "score": 45,
                    "author": "Pepe-es-inocente",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;eggcelent",
                            "score": 31,
                            "author": "Mr_Abe_Froman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yea I think this is the first gif recipe I’ve seen where the oil is actually preheated.",
                    "score": 4,
                    "author": "Anthony780"
                },
                {
                    "level": 1,
                    "comment": "It's really terrific, right?",
                    "score": 10,
                    "author": "chauggle"
                },
                {
                    "level": 1,
                    "comment": "&gt; I have to say\n\nI'm just imagining somebody standing behind you with a gun like. \"Tell this Mofukka bout the gif quality\"",
                    "score": 3,
                    "author": "bannik1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When do I add the scotch?",
            "score": 477,
            "author": "TheTapedCrusader",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apply liberally to yourself while you're frying the eggs.",
                    "score": 723,
                    "author": "TheLadyEve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Make sure it's not more than 100 proof though, else stand back a few feet from the flame.",
                            "score": 76,
                            "author": "manfrin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Look at mr fancy pants over here with his gas range",
                                    "score": 41,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ugh I hate having a gas range. No such thing as simmer, and it cost 4x more just to have the gas then the amount I actually use for cooking.",
                                            "score": 9,
                                            "author": "NotSoLittleJohn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This comment makes no sense to me at all. Is it because I am English?",
                                                    "score": 5,
                                                    "author": "nick47H",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm not sure? I have a gas stove and the low setting still causes things to boil. And the cost of just having access to gas is more then the cost of the gas I use each month.",
                                                            "score": 3,
                                                            "author": "NotSoLittleJohn"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The night before if you want to really enjoy these.",
                    "score": 8,
                    "author": "bokononpreist"
                },
                {
                    "level": 1,
                    "comment": "Weirdly they are not Scottish, but were originally called Scotched eggs. First made in London, I believe.",
                    "score": 2,
                    "author": "LMcScottish",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 182,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My thoughts exactly.\n\nHardboiled eggs are already annoying. Then you have to wrap it in the meat, that you have to make yourself and then you have to bread it, which always ends up being more annoying that you thought it would be.",
                    "score": 57,
                    "author": "AnarchyMoose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean soft boiled. A hard boiled egg is a piece of piss, just leave it in the water for 10+ mins.",
                            "score": 43,
                            "author": "Maxtsi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cooks illustrated soft boiled recipe is on point. 6.5 minutes covered in a 3/4 inch of already boiling water then cool. It's amazong",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just boil them until the red eggtimer thingy says soft and then I rinse in cold water foe a few minutes.",
                                            "score": 7,
                                            "author": "langlo94"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m the same. I live them and will gladly pay for them when I find them, but the cooking-steps-to-eating ratio is too high for me to make them myself. My mother-in-law (who was from Liverpool) used to make them for me because she knew I liked them.",
                    "score": 6,
                    "author": "Calan_adan"
                },
                {
                    "level": 1,
                    "comment": "Right? What kind of person had time to make this kind of appetizer?",
                    "score": 3,
                    "author": "pretentious-redditor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Scotch eggs** are boiled eggs wrapped in sausage, breaded, and fried. They can be had hot or cold.  \n\nSource: [Recipe 30](http://www.recipe30.com/scotch-eggs-with-italian-sausage.html/)\n\n10 eggs (2 for egg wash) \n\n1lb -500g Italian sausages (approx 4 large ones) \n\nHalf bunch of flat leaf (Italian) parsley \n\n1 tbsp Dijon mustard \n\n½ cup all purpose (plain) flour \n\n1 cup breadcrumbs \n\n2 quarts - 2 litres of vegetable oil for frying\n\n\nIn a large pot, add water and bring to the boil. Ideally you want approx one inch (2cm) of water above your eggs. (Put as many eggs as you like but do not overlap)\n\nUsing a spoon, carefully lower the eggs, cold from the fridge, one at a time into the pot and continue to boil for 30 seconds. Cover using a lid then turn down the heat to a very gentle simmer and continue cooking for 5-6 minutes for runny yolks. If you have jumbo size eggs leave an extra minute or two. If you prefer hard, cook for 11 minutes.\n\nWhile the eggs are cooking, get a bowl or mixing bowl three quarters full of cold tap water. Then add some ice.\n\nOnce cooked, immediately place all the eggs in the ice water and allow to cool for at least 15 minutes. Peel off the egg shells under cool running water.\n\nScore the sausages by running your knife lengthwise on the top to split them open. Scoop out all the meat and place in a mixing bowl.\n\nChop the washed parsley and add to the sausage meat along with a tablespoon of Dijon mustard. Mix well by hand.\nRoll out a sheet of cling film on your bench and scoop out one heaped tablespoon of the sausage mixture. Place on the cling film and fold cling film over to sandwich the meat. Gently flatten it with your hand then finish it with a rolling pin to get an even thickness. You don’t want it too thick, a thin to medium coat gives better results. \n\nOil your hands, then pick up the plastic unwrap the meat, place the meat in the palm of your hand as you peel away the plastic. You should have only the flatten meat patty, now coat one of the boiled eggs in flour and place inside the sausage meat. Fold meat over the egg and wrap the egg so no white is showing. Any thick bits of sausage meat, tear them off and put back in bowl. Repeat process for all the eggs. Refrigerate 15-30 minutes.\n\nHeat up your deep frying oil to 350°F – 180°C.\nFor the egg wash, break two whole eggs in a bowl and mix well using a fork. \nSet up a crumbing station with one plate of flour and one plate with the breadcrumbs. \nRoll the prepared eggs in the flour first, then the egg wash, then the breadcrumbs. Only one coat is required. \nCarefully lower into the hot oil and fry fro approx 4 minutes. Generally if they are brown, they are ready.\n\n**Notes**: I’ve only made Scotch eggs a few times so I’m sure there will be useful feedback in the comments from people who are super Scotch egg savvy! While the creator of this content says to use fresh eggs, I have the best luck peeling eggs that are a little older (a week or two old) because they just seem to peel cleaner. For the cooking oil, vegetable works fine but my preferred oil is peanut oil. \n\nIf anyone is interested, I made a version of a Scotch egg wrapped in shrimp instead of sausage, and it was damn delicious. [Link](https://www.reddit.com/r/food/comments/5hwttd/homemade_shrimp_scotch_eggs/db3jhyg/?st=jwmpzpod&amp;sh=d5ca3701)",
            "score": 152,
            "author": "TheLadyEve",
            "replies": [
                {
                    "level": 1,
                    "comment": "They also bake nicely if you don't have a deep fat fryer.",
                    "score": 39,
                    "author": "arzen353",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Temp and time? Asking for a friend who wants to try this in the future.",
                            "score": 14,
                            "author": "TheGreatGonzo26",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I usually put em on a wire baking rack over a pan 375 for about 20 minutes. They're not gonna explode if you overcook em or anything, worst case they might dry out a bit. If you like 'em extra crispy you can put them under the broiler for a few minutes and then flip. \n\nI've never tried to make them with soft yolks in the oven, though, not sure if it'd be possible.",
                                    "score": 23,
                                    "author": "arzen353",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Anything is possible if you believe in yourself.",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just use a saucepan with oil in it. That's how it was done before deep fat fryers became a thing",
                                    "score": 10,
                                    "author": "Forest-Dane",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Whatever grease is leftover. Ive fried them in bacon drippings. \n\nIm fat",
                                            "score": 10,
                                            "author": "SaysShitToStartShit2",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "!remindme 10 hours",
                                    "score": 2,
                                    "author": "0laugh",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you're making them for the first time, my advice would be to overboil the egg  so it's not liable to break, for practice. If the egg breaks it'll lose structure and it's possible the sausagemeat won't be cooked properly in the middle before it gets too dark. They're always hardboiled eggs in the UK anyway, and eaten cold, unless you get them from a fancy restraunt.\n\nThe mustard in this recipe is not traditional, usually it's just plain sausagemeat, but it'd be interesting to try.\n\nFun fact: while no-one is quite sure why this is called a scotch egg, we do know it has nothing to do with Scotland!",
                    "score": 22,
                    "author": "MasterFrost01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sausagemeat. Sausagemeat. Sausagemeat.",
                            "score": 6,
                            "author": "sammidavisjr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Developers, developers, developers, developers,",
                                    "score": 5,
                                    "author": "breakyourfac",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely try the mustard, it's delicious!",
                            "score": 2,
                            "author": "TheLadyEve"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How does one reheat a scotch egg?",
                    "score": 2,
                    "author": "q2a2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Short time in a very hot oven. Granted you'll end up with a more hard-cooked egg reheating it, but that's a pretty common way to cook them anyway, so it works out.",
                            "score": 5,
                            "author": "TheLadyEve",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there a guide to peeling eggs that quickly and efficiently??? If so I need that",
            "score": 28,
            "author": "Soulpinata",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 44,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Lock n’ Lock\n\nMy husband bought us one and I can confirm, they do work better than the standard running-water-hand-peeling shtick!",
                            "score": 14,
                            "author": "TheLadyEve",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have never before seen this method. What exactly is the water supposed to accomplish, other than rinsing off the occasional tiny shell piece?",
                                    "score": 8,
                                    "author": "AnnualThrowaway",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I believe the water is meant to wheedle its way between the egg white and shell and help lubricate them apart",
                                            "score": 8,
                                            "author": "acosully",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you get good at it, it's pretty flawless and quick as hell.",
                                                    "score": 2,
                                                    "author": "deadwisdom"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah fresh eggs are much more difficult to peel. The cold water tip is also great from the OP gif, it separates the membrane from the shell",
                            "score": 2,
                            "author": "Titanspaladin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I use an egg steamer and they are exceptionally great at making perfectly cooked eggs(soft-to-hard) that are super easy to peel. One of the keys is that you puncture the shell with a sharp point, and a little air pocket forms at the wide end of each egg. This makes the shell easy to break open with your thumb, and then the shell can be pulled off in only a couple large pieces, no need to pulverize the whole thing.\n\nSuper easy, don't need to waste a ton of water, plus the nicer steamers have auto-off so if you aren't paying close attention you don't ruin a half dozen eggs.",
                    "score": 5,
                    "author": "AnnualThrowaway"
                },
                {
                    "level": 1,
                    "comment": "i just smack them on the counter then peel them under running water. the water gets between the egg and shell and they slide right off.",
                    "score": 5,
                    "author": "kristinez"
                },
                {
                    "level": 1,
                    "comment": "This way’s a little dodgy, but break a pea-sized hole on the top of the egg and peel up from the bottom about 1/5 or 1/6 of the egg. \n\nPut the pea sized hole up to your mouth and blow into it like you’re inflating a water ballon. \n\nThe egg should fly out easy af with little fuss.",
                    "score": 3,
                    "author": "ItsYaBoiAzazel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This sounds hilarious, gonna cook an egg now just to try it",
                            "score": 2,
                            "author": "Dangerjim",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tap the top, and the bottom to crack on a cutting board, or hard surface, than roll gently using your hand. Will be easy to peel from there.",
                    "score": 3,
                    "author": "stainedgreenberet"
                },
                {
                    "level": 1,
                    "comment": "Peel hundreds of eggs.  Now you're good at it.",
                    "score": 3,
                    "author": "Caracalla81",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I make a teeny crack in the bottom of the eggs to break the shell but not the membrane underneath before boiling. The water seeps into the shell and forms a type of layer so that when you peel the shell off, it comes off easily.",
                    "score": 4,
                    "author": "musicman3739"
                },
                {
                    "level": 1,
                    "comment": "A teaspoon of baking soda helps prevent the shell from sticking on fresh eggs",
                    "score": 2,
                    "author": "atomlowe"
                },
                {
                    "level": 1,
                    "comment": "Try steaming your eggs instead of boiling them",
                    "score": 2,
                    "author": "tableface"
                },
                {
                    "level": 1,
                    "comment": "I use a small spoon to slip under the shell and pull outward",
                    "score": 2,
                    "author": "barely_harmless"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh god I can already tell this is quite literally a recipe for disaster for me.\n\nI'd overcook the eggs, half the meat mixture would somehow remain stuck to the clingwrap, the egg would break wrapping it in what remains of the meat mixture, my flour/egg/breadcrumb plates would immediately become even mixtures of all three as a fumble my way through the breading, and I'd overcook them again in the fryer.\n\n\"Kill me...\"\n\n- The culinary Frankenstein monster on my plate",
            "score": 69,
            "author": "iced1777",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unpopular opinion:\n\nScotch eggs should be hard-boiled",
                    "score": 39,
                    "author": "Nimmyzed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its not unpopular if everyone in the thread is saying it.",
                            "score": 30,
                            "author": "ScoobyPwnsOnU",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I don't understand how you can cook an egg so many times and still have a runny yolk. Especially as these eggs were boiled for 6 minutes. That's hardboiled surely?",
                            "score": 10,
                            "author": "frenchduke",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is. And don't call me Shirley",
                                    "score": 8,
                                    "author": "Nimmyzed"
                                },
                                {
                                    "level": 3,
                                    "comment": "Six minutes has always given me a runny yolk, the method noted here is to put them in ice water after which halts the cooking process. \n \nWhen you're frying the thing to cook the meat, it doesn't take long at all so the fry heat doesn't reach the yolk. \n \nI've used this method and it defo works.",
                                    "score": 3,
                                    "author": "Dangerjim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wasn't thinking about the ice, never used that trick before I just thought it made it easier to peel, I didn't even think about it cooling it down, durr.",
                                            "score": 2,
                                            "author": "frenchduke"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's not unpopular, in fact that's more common! I like them soft when hot, hard when eating them cold. I think it's nice to know how to do them both ways--a soft yolk can be a joyous thing!",
                            "score": 2,
                            "author": "TheLadyEve"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If it helps, I always start with hard boiled eggs. Keep your hands wet while working with ground meat, and the meat won't stick to your fingers. Just press the meat flat with your hands and wrap around the egg- no cling wrap required!",
                    "score": 2,
                    "author": "straigh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One important thing that wasn't mentioned--season your flour and breadcrumbs folks (though it looked like they were using pre-seasoned italian breadcrumbs in this recipe).",
            "score": 16,
            "author": "Bonzai_Tree"
        },
        {
            "level": 0,
            "comment": "I had a scotch egg for the first time this past weekend and it was so delicious! The restaurant used panko instead of breadcrumbs so it was very crispy. I can’t wait to try them again!",
            "score": 29,
            "author": "halfyellowhalfwhite",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used panko once with these and I loved the results, even though it's not \"traditional.\"",
                    "score": 12,
                    "author": "TheLadyEve",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love Scotch eggs but not with Italian sausage. Just seems like the wrong type of flavor for this dish. I'd prefer a country sausage of some type.",
            "score": 25,
            "author": "thatG_evanP",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can I use hard boiled eggs? Not a fan of runny yolks, it also seems like they would work better for a breakfast on the go.",
            "score": 63,
            "author": "tanya_prry",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scotch eggs very much traditionally have a set yolk (and usually served cold). The whole hot-with-runny-yolk fashion is pretty recent.",
                    "score": 66,
                    "author": "interfail",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know about \"traditionally\" but you're 100% right that they're most commonly just sold at places like grocery stores, petrol stations, convenience stores in packages. Sort of similar to a \"fresh made\" sandwich you'd get at 1000 places. Except it's a refrigerated scotch egg with fully cooked egg.",
                            "score": 12,
                            "author": "greg19735",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sure can!",
                    "score": 29,
                    "author": "TheLadyEve"
                },
                {
                    "level": 1,
                    "comment": "They're actually supposed to be hard boiled in the centre. Workmen used to take these to work for a snack that they could eat wherever they were without needing to use a plate or cutlery. The runny yolk thing seems to be a completely modern thing that I've only ever seen on the internet.",
                    "score": 12,
                    "author": "Furaskjoldr"
                },
                {
                    "level": 1,
                    "comment": "I always have them hard boiled! Much prefer them that way as wel",
                    "score": 11,
                    "author": "jacka94"
                },
                {
                    "level": 1,
                    "comment": "Runny yolks is completely wrong. Whoever made this gif has never eaten one in Scotland or the rest of the UK. They are supposed to be hard.",
                    "score": 19,
                    "author": "SD_1974",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I've never seen nor eaten a soft boiled scotch egg. Hard boiled is best",
                    "score": 11,
                    "author": "Nimmyzed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For a dinner i'd prefer soft boiled. \n\nbut any other time, like as a snack, hard boiled is best.",
                            "score": 5,
                            "author": "greg19735"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can also make little ones with scrambled up boiled egg in the centre instead of a whole egg",
                    "score": 3,
                    "author": "mallegally-blonde"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A lot of work to make yourself.  I wish they were a more common menu item in the US, I would order them all of the time.",
            "score": 25,
            "author": "Kozlow",
            "replies": [
                {
                    "level": 1,
                    "comment": "We make them from scratch at my restaurant, and it's 100% pain in the ass. We make our own pork sausage with fresh sage, our own breadcrumbs from the bread we bake, boil and peel the eggs from our own chickens, which we raise...\n\n\n\nI'm kidding about the chickens, we get our eggs from a local produce company, but Scotch Eggs are definitely time consuming. Also, it's one of our best selling apps, so we make them very often, in big batches.",
                    "score": 22,
                    "author": "alwayshungover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How would you rate this particular recipe? Any changes you'd recommend?",
                            "score": 3,
                            "author": "gueriLLaPunK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. Use whatever sausage you want, but don't bother rolling it out. I'd mush it up a bunch in the bowl, so that the fat warms up just a little, and emulsifies the mixture. You don't want it sweaty, just very well mixed. If it gets sweaty, stick it in the fridge. \n\n\n\nWe weigh the sausage out to 3oz per egg. Also, you can weigh out, or free form the sausage while your eggs cook. I like to make them into little patties when I weigh them out, to make the wrapping part easier. \n\n\n\nI like to start the eggs in cool water with a pinch of baking soda. Bring to a boil, let go for maybe 2min, turn off the flame, and let them sit in the water for maybe 6-8 minutes, then drain and dump a bunch of ice on. This is for runny centered eggs. If you want harder bois, boil for five, and let sit for 8 in the pot.\n\n\nPeel those guys while they're still cold, in the ice. The shell should slip off without too much effort, there are always a couple of trouble makers though. If you go runny yolk, the eggs are gonna be real squishy, and easily broken, and you're gonna be really glad that you emulsified that sausage. It will be much easier to handle. (Yeah, I know). Also drying off your eggs before wrapping w/the meat will help so, so much. \n\nTake a moment to mix up some flour, salt, and pepper, in a bowl or whatever vessel you have clean. I also get my oil heating at this stage, a couple of inches, maybe 350F. \n\nTake one of your little meat patties in your hand, and gently nestle an egg in there. Still, gently, begin to work the sausage around the egg, until it's surrounded. Try not to smush the eggs. Dust them in the seasoned flour. Bread them like many other fried foods, egg and bread crumbs. \nDon't coat the eggs in flour before sausage-ing them. I've done it, and it makes the wrapping process easier by a mile, but when you cut into the finished scotch egg, the egg wants to pop out of its cozy sausage home. If you're only making a few though, do it. It's a disaster for plating when you're chasing egg whites and sausage all over the plate during service, though.  \n\n\nDrop them in the hot oil enough to brown, and how we do it, since it's in batches, we crisp em up in the oil, then bake them for like 10 min at 350-375 F, until the sausage is cooked. \n\n\n\nThen we keep 'em cold till ordered. \n\nTo serve, they're quartered and heated at 475F for 5 min, and served with honey mustard.\n\n\n\nEdit: Lots of edits. Lots and lots.",
                                    "score": 10,
                                    "author": "alwayshungover",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow, thanks for the detailed response!",
                                            "score": 3,
                                            "author": "gueriLLaPunK",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for saying that! Got pretty stoned mid-comment, started questioning everything, haha.",
                                                    "score": 6,
                                                    "author": "alwayshungover"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They’re not really a restaurant item in the UK. They’re like a snack item for lunches. Part of the picnic holy trinity alongside pork pies and sausage rolls.",
                    "score": 4,
                    "author": "Lost_And_NotFound"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You lost me at Italian sausage",
            "score": 21,
            "author": "TyrRache",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Me: ooh, I'm totally going to make these!\n\nMe, 86 steps later: or maybe I'll just get a pizza.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Italian sausage for scotch eggs? 🤔",
            "score": 5,
            "author": "shonuph"
        },
        {
            "level": 0,
            "comment": "Why Italian sausage?",
            "score": 5,
            "author": "artyrobs23"
        },
        {
            "level": 0,
            "comment": "This is recipe is incorrect. The yolk should not be runny and, you don't use FUCKING Italian sausage. Its Cumberland or juts plain sausage meat.",
            "score": 6,
            "author": "JarringCorgi522",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm gonna try it in an air fryer",
            "score": 10,
            "author": "Bumbum2k1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a person living in Scotland who loves these I recommend them to everyone! Just do not, I repeat, DO NOT stick them in the microwave when they're cool without piercing them first. Once blew up with the force of an egg grenade in my face and disintegrated completely.\n\nBukk-eggke",
            "score": 16,
            "author": "PrettyMuchAmazing303",
            "replies": [
                {
                    "level": 1,
                    "comment": "This went from informative to exciting to hillarious. Exactly the kind of comments I hope for when clicking into the comments section.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man, I always thought scotch eggs were terrible. Turns out my stepmom just did NOT make them right.",
            "score": 6,
            "author": "Slapcaster_Mage"
        },
        {
            "level": 0,
            "comment": "Coul it be done in an air fryer?",
            "score": 3,
            "author": "3nterShift",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I do mine in an air fryer and my Dad hovers around the kitchen like a Labrador waiting for them to finish",
                    "score": 2,
                    "author": "feathersoft"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've never had a Scotch egg.  Are they worth the effort compared to just eating regular sausage and eggs?",
            "score": 4,
            "author": "gsfgf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely. Give it a go",
                    "score": 2,
                    "author": "Nimmyzed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only other time I've seen a scotch egg in any type of media was neopets.",
            "score": 3,
            "author": "scarface910"
        },
        {
            "level": 0,
            "comment": "After all that how the hell is the yolk still runny?",
            "score": 3,
            "author": "sanathkumarx",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This looks good but jesus that looks tedious just for eggs with sausage",
            "score": 4,
            "author": "LionCashDispenser"
        },
        {
            "level": 0,
            "comment": "I married a Brit and he introduced me to these. They make for great quick breakfasts on the go- lots of protein and travel pretty well.",
            "score": 14,
            "author": "Koalaesq",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They sell them ready made EVERYWHERE in the UK. Seriously they sell them in petrol stations and every supermarket I’ve ever been in. But they’re hard boiled not soft and eaten cold.",
                            "score": 21,
                            "author": "5Muddypuddles",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They taste glorious.",
                            "score": 10,
                            "author": "Octavya360"
                        },
                        {
                            "level": 2,
                            "comment": "I think the idea is you make a batch and then eat them throughout the week.",
                            "score": 8,
                            "author": "coffeequill",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The idea in the UK is more that every single supermarket sells them, by the sandwiches, so you don't have to faff around trying to make them, they're just a handy snack you can buy cheap anywhere in the country.",
                                    "score": 16,
                                    "author": "AnorakJimi"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean, you can say that about anything. \"That beef Wellington looks like a lot of work for some beef, mushrooms, foie gras and puff pastry.\"  \"That bread looks like a lot of work for some flour, water, yeast and salt.\" \"That schnitzel looks like a lot of work for some meat and breadcrumbs.\"",
                            "score": 28,
                            "author": "TheLadyEve",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Very true, but \"quick breakfast\" seems like a stretch.",
                                    "score": 10,
                                    "author": "musicman3739",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "...you make them ahead of time for a breakfast food. Eat them cold or reheat. These are a convenience food, really.",
                                            "score": 24,
                                            "author": "TheLadyEve",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ohhhhh! While drinking scotch the day before. Makes sense now.",
                                                    "score": 18,
                                                    "author": "Trogdor_T_Burninator",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "See, now you're cooking with gas!",
                                                            "score": 17,
                                                            "author": "TheLadyEve"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You don't need to fry them.  We wrap the eggs in sausage and bake them instead.  No breading, no frying, tastes great.",
                            "score": 3,
                            "author": "gogojack"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why would you \n\na) use Italian sausage \n\nb) cut a sausage open when you can just buy sausage meat or even make it yourself",
            "score": 7,
            "author": "BigChegger"
        },
        {
            "level": 0,
            "comment": "Holy shit, all the karma for this. Would gild if not broke",
            "score": 13,
            "author": "Throan1"
        },
        {
            "level": 0,
            "comment": "ITALIAN SAUSAGE!? ACK!",
            "score": 18,
            "author": "Bizmark_86",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've never had a scotch egg with a soft yolk, it looks a thousand times more appealing.",
            "score": 3,
            "author": "InsertEdgyNameHere"
        },
        {
            "level": 0,
            "comment": "Why flour the egg before wrapping with sausage?",
            "score": 3,
            "author": "lemonpjb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Helps it stick to the egg.",
                    "score": 5,
                    "author": "TheLadyEve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Heat oil for 6 hours. Got it!",
            "score": 3,
            "author": "CAKE_EATER251"
        },
        {
            "level": 0,
            "comment": "If you want to be really fancy: quail eggs in crab meat",
            "score": 3,
            "author": "feathersoft"
        },
        {
            "level": 0,
            "comment": "These, I think, are best when served on top of a salad. I like making like a nest out of the greens and having the egg in the center. Makes for a really nice protein addition to salads and looks fun too",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "42 years and never once seen a runny Scotch egg.",
            "score": 3,
            "author": "Sagacious_Sophist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As an european, i seriously ask my self wtf you mean with \"Italian sausage\".\n\nIts like saying \"French wine\", or \"German bread\"... there are a FEW more sorts of these things in that countrys...",
            "score": 7,
            "author": "TonguesNeedToBeHarry",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Italian sausage? Everyone in the UK says nope.",
            "score": 6,
            "author": "CocoaMotive"
        },
        {
            "level": 0,
            "comment": "Italian sausage? Runny yolk? Dijon mustard?\n\nHow do you fuck up a scotch egg this badly? What a travesty honestly.",
            "score": 4,
            "author": "karl_w_w"
        },
        {
            "level": 0,
            "comment": "My husband has become an expert in making these. \n\nTips according to him: use 1/4 of sausage per egg. Local sausage is best.\n\nTo get the runny yoke, make sure the water is boiling before you add the eggs, boil for 5 min. Then, immediately put in the ice bath. (It stops the egg from cooking.)\n\nAlso, we don't put Dijon mustard in the sausage mix. We make honey mustard from scratch as a dipping sauce at the end. God's food!",
            "score": 8,
            "author": "Terminus_terror",
            "replies": [
                {
                    "level": 1,
                    "comment": "5 is my timing, too, and I use the jumbo eggs. Sounds like you do your eggs the way the gif does! The mustard really is a nice addition, you should try it. Horseradish mustard is good, too.",
                    "score": 3,
                    "author": "TheLadyEve"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is the saran-wrap really necessary? Cut down on plastic where you can!",
            "score": 2,
            "author": "_esme_"
        },
        {
            "level": 0,
            "comment": "Love that yolk double take",
            "score": 2,
            "author": "CormacZissou"
        },
        {
            "level": 0,
            "comment": "Definitely saving this one!",
            "score": 2,
            "author": "Felteezy"
        },
        {
            "level": 0,
            "comment": "I remember that time they made them on cutthroat kitchen. I’ve always wanted to try them.",
            "score": 2,
            "author": "Zimms",
            "replies": [
                {
                    "level": 1,
                    "comment": "I loved that show, even though sometimes the sabotages were so ludicrous that it made me uncomfortable to watch.",
                    "score": 3,
                    "author": "TheLadyEve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know! They were crazy sometimes but it was always fun to watch.",
                            "score": 2,
                            "author": "Zimms"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God I love scotch eggs",
            "score": 2,
            "author": "thesalzereffect"
        },
        {
            "level": 0,
            "comment": "These are one of my favorite things to eat, but I prefer the mustard(spicy) to dip them in and a hard boiled egg instead.\n\nSo damn good.",
            "score": 2,
            "author": "ZombieSiayer84"
        },
        {
            "level": 0,
            "comment": "Holy fuck they look so good",
            "score": 2,
            "author": "Khan-Don-Trump"
        },
        {
            "level": 0,
            "comment": "imagine putting that much effort into something you could eat in a single bite.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Are these really able to be reheated later and still have a runny yolk? \n\nThese sound delicious, but I'm suspicious...\n\nDeliciously suspicious...",
            "score": 2,
            "author": "SecretpauseAsianMan"
        },
        {
            "level": 0,
            "comment": "\n\nI’m upset about the runny yolk.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I very rarely think Italian sausage is not the best idea, except for when chorizo is the best idea.\n\nUse chorizo. It makes a completely sublime thing, such as scotch eggs, just silly good.",
            "score": 2,
            "author": "pnmartini"
        },
        {
            "level": 0,
            "comment": "Italian sausage for Scotch Eggs? Meh...",
            "score": 2,
            "author": "Doktor_Flim_Flam"
        },
        {
            "level": 0,
            "comment": "Scotch egg. Uses Italian sausage.\n\nErm....",
            "score": 2,
            "author": "Porthos1981"
        },
        {
            "level": 0,
            "comment": "Although the recipe calls for \"fresh eggs\", using eggs that are 1-2 weeks old will work just as well, but the eggs will be much easier to peel.",
            "score": 2,
            "author": "-ayli-",
            "replies": []
        }
    ]
}