{
    "id": "ezbfi9",
    "score": 21556,
    "title": "Pan-Fried Garlic Butter Steak With Crispy Potatoes And Asparagus",
    "author": "morganeisenberg",
    "date": 1580917563.0,
    "url": "https://www.reddit.com/r/GifRecipes/comments/ezbfi9",
    "media_urls": [
        "https://gfycat.com/happygoluckymarriedadouri"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Please post your recipe comment in reply to me, all other replies will be removed. Posts without recipes will be removed. Don't forget to flair your post!\n\n##**Recipe Comment is under this comment, click to expand**\n\n##**↓****↓****↓**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GifRecipes) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I usually use a lot less oil since the meat itself will release some. Is there an advantage to oiling it up like in the video?",
            "score": 766,
            "author": "gcruzatto",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for the delay! I thought I already answered this one but I must have missed it.\n\n# Why all the oil? I'll tell ya!\n\nFirst things first, there is actually less oil used than there appears to be in the video. It's a lighting thing from overhead. HOWEVER, there is still more oil than you probably are used to cooking your steaks in. Here's why--\n\nIf you want a steak that tastes like it was cooked at a fancy restaurant, the secret is fat. Reason 1) Extra fat = extra flavor. People have no idea how much butter and oil is used in your average restaurant dish, but it's a lot. Fat and lots of salt are basically the two reasons why everything tastes so good when you eat out vs. when you try to make a dish at home.\n\nReason 2) The extra oil also results in a better seared crust. Basically, you're distributing the heat so that it even goes up into the nooks and crannies, or parts that are raised up a bit when you have the steak \"contacting\" the bottom of the pan. Because remember, no matter how even your steak looks, there will be some parts that are slightly thicker or thinner. Especially after the steak starts to cook. \n\nReason 3) It prevents burning and sticking. Have you ever tried to make a steak in a cast iron skillet, put a tiny bit of oil in, got that baby smoking hot, and then had your steak basically cement itself to the pan once you added it? Then when you try to flip, you've ripped off the part of the steak that would have been the crust, and it's now sitting at the bottom of your pan, doing nothing but burning? If so, this prevents that.\n\nReason 4) The oil prevents the butter from burning during the beginning of the basting step. Because the cast iron skillet retains heat, it will still be pretty hot after you turn the heat down. Add your butter and it will burn immediately. Again, the oil serves as a sort of barrier here between the newly added butter and the cast iron.\n\nReason 5) You need additional oil for the frying of the potatoes and cooking of the asparagus anyway.\n\nAnd yeah, that's about it. You can use less, but you'll have better results if you don't try to skimp.",
                    "score": 212,
                    "author": "morganeisenberg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't know any of the reasons and just went with your recipe, it was FANTASTIC, thank you we really enjoyed it.",
                            "score": 54,
                            "author": "vincentpryde"
                        },
                        {
                            "level": 2,
                            "comment": "Couldn't find a single thing I disagreed with here, especially the crust part and the preventing butter from burning part. Thanks man, I look forward to seeing more of your videos!",
                            "score": 25,
                            "author": "HamBurglary12"
                        },
                        {
                            "level": 2,
                            "comment": "I agree with everything except 3. If you’ve properly setup your cast iron it’s nonstick by default, and the only time meat sticks is if you try to move it too quickly. The meat should release from the cast iron on its own, if it doesn’t you haven’t properly conditioned your cast iron.",
                            "score": 6,
                            "author": "DYC85"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, I’d like to know this. I try to cook with as little oil as possible and this seemed like a shocking amount to me. Looks so good though!",
                    "score": 373,
                    "author": "kennamay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I find using more oil gives me a little more 'wiggle room' when it comes to temperature control, as the oil can act as an insulator against hot spots on the pan. I think if youre using cast iron though the pan insulates plenty well enough already, so :shrug:",
                            "score": 242,
                            "author": "Sanctussaevio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "r/FatEqualsFlavor",
                                    "score": 104,
                                    "author": "Round_Rock_Johnson"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dry cast iron pans at high heat are kind of unhappy.",
                            "score": 200,
                            "author": "spidermonkey12345",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "BIG SMOKE",
                                    "score": 165,
                                    "author": "BabiesSmell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "TWO NUMBA NINES",
                                            "score": 34,
                                            "author": "pookachee"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It’s a French technique known as deep fat jiggle-piggle frying. It’s best used when you’re already unattractive.",
                            "score": 61,
                            "author": "NewToTravelling"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 25,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A moderate amount of pan lotion is all ya need. Enough to coat, not to pool, because you're adding butter later and the meat release plenty of juices. This'll just ruin thlse potatoes later, i'd think.",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bon Appetit’s Test Kitchen recommends just putting a coating of oil on the meat itself and relying on the butter for basting. It’s going to create much less smoke if it doesn’t completely coat the pan, and be way less likely to set off the fire alarms of the average home cook.",
                                            "score": 19,
                                            "author": "insidethebox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Kenji recommends are least a 1/4 cup of oil.  Seems like a lot to me but His stuff is usually backed by solid science.  In my experience I haven’t noticed much of a difference in the end product regardless of how much oil I use.",
                                                    "score": 14,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’ve done it every which way, and while I love Kenji, the most applicable part of BA’s recommendation is that not everyone has a draft fan on their oven. If they don’t, less oil is better. Also, I would rather have my steak basted in butter rather than a cheap neutral oil, but that’s just me. The biggest difference I notice is what the drippings turn out to be. If you’re just dumping the fond down the drain or whatever, sure, but if you minimize your oil and rely on butter for basting, you get more flavor and more useful drippings should you choose to make a sauce afterwards. Like deglaze with some red wine and drop some mushrooms in there and thicken it up, or a Boeuf Au Poivre.",
                                                            "score": 12,
                                                            "author": "insidethebox",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Why would the oil ruin the potatoes? Just... don't serve them in a cup of oil. Same way people deep fry stuff and it ends up crispy, not soggy... and this is even less oil. This is proper cooking. Especially for potatoes which need a lot of oil for a crisp.",
                                            "score": 24,
                                            "author": "oldcarfreddy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Deep frying works the way it does bc its a lot of oil.  As opposed to a shallow fry, which this is more akin to.\n\nDropping taters into a large vat of hot oil will not be enough to drop the temp significantly.  If the temp drops too much the taters will absorb it.  If it remains hot enough, the water in the taters into steam.  While the steam escapes, it prevents oil from entering.\n\nIf its just a coating of oil in a pan, theres not much to be absorbed.  With a lot of hot oil, it remains hot enough to stave off absorption.\n\nAlso, these taters aren't coated in anything.  There is no barrier.  They're \nsoft and fluffy.  You're gonna get a lot more oil with this method compared to others.",
                                                    "score": 9,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was what I noticed tbh, that seemed like a *lot* of oil.",
                    "score": 94,
                    "author": "duaneap",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's a \"cheat\" if you use a lot of oil it becomes a shallow fry and if you do that its a lot easier to get a crust to form.  A lot of places without access to a salamander use this trick build a thicker crust.",
                            "score": 51,
                            "author": "laststance",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Though I've never tried it I think I'll stick to beef steak vs salamander steak. Just my opinion though.",
                                    "score": 43,
                                    "author": "ZootZephyr",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; salamander \n\nSo, fun fact I learned watching the Townsends youtube! A salamander used to be a piece of hot flat steel/iron you could set above something that was cooking in order to brown it. Think macaroni and cheese with a nice browned top.\n\nApparently there are industrial machines that do that now, which I did not know about.\n\nPretty neat!",
                                    "score": 7,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So cool to see Townsend's mentioned here! I love that channel. Bringing you back to the flavors and aromas of the 18th century!",
                                            "score": 4,
                                            "author": "IsomDart",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*USA has entered the chat*",
                            "score": 95,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "U.S.A.: just came to deliver some Freedom^TM",
                                    "score": 33,
                                    "author": "TitsMickey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sponsored by Chase Bank",
                                            "score": 9,
                                            "author": "EsCaRg0t"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Once my sister in law cooked a steak in worchestershire sauce... a whole bottle.... needless to say it was bad",
                            "score": 18,
                            "author": "BabybearPrincess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like a little bit of Worcestershire can go a long way, but a whole bottle? That shit isnt cheap",
                                    "score": 14,
                                    "author": "Jucoy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well i wasnt really worried for the cost it was kinda cheapish but that was the dryest most well done and salty steak ever. My DOGS didnt even want it",
                                            "score": 14,
                                            "author": "BabybearPrincess",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's close to how my grandfather cooked his. \n* Take a nice 1\"-1.5\" thick steak\n* Black pepper and salt\n* A whole stick of butter on top\n* Thick chop onions, garlic and bell peppers\n* 1 cup worchestershire (Lee and Perrins)\n* Foil and broil\n\nTo be fair, when i was a kid it was delicious. Knowing what i know now, it wouldnt be my go to but its still delicious.\n\nToo much worsh and it'd be ruined though.",
                                                    "score": 5,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This recipe is more garlic oil than garlic butter",
                    "score": 64,
                    "author": "SoulLover33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. Not all the oil that bothers me so much, though it seems unnecessary. But if you use that much oil, I’d drain that off before adding the butter.",
                            "score": 32,
                            "author": "grpfrtlg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some. The oil helps stop the butter burning.",
                                    "score": 21,
                                    "author": "Capt_Hawkeye_Pierce",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Oil is cheap and it does a good job of getting a sear/crust. Unless you serve it with a cup of oil afterwards it's a correct way to pan-fry something effectively and with a great maillard reaction crust. If you don't think restaurants are using this much oil to pan-sear meats, you'll be surprised.",
                                    "score": 6,
                                    "author": "oldcarfreddy",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In Gordan Ramsay's eyes, that's like only literally, a teaspoon of oil",
                    "score": 35,
                    "author": "Schen5s",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If you're doing the potatoes in the pan afterwards you're going to need that oil anyway.",
                    "score": 70,
                    "author": "Patrick_McGroin",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 58,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I used to try to use less but my house smoked to all shit every time. So I use a little more oil now.",
                            "score": 23,
                            "author": "Z0idberg_MD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This has to be my issue.  We try to use as little oil as possible, but get tons of smoke when we cook.  Guess it's time to start adding some more.",
                                    "score": 14,
                                    "author": "elessarjd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Avocado oil doesn't smoke as much, I used it to shallow fry some chicken schnitzel. The only problem is its more expensive per L.",
                                            "score": 5,
                                            "author": "Throwaway-tan",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The oil creates a thermal bridge which helps to evenly transfer heat to the steak. They're using a lot of oil to absorb the garlic flavor and coat the steak in it. Also the potatoes will absorb a good amount of that oil, and you still want enough to fry the asparagus in.",
                    "score": 14,
                    "author": "dilipi"
                },
                {
                    "level": 1,
                    "comment": "i use that much oil. America's Test Kitchen did a great video on it.\n\nhttps://www.youtube.com/watch?v=uLWsEg1LmaE",
                    "score": 16,
                    "author": "shamblingman"
                },
                {
                    "level": 1,
                    "comment": "Only a guess but the oil keeps the meat from sticking to the pan and also helps with the sear. If you’re waiting too long to create a nice crust then you risk over cooking the steak",
                    "score": 28,
                    "author": "Granadafan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If the pan is hot enough it shouldn't stick much at all with a cut as fatty as a ribeye. I imagine the oil is meant to brown the meat along the sides of the cut? Either way seems like a lot of oil for a fatty steak cut you're going to toss in with butter.",
                            "score": 10,
                            "author": "verschee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well the seasonings can burn and stick to the pan and steak at the same time",
                                    "score": 10,
                                    "author": "BabybearPrincess",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True, those pepper corns would pop around like corn kernels.",
                                            "score": 3,
                                            "author": "verschee"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's cast iron. If you season it properly you can fry eggs in it",
                            "score": 23,
                            "author": "dagger403",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Everyone always says that and I've never seen a successful attempt.\n\nEdit: Stop replying you can do it fine but you add butter. You can fry an egg on a smoothed rock with butter. It's not an accomplishment.",
                                    "score": 35,
                                    "author": "BabiesSmell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Visit r/castiron there plenty of that. I myself use my cast iron for everything.",
                                            "score": 11,
                                            "author": "DeaDHippY",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Plenty of people saying it, or plenty of people actually posting videos of it working for them multiple times in succession?",
                                                    "score": 6,
                                                    "author": "WhiskyTangoFlyer",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Use the search function at the top and look up fried eggs there’s plenty there",
                                                            "score": 4,
                                                            "author": "DeaDHippY"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I use a drizzle of oil. I used to have a video of me pancake-tossing an egg but I can't find it, so here's [my images of eggs that are on a pan](https://imgur.com/a/8V7N9mg). The first you can see is pulling up around the edges very nicely.\n\n...And the last is a 3\" skillet I got as a gimmick. Failed to flip. I also no longer cook scrambled eggs in my skillets because they crust up and have fucked me over several times. On the flip side, I have no problems cooking an omelette in one.\n\nBought the #8 pans for $5 at a flea market, stripped, and reseasoned myself a few times. r/castiron is great.",
                                            "score": 6,
                                            "author": "Shortsonfire79"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Less oil and get the pan screaming hot. \n\nFlipping it 50 times is ridiculous. The meat will release naturally when it's time to flip it. You should only have to flip it once.",
                    "score": 38,
                    "author": "JARL_OF_DETROIT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.seriouseats.com/2013/07/the-food-lab-flip-your-steaks-and-burgers-multiple-times-for-better-results.html",
                            "score": 157,
                            "author": "lashiel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, TIL.",
                                    "score": 53,
                                    "author": "rly_not_what_I_said",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you for this, I'm saving it for the next time a doofus who can't cook a Hot Pocket comes offering me advice when they see me flip the meat more than once.",
                                    "score": 18,
                                    "author": "HaYuFlyDisTang"
                                },
                                {
                                    "level": 3,
                                    "comment": "Test kitchen also supports many flips as well. No chance of harming optimal outcome but can prevent negative things from happening.",
                                    "score": 3,
                                    "author": "Z0idberg_MD"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What kind of oil do you use?  I have a tough time getting it hot enough without filling my place up with smoke.",
                            "score": 11,
                            "author": "PecDeck",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Grapeseed oil is amazing for steak",
                                    "score": 19,
                                    "author": "CrazyTillItHurts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely! High smoke point and one of the healthiest oils too (low saturated fat, high in vitamin E).",
                                            "score": 5,
                                            "author": "Stev_k"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Definitely don't use olive oil. Other neutral oils like canola or vegetable or sunflower are best.",
                                    "score": 41,
                                    "author": "WowkoWork",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "5W30 does the trick",
                                    "score": 5,
                                    "author": "HaYuFlyDisTang"
                                },
                                {
                                    "level": 3,
                                    "comment": "I use Avocado oil that has high smoke point (&gt;500F).  But still, if you want a really good sear you can’t avoid the smoke.  Even with Avo oil my pan smokes a shit ton because I get it as hot as possible.  Open your windows and unplug/cover your smoke alarm until you’re done.",
                                    "score": 8,
                                    "author": "kkambos",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Clarified butter is incredible. By removing the milk ~~fats~~ solids from the butter you raise the smoke point, and it tastes brilliant....",
                                    "score": 6,
                                    "author": "splash_one",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is way too much oil. You should be oiling the steak after the salt and pepper, not letting it swim in the pan.",
                    "score": 7,
                    "author": "invalid_litter_dpt",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I worked in restaurants when this was a fad, it's the stupidest thing on the planet, shoveling hot fat over a piece of meat and pretending it's 'classier' or healthier than dropping it in the deep fryer.",
                    "score": 9,
                    "author": "AndySipherBull",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You have to use a pan because of the butter and herbs. You can't deep fry in butter.",
                            "score": 14,
                            "author": "kit_kat_jam",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That right there is my absolutely perfect dinner, the one I'd order as my last meal before being executed.",
            "score": 151,
            "author": "The_Original_Gronkie",
            "replies": [
                {
                    "level": 1,
                    "comment": "All you have to do is commit a heinous crime and this steak could be yours! :P",
                    "score": 90,
                    "author": "morganeisenberg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cool the steak for him and he can just kill you. Then have another before he’s executed for it.",
                            "score": 8,
                            "author": "skepticalbob",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sub Mac n cheese for the potatoes and I’d agree haha",
                    "score": 12,
                    "author": "dat_grue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No sub only add",
                            "score": 10,
                            "author": "jerstud56"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crispy potatoes are one of my favorite sides, and these look delicious!",
            "score": 137,
            "author": "hello_planet",
            "replies": [
                {
                    "level": 1,
                    "comment": "SAME. I'm powerless against the potato, especially crispy ones. And thank you!",
                    "score": 59,
                    "author": "morganeisenberg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 337,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm the opposite.  Always had meat in my life, found vegan cooking videos and they're absolutely fascinating.  I still don't know what a jack fruit it, but you can use it for everything.",
                    "score": 166,
                    "author": "fallinouttadabox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Breaded/Fried Jack Fruit is amazing. You don't even need a sauce for it. I'm not a vegan, so I didn't it was a mainstay in vegan cooking.",
                            "score": 28,
                            "author": "TheRiteGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://gfycat.com/SpiritedFortunateGreendarnerdragonfly\n\nThis is the gif that got me hooked on vegan cooking videos",
                                    "score": 25,
                                    "author": "fallinouttadabox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm from Sri Lanka and back home, having a Jack fruit tree in your back yard isn't uncommon. It's pretty cool that I can now find a jackfruit at most Shoprights, etc.\n\n \nWe often use it as a curry when unripe because it has a more meaty texture and is slightly more sour. We call it [Polos](https://www.islandsmile.org/sri-lankan-green-jack-fruit-curry-polos/). When its ripe,like in the video above we eat it raw, because it's very sweet. I have no idea how it would taste with bbq sauce on it but it's more of a desert in that stage of its life. That said its cool to see how it's being changed and modified into crazy new  combinations. If you haven't tried it, please give it a shot if you come across some!",
                                            "score": 15,
                                            "author": "dr-carrot",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My biggest issue with this recipe is that, to my knowledge, jackfruit has no protein so aren't you just eating a carb sandwich with a bit of 'slaw on it?",
                                            "score": 5,
                                            "author": "ArrogantWorlock",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No idea. Never even seen one in person, I just like watching the videos",
                                                    "score": 3,
                                                    "author": "fallinouttadabox"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Jackfruit is so fuckin weird... I’m vegetarian and still have yet to try it haha.",
                                            "score": 3,
                                            "author": "VonMillerQBKiller"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I recently found out how versatile quinoa is and have been using it in a lot of dishes, planning on doing some veggie burgers tonight with quinoa and black bean patties",
                            "score": 5,
                            "author": "abe_the_babe_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whats the story on the Octagon pan?  Ive seen it in a few posts recently.  Any tangible benefits you are going for here or just a good pan with a unique look?",
            "score": 25,
            "author": "Epic_Deuce",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a Finex cast iron skillet! It's a really great skillet-- evenly heats and retains heat well, makes it easy to pour off excess grease due to the corners acting like little spouts, and my personal favorite part is that the surface is pretty smooth (not pebbly like most cast iron) so stuff doesn't stick. It's so easy to clean. I'm in love with mine.  \n\nSo I'd say the top 2 reasons are that it's beautiful and also just generally really effective, but it's not a \"must\" over a different cast iron skillet. \n\n[This](https://www.kitchenkapers.com/products/finex-cast-iron-skillet-with-lid) is the one I have, but I don't own the lid. I got mine for free from a vendor event. At the time I wouldn't have purchased it (they are expensive and I'm not someone who splurges on cookware usually) but now that I know how much I love mine, I would.",
                    "score": 35,
                    "author": "morganeisenberg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "$250 for a 10 inch skillet! Ouch!",
                            "score": 13,
                            "author": "KeathleyWR",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For $250 it better do the MF cooking itself",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I dont have any complaints with my normie circular pan, but this does look pretty nice, and easy to clean is always an underrated plus.",
                            "score": 3,
                            "author": "Epic_Deuce"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it’s just the later. It’s a Finex brand skillet, high quality and made in the USA.",
                    "score": 7,
                    "author": "coopachris"
                }
            ]
        },
        {
            "level": 0,
            "comment": " You might recognize this recipe-- I posted it about a year ago, but had it weirdly sped up because I didn't know how to upload longer gifs yet. With Valentine's Day coming up, I decided it would be a good time to upload the not-ridiculously-fast version. This method of making steak is my go-to! So easy and really amazingly delicious. That being said, I'm also going to be experimenting with sous vide steak later this week, so I'm excited to see if that method will become my new favorite, or if this pan-fried garlic butter steak will still reign as champion.\n\n**ANYWAY, Here's the recipe, from** [https://hostthetoast.com/pan-fried-garlic-butter-steak-with-crispy-potatoes-and-asparagus/](https://hostthetoast.com/pan-fried-garlic-butter-steak-with-crispy-potatoes-and-asparagus/) (**more details there on ingredients + method, if you're interested!)**\n\nINGREDIENTS\n\n* 1 pound small potatoes, halved\n* 1 (1.5”-2” thick) ribeye steak\n* Kosher salt and freshly ground black pepper\n* 3 tablespoons vegetable oil\n* 4 tablespoons butter\n* 2 sprigs rosemary\n* 2 sprigs thyme\n* 8 cloves garlic, peeled\n* 8 ounces fresh asparagus, trimmed\n\nINSTRUCTIONS\n\n1. Add the potatoes to a medium-sized pot and cover with water. Bring to a boil, reduce to a simmer, and continue to cook until the potatoes are tender, about 6-8 minutes. Drain the potatoes and set aside.\n2. Season the steak generously all over with salt and pepper. Heat the oil in a large cast iron skillet over high heat until beginning to smoke. Add the steak to the skillet and cook, flipping every 30 seconds or so for a total of 4 minutes, or until a brown crust forms. Sear the sides as well.\n3. Reduce the heat to medium and add the butter, garlic, and herb sprigs. Once the butter has melted, tilt the pan slightly so that the butter collects by the handle and use a spoon to splash the steak with the hot butter. Continue to baste, flipping the steak occasionally, until a thermometer inserted into the thickest part of the steak registers 120-125°F for medium rare, or 125-130°F for medium (about 3-4 more minutes). Set the steak aside to rest.\n4. Meanwhile, place the potatoes back into the skillet, cut-side-down. Make space for asparagus in the center of the skillet and add it. Cook, tossing the asparagus occasionally (but leaving the potatoes undisturbed) until the asparagus is just tender, about 6 minutes. Remove the asparagus and set aside on a serving plate. Continue to cook the potatoes until golden, about 2 more minutes. Set aside with the asparagus.\n5. Slice the steak, if desired, and serve with the potatoes and asparagus.\n\n**Full Recipe &amp; Details:** [https://hostthetoast.com/pan-fried-garlic-butter-steak-with-crispy-potatoes-and-asparagus/](https://hostthetoast.com/pan-fried-garlic-butter-steak-with-crispy-potatoes-and-asparagus/)\n\n**Facebook:** [http://facebook.com/hostthetoast](http://facebook.com/hostthetoast)\n\n**Instagram:** [http://instagram.com/hostthetoast](http://instagram.com/hostthetoast)\n\n**x-posted from** r/Morganeisenberg",
            "score": 159,
            "author": "morganeisenberg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Saw this a year ago when you first posted. Made it. Absolutely delicious. Thank you!\n\nOnly difference is that I steamed my potatoes instead of boiling them.",
                    "score": 28,
                    "author": "binoculops",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah I'm so glad you liked it! :) Thank you for letting me know!!",
                            "score": 12,
                            "author": "morganeisenberg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Loved it! Ended up making it many several times too.  \n\nAlso your chicken tikka masala recipe is awesome, too. I’ve made that several times as well. Cheers!",
                                    "score": 6,
                                    "author": "binoculops",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aw thank you :)",
                                            "score": 6,
                                            "author": "morganeisenberg",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You’re very welcome and thank you for the delicious recipes!",
                                                    "score": 2,
                                                    "author": "binoculops"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Looks great but I wish you would have seared the sides of the steak.\n\nEdit: you DID sear the sides!",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ah I know!! I did actually sear the sides (you probably can see at the end of the video that it's browned all around), but unfortunately I did not get it on video. I changed angles and the footage wound up not being usable when I looked back on it later because it was out of focus, so I had to cut it out :( I did write to do it in the written recipe though!",
                                            "score": 12,
                                            "author": "morganeisenberg"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Maybe the gif doesn’t show it but the sides are seared. Plus at the end of step 2 in the recipe she said to sear the sides. Looks delicious",
                                            "score": 2,
                                            "author": "Granadafan",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; flipping every 30 seconds or so\n\nSome people will come here and say DONT TOUCH IT, but flipping it frequently is the way to go.",
                    "score": 49,
                    "author": "porquejorge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha I reposted this recipe on facebook the other day and you should have seen how LIVID some people got at the \"flip frequently\" part. I actually had to delete some comments and block people from the page because they full on lost their shit after I nicely explained why and how it worked.\n\nThis is coming from someone who regularly posts to reddit and is very used to people trolling / being jerks sometimes, lol",
                            "score": 74,
                            "author": "morganeisenberg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People get really angry about the weirdest things",
                                    "score": 9,
                                    "author": "7-SE7EN-7",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Could you explain how it works? I was always told the more you flip the tougher the meat becomes. Also is it better for thick steaks or does it work for thinner steaks too?",
                                    "score": 19,
                                    "author": "HandlesofLiquor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "flipping frequently results in more even cooking as the other side cools down which helps to get a good sear without overcooking the outer layer.",
                                            "score": 34,
                                            "author": "kdk-macabre",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow! I have always cooked with the “don’t touch it” mindset. I don’t even know where I picked it up but it somehow got *seared* into my mind. Going to have to try it out tonight :) Thanks for the info.",
                                                    "score": 19,
                                                    "author": "redditnsuch",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you are interested in reading material. Kenji from Serious Eats went over this pretty in depth in this article: https://www.seriouseats.com/2013/07/the-food-lab-flip-your-steaks-and-burgers-multiple-times-for-better-results.html",
                                                            "score": 19,
                                                            "author": "Jemikwa",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If you salt the top layer for some time it breaks it down the meat so that the steak would cook evenly and become more tender.  I also like how the oils from the garlic move it's way in between the fibers.  I personally keep flips minimal but that's because I know my own timing.  I wouldn't begrudge anyone on their process as long as the result is good.",
                                                    "score": 4,
                                                    "author": "mrmamation",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Kanji has a fantastic breakdown of when to salt your steak and for how long. Super interesting if you haven’t seen it yet. \n\nhttps://www.seriouseats.com/2011/03/the-food-lab-more-tips-for-perfect-steaks.html",
                                                            "score": 3,
                                                            "author": "mathliability",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Flipping often will encourage even browning without allowing one side to cool too much as the other sears. It works for all steaks (and burgers!)",
                                            "score": 17,
                                            "author": "morganeisenberg",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I watch Gordon Ramsay a lot and in a steak video he said the thing about only flipping it once... Has my life been a lie",
                                                    "score": 5,
                                                    "author": "orokami11",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He actually posted a more recent video and he uses the constant flipping technique so his life was a lie too",
                                                            "score": 17,
                                                            "author": "BootyFista",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He posted a video in 2012 recommending flipping every minute\n\nhttps://youtu.be/AmC9SmCBUj4",
                                                                    "score": 3,
                                                                    "author": "duelingdelbene"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Even if I wanted to complain about your technique the steak looked almost perfect when you cut it at the end anyways so they must've ignored that part",
                                    "score": 5,
                                    "author": "doublethumbdude",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "People are so dumb sometimes. The butter-baste method has been around for years.",
                                    "score": 8,
                                    "author": "DietCokeYummie"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah Gordon Ramsey has 2 steak videos, one he says flip it constantly and one he says flip once. It’s confusing.",
                            "score": 4,
                            "author": "eykei"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, otherwise it comes out this weird grey color on the outside. Nice on the inside, but the outside isnt very appealing if you only flip once using the basting method",
                            "score": 4,
                            "author": "Wolfcolaholic"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What kind of oil did you use?\n\nScratch that. I'm an idiot it's right there",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I made this last Valentine’s Day and my wife and I both loved it! Going to make it again this year.",
                    "score": 4,
                    "author": "DancingChristmasElvs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's awesome! I'm so glad to hear it!! :)",
                            "score": 2,
                            "author": "morganeisenberg"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like making steaks this way, but the smoke from the butter becomes unbearable. Any tips?",
                    "score": 4,
                    "author": "tuxedocatspemma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Use oil first so you get a sear without smoking, then reduce the heat before adding the butter. You still will get some smoking due to the residual heat of the pan but not as much. Also, just make sure you open the windows. My current place is low on well-ventilated space so every time I cook with high heat, I open the kitchen windows and place a big box fan facing outward in one to prevent the kitchen from smoking up.",
                            "score": 12,
                            "author": "morganeisenberg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I cook steaks this way as well. I use peanut oil, which supposedly has a pretty high smoke point.\n\nMy fire alarm always goes off.\n\nThe place fills with smoke every time and by the end the oil is pretty darkened. I have always read that I should get the pan as hot as possible... Should I be lowering it sooner?\n\nIn the gif your steak was apparently cooked as soon as you got a good crust, but my crusts get a lot thicker and darker (but not overly so; still very tasty steaks) before they're cooked through. And the steaks I use aren't as thick as this one! What am I doing wrong here? How high do you put the element and how often do you change it?",
                                    "score": 3,
                                    "author": "coolRedditUser",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have this same problem, and while the smoke from the initial searing is pretty thick, you can turn down the heat before adding butter/garlic and it won't burn or smoke as much.",
                            "score": 2,
                            "author": "WeenisWrinkle"
                        },
                        {
                            "level": 2,
                            "comment": "I mentioned this is a different string before noticing this. Separate your butter to make clarified butter. Its the milk fats that burn and smoke, if you remove those, you’re golden.",
                            "score": 2,
                            "author": "splash_one"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would love to see your version of this done with sous vide. My husband won't cook steak any other way now.",
                    "score": 5,
                    "author": "speedycat2014",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If I get good results when I test, I'll definitely make a video and share here! I'm pretty excited to give sous vide a go. I got a new pressure cooker / slow cooker / rice cooker / sous vide machine over the holidays so it's the perfect excuse to finally test it out!",
                            "score": 8,
                            "author": "morganeisenberg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's like voodoo, the steak is so perfectly, evenly cooked it's almost unnatural. Can't wait to see your recipes with that method. I just love your videos.",
                                    "score": 5,
                                    "author": "speedycat2014"
                                },
                                {
                                    "level": 3,
                                    "comment": "Question. your steak came out how I like it, nice and rare. Yours was cooked for 4 minutes plus basting time. If you did the sous vide and then seared, wouldn’t the steak come out over cooked beyond what is desired?",
                                    "score": 2,
                                    "author": "Granadafan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is definitely something that I plan to test, and one of my concerns! There are a lot of different methods out there to get a good sear on your steak that supposedly don't change the \"doneness\", but I personally am not sure what way will be best when using the sous vide method.",
                                            "score": 3,
                                            "author": "morganeisenberg"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Doesn't need four minutes to sear. Sous vide for like 60-90 minutes, then sear for maybe two minutes total in a pan that is literally as hot as it can get. Then the fond, just take the pan off the heat completely rather than lower.",
                                            "score": 2,
                                            "author": "sinkwiththeship"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "1. That's not rare\n\n2. Of course, since it's already internally ~50° above room temp before adding it to the pan.. When you sous vide and then sear you're looking at about 60s/side in hot cast iron. You also wouldn't cook sous vide to quite your desired internal temp with the expectation it will continue cooking in the pan and during the rest.",
                                            "score": 2,
                                            "author": "thesandsofrhyme"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sous vide is great and reliable, especially if you're working with larger batches. The only drawback is that you wont get as hard of a sear on a sous vide steak.",
                            "score": 3,
                            "author": "kdk-macabre"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice to see the multi flip method, I love reverse sear but this is the best way to get a great crust on a thick steak",
            "score": 57,
            "author": "rabbifuente",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree, I've yet to find a better way! I always get a much more even crust with the multi-flip than anything else.",
                    "score": 25,
                    "author": "morganeisenberg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's funny watching older chef videos of flipping once and then the same chef years later praising constant flip with their updated clips",
                            "score": 21,
                            "author": "Ezzy17",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Examples?",
                                    "score": 3,
                                    "author": "billythesid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gordon ramsay cooking shows years ago did one flip, his most recent he does the constant flip",
                                            "score": 11,
                                            "author": "Ezzy17",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "After spending all day at work yesterday trying to find steak deals to seeing this first thing in the morning - welp, steak for dinner it is.\n\nLooks fantastic by the way - how often are you \"flipping frequently\", every 30s, 60s?  Definitely want to give it a shot against my normal methods.",
                            "score": 5,
                            "author": "greggosmith",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do 3 minutes a side and then a minute to a minute and a half per side depending on thickness. 3/3/1.5/1.5",
                                    "score": 4,
                                    "author": "RUB_MY_RHUBARB"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is it always kosher salt in these recipes what even is kosher salt? Is regular salt not kosher?",
            "score": 23,
            "author": "Rhys3455",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's typically coarser (larger grains) than sea salt/table salt, which tends to be very fine. The coarser grains make it easier to control the seasoning you're applying. \n\nIt also will sometimes lead to less salt, for instance if a recipe calls for 1tsp kosher salt, but then you use 1tsp fine sea salt, you're using potentially quite a bit more salt.",
                    "score": 20,
                    "author": "lashiel"
                },
                {
                    "level": 1,
                    "comment": "Kosher salt is just larger grain salt. I use it in almost all of my recipes, but by volume if you used the same amount of table salt it would be too much, so I clarify as a general rule.",
                    "score": 34,
                    "author": "morganeisenberg",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You can be more generous with kosher salt because if the larger crystals. Gives you more control/leeway when adjusting your seasoning",
                    "score": 5,
                    "author": "monkeygame7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks really good",
            "score": 9,
            "author": "emma20787",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 3,
                    "author": "morganeisenberg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks amazing. I want to ask, is it just a preference to flip it multiple times in the cooking process or is that the proper way of searing a ribeye?",
            "score": 7,
            "author": "LegendaryCoconut",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even the best set up is going to have some hot spots and unevenness, if for no other reason than that a steak is not bologna.  It's not a homogeneous mix, and fat cooks differently than muscle.  By flipping frequently, you heat more evenly, and in theory achieve a more balanced final product.\n\nFlipping gets a bad rap because inexperienced cooks flip often not to achieve evenness, but because they don't know what done looks like and they tend to cook at inappropriate temperatures.  So, the food of frequent-flippers is often bad, but it's not because flipping is bad but because the person cooking doesn't know what they're doing.",
                    "score": 20,
                    "author": "Illini88228"
                },
                {
                    "level": 1,
                    "comment": "The idea is, by flipping frequently you're giving it a bit to cool down before then blasting it with heat again. This lets you get a good sear without overcooking the upper layers.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Only reason I ever check out the comments on these steak vids is to see how many different opinions I can count on how to cook it.",
            "score": 7,
            "author": "ThatAutisticWoman",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How do you keep the steak warm while doing the sides? I always have trouble timing everything so it is warm when served",
            "score": 26,
            "author": "junk_it",
            "replies": [
                {
                    "level": 1,
                    "comment": "The steak needs to rest for like 10 minutes anyway. You can tent it with foil if you need longer. \n\nSteak shouldn't be served \"hot\" anyway its just warm'ish. It's more important IMO that the asparagus and potatoes are hot than the steak.",
                    "score": 50,
                    "author": "Awightman515",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The rest! It allows the meat to tighten up around moisture so it doesn’t bleed all over the cutting board. If you cut a steak and tons of juice is running out, you didn’t let it rest long enough and it will be drier taste. Juicy steak is way more delicious, rest your steaks people!! \n\nPS. It also allows them to continue cooking just a little to coast to the perfect temp, assuming you stoped cooking them early enough.",
                            "score": 17,
                            "author": "mavantix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I thought the opposite happened: the muscles relax after being removed from heat, creating space between the fibers for the juices to siphon in to through capillary action.",
                                    "score": 7,
                                    "author": "Sanctussaevio"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Let it rest.\n\nThe trick is, before serving, warm up a plate in the microwave and serve it on that.",
                    "score": 6,
                    "author": "squirtle43",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Good question, you don't actually want to serve steak hot. Steak is usually served at room temp to warmish and that should be achievable by letting it rest while you cook everything else.",
                    "score": 5,
                    "author": "shakkyz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welp I guess I'm eating steak today",
            "score": 6,
            "author": "JaVuMD"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've found that if I wait too long before tilting and basting, I have this problem. However, if I quickly tilt the pan (so it's not sitting on the burner) and splash the butter (so air is being introduced frequently), it prevents that issue for the most part. That being said, different stoves really are significantly different, so your pan might be getting a bit too hot or staying too hot at medium heat. Perhaps reduce the heat earlier (as you're still flipping) to allow more time for that temp to come down, or go to low instead of medium before adding the butter.",
                    "score": 3,
                    "author": "morganeisenberg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I reckon this'd be even better with baby reds.",
            "score": 4,
            "author": "IronBattleaxe"
        },
        {
            "level": 0,
            "comment": "I was taught that you should get your aromatics (garlic, rosemary, thyme here) in the oil at the same time as your steak, so they have time to flavor the oil by the time you're adding the butter and basting.\n\n\nHave you tried it both ways, but settled on adding them simultaneous with the butter - or was this the way you've always done it?\n\n\nDefinitely going to try the many flips technique next time. I was always a minimal flips guy, but your reasons are sound, so I'm definitely up for the experiment.",
            "score": 4,
            "author": "Obligatius",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my experience, adding the aromatics when solely pan-searing the steak has burnt the garlic and herbs, as the oil should be REALLY HOT to get a perfectly browned crust.",
                    "score": 5,
                    "author": "morganeisenberg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is my meal when the wife and kids are away and I have the house to myself.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If you sous vide the steak beforehand, would you still flip constantly to get the sear? Do you still baste with butter and aromatics? (I add the aromatics to the vacuum sealed bag)",
            "score": 4,
            "author": "niryas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly I'm not entirely sure how I will do it in the end, as I want to be sure to test a few different methods. As of right now, I imagine that adding the aromatics to the vacuum sealed bag, then doing the multi-flip sear and baste would be the best of both worlds, but who knows how the actual results will be after experimenting? It may turn out that the flavor of the garlic and herbs might be off when done that way, or that too much heat is introduced, effecting the internal temp of the steak... I'll have to see.",
                    "score": 2,
                    "author": "morganeisenberg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think with a steak this thick, the reverse sear method is superior. Way easier to get desired results, as it's almost impossible to overcook in a low temp oven.\n\nI often put my steak in for 40 - 60 mins, depending on the cut at about 275. Meanwhile you can get other stuff prepped, have a beer, etc. Then it's just a matter of getting the sear on the steak, which just takes two or three mins. Can also do the basting if you like as well and absolutely no danger of going past rare unless you walk away from the pan for 10 mins.\n\nEnd results are very similar, but I think ultimately the reverse sear is the best way. The other nice part about it is you can actually cook your steak right from frozen with this method.",
            "score": 4,
            "author": "Supper_Champion",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I cook all my steaks like this. I'll also add rosemary along with the garlic. I usually flip it once and once flipped I constantly baste the steak. Yum.",
            "score": 8,
            "author": "jackisbetterthanyou",
            "replies": [
                {
                    "level": 1,
                    "comment": "This has rosemary...",
                    "score": 4,
                    "author": "jmelina"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this recipe, but one thing that’s always raised questions for me is that amount of garlic. Once the recipe is done, what could I do with those cloves? That’s a lot of garlic that I don’t want to go to waste, and idk if it’s just me but I’m not too keen on eating a straight clove of garlic",
            "score": 3,
            "author": "adamjm99",
            "replies": [
                {
                    "level": 1,
                    "comment": "The garlic flavor is really tempered by the butter / cooking. It's not nearly as strong as you'd imagine. I eat the whole cloves, personally, but you could also smash and smear them with some butter and use that mixture on bread. :)",
                    "score": 8,
                    "author": "morganeisenberg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, am I crazy in that I always wait to pepper until after cooking (usually before resting)? I still salt liberally before searing, but pepper I found kept adding a weird musky taste to my food if it gets any heat.",
            "score": 3,
            "author": "Sanctussaevio",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Whenever I make this I can never taste the garlic in the steak. What am I doing wrong?",
            "score": 3,
            "author": "eleffdee",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're probably not doing anything wrong. I tend to like a stronger garlic flavor also. As a finishing step, just after taking the steak out of the pan, cut a clove of garlic in half and use tongs to rub the cut sides onto the hot, crusty surface of the steak. This will give it some extra garlic kick as it rests.",
                    "score": 3,
                    "author": "idliketofly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For a crusty crust. Pat the steak with a paper towel to absorb the moister before seasoning.",
            "score": 3,
            "author": "DeakonDuctor"
        },
        {
            "level": 0,
            "comment": "I hope this makes sense... but watching this convinces me that I'm not a vegetarian as much as watching the Halftime show (mostly Shakira) convinces me that I'm not gay.  (NOT that I needed convincing...)",
            "score": 3,
            "author": "InterruptingCow__Moo"
        },
        {
            "level": 0,
            "comment": "Call my palate shit but I can't stomach asparagus. Not in the childhood way where I didn't like it back then and thus won't try it again because I actually revisited food that I didn't like such as olives and sweet potatoes and still don't like them. \n\nWhat would be a fitting replacement? I was kinda thinking an ear of corn because when I see steak, I think summer meals because of grilling.",
            "score": 3,
            "author": "Stormray117",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can...  But a saute' pan loses heat very quickly and the heat in the pan is significantly less evenly distributed than when using cast iron.\n\nJust to say that a cast iron pan is dramatically more forgiving when cooking a steak.  \n\nPlus a properly seasoned cast iron pan just makes everything taste better the longer you have it.\n\nHonestly, if you have about 40 bucks or so, buying and learning how to take care of a cast iron pan is something that will make your meals so much better.  It's worth the investment in time, energy (taking care of a cast iron is more intensive than a dishwasher safe saute' pan), and money.\n\nIf I could go back in time and talk to me younger self, I would make sure one of the lessons would be to get and learn how to use a cast iron pan.\n\nYou won't regret it, my dude.",
                    "score": 3,
                    "author": "Carp8DM",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a waste of garlic slice it up and use 1/8th the amount for same effect.",
            "score": 3,
            "author": "Ella310818"
        },
        {
            "level": 0,
            "comment": "A week's worth of sodium in one bite!\n\nLooks great though",
            "score": 8,
            "author": "SamCarter_SGC",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Can you do this with less oil? i mean, ribeye has a lot of grease, and then you put butter. You can cook this in a somewhat healthy manner. But i think the crust of the beef would not be the same.",
            "score": 6,
            "author": "cheq",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes you can use a bit less. This video actually makes it look like I used more than I did-- it's always the case with overhead video and I have no idea why, probably a lighting thing-- but you still can reduce it. As long as you've got a very thin layer of oil to pan-fry, you're good.",
                    "score": 8,
                    "author": "morganeisenberg"
                },
                {
                    "level": 1,
                    "comment": "You definitely can",
                    "score": 2,
                    "author": "duaneap"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mesmerizing",
            "score": 2,
            "author": "jekksy"
        },
        {
            "level": 0,
            "comment": "Tagging for later",
            "score": 2,
            "author": "L3g3ndary-08"
        },
        {
            "level": 0,
            "comment": "Fantastic!",
            "score": 2,
            "author": "__welltheresthat__"
        },
        {
            "level": 0,
            "comment": "god damn you im hungry af now!!!!",
            "score": 2,
            "author": "rikkmode"
        },
        {
            "level": 0,
            "comment": "This is the meal I didn’t know I so desperately needed.",
            "score": 2,
            "author": "cupcakegoddess"
        },
        {
            "level": 0,
            "comment": "Feed this to your date if you want them to come back for another.",
            "score": 2,
            "author": "YourLictorAndChef"
        },
        {
            "level": 0,
            "comment": "You always post such delicious looking food. Keep up the good work!",
            "score": 2,
            "author": "onehitwondur"
        },
        {
            "level": 0,
            "comment": "Thanks now I'm gonna buy some steak.",
            "score": 2,
            "author": "BigJuicyBalls"
        },
        {
            "level": 0,
            "comment": "I just drooled on my keyboard.  YUM!",
            "score": 2,
            "author": "filingsmace"
        },
        {
            "level": 0,
            "comment": "Woah, looks delicious. Definitely gonna have to do that some time.",
            "score": 2,
            "author": "Dogiedog64"
        },
        {
            "level": 0,
            "comment": "That’s all I can think about.... baste...",
            "score": 2,
            "author": "reddityoulous"
        },
        {
            "level": 0,
            "comment": "Damn! That's a $200 cast iron pan.",
            "score": 2,
            "author": "OneManLost"
        },
        {
            "level": 0,
            "comment": "Mmmmmmmmmmm",
            "score": 2,
            "author": "chonkest-chonk"
        },
        {
            "level": 0,
            "comment": "I've always learned since youth that ideally, you flip the steak once at the most. Apart from that, this is basically how I cook all my steaks with the basting with R&amp;T",
            "score": 2,
            "author": "ALSAwareness",
            "replies": []
        }
    ]
}