{
    "id": "21v3z4",
    "score": 37,
    "title": "How I imagine the BG will introduce the new buildings after cutting teachers to pay for them.",
    "author": "[deleted]",
    "date": 1396301823.0,
    "url": "https://www.reddit.com/r/BGSU/comments/21v3z4",
    "media_urls": [
        "http://imgur.com/sGxwh9N"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Here is what the linked meme says in case it is blocked at your school/work or is unavailable for any reason:\n\n#***Timmy's Dad If I Had One***  \n\n&gt;***Post Title:***  *How I imagine the BG will introduce the new buildings after cutting teachers to pay for them.* \n\n&gt;***Top:***  *THIS IS WHERE WE'D PUT OUR FACULTY* \n\n&gt;***Bottom:***  *IF WE HAD ONE* \n\n\n\n[Original Link^1](http://imgur.com/sGxwh9N) | [Meme Template^2](http://imgur.com/memegen/create/sGxwh9N)",
            "score": 2,
            "author": "imgurtranscriber"
        },
        {
            "level": 0,
            "comment": "As someone who lives 8000 miles from campus, can you give me any more info on what they are or where they are? ",
            "score": 2,
            "author": "Chimie45",
            "replies": [
                {
                    "level": 1,
                    "comment": "Read my above comment. It's lengthy",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What exactly *ARE* the new buildings?",
            "score": 3,
            "author": "FatStratCat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eventually... \n\nNew fraternity and sorority houses. They're all being torn down this summer. New ones completed after two years. \n\nNew CBA... Education building will come down, education moves into old CBA. New CBA building goes where carillon parking lot sits.\n\nUnion expansion... Going to be expanded once the sorority houses are gone( All Greek houses will go where fraternity houses currently stand) The expansion will go back into the direction of the union parking lot. \n\nAdministration building will be demolished. This new view from across thurstin/manville into old campus will serve as the  \"entrance\" to campus and a glass walkway will be constructed over thurstin.\n\nHarshmam and kreisher will be demolished. \n\nTimeline for all this is... Or was suppose to be ~5 years, but that was when I was still there, and I graduated last May. Everything as far as I know is still on track, they're raising outside money for the CBA to pay for the building so that could be delayed depending on funding, education gets the old cba because their grads couldn't come close to rasing enough money for a new building. \n\nThe rest is really triggered by demolishing the Greek houses. Union expansion and admin removal will likely all commence when they go to tear down sorority row this summer ",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't forget they technically approved to build the geothermal plant and get rid of the natural gas plant!\n\nAlso personally I think they should revitalize Eppler to make it a normal building used for academics. Then Anderson should be revitalized as a sports medicine/environmental studies/ROTC building. I also wouldn't be surprised if the old health center gets redone or demolished, it might be graveyard in 50 years along with that parking lot for all we know.",
                            "score": 2,
                            "author": "BNLboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I forgot about the new health center, good call. \n\nEppler is a giant waste of space. \n\nThe natural gas to geothermal thing is probably more of an appeasement to the leftist environmental nuts that roam campus, they probably have no funding plan or intend to create one regarding actually making it a reality anytime soon.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think it's more of a financial security than leftist appeasement. Geothermal is the cheapest and most reliable energy source we have. Anyone can be trained to run geothermal plants and they run 24/7 unless hell freezes over (or repairs). Natural gas is traded as a commodity and the price fluctuates over time. Once a geothermal plant is in it runs for the cost of basic labor and upkeep for decades. I say basic labor because they build these plants in rural Africa and people go through a short training period to run them. No higher education or extensive training is needed!",
                                            "score": 2,
                                            "author": "BNLboy"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jesus.. I'm not sure there will be any buildings left from when I went there other than old parts of old campus and kohl. And I graduated in 2011... ",
                            "score": 2,
                            "author": "Chimie45",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Union, Eppler, CBA old building, Hayes, East Hall, Founders, Life Science, Math, Olscamp. There are plenty of buildings that will be around for the long haul. They're just using the Fraternity/Sorority housing mess to take care of other projects on their list.",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's just there have been like four new dorms, three new cafeterias built as well as the new Wolfe art building and the Stroh, along with the tearing down of the popculture building, sattlemire(sp?) the quads, the sorority houses, administration building, Commons, Anderson (is it still there?) the union remodeling..  Pretty much every building has had a major overhaul. Is the old art building still there? ",
                                            "score": 2,
                                            "author": "Chimie45",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Four new dorms? Falcon Heights and Centennial.  Which were in the process of being built when you graduated.\n\nThree new Cafeterias? Oaks (Replaced Mac Dining) and Carillon. Which were in the process of being built when you graduated.\n\nWolfe Center and the Stroh were either both there when you graduated or mostly completed. \n\nSattlemire? WTF? \n\nCommons? WTF? \n\nAnderson is still there. It's not going anywhere. \n\nThe rest of your list is planned upgrades/changes. By the time it is done you will have been out of school for a decade, so really it's not that much ",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sattlemire however it's spelled was the old student services building. A giant round building where the Wolfe center is now. Commons was right by kohl and Rogers, an all you can eat buffet for 5 dollars. Also had a sub shop and convenience store. The union cafeterias have changed I hear the computer lab and the pub are waaay different, there's like a doughnut shop or something by Mac (dunkin?) And Mac dining is gone and replaced, the steakhouse in Mac left but that was a long while ago iirc. Forget what it was even called. \n\nThe new buildings were just shells when I graduated. I've not been able to be back on campus since then either so hell if I know what's going on. ",
                                                            "score": 2,
                                                            "author": "Chimie45",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; Sattlemire however it's spelled was the old student services building\n\nI still have no idea what this is/was. I came in in fall 2009, so I don't know if that explains it away.\n\n&gt; Commons was right by kohl and Rogers, an all you can eat buffet for 5 dollars \n\nRodgers' first year closed was my freshman year, so I assume commons was closed then too. That fall (2009) was the last year for the two greek houses in front of Rodgers, all was closed and demolished during the spring/ summer 2010. Commons was part of this.\n\n&gt; The union cafeterias have changed\n\nAgain, Wendy's is no more, but this happened when you were there. The rest includes some shuffling of the restaurants and some layout tweaks to the food offered. No biggie.\n\n&gt; I hear the computer lab and the pub are waaay different, \n\nPub was redesigned. Same shitty microwaved food. Computer lab is a little bigger.\n\n&gt; there's like a doughnut shop or something by Mac (dunkin?)\n\nAdded the same time that the Oaks was. \n\n&gt; And Mac dining is gone and replaced, the steakhouse in Mac left but that was a long while ago iirc. Forget what it was even called.\n\nMac dining was gone before you graduated. Actually I think it ended right at May 2011. As for the stakehouse in Mac, I lived Mac North Ground Floor my freshman year. My window looked into that awkward courtyard and then into both mondo subs and mac dining. There was no steakhouse. So that ended at the latest in the spring of 2009.\n\n",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I had two credit hours a semester in 2011 and I studied abroad in 2009-2010. Just saying it seems so different than when I started in 2006. No necessary saying it's bad. ",
                                                                            "score": 1,
                                                                            "author": "Chimie45"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}