{
    "id": "3r12i6",
    "score": 3,
    "title": "Question about dorms",
    "author": "skrills12345",
    "date": 1446337579.0,
    "url": "https://www.reddit.com/r/BGSU/comments/3r12i6",
    "media_urls": [],
    "other_urls": [],
    "postText": "As a freshmen, how early should you pay the \"initial $200 dollar intent fee\" in order to get a good room selection? I'm not 100% set on bg, so I was wondering when the latest you could pay, and still have a decent selection. Looking for something in centennial, or offenhauer\n\nEdit: Preferring a single room",
    "comments": [
        {
            "level": 0,
            "comment": "November-December. Former tour guide here and BGSU grad. Don't count on offenhauer though. That's mostly reserved for sophomores and above.",
            "score": 5,
            "author": "TheJeffyJ",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you think like the end of November I'd be good? It seems like the most popular dorm",
                    "score": 2,
                    "author": "skrills12345",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I would say that is a good time. This past Saturday was a huge open house so I imagine a lot of students will be deciding before December.",
                            "score": 3,
                            "author": "TheJeffyJ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I was actually there on Saturday. I was looking into Computer Science and saw that they have some sort of [minor requirement](http://www.bgsu.edu/content/dam/BGSU/catalog/Fall-2015/arts-and-sciences/Computer_Science-BS.pdf) (right side of first page). Do you know anything about this? Both Kent and OU don't have this requirement, and I couldn't find any info on BG's website. ",
                                    "score": 3,
                                    "author": "skrills12345",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No clue sorry I can't help. If you do have a question I would suggest emailing the school of technology's advising office",
                                            "score": 3,
                                            "author": "TheJeffyJ",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Alright, thanks!",
                                                    "score": 2,
                                                    "author": "skrills12345"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whats your profession? I'm a Digital Artist and keep staying with kreischer even though the people in there are grades below me. (im a senior, my hall is filled with sophomores and juniors)",
            "score": 2,
            "author": "longrodvonhuttendong",
            "replies": [
                {
                    "level": 1,
                    "comment": "Former Compton resident. Did the same thing but it was mostly freshman back then.\n",
                    "score": 3,
                    "author": "BGSUartist"
                },
                {
                    "level": 1,
                    "comment": "Computer Science",
                    "score": 2,
                    "author": "skrills12345"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know this is way late to help, but as a freshman, to be in the first round of selection the deadline is Feb 1. Before that it doesnt matter, everyone is put in a pool where everyone is equal to one another. Doesn't matter whether you pay November 1 or January 31. Also if you want a single room, and don't mind to pay a little extra, the HLC at Founders is a nice way to almost guarantee that you will get a single room in a senior dorm. I think its an extra 500 a semester, but was so worth it since I knew I was getting a nice room and a great chance at a single room. ",
            "score": 1,
            "author": "trebarb"
        }
    ]
}