{
    "id": "3rg49c",
    "score": 3,
    "title": "Anyone know anything about computer science?",
    "author": "n0t_a_throwaway_acct",
    "date": 1446608415.0,
    "url": "https://www.reddit.com/r/BGSU/comments/3rg49c",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone majored in computer science? How is it? If you've graduated, do you feel like BG prepared you for your job? Salary coming out? Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "I graduated in Computer Science in 2010, so I'm not up to date on the current department. I can promise you it was better than when I was there. It was during the hiring freeze, and they had lost a lot of faculty. However despite that, they did a great job preparing my for the working world. BGSU focuses on a practical education. It should really be called software engineering. However if you want to get to work right after college it's a great program for that. I was able to get internships at Marathon Oil company, and they would have offered me a full time job, but I went to grad school instead. I also worked a few internships at hyland software. If you do well in the program, you shouldn't have much trouble finding well paying work ($45k or more). It will be tough to get a job working for google, or apple or microsoft, but there are tons of companies that need programmers.\n\nIf you are interested in going to grad school, you'll have to push yourself a little. The program didn't help prepare me much for this, but the limited faculty was an issue as they couldn't offer a lot of elective courses. In all fairness I also could have taken some extra courses myself. Go beyond the math requirements and take the whole calculus series and linear algebra, as well as advanced stats to prepare for grad school.\n\nI hope this helps",
            "score": 3,
            "author": "kplis",
            "replies": [
                {
                    "level": 1,
                    "comment": "This helps a bunch! Thanks! Would you have picked somewhere else to go if you could? Like how would you say it compares to somewhere like Kent or OU's program?",
                    "score": 3,
                    "author": "n0t_a_throwaway_acct",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know much about Kent's program, but I am currently at OU working on my PhD so I can compare those. I would say that they are fairly comparable for preparing you to work right after college, but OU is better for preparing you for graduate school. If you went to BG and want to go to grad school you have to take a lot of extra classes on your own that are required courses at OU. However that means if you are at OU and don't want to go to grad school, you'll have to take more theory classes that you won't need. That also means you'll have less time in your schedule for more practical electives such as some business classes or technical electives. If you know you don't want to go to grad school and you want to get a programming job right out of college, then I would say BGSU beats out OU. I know I have talked to a lot of recruiters who have said they prefer BGSU graduates because it takes far less time for them to get acclimated to the working world.\n",
                            "score": 2,
                            "author": "kplis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty much entirely this.  I graduated with my BS in 2006 and MS in 2010.  The general focus of the department is preparing people for software engineering jobs, which they're becoming more adept at.  I still know some of the faculty and they're good.  I'm in a position to hire software engineers and I often find myself comparing students coming out of UCF to BGSU, and BGSU would, in general, better prepare students for getting a junior position.  While most good companies will assume that junior devs need trained up coming out of college, and this is generally true, the process would be accelerated for a BGSU grad.",
                    "score": 3,
                    "author": "Ipswitch84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please please please please please consider the data science program. PM if you want. (not a major, but have info).\nhttp://www.bgsu.edu/arts-and-sciences/mathematics-and-statistics/comast1.html",
            "score": 2,
            "author": "Peekochu"
        },
        {
            "level": 0,
            "comment": "I do not always view the sub regularly so I just know saw this post.\n\nI recently graduated with a BS in computer science in May 2014. From what I have seen, BGSU easily has one of the best computer science programs in the state (Kent, Case Western and OSU are also all good ones). Like /u/kplis said, they really focus on applied and practical computer science education. I would argue that is more computer science then software engineering if you make it to be. One thing I have seen from talking to other students at other schools is that BGSU's computer science program teaches a lot more and gives you a lot more flexibility in what you want to learn. Other schools wait until your 3 or 4th semester to even get you started on programming topics, while at BGSU you already doing data structures and algorithms. After your ~4th semester at BGSU, all the CS courses you take are electives you choose that you need for your degree. If you want to go more computer science, you can take operating system and network courses. If you want to go more software engineering, you can go with a databases and software development (which I believe is not required for everyone). Even if you want to get a started with game programming, there is a advanced algorithms course and intro to computer graphics.\n\nIf you really want to be success getting a computer science related degree though, you need to do related extra curricular and I do not necessarily mean clubs and such. I worked on campus for the Agile Software Factory, which at the time was run the current chair of the department Dr. Chao. I heard Dr. Green runs it now. ASF was essentially a long time internship/entry level job. If you do not get something like that, you should be active on Github, /r/gamedev, codepen.io or something else so you experience stories to use for interviews and have stuff to show people. I got a job right out of college at $50k in Maumee and then in 6 months moved to another job for $60k with a lot more benefits in Cleveland. I would have went for the second place first, but they were not hiring at the time. ",
            "score": 2,
            "author": "angellus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the info! I'm on the fence between BG and Kent. The way I see it [Kent](https://www.kent.edu/cs/bs-degree-program) has a lot more CS classes then at [BG](http://www.bgsu.edu/content/dam/BGSU/catalog/Fall-2015/arts-and-sciences/Computer_Science-BS.pdf), and also doesn't have a minor requirement. It would seem to me like I would learn more about CS at Kent with the extra classes. Any thoughts?",
                    "score": 1,
                    "author": "n0t_a_throwaway_acct",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "BGSU has better classes. It focuses on very practical uses for computer science (like software development). Kent does not even peg you to take a programming classes until the third semester. Also, BGSU kind of does not have a minor requirement. CS classes count as science classes so if you do a general science minor, they will count. You minor will basically be CS.",
                            "score": 1,
                            "author": "angellus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alright, that makes sense. What's your life like now? Like what is a typical day in your life?\n\nEdit: Sorry for all the questions, I just want to make sure I actually understand how to do things, I don't want to coast by for 4 years only to realize I have no idea what I'm actually doing when I get a job. Thanks for all the info!",
                                    "score": 1,
                                    "author": "n0t_a_throwaway_acct"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}