{
    "id": "9f9i4h",
    "score": 4,
    "title": "best places to look for an apartment?",
    "author": "angry_1",
    "date": 1536771247.0,
    "url": "https://www.reddit.com/r/BGSU/comments/9f9i4h",
    "media_urls": [],
    "other_urls": [],
    "postText": "My family will be in town this coming weekend and will begin the process of looking for an apartment for my now sophomore daughter. I am of the persuasion that looking away from campus might be cheaper and a better deal. I also understand that the leases near campus come at a 9 month lease. Just looking for graduates and current students who have started the struggle to find the right place at all the different factor to possibly give me a crash course in what to expect for my fun weekend. Any and all advice is greatly appreciated.\n\nJust a small Update for all involved in helping me with tons of comments: I survived the weekend with only touring two apartments and can tell you that I was not prepared. I ended up in a hotel room with two double beds, and a couch pull out bed with my wife, two younger teens, and a small needy dog. On the bright side they all survived too...",
    "comments": [
        {
            "level": 0,
            "comment": "I'd stay away from falcon's pointe or the edge unless you want to pay more to feel like you're living in a dorm. ",
            "score": 4,
            "author": "dagormz"
        },
        {
            "level": 0,
            "comment": "Whatever you do stay away from Fite Rental Managment.  Her apartments are not up to code and she is a very shady person.  Had an issue with her 7 years ago my senior year of college and still have a dirty taste in my mouth.",
            "score": 5,
            "author": "chappee88"
        },
        {
            "level": 0,
            "comment": "Check greenbriar, smith contracting, and Mecca ",
            "score": 2,
            "author": "jimmymcperson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow those are great links!! Thank you, my wife and I will have to look at these tonight. ",
                    "score": 1,
                    "author": "angry_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ive lived at both greenbriar and Smith. Both great. I recommend smith contracting, they’re a smaller operation so if there’s an issue at your place they get it fixed fast. Greenbriar has a ton of properties, way more options just less of the personal touch",
                            "score": 1,
                            "author": "jimmymcperson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I noticed most of the 1-bedrooms were signed leases out to 2019 but we are not really looking for this year but want to lock in before it is too late. ",
                                    "score": 1,
                                    "author": "angry_1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Most everything will be signed for this school year. If you’re looking to sign for the upcoming year I’d have something signed by November. You’ll have a tough time finding anything if you wait late into the spring semester",
                                            "score": 1,
                                            "author": "jimmymcperson"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Greenbriar is far from ideal, but in my own personal experience I'd look at them over Mecca. I've heard nothing but horror stories from private rentals, and Falcon's Pointe is just an overpriced dorm",
            "score": 2,
            "author": "Romano44",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve lived at a greenbriar property. Not bad, shared in Campbell Hill in 2 bdrm townhouse for $350 a month. Lots of space, worth my money. My only complaint is that the appliances were fairly old",
                    "score": 3,
                    "author": "wrteq",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, the appliances can be old. Some of their properties are pretty hit and miss though so you have to be careful what you sign for",
                            "score": 2,
                            "author": "Romano44",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My appliances weren’t bad, they were just old",
                                    "score": 1,
                                    "author": "wrteq"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I also lived in Campbell Hill (a long long time ago) and never had any issues with Greenbriar. Absolutely loved that apartment complex. Hopefully it hasn’t changed. ",
                            "score": 2,
                            "author": "Le_Coq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I lived there last year, it wasn’t bad at all",
                                    "score": 1,
                                    "author": "wrteq"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Copper beech isn’t too bad. Location is kinda far from campus but they have shuttles. Only gripe I have with them is if you need any maintenance done it takes em a while to actually get to you. Just had to call and yell at em today because my toilet had a leak but they just ended up canceling my maintenance request after three weeks. I called back and they said they’d have someone out by the end of the month. I told them that’s unacceptable and if they couldn’t get someone out by the end of the week I might have to call a lawyer. Maintenance showed up 10 minutes later. Other than that though pretty nice place. Get a huge condo style apartment for relatively cheap rent per month. Only have to pay electricity and water. Get cable and internet included. Overall satisfied just a little angry with the leasing office but it’ll blow over. Other friends I have here said they’ve had no problems whatsoever, maybe I’m just on the shit list. Definitely recommend though, might be resigning the lease. ",
            "score": 2,
            "author": "Amxela"
        },
        {
            "level": 0,
            "comment": "Heinz-site apartments is where I live now and it was by far the best deal I could find through greenbrier  ",
            "score": 1,
            "author": "soulsurvivor97",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will track this place down!!",
                    "score": 1,
                    "author": "angry_1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The best time to sign for a lease would be before thanksgiving, but I would strongly recommend doing it before Christmas break.\n\nAvoid the Edge and Falcon Heights. They may look nice, and come with a lot of cool things, but when I was looking, the rent was $500 for each person living there. ",
            "score": 1,
            "author": "wrteq"
        },
        {
            "level": 0,
            "comment": "My best friend and I rented from Mecca for three years. For a two bedroom apartment, which was really a house split by the levels, it was about $450. House was ancient, no AC, but close to campus. It was ideal for myself, who was both a biology and computer science student, and I really liked it. It was a bad place for my roommate, who was an English/Psychology major. (Buildings are located in different areas, depending on the major and the major's main office location.) At the end of it, we got nearly all of our deposit back, except for $75 for not getting the carpets cleaned. Mecca allows for full year leases as well, as they seem to appeal to more than student housing.\n\nMy friend then got a place from Newlove. Both Mecca and Newlove were very responsive when it came to maintenance. Her apartment had a lot of space for very cheap. However, she has mixed feelings about them now, since she just moved out a month ago and they took all of her security deposit and then some on things that made no sense.\n\nAnyway, that's my experience. Falcon's Pointe always looks like dorms. but they have a shuttle. Copper Beach tends to be homier but way further from campus, but they also have a shuttle. My friend had a fairly good experience with a house from Greenbriar on S College Dr. so I think they are decent too.",
            "score": 1,
            "author": "sleepycharlie"
        },
        {
            "level": 0,
            "comment": "I've been in one of Mecca's apartments for the past 2 years and it hasn't been too bad. The workers are kinda rude that work in the office, but that's literally every rental company, they have to deal with college kids missing rent every month, so you can't really blame them. The apartment itself is really nice and maintenance is quick and gets the job done. ",
            "score": 1,
            "author": "atech087"
        },
        {
            "level": 0,
            "comment": "I recommend John Newlove, I had them for my apartment senior year and they were a great company to rent from.",
            "score": 1,
            "author": "MisterSims90"
        },
        {
            "level": 0,
            "comment": "An apartment building",
            "score": 1,
            "author": "playaaaaaaaaa"
        },
        {
            "level": 0,
            "comment": "They’re all over priced garbage",
            "score": 1,
            "author": "AlegraD"
        },
        {
            "level": 0,
            "comment": "I live at falcons pointe now and love it. They have a shuttle to and from campus, each resident has their own bathroom. There’s a pool and gym at the club house. The only utilities that residents pay for are electric and gas. ",
            "score": 1,
            "author": "Goldie46",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was looking at their site earlier, I think the smallest they had was a three bedroom. So she would need to either be placed with another group of people or find friends interested in sharing the space correct?",
                    "score": 1,
                    "author": "angry_1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely avoid this place. It might be nice, but it’s EXTREMELY Expensive.  When I was looking at it 2 years ago, the rent was $500 for each person living there. If you were to do a 9 month lease, that would end up being at least $4,500. Not sure if that also includes utilities. But it’s very stressful for a college student living in their own apartment for the first time, even with roommates. ",
                            "score": 2,
                            "author": "wrteq"
                        },
                        {
                            "level": 2,
                            "comment": "That or they can assign people based on common interest as well ",
                            "score": 1,
                            "author": "Goldie46"
                        }
                    ]
                }
            ]
        }
    ]
}