{
    "id": "e10lpo",
    "score": 6,
    "title": "Outrage as University Strips Name of Lillian Gish from Campus Theater",
    "author": "fullbloodedwhitemale",
    "date": 1574612788.0,
    "url": "https://www.reddit.com/r/BGSU/comments/e10lpo",
    "media_urls": [
        "https://www.reddit.com/r/BGSU/comments/e10lpo/outrage_as_university_strips_name_of_lillian_gish/"
    ],
    "other_urls": [
        "https://www.amren.com/news/2019/08/outrage-as-university-strips-name-of-lillian-gish-from-campus-theater/](https://www.amren.com/news/2019/08/outrage-as-university-strips-name-of-lillian-gish-from-campus-theater/)"
    ],
    "postText": "#   NOTE: This post complies will ALL Reddit rules AND it is in scope and in context with this subreddit. Civilized and polite discussion is invited. \n\nThe “First Lady of American Cinema” Lillian Gish has had her name removed from a university theater and it’s not sitting well with many movie buffs. More than 50 film industry leaders ranging from Martin Scorsese to Helen Mirren to James Earl Jones are protesting the decision of Ohio’s Bowling Green State University to remove the name of actress Lillian Gish from a campus theater because she appeared in the 1915 film *The Birth of a Nation.*\n\nThe letter accuses the university of making “a scapegoat in a broader political debate.” Lillian Gish is considered a pioneer of film acting. {snip} She was called the First Lady of American Cinema, and for more than 40 years, the theater at Bowling Green has honored Ohio-born actresses Dorothy and Lillian Gish with its name.\n\nThat changed after students said they were upset that Lillian Gish appeared in *The Birth of a Nation* in 1915, a D.W. Griffith 3-hour silent movie that includes the Ku Klux Klan in what many claim to be a positive light.\n\nfrom\n\n [https://www.amren.com/news/2019/08/outrage-as-university-strips-name-of-lillian-gish-from-campus-theater/](https://www.amren.com/news/2019/08/outrage-as-university-strips-name-of-lillian-gish-from-campus-theater/)",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah I remember a couple years ago there was a big fuss about the small display BG had for her and the movie. Yeah I get the movie was not socially good by any means but it’s a BG grad with one of the most important movies of all time",
            "score": 5,
            "author": "SwiftBacon",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’s not a BG grad though, her career peaked like a year after the school opened.",
                    "score": 1,
                    "author": "Treewalkerr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting. I haven’t really looked into her much I just figured she went here",
                            "score": 1,
                            "author": "SwiftBacon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She’s from a town nearby Bowling Green. She’s really just a local celebrity",
                                    "score": 1,
                                    "author": "Doades"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a stupid empty gesture.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Doesn’t matter now seeing as the new Business building is replacing the old theater.",
            "score": 1,
            "author": "ijustlovebreasts",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm pretty sure they named the theater in the union the gish and moved her display there when hanna closed",
                    "score": 1,
                    "author": "wallace6464",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The theater in the Union was The Gish for like a year, then they changed the name to The BGSU Film Theater (maybe as a placeholder?)",
                            "score": 1,
                            "author": "Doades",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ahh, I graduated before it was changed again, I just remember them calling the union theater the gish last year",
                                    "score": 1,
                                    "author": "wallace6464"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}