{
    "id": "nb96lc",
    "score": 12,
    "title": "Spectrum internet",
    "author": "burnerrrracc",
    "date": 1620883240.0,
    "url": "https://www.reddit.com/r/BGSU/comments/nb96lc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, all. For those of you who live off campus and use Spectrum, have you noticed frequent disconnections? It’s infuriating. I’ve used spectrum for 5 years, and this issue has only cropped up over the past year. Have had many technicians out and what not. What’s stranger is that I seemingly only lose upload speed, not download speed - thereby, being able to still hear friends in discord even though they’re unable to hear me (also disconnect from whichever game I’m playing). Any else experiencing something similar? Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Yep, same issue as you. Just started happening in the last year or so. Cuts out for a minute or two then comes back.",
            "score": 3,
            "author": "PM_ME_YOUR_MACnCHEEZ"
        },
        {
            "level": 0,
            "comment": "Spectrum unfortunately really sucks I've had this issue constantly",
            "score": 1,
            "author": "SkatingGeek"
        },
        {
            "level": 0,
            "comment": "So.. weirdly enough, I live about 30 minutes north of BGSU in Wood County and I have the same issue with Spectrum. It was impacting my remote work so I just started bugging them over and over again. It got better for a while but has been bad again lately.",
            "score": 1,
            "author": "glaven"
        },
        {
            "level": 0,
            "comment": "I used to have issues with spectrum (slow speeds and disconnects).  Was paying for 400mbps, and was usually getting well below 100, if not like 10-20mpbs. I upgraded my router and now have blazing fast speeds are disconnects are rare.  I consistently get 400+, sometimes just under 500mpbs.",
            "score": 1,
            "author": "cats05"
        },
        {
            "level": 0,
            "comment": "Ive had spectrum for years way before I moved to BG and had noticed the dropping issue.  Seemed like when I would call and complain it would be gone for a couple months and then resurface",
            "score": 1,
            "author": "swanny7145"
        },
        {
            "level": 0,
            "comment": "I don’t know if you ever solved your problem, but I experienced the same thing and eventually discovered there’s a problem with the chipset they use in the provided modems. \n\nI purchased my own modem and I’ve had zero issues since.",
            "score": 1,
            "author": "rockettmann"
        }
    ]
}