{
    "id": "u7fxx0",
    "score": 11,
    "title": "Any Vegans on Campus?",
    "author": "a_reddit_username21",
    "date": 1650403521.0,
    "url": "https://www.reddit.com/r/BGSU/comments/u7fxx0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I made an account just for this question.\n\nI know it is late into the semester, so probably not the best time to ask. But I was wondering if there are any other vegans on campus? I imagine there are, but I just haven't met any.\n\nThere used to be a club, but unfortunately there is not anymore. I thought it could be nice to meet other vegans at BGSU, either to share tips on being vegan in Bowling Green or to make friends.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm graduating this semester but still going to be in the area. I'm actually friends with the campus's new dietitian and they're pushing for more vegan options. (There's now a vegan option at the pub, yay!).(also there's going to be a vegan takeover at the oaks soon, in case you didn't hear)",
            "score": 4,
            "author": "SkimmedVodka39396464",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good to hear there will hopefully be more vegan options at the Oaks in the future - I hadn't heard.\n\nHave you tried the cauliflower tacos? I haven't yet - I'm waiting until there is a take-out option.",
                    "score": 2,
                    "author": "a_reddit_username21"
                },
                {
                    "level": 1,
                    "comment": "I got an email from the dietitian recently about the event! They just never got back to me on what time it is, do you happen to know?",
                    "score": 1,
                    "author": "RichardJudas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "April 27th. I'm not sure the specific time",
                            "score": 2,
                            "author": "SkimmedVodka39396464"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am! But I'm done in BG after this semester :(\n\nIf you have a meal plan through the university and you're trying to eat vegan... good f-ing luck... \n\nIf you live off campus it's just a matter of doing what works for you. I was only a part-time student last semester, so I was able to spend time finding my groove when it comes to meal planning, shopping, and cooking. I personally love making Indian food, particularly dal and khichdi. There's a really great Indian grocery store in Perrysburg called True Spice where you can get your basics (basmati rice, mung beans, red lentils, dried red chilis, whole cumin seeds, garam masala powder) and from there it's just going to Kroger intermittently to get your garlic, ginger, tomatoes, onions, serrano, tofu, whatever else. I experiment with other recipes too, like I made a really good potato barley soup with veggies and beyond sausage recently. And of course it's not all fancy, I make PB&amp;Js probably 4-5 times a week and eat a lot of frozen mock meats from Aldi.\n\nHope this was helpful in some way? I don't know of any vegan organizations on campus (I had no idea there used to be a club, I wish I could have checked that out) but there are definitely more of us around. I used to work at the Oaks back when they had a dedicated vegan section and would always see the same people eating from there.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If you have a meal plan through the university and you're trying to eat vegan... good f-ing luck...\n\nYou have to have a meal plan if you live on campus. It’s surprisingly ok most days. They label vegan options on their website so you can plan when to go. But sometimes the options are pretty poor and I just end up eating stuff I bought from Kroger.\n\nIf anyone else is reading this, I’d recommend trying to go to dining halls around 4pm on weekdays. That way you can get the lunch options and the dinner options, which can really improve the selection. They switch out the options between 3:50 – 4:10, but mostly right around 4:00.\n\nThank you for the tips on living off campus! I'm on campus and don't have a car, but I will take note of this for the future.\n\n&gt;Hope this was helpful in some way?\n\nYes it was! Thank you.\n\nI can't find the website for the old club, but they have this Twitter page: [https://mobile.twitter.com/bgsuvegclub](https://mobile.twitter.com/bgsuvegclub). Last post seems to be in 2016.  \n\n\nEdit: Here's the old club's website, if anyone is interested: https://bgsuvegclub.blogspot.com/",
                    "score": 2,
                    "author": "a_reddit_username21"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No. Stay Away… PLEASE 🙏🙏🙏",
            "score": 2,
            "author": "JimmyBGSU"
        },
        {
            "level": 0,
            "comment": "I'll be transferring up in the fall! I was told that there's a vegan event going on on the 27th so I'll be there for that to see what its like.",
            "score": 1,
            "author": "RichardJudas"
        }
    ]
}