{
    "id": "121p908",
    "score": 15621,
    "title": "Timelapse of a Falcon 9 rocket taking off over LA in 2020.",
    "author": "Humble_Issue_3010",
    "date": 1679757814.0,
    "url": "https://www.reddit.com/r/woahdude/comments/121p908",
    "media_urls": [
        "https://v.redd.it/v3tl4qctkwpa1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/WoahDude! \n\n* Check out what counts as \"woahdude material\" in our [**wiki**](https://www.reddit.com/r/woahdude/wiki/index#wiki_woahdude_material).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/woahdude) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Battle For Los Angeles 2: Friendly Fire",
            "score": 572,
            "author": "Boojibs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Missed opportunity \n\nBattle for LA 2: Counter Battery Fire",
                    "score": 21,
                    "author": "BrutusGregori"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how every time there’s a SpaceX launch, people think these clouds of gasses are aliens or some secret military shit going on. These rockets launch several times a month. Everyone should know what these are by now. Doesn’t make them any less spectacular though. Nighttime rocket launches are incredible to witness!",
            "score": 612,
            "author": "robo-dragon",
            "replies": [
                {
                    "level": 1,
                    "comment": "In people's defense, most launches don't happen during exactly the right time window where the sun has set for people on the ground but is still shining on the rocket/exhaust.\n\nEven night time launches can be hard to see if it's cloudy and the daytime ones have gotten so routine that they (at least from the Orlando area) are mostly ignored even when they are visible.",
                    "score": 176,
                    "author": "MaritMonkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FWIW, I'm in northeast L.A. about 160 miles south of Vandenberg and as long as they're after sunset, we can see the launches from here. Since this is SoCal, cloud cover isn't nearly as much of an issue here.",
                            "score": 31,
                            "author": "70ms",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've even been able to spot a daylight launch from San Diego.",
                                    "score": 6,
                                    "author": "likerazorwire419",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, we *can* see them in the day, they're just not as cool 😂",
                                            "score": 6,
                                            "author": "70ms"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Is it still interesting enough that you catch people watching them?\n\nA couple weeks ago I walked out of a shop to find a half dozen people on the sidewalk looking east, but that felt like an anomaly.  Was just at WDW yesterday and couldn't even convince anybody to look up!",
                                    "score": 2,
                                    "author": "MaritMonkey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, people watch them. :) There's usually a post in r/losangeles about upcoming launches, and someone on my NextDoor posts them too. Don't forget we not only have SpaceX here, we have JPL, the Mt. Wilson Observatory, the Griffith Observatory, the Science Center has Endeavor on display - L.A. is full of people who love space and science.",
                                            "score": 11,
                                            "author": "70ms",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh I didn't mean *nobody* watched them (the viewing areas close to the coast here are pretty well attended) but whether average folks gave a crap.\n\nI was fortunate enough to see the pleiades through a telescope at Griffith a couple years ago and clapped like an excited seal.  That place is indeed awesome. :D",
                                                    "score": 1,
                                                    "author": "MaritMonkey",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh cool!! I think the launches are far enough away that unless you know what you're looking at, you might think it's just a weird contrail during the day so you won't get crowds stopping to look up (we also can't hear them from here). \n\nGriffith Observatory, and the park, are definitely treasures. :) We went not too long ago and it was just like I remembered as a kid in the 70's. In the 90's it used to be popular to drop acid and go to the Pink Floyd laser show at the planetarium there! 🤪",
                                                            "score": 2,
                                                            "author": "70ms"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Happy cake day!!",
                                    "score": 1,
                                    "author": "ThySwagPenguin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks! :)",
                                            "score": 1,
                                            "author": "70ms"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm pretty sure that SpaceX is showing off with this type of display.  It is very difficult to time and plan this type effect...so now they are so good at it, they are having fun and scaring the heck out of the competition.",
                            "score": -2,
                            "author": "corporaterebel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This was the launch for SAOCOM-1A back in 2018. The launch time was determined by the specific needs of the payload’s target orbit. They didn’t adjust the time for launch viewing purposes.\n\nEdit: typo",
                                    "score": 17,
                                    "author": "KristnSchaalisahorse"
                                },
                                {
                                    "level": 3,
                                    "comment": "Honestly, seeing as how many of these are essentially their own launch windows to pick and choose (well the Starlink stuff anyways) I wouldn't put it past them. :)",
                                    "score": 0,
                                    "author": "MaritMonkey"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They should make a law that states you can only launch during that specific window tbh",
                            "score": 1,
                            "author": "Artemis-4rrow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What is that plume? NEver seen any other rocket do that even when seperating into different stages.    Why is it unique to Falcon?",
                    "score": 13,
                    "author": "FolsgaardSE",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its not unique to the falcon at all, its been recorded by multiple space agencies not affiliated with SpaceX and by the US military doing missile tests. SpaceX just launches more rockets than anyone else, and the falcon is fairly large so if you notice a huge plume its probably them. Its called the [Twilight Phenomenon](https://en.m.wikipedia.org/wiki/Twilight_phenomenon) because it happens around dusk or dawn. \n\nWhats happening is that the exhaust cloud (in the Falcon 9 case the exhaust is water and CO2) freezes and expands at high altitude, where sunlight from over the horizon lights it up against a dark sky. Hence the name twilight phenomenon, you can only see it like this when the light hits just right.",
                            "score": 40,
                            "author": "Alagane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did this happen with any Space Shuttle launches, or is this phenomenon limited to our current rocket “style”?",
                                    "score": 5,
                                    "author": "HoodieGalore",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, but IIRC the space shuttle used a different fuel so the exhaust products were different gasses. It was more of an orange flare",
                                            "score": 3,
                                            "author": "Alagane",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Awesome! Thanks for that info!",
                                                    "score": 2,
                                                    "author": "HoodieGalore"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This launch occurred at twilight. The sun was below the horizon for the observer, but the rocket went high enough to become illuminated by sunlight, which is what makes the exhaust plume visible.\n\nAny rocket will produce this effect. Here’s an [Atlas V launch at twilight](https://youtu.be/W8sXUkafO9k?t=1m55s), for example.\n\nThe reason the exhaust plume looks messy in the Falcon 9 launch is because the first stage booster flipped around after separation and fired its engines again in order to travel back to land near the launch site. This maneuver causes the exhaust from the first &amp; second stage engines to interact. Here’s a [close up view of that event](https://youtu.be/p50bX0q5-bo?t=2m50s) filmed in real time from an alternate angle.",
                            "score": 17,
                            "author": "KristnSchaalisahorse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for the detail, that was really fucking cool.",
                                    "score": 4,
                                    "author": "StatmanIbrahimovic"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;after separation and fired its engines again in order to travel back to land near the launch site.\n\nHoly crap, so the booster/first stage rocket itself is smart enough to fly back and land?! I knew the main rocket could set down but not the individual stages. Truly amazing.\n\nLike a truck driving a trailer, then once delivered you just tell the trailer to find it's own way home and it drives itself.",
                                    "score": 3,
                                    "author": "FolsgaardSE"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well the first time I saw one was on lsd and it was apparently a trident missile launched from a submarine off the coast of so cal, this was way before falcon 9 ever launched and I was pretty fucking sure it was aliens then",
                    "score": 4,
                    "author": "TheRealPinballWizard"
                },
                {
                    "level": 1,
                    "comment": "Dude but explain the spinning circle in the sky in norway when I was a kiddo. Shit was “a rocket.” Maybe you right lol.",
                    "score": 2,
                    "author": "Inside_Tomatillo_244",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember that one, practically gave me alien PTSD.",
                            "score": 1,
                            "author": "__BitchPudding__",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My man. Lol shit was out there and then some ya?",
                                    "score": 2,
                                    "author": "Inside_Tomatillo_244"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s crazy how spacex has gotten so good an proficient at space flight they do it this often. With nasa it took years to plan one trip to space. They could probably do an emergency flight next day.",
                    "score": 4,
                    "author": "rednapkin12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was the plan with these reusable Falcon rockets! Quick and easy to set up for another launch with minimal costs compared to NASA's larger rockets that have very few reusable components. It's one reason SpaceX can launch these on just about a weekly basis if needed. Not sure how many Falcon rockets they currently have built, but after some post-flight refurbishing, they are ready to be used again. So they could easily have a bunch waiting in line and can pull them whenever they need to send something up.\n\nI'm also impressed they can strap these together to make the Falcon Heavy rockets! Instead of making a whole new heavy-lifting rocket design, they just made the Falcon Heavy modular, using three smaller Falcon9 rockets (again, most likely previously used) as engines. It's genius! Looking forward to the other rocket designs they are testing and have in the conception stages.",
                            "score": 9,
                            "author": "robo-dragon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are these gasses safe for our health and the planet?",
                    "score": 1,
                    "author": "elderberry_jed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe we'll be looking into this in the future, after it has become problematic. No point spending money being proactive, that's just pessimism.",
                            "score": 1,
                            "author": "__BitchPudding__"
                        },
                        {
                            "level": 2,
                            "comment": "In this case it is co2 and water vapor.",
                            "score": 1,
                            "author": "Anderopolis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That looks AWESOME!",
            "score": 38,
            "author": "SpendMany5980"
        },
        {
            "level": 0,
            "comment": "Humans are fucking nuts",
            "score": 30,
            "author": "CyclicDombo",
            "replies": [
                {
                    "level": 1,
                    "comment": "We sure are. We’re also the worst thing to happen to planet earth.",
                    "score": 2,
                    "author": "Bbaftt7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, Earth has seen far worse things.",
                            "score": 1,
                            "author": "Anderopolis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not really",
                                    "score": 1,
                                    "author": "Bbaftt7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At least 5 mass extinctions and the Moon beg to differ.",
                                            "score": 1,
                                            "author": "Anderopolis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well we’re on our way to destroying the entire planet sooooo",
                                                    "score": 1,
                                                    "author": "Bbaftt7",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We really are not. \n\nWe are definitely changing it, and not for the better in many ways. \n\nBut we are not destroying it.",
                                                            "score": 1,
                                                            "author": "Anderopolis"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whoa, that timelapse of the Falcon 9 rocket taking off over LA in 2020 is insane! Humans are fucking nuts for creating such advanced technology and accomplishing such feats. It's both impressive and scary at the same time.",
                    "score": 1,
                    "author": "Sasha_sarah"
                },
                {
                    "level": 1,
                    "comment": "Yeah, but not Elon musk though, right? He’s a dumbass. Right?",
                    "score": -34,
                    "author": "groggyMPLS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, he's fucking nuts too.\n\nNot to take away from what he's done, some is absolutely game changing (SpaceX for sure, Tesla probably not so much for what it is - but for how it's changing the industry).\n\nBut he's also an absolute fuckwit too.",
                            "score": 30,
                            "author": "mrinsane19",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He's not a dumbass he's a self absorbed fuckwit  with clear mental issues surrounded by yes men who are too shit scared to tell him no.",
                            "score": 3,
                            "author": "mindsnare",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe this is a stupid question, but is that big pretty bloom effect caused by the gas used to propel the rocket burning up, and then dispersing into a giant cloud where the atmosphere is thinner?\n\nHere's the actual question:  Does all that expelled fuel exhaust just rain down on L.A. after?",
            "score": 298,
            "author": "jenksy",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not fuel. It's exhaust gases. Stoichiometry of a rocket fuel exiting the engine results in water and CO2 as the end products. You're basically seeing a plume of ice refracting sunlight.",
                    "score": 414,
                    "author": "OptimusSublime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's so weird that's the second time today I've seen the word stoichiometry after never having heard it before.\n\nI feel like I should go and find out what it means so I can use it in future. I'm guessing, before I Google fu it. it's about the behaviour of gasses under pressure?\n\nEither way this is some sci fi looking stuff. Amazing.",
                            "score": 112,
                            "author": "voluotuousaardvark",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In this instance, I think it's the perfect air/fuel ratio for most efficient/effective burn.  We used it when building cars.  For my turbo build 14.3:1 air to fuel ratio was ideal at idle and more rich (~13:1) under boost",
                                    "score": 33,
                                    "author": "BrutalityAndTheBeast",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For the sake of conversation, do you know why it made that massive blue flare?\n\nMost of the cars I know don't burp blue flares and the only one I did belonged to a friend who had spark plugs in the exhaust to pop fuel he deliberately fed through the system to burp flames out the back which even he knew was ridiculously inefficient.\n\nIf we shot his mx5 into the stratosphere would his make a cool aura like this? (only half joking)",
                                            "score": 12,
                                            "author": "voluotuousaardvark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s just the exhaust plume refracting sunlight, cause the rocket was launched at sundown",
                                                    "score": 13,
                                                    "author": "CaveJohnsonOfficial"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "i know were going to be using methane and it burns blue. https://www.wired.co.uk/article/spacex-raptor-engine-starship",
                                                    "score": 3,
                                                    "author": "CormacMccarthy91"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's a different type of fuel than gasoline I think would be the simplest answer.  Hydrogen I believe? That burns blue",
                                                    "score": 7,
                                                    "author": "BrutalityAndTheBeast",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lmao, that mx5 definitely isn't running on hydrogen, should probably test shooting it into space though.\n\nI get it was a daft question lol",
                                                            "score": 11,
                                                            "author": "voluotuousaardvark",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have very little knowledge about rocket propellent, but I could at least share the stoich relationship with cars.\n\nIn relation to the mx5 and stoich though, your friend's mx5 is running at a very inefficient air to fuel (A/F) ratio.  Running very rich and leading to unburnt fuel making its way to the exhaust and therefore able to be lit by a spark plug back there.  Backfires are also examples of this, with the exhaust being so hot it can ignite unburnt fuel in the exhaust.  So backfires are either the case of purposeful/accidentally rich a/f ratio or improper burning in the cylinders leading to unspent fuel (maybe bad spark plug(s))",
                                                                    "score": 7,
                                                                    "author": "BrutalityAndTheBeast",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's absolutely deliberate, I'll upload an image of it. Its a joker car.\n\nLike batman and joker, beautiful airbrush work for the joker paint job. It's not his commuter, and this is where you'll probably stop believing me, which is a black sports smart car with some extra plastic fins to look like the bat mobile.\n\nI'm not saying it's my thing personally but I admire a man that sticks by his hobbies.",
                                                                            "score": 6,
                                                                            "author": "voluotuousaardvark",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Sounds horrible",
                                                                                    "score": 1,
                                                                                    "author": "fshowcars"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Doesn't Mazda have a hydrogen fuel cell rotary engine?  Surely one of those has made it into a Miata.  At least I hope",
                                                                    "score": 1,
                                                                    "author": "evilpinkfreud"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "falcon 9s run on RP-1(really pure kerosene)/liquid oxygen",
                                                            "score": 5,
                                                            "author": "ExpendableAnomaly"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I remember seeing this as a kid and had no idea what it was. Had me shaken up for a while until I learned this",
                                            "score": 3,
                                            "author": "Sierra-117-"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m envious this is the first you’ve heard of it.",
                                    "score": 9,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Stoichiometry is basically just the ratios of reactants and products in a given chemical reaction, so the total number of each element on each side of the equation equals one another with whole-number quantities of each molecule.",
                                    "score": 6,
                                    "author": "Arsnicthegreat"
                                },
                                {
                                    "level": 3,
                                    "comment": "Remember balancing equations in your early science classes? Where theyd give you a simple chemical reaction, like cell respiration, and ask you how many molecules of product will be created from the reactant. Thats stoichiometry at a very simple level.\n\nLike: \" if six molecules of oxygen (O2) and one molecule of glucose (C6H12O6) are consumed in respiration, how many molecules of carbon dioxide (CO2) and water (H20) will be created?\" Then you count up the number of atoms and make the simplest possible combination using them. In this case six molecules of oxygen and one of glucose yield six carbon dioxide and six water molecules.",
                                    "score": 5,
                                    "author": "Alagane",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's an excellent practical example. That genuinely makes sense.\n\nI always found that the most difficult part of chemsisty and physics, the maths made sense but I always found it difficult to comprehend the physical aspect of it.",
                                            "score": 3,
                                            "author": "voluotuousaardvark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Personally I'm the opposite. I'm ok at math but I'm better at visualizing 3d changes and motion, I needed that connection to understand the importance of anything past algebra. \n\nI remember taking Calculus my senior year of highschool, doing ok conceptually but not really \"getting it\" until I was in the car with my mom when she slammed on the brakes. As I was sliding forward and pulled back by the seatbelt the concept of derivatives suddenly made way more sense. Velocity is the derivative of position, acceleration of velocity, and jerk the derivative of acceleration. Vectors made more sense too.",
                                                    "score": 3,
                                                    "author": "Alagane",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All that stuff helped me calculate the mean jerk time of a room.",
                                                            "score": 3,
                                                            "author": "Lopsided-Seasoning",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lmao",
                                                                    "score": 3,
                                                                    "author": "Alagane"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Stoichiometry is kinda like the algebra of chemistry. \n\nYou're balancing the equation so that all the variables are \"equal\" on both sides of the equation. So that, basically, X=X or CO2=CO2... except with more variables (X's or CO2's) included into the equation.\n\nI hated it until I understood it more, and then it kinda felt like doing a puzzle. And now I don't remember how to do it at all, but I still love the word... \"stoichiometry\" does sound sci-fi as hell",
                                    "score": 2,
                                    "author": "MrShankles"
                                },
                                {
                                    "level": 3,
                                    "comment": "I had a heated argument with my grandfather where it was brought up a few weeks back. If engines are your thing, it will come up more often than expected.",
                                    "score": 2,
                                    "author": "News_without_Words"
                                },
                                {
                                    "level": 3,
                                    "comment": "[Baader–Meinhof phenomenon](https://en.wikipedia.org/wiki/Frequency_illusion)",
                                    "score": 6,
                                    "author": "Spin1441"
                                },
                                {
                                    "level": 3,
                                    "comment": "It was those math like equations the chemistry teacher made you do way back in high school that describe the chemical changes going on in a reaction.",
                                    "score": 1,
                                    "author": "Jezon"
                                },
                                {
                                    "level": 3,
                                    "comment": "The word stochiometry itself is a neologism derived from Greek words for \"element\" and \"measure\". For chemical reactions, the actual discrete molecules matter, so everything is done in ratios of moles. A mole is a unit that denotes a specific number of particles (6.022 \\* 10 \\^22). Stoichiometry is basically stuff like \"you take 2 moles of this and react it with 4 moles of that to get 1 mole of product\". You can almost think of a stochiometric relation like the recipe for a reaction, or the law governing it.",
                                    "score": 1,
                                    "author": "afleecer"
                                },
                                {
                                    "level": 3,
                                    "comment": "Baader Meinhof effect",
                                    "score": 1,
                                    "author": "thewavefixation"
                                },
                                {
                                    "level": 3,
                                    "comment": "its just the math of chemical reactions usually ratios of different compounds",
                                    "score": 1,
                                    "author": "jerkularcirc"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They are running kero-lox so not quite that clean.  Metha-lox on the BFR will be cleaner. Super cool timing.",
                            "score": 6,
                            "author": "lpd1234"
                        },
                        {
                            "level": 2,
                            "comment": "Do you have the equation for that? I recently taught my 8th graders how to balance equations, and I'd love to show them this video and the equation that goes with it.",
                            "score": 3,
                            "author": "BikerJedi"
                        },
                        {
                            "level": 2,
                            "comment": "In regards of the CO2 part: rockets (all launches in total) produce 0.008% of yearly human produced carbon dioxide in the atmosphere.",
                            "score": 2,
                            "author": "DiddlyDumb"
                        },
                        {
                            "level": 2,
                            "comment": "I wonder how good this is for our lungs.",
                            "score": -12,
                            "author": "Mannstrane",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Better than car and jet exhaust",
                                    "score": 25,
                                    "author": "falco_iii",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How",
                                            "score": -12,
                                            "author": "the_morg88",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Because it's only H2O and CO2...",
                                                    "score": 42,
                                                    "author": "AntiMatter89"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "..and then repeats the question hoping to learn how. Reddit downvotes.",
                                                    "score": 5,
                                                    "author": "Stopikingonme",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Amazing how it gets down voted.  I thought I had a valid point to bring up.",
                                                            "score": 4,
                                                            "author": "Mannstrane",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Probably because it's covered in a higher comment",
                                                                    "score": 1,
                                                                    "author": "Mental-Mushroom",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well thank you for responding.  It’s a beautiful timelapse.",
                                                                            "score": 1,
                                                                            "author": "Mannstrane"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don't know why you are being downvoted.  \n\nFalcon 9 uses highly refined kerosene so the exhaust from a Falcon 9 rocket is similar to car &amp; jet exhaust with a few caveats.  First, the rocket is really good at burning all of the fuel and not generating much soot.  Second most exhaust is released much higher in the atmosphere, further away from humans.  Finally the total volume of rocket exhaust is much, much less than the aggregate amount of exhaust from jets or cars.",
                                                    "score": 2,
                                                    "author": "falco_iii"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Someone asks an honest question hoping to learn. Reddit downvotes.\n\n\n\nEdit:  I realize I missed an opportunity to actually answer this. The “exhaust” is just water and carbon dioxide. Even if it was a little bit on the toxic side it pales in comparison to the car exhaust we breath in on a daily basis. Exposure + time is also relevant too.",
                                    "score": 8,
                                    "author": "Stopikingonme"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If I fill my garage with exhaust gases from my car, I don't end up driving to work.\n\nI can't imagine this is good for the people underneath it.",
                            "score": -28,
                            "author": "jenksy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you even read u/OptimusSublime s comment? The end products are water and CO2, so there shouldn't be any noticeable effects on the people below.",
                                    "score": 28,
                                    "author": "PM_me_Jazz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah but if he breathes in exhaust fumes from his car, he would die!\n\nTherefore, it is impossible for the water and CO2 byproducts from a rocket to be safe. \n\nLA died after this.",
                                            "score": 8,
                                            "author": "wizzense",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And the traffic will still be bad",
                                                    "score": 5,
                                                    "author": "FozzyLozzy"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Actually you're right, I didn't process their comment properly and got lost at _Stoichiometry_ as a not-chemist, and sort of glazed over the rest not mapping it to any kind of meaning, and just kept thinking \"exhaust\"...",
                                            "score": 21,
                                            "author": "jenksy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's understandable",
                                                    "score": 8,
                                                    "author": "PM_me_Jazz"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Bro you think a rocket is fueled by the same shit as your car lol?",
                                    "score": 6,
                                    "author": "StayTuned2k",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In no way am I claiming to know what rocket fuel is made of.  Kerbal Space Program tells me it's \"Methalox\" and my brain thought \"methane\".  Is Methane Bad?  Wait, that's cow-farts, right?  My rocket-math's always been rusty from lack of use so I can't do the equations on answering that one.  I've now thought through this more than I did prior to posting my previous comment.",
                                            "score": 1,
                                            "author": "jenksy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Methalox is what SpaceX is using in their new Starship rocket.   \nFalcon 9 uses RP1, which is basically just refined kerosene.\n\nBoth fuels though have the same exhaust gases, water and CO2.",
                                                    "score": 3,
                                                    "author": "SuperSMT"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "All you need to know is that the end product is basically carbon dioxide, water vapor, and nitrous oxides.\n\nThe biggest concern is that those are greenhouse gases. So there are certainly environmental concerns to be discussed. But it won't really harm the city below as its heavily dispersed, in contrast to filling your garage with carbon **monoxide.** Huge difference! The former is basically harmless, the latter will kill you fast and slient.\n\nFYI: The Falcon 9 uses RP1 and liquid oxygen as fuel",
                                                    "score": 2,
                                                    "author": "StayTuned2k",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm not sure there's any reason to think RP-1 combustion won't make carbon monoxide, I doubt it runs oxidizer rich since that sounds like it would be very corrosive to the engine.\n\nThat said, it isn't able to build up like in a garage.",
                                                            "score": 2,
                                                            "author": "Chronos91",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It is possible for small amounts of carbon monoxide (CO) to be produced as a byproduct of incomplete combustion of RP-1. This can happen if the fuel-to-air mixture is not optimized or if there are combustion inefficiencies. The amount of carbon monoxide produced in this case is typically very small and is not a significant source of pollution.\n\nRocket engines that use RP-1 as a fuel are typically designed to minimize the amount of carbon monoxide produced during combustion. This is achieved through optimization of the fuel-to-air mixture to ensure complete combustion of the RP-1.\n\nSource: I'm a huge science nerd with a subscription to GPT4\n\n\nEdit: so yes, akchually you're quite right, CO is indeed produced but at such miniscule amounts that it's negligible",
                                                                    "score": 1,
                                                                    "author": "StayTuned2k",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's not an akchually, many rockets run fuel rich (and there are reasons you would want to do this) and significant percentages of the exhaust would be carbon monoxide. It just pales in comparison to the amount released by vehicles every day and it's also not happening in a confined space or really near people.\n\nMerlin runs a Lox/RP-1 ratio of 2.36. Taking RP-1 to be C12H14 on average, this is a mole ratio of 11.67. Again, taking RP-1 to be C12H14, complete combustion would require 15.5 as the LOX/RP-1 mole ratio.\n\n I also did this for the Raptor, and the stoichiometry can be done more precisely with the info I have since the fuel there is methane. The Raptor runs a LOX/Methane ratio of 3.6. This is a mole ratio of 1.78 LOX/Methane. Complete combustion would require 2.\n\nI imagine these are run fuel rich to keep the combustion chamber temperature down a bit and also keep unreacted oxygen from corroding the hell out of the combustion chamber and nozzle.",
                                                                            "score": 1,
                                                                            "author": "Chronos91",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I'm not sure why c12h14 would be the average of Rp-1. \n\nI used CnH1.953n and just let the AI calculate. \n\nThe balanced combustion reaction becomes:\n\nCnH1.953n + (3.155n + 11.5)O2 → nCO2 + 0.9775nH2O + 11.5O2\n\nTherefore, the mole ratio of LOX to CnH1.953n for complete combustion is:\n\n(3.155n + 11.5) / 8.47 : 1\n\nMake of that what you will. This is too deep for me.\n\nBut if we leave the realm of scary formulas, we see that the Falcon 9 Merlin engine is designed to achieve a combustion efficiency of over 98%, according to SpaceX at least.\n\nI tried to find exact numbers but got across only one study from 2006 on rp-1 from P.T. McCloud et.al. \n\n\"Combustion Efficiency and Pollutant Emissions of RP-1 and RP-1/LOX in a Rocket Combustor\", published in the journal Energy and Fuels. \n\nThe study found that the emissions of CO from a rocket engine were generally below 10 ppm by volume.\n\nGasoline is roughly 100ppm with diesel ranging anywhere between 400 to 1000.\n\nSo without getting even more technical (what you wrote cost me almost one hour of chemistry refreshing lol), it's safe to assume that the guy we're responding to really doesn't need to be concerned about the exhaust of a Falcon 9 unless he's strapped right to it",
                                                                                    "score": 2,
                                                                                    "author": "StayTuned2k",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Sincerely, thank you for the explanation!",
                                                            "score": 1,
                                                            "author": "jenksy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How tf did they manage to create fuel that exhausts into water &amp; CO2 meanwhile we can’t move away from gas cars?",
                            "score": 1,
                            "author": "mood_le",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's pretty easy, it's called a hydrogen engine (spaceX plans on using a methalox instead of hydrolox engine most of the time however) and they already exist. They're just unpopular because hydrogen is highly explosive in pressurized containers (more so than fuel in regular containers), and there is no pro-hydrogen lobby unlike petrochem lobbies.",
                                    "score": 3,
                                    "author": "HellisDeeper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh interesting; thanks for the reply!",
                                            "score": 1,
                                            "author": "mood_le"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[They have hydrogen powered busses in Stockholm](https://m.youtube.com/watch?v=4pVStENP_Y4)",
                                            "score": 1,
                                            "author": "MEANINGLESS_NUMBERS"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm pretty sure all carbon-based fuel (aka petroleum, wood, any other biological fuel) when completely burned should turn into water and CO2? I'm guessing there are unburnt debris/gasses in exhaust that make it toxic?",
                                    "score": 2,
                                    "author": "CitizenLafayette"
                                },
                                {
                                    "level": 3,
                                    "comment": "Car fuel consists of a fairly wide range of different hydrocarbon molecules of varying lengths and structures. RP-1, probably the most popular rocket fuel, is similar to kerosene but purer, with a tighter range of molecule lengths and near elimination of cyclic and branching compounds. Most of what cars exhaust is CO2 and water also. There are other additives and impurities in gasoline and diesel which can impact exhaust composition, as well as incomplete combustion making CO and catalytic production of NOX, but that is relatively small in comparison to the major combustion products.  RP-1/LOX rockets also produce side compounds, but fewer.",
                                    "score": 2,
                                    "author": "milkdrinker7"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That exhaust plume is strictly water and CO2, and contains no pollution whatsoever? That sounds impossible, though. Nothing burns 100% clean, yeah?",
                            "score": 1,
                            "author": "__BitchPudding__"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not really,  it’s just the exhaust gasses being lit up by the sun because the rocket is high enough to be in direct light of the sun but because it’s night below on the ground the lit up exhaust gasses are very visible.",
                    "score": 2,
                    "author": "------why------"
                }
            ]
        },
        {
            "level": 0,
            "comment": "With everything sped like that, the air traffic is faster and makes LA look like a *Star Wars* planet.",
            "score": 16,
            "author": "SubterrelProspector"
        },
        {
            "level": 0,
            "comment": "Nah bro, this is a alien space ship escaping earth",
            "score": 12,
            "author": "panchowearer",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Thanks for all the fish!\"",
                    "score": 3,
                    "author": "motorhead84"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have all multi stage launches through the ages produced this effect? Are we only seeing these now that launches happen after sunset vs all the launches I grew up with in the 70's and 80's were daylight launches?",
            "score": 7,
            "author": "thedeanorama",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're seeing this because of social media, and SpaceX tossing up a rocket or two a week doesn't hurt either. Rockets have done this since the beginning, its just the timing that makes it visible, and the ability to take and share photos nearly instantly that makes it spread (not to mention the effort it used to take to be aware of unmanned rocket launch schedules before the internet). The shuttle and old Delta, Atlas, etc launches produced these cloud shows from time to time\n\n[https://www.space.com/4182-nasa-pretty-post-shuttle-launch-clouds-tonight.html](https://www.space.com/4182-nasa-pretty-post-shuttle-launch-clouds-tonight.html)\n\n[https://www.spacearchive.info/minotaur-streak.htm](https://www.spacearchive.info/minotaur-streak.htm)\n\n[http://www.moonglow.net/ccd/pictures/rocket/index.html](http://www.moonglow.net/ccd/pictures/rocket/index.html) \n\n[https://www.space.com/299-mystery-cloud-appears-eastern-canada.html](https://www.space.com/299-mystery-cloud-appears-eastern-canada.html)\n\n[https://www.afspc.af.mil/News/Article-Display/Article/251865/twilight-phenomenon-lights-up-sky/](https://www.afspc.af.mil/News/Article-Display/Article/251865/twilight-phenomenon-lights-up-sky/)\n\n[https://www.spacearchive.info/news-2018-09-09-bw.htm](https://www.spacearchive.info/news-2018-09-09-bw.htm)\n\n[https://www.spacearchive.info/pegasus-xl-trace.htm](https://www.spacearchive.info/pegasus-xl-trace.htm)\n\n[https://www.socal-skylights.org/sky\\_vandenberg.html](https://www.socal-skylights.org/sky_vandenberg.html)\n\n[https://www.nasa.gov/centers/goddard/news/topstory/2003/0630nightcloud.html](https://www.nasa.gov/centers/goddard/news/topstory/2003/0630nightcloud.html)",
                    "score": 14,
                    "author": "rocbolt"
                },
                {
                    "level": 1,
                    "comment": "Yes. This happens around sunset. Usually the rocket exhaust is not visible against the bright sky during the day.  Here the rocket roses above sunset and is in daylight again, letting the exhaust be visible in the low sun.",
                    "score": 5,
                    "author": "falco_iii"
                },
                {
                    "level": 1,
                    "comment": "It's the sunset, and also the launch site. You don't really see this effect well from Florida, because even when it's timed well, it'll be most visible way out at sea. But these launches from California take a different trajectory that has them paralleling the coast past LA, so when it does happen it's a lot more visible",
                    "score": 4,
                    "author": "SuperSMT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure what would make this less visible on the east coast.  Maybe less *notable* since Vandenberg launches are overall less common so they stand out more for locals?\n\n I've seen twilight plumes of SpaceX launches from Broward county. :)\n\nEdit: randomly-googled video of [crew 2 from Tallahassee](https://youtu.be/9xRjKoNUaFU), with a similar effect only before sunrise not after sunset so less people were awake for it.",
                            "score": 2,
                            "author": "MaritMonkey"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's my understanding that this effect happens because the first stage turns around and burns the opposite direction of the second stage. The exhaust of both rockets hitting each other becomes very visual, of course better seen at sunset or night time.",
                    "score": 2,
                    "author": "Aleczar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope this isn’t a stupid question, and I also hope someone with first-hand knowledge or something can help out, but: \n\nI don’t ever remember seeing these amazing cloudburst kind of exhaust things, these high atmosphere explosions of nebulous color. I grew up during the Space Shuttle’s heyday, but I’m not sure if this was a phenomenon then and just not covered (or poorly covered due to technological limitations), or if I just never saw it because I was a kid (and technological limitations), or something else. \n\nDid rockets always do this? Did we just not see it? Is this something new? I’m so into it!",
            "score": 3,
            "author": "HoodieGalore",
            "replies": [
                {
                    "level": 1,
                    "comment": "It just matters what time of day the launch is.\n\nDark at ground level but sun in high altitude.",
                    "score": 2,
                    "author": "WhiteMilk_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[source](https://youtu.be/OikIfj7Hh9Y)",
            "score": 7,
            "author": "LifeInverted"
        },
        {
            "level": 0,
            "comment": "So LA can see the rockets taking off from Vandenburg?",
            "score": 4,
            "author": "crazykitty123",
            "replies": [
                {
                    "level": 1,
                    "comment": "We can see these launches from Phoenix, AZ. They look just as spectacular from a distance.",
                    "score": 4,
                    "author": "oXGIpmuOvqIOiwtMlONL",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, I had no idea! We are like 25 miles away and it's awesome.",
                            "score": 1,
                            "author": "crazykitty123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really really cool.",
            "score": 2,
            "author": "Disastrous_Wonder178"
        },
        {
            "level": 0,
            "comment": "Is it sped up?",
            "score": 2,
            "author": "anal_probed2",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what a timelapse is",
                    "score": 5,
                    "author": "SendMindfucks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would have known that if I could read. Normal motion somewhere? I was just thinking how it looks like a nebula expansion.",
                            "score": 1,
                            "author": "anal_probed2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well that was cool as fuck",
            "score": 2,
            "author": "ThcDankTank"
        },
        {
            "level": 0,
            "comment": "Spectacular! I love launches of rockets.",
            "score": 2,
            "author": "AsuraOkami"
        },
        {
            "level": 0,
            "comment": "That was cool as hell.  Thanks whoever took this shot.",
            "score": 2,
            "author": "AutomaticRevolution2"
        },
        {
            "level": 0,
            "comment": "Space fart.",
            "score": 2,
            "author": "DirkDieGurke"
        },
        {
            "level": 0,
            "comment": "Sorry to be this guy, but this was in 2018, not 2020.",
            "score": 2,
            "author": "Zanisomori"
        },
        {
            "level": 0,
            "comment": "Looks like a supernova or a remnant of one",
            "score": 2,
            "author": "Economy_Succotash_15"
        },
        {
            "level": 0,
            "comment": "I wonder how many car’s worth of CO2 is released during each of these?",
            "score": 4,
            "author": "Deptofmotorweehicles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Each Falcon 9 launch produces 330,000 kg of CO2. A gallon of gas produces 8.9 kg, so 1.2 million miles in a Corolla. Or about 71 years of an average car in America - which is an interesting comparison. The average American who drives their whole lifetime will produce _roughly_ as much CO2 from their car as one Falcon 9 launch.",
                    "score": 43,
                    "author": "SuperSMT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or, perhaps put another way, the equivalent of 17,750 commute days.",
                            "score": 7,
                            "author": "Deptofmotorweehicles",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Just make sure you're separating your bottles and using paper straws mate.",
                            "score": 4,
                            "author": "Sebs82"
                        },
                        {
                            "level": 2,
                            "comment": "r/theydidthemath",
                            "score": 3,
                            "author": "AnInfiniteRick"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty irresponsible going to warp in the atmosphere. #LAdrivers",
            "score": 2,
            "author": "KaFaraqGatri07"
        },
        {
            "level": 0,
            "comment": "This was like 2018",
            "score": 1,
            "author": "Jzerious",
            "replies": [
                {
                    "level": 1,
                    "comment": "Correct. It was the SAOCOM-1A launch in October 2018. Here’s [another time lapse.](https://youtu.be/KP4fIwD99gs)\n\nEdit: typo",
                    "score": 3,
                    "author": "KristnSchaalisahorse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " Video is from 2018, and it was the first time a falcon 9 landed on land at Vandenberg",
                            "score": 2,
                            "author": "Jzerious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, oops. Complete typo. Thanks.",
                                    "score": 2,
                                    "author": "KristnSchaalisahorse",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You good I thought I was going nuts. I was lucky enough to see this with my own eyes",
                                            "score": 1,
                                            "author": "Jzerious"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gonna admit that was a lot cooler than I thought it’d be.",
            "score": 1,
            "author": "FirePit45"
        },
        {
            "level": 0,
            "comment": "It'S a UfO",
            "score": 1,
            "author": "Spran02"
        },
        {
            "level": 0,
            "comment": "Uhh faarr out man!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "fart",
            "score": 1,
            "author": "bisgbro"
        },
        {
            "level": 0,
            "comment": "/u/gifreversingbot",
            "score": 1,
            "author": "DervishSkater"
        },
        {
            "level": 0,
            "comment": "The waters above…",
            "score": 1,
            "author": "Taxman24"
        },
        {
            "level": 0,
            "comment": "Wait so why do they cast magic spells?",
            "score": 1,
            "author": "thccdd"
        },
        {
            "level": 0,
            "comment": "I’m guessing those are drones following the rocket?",
            "score": 1,
            "author": "AssStuffing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just planes over Los Angeles, much closer to us than the rocket.",
                    "score": 1,
                    "author": "KristnSchaalisahorse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's beautiful, but how toxic is it?",
            "score": 1,
            "author": "Thameus",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s mostly CO2 and water vapor.",
                    "score": 2,
                    "author": "KristnSchaalisahorse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They made the fortnite rocket event into a real thing",
            "score": 1,
            "author": "lennoxbr"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was the launch of SAOCOM-1A in 2018. Crew Dragon didn’t launch until 2019 and its in-flight abort test occurred during the daytime in Florida in January 2020.",
                    "score": 1,
                    "author": "KristnSchaalisahorse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fast forwarding of the video makes it look like the end of the world",
            "score": 1,
            "author": "ItzMani_reddit"
        },
        {
            "level": 0,
            "comment": "what the hell did i just watch",
            "score": 1,
            "author": "LoganTakesPictures"
        },
        {
            "level": 0,
            "comment": "I went outside and screamed… it was during the North Korea nuke scares… I had a full on moment lol",
            "score": 1,
            "author": "itsalwaysblue"
        },
        {
            "level": 0,
            "comment": "That's cool!",
            "score": 1,
            "author": "_Internet_Hugs_"
        },
        {
            "level": 0,
            "comment": "I almost had a heart attack when it came back down, there was no warning. The police didn't even know what was going on...my family still makes fun of me.",
            "score": 1,
            "author": "zomanda"
        },
        {
            "level": 0,
            "comment": "Aurora Borealis Americana",
            "score": 1,
            "author": "ewslash"
        },
        {
            "level": 0,
            "comment": "The city, the rocket, and all the aircraft flying makes this a pretty fair representation of the modern world.",
            "score": 1,
            "author": "Tripdoctor"
        },
        {
            "level": 0,
            "comment": "Rockets are so cool. I have a strange obsession with them.",
            "score": 1,
            "author": "_____dragon"
        },
        {
            "level": 0,
            "comment": "What are the vapors produced from the launch?",
            "score": 1,
            "author": "InnerPick3208"
        },
        {
            "level": 0,
            "comment": "I was too distracted by the airplane traffic, that was fascinating",
            "score": 1,
            "author": "imsimplyellie"
        },
        {
            "level": 0,
            "comment": "All those drones. Jeez",
            "score": 1,
            "author": "danielhogan141"
        },
        {
            "level": 0,
            "comment": "hitting 88mph",
            "score": 1,
            "author": "rurtr"
        },
        {
            "level": 0,
            "comment": "Fortnite chap 1 season 4",
            "score": 1,
            "author": "Xxb1g_Ba11zxX"
        },
        {
            "level": 0,
            "comment": "Looks environment friendly",
            "score": 1,
            "author": "steaveaseageal"
        },
        {
            "level": 0,
            "comment": "Imagine if people from 100 years ago saw this video",
            "score": 1,
            "author": "Earth2099"
        },
        {
            "level": 0,
            "comment": "No one was moving faster than him at that moment.",
            "score": 1,
            "author": "Huntderp"
        },
        {
            "level": 0,
            "comment": "I helped launch that rocket! :D",
            "score": 1,
            "author": "Currently_There"
        },
        {
            "level": 0,
            "comment": "The blue color reminds me of when a nuclear reactor starts up.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Beautiful",
            "score": 1,
            "author": "fikasss"
        },
        {
            "level": 0,
            "comment": "This is one of the coolest videos I’ve seen in a while. I love the general aesthetic, even without the awesome dusk plume launch. Props to the og op!",
            "score": 1,
            "author": "Horsetoothbrush"
        },
        {
            "level": 0,
            "comment": "Look this AWESOME Timelapse what I found!:  https://www.youtube.com/watch?v=siJH08v6DzA&amp;t=20s&amp;ab\\_channel=MundoCurioso",
            "score": 1,
            "author": "Alternative-Plum2619"
        },
        {
            "level": 0,
            "comment": "33x the speed of sound 🔥🔥🔥",
            "score": 1,
            "author": "ThiqCoq"
        }
    ]
}