{
    "id": "126rsdd",
    "score": 2812,
    "title": "Summoning the Mechanical Demons",
    "author": "Worried-Tomato7070",
    "date": 1680193275.0,
    "url": "https://www.reddit.com/r/woahdude/comments/126rsdd",
    "media_urls": [
        "https://v.redd.it/6jrn24k51yqa1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/WoahDude! \n\n* Check out what counts as \"woahdude material\" in our [**wiki**](https://www.reddit.com/r/woahdude/wiki/index#wiki_woahdude_material).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/woahdude) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Song ID?",
            "score": 41,
            "author": "iyayo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Vexed (feat. Xo Man) - MEMBA, WiDE AWAKE",
                    "score": 67,
                    "author": "Reggaeneric",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Came to find this info, just wanted to say thank you!",
                            "score": 6,
                            "author": "breathless_RACEHORSE"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This belongs in r/DMT",
            "score": 24,
            "author": "Joebiwan13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bro, this was literally my first fucking thought. It is fascinating how similar DMT trips are for everyone. The vast alien landscape and the beings that are there guiding you like ambassadors to a new world, yeah?",
                    "score": 3,
                    "author": "Docc_Sampson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me and the boys about to have the best DND session of all time",
            "score": 19,
            "author": "123Ros",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely some math rocks in there",
                    "score": 3,
                    "author": "EngineeringOne1812"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone else get kind of a headache feeling from these AI transitions? They really don't sit well with me.",
            "score": 91,
            "author": "theveryrealreal",
            "replies": [
                {
                    "level": 1,
                    "comment": "I used to think they were cool, I think they've kinda run their course at this point tho",
                    "score": 52,
                    "author": "SirWilliamGrello",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah can we please have woah dude without this ai garbage?",
                            "score": 10,
                            "author": "holenek"
                        },
                        {
                            "level": 2,
                            "comment": "Don’t worry, ai is improving so fast that there will be a new trend",
                            "score": 1,
                            "author": "Additional-Cap-7110"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hate them.  I keep thinking that at any moment it will turn into the most horrific image I’ve ever seen.",
                    "score": 22,
                    "author": "mickfly718",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Like that will smith creature thing? Ugh horrible.",
                            "score": 4,
                            "author": "J3wb0cca"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s the laziest content to make so it’s gonna keep getting posted.",
                    "score": 13,
                    "author": "Jackary1220",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is this lazy? I don't know how much effort it takes to create the prompts, but the editing looks and sounds like it took some effort.",
                            "score": 3,
                            "author": "rememberaj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Compared to other things that people have made themselves? Incredibly.",
                                    "score": 1,
                                    "author": "Jackary1220"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "literally me in stellaris",
            "score": 9,
            "author": "thiccboi6942014"
        },
        {
            "level": 0,
            "comment": "So these are the guys that will replace us when ChatGPT becomes sentient",
            "score": 26,
            "author": "Pharmasochist",
            "replies": [
                {
                    "level": 1,
                    "comment": "becomes lol",
                    "score": 4,
                    "author": "get_the_reference_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All I can hear is a power washer now",
            "score": 2,
            "author": "Rags2Rickius"
        },
        {
            "level": 0,
            "comment": "Doomguy would like to have a *word* with you",
            "score": 2,
            "author": "Roses_Got_Thorns"
        },
        {
            "level": 0,
            "comment": "I need the Version for the whole Song, please\n\nThat's amazing and awesome",
            "score": 2,
            "author": "resoredo"
        },
        {
            "level": 0,
            "comment": "Slower and smoother would make it cooler to me",
            "score": 3,
            "author": "iknowneemoose",
            "replies": [
                {
                    "level": 1,
                    "comment": "[more your style?](https://www.instagram.com/reel/CpYR9THjDuS/?igshid=YmMyMTA2M2Y=)",
                    "score": 6,
                    "author": "Worried-Tomato7070",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Both are awesome to me.  The music is anyways.  Don't need the visuals but this link I find more appealing.\n\nWhere could I find music [like this.](https://www.instagram.com/reel/CpQO3EhJtb4/?utm_source=ig_web_button_share_sheet)",
                            "score": 2,
                            "author": "tobias_the_letdown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's just lofi hip hop my guy. Look it up on youtube or search chillhop(same thing).",
                                    "score": 3,
                                    "author": "myhamsareburnin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I listen to lofi girl from time to time but wasn't sure if there was a particular genre name for it.",
                                            "score": 1,
                                            "author": "tobias_the_letdown",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There are near infinite number of arbitrarily named subgenres you can find on youtube. It's a relatively new genre and the artists are essentially exclusive to soundcloud and youtube so the genre itself isn't super refined to the point that everyone can agree on how they would classify themselves and others into subgenres. Your best bet is to just dig. Comb through a few playlists on youtube and see if the artists are credited. Find the artists on soundcloud and make a playlist yourself. You may have luck just letting soundcloud recommend songs based on the playlist as well. Good luck! Sorry it's not easier to find that particular sound you're looking for.",
                                                    "score": 2,
                                                    "author": "myhamsareburnin"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely! Thanks for sharing",
                            "score": 2,
                            "author": "iknowneemoose"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow! \n\nWhat a trip!",
            "score": 2,
            "author": "whiteybirdtherooster"
        },
        {
            "level": 0,
            "comment": "Woooooah!!!!",
            "score": 4,
            "author": "Dealer_Different",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude",
                    "score": 3,
                    "author": "Mrorange002"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[more here](https://instagram.com/ryan.gor.don)",
            "score": 4,
            "author": "Worried-Tomato7070",
            "replies": [
                {
                    "level": 1,
                    "comment": "What programs do you use to make these? Very cool",
                    "score": 3,
                    "author": "AhweezyF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Stable Diffusion",
                            "score": 3,
                            "author": "SeagullMan2"
                        },
                        {
                            "level": 2,
                            "comment": "I'm curious to",
                            "score": 0,
                            "author": "RedSprite01"
                        },
                        {
                            "level": 2,
                            "comment": "Yes I'm interested too",
                            "score": 0,
                            "author": "mrtrajic1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh.  More soulless Stable Diffusion.",
            "score": 4,
            "author": "ricdesi",
            "replies": [
                {
                    "level": 1,
                    "comment": "you might be surprised at how much human effort went into making this!",
                    "score": 12,
                    "author": "Worried-Tomato7070",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought it was dope as fuck. I'd love to go to a show with this playing in the background synced up to the music.",
                            "score": 4,
                            "author": "Cordell-in-the-Am",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Look up RL grimes set at Porter Robinson’s Second Skyfest . His set had these type of visuals and it was so fucking good",
                                    "score": 1,
                                    "author": "ChefLambsauce1"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Significantly less than the artists whose work this program ripped off",
                            "score": 7,
                            "author": "IdRatherBeLurking",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Truth.",
                                    "score": 3,
                                    "author": "DrProfJd"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Less than those who actually learned how to create art without telling a program to do it for them.\n\nAnd less than it would have taken you to cultivate actual artistic skill for yourself.",
                            "score": -4,
                            "author": "ricdesi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh look it's you again, would you prefer we throw photoshop and blender out the window too? We can all learn how to make oil paint from scratch so we can truly be authentic. Oh wait, we should also go harvest the ingredients for them so that nobody else contributed to our efforts... Better just stick with charcoal and cave walls.",
                                    "score": 5,
                                    "author": "2nd-Law",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is barely a coherent statement.",
                                            "score": -1,
                                            "author": "DrProfJd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Coherency coming up:\n\nI think that AI/Machine learning collages take effort to mold to be as you like them, and plenty of people find plenty of fulfillment and true creative expression by using them. I think the mindset of 'soulless digital smear' is an insult to the creative process of these people, even if you don't understand how much creative effort goes into something being born.\n\nMy point with oil paints is that even at the very base, someone else is always making our creative process possible. I won't even go into ethics of art production here since I think all of our tools are somewhat born out of exploitation at mass scale anyway, but point being you can't make anything except maybe cave wall art with charcoal without someone else's input and legacy. This is just a different way of doing that. Photoshop was created by someone, Blender was created by someone, all of the things you come up with are there because of someone else.",
                                                    "score": 3,
                                                    "author": "2nd-Law",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Neither the manufacturing of paints and brushes, nor the coding of software that allows editing of photos or creating GART are in any way equatable to models trained on completed works born from human artists. The foundation of your argument is severely flawed at best, and at worst you’re not actually familiar with how the renders generated from text input are made. There is no creativity in this, and the outputs are entirely created from work found online and fed to the model. To equate the human labor of mixing compounds to achieve a specific color which is then sold for a profit to something like DALL-E is just outlandish.",
                                                            "score": 0,
                                                            "author": "DrProfJd",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's a new thing, yeah. Ethics can be discussed, and I think there are plenty of things that could be done better. I said I didn't want to make that the main point of my reply, but here we go I guess. I think it is funny to think that most things that we use in our daily lives, without a hitch of our conscience more than every once in a while, would be any more ethical than these models. I don't see any reason to start feeling moral pangs over this than the use of my smartphone, which I deem valuable enough to justify the exploitation that \"\"\"\"\"inevitably\"\"\"\"\" goes into its production. Arguably in a much more tangible manner. Well, maybe you're a saint in your life. I don't know. I'm not, not in use of AI models nor clothes, food, electronics or personal gas powered vehicle. Nor so many other things. It is my way of being in the world, I use things that are born out of exploitation for my own enjoyment sometimes. I bet 99% of us do. Unethical? Yeah sure. Inconsistent? I don't think so. I think I do so many things way more unethical than this without even noticing.\n\nThe question of creativity in this? Well... I'm not going to get through to you, because the reality of it is inconceivable to you. I don't see shaping the parameters of a complicated string of images to be created with Stable Diffusion to form an animation with a specific look any different than making a 3d model in Blender. Just the method of inputting data is different, but workflow is very similar in terms of trial and error, adjustment and such. \n\nTake a look at this video and the making of video and say there was no creativity in it. And yes, less complex things than this are still creative, even if there was no real life footage included, in my opinion.\nhttps://youtu.be/GVT3WUa-48Y\n\n\nEdit: btw, I am a creative for 15 years already, and I've done everything from video and music to writing different styles. Once you discover the depth of some of these tools, you can spend thousands of hours learning. That is not a joke. But, maybe you will use the strategy of invalidating my experience of creativity by making me incapable of understanding it as an experience or concept, in your head. Everyone who doesn't agree with my idea of creativity is living an illusion. The DALL-E example is just kind of bad faith, because it's literally the most surface level of these tools. It's the microsoft photo viewer compared to Photoshop and Blender. There are REMARKABLY complex implementations of these AI tools out there, which nobody really knows how to use yet.",
                                                                    "score": 3,
                                                                    "author": "2nd-Law"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Tell us more",
                            "score": 1,
                            "author": "rashnull"
                        },
                        {
                            "level": 2,
                            "comment": "What was your motivation to making this art? It's wildly unsettling and makes me incredibly uncomfortable. Im not telling you this with any mal intent. Im just curious what's driving your desire to make this.",
                            "score": 1,
                            "author": "Rtyano"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is totally awesome 👍😎",
            "score": 3,
            "author": "Putrumpador"
        },
        {
            "level": 0,
            "comment": "Duuuuude!",
            "score": 2,
            "author": "ElMuffinHombre"
        },
        {
            "level": 0,
            "comment": "AI-generated junk has so little appeal to me.",
            "score": 1,
            "author": "IdRatherBeLurking",
            "replies": [
                {
                    "level": 1,
                    "comment": "It all looks the same in the end, too.  Just a digital smear of empty, emotionless wank.",
                    "score": -1,
                    "author": "ricdesi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well said.",
                            "score": 0,
                            "author": "IdRatherBeLurking"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Archnodeities aren't pleased with the decisions made by the earthlings and have taken matters into their own hands",
            "score": 1,
            "author": "MeetingGod"
        },
        {
            "level": 0,
            "comment": "Top notch keyframing!",
            "score": 1,
            "author": "metasuperpower"
        },
        {
            "level": 0,
            "comment": "This is awesome. It's like a stable diffusion version of my BigGAN visualizer (https://www.instagram.com/deep_music_visualizer). I have been meaning to make this but got busy. Good work.\n\nHow automated is the video generation process? Are the properties of the music tied in some way to parameters of the model, or to the input vectors? What sort of custom settings do you initiate the video with?\n\nYou should open source the code (if you haven't). The people who are going to pay you $150 for one of these will still pay you, and the world will be better for it!",
            "score": -1,
            "author": "SeagullMan2",
            "replies": [
                {
                    "level": 1,
                    "comment": "You assume OP made it rather than just posting something trippy they found.",
                    "score": 0,
                    "author": "Starfleeter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "post history",
                            "score": 1,
                            "author": "SeagullMan2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anything with AI should be down voted… this is just rubbish…",
            "score": 0,
            "author": "rothersidelife"
        },
        {
            "level": 0,
            "comment": "somehow reminds me of Destiny",
            "score": 1,
            "author": "AaayJaayy"
        },
        {
            "level": 0,
            "comment": "r/aiart",
            "score": 1,
            "author": "agaric"
        },
        {
            "level": 0,
            "comment": "Has this been created using Midjourney or ChatGPT or something?",
            "score": 1,
            "author": "kbxads"
        },
        {
            "level": 0,
            "comment": "Tap on a clip to paste it in the text box. A",
            "score": 1,
            "author": "bluebeeinyourbonnet"
        },
        {
            "level": 0,
            "comment": "This shit wild",
            "score": -1,
            "author": "ImurderREALITY"
        },
        {
            "level": 0,
            "comment": "this is what it's like to see in all the universes in the multiverse at once",
            "score": -1,
            "author": "FAmos"
        },
        {
            "level": 0,
            "comment": "I saw The Bald one",
            "score": 0,
            "author": "JappySWAG"
        }
    ]
}