{
    "id": "12kgufv",
    "score": 3997,
    "title": "Different animals taking a trip",
    "author": "JHAllen123",
    "date": 1681372976.0,
    "url": "https://www.reddit.com/r/woahdude/comments/12kgufv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Some Midjourney gems I made.",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/WoahDude! \n\n* Check out what counts as \"woahdude material\" in our [**wiki**](https://www.reddit.com/r/woahdude/wiki/index#wiki_woahdude_material).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/woahdude) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Ah, yes, my favourite animal: The Yeti.",
            "score": 260,
            "author": "heyoyo10",
            "replies": [
                {
                    "level": 1,
                    "comment": "He even has sunglasses 😎",
                    "score": 28,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And the Sunglasses are reflecting the city, where he's taking a trip to!",
                            "score": 9,
                            "author": "heyoyo10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably LA",
                                    "score": 3,
                                    "author": "i_give_you_gum"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ah yes, you ever seen one in the wild? Amazing!",
                    "score": 1,
                    "author": "Hoovi420"
                },
                {
                    "level": 1,
                    "comment": "The dog in the snowy background is not having a good trip",
                    "score": 1,
                    "author": "LadiesMan-2I7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "my personal favourite is the AI trying to mimic real artists signatures in the bottom right of the second one. nothing says ai is art theft quite like that",
            "score": 23,
            "author": "otterkin"
        },
        {
            "level": 0,
            "comment": "Looks like NFTs. (derogatory)",
            "score": 251,
            "author": "Winterflan_",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol (actually)",
                    "score": 47,
                    "author": "itsToTheMAX"
                },
                {
                    "level": 1,
                    "comment": "Love the bracket usage",
                    "score": 8,
                    "author": "joeban1"
                },
                {
                    "level": 1,
                    "comment": "As an NFT can look like anything, sure why not 🤷‍♂️",
                    "score": -45,
                    "author": "FrozenJester",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NFTs are typically characterized by uninspired, ugly, generic, generative art such as this.",
                            "score": 14,
                            "author": "Winterflan_"
                        },
                        {
                            "level": 2,
                            "comment": "Why do they all look like *that* then?",
                            "score": 42,
                            "author": "TexRichman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Must be where you're looking then. There's very few of my NFTs that the art actually maters, the NFT isn't the art, its the technology behind it.",
                                    "score": -42,
                                    "author": "FrozenJester",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My brother in Christ it’s just money laundering. You can say it. The rich have been doing it for **years** but at least they have the decency to pretend the art is good.",
                                            "score": 42,
                                            "author": "SadisticAI",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sure, its an easy way for people to launder money, but that's not to say that's all the technology is good for. At its heart its a non fungible digital asset the power of which is only just starting to be truly developed.",
                                                    "score": -23,
                                                    "author": "FrozenJester",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What are some potential use cases for this bold new technology?",
                                                            "score": 18,
                                                            "author": "TexRichman",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "As a computer scientist, I just started making popcorn for the entertainment that will come out of this question 🍿",
                                                                    "score": 19,
                                                                    "author": "mistahspecs",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That sounds like a made up career, how would you even fit the computer in a test tube?",
                                                                            "score": 3,
                                                                            "author": "sillyslime89",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Transistors keep gettin' smaller and smaller!",
                                                                                    "score": 6,
                                                                                    "author": "mistahspecs",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well with non fungible digital assets the potential is only limited by the developer. Some projects use NFTs as access tokens into their communities, as simple as if the person owns one of their NFTs that person can then access gated content in their discord server. Or if you want something more tangible there are record labels that payout song royalties to the holders of the NFTs that represent that song. Snoop is planning on turning Death Row Records into such a label. And yes you can do these things by other means, but the beauty with NFTs is that you can then sell your NFT to someone else when you no longer want it.   \n\n&amp;nbsp;\n \nI don't blame people for thinking NFTs are only garbage art used to launder money, its clear that main stream media doesn't understand technology in general, they only report on something if its spicy and disregard any actual info.",
                                                                    "score": -6,
                                                                    "author": "FrozenJester",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; And yes you can do these things by other means, but the beauty with NFTs is that you can then sell your NFT to someone else \n\nLol.\n\nSo basically the only use for NFTs is marketise functions that already exist. Sounds really shitty!",
                                                                            "score": 16,
                                                                            "author": "TexRichman",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "🤷‍♂️ Its okay, you may not get it yet, people didn't understand email when it first came out. But as younger generations grow up in a pure digital world, they'll understand why non fungible digital assets are important, they'll see that NFTs represent digital ownership.",
                                                                                    "score": -8,
                                                                                    "author": "FrozenJester",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "None of those things became possible when NFTs were created. Every single thing you just listed has already been possible, but the advantage of NFTs is that they were trendy enough to use as a buzzword to make unremarkable existing things sound exciting to gullible people. It was one thing to fall for that hype in 2021, but I can't believe you're still making these claims in 2023.",
                                                                            "score": 6,
                                                                            "author": "mistahspecs",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You can do countless things multiple ways, so I don't understand your objection. NFTs allow you yet another venue to represent ownership, they just have the added benefit of being able to transfer that ownership in a trustless environment. \n\n&amp;nbsp;\n\nLook it's not difficult people, NFTs are just a digital assets that represents ownership in a trustless environment. The \"art\" of an NFT is just an attribute of the NFT, it is not the NFT its self.",
                                                                                    "score": -2,
                                                                                    "author": "FrozenJester",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So yeah it does nothing new or of value but you still think it does or will one day.",
                                                                            "score": 1,
                                                                            "author": "stackered"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It's not going to be used that way, but that was a good way to hype NFTs to people who don't know they are completely useless scams in the short term. So, you were sold on it and hopefully haven't spent a lot of money or time implementing NFTs.",
                                                            "score": 1,
                                                            "author": "stackered"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "But what's even the point behind the technology, and why hasn't it been used for an anything useful yet?",
                                                            "score": 1,
                                                            "author": "Panzer_Man",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does the first picture look like the post I saw on r/ExpectationvsReality of a cute animal that turned out looking like that",
            "score": 12,
            "author": "JustChiLingggg"
        },
        {
            "level": 0,
            "comment": "AI art is getting old already.",
            "score": 524,
            "author": "mrrtchbrrx",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's sad because if it had been two years ago and this was guaranteed to have been made by a person I would have been super impressed. And today if it was made by a person I would have been like \"meh it's probably AI generated\"",
                    "score": 230,
                    "author": "Kriztauf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These look like images you'd have found on school folders back in the 90s/00s. You'd probably have had a similar reaction 2+ years ago. They're visually appealing, but they also feel very generic. It's like if hotel art were trippy. You may not be able to articulate exactly why they're not impressive, but I don't think it's just that it was made by an ai",
                            "score": 104,
                            "author": "impy695",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Good art made by humans is influenced strongly by purely human qualities that the people perceiving it also experience. We’re much more sensitive to powerful image language than AI will ever be.",
                                    "score": 22,
                                    "author": "noobductive",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Given the progress we've seen over the past few years, I wouldn't take that bet. It's gonna keep getting better and better",
                                            "score": 12,
                                            "author": "ninepointsix"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yea also AI art is dog shit",
                                            "score": 14,
                                            "author": "The_Crisp_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "AI art is 90% borrowing from expressionism, but bad because it’s always literal interpretations of whatever meaning people tell it to turn into an image. \n\nNice art is, more often than not, image and meaning being created alongside each other. It’s also much more than mathematics.",
                                                    "score": 7,
                                                    "author": "noobductive",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "AI is just a tool, it will never replace real artist",
                                                            "score": 9,
                                                            "author": "DeutschFlanker",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It’s a tool that makes art look like it was made by someone with dementia trying to remember how something looked like",
                                                                    "score": 7,
                                                                    "author": "The_Crisp_",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It also doesn’t help that it has 0 texture as if a printer was told to be a graphic designer",
                                                                            "score": 4,
                                                                            "author": "noobductive"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Maybe because it's just drawing a basic shape?",
                                                                            "score": 1,
                                                                            "author": "DeutschFlanker",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No, because it takes every example of something and basically just condenses it into one image",
                                                                                    "score": 2,
                                                                                    "author": "The_Crisp_",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It most surely will replace artists.  Imagine the self check outs at grocery stores.  One cashier watches over 10 registers.  AI can produce art faster than a human.  One artist with skill in Midjourney will be able to do the work of 10 artists in less time.\n\nNot all artists will be replaced but a lot of them will. And as an artist myself you bet you're ass I'm learning all the AI art generation tools.",
                                                                    "score": 3,
                                                                    "author": "wildstarr",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "If AI art becomes actually good, then yea that’s true but if what we see is the AI at its peak then there’s no chance, like it can’t even give people 5 fingers for god’s sake. It also doesn’t help that rather than basing images off a few sources, the AI just mashes it all up into one image leaving what you get when you tell a dementia patient to draw something from memory.",
                                                                            "score": 1,
                                                                            "author": "The_Crisp_"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "it can be ok if you know what you're doing, but it always lacks something. Or rather has this thing about it that just tells you it's AI, it's not the hands or anything but a lot of the AI art has this weird feel to it that I can't really describe",
                                                    "score": 2,
                                                    "author": "GhostSniper1296",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The best description of AI art is someone with dementia trying to draw something from memory. You can kinda tell what it is but there are so many basic mistakes that you would think they never saw it before.",
                                                            "score": 2,
                                                            "author": "The_Crisp_"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; These look like images you'd have found on school folders back in the 90s/00s.\n\nThat is both extremely specific *and* extremely accurate.",
                                    "score": 3,
                                    "author": "TheVicSageQuestion"
                                },
                                {
                                    "level": 3,
                                    "comment": "Trapper Keeper or bust, yo.",
                                    "score": 2,
                                    "author": "dogeatcateatmouse"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, the work/animation isnt as special and impressing anymore, even if its still looking good. Makes the human creativity and especially the execution of the (creative) concept/idea kinda obsolet to an extend.",
                            "score": 13,
                            "author": "yelljell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Like what's the point of being impressed with a guy who just told an AI to make the art?\n\nLike with real drawings and animations, you know they spent time and effort to make it look that good, but with AI you know he told an algorithm a few words and it made some stuff for him instantly.\n\nThere's no work or soul here.",
                                    "score": 34,
                                    "author": "DaSomDum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm fine with AI art as long as it's used conceptually or it has been heavily altered to fix mistakes with editing software to the point that you can't tell it was generated. \n\nI absolutely don't like seeing people try to pass off AI art as their own completely unedited, like this post, because for the most part I was immediately able to tell this was made by an AI.",
                                            "score": 10,
                                            "author": "Leetzers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As a composite artist and professional photographer of many years this is where I'm at. I use stable diffusion to do a lot of things very quickly that used to take me a long time. It's a fantastic tool to add to your work flow. The only annoying thing for me is that many people for some reason won't even accept that much. I've just given up telling anybody I used SD as a tool to help me create x image, because I start getting all this hate, people telling me how much worse it looks etc.\n\n... If I just don't mention it, then everything is fine and it \"looks so much better\" despite nothing being different. I imagine as time goes on people will accept that artists will use it as a tool like anything else in digital art. It's not going anywhere. I think the novelty of images literally straight out of mid journey/Stable Diffusion that don't have any extra human input will quckly wear off.\n\nAI allows artists to do amazing things, some things that previously were not possible. AI Images on their own will always have their uses (stock images, reference/concept work, easy b/g art for indie games... Things like that) but won't be able to stand on their own. Art needs to be more than just an image - which I think photographers understand well. I haven't met one yet who didn't \"get\" it when it comes to AI art and its potential, as well as its weaknesses.",
                                                    "score": 2,
                                                    "author": "Quivex",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; I use stable diffusion to do a lot of things very quickly that used to take me a long time.\n\nWhat sort of things do you use it for?  I really don't know much about it at all!",
                                                            "score": 2,
                                                            "author": "cuckoocock"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree. I personally use stable diffusion to help me come up with ideas. I'll render batches of what I want, tweak the prompt until I have something close to what I was thinking of to use as a reference when making my own art.",
                                                            "score": 2,
                                                            "author": "Leetzers"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "No no, you're supposed to hate it unequivocally. Nuanced opinions based on experienced aren't allowed here.",
                                                            "score": 1,
                                                            "author": "jamesp420"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s not just about the time it takes to make that specific image. The whole artist’s life and lifelong process is visible in those pieces. It takes all the time you’ve been alive to reach that point. AI art has no soul because it’s isolated from everything else.",
                                            "score": 2,
                                            "author": "noobductive"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "do you recognize a pattern here?",
                                            "score": 3,
                                            "author": "r3itheinfinite"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "When everyone is an artist, then no one will be.\n\nI honestly believe AI will be the death of visual art.  Just imagine the logical conclusion of all this…\n\nTalent, practice, hard work and time have always been the gate-keeper and rate-determining factor for human creative output. Separates the wheat from the chaff.  Now, with some well crafted sentences, you can create a digital painting that is indistinguishable from one drawn by a highly technically proficient human artist, or write pages of grammatically perfect copy in minutes.\n\nWe also possess, at our fingertips, the ability to instantly share everything we create, with everyone, everywhere, at all times.\n\nNow, combine these two things and we it seems we are about to experience an overwhelming flood of AI-generated content across all channels, that will absolutely drown out, and render worthless, human-created creative content.\n\nEveryone, everywhere with the ability to churn out slick-looking content in minutes and share it with everyone, everywhere. \n\nThe next Da Vinci could come along, and we’ll never know, because the signal will be drowned out by the noise.",
                                    "score": 3,
                                    "author": "Mr_Rekshun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think this will end visual art, I’m an art student. We’re making that partly for ourselves, or just because we do, not for a true purpose. Art is as old as humanity itself. It comes naturally, it’s part of existence. You can’t delete that. If your art is ruined because of AI, it wasn’t good in the first place. We are above all that and always will be. It’s so interwoven with perception and senses itself, it’ll never stop existing, because art was never invented, it just “is”. \n\nAI art is also really, really generic and obvious. They tend to portray things super literally because that’s what the majority of art does. But art that really sticks, doesn’t do that. You look at it, and you understand what it is. \n\nBad art tells you how to feel and that’s exactly what AI always does. AI art is also static whereas human made art is much more shapes and contrast and light that interrupt each other with thought put behind everything. Human brains are still the superior machines for things as sensitive and powerful as visual art. \n\nAI simply makes calculations and works over-all whereas human made art is much more than mathematics and is vastly different depending on when, where, by who, and countless other factors that may have taken thousands of years to align to create exactly this artwork. Only this image fits with what it communicates directly to our perception, and only that “meaning” so to speak fits with that image (it doesn’t have to be put into words, it exists in our brains as an abstract feeling-like concept).\n\nTo create AI that makes it instead, you’re inherently reducing what art is.\n\nSensible people will always value human-made art much more because they can appreciate that its flaws and irregularities and dynamic nature makes it much better.",
                                            "score": 5,
                                            "author": "noobductive",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It doesn’t even matter about the qualitative output of human va AI art - most of that is subjective anyway. \n\nWhat matters is the volume. The scale. The noise. \n\nArt has existed since humans could express themselves, but it has never had to truly compete with anything for airspace - the last 70-odd years have seen marketing, advertising and capitalism put a fair bit of noise into the art sphere.  Now, AI will drown it out completely.",
                                                    "score": 1,
                                                    "author": "Mr_Rekshun"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If Da Vinci was alive today he'd probably be deep into SD right now. \n\nPeople are sore they spent decades perfecting a craft that can be replicated. Musicians probably felt the same way when recordings were first made. \"What, you don't need to hire me to play this anymore, it just plays itself?\" And yet, art continued and even improved. \n\nGood artists and AI users make better stuff than people smashing in random prompts, but random prompts still look better than the first 500h of someone's art career. \n\nDownvotes are everywhere but they won't change anything. AI is the new photoshop tool. Use it or don't, but it'll give anyone a huge advantage.",
                                            "score": 2,
                                            "author": "OrderOfMagnitude",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s all about the signal and the noise. \n\nWe’re about to lose that signal to the noise.",
                                                    "score": 1,
                                                    "author": "Mr_Rekshun"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lack of Creativity: AI-generated art is created using algorithms and pre-defined rules, which limits its ability to create truly original and unique artwork. The machine may be able to generate millions of different variations of a particular style, but it can't come up with something completely new on its own.\r  \n\r  \nLack of Emotional Depth: Art is often created to evoke emotions and convey a message or story. However, AI-generated art lacks the emotional depth and complexity of human-made art. It may be aesthetically pleasing, but it does not have the same level of emotional impact or cultural significance.\r  \n\r  \nDependence on Human Input: While AI algorithms can generate images and patterns, they still require human input and guidance to produce art that is coherent and meaningful. Artists must provide input in the form of training data, design specifications, and aesthetic preferences.\r  \n\r  \nLegal and Ethical Issues: There are also legal and ethical issues surrounding AI-generated art. For example, who owns the copyright to the artwork created by an AI algorithm? Is it the artist who trained the algorithm or the machine itself?\r  \n\r  \nReproducibility and Mass Production: AI-generated art can be easily reproduced and mass-produced, which can undermine the value and uniqueness of the artwork. This also raises questions about the authenticity and originality of AI-generated art.\r  \n\r  \nBias and Discrimination: AI algorithms are only as good as the data they are trained on. If the training data contains bias or discrimination, the AI-generated art may also reflect those biases. This raises concerns about the social and cultural impact of AI-generated art.\n\n&amp;#x200B;\n\n**AI wrote this.**",
                            "score": -9,
                            "author": "Tigerkix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah and my eyes glazed over reading it.",
                                    "score": 12,
                                    "author": "TexRichman"
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah and it reads like an AI wrote it",
                                    "score": 3,
                                    "author": "otterkin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; And today if it was made by a person I would have been like \"meh it's probably AI generated\"\n\nThat cynicism is also already old",
                            "score": 1,
                            "author": "viperex"
                        },
                        {
                            "level": 2,
                            "comment": "In a way it has since AI needs source material to do it's \"magic\".",
                            "score": 1,
                            "author": "Ostracus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yeah and it's super weird we can figure it out like immediately like me brain new from the jump it was AI.",
                    "score": 38,
                    "author": "Ithasbegunagain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; me brain new from the jump\n\nThis is some good shit right here",
                            "score": 28,
                            "author": "pimp-bangin"
                        },
                        {
                            "level": 2,
                            "comment": "We recognize individual artists' styles, I think it's the same with AI.",
                            "score": 8,
                            "author": "FloobLord",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah AI seems to have this weird habbit like it doesn't understand the underlying shape of an object or piece of the art so it just makes it a smooth wobbly mess. The perspective is off in the weirdest ways as well.",
                                    "score": 3,
                                    "author": "Ithasbegunagain"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Be careful with that.  There's already been some people affected by people assuming they can pick out AI art 100% of the time",
                            "score": 2,
                            "author": "ImpossiblePackage",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So fuckin boring",
                    "score": 49,
                    "author": "teedster"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I'm really starting to think that AI art needs a general ban in most of the art/picture subs (including this one). It's something the communities should debate, but I just don't think it's sufficiently creative.",
                    "score": 38,
                    "author": "Mysterions",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its still an creative idea by op to create these images and prompts even if it's ai generated, the images themselves look cool and that's what matters.",
                            "score": -31,
                            "author": "Laurenz1337",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I dunno man, \"animals on drugs\" isn't the most creative prompt, especially when there's a movie in theaters right now called Cocaine Bear. I used to work at a T-shirt shop where half the shirts where just animals with sunglasses on LSD. I don't care if the prompt wasn't creative if the art is still created by a talented artist, but here the prompt was the only thing created by the artist, and it's a pretty generic prompt.\n\nedit in response to the conversation below:\nThis comment was not intended to disparage AI art, it was intended to disparage an uncreative prompt. I believe that AI art will keep getting more and more indifferentiable from non-AI art, but I'm impressed by creativity and skill, and the only skill involved here is thinking up creative ideas. In my opinion this post failed to deliver on that",
                                    "score": 24,
                                    "author": "HughJamerican",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If what I see looks cool I don't care how it was created tbh. A lot of people are so pretentious when it comes to AI art.\n\n It's like when you eat something and it tastes good but aren't sure what it is and then getting the ick after finding out it's something you usually don't like.",
                                            "score": -17,
                                            "author": "Laurenz1337",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Mate, in the coming years you are about to be flooded with so much instant, disposable, AI-generated art that looks “cool”, that cool itself will die.",
                                                    "score": 11,
                                                    "author": "Mr_Rekshun",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ehh, the \"cool\" bar will just be higher than it is now. There will always be content that stands out from the rest, even in the age of AI generated content.",
                                                            "score": -6,
                                                            "author": "Laurenz1337",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I think you’re underestimating just how much new content there will be. \n\nSignal and the noise.\n\nIt’s about to get deafening.",
                                                                    "score": 1,
                                                                    "author": "Mr_Rekshun",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's why we have reddit where cool content is upvoted and reposts and low effort posts are down voted",
                                                                            "score": 0,
                                                                            "author": "Laurenz1337",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Have I got news for you, this post *is* low effort. All they had to do was put \"Tiger on drugs\" into a prompt and boom they get their image.",
                                                                                    "score": 2,
                                                                                    "author": "NewmanBiggio",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;First, it is ridiculed. Second, it is violently opposed. Third, it is accepted as being self-evident.",
                                                    "score": -5,
                                                    "author": "FloobLord",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't really get the point you are trying to make, but you do you.",
                                                            "score": 6,
                                                            "author": "Laurenz1337",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The response to AI reminds me of the response to a lot of other technologies that are now a fundamental part of the modern experience. First people mock it and ignore it. Then there's a violent backlash and people try to ban it. Finally, it's just everywhere all the time and if you try to push back against it, you get mocked and called \"out of touch\".",
                                                                    "score": 4,
                                                                    "author": "FloobLord",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Ah, I see. I agree with that. I just like to skip to the last bit right away and don't bother with mocking/backlashing and embrace it from the start when it comes to new interesting technology like AI (art).\n\nPeople tend to be scared of things they don't understand.",
                                                                            "score": 1,
                                                                            "author": "Laurenz1337",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah I've gotten there too as I've gotten older. I don't have the emotional energy leftover from life to spend on bullshit I can't change anyway.",
                                                                                    "score": 3,
                                                                                    "author": "FloobLord"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Ideas are worthless without the ability to execute them.\n\nNow, any muppet with an adequate computer can execute their “brilliant” ideas, thus rendering technical skill and execution to be as worthless as ideas have always been.",
                                    "score": 5,
                                    "author": "Mr_Rekshun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh but you see, there is definitely some skill involved in getting really good AI art, these examples are quite basic. It's a new technical skill that artists and other professionals will need to adapt to stay relevant in their roles. Like it or not, this is what the future is.",
                                            "score": -1,
                                            "author": "Laurenz1337"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What was creative was all the art that the AI was trained on without any compensation to the original artists.  And don't say \"that's how human artists learn too!\" because it's not.",
                                    "score": 9,
                                    "author": "robodrew"
                                },
                                {
                                    "level": 3,
                                    "comment": "that's like saying the \"idea man\" who contributes nothing but paying their app developers in \"Exposure\" is a valuable member of the team.",
                                    "score": 9,
                                    "author": "Jeran",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They aren't saying OP is a valuable member of the team, they are just saying the images look cool so it's not like the images themselves suddenly become valueless. You can look at an image and still think it looks cool, maybe even get inspired to create something of your own, without the image being generated by a human. If you can't, well tough shit because we're heading into a world where most people are going to use AI assistance of some kind to start creating art.",
                                            "score": -2,
                                            "author": "pimp-bangin"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How does that compare to this case? People post things they didn't make on here all the time. This time, op actually had the idea to create these cool images and they get hate for it.",
                                            "score": -9,
                                            "author": "Laurenz1337",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Everyone knows this. There's a reason that a photorealistic oil painting of a person is generally considered to have more artistic merit than a simple selfie.",
                                                            "score": 0,
                                                            "author": "TexRichman",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 2,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They do know this, they just don’t realize they do or are choosing to forget it.",
                                                                            "score": 0,
                                                                            "author": "TexRichman"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's trash.",
                    "score": 6,
                    "author": "dirtyword"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I made”",
            "score": 30,
            "author": "Nilbitz13"
        },
        {
            "level": 0,
            "comment": "You can almost always tell when you're looking at AI art and it doesn't look good.",
            "score": 16,
            "author": "SoraRoku"
        },
        {
            "level": 0,
            "comment": "Shoutout to all the Kings downvoting AI art",
            "score": 166,
            "author": "Pepperonidogfart",
            "replies": [
                {
                    "level": 1,
                    "comment": "This needs more upvotes",
                    "score": 19,
                    "author": "Left-Molasses4323"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Some Midjourney gems I made\" = False\n\n\n\n\"Some Midjourney gems **AI** made\" = True",
            "score": 96,
            "author": "DFalltidVS"
        },
        {
            "level": 0,
            "comment": "Some Midjourney gems I \"\"made\"\"",
            "score": 8,
            "author": "Charlie_cat16"
        },
        {
            "level": 0,
            "comment": "\"I made\"",
            "score": 6,
            "author": "dcvisuals"
        },
        {
            "level": 0,
            "comment": "“Making” anything with Midjourney. Really? You haven’t done anything man",
            "score": 6,
            "author": "Peterrefic"
        },
        {
            "level": 0,
            "comment": "You didn't make anything bruh. You entered a prompt into an AI picture generator",
            "score": 55,
            "author": "coolguyman87",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"made\"",
                    "score": 10,
                    "author": "sanjay_i"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just don't feel anything when I know math made this",
            "score": 29,
            "author": "signmeupnot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah, ever seen a video of a Lorenz attractor? Pure math and still more evocative than this.",
                    "score": 2,
                    "author": "ChillaVen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But still math and not a hand though?",
                            "score": -1,
                            "author": "signmeupnot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lame",
            "score": 39,
            "author": "Left-Molasses4323"
        },
        {
            "level": 0,
            "comment": "\"I made\" you didn't make anything you clown",
            "score": 41,
            "author": "Sada_sama"
        },
        {
            "level": 0,
            "comment": "An image of your turd in a bowl would have been more valued.",
            "score": 11,
            "author": "Skinny_Piinis"
        },
        {
            "level": 0,
            "comment": "I'm already annoyed at AI art. Yeah it looks \"cool\" but being able to already discern that it's AI generates just kills my interest",
            "score": 5,
            "author": "DarthNihilus1"
        },
        {
            "level": 0,
            "comment": "I was wondering why these all looked terrible, then I saw midjourney mentioned and it all made sense.",
            "score": 21,
            "author": "Longsword97"
        },
        {
            "level": 0,
            "comment": "what animals are these? am I stupid or are half of these just made up yeti/sasquatch pics",
            "score": 9,
            "author": "-Lady_Rainicorn-",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s AI generated trash",
                    "score": 20,
                    "author": "CaseFace5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You sound like a boomer when computers started taking off. \n\n“Calculators? Garbage, we just use our heads!”\n\nLots of hurt feelings with this comment apparently and no counter arguments",
                            "score": -19,
                            "author": "OneSidedCoin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you haven't heard any arguments against ai art yet, you're choosing to ignore them.",
                                    "score": 2,
                                    "author": "Slyckx",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That dog in the last picture is absolutely fucking *zooted*.",
            "score": 38,
            "author": "apathetic-drunk",
            "replies": [
                {
                    "level": 1,
                    "comment": "fucken ZONKED OUT",
                    "score": 0,
                    "author": "RedditGoldPog"
                },
                {
                    "level": 1,
                    "comment": "He's so zooted he should be on Pluto right now",
                    "score": -4,
                    "author": "Fluffy-Doubt-3547"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mehh",
            "score": 8,
            "author": "Fissionman"
        },
        {
            "level": 0,
            "comment": "AI art feels like the successor to shitty HDR. It's got that same kind of tacky schlocky quality.",
            "score": 3,
            "author": "SaintHuck"
        },
        {
            "level": 0,
            "comment": "So fucking sick of AI bullshit taking over every image sub",
            "score": 5,
            "author": "mrbulldops428"
        },
        {
            "level": 0,
            "comment": "Wow, you are SO good at putting in prompts! Great typing OP",
            "score": 10,
            "author": "5ahara"
        },
        {
            "level": 0,
            "comment": "In my late 30s, tried psychedelics for the first time this year, am genuinely pissed at how much ai art trappings (specifically hands looking wrong) influenced my visuals. I felt weirdly cheated, like whatever I would have come up with was co-opted by this shitty aesthetic that I got exposed to.",
            "score": 5,
            "author": "uhsurewhynott"
        },
        {
            "level": 0,
            "comment": "nice prompt you typed into a generator",
            "score": 3,
            "author": "sir_ruu"
        },
        {
            "level": 0,
            "comment": "I’ve been there, tiger #4. It’s alright.",
            "score": 3,
            "author": "shadow_specimen"
        },
        {
            "level": 0,
            "comment": "Picture 5 looks like Ron Perlman.",
            "score": 1,
            "author": "Dmacca666"
        },
        {
            "level": 0,
            "comment": "I really enjoyed these. Thanks for sharing.",
            "score": 0,
            "author": "beeroosterpineapple"
        },
        {
            "level": 0,
            "comment": "This honestly makes me not want to even bother being an artist anymore",
            "score": 1,
            "author": "FlacidBarnacle"
        },
        {
            "level": 0,
            "comment": "Yo, do you guys have a beer and cig I could bum?",
            "score": 1,
            "author": "fingerscrossedcoup"
        },
        {
            "level": 0,
            "comment": "U triggered ai haters are skyrocketing this post' engagement\n\nbtw, \"DA AI MADE IT NOT U\" no shit",
            "score": 1,
            "author": "YOLONarnia"
        },
        {
            "level": 0,
            "comment": "Anyone remember the movie \"The Spirit\" and the octopus?",
            "score": 0,
            "author": "shveylien"
        },
        {
            "level": 0,
            "comment": "Tripping is the one thing I have found that truly highlights how strange it is to be alive lol. It is like getting a complete objective look at existing, shits weird.",
            "score": -3,
            "author": "scribbyshollow"
        },
        {
            "level": 0,
            "comment": "These are awesome! Got more? And more importantly, what are their names?",
            "score": -16,
            "author": "umthondoomkhlulu"
        },
        {
            "level": 0,
            "comment": "Couldn’t even get the dilated pupils right.",
            "score": -2,
            "author": "BrocoliAssassin"
        },
        {
            "level": 0,
            "comment": "n3 has the vibe of the \"Lord of the boards\" that Guano Apes sing about.",
            "score": -1,
            "author": "Vitnage"
        },
        {
            "level": 0,
            "comment": "These look like those Trapper Keeper art from the 90s.",
            "score": 1,
            "author": "Dark_Mass_000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aww come on, those weren't that bad!",
                    "score": 1,
                    "author": "mistahspecs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome! Mind sharing some of your prompts?",
            "score": -8,
            "author": "cmack23"
        },
        {
            "level": 0,
            "comment": "The first one makes me want to play Black vs White",
            "score": -2,
            "author": "FrozenJester"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The last one reminds me of Fizgig from 'The Dark Crystal'.",
            "score": 0,
            "author": "multigrin"
        },
        {
            "level": 0,
            "comment": "That #7 is freaking baked, and i love it haha. New background foe my phone lolz, quess its somekinda doggo, but doesnt matter!",
            "score": -3,
            "author": "DueliaShivayah"
        },
        {
            "level": 0,
            "comment": "These pics are dope",
            "score": -5,
            "author": "Loli_huntdown"
        },
        {
            "level": 0,
            "comment": "I still think it’s cool",
            "score": -4,
            "author": "Eclipse_Tosser"
        },
        {
            "level": 0,
            "comment": "Is that the fucking Abominable Snowman",
            "score": 1,
            "author": "kattman03"
        },
        {
            "level": 0,
            "comment": " Whoa, im freaking out at some of them",
            "score": 1,
            "author": "TinyMarsupial7622"
        },
        {
            "level": 0,
            "comment": "I met these guys at Burning Man. They had some mighty powerful shit...\n\nOh and really great artwork...",
            "score": 1,
            "author": "thezenfisherman"
        },
        {
            "level": 0,
            "comment": "Oh wow. They are awesome",
            "score": 1,
            "author": "groovygranny71"
        },
        {
            "level": 0,
            "comment": "Did the mid journey generate this? May I have a prompt?",
            "score": 1,
            "author": "cloudy1gor"
        },
        {
            "level": 0,
            "comment": "I'd love to see something like #4 with a wolf!! Great work!",
            "score": 1,
            "author": "TherianRose"
        },
        {
            "level": 0,
            "comment": "Anyone else getting \"MidJourney\" vibes?",
            "score": 1,
            "author": "Many_Ad315"
        },
        {
            "level": 0,
            "comment": "Sass m8",
            "score": -1,
            "author": "pixelunit"
        },
        {
            "level": 0,
            "comment": "They all look like people.",
            "score": -4,
            "author": "GrassFireWater"
        },
        {
            "level": 0,
            "comment": "Ahhhh i need to have myself a cleansing trip soon",
            "score": -3,
            "author": "istealgrapes"
        },
        {
            "level": 0,
            "comment": "The first looks like a Tauren from WoW",
            "score": -3,
            "author": "AdmrlPoopyPantz"
        },
        {
            "level": 0,
            "comment": "Reminds me of when I watched Zootopia on acid",
            "score": -3,
            "author": "SevroAuShitTalker"
        },
        {
            "level": 0,
            "comment": "The bull is vibing!",
            "score": -4,
            "author": "pm-me-your-satin"
        },
        {
            "level": 0,
            "comment": "Disturbing but cool.",
            "score": -3,
            "author": "i-hoatzin"
        },
        {
            "level": 0,
            "comment": "2nd tiger is now my new lock screen",
            "score": -6,
            "author": "Fluffy-Doubt-3547"
        },
        {
            "level": 0,
            "comment": "Anyone know a service for ai generated gifs / animations ?",
            "score": -7,
            "author": "HackActivist"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The \"artist\" is already credited midjourney",
                    "score": 8,
                    "author": "lucq22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "bro its so amazing!",
            "score": -2,
            "author": "neffy_neff"
        },
        {
            "level": 0,
            "comment": "Animals are basically already tripping.",
            "score": -1,
            "author": "Trainer_Red_Steven"
        },
        {
            "level": 0,
            "comment": "Second to last one is looking squanchy",
            "score": -1,
            "author": "notkraftman"
        },
        {
            "level": 0,
            "comment": "wadayatalkinabeet",
            "score": -1,
            "author": "KinG-Mu"
        },
        {
            "level": 0,
            "comment": "I'd definitely party with that Yak",
            "score": -1,
            "author": "mrsnakers"
        },
        {
            "level": 0,
            "comment": "Weird and cool all at the same time✌🏻",
            "score": -1,
            "author": "Treehouse80"
        },
        {
            "level": 0,
            "comment": "o shit its fookin sassy mate, hey whatsgoinon",
            "score": -1,
            "author": "Paradizzer"
        },
        {
            "level": 0,
            "comment": "I’m saving this post. I don’t know why but it makes me happy.",
            "score": -1,
            "author": "iforgotwhereiparked"
        },
        {
            "level": 0,
            "comment": "Was hoping for a random Gary Busey, but Yeti works.",
            "score": -1,
            "author": "PaddyAllen"
        },
        {
            "level": 0,
            "comment": "More like, looking at different animals WHILE on a trip.",
            "score": -1,
            "author": "TheKlaxMaster"
        },
        {
            "level": 0,
            "comment": "I want that 4th one to be my wallpaper",
            "score": -1,
            "author": "Chaudsss"
        }
    ]
}