{
    "id": "qxm20v",
    "score": 72872,
    "title": "A billion is A LOT bigger than a million.",
    "author": "Charty2006",
    "date": 1637345633.0,
    "url": "https://www.reddit.com/r/woahdude/comments/qxm20v",
    "media_urls": [
        "https://i.redd.it/jmdvzpz1fl081.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/WoahDude! \n\n* Check out what counts as \"woahdude material\" in our [**wiki**](https://www.reddit.com/r/woahdude/wiki/index#wiki_woahdude_material).\n* Chill with us on [**Discord chat**](https://discord.gg/woahdude)! We play Among Us!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/woahdude) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "My favorite take on this: the difference between a million and a billion is about a billion.",
            "score": 4490,
            "author": "Misha_Vozduh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bezos might as well be destitute if he got down to only 1mil.",
                    "score": 840,
                    "author": "ItzSpiffy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Needs his Tres Commas",
                            "score": 335,
                            "author": "duaneap",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He needs doors that open like THIS...\n\nNot like THIS",
                                    "score": 85,
                                    "author": "DantifA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can see it.",
                                            "score": 28,
                                            "author": "duaneap",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've got three nannies suing me right now, one of them for no reason",
                                            "score": 15,
                                            "author": "LysergicOracle",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"Fuck you!\"\n\n*peels out*\n\n*circles back around*\n\n\"Fuck you in the ass\"\n\n*peels out*",
                                            "score": 9,
                                            "author": "Umutuku"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No, you’re really not my money man, because you HAVEN’T GIVEN ME ANY FUCKING MONEY",
                                            "score": 6,
                                            "author": "radmadicalhatter"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This guy fucks",
                                    "score": 84,
                                    "author": "elricooo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sotto Voce",
                                            "score": 18,
                                            "author": "dixon_myaz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That man I will pay you to fuck!",
                                                    "score": 5,
                                                    "author": "Ms_Alykinz"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly, it was a good movie. It’s the kind of action caper that I want to watch again.",
                                                    "score": 5,
                                                    "author": "TylerInHiFi",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I understood that reference",
                                    "score": 10,
                                    "author": "robsablah",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "*now that im spelling billion with an M*",
                                    "score": 2,
                                    "author": "Mydickwillnotfit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's a Chris Rock joke that goes \"If Bill Gates woke up with Oprah's money, he'd jump out a fucking window.\" Like, Oprah has 2.5 billion dollars, but that would represent a 98% loss of Bill Gates's money.",
                            "score": 44,
                            "author": "tmoney144"
                        },
                        {
                            "level": 2,
                            "comment": "Jeff Bezos is worth about $200B, so the same comparison for him would be him being as poor as someone with only $200 million…",
                            "score": 36,
                            "author": "yunus89115",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I'm much closer to being a millionaire than Jeff Bezos is.",
                            "score": 31,
                            "author": "PillowTalk420"
                        },
                        {
                            "level": 2,
                            "comment": "$1m is hardly even enough for a couple to retire…chump change.",
                            "score": 23,
                            "author": "NoAd8781",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "if you plan to only live 10 years and have everything paid off its fine. oh and you can barely do shit cause cause insurance is a bitch",
                                    "score": 16,
                                    "author": "RiskyFartOftenShart",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just a fun fact, brain cancer cost me 1.83 million dollars. 3 brain surgeries and a year of radiation and chemotherapy. 1 pill of my chemo medicine cost 6000 dollars. Insurance paid for almost all of it but I still have about 30K in out of pocket bills",
                                            "score": 49,
                                            "author": "Disabled_mf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just kidding btw, sorry you had to go through that. I can’t imagine what it’s like to have cancer let alone having to pay for treatment too. I hope that the rest of your life is long and healthy and you’re able to pay off your debt asap. Absolutely criminal…",
                                                    "score": 18,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Damn u are a disabled mf",
                                                    "score": 42,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Or more likely, brain cancer cost about 30k. The hospitals significantly over charge so that your insurance provider can pretend to be saving you a bunch of money. I 100% guarantee your insurance company didn't actually pay $1.8 million.",
                                                    "score": 8,
                                                    "author": "CakeDue693",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There's no way it's even close to 30k. The amount of (extremely high skill) labor, equipment, and medication required to treat brain cancer is just too high. I would be surprised if it were less than 300k and not surprised if it were over a million, even without gouging. On the other hand, brain cancer is rare enough that insurance companies can still make a profit via pooled risk.",
                                                            "score": 6,
                                                            "author": "kogasapls",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The funnest fact",
                                                    "score": 2,
                                                    "author": "MBizzle2186"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would be willing to bet that his expenditures exceed one million per day if you take everything into account that he’s financing.",
                            "score": 3,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "anymore we're all about broke at only a million. life is expensive af",
                            "score": 6,
                            "author": "RiskyFartOftenShart"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A millionaire is to a billionaire as a thousandaire is to a millionaire.\n\n^(Orders of magnitude are whack.)",
                    "score": 212,
                    "author": "Kidiri90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is true, but the richer you get the easier it is just just live off the absurd gains you make investing. So a billionaire is more than just a magnitude higher in practically to a millionaire.",
                            "score": 41,
                            "author": "TacticalSanta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because somewhere between a million and a billion there is an inflection point where the returns on your existing wealth exceed your cost of living. Everything after that causes a snowball effect where by just existing you are becoming wealthier.",
                                    "score": 50,
                                    "author": "Cartz1337"
                                },
                                {
                                    "level": 3,
                                    "comment": "Exactly. If you have 1M and you make 5% back from it then you've made $50K. Not bad!\n\nIf you have 1B and you make 5% back from it then you've made $50,000,000.",
                                    "score": 37,
                                    "author": "feed_me_churros",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is why people  are dumb when they say \"they don't have wealth -- its tied up in stocks\"\n\nEver heard of DIVIDENDS, bitch?",
                                            "score": 25,
                                            "author": "__D__u__n__d__e__r__",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not to mention that billionaires have far better ways of making money than the stock market.",
                                                    "score": 11,
                                                    "author": "SuperDryShimbun"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When you have a lot of stock/investments - you don't selll them or cash in the dividends - that's a huge waste.\n\nYou live on debt. Borrow at a super low rate which is way less than your investments are earning (why sell the investment). Most importantly, you're not taxed on money you borrow and not selling assets that go up in value or give you control of your company.\n\nSo your assets earn more money than the debt repayments so you come out ahead *and* when you die - your kids' inheritance has huge tax advantages. \n\nSo you get out of paying a huge chunk in taxes while alive and when you die the taxman loses his cut of everything you've earned.",
                                                    "score": 8,
                                                    "author": "KitchenNazi",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah. It's *directly* a thousand to a million is a million to a billion, but *it's more like* ten dollars to a million is a million to a billion.",
                                    "score": 13,
                                    "author": "gapball"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I guess its a good thing some millionaires are only worth like 800 million or so.",
                            "score": 42,
                            "author": "CanadianPanda76",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess it’s a good thing some thousandaires are only worth like 800 thousand or so.",
                                    "score": 34,
                                    "author": "Repulsive_Border_404",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "800k seems more significant relative to 1k than 800m to 1m in the intuitive part of my brain, probably because 800k is more tangible, i know what i can buy with it but have no idea what i could buy with 800m\n\nedit: everyone that has commented has completely misunderstood my point, it has nothing to do with the numbers...",
                                            "score": 29,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well generally speaking you’re sitting pretty with 1m or 800m. \n\nIf you’ve got 1k vs 800k... the lower end of that one probably means financial trouble if you don’t have a regular income.",
                                                    "score": 12,
                                                    "author": "FoxInCroxx",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I would have to try really hard to spend 800M. I could probably buy 100M in cars and 100M in real estate but after that I would just be spending more for the sake of spending.",
                                                    "score": 8,
                                                    "author": "Dopplegangr1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "you can easily buy one car for 100M and one real estate for 700M.",
                                                            "score": 6,
                                                            "author": "B4-711",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The seller would be super appreciative of that!",
                                                                    "score": 4,
                                                                    "author": "CanadianPanda76"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You could have it all. Everything.",
                                                    "score": 4,
                                                    "author": "LocoDiablo42"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I think it’s cause for us normal folk it’s easy to conceptualize that our 401k or something can easily go from 1k in our twenties to 800k in our 40s and 50s. We can’t conceptualize $800 million because we aren’t starting with anything",
                                                    "score": 4,
                                                    "author": "enjoytheshow"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Home ownership is the threshold. If you can own a home free and clear, the world really opens up to you. With $800k, you can do that. With 8k, you cannot. Not even close.",
                                                    "score": 3,
                                                    "author": "firematt422",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Ofc you do, just organize all your searches from highest price to lowest",
                                                    "score": 2,
                                                    "author": "mylifeispro1"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Anything you want, at any time, until the day you die",
                                                    "score": 2,
                                                    "author": "cdc030402"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or a thousandaire is to a dollaraire…",
                            "score": 6,
                            "author": "bonafidebob",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or a dollaraire is to a.. uhh.. idk someone with not a lot of money",
                                    "score": 4,
                                    "author": "BareBearFighter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or someone with not a lot of money is to someone deeply in the negative thousands of dollars",
                                            "score": 2,
                                            "author": "mgeln"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Y'all should check out /r/howbigisabillion",
                    "score": 102,
                    "author": "BeautifulPudding",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately a dead sub",
                            "score": 31,
                            "author": "TheEyeGuy13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not dead, just never took off! You can make it happen my friend.",
                                    "score": 45,
                                    "author": "BeautifulPudding",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They'd need at least a billion subs",
                                            "score": 29,
                                            "author": "Icantbethereforyou",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How much is that compared to a million?",
                                                    "score": 10,
                                                    "author": "Dxxx2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "About a billion more",
                                                            "score": 3,
                                                            "author": "B3NGINA"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "i guess we’ll never know",
                                                            "score": 2,
                                                            "author": "hydroude"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Well they've got about a billion to go",
                                                    "score": 2,
                                                    "author": "themisdirectedcoral"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s a THOUSAND millions",
                    "score": 58,
                    "author": "bringbackswg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a bag in front of you with $1 million in it. Think of how much it would change your life. What you could do with it. Now there's 1,000 of those bags. Each bag with the life changing $1 million. That's $1 billion. Do that again about 200 times (200,000 bags of $1 million) and that's Jeff Bezos...",
                            "score": 60,
                            "author": "raven12456",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Someone put it great the other day. If you made $100/hr 24/7 since the birth of Jesus, you would have less than 1% the wealth of elon musk.\n\n\nIt's about 1.7 billion.",
                                    "score": 89,
                                    "author": "chaotic910",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "this is one of those comparisons that I feel really hammers it home -- you don't earn a billion dollar by working, because you can't",
                                            "score": 77,
                                            "author": "SasparillaTango",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Was just tinkering with some math for perspective. If he spent 1m a day it would take 500+ years to spend all of his wealth. On his last day, he would still be a millionaire. For someone making $50k a year, it would take about 27 years (considering taxes) to make 1 million. In that time, Jeff would have spent 9+ billion, and still have 200+ billion left over.",
                                                    "score": 27,
                                                    "author": "chaotic910",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "does that include the billionaire's continued passive income just from having billions in assets?",
                                                            "score": 4,
                                                            "author": "SasparillaTango",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Bezos makes like $200 million a day doesn't he?",
                                                                    "score": 4,
                                                                    "author": "necromantzer",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "no clue, but lets say 5% growth on 200 billion per year divided by 365 days per year is\n27,397,260 per day\n\nSo he could spend a million a day every day forever and still have more money than when he started.",
                                                                            "score": 6,
                                                                            "author": "SasparillaTango",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "And yet he still can't be bothered to respond to my very nice letter asking for a measly million.",
                                                                                    "score": 6,
                                                                                    "author": "RabidHippos",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "More perspective, you are basing this on if he sold all his assets hid his money under his bed and spent 1 million a day in cash.\n\nHell even if that wealth was in a normal bank account with a simple interest rate he would probably make more than 365 million a year interest",
                                                            "score": 5,
                                                            "author": "Iphotoshopincats"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes you can, you work the system. I told my dad he should've bought an emerald mine inSA and I wouldn't have to work anymore, but nooooooo.",
                                                    "score": 4,
                                                    "author": "B3NGINA",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm not saying that Bezos isn't exorbitantly rich, but I think a lot of people overestimate exactly how many lives could appreciably be changed by $200B.\n\nWith your analogy, he could give 200,000 people $1M, or 400,000 people $500k. \n\nThere are ~330M people on the US. Let's say conservatively that 200M of them are working age and therefore could benefit from a Bezos Stimulus™. Everyone would get $1000 if his entire net worth was liquified and distributed to the eligible US populace (obv less if we sent it to everyone above 18).\n\nNow $1000 is still a lot of money, but consider that the US government sent almost every 18+ citizen almost $2000 last year and no one's lives changed appreciably.\n\nJeff Bezos is filthy rich, but he is not the sole reason that you (or any other American) may be struggling. He's certainly a great lightning rod for corporate greed criticism though.\n\nEdit: Since people are harping on the fact that Bezos is just one of many billionaires, let's do the same experiment with all [630 billionaires](https://questionerlab.com/how-many-billionaires-are-in-the-us) in the US. If we liquidated ALL of their assets and disbursed it equally among 320 million people, that's a one-time payment of $10,625 to everyone. Not a permanent raise, not a recurring payment, but a one time bought-a-scratch-off-and-won-10k moment. Now I'm not scoffing at $10k - I'd take it with a smile, but that's ten iPhones. Four MacBooks. A down payment on a car or (in some neighborhoods) a down payment on a very small house. \n\nUnless you are living in abject poverty, $10k is not life-changing money. It's very nice, but it's not life changing. It's less than one year of minimum wage salary.",
                                    "score": 25,
                                    "author": "TheMadFlyentist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The thing that's being ignored in that comparison though is that one is a single person and the other is one of the biggest, most powerful, most wealthy *governments* in the world.\n\nWe're not comparing apples to apples here. It's a single apple versus every orchard in a country.\n\nIt's absolutely ridiculous that one person is even able to accumulate that much wealth. I'm not full on the rich hate, but there are a lot of facets of that demographic that irk me.",
                                            "score": 27,
                                            "author": "Jumbojet777",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you, exactly my thoughts! The fact that ONE GUY would have been able to provide a covid relief package half the size of what the US government (who represent 300 million people) was able to give is fucking insane.",
                                                    "score": 9,
                                                    "author": "axolotl_1994",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So I upvoted this as I like the reasoning, however to counter this, imagine being able to give everyone one in the US 1000\nUSD… that’s an immense amount of money. I don’t think that the billionaires are to blame, more the governments.",
                                            "score": 5,
                                            "author": "Curious_Emu_7260"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; people overestimate exactly how many lives could appreciably be changed by $200B.\n&gt; \n&gt; With your analogy, he could give 200,000 people $1M, or 400,000 people $500k.\n\ninstead of dividing the money to single people let's spend the money intelligently to benefit the most people. now let's estimate again how many lives could benefit.",
                                            "score": 3,
                                            "author": "B4-711"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Jeff Bezos is filthy rich, but he is not the sole reason that you (or any other American) may be struggling. He's certainly a great lightning rod for corporate greed criticism though.\n\nI 100% agree but I also don't think it's right that the dude is paying people garbage wages while making literal billions per week. Yes, per week, not per month or year.",
                                            "score": 3,
                                            "author": "BashStriker"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Little too much sense, downvote",
                                            "score": 7,
                                            "author": "WredditSmark",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly. Million vs Billion is the same relative difference as $1 vs $1,000",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This visual usually helps:\n\nhttps://digbysblog.net/wp-content/uploads/2012/06/billion.gif",
                    "score": 9,
                    "author": "nomtimes3"
                },
                {
                    "level": 1,
                    "comment": "I've heard it this way, \"a billion minus a million is about a billion\"",
                    "score": 20,
                    "author": "Akilou"
                },
                {
                    "level": 1,
                    "comment": "to help put wealth into perspective for me was to think of a stair case where 100k in net worth is one stair.\n\nThe vast majority people live there entire lives between the ground and the third step.\n\nSomeone having done very well for himself having a net worth of 3 million  and are on the 30th stair which is half way between the first and second floor.\n\nElon musk is actually on the 2,860,000th stair and his staircase is 7 times higher than the moon.\n\nIt's not even really comparible",
                    "score": 7,
                    "author": "ameis314"
                },
                {
                    "level": 1,
                    "comment": "My proposition is to adopt an alternative spelling of «billion»: just use a thousand \"l\":\nbillllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllion",
                    "score": 5,
                    "author": "keepthepace",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And the difference between $10 and a cent is about $10",
                    "score": 10,
                    "author": "RationalRhinoceros",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "my favorite take is  \n  \nI dont have any need to count a billion of anything",
                    "score": 2,
                    "author": "tobor5"
                },
                {
                    "level": 1,
                    "comment": "Mine is someone who has $400 million is closer to being homeless than to being a billionaire",
                    "score": 2,
                    "author": "cybercuzco",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "And 1 trillion is 31,688 years, to give you a grasp of what is being spent nowadays",
            "score": 1039,
            "author": "grpagrati",
            "replies": [
                {
                    "level": 1,
                    "comment": "31 *millennia* is the way I like to put it, so you go from days to years to millennia as you go from a million to a billion to a trillion.",
                    "score": 233,
                    "author": "hankbaumbachjr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Warhammer 30k.",
                            "score": 52,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And we're just in time to say \"Fuck Erebus\"",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not literally though, you don't want his children be in 40k.",
                                            "score": 6,
                                            "author": "Donut_Police"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s a lot of wasted time.",
                    "score": 70,
                    "author": "MagicNipple",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why else would I be on reddit?",
                            "score": 16,
                            "author": "HooptyDooDooMeister"
                        },
                        {
                            "level": 2,
                            "comment": "Now think of $2 trillion and remember that the pentagon just basically admits it couldn't account for that amount. Like who knows where it went? And that was like 20 years ago. Who knows how much has been wasted? \n\nAnd on completely dumbass shit too. $400 billion for a jet that can't fly in the rain. Give me a break.",
                            "score": 6,
                            "author": "Salty_Pancakes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can fit a million dollars in a briefcase. A billion is a pallet load, a trillion is a warehouse full.",
                    "score": 8,
                    "author": "0ldgrumpy1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A trillion is a million briefcases.",
                            "score": 6,
                            "author": "Rhaedas",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Crazy that some individuals will soon have a trillion dollars. Nobody should have all that power.",
                    "score": 27,
                    "author": "BuddhistSagan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay Kanye",
                            "score": 14,
                            "author": "HealthyDoughnut",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The clock's ticking, I just count the hours",
                                    "score": 12,
                                    "author": "Kevl17"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The way I usually break this down is along the lines of:\n\n- About a million seconds ago, this month was just getting underway. \n- About a billion seconds ago [name a celebrity or shared acquaintance who's 31] was born. \n- About a trillion seconds ago, the homo sapiens were the last hominids standing and we were painting on cave walls with spit and ash. We had fire and speech but writing wouldn't show up for another 26 millennia.",
                    "score": 5,
                    "author": "GeekyAine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A man asked God: \"what's a million years to you?\"\n\nGod replied: \"to me it's only a minute\"\n\n\"And what's a million dollars?\"\n\n\"To me, it's only a cent\"\n\n\"So... can I have one of your cents?\"\n\n\"Sure, just give me a minute.\"",
            "score": 1373,
            "author": "Is_It_Beef",
            "replies": [
                {
                    "level": 1,
                    "comment": "So God’s an asshole? Given what I’ve read about them, it seems to be the case.",
                    "score": 354,
                    "author": "EventHorizonSurfer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now I don't want to start any blasphemous rumors, but I think that God has a sick sense of humor and when I die, I expect to find him laughing.",
                            "score": 196,
                            "author": "Kennfusion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*\"Ahahaha!* you slipped on friggin peanut butter and died you dumb meat sack. Welcome to round 2.\"",
                                    "score": 73,
                                    "author": "StopReadingMyUser",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Couldn’t blame ‘em in that case",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My life is PROOF that whatever higher power exists has a sense of humor and is laughing hysterically.",
                                    "score": 11,
                                    "author": "a-most-peculiar-girl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One of my favorite quotes is \"I'm proof there is a god because a fuckup like me couldn't have made it this far in life without divine intervention.\"",
                                            "score": 8,
                                            "author": "thattoneman"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I love Depeche mode.",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t want to sound like a queer or nothing, but I’d kind of like to make love to you tonight.",
                                            "score": 5,
                                            "author": "DeadliftsAndDragons",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sometimes only a man knows how to please another man.",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He’s always been a bit of a deadbeat dad.",
                    "score": 19,
                    "author": "duaneap",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's almost at big as a thousand is to a million!",
            "score": 394,
            "author": "xxVordhosbnxx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Move that decimal, baby!",
                    "score": 100,
                    "author": "conjectureandhearsay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aaaaw yeaaaa. You know what I'm talking about!",
                            "score": 39,
                            "author": "xxVordhosbnxx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Move that point girl, yea that's right, move it",
                                    "score": 8,
                                    "author": "Iniquities_of_Evil"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel like that's the best way to make people realize the difference honestly. Imagine what you could do with a thousand dollars vs a million.",
                    "score": 19,
                    "author": "Themlethem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but that's also why people get into trouble. You are comparing things with multiplication but we spend with addition and subtraction.\n\nTechnically $10 is also 1,000x bigger than a penny. But you wouldn't say \"imagine what you can spend with $10 compared to a penny!\" because the raw values are not very far apart.\n\nPeople have a hard time conceptualizing a billion dollars, even if they can understand \"$1,000 would buy me rent for a month, and $1,000,000 would buy me an extremely nice house in most places\". The mental map to 1,000 houses isn't as easy to conceptualize.",
                            "score": 26,
                            "author": "AchyBreaker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol these are always funny. Essentially it's saying did you know if you multiply a number by 1000 it's a lot bigger now?",
                    "score": 40,
                    "author": "JukeSkyrocker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 26,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Basically, people in general have *really* poor intuition when it comes to exponential growth.",
                                    "score": 13,
                                    "author": "ScanlationScandal",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Really the average person could probably come up with $1000 in a week or two. A million dollars is really out of reach for a lot of people in their lifetime. The same is for a millionaire vs a billionaire",
                            "score": 16,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s the crazy part to me, the power of 1000 going smaller is just as hard to grasp\n\nFrom 1000 to 1 to .001 it’s the same as trillion billion million. but then micro, nano, Femto, pico.  fitting trillions of segments into one meter is just as wild as trillions of meters",
                    "score": 3,
                    "author": "stribtw",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a thousand times larger. You can tell by the zeros.",
            "score": 303,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait if it's 000 times bigger isn't it just the same?",
                    "score": 50,
                    "author": "temsik1587againtwo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was going to send you £1000 , but you seem like the kind of person who'd be just as happy with £000, so enjoy....",
                            "score": 75,
                            "author": "bottomofleith",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "bro thank you you have no idea how much this means to me &lt;33\n\nI can see it in my account already, that was quick!",
                                    "score": 58,
                                    "author": "temsik1587againtwo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you need any more, you just say the word ;)",
                                            "score": 9,
                                            "author": "bottomofleith",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "*One thousand times a million, that's one billion!*\n\nSchoolhouse Rocks, anyone? No?",
                    "score": 4,
                    "author": "lovetron99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Square One TV! Feat. The Fat Boys\n\nhttps://youtu.be/qOYf_1I4VBQ",
                            "score": 2,
                            "author": "Scrooge-MacDuck",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think the point is people generally have a sense of time, because we experience time constantly and have references all around us. Most people don’t know what it’s like to be a millionaire, not to mention a billionaire.",
                    "score": 16,
                    "author": "FeelinJipper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You know how in Watership Down's rabbit language they have just one word for any number over 4? One, two, three, four, lots. And it's like aww, their little bunny brains can't count more. That's us once you get above a few thousand. Brains just give up. How much is a million? Lots. How much is a billion? Also lots.",
                                    "score": 9,
                                    "author": "jumpindryos"
                                },
                                {
                                    "level": 3,
                                    "comment": "Which is why scientific notation is very useful to learn. Once your knee jerk reaction to looking at big numbers is to compare the powers of 10 between the numbers it makes things a lot clearer.",
                                    "score": 3,
                                    "author": "Kribothegreat"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Isn’t this the easiest reference? I always just remember it’s one thousand million \n\nWhich is crazy enough for me without the time reference lol think of the difference between $1 and $1000 and now just add zeroes it’s crazy",
                    "score": 3,
                    "author": "Smathers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "\n\nRoughly one billion minutes ago, Jesus walked the earth.\n\nOne million minutes ago was 2019.",
            "score": 179,
            "author": "ryannefromTX",
            "replies": [
                {
                    "level": 1,
                    "comment": "Roughly one billion hours ago was when the first *Homo sapiens* walked the earth.\n\nOne million hours ago was still within the 20th Century.",
                    "score": 86,
                    "author": "ryannefromTX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1 million is big, 1 billion is a lot bigger.",
                            "score": 9,
                            "author": "alj101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "3 orders of magnitude bigger.",
                                    "score": 3,
                                    "author": "ath1337"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's been a looonnngg million minutes",
                    "score": 8,
                    "author": "Cm0002"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean, a billion is a thousand million. When you say it out loud like that, it really helps to put it in perspective. \n\n&amp;#x200B;\n\nA professional sports player making 10 million a year is closer financially to someone whos homeless than they are to a billionaire.",
            "score": 181,
            "author": "Rdubya291",
            "replies": [
                {
                    "level": 1,
                    "comment": "The lifestyle, happiness, security (any financial-related measure that matters) of a 10mil a year person is much closer to a billionaire's than that a homeless person.\n\nSaying \"it's less than half the number\" isn't saying very much.",
                    "score": 57,
                    "author": "SentimentalBear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you misunderstand what I said. I was speaking in honest financial terms. \n\n&amp;#x200B;\n\nWhy do you think so many sports players go broke when they're done? It's real damn easy to blow through 10 million. \n\n&amp;#x200B;\n\nStop trying to lump those in with the ultra rich. They aren't even in the same solar system.",
                            "score": 49,
                            "author": "Rdubya291",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; It's real damn easy to blow through 10 million. \n\nEspecially when you're spending it on blow.",
                                    "score": 21,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that's why you spend some of it on a money person. it'll last you a lot longer",
                                            "score": 5,
                                            "author": "iohbkjum",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My money person did coke too, and the money went even faster.",
                                                    "score": 5,
                                                    "author": "Not_usually_right",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't forget the hookers!",
                                            "score": 2,
                                            "author": "hybridtheory1331"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;\tWhy do you think so many sports players go broke when they're done? It's real damn easy to blow through 10 million.\n\nIs it more than 50%? Because if it’s not that’s completely irrelevant, the majority of them don’t end up homeless do they?\n\nGoing by the actual metric instead of a fabricated one, they aren’t closer to homeless are they?",
                                    "score": 2,
                                    "author": "TruthPlenty"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So if someone have 300 billion ,he can spend 300$a second for 31.5 years ,how ridiculous",
            "score": 72,
            "author": "Character-Quiet-78",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;So if someone have 300 billion ,he can spend 300$a second for 31.5 years ,how ridiculous\n\n\nIf someone had $300 billion they could spend $300 a second for 31.5 years and have probably a few **trillion** left in the end after factoring in an average return on investments.",
                    "score": 51,
                    "author": "IAmNotOnRedditAtWork",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "they'd have 930bil left, assuming the average annual return at 6% and the $300 is pre-tax.",
                            "score": 14,
                            "author": "saruptunburlan99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;they'd have 930bil left, assuming the average annual return at 6% and the $300 is pre-tax.\n\nBillionaires tend to land a fair bit above that 6% average.   \n&amp;nbsp;  \nEither way the answer can reasonably be boiled down to \"A lot more money than they started with\".",
                                    "score": 7,
                                    "author": "IAmNotOnRedditAtWork"
                                },
                                {
                                    "level": 3,
                                    "comment": "This is one of those things I feel people forget about when talking about this much money...",
                                    "score": 4,
                                    "author": "hobk1ard",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but bro didn't have toilet paper",
                            "score": 11,
                            "author": "extraextramed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He probably had some thot lickin his booty after he dumped",
                                    "score": 3,
                                    "author": "Wah_Gwaan_Mi_Yute",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Forbidden bidet",
                                            "score": 6,
                                            "author": "extraextramed",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I thought Masa Musa topped the list?",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's too hard to accurately calculate the net worth of historical figures. \n\nWe have a list of historical figures we know for sure were absurdly rich, but it's basically impossible to rank them.\n\nAugustus Caesar personally owned Egypt among other things. How do you calculate the value of Egypt ? And he is one of the figures we know relatively lot about.",
                                    "score": 11,
                                    "author": "Tomi97_origin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Blackrock shareholders should top that",
                            "score": 2,
                            "author": "Character-Quiet-78",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ayy my 401k is blackrock",
                                    "score": 2,
                                    "author": "Wah_Gwaan_Mi_Yute"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is a lot of hookers and blow per second",
                    "score": 3,
                    "author": "3n07s"
                },
                {
                    "level": 1,
                    "comment": "That much is essentially impossible to spend. A billion will net you $50,000,000 a year in income, even if only indifferently invested. Three hundred billion would net you about a fifteen billion a year, in income. \n\nYour hypothetical $300 a second spending spree would leave you making around 5 billion a year.",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ffs",
                            "score": 3,
                            "author": "Character-Quiet-78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They could spend more **a lot** more than that. If you follow the 4% rule, you can spend 4% of your total invested amount (in a broad stock market fund) per year, forever. So that’s $12 billion per year forever, or $380 per second for the rest of time.\n\nThat’s over $2,000 spent in the time you took to read this comment.",
                    "score": 3,
                    "author": "dirty_cuban"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And A trillion seconds is 31,688 years. \n\nIf you started counting 31,688 years ago, you would be at 1 trillion now. \n\n\nWhen you started counting, the world was unrecognizable.\n\nPeople had only began utilizing fire and wearing clothes.\n\n\nThe Sahara would have been wet and fertile.\n\n\nMost the world was neck deep in an ice age\n\n\nThe first humanoids were inhabiting Ireland,\n\n\nNeanderthals were probably living alongside Human, or extinct already\n\n\nI'm Recalling vaguely from memory, these could be argued to be 5000 years either side, or wrong, it's not my field really",
            "score": 22,
            "author": "drQuirky",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the info, super interesting,  \"at\" is so interesting, people wanted to draw or depict things that were important to them so long ago, the link is paywalled though.",
                            "score": 2,
                            "author": "drQuirky"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine buying a million dollar house, in cash.  Then buy a thousand more.  Literally an entire fairly large suburb of really nice house.  Bought and paid.  $1 billion.  Aka 0.5% of bezos wealth.",
            "score": 23,
            "author": "hippychemist",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Take the billion, deposit it in some shit bank at the lowest interest possible, make 0.2% annually or whatever, which is 2 million.  Paid 2 million a year just to have a billion.  Or pay someone a million to handle your investments and he'd make you 20 mil annually without fail.\n\nYou'd have to try to go broke, or the system would have to fail, for these guys or any of their offspring to ever even become regular wealthy.\n\nEdit: 0.2% (which is very generous for a random savings account or whatever), not 2% (which is 20mil, not 2mil), which still wouldn't be hard to get from investing in bonds or whatever.",
                            "score": 5,
                            "author": "hippychemist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2% of a billion is 20 million.",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I meant .2%, but you're right.",
                                            "score": 2,
                                            "author": "hippychemist"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I assume you mean net worth. Because often Redditors conflate the worth of all assets vs amount of liquid cash. Billionaires also purchase assets which appreciate in value. Which further decreases total liquidity.",
                    "score": 6,
                    "author": "Mumphord123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're right.  \n\nThey also take out loans against their investments instead of liquidating assets to buy more shit, using the gains on their investments to pay off the interest of their loans.  Free money.",
                            "score": 5,
                            "author": "hippychemist"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No one needs a billion fucking dollars.",
            "score": 110,
            "author": "ahabentis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imagine getting a billion (just ONE billion) dollars today.\n\nLet’s see, I’ll get myself started with a REALLY nice house. Let’s say, $20M. A couple around the world in fact, let’s buy 3.\n\n$940M left\n\nGotta get between those houses somehow. Let’s buy a nice private jet, those go for about $50M new.\n\n$890M left\n\nNeed some sort of hobby, maybe I’ll collect sports cars. 10 at $5M each.\n\n$840M left\n\nOk, let’s talk recurring expenses.\n\nCosts some money to run those houses. A reasonable guess is that a larger house costs about 1% of the house value between taxes, maintenance, etc. so let’s round up and say a million dollars a year between 3 of them.\n\nDefinitely going to need some people to take care of these houses, let’s say a high end butler ($150k), 3 housekeepers ($60k each), and a pilot ($200k). Wage bill per house is now $550k per year. So like $1.5M per year.\n\nNeed to fuel and run the plane. These things cost maybe $3000/hr to run, and I fly 20 hours per week between my houses. $60k per week, $3M per year.\n\nNo point in being rich if you don’t eat well. I’m going to spend $1k a day just on eating out. $365k per year.\n\nEverybody needs fun money. For some it’s an extra glass of wine after work, for others it’s dropping $50k a day on I don’t even fucking know what. Maybe art or something, or heaven forbid, charity. Whatever you’re spending it on, that’s about $18.25M/year.\n\nHave I described a pretty decent lifestyle? Honestly I’m having trouble thinking of anything else to spend it on that makes even the slightest difference to the overall numbers. Well, it adds up to about $25M a year. 4% interest on $840M is $33.6M per year. With one billion dollars, you could live like that forever, with $8M a year to spare and without ever touching the principal.",
                    "score": 84,
                    "author": "werdnum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.youtube.com/watch?v=0J6BQDKiYyM",
                            "score": 12,
                            "author": "S0phon",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I saw the 940 million and 800 something… and Kept thinking they were the totals… for each paragraph.\n\nI couldn’t figure out what point you were making.\n\nMine is quit drinking when you can’t comprehend things…",
                            "score": 8,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "As much as we all hate billionaires, it is quite important to note that just because they are a billionaire doesn’t meant they have a billion dollars sitting in the bank ready to be spent. The vast majority of billionaires net worth is tied up in investments, stocks, property etc. A very small fraction of it is held in cash.\n\nDon’t get me wrong, more cash than most of us will ever see in our lifetime, but it’s not their entire net worth.",
                            "score": 7,
                            "author": "DatBiddlyBoi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Need to 'borrow' $50M? No problem.\n\nAnd at super low interest rates that the average person can't get.",
                                            "score": 4,
                                            "author": "fordprecept"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean yes, but the entire point of my comment is that you don’t even need to touch 85% of the billion dollars to have a life I can scarcely imagine. Presumably that 85% can be locked up in some investment that earns at least 4% revenue per year. So what you’ve said is entirely consistent with my comment.",
                                    "score": 5,
                                    "author": "werdnum",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I do",
                    "score": 7,
                    "author": "jwcoffee"
                },
                {
                    "level": 1,
                    "comment": "I don't care if they have it, as long as they pay the same tax rate as I do.",
                    "score": 39,
                    "author": "seabass233",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair, they should pay MORE.",
                            "score": 27,
                            "author": "Organic_M",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They should, but I'd settle for just closing the loopholes that allow them to pay nothing.",
                                    "score": 8,
                                    "author": "JerHat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is exactly where I was coming from.\n\nThe uber-rich can direct a relatively small amount of their wealth to lawyers and accountants who help them avoid paying their fair share of tax.  \n\nIt's baffling that these loopholes are allowed to exist.",
                                            "score": 6,
                                            "author": "seabass233",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same?… why same? They have a billion dollars.",
                            "score": 42,
                            "author": "bwolf180",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "same RATE, so same % of total salary.. not the same",
                                    "score": 17,
                                    "author": "ohtisNA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, they don't thanks to the hundreds of loopholes for S-corps, capital gains, stepped-up basis, loss carry-forward, etc. Billionaires have paid an average income tax rate of 8.8% for the past decade, which is less than the lowest tax bracket that taxes people 10% on up to $9,950 of annual incomes below $22,900.\n\nAside from that, the idea that everyone should pay the same rate in taxes is highly regressive, meaning it disproportionately affects the poor. The goal should be an adequately progressive income tax with several tiers. In order to amass their wealth, the wealthy have utilized many more public resources than the poor have, so they should pay higher taxes.\n\nA more progressive income tax is definitely not going to solve everything, but it's a start. The rest of the solution involves addressing capital gains taxes and issues like stepped-up basis and the inheritance tax, corporate taxes, tax loopholes, tax breaks (we give more away in tax breaks every year than we spend in the entire federal budget), and the ability of the rich to take out large, low-interest loans using their stocks as collateral to avoid taxes, etc., but those are very complicated, very nuanced issues.",
                                            "score": 23,
                                            "author": "KarmaticArmageddon",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They don't make a fucking salary",
                                            "score": 3,
                                            "author": "rainingcomets"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "People with the highest earnings should (and are required to by law) pay a much higher rate on their earnings above a certain amount. A flat rate of tax like you seem to be suggesting would effectively be making the rich even richer and the poor poorer than the current system.\n\nIn the UK, where I'm from, income between £12,500 and £37,500 is taxed at 20%, income between £37,501 and £150,000 is taxed at 40% and anything above that at 45%. A similar system is in place in the US (although lower rates generally).\n\nWhat you are suggesting is, with the greatest of respect, absurdly right wing",
                                            "score": 8,
                                            "author": "Chudraa",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Here's my favorite way of saying it. If I spent $100,000   a day, it would only take me 10 days to waste a million. Now, if I spent 100,000 a day, it would take me 27 years to waste a billion.",
            "score": 3,
            "author": "1Someone435"
        },
        {
            "level": 0,
            "comment": "Wrong sub.  \n  \nSidebar:  \n&gt; We are specifically made for PSYCHEDELIC CONTENT, trippy or mesmerizing stuff that will make a sober person feel stoned, or stoned person trip harder!",
            "score": 17,
            "author": "Bugbread",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea, but did you think of the political narrative?",
                    "score": 6,
                    "author": "BuffaloTracedBody"
                }
            ]
        },
        {
            "level": 0,
            "comment": "31,600 years.\n\n1 Trillion Seconds.",
            "score": 2,
            "author": "Blox64_120"
        },
        {
            "level": 0,
            "comment": "and a trillion is 31.5 thousand years.",
            "score": 2,
            "author": "LeeKinanus"
        }
    ]
}