{
    "id": "146r07t",
    "score": 59,
    "title": "If a P.I. recorded me illegaly, does their evidence become inadmissible?",
    "author": "welldamn713",
    "date": 1686481090.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/146r07t",
    "media_urls": [],
    "other_urls": [],
    "postText": "(Texas) My daughters paternal grandparents hired a private investigator to follow me. This private investigator recorded videos of me walking around my bedroom through my windows. I've been told by a local police officer and another private investigator that what they did is illegal. If this is true, does that mean that the evidence they submit becomes inadmissible? The grandparents are trying to sue me for custody as retaliation for putting their son in prison. He got sentenced to 25 years by a jury.",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; If this is true, does that mean that the evidence they submit becomes inadmissible?\n\nNot automatically, no.  The evidence may be inadmissible in some contexts, but not in others.  \n\nAs an example, if that recording was indeed illegal but caught you doing something else illegal, then that recording would likely be admissible in a criminal trial against you.",
            "score": 50,
            "author": "dean_of_gcc",
            "replies": [
                {
                    "level": 1,
                    "comment": "None of it is for a criminal trial, it's all for a family case. They're claiming I was smoking illegal substances but everything I smoked was purchased at my local smoke shop. I've kept the receipts and even some of the containers. Where I live, there are legal derivatives of thc you can purchase at any smoke shop (delta 8/9, thc-a, thc-p, things like that) But they're making it out like I'm some slimy drug addict who constantly has hooligans around my child. They claimed to witness me smoking out of a bong (haven't even had one in almost four years) claimed I have an unknown female roommate living with me (I dont) and a bunch of other absolutely false things. I've already suffered with agoraphobia, PTSD, Stockholm syndrome, depression, anxiety,  sleep disorders, all because of what their son did to me. I've been in intensive therapy. And now I cant even eat a bowl of cereal in my own room without people recording me. I have no peace of mind anymore. I cant even get a pizza from the grocery store without it being reported. Its disturbing and makes my skin crawl. I'm tired of being harassed by that family. But they're multimillionaires who have -always- just been able to pay to have their problems go away. They're retaliating against me because their son got convicted to 25 years in prison for trying to murder me and his ex neighbors. In their mind, I hurt their precious family image and now they're stopping at nothing to make my life a living hell.",
                    "score": 27,
                    "author": "welldamn713"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I've been told by a local police officer and another private investigator that what they did is illegal.\n\nAre you sure they had the full details of the situation when they told you that? I'm not particularly sure about Texas, but in most states it's not illegal to record someone through a window from a public place. Close the curtains.",
            "score": 12,
            "author": "Feisty-Method-3561",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's much more fact specific than that.  For example if they entered private property to get access to the window.",
                    "score": -8,
                    "author": "signious",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;if they entered private property\n\nYeah, which wouldn't be a public place then would it?",
                            "score": 6,
                            "author": "Feisty-Method-3561"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you left your blinds open and they recorded what was visible to the general public, no, their recording isn't illegal and is admissable...\n\nWhich generally brings up the question of why you are concerned about the recordings admissibility if the recording doesn't contain evidence of wrong doing.  I for one would love to go to court and have the opposing side show video of me doing nothing wrong.  Bonus points if it looks intrusive.\n\nIf they recorded audio without consent of one of the involved parties, or they used invasive means to get video, such as climbing a fence or used wall penetrating technology or planted cameras inside your residence... then it's inadmisable.",
            "score": 12,
            "author": "Clickclickdoh"
        },
        {
            "level": 0,
            "comment": "Yes illegally obtained evidence is inadmissible. What did they record? How did they record it as in where they on the street and saw you or was it a peeping Tom situation",
            "score": 6,
            "author": "monkeyman80",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is not correct. Evidence obtained incontractidiction to individual legal rights, illegally under an official capacity, is usually not admissible. However, evidence collected by a third party, even if done so illegally, as long as it was not done so at the behest of a government agent, is typically admissible in criminal proceedings. It is likely to be admissible in civil proceedings also. The crime the PI may have committed is a seperate matter from the evidence he collected and whether law enforcement does anything will depend on unknowable aspects of context. If OP can prove damages, they can sue the PI.\n\nOP needs a lawyer. A real one and a good one.",
                    "score": 13,
                    "author": "betelgeuse_3x"
                }
            ]
        }
    ]
}