{
    "id": "147juci",
    "score": 0,
    "title": "Can someone be legally served in Sweden from the USA?",
    "author": "RedKing_Rocket",
    "date": 1686562552.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147juci",
    "media_urls": [],
    "other_urls": [
        "https://www.haguelawblog.com/2017/03/serve-process-sweden/](https://www.haguelawblog.com/2017/03/serve-process-sweden/)"
    ],
    "postText": "So I am helping a friend through some traumatic stuff right now, and her story is complex. I will cover the key points below.\n\nMy friend is a Swede who lived in the US for about 5 years and returned here in 2008. Her partner at time (a US citizen) abused her (emotionally and verbally) when she fell pregnant by him. It got so bad that she decided to return home to Sweden to give birth here seeing that her partner dumped her and she risked ending up homeless etc. \n\nHe denied being the father of the kid, and the Swedish state sued him for child support over the years. My friend had no control over this, it is an automatic process and there is an agreement between Sweden and the US for such situations. Her ex-partner spend many years (about 8 years) fighting this process and lost. His salary is now being taken (garnished?) twice a month. My friend is the only legal guardian of the kid.\n\nMy friend blocked all comms from her ex as he was sending abusive emails etc, but she did try to keep comms open with his mother so she could have contact with her grandkid (my friends kid). Her ex never tried to contact the kid who is now 16 years old. About 18  months ago he reached out to her and requested contact with the kid. My friend said that it is up to the kid to decide what if any contact she wanted with him. The kid was curious and started talking to him via email. She decided after a few months to block him as he was abusive. \n\nNow to the problem: my friend got a voice mail from a US based 'lawyer' saying that her ex is suing her for emotional damage for 1.5M usd. They also said that she will get a letter in the post.\n\nSo my question is; can she just ignore this? According to my research there is a formal process as defined by the Hague Convention [https://www.haguelawblog.com/2017/03/serve-process-sweden/](https://www.haguelawblog.com/2017/03/serve-process-sweden/)\n\nand that simply sending a letter is not inline with this?\n\nAlso, my friend is a single parent and has no money to engage a lawyer in the US. Is there any process she can follow to put an end to this nightmare that won't cost her an arm and a leg?\n\nSorry for the long post and I appreciate any and all advice here.",
    "comments": [
        {
            "level": 0,
            "comment": "Yup. She can ignore it unless served in compliance with The Hague convention.\n\nAs for the “lawyer,” no lawyer would have called her. In fact, had a lawyer called her the first question would have been, “Are you represented by legal counsel,” as a real lawyer can get into serious trouble by communicating directly with a represented party. Odds are it was just one of her Ex’s friends.",
            "score": 2,
            "author": "putsch80",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your answer and time :)\n\nI traced the number that called her to a website [https://attorneysearchnetwork.com/](https://attorneysearchnetwork.com/) \n\nI am guessing her ex probably just googled 'I want to sue someone' and this was the first hit. I wonder if the person who called her was one of those people that 'serves' people being sued (sorry, don't know the English word for that).\n\nMy take is that she can ignore a letter in the post as her ex will have no way to prove in a court in the US that anything was actually served.",
                    "score": 1,
                    "author": "RedKing_Rocket",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Could just as easily be a spoofed number. In any event, I wouldn’t spend much time worrying about it.",
                            "score": 1,
                            "author": "putsch80",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes I agree, let's see how this pans out. Thanks again for the info!",
                                    "score": 1,
                                    "author": "RedKing_Rocket"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}