{
    "id": "147o2iv",
    "score": 6510,
    "title": "Accused of abusing a lactation room",
    "author": "Alarmed_Square2065",
    "date": 1686576244.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147o2iv",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, I'm a female  who works in a HEAVILY male dominated work environment (100+ men, 4 women, I'm the only one who does technician work the others are admin), I'm currently 11 months postpartum and am pumping at work. My assistant supervisor pulled me into his office today and asked me if I was studying while I was in the mother's room. Apparently there's been several comments made that I'm spending \"too much\" time in there and no one can \"ever\" find me. Which I feel is ridiculous because I only pump twice a day during work hours, and I try to center those times around our schedules breaks so I'm not losing too much \"work time.\" I feel this came up initially when a stock room employee asked me how my studying was going, as I'm taking college classes at the recommendation of my supervisors for a possibility of promotion. Then asked if that was what I do \"in that tiny room\". I corrected him saying that was a lactation room for mother's and he was very apologetic saying how he was mistaken because when I walk by I'm carrying a \"school bag\" -i carry all of my supplies and pumps in a backpack- this all may be moot as I won't be pumping for much longer anyways, but how can I protect myself from these accusations?",
    "comments": [
        {
            "level": 0,
            "comment": "NAL but this comes from now I advise managers on perusing discipline based on coworker “allegations,” which is that if you don’t have specifics, don’t go chasing things down based on vagaries and innuendo. \n\nFor example, when someone tells me “I can never reach him when I need him” or “she’s always saying things like this..” my response is “is it actually ‘never/always’ or were there a couple of times and it just really bothered you?”\n\nKeep a level head. The answer to the question is “no, I’m using the lactation room for pumping and I’m doing so an appropriate amount of time.”\n\nIf the conversation continues on, “I’m not really able to respond to generalities. Is there an actual documented problem with my performance?  Are there specific times when people haven’t been able to locate me when I was needed?  Are there specific tasks that weren’t completed as needed?”\n\nIn other words, it’s not on you to explain every detail of your lactation experience and plans because a few people don’t understand it and have some vague feeling that you’re somehow getting paid to “do nothing.”",
            "score": 4474,
            "author": "wittiestphrase",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 217,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 71,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 37,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 13,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 308,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is what I'll likely bring up to my supervisor when he returns from vacation, I've gotten \"exceeds expectations\" on both of my yearly evaluations since I started at this company and that's including when I was working up until a week before my due date. \n\nMy job is getting done, why are we even giving these comments time out of our day?",
                            "score": 247,
                            "author": "Alarmed_Square2065",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "IANAL (but am middle management) -- Bringing unfounded accusations to you to refute (how do you disprove a negative?) could easily be construed as creating a hostile work environment or harassing you on the basis of gender or protected status.",
                                    "score": 82,
                                    "author": "darkstar541"
                                },
                                {
                                    "level": 3,
                                    "comment": "Record everything!!!",
                                    "score": 12,
                                    "author": "jetsetterexplorer"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think the other peoples issue is they don’t get those extra breaks 🙄 if she has to check in before going in the lactation room then that doesn’t seem unreasonable, but she shouldn’t have to explain herself to anyone",
                            "score": 19,
                            "author": "Twinnytwintwo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 42,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1303,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 214,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 21,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 81,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.dol.gov/agencies/whd/nursing-mothers/faq\n\nThat’s the fact sheet from the department of labor. \n\nI find with comments like that you should just act aloof, like what they said doesn’t make sense or you are confused. You don’t have to explain anything to your coworkers. \n\nAnd honestly, I watched most of Parks and Recreation on my break. Do what you need to do to keep pumping and your supply up.",
            "score": 1659,
            "author": "RedChairBlueChair123"
        },
        {
            "level": 0,
            "comment": "I would email the supervisor who you had the conversation. Say that to reiterate, you go twice a day to pump to the pumping room. Tell him that pumping takes between X and Y time, and that the bag you take is the equipment to pump milk. Then link him the DOL link [https://www.dol.gov/agencies/whd/nursing-mothers/faq](https://www.dol.gov/agencies/whd/nursing-mothers/faq)\n\nI would then add that it made you very disappointed that people were gossiping about you going there to study, when you are actively postpartum and need to pump milk to your child. You hope that your response clear the matter because you are professional, and do not want this to tarnish your reputation in the office. Something along those lines.\n\nYou should send an email because then there is something in writing about this if it comes up again. This is how to protect yourself.\n\nAt the beginning, I never sent emails when shit came up at work because I was like \"Oh it's just going to be worse\". Well, then came to bite me in the ass and people lied to covered theirs, and I was screwed. So always document over email!!! Always. You have a convo about anything, you email your supervisor a summary about your meeting\n\nEdit: You can ask your supervisor if you should email him before/after you go to pump so that he knows you are temporarily out of your desk. I don't know if this would be worse or better, but if people are complaining on purpose, documenting when you pump could help.",
            "score": 747,
            "author": "Single_Vacation427",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would add into this (because bad/nonexistent sex ed is a thing) that not pumping can cause severe pain and illness. Too many think pumping/breastfeeding is just like pulling a bottle from the fridge. That if you wait a bit the bottle and baby will be fine. When in reality it is extremely painful and unhealthy for \"the bottle.\" \n\nThere were quite a few times I lost it on some people because they asked if I could wait and do that later when my breasts were currently painfulky rock hard and spraying.",
                    "score": 376,
                    "author": "WifeofTech",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I feel is ridiculous because I only pump twice a day during work hours, and I try to center those times around our schedules breaks so I'm not losing too much \"work time.\" I feel this came up initially when a stock room employee asked me h\n\nYes,  this is important. If you get off schedule everything (your health, your stress levels, and the time spent fixing things will all be worse)  Mastitis is painful!",
                            "score": 155,
                            "author": "Clerk_Sam_Lowry"
                        },
                        {
                            "level": 2,
                            "comment": "Great  point! This could be written something like: \"I have to keep my schedule for pumping because ...\"",
                            "score": 108,
                            "author": "Single_Vacation427",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is a really great point to add, Ive gotten mastitis several times due to me not pumping enough because I felt like I *couldn't* once I got back from maternity leave. That why I only pump twice while at work and it usually ended up with me being in pain once I got home.",
                                    "score": 211,
                                    "author": "Alarmed_Square2065",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Breastfeeding moms are a somewhat protected class of employee. You should absolutely make sure you have time to pump when needed, even if it's more than twice. These \"men\" you work with need to learn to shut their mouths if it doesn't concern them.",
                                            "score": 175,
                                            "author": "itsthedurf"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NAL but as a mother who pumped/breastfed.\n\nFederal protections allow for reasonable time and place to express milk at work. It doesn't have exact time frames because everyone is different. Some women take 20-30 minutes to pump, I had it down to a science and start to finish was about 17-18 minutes. I just pumped on every break and lunch and on breaks went a couple minutes over. \n\nIf they need proof, show them the bottles of milk, I doubt they'll comment after that.\n\nVisit https://www.dol.gov/agencies/whd/pump-at-work for the legal verbiage.\n\nBut seriously: if you just came back from maternity leave it's really not a stretch that you'd be using the lactation room to lactate. 🤦‍♀️",
            "score": 252,
            "author": "dragonstkdgirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 47,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\nI would summarize the conversation in email regarding my working hours along with when, how often and how long I use the lactation room and what they can expect from me for the next 24 months.  Maybe cc HR email as well. \n\n\"For instance Hi Joe, I wanted to summarize our discussion last week regarding my twice daily use of the lactation room. \n\nI currently start work at 8:30 and leave around 5pm. I use the lactation room for about 30 minutes twice a day from 12-12:30 and again from 3:00 to 3:30. My schedule may change from time to time, and I appreciate the flexibility to express /pump as needed throughout the day.  \n\nI plan to continue using the lactation room approximately twice per day during my shift for  the next 24 months. \n\nI understand I am just one of the 4 to 5 women here on a team of close to 100 people, and some  coworkers/ management may not be familiar with the needs of lactating women.  For your convenience I'm providing a like to site with helpful information ( PUMP Act link). \n\nI am happy to provide more details or provide a update if my schedule or needs change substantially. \n\nI truly value your support and collaboration in ensuring a positive and accommodating work environment for all employees.\" \n\nI also had chat got write a \"friendly work email regarding my rights to pump breast milk office\" and it was really awesome. Probably not necessary but if you want some ideas...",
            "score": 93,
            "author": "InvisibleBlueRobot"
        },
        {
            "level": 0,
            "comment": "If you're worried that you are being (or will be) discriminated against due to your family status, then you should start a paper trail of the complaints/comments by reporting them in writing to your supervisor/HR.",
            "score": 201,
            "author": "my002"
        },
        {
            "level": 0,
            "comment": "I’m not sure if you can do this, but at my work I have a shared calendar.  I shared my use of the “wellness room” on the calendar, which also made it clear that it was 1/2 hour twice per day, and also made it easier for people to find me and to know when not to bother me.",
            "score": 331,
            "author": "whynotanotheronetwo"
        },
        {
            "level": 0,
            "comment": "After reading the comments and your responses, it seems you are being harassed. You tried pumping discretely at your desk, but comments made you move to the lactation room. Comments about your productivity are now being made because of the time you are lactating. \n\nAs others have said, you need to send an email documenting all of this to your supervisor and letting them know you would like the comments and gossip regarding your lactation to stop.",
            "score": 161,
            "author": "Pragmatic_Hedonist"
        },
        {
            "level": 0,
            "comment": "ianal\n\nGo straight to HR. Any reasonable HR will have the piss scared out of them the moment you bring up pregnancy/motherhood discrimination, and they will come down like a bag of hammers on these folks. That can burn the company so hard.",
            "score": 185,
            "author": "Alcoraiden"
        },
        {
            "level": 0,
            "comment": "Write an email to your supervisor and BCC your personal email.\n\nConfirm that you had a meeting regarding the use of the lactation room. Outline that you use the room in accordance with the Pump Act (https://www.dol.gov/agencies/whd/nursing-mothers) \n\nAddress the allegations that you’re studying and confirm that you carry your pump supplies in a canvas bag. \n\nSay that any further conversations about your right to access the lactation room should include a rep from HR.",
            "score": 84,
            "author": "MrsRantyPants"
        },
        {
            "level": 0,
            "comment": "I have zero advice but I’d pump another year just out of spite and donate it to a milk bank if I didn’t need it. Your supervisor sounds like a real piece of work.",
            "score": 66,
            "author": "SmrtGrl86"
        },
        {
            "level": 0,
            "comment": "The Pregnant Workers Fairness Act goes into effect June 27th this year. They might be trying to build a case before this goes into effect. If this drags on, please familiarize yourself with this.\n\nhttps://www.eeoc.gov/wysk/what-you-should-know-about-pregnant-workers-fairness-act",
            "score": 47,
            "author": "DuckDuckBangBang"
        },
        {
            "level": 0,
            "comment": "First, you file a complaint with HR. Your boss pulling you aside and making an allegation of time theft simply because you pump at work is creating a hostile work environment, and the knowledge that your coworkers are having this demeaning conversations behind you back has left you distraught. Then you contact a lawyer.",
            "score": 59,
            "author": "IddleHands"
        },
        {
            "level": 0,
            "comment": "Don’t give them an end date either, i ended up pumping until my son was almost 2 because i was an over-producer and working 12 hour shifts caused a significant amount of pain from engorgement. I ended up with recurrent mastitis while trying slow my production. Pumping and dumping was absolutely necessary and I am glad i was vague when questioned about my time-frame for needing the lactation room.",
            "score": 49,
            "author": "deaflemon"
        },
        {
            "level": 0,
            "comment": "I would document this conversation. Write out what you recall from it and send it in an email from yourself so that it is dated. I know you won’t be pumping for much longer, but this is an inherently sexist accusation. Hopefully this pattern doesn’t keep happening while you are pumping, or after you are done, but document just in case. They could find more nonsense to bring up other than pumping now that you have come on their radar as an irritation to them.",
            "score": 49,
            "author": "torchwood1842"
        },
        {
            "level": 0,
            "comment": "\"I use the lactation room as I am legally allowed to do. If you want to keep talking about we can do so down at HR, let me just call my lawyer.\"",
            "score": 38,
            "author": "Viperbunny"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 45,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's funny because I had bought those hands free discreet pumps you wear under your clothes so I could pump while in my work area to avoid all of this. But I started to use the lactation room after the comments about the noise they make started and crude jokes made about storing my milk in the communal fridge.",
                    "score": 88,
                    "author": "Alarmed_Square2065",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh so you’ve already started experiencing discrimination before this.",
                            "score": 130,
                            "author": "Raibean",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, report these assholes to HR",
                                    "score": 25,
                                    "author": "malibuhall"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "IANAL\n\nDOCUMENT EVERYTHING. Family status is a protected class federally, and basically if they start questioning specifics, ask for it in writing because preventing a mother from using a lactation room is WAY too close to discrimination. \n\nDocument all conversations, ask him to send you EVERY requestor question in an email, record your actual times using the room, and ask HR for the company policy regarding lactation.",
            "score": 23,
            "author": "reversepivot1"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 115,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I would talk to your manager. “Hey manager, it came to my attention that some people don’t understand that I have been pumping and it has led to some negative comments at work. I just want you to know I only pump 2 times a day and I do it during scheduled breaks so as to minimize work time. I just want you to know so it doesn’t inadvertently affect my performance.” \n\nMost managers will understand and it will let them brush off negative comments that get back to them. But if you do not tell your boss they may hear bad comments and not know what the cause is, that could hurt you.",
            "score": 30,
            "author": "foxfirek"
        },
        {
            "level": 0,
            "comment": "IANAL though this would be something to inform the HR department out as a temporary accommodation and for them to inform management as to where and what your needs are as an accommodation.  Generally, some companies only allow those approved by HR with a medical, religious or other approved need to use the room(s).   Hopefully you have an HR department, though that may be an avenue.",
            "score": 10,
            "author": "AwkwardBurritoChick"
        },
        {
            "level": 0,
            "comment": "One would be well prepared to consult a lawyer and speak with HR about it.   Communicate clearly what's happening to the relevant parties and be prepared to sue if one gets dinged for taking care of ones child.",
            "score": 13,
            "author": "ExcellentTop7273"
        },
        {
            "level": 0,
            "comment": "Have you actually been accused?  It sounds like they just asked you if that's what you're doing, and you said no.  Do they not belive you?",
            "score": 33,
            "author": "DrMantisToboggan44",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think that my supervisors believe me, but my work group is fairly hostile and try to burn each other constantly. There was even an incident before I came on board where one assaulted another and nothing was done about it, so I'm concerned management won't have my back if this escalates.",
                    "score": 108,
                    "author": "Alarmed_Square2065",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Follow up email to the supervisor since this was all spoken and seems undocumented thus far. A simple “Hello boss name, I wanted to follow up on our meeting today where we discussed XYZ specifics. As discussed, I use the room as intended and I’m supported by XYZ legislation. If you have any further concerns let me know.”\n\nThen forward that email and any responses to your personal email. If the issue does not seem resolved it’s straight to an employment lawyer who can help you navigate HR. \n\nAs others have said, blocking specific times in your calendar/booking the room may also be beneficial.",
                            "score": 46,
                            "author": "RedRedMere"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go to HR and explain the situation with them. This is harassment.",
            "score": 20,
            "author": "Popular-Jaguar-3803"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm fairly certain you're right on that one, when I first started here I was on a personal call outside of our building during lunch with my husband and I ended the call with \"I love you, be safe\" and one of the coworkers who I'm certain is the one making these accusations had a snide little comment about being \"gross\" and \"no one wants to hear that\"",
                    "score": 15,
                    "author": "Alarmed_Square2065"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's how I feel, even if I *WAS* studying what would I be wrong with that? Would they rather I just play on my phone or stare at the wall during that time? I don't think it really has anything to do with what I am doing or not, it's a way for the people I work directly with to take a swipe at me.",
                    "score": 31,
                    "author": "Alarmed_Square2065"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked for another woman but she did not have any children and would only let me pump once a day and complained about how long it took me to pump 😡 I don’t have any advice because I would be a smart ass and ask if they want to look in my bag and then put the bottles or bags in their face after and ask if they need further proof. Also, I multitask while pumping and I hand pump and use a Hakka. They shouldn’t care if you’re studying while pumping. It’s a break you’re entitled to",
            "score": 12,
            "author": "Twinnytwintwo"
        },
        {
            "level": 0,
            "comment": "I'm not super familiar with the biological side of this but can you pump at a set time/s that you already have on your work calendar as out of office? like a standing \"meeting\" in your calendar so that really it's their fault for not checking your schedule? and also that would serve as a first defense, like \"we'll what time were you looking? per my calendar.....\"\n\nYour actual calendar doesn't need to say anything more specific than \"OP OUT\", doesn't need to get into why",
            "score": 1,
            "author": "sweetbreads19",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a rough schedule, so not like 11:00 on the dot but *around* 11ish I'll be ready to pump again, due to the nature of my work (facility maintenance) we don't really work  around a calendar, but to those who have inquired I've let them know \"oh around 11-11:30 I'm usually not in the warehouse area.\" Or \"I'm in the mother's room around 4 so try to come by before or after that\" I may start leaving a be back on 20mins note on my desk",
                    "score": 27,
                    "author": "Alarmed_Square2065"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -12,
            "author": "[deleted]"
        }
    ]
}