{
    "id": "147qhv4",
    "score": 0,
    "title": "Child maintenance UK",
    "author": "peppathrowaway",
    "date": 1686585564.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147qhv4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have a friend who is going through a difficult divorce. Her ex husband is only paying the basic rate of child support however the costs associated with the child far exceed the maintenance payments. For example he pays about £239 a month but the child’s nursery fees are £1100 a month and not counting all other expenses that come with a child. My friend has to use nursery as she needs (and wants to) keep working. My friend is also renting as they sold the marital home whereas her ex pays no rent as he lives with his parents. They made a small profit from the sale which was split equally. My friends portion has already been spent due to the child’s costs. \n\nIt’s gotten to the point that my friend is now in debt just to keep up with bills but her ex has been able to amass 14k in savings since they broke up  as he no longer has to split any expenses that they would have shared as a family. \n\nBoth are legally represented however I’m just aghast that such an unfair situation is actually permissible in this day and age! \n\nEx wants nothing to do with the child beyond taking him for 5 overnights a month. \n\nIs there something I’m missing or is this really so unfair?",
    "comments": [
        {
            "level": 0,
            "comment": "The best place to post is r/LegaladviceUK",
            "score": 0,
            "author": "nutraxfornerves",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe they are taking part in the Reddit protests and have gone dark.",
                    "score": 3,
                    "author": "naraic-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes i tried to post there but it said it was a private group",
                            "score": 1,
                            "author": "peppathrowaway"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Both parties are represented, presumably the court has established the child maintenance rate. Your friend can seek new legal representation if she’s unhappy with her current solicitor and/or the child maintenance rate.",
            "score": 1,
            "author": "IndWrist2",
            "replies": [
                {
                    "level": 1,
                    "comment": "It wasn’t the court that set the rate, it is the min rate set by CMS. My question is that it’s seem absurd that one parent then shoulders all the expenses which are way more than the maintenance payments",
                    "score": 1,
                    "author": "peppathrowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then she needs to press her solicitor to resolve this through court.",
                            "score": 1,
                            "author": "IndWrist2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Will the court not just say he is complying with his legal obligation I.e. paying the basic rate? What additional matters will the court consider?",
                                    "score": 1,
                                    "author": "peppathrowaway",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think what she needs to consider is if she can vary the child support in court or mediation.\n\nShe may need to redo a budget so she can cut expenses.",
                                            "score": 1,
                                            "author": "naraic-",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They tried mediation and it didn’t work. The question here is whether it is correct that the system is that a parent paying child support only has to pay a set rate irrespective of the expenses/needs of the child. Given that it is normally mothers that get physical custody, it is women that are put at a disadvantage in a separation when they already are making less and now have to shoulder all the childcare expenses outside of a measly few hundred pounds. She has cut expenses to the bone",
                                                    "score": 1,
                                                    "author": "peppathrowaway"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}