{
    "id": "147v7zb",
    "score": 1,
    "title": "Overtime Rate has Been Reduced UK",
    "author": "Original-Yogurt-7560",
    "date": 1686597706.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147v7zb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\n\nI have recently been promoted from a grade 6 to a grade 8 (on the support staff pay scale for UK education).  On grade 6 my overtime rate was 1.5 times (Mon - Sat) and double time on Sunday, making it £24/£29 an hour respectivly.  On grade 8 it is a set rate of £18.  Overall my pay has increased however I do a lot of overtime and the reduction is annoying and means the pay rise isnt as much as it should be.  The overtime rates are not stated in my contract or offer letter.  They have not told me about the decrease I only found out by chance, in the offer letter to increase to grade 8 they didnt talk about overtime or rates at all.  What are my rights regarding the drop in overtime rate, as it is something I have enjoyed for the last 2 years should it stay at the higher rate? Any help would be greatly appreciated.  \n\n\nI am in England (on a phone sorry about typo's)",
    "comments": [
        {
            "level": 0,
            "comment": "Hello, this is really a post for /r/legaladviceuk, unfortunately that sub has gone dark in protest over the API changes. You should repost this there in 48 hours once the protest ends or if the matter is urgent seek advice from a solicitor.",
            "score": 3,
            "author": "TheElderGodsSmile",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks yeah I wanted to but they are dark.  I will do as soon as the protest ends",
                    "score": 1,
                    "author": "Original-Yogurt-7560"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imo you don't really have a leg to stand on. Overtime is not part of your contracted hours and therefore not guarantee. I wonder if your place has a form of discretionary pay and you can argue the average to be awarded with your promotion?\n\n Not that helpful I know but I'm support staff in education myself (university) and There's probably little you can do. \nLast year our contracts were 'harmonised' and pretty much all overtime and additional payments were taken away. Even during consultations including with the union they still went ahead and did whatever they  were going to do. \nMy rates of overtime aren't included in my contract just the usual vague wording about how it might be required and I'll be compensated. \nMy employer went from being practically a charity to full on business model overnight.",
            "score": 2,
            "author": "One_Nefariousness547"
        }
    ]
}