{
    "id": "147wbj5",
    "score": 0,
    "title": "My apartment was flooded by cleaners of the apartment complex, what should I do next?",
    "author": "saggynswampy",
    "date": 1686600500.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147wbj5",
    "media_urls": [],
    "other_urls": [],
    "postText": "hello all, im currently living in my apartment in Burnsville, which I’ve been staying at for over a year. Today, I got a call while visiting my girlfriends house from some contractors at my apartment letting me know that the cleaners of the apartment above me (2nd floor im on the first) left some valves open while the water to the building was turned off, and when they turned them back on, flooded that apartment and mine since it dripped in through the ceiling, I already took photos and videos of all the damaged areas and my belongings that I believe could get ruined and I’m still talking to the contractor trying to make amends and get the place cleaned up. The person I was speaking to did say that some sort of reimbursement is possible, aka a hotel, however I have 4 cats so finding a hotel for them to pay for is out of the question I’ll more than likely stay at my girlfriends house and work from there until it’s cleaned. What can I do to make the most of out of the situation and since I’m not technically staying here can I have rent reimbursed or discounted? Another problem is my rental insurance just expired so I’m not sure if I can get much at all back for this inconvenience.\nAny advice would still be appreciated",
    "comments": [
        {
            "level": 0,
            "comment": "If you have no renter's insurance, you're going to be at the mercy of the management and however generous they feel like being here.",
            "score": 2,
            "author": "mattlines98ta",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I were to renew/pay it sometime today would that make a difference? Technically I still have the policy under my name",
                    "score": 1,
                    "author": "saggynswampy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not if your coverage has already lapsed.",
                            "score": 2,
                            "author": "mattlines98ta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Understood thank you, more than likely I’ll end up trying to get discounted on the rent since I’m leaving next month anyways and get my full deposit back",
                                    "score": 1,
                                    "author": "saggynswampy"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}