{
    "id": "147yp61",
    "score": 0,
    "title": "Can I anonymously make a website calling out a liar?",
    "author": "TheCritFisher",
    "date": 1686606626.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147yp61",
    "media_urls": [],
    "other_urls": [],
    "postText": "OK, so this is an interesting one. You don't need to worry about the technical side of things, as I build complex web applications for a living. I'm worried about the legal consequences.\n\n**So here's the context**: a local politician is holding discussions with a wealthy land developer on Nextdoor (a social media platform). This wealthy land developer, let's call him Tom, is spouting nonsense and, in some cases, outright lies.\n\n**Here's what I want to do**: I have the technical know-how and free time to build a website that hosts these comments and keeps them for future viewing. I also would like to add a \"veracity\" meter to the posts and keep a running score between the talking heads. This would be based on an analysis I would complete per discussion context and then post on the website. Points would be awarded to whoever is honest and detracted from anyone who is deemed to be untruthful. They'd compete in a \"who can tell the truth?\" game they didn't sign up for.\n\nI'm fairly certain there are _some_ legal protections here, but I'm interested to know how I can structure this to achieve the following:\n\n1. I'd like to remain anonymous. I am willing to go quite far on this, even to form a new corporation somewhere to ensure this stays true. I have a fair amount of disposable income and time, so they aren't massive issues here.\n2. I'd like to ensure I can post this content and my \"truth-checking\" analyses without opening myself to litigation. I plan to be slightly tongue-in-cheek with parts of the website, but the analysis will be strictly egalitarian and as unbiased as possible.\n3. Are there any good examples of this that I can follow? Snopes is not a great example because they lack anonymity. I will not risk being identified through this, as the people I plan to call out are billionaires. I refuse to put my family at risk. I know how to technically keep this hidden, but I also want to keep it legal.\n4. I do not plan to monetize this, but if I can legally do so, I would like to utilize any ad revenue to pay for hosting costs. This is not required, and if monetizing things would cause issues, I will pay out of pocket.\n\nAnd finally, if you have any other advice, I'm all ears. Thank you in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "1)  You plan on mocking billionaires, meaning they have more disposable income and time than you do.  You can make it immensely difficult to determine who you are, but you can never reach zero.\n\n2) See 1.  You can set it up so that you will prevail in a court case, but you cannot prevent someone from suing you.\n\n3) None that I'm aware of.  The problem is that sites like this usually languish around page 6 of search results and get no traction.  If you just want examples of sites that scrape content from secondary sites and repost it with minimal commentary, I can stand here on Reddit, throw a rock, and hit dozens of them without moving.  \n\n4) See 2.  Monetizing it isn't going to make things legal or not.  It would give someone determined to figure out who you are another chain to follow you back to your real identity.\n\nIs your idea legal?  You might break the ToS of the site(s) you intend to rehost content/scrape from.  But so long as you are factually repeating what the people you want to mock have said, and commenting with your own opinions, that's (probably) not defamation.\n\nCan you be sued?  Yes.  Anyone can be sued for anything; while that statement is a bit trite it's important to realize.  When people say things like \"you can't sue for that\" what they mean is that you wouldn't *win* the suit.  But there is a certain sort of person who doesn't care if they win or not - the point is to bury the opposition in legal fees and drag them through the mud.\n\nCould your identity be discovered?  Yes, there is a nonzero chance that your anonymity will not be perfect and that with enough time and money, your real identity could be discovered.  \n\nIs it worth it?  That's a question that's out of our scope.",
            "score": 4,
            "author": "C1awed"
        },
        {
            "level": 0,
            "comment": "I can't think of any examples, no. Satoshi Nakamoto has managed to stay anonymous, by ceasing all public activity and possibly by dying. I don't know what technical measures you have in mind here, but if you're planning to use a third-party hosting service and pay bills and receive ad revenue, I guess you know this, but you better set up your corporation somewhere other than the US. Business owners have no legal right to remain anonymous.\n\nI'll leave it up to your judgment, but I'll also say I work in cloud infrastructure and platform-layer professional services consulting, and I used to work on classified surveillance projects for the US Intelligence Community. There is nothing I would ever do with the expectation of anonymity against a determined opponent. I've seen drug cartel leaders with way more resources than you to spend on security tracked on a second by second basis. Whoever this is won't be able to turn the NSA on you, but we've seen unscrupulous rich people using the NSO Group and ex-Mossad agents to harass whistleblowers.\n\nI'll just say you're not posting this right now from a throwaway, and after five minutes, I can tell you're probably in your 40s, 6'3\", married with a son, living in the southeastern US, probably South Carolina, on an island, are into fishing, have bad knees, drive a pickup truck, you own a 14' kayak and a 23' boat you paid $120k for. That's quite a bit of PII. No shade intended. Anyone that knew me would identify me very easily from everything I post here, but I'm not trying to be anonymous.",
            "score": 2,
            "author": "Namnotav",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yeah, that's fair. This isn't an anonymous account, so I'm aware of how easy it would be to dox me using Reddit. I guess the idea of ad revenue really is a stretch. That's pretty hard to keep anonymous.\n\nI'm not concerned about literal threats to my family's life so much as frivolous litigation. I do have the capability to host things offshore and keep them virtually anonymous. I suppose it's true that this person could use extra-judicious methods for figuring out who I am, but at that point wouldn't I have a solid case against a billionaire? I'm pretty confident in my ability to keep the site secure, it's just going to cost me a little more. But then again, you never know.\n\nI guess the thing I'm asking is: is it legal to host a site that calls out people for lying and if I keep it mostly anonymous, can I be mostly protected from frivolous law suits by doing so? If I end up in court with this person, so be it. It's worth the effort, in my opinion.",
                    "score": 1,
                    "author": "TheCritFisher"
                }
            ]
        }
    ]
}