{
    "id": "147ywag",
    "score": 1,
    "title": "Tax preparer ghosted us",
    "author": "theplushpairing",
    "date": 1686607181.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147ywag",
    "media_urls": [],
    "other_urls": [],
    "postText": "Our tax preparer filed our taxes, state and IRS confirmed receipt and the right money went into/out of our accounts. \n\nBut then she ghosted us. Never charged an invoice, never picks up our calls, has ignored our emails asking her to invoice us. \n\nIt feels fishy but I’m not sure what to do about it. She has our SSNs and one bank account, so far nothing is amiss but there’s always another year. \n\nAny ideas what I should do and if I should do anything?",
    "comments": [
        {
            "level": 0,
            "comment": "Were the taxes e-filed?\n\nDo you have a copy of the return she filed?\n\nWere you expecting a refund and have you received it, or did you owe taxes and have the taxes been paid?\n\nWhat was the arrangement you made in advance with her when you asked how much she would be charging?",
            "score": 0,
            "author": "SuccessAggravating86",
            "replies": [
                {
                    "level": 1,
                    "comment": "Taxes were efiled.\n\nI have a copy of the return.\n\nI got a refund and I owed (state and fed)\n\nFor payment she told me her fee, we agreed and signed her agreement before she started work.",
                    "score": 1,
                    "author": "theplushpairing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As long as she is not having her fee taken out of your refund, then no one really knows why she is ghosting.  Maybe she will be sending you an invoice at some point in the near future.",
                            "score": 0,
                            "author": "SuccessAggravating86"
                        }
                    ]
                }
            ]
        }
    ]
}