{
    "id": "147zgdw",
    "score": 0,
    "title": "Looking for advice",
    "author": "Less_Ambition_5936",
    "date": 1686608714.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/147zgdw",
    "media_urls": [],
    "other_urls": [],
    "postText": "My husband and I rent a property in utah and I have some questions. When we moved in we made note of mold growing in a few different places. They sent a plumber out who glanced at it for a couple of seconds and just said it wasn't mold. A year later (January 2023) we resigned our lease and mentioned the mold again and made I written note to send someone qualified to check it out. at this point it is growing on the walls now. They never sent anyone out. The start of this month (June 2023) we sent a formal notice saying if they didn't send someone out then we would take action and forward them the receipts. They finally sent someone out and they were asking if we had an alternate place to reside (we dont.) My husband suggested whe make sure that our landlord company will help and in the lease they have a condemnation clause that says they aren't liable to help with alternative living situations in the case the property is condemned. I'm wondering if that still applies since they've know about it for almost two years now or if we are just on our own in this. Any advice or info would be greatly appreciated. I'll attach a picture of the lease agreement where it talks about the clause.\nThanks. \nAlso sorry for any typos or errors. I'm on mobile.",
    "comments": [
        {
            "level": 0,
            "comment": "Was your landlord aware of the mold at the time of the lease signing?",
            "score": 1,
            "author": "mattlines98ta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, we made note of it on the 48 hour move in inspection",
                    "score": 1,
                    "author": "Less_Ambition_5936"
                }
            ]
        }
    ]
}