{
    "id": "1481qcr",
    "score": 210,
    "title": "Dementia patient keeps beating up me and coworkers, and family is harassing us",
    "author": "DragonofBone",
    "date": 1686615418.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/1481qcr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Midwest. So me and my co workers work in a assisted living area, and this resident does not meet the criteria to stay -nonviolent, medical compliance, and has to be a one person manual assistance at most. He broke one of my co workers glasses the other day, and beat me up to the point I went to the ER and have bruises. \n\n\nI reported him to my supervisor, and they trying to have the family members who come in and rile them up removed since they are not POA. I'd like to specify that these family members like getting them wound up and agitated and then blame us when they gets aggressive and throw fits when they gets destructive to the point we have to call the cops. \n\n\nThe family members were informed and are now claiming discrimination, and saying it's part of our job. We've all scanned our contracts, and their clearly in violation - they also record video of our other residents. \n\n\nThey've tried to come by my house, and several others who have had the same experiences with this resident and are trying to get us to retract our statements. It's very uncomfortable, snd they're trying to guilt us with the \"it's a part of our job description\" but it's not and the residents behavior goes against policy. \n\nWhat legal grounds do we have?\n\n\nEdit: We've called the police.  my co workers all live within a two to five mile radius of their families house, one co worker lives down on the same street. My address is on public access records, if you Google my name. They've been spotted on my ring camera three times (I live the opposite side of town) as they creep by real slowly. My co workers who live near them are the ones whose doorstep they showed up on and tried to strong arm them to retract statements. \n\nWhen I went to the police with my evidence, they said there were completely logical explanations and they couldn't do anything since it was possible they were using my cul de sac to turn around in since it's a dead end. It all happened this weekend. \n\nAs for my coworkers the police said it was public sidewalk and they could do what they liked and it wasn't illegal to stand on the side walk in front of their houses.v",
    "comments": [
        {
            "level": 0,
            "comment": "If they come by you house tell them to leave immediately or you will call the police.  They call the police. Do not talk to them at all away from work.  Honestly, I wouldn't talk to them at work, just refer them to your supervisor.",
            "score": 153,
            "author": "Haas1958",
            "replies": [
                {
                    "level": 1,
                    "comment": "We keep doing that. The police offered a few of us the opportunity to get. PO, but idk what that would do with our workplace?",
                    "score": 47,
                    "author": "DragonofBone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not a lawyer but have experience working in medical systems. A protection order should be enough for security to take action if they show up at your workplace.\n\nA lot of hospitals and private medical settings will have a legal team who will help you if you are being harassed by a patient or their family for work related issues. The last hospital I worked at would have their lawyers file things like protection orders on behalf of employees who were harassed by patients. The PO is also sometimes enough for security to bar them from the premises—this has been the case where I have worked, but ymmv. Your supervisor may know how to help you access those resources.",
                            "score": 38,
                            "author": "Variance__"
                        },
                        {
                            "level": 2,
                            "comment": "Nah you should just be calling the police not even threatening to but doing it. Their family member assaulted you and now their harassing you. Call the cops and you and your coworkers need to get together and talk to the Director of Nursing for the facility and state that if they do not call a doctor to get the patient re-evaluated and transferred to a facility that is suited for their care needs you all will get a lawyer together. Not only is this dangerous for staff but it’s dangerous for the patient with dementia not receiving the specialized memory care they require. And I’d phrase it just like that. But in the meantime yes call the cops and get a restraining or protection order against the family for showing up at your house.",
                            "score": 5,
                            "author": "BeeBench"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait, hold up. The **family** is coming to **your house**??????\n\nThat is not ok. It’s not even close to ok. \n\nI would absolutely have them trespassed from your residence and be in close contact with law enforcement regarding a plan of how to deal with them coming to your house. \n\nAs for your job, I would strongly consider just leaving. There are so many job opportunities in long term care and I’m sure you can find an employer that won’t tolerate this nonsense. \n\nReally the way to fix this is your employer should evict the resident. They clearly are not appropriate for an ALF setting and the family is obviously insane. If your employer is siding with that family and enabling their behavior then just leave. I promise you it’s better somewhere else.",
            "score": 106,
            "author": "Mountain_Fig_9253"
        },
        {
            "level": 0,
            "comment": "You need to get Adult Protective Services involved. It's like CPS for adults. They will help you with the legality of this because he is a danger to himself &amp; others. They will most likely relocate him to a facility that is better equipped to handle his outbursts. Unfortunately, his family will have no say in this, but it is for the best since he is so violent. APS will ask for evidence, since it is a legal matter. Make sure you have hospital bills (from the E.R. visit) &amp; statements from staff &amp; the police reports. If you have pictures of injuries or video of him acting out, that will help your case too. Don't leave anything out. \n\nSource: I am also in the Midwest &amp; we nearly had to do this with my grandmother due to her explosive anger.",
            "score": 56,
            "author": "S3R14LCRU5H3R"
        },
        {
            "level": 0,
            "comment": "If they're coming to your homes, call the police and file for a protection order based on harassment. They will need to stay away from you, not the other way around, meaning they cannot come to your place of work, at least while you are on shift. It shouldn't be an issue since none of them is the guards. Plus, the family has been asked to remove him anyway, so if they complained to a judge about not being able to visit him, they'd likely be told to do exactly what the facility said and move him elsewhere.",
            "score": 17,
            "author": "Internal_Progress404"
        },
        {
            "level": 0,
            "comment": "Not a lawyer.\n\nIn my state it’s a felony to commit battery on a healthcare worker. In practice, there is little appetite to enforce that with a demented patient. Diminished capacity aside, if its explicitly a crime for them to be doing it then it’s not my job to tolerate it any more than it’d be my job to put up with a patient robbing me or sexually assaulting me. \n\nI’d contact an attorney based solely on the facility not handling the issue. The family showing up at my house? I’d call the police and get an order of protection.",
            "score": 8,
            "author": "ButtfuckerTim"
        },
        {
            "level": 0,
            "comment": "How did the family know where you live?  How did they find out where your co-workers live?  Somehow this bunch of randos doxxed several staff members and managed to harass all of you at home?\n\nAre you saying that **several** of you had strangers appear at your front doors, making demands, and not one of you called the police?  None of that makes sense",
            "score": 6,
            "author": "taptapper",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, I called the police. It's a small town and they all know where me, two other coworker live since they live in a two mile radius, and one co worker lives on the same street. Our town is only like 2,500 people and the only idea how they got mine is because my address is public records.",
                    "score": 5,
                    "author": "DragonofBone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NAL but formerly worked in a memory care assisted living facility also in the Midwest. What state are you in?\n\nUnfortunately, nothing you can really do about dementia patient beating you up except leave him alone when he's violent, unless he is a danger to other patients or himself. No legal recourse on that really in all states since patient has dementia and can plead insanity. Your ER stuff should fall under a worker's comp case, just in case you don't know already.\n\nFor the family, you should at least have grounds for a harassment/stalking charge if they continually persist to bother you and your coworkers. Record ANY interaction with them. \n\nThe family should *not* be taking videos of the other patients. That can violate HIPAA since POA is not around to consent &amp; at any point, information pertaining to care may be caught (depending on how sneaky they are), and if it's brought up to administration at your facility, they could be liable for that information getting out. In assisted living, the whole facility can count as a \"clinical area\". It's honestly tricky and more of a subject for a lawyer. But if the other patients' POAs don't consent to being recorded and these people are recording, they should be banned from visiting the facility. \n\nIf I were you, I would report these grievances to whoever your HR rep is so that there are paper trails. File incident reports for every beating you take, with what events led up to it (objectively). Keep logs of when they visit, what they say, cite if you have witnesses. This advice goes for the other co-workers getting harrassed too. If the company can gather enough of a paper trail, the company can kick the patient out because the facility is not able to meet his level of medical need &amp; potentially pursue legal recourse on the patient's family if necessary. This will also cover their butts and yours so that the family can't claim \"discrimination\"\n\nHas dementia patient's POA been informed of the family agitating them? My facility could allow POA to ban certain family from visiting. Shoot, we even banned someone's POA from visiting inside the facility because they were starting to harass other patients. All visits could happen outside or off the company property. SO much can be done about this and I'm mad for you. \n\nSorry if this is word vomit. Hope any of it helps.",
            "score": 2,
            "author": "oneiric_deja_vu"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Your post may have been removed for the following reason(s):*\n\n**Speculative, Anecdotal, Simplistic, Off Topic, or Generally Unhelpful**\n\nYour comment has been removed because it is one or more of the following: speculative, anecdotal, simplistic, generally unhelpful, and/or off-topic.  Please review the following rules before commenting further: \n\n* [Commenting Rules 1](https://www.reddit.com/r/legaladvice/wiki/index#wiki_1.__comments_should_contain_a_legal_answer_or_a_strongly_related_non-legal_answer.), [2](https://www.reddit.com/r/legaladvice/wiki/index#wiki_2.__personal_anecdotes_are_off-topic.), [3](https://www.reddit.com/r/legaladvice/wiki/index#wiki_3.__explanations_of_the_law_in_jurisdictions_other_than_the_one_described_in_the_op_are_off-topic.), [4](https://www.reddit.com/r/legaladvice/wiki/index#wiki_4.__opinions_on_the_law_or_the_application_of_it_are_off-topic.), [6](https://www.reddit.com/r/legaladvice/wiki/index#wiki_6.__expressions_of_sympathy_without_corresponding_legal_help_is_off-topic.), [8](https://www.reddit.com/r/legaladvice/wiki/index#wiki_8.__comments_should_be_reasonably_detailed_and_explanatory.__.22i.27m_a_lawyer_so_listen_to_me.22_isn.27t_an_appropriate_answer.__credential_fights_are_not_appropriate_here.), and [9](https://www.reddit.com/r/legaladvice/wiki/index#wiki_9.__requests_for_updates_are_off-topic.).\n\n\n\n*Please [read our subreddit rules](https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules).  If after doing so, you believe this was in error, or you’ve edited your post to comply with the rules, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdvice).* **Do not make a second post or comment.**\n\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                    "score": 1,
                    "author": "legaladvice-ModTeam"
                }
            ]
        }
    ]
}