{
    "id": "1482vrb",
    "score": 1,
    "title": "Choosing a lawyer - advice",
    "author": "want2divorce",
    "date": 1686619014.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/1482vrb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am about to file for divorce (California). I spoke to 2 attorneys in august last year that were recommended from a benefits program at work. The first one was very rushed through the consult.  The second was responsive, thorough, spoke plainly and clearly and even did a second consult with me when my spouse threatened to ruin me financially.  I’ve read the testimonials from her website, didn’t see any other place to see reviews, and I have a good feeling about her.  But should I do anything else to make a final decision on retaining her services? I’ve asked friends for recommendations but they don’t have any. Are there any questions I should ask her (I.e. interview her) before retaining her services? TIA",
    "comments": [
        {
            "level": 0,
            "comment": "Ask to see a draft of the retention letter/engagement agreement or whatever she calls it.  Make sure you understand how everything works -- her time, costs, everything.  How much does she estimate the case will cost?  Does she work with junior lawyers or paralegals who can do some of the leg work to save you money?  What is her policy on how quickly she responds to emails or phone calls?  \n\n(Make sure you understand that you'll be charged for virtually every minute of her time.)",
            "score": 2,
            "author": "UsuallySunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! She did give a rough estimate and did say if things are straightforward then a paralegal can do some of the work at a lower rate. I’ll request all that in writing.  I really like the question on policy for responsiveness!",
                    "score": 1,
                    "author": "want2divorce"
                }
            ]
        }
    ]
}