{
    "id": "14832x6",
    "score": 0,
    "title": "Detained on a 2 year old arrest warrant. Pre-trial conference set for later this month. What should I do?",
    "author": "Substantial-Cook-405",
    "date": 1686619659.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/14832x6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Here are the facts: \n\nIn 2020, my ex-girlfriend snuck into my house while I was working from home and started having audible sex with my then-roommate.\n\nThe sound of her voice was unmistakable. I was boiling with rage. But I was working. I managed to keep my cool and not make a scene. \n\nAfter getting off work at without doing anything stupid, I decided to go for a walk. As soon as I stepped outside, I saw the aforementioned roommate walking towards the house. He immediately walked to the other side of the street. \n\nLong story short, I lost my cool, hurled some insults his way, got in his face and then spit on him. By the time I got back home, the police were waiting for me. \n\nI was arrested and ordered to complete a diversion program (basically anger management classes) by the judge. No jail-time. I paid a fine. Class 3 Misdemeanor (Assault). \n\nThe next 2 years of my life were a fucking mess. I was in and out of psych wards thinking people were after me and trying to kill me. I was homeless for 6 months. Then back to the psych ward one last time. I was diagnosed with Bipolar 2 disorder. \n\nWhen I finally got my life back on track (housing, employment, mentally stable), I started worrying about the diversion program I hadn’t attended in Arizona. Now that I was back in the state, I wanted to make sure everything was taken care of. \n\n2 jobs ran background checks on me. Nothing. Called the court 3 times. They assured me there was nothing to worry about. Looked my name up in the online arrest warrant database. Nothing. \n\nFlash-forward 3 months, I move back to the city where this happened. 2 weeks later, I’m detained by a police officer who says I have an outstanding arrest warrant. \n\nThey take me in, I pay my bond. Now I have a pre-trial conference scheduled for later this month. My question(s): \n\nHow likely is it the judge will give me a maximum sentence? What sentence is he most likely to give me? Is it possible he’ll let me resume the diversion program? Should I get a lawyer? Would it help to bring in copies of my 2 background checks? How about a statement from my psychiatrist for the past two years attesting to the poor mental/socioeconomic state I was in for 2 years? \n\nThank you all for your time and attention!",
    "comments": [
        {
            "level": 0,
            "comment": "\n&gt;How likely is it the judge will give me a maximum sentence? What sentence is he most likely to give me? Is it possible he’ll let me resume the diversion program?\n\nFrom this sub's FAQ\n\n&gt;What sentencing can I expect?: Sentencing depends on a lot of factors that we cannot assess here. Your attorney is the best person to help you. You can call your Public Defenders office to see if you qualify for one if you cannot afford one. Many do low cost consultations. Contact your local Bar Association. You can google or search FindLaw for general sentencing guidelines.",
            "score": 3,
            "author": "pogostickshrewd"
        },
        {
            "level": 0,
            "comment": "&gt; How likely is it the judge will give me a maximum sentence?\n\nWe can't answer that. It seems highly unlikely.\n\n&gt; What sentence is he most likely to give me?\n\nWe can't answer that.\n\n&gt; Is it possible he’ll let me resume the diversion program?\n\nWe can't answer that, but it you're saying you skipped the program it seems unlikely.\n\n&gt; Should I get a lawyer? \n\nAbsolutely. They are best able to strategize for your situation.",
            "score": 6,
            "author": "WeaselWeaz"
        }
    ]
}