{
    "id": "148cl3i",
    "score": 0,
    "title": "I want to sue my ex for the money he didn’t give me back.",
    "author": "Throwawayjoyfulbaby",
    "date": 1686653666.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148cl3i",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello reddit, throwaway because my main is known by friends and i want to keep this a secret until i find an answer. I’m (21F) from Romania (Europe) and i gave my ex during our relationship 15 000 lei (~3000€), after the break up he gave me back 5 000 lei out of everything and refuses to give the rest back. I know its not a lot of money but in my country it is a lot, especially for my age and as a student. I want to have some sort of clue/advice on how i can do this and what are the chances to win the case. I don’t have experience and before i talk to a irl lawyer i wanted to brighten my mind here. Thank you in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "Did you loan it or give it? If you loaned it, did you make it abundantly clear that it’s a loan and that you would want it back?",
            "score": 1,
            "author": "micheldewit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have bank account transfer information of me giving him money, i also have a lot of messages sms and on social medias of him acknowledging he has to pay me and us talking about it and the sum of money",
                    "score": 1,
                    "author": "Throwawayjoyfulbaby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay, you have a legally binding agreement. Romania, and most of the EU, have a few rules and regulations in regards to debt collection, and this will require a few steps and its going to be a long process:\n\n1- Produce evidence: Gather up all the evidence, including where you both agreed upon that this is a loan, and you expect it to be returned\n\n2- Inform the party that you are going to go to a debt collector if he doesnt pay within 30 days, or comes with a proper working debt-relieve plan (payment plan). This has to be in writing. Ask your postal office if they have an option to sent the letter with required signature request (meaning, he has to sign for receiving the letter). State in the letter that you will be holding him liable for any damages that this action will cost.\n\n3 - If he approaches you with a payment plan, if it is a reasonable payment plan, you cannot refuse it. Lets say he has a debt left of 10k: this means a reasonable payment plan would be anything above 280 Lei a month. Note, that he will have to be on time with each payment.\n\n4- If he doesn't Go to a reclaim office (Debt Collector). There are various ones you can contact for this issue. They will then take it over from you. It will cost him a LOT if it gets this far though (For example, on a 10k case, it will cost him about 875 Lei, and this is WITHOUT it going to court. If it gets to the point it goes to court, they will take it to court for you, with your evidence (this is why you have to make sure you have all evidence logged and untampered, meaning: no cut and pasting in screenshots etc).",
                            "score": 1,
                            "author": "micheldewit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow this is very helpful, i can’t thank you enough for this information!\n\nI did a video of the real app of instagram and filmed from my real account, entering the chat and filmed a lot of our conversations (with and without talking about him sending me the money), filmed his real account and his buymeacoffee.com with his real name and finally the conversation of us talking about me suing him.\n\nI also gave him 2 options before telling about suing him and he refused both and now wants the second option but i do not want the second option anymore. \n\nI was also wondering how much would it all cost me? I can’t do it right now but i want in the near future to do this.",
                                    "score": 1,
                                    "author": "Throwawayjoyfulbaby",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In most EU countries, Debt Collection costs falls under the umbrella of the collectee, not the collector. Meaning, he will pay for all the damages (aka, costs) occurred. \n\nWhat was the 2nd option if I may know?",
                                            "score": 1,
                                            "author": "micheldewit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I helped him move to (first to Brasov and then to) the capital for him to find a better job (only to find out he started cheating on me) as i stayed back to continue my studies.\n\nAlmost all of my friends moved there to study (they stay in dorms/sharing the apartment so i can’t stay over as i’m a girl) so to not overspend on hotels i wanted to have a safe free place i could sleep and see them. It was either he gives me the money back or (because he said he’s tight on money) to have the sofa free for a couple of days per month.\n\nHe found excuses for both (probably his lady intervened) so this is the next step. After this convo he found a way for the second option but i don’t want anymore, the last drop of respect and amicability is now gone and i need my justice after years of being too kind on the loan.",
                                                    "score": 1,
                                                    "author": "Throwawayjoyfulbaby"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}