{
    "id": "148ii84",
    "score": 0,
    "title": "Should I sue my prfoessor?",
    "author": "Feeling-Concern-4383",
    "date": 1686671416.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148ii84",
    "media_urls": [],
    "other_urls": [],
    "postText": "To give you context of the situation, my professor failed my final exam which would result in me having to re-enrol in the course next semester and paying a hefty fee. He thinks I cheated, although he gave me very little information. I sent out an appeal, proving the legitimacy of my work, and carefully explaining it as well. Logically and ethically, it should be enough to absolve me of his accusations, but this had happened to a friend of mine in a different class and her appeal got dismissed so quickly and is left to re-enrol. I personally would not want to accept that because I genuinely know I did not cheat. I am determined to appeal and resolve this. In the off chance the university rejects my appeal and tells me I will fail, should I call a lawyer? Should I sue? Any suggestions would help as I am genuinely stressed and worried. Thank you",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;should I call a lawyer? Should I sue?\n\nThere's seemingly nothing to sue for.  Your school is entitled to their disciplinary process.  \n\nYou should work hard on the appeal in the university process.",
            "score": 21,
            "author": "reddituser1211",
            "replies": [
                {
                    "level": 1,
                    "comment": "I totally understand that they are entitled to their disciplinary process, but if I had provided proof that what they are trying to “discipline” me for is incorrect, but still get failed, shouldn’t I do something about it? I feel like that’s just wrong",
                    "score": -16,
                    "author": "Feeling-Concern-4383",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your proof is not my proof.  That's the point of the disciplinary process.  If you think it's proof and they think it isn't, they're, in this context, entitled to their conclusion.\n\nAnd you didn't *prove* that you didn't cheat.  That is a logical and practical impossibility.",
                            "score": 20,
                            "author": "reddituser1211",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Their only proof is that they I used chatGPT, and in which, I have provided various different proofs that there was no AI detected. I had used several different AI detectors to check and they all came to 0. One website had a 5% match on words like “definitely” and “inconclusive” or something like that. So don’t you think that’s more than enough to rebut their accusation of using chatGPT?",
                                    "score": -15,
                                    "author": "Feeling-Concern-4383",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This isn’t a criminal trial where they have to prove beyond all reasonable doubt and convince a jury of your peers that you did. They can have wrong beliefs about why they believe yours was ai generated. \n\nThere’s an appeals process that hopefully clears you. But that’s all you can really do. \n\nYou agreed to all of this when enrolling at your school.",
                                            "score": 24,
                                            "author": "monkeyman80"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It doesn’t matter what anyone here thinks. It only matters what the school disciplinary committee thinks. That’s the point. You should find someone like an advisor to advocate for you through the disciplinary process.",
                                            "score": 19,
                                            "author": "fauxrain"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a professor that has had to deal with cheating students before. Every school has a process laid out for how to handle these situations, usually in the student handbook. Find the process for your school and read it over thoroughly so that you full understand it and your options. At my current school and the schools I attended, there were multiple layers of appeals possible. Many institutions also have an ombudsman or an office dedicated to helping students that be able to help guide you through the situation.\n\nHiring a lawyer, trying to sue your professor is way out of what is considered normal and would is thus a nuclear option. Don't think of going there until you have exhausted all of your other options.",
            "score": 21,
            "author": "hot_chem"
        },
        {
            "level": 0,
            "comment": "Consider hiring a lawyer to defend you in the school discipline and appeal process.",
            "score": 2,
            "author": "schoffrj"
        }
    ]
}