{
    "id": "148kour",
    "score": 0,
    "title": "How do I \"give\" someone rights to a house without a deed?",
    "author": "Gnostromo",
    "date": 1686677142.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148kour",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am an executor of my mother's will I have split everything except the final step give my sibling the house. \n\nIf I had a deed I would sign it over. What can I do or sign that would let me close this whole thing out by end of month? (it has drug on and Florida court says I need to wrap it up)\n\n sibling  is already living in it.  The house is in Florida. I am not in florida but if important to make it happen I could make the trip to Florida. \n\nDesperate and  really need help on this\n\nThank you in advance\n\nEDIT THANK YOU ALL. I AM CONTACTING A LAWYER TO WRAP THIS UP.",
    "comments": [
        {
            "level": 0,
            "comment": "Deeds for real estate are not like titles for cars\n\nThe deed is how you transfer the property, which is then recorded with local officials. You draft new ones for new transactions\n\nTalk to a lawyer",
            "score": 4,
            "author": "Arudin88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thank you.",
                    "score": 1,
                    "author": "Gnostromo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; If I had a deed I would sign it over. \n\nHave you requested a copy of the deed from the county? Have you gone through probate?",
            "score": 4,
            "author": "jester29",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did not go through probate as it is just me and my brother and I thought it was fairly simple (year and a half later). He wanted house and I am taking the majority of stock type stuff",
                    "score": 1,
                    "author": "Gnostromo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately, Florida doesn't agree. Contact a lawyer.",
                            "score": 3,
                            "author": "jester29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok thanks",
                                    "score": 1,
                                    "author": "Gnostromo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is there no deed?",
            "score": 3,
            "author": "C1awed",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am almost positive there was.\n\nMy father was the type to keep everything. And I mean everything. Soooo many papers. And I have moved 4 times since he passed.  It is probably \"somewhere\" or accidently tossed.",
                    "score": 1,
                    "author": "Gnostromo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You basically write up a new deed and register it with your local town/county. \n\nYou’ll probably use a quit claim deed, which is reasonably easy if you’re willing to learn how to create one. But the fastest method is to enlist the help of a real estate or estate lawyer to get a new deed drafted and filed. \n\nMost areas require a filing fee of a few hundred dollars. Some areas require taxes as well - so it’s important to know your locale’s laws and how to avoid transfer taxes if possible/legal. \n\nYou don’t necessarily need the original deed - it’s not a ‘sealed’ document or anything. But most oils use the prior deed to complete the new deed since it requires quite a bit of specific information about the property itself.",
            "score": 2,
            "author": "kinkyguy000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok thank you",
                    "score": 1,
                    "author": "Gnostromo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you file the will with a probate court or are you just working off what the will says?",
            "score": 1,
            "author": "SlogTheNog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes that part was filed. \n\nIt was simple. I can't recalled exact but \"share and share alike\" \n\nIt is just my brother and I. This would have been over long ago if it was as simple as handing over keys and handing me the \"stocks\". He has been living there forever now. It is all amicable and easy other than red tape and forms etc etc and me just being too busy at work to make things happen. \n\nThank you. I am contacting my lawyer to wrap it up",
                    "score": 1,
                    "author": "Gnostromo"
                }
            ]
        }
    ]
}