{
    "id": "148mjtu",
    "score": 0,
    "title": "I stood up for myself and got fired \"for cause\"",
    "author": "PurplePenumbra",
    "date": 1686682036.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148mjtu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a (30F) professional nanny in the 9th year of my career. I have an excellent reputation and plenty of glowing references. I have never been fired from any job. \n\nI started with a new family 6 months ago, at which time we negotiated a contract and came up with terms we all agreed to. This included a sick care policy that said I would be off and paid if their child had certain symptoms/fever above a certain threshold, and that they would give me as much advance notice as possible if any illness in the household so I could make a judgement call. Before signing, we all made tweaks to the policy until we were all happy with it. In the months since, there were several instances of illness in the household. I was never given advance notice, and it was clear they expected me to stay and work regardless of our policy or my comfort. I was passive and never enforced the policy, to my detriment. Last Friday, baby was very sick when I arrived and I politely informed them that I would need to follow the policy this time. They said ok and I left when a family member arrived.\n\nOn Monday, they sat me down and said they weren’t happy with the sick policy and wanted to change it. They also wanted to make changes to my compensation in a way that would diminish my earning potential. I told them I would consider their requests and we agreed to reconvene on Friday afternoon. However, I wound up having an overwhelming week with a family member in crisis, so on Friday morning I asked Parent 1 to postpone our meeting until Monday. Parent 1 agreed at first, then several hours later let me know that after speaking with Parent 2, they decided we would be meeting that day still. I calmly reiterated that I was not prepared to discuss their requests and I needed more time to consider them. Parent 1 told me to take it up with Parent 2, who was still at work. Here was our brief exchange:\n\nMe: Hey Parent 2! I told Parent 1 this morning that I need to postpone our conversation. I have a lot going on with my family and I haven’t had a chance to collect my thoughts, nor am I in the right headspace for that conversation. I am emotionally drained and I need the weekend to reflect. Thank you for understanding!\n\nParent 2: That’s disappointing. I am over booked next week but we can meet Monday at 4pm but it will be off the clock at that point, since childcare duties would be finished for the day.\n\n—\n\nI am an hourly worker, just like the other 11 employees they have. They are fully aware they cannot require me to attend unpaid meetings. \n\nFeeling backed into a corner, I sent them an email over the weekend to let them know that I was hurt by the text message from Parent 2, and I wasn’t interested in making changes to our agreement halfway through our contract period. I stood my ground about our sick care policy and let them know I needed to follow it from now on. \n\nWhen I arrived to work yesterday, Parent 2 was passive-aggressive and Parent 1 made it clear that they were offended and we would be talking about my email. I don’t handle hostility well and I was very anxious all day - not a great state to be in while caring for a baby. Right before I left, their baby was crawling from a 6 inch cushion onto the floor and face-planted on the carpet on the way down. Baby was not injured and there are no marks. I apologized profusely and truly felt awful; I was anxious and frazzled and I looked away for a moment to grab something and it happened really fast. Not okay, totally my fault, and I own that. But truthfully, they are a baby learning to crawl, and it happens; they have even told me about that exact thing happening when I was not there. \n\nToday when I walked in the door, they fired me on the spot. They said they no longer feel comfortable having me care for their child, citing “safety concerns” over of the crawling incident yesterday. \n\nI am 100% confident that they wanted to fire me before that happened, but had no cause, so they would have had to pay my significant (~$4k) severance. Instead, they found a reason to fire me for cause that would not have been a fireable offense had the contract negotiations not been an ongoing issue. \n\nI am filing for unemployment but it is likely to be denied based on their stated reasons for firing me. I am a student and in a tough spot financially, especially now.\n\nDo I have any recourse here? Would small claims potentially side with me to grant severance? Is there anything else I can do?",
    "comments": [
        {
            "level": 0,
            "comment": "If unemployment is denied you should appeal.\n\nYou can sue for severance. Nobody can assume what the result may be. You can make your case but it isn't quick.",
            "score": 11,
            "author": "WeaselWeaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will a suit cost me?",
                    "score": -1,
                    "author": "PurplePenumbra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Costs and rules vary by location.  But generally small claims court isn't expensive, you don't need a lawyer, and if you win you can get the fees awarded to you as part of the damages anyway.  $4k is probably within the limit of small claims court.  \n\nIf you need the help of a lawyer, you may be able to sue for the legal fees as part of the damages; that may depend on your state as well as your contract.",
                            "score": 3,
                            "author": "nylonvest"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Instead, they found a reason to fire me for cause that would not have been a fireable offense had the contract negotiations not been an ongoing issue.\n\n How did contract negotiations convert the baby falling into a fireable offense if it wasn’t one already?",
            "score": 5,
            "author": "Bubblystrings",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m saying that they wanted to fire me already, so they used the baby face-planting (not falling, crawling off a 6 inch high cushion on the floor) as a reason to fire me “for cause” and deny severance",
                    "score": 1,
                    "author": "PurplePenumbra"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Do I have any recourse here?\n\nYou don't mention your agreement having a termination for cause only clause, and without it, you are an at-will employee, and can be fired for almost any reason or no reason.  \n\nIf you want to take the severance issue to small claims, you can, but I think a judge would side with them.",
            "score": 5,
            "author": "UsuallySunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "From my agreement:\n\nEnding Employment: Both family and nanny understand that all jobs end, and will strive to handle the transition with professionalism and mutual respect. If one party wishes to end the working relationship, they will give the other party a minimum of 4 weeks notice. If Family fails to give 4 weeks notice for termination without cause, Family agrees to give equivalent severance. If Nanny gives notice and Family chooses not to have Nanny work their entire notice period, Family will pay equivalent or prorated severance.",
                    "score": 1,
                    "author": "PurplePenumbra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's an at will clause.\n\nAs I said, you can contest the severance if you wish, but incidents that implicate the child's safety are probably going to be found to be good cause.  Maybe they will settle for half.",
                            "score": 2,
                            "author": "UsuallySunny"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is firing without cause.  A baby learning to crawl is going to have minor harmless falls like that frequently.  You apologized at the time but that doesn't mean you actually did anything wrong.  And the contract negotiations don't matter for that.  Even if this was an issue being discussed, the contract hasn't changed.  \n\nTell them you expect your $4k severance check with your final paycheck.  File for unemployment.  If they refuse the severance, sue them in small claims.\n\nIf you sue, don't talk about the hostility or the contract stuff.  Point is, you were fired on the spot for no reason and denied your severance for no reason, and it's required in your contract.",
            "score": 6,
            "author": "nylonvest",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your response. \n\nI am afraid if I sue they will make accusations against me and hurt my reputation &amp; career. Dad is a well respected business owner in my city.  Is there anything I can do to protect myself?",
                    "score": 3,
                    "author": "PurplePenumbra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So yeah - powerful people can be scary to stand up to, but ultimately I am not going to advise you to do less than demand what you are entitled to.\n\nYou can do so politely, calmly, and reasonably.  You can be professional.  You can refrain from bringing up the contract disputes you were having or accusing them of retaliating over that.  And you can also be tough and indicate that you know your rights and will consult with a lawyer if you need to.  \n\nUltimately if they do choose to make damaging false accusations about you to other people, that would give you a cause of action for defamation of character.  If that happens, talk to a lawyer.  \n\nOne thing you can do is - from this point forward, communicate only in writing.  That way, as much as possible, you'll have a record of what was said.  This will be particularly helpful if they make threats of this kind in advance of saying negative things about you.",
                            "score": 1,
                            "author": "nylonvest"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Small claims court can't grant you a severance. Unless your contract calls for severance in this situation you aren't legally entitled to it, no state requires it. You should file for unemployment &amp; appeal if denied.",
            "score": -6,
            "author": "Admirable_Height3696",
            "replies": [
                {
                    "level": 1,
                    "comment": "My contract calls for severance.",
                    "score": 5,
                    "author": "PurplePenumbra"
                }
            ]
        }
    ]
}