{
    "id": "148nj24",
    "score": 1,
    "title": "My daughter is getting swindled out of $1k by her mom",
    "author": "brentnic",
    "date": 1686684660.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148nj24",
    "media_urls": [],
    "other_urls": [],
    "postText": "My ex-wife wanted to get my daughter a car so she could drive herself to school and work.  2 years ago, my daughter (18) gave her mom $3k toward the car, and has been making monthly payments since. The car and loan are in her mom’s name. \n\nThey had a falling out recently (her mom wanted her to spend $1,100 getting a few dings fixed in the door, and my daughter didn’t want to get them fixed).  I suggested to my daughter to find out how much was left on the loan and if they would sign over the car if she paid it off.  Her mom replied that she would sign over the car and there was $4300 left on the loan.  \n\nThe next morning, her mom wrote that she was reconsidering the price of the car.  The new amount is $5300 if my daughter wants to keep it.  When my daughter asked what the extra $1k was for, the response was that she wasn’t going to explain it, that is just the new price, and she had to pay otherwise her mom is going to sell the car and give my daughter $2000.  Also said she had 24 hours to decide. \n\nDespite my original advise to get it in writing, my daughter has no agreement that says who was paying what and when the car would be hers.  The only thing we have now is the text messages mentioned above.  \n\nI think she should pay the $5300, get the car in her name, then file a small claims court case to get back the $1k that she is being overcharged.  I don’t like the thought of her having to take her mom to court, but knowing she is having $1k stolen from her is very upsetting.  \n\nIs this the best option?  Would she most likely win the case based on the text messages?  Or would it be a problem that they had no written agreement and she didn’t keep track of how much money she gave her mom.  Any advice would be greatly appreciated.  Thank you.",
    "comments": []
}