{
    "id": "148pmlm",
    "score": 1,
    "title": "Walmart firing",
    "author": "Professional_Rhubarb",
    "date": 1686690337.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148pmlm",
    "media_urls": [],
    "other_urls": [],
    "postText": "A relative was fired from Walmart about a year ago for improper stopping of a shoplifter. Apparently it’s against Wally’s policy to approach after they have gone into the bathroom. However the real story behind this is a suspicious agism. The person who was fired had the wrong birthdate entered into the Wally system, they had it as 10 years younger than they’re actual age. This person had discovered this and was attempting to get that rectified because they were planning on retiring in 3 years and didn’t want Wally to say that they had improperly represented themselves. After starting this process all of the sudden they were fired for the shoplifting issue, which they had done many times in the past and no one had ever reprimanded them for it. There was no reprimand, just an immediate firing. So no retirement. Does this sound like a good lawsuit? Do you know of any lawyers willing to take on Wally?",
    "comments": [
        {
            "level": 0,
            "comment": "The case would be much stronger if it were three days away rather than three years (how long have they worked there?). As it as it seems like a legitimate firing.",
            "score": 9,
            "author": "KoolAidMan4444"
        },
        {
            "level": 0,
            "comment": "This is a very common thing that retailers fire employees for. Unless they could demonstrate that younger employees are treated differently for the same issue they'd have a hard time making a discrimination claim. They can consult a local employment attorney, though.",
            "score": 7,
            "author": "dakatabri"
        },
        {
            "level": 0,
            "comment": "There is no Walmart retirement program.  Your relative isn't telling you the truth.",
            "score": 6,
            "author": "PaprikaThyme"
        },
        {
            "level": 0,
            "comment": "&gt; So no retirement. \n\nDoes Walmart have a pension system that only goes into effect after X years? Most private companies have a 401k or something similar. \n\n&gt;Does this sound like a good lawsuit? \n\nNot really, but it's impossible to know without all the facts. \n\n&gt;Do you know of any lawyers willing to take on Wally?\n\nMost any plaintiff's employment lawyer would be delighted to go after Walmart if there's a viable case to be made.",
            "score": 5,
            "author": "3AAuditor"
        },
        {
            "level": 0,
            "comment": "Walmart only offers 401(k) anyway",
            "score": 5,
            "author": "KoolAidMan4444"
        }
    ]
}