{
    "id": "148ppwg",
    "score": 1,
    "title": "Divorce and child support question",
    "author": "AnyMarsupial1",
    "date": 1686690593.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148ppwg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Good afternoon! My girlfriend is currently going through a divorce. Her and the ex husband have 4 kids together. He doesn't try to contact any of them or see any of them. I keep telling her to go for child support but she says no because he doesn't have a job so he won't be able to pay anything. She is also afraid of him coming after her and hurting her. I think it would be worth it because it would force him to get a job. How exactly does this work. We live in Pennsylvania.",
    "comments": [
        {
            "level": 0,
            "comment": "If she wants to pursue child support she can. However, she can't get blood from a stone. That would be part of the divorce proceedings.",
            "score": 3,
            "author": "WeaselWeaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read somewhere that in Pennsylvania that if they don't have a job they take there past experience and that's how they determine how much it would be. Not sure if it's true.",
                    "score": -1,
                    "author": "AnyMarsupial1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's true but again if he's not working or he's working under the table there's no stone to collect the money from. That doesn't mean she shouldn't still fill for child support because his income will be imputed and he'll still be ordered to pay child support and if he doesn't pay it, he'll obviously owe back child support &amp; future tax refunds can be garnished. If he dies she can pursue it from his estate as well,",
                            "score": 2,
                            "author": "Admirable_Height3696"
                        },
                        {
                            "level": 2,
                            "comment": "Does she have a lawyer?",
                            "score": 1,
                            "author": "WeaselWeaz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She talked to one and the only thing she said was she could only go after child support",
                                    "score": 1,
                                    "author": "AnyMarsupial1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The state can and will grant an order even if he doesn’t have income based on at least minimum wage. But people absolutely do go the entire length of their support order avoiding it and without a job. The state can do things to make it inconvenient not to pay the order, like suspending a drivers license, but they can’t really force someone to get a job.",
            "score": 2,
            "author": "so_fetch567",
            "replies": [
                {
                    "level": 1,
                    "comment": "Drivers license is already suspended 🙃",
                    "score": 1,
                    "author": "AnyMarsupial1"
                }
            ]
        }
    ]
}