{
    "id": "148q0c4",
    "score": 0,
    "title": "Can a debtor set my property on lien or foreclosure without properly communicate with me",
    "author": "dllzf2007",
    "date": 1686691379.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148q0c4",
    "media_urls": [],
    "other_urls": [],
    "postText": "We have a rental property in Ohio.\nThe debtor sent the collection letter to the rental property and it never gotten to us. \nThey sent a collection letter, set a lien on the house. \nThis property later was on foreclosure due to unresponsive to collection letter and lien. \nAccording to them, they sent out numerous letters to that property, but those letters never gotten to us. (Maybe our tenant throw it away, maybe they didn’t mail it, idk)\nMy question is can someone put a lien on a property without notifying the owner via a certified mail. Also, can this property go on foreclosure without a certified mail to the owner?\nI just learned about the foreclosure all out of sudden. If a collection service’s goal is to collect the money, wouldn’t they try different ways to reach me and inform me there’s an outstanding balances. Or do they mean to secretly “notify” me then purposely rolling the interest so high and end up going to foreclosure a house?",
    "comments": [
        {
            "level": 0,
            "comment": "I think by debtor here you mean creditor?  Someone to whom you owe money? \n\nWhat is the basis of the lien?  Is this a mechanic's lien?  A judgment lien?  Something else?  \n\n&gt;I just learned about the foreclosure all out of sudden.\n\nSomeone is *foreclosing* your property on the basis of a lien?  Unless this is for the loan on the property that would be a bit surprising.  How much is owed?",
            "score": 1,
            "author": "reddituser1211",
            "replies": [
                {
                    "level": 1,
                    "comment": "We owe 1500 in HOA fee, but without proper communication to us, the late fee, interests and legal fee accumulated to over 5000. I mean i forget about the HOA fee, I don’t mind paying it back. But all those fees that double the original amounts we owe, they have our new mailing address, email address or phone number. they could easily contacted us to avoid the interest being rolling and the legal fee.",
                    "score": 1,
                    "author": "dllzf2007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So the answer is that they were required to do some specific thing to provide notice.  Indeed that notice may have been letters to the property address.  Indeed it is possible your tenant interfered with that notice.  \n\nThey're not required to \"make you know.\"  They're required to do what is required of them to deliver notice.  And yes, they probably have the ability to record a lien outside a judicial process and consistent with their compliance with the process for notifying you. \n\nYou want to make sure they did send notice.  But more importantly you want to immediately resolve the delinquent fees and see what can be worked out in terms of compromise around the additional fees.  Unless you find a mistake in their execution of the process (frankly it is more likely they sent a letter that you didn't receive than that they just didn't do it) the fees and charges undoubtedly don't go to zero.  The association likely has real and substantive out of pocket costs that they're just undoubtedly not going to spread across the rest of the membership for you.  But that number might be less than what they say it is today.",
                            "score": 1,
                            "author": "reddituser1211"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They would have to go to court for any lien or foreclosure. This means you would have a chance to argue in court about the issue. If they fail to give proper notice, they can have the action thrown out and have to start over.",
            "score": 1,
            "author": "shadyside7979",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Proper notice” is very disputable. According to them, they send out letters to that rental property. I would assume it’s a certified letter or maybe it’s a regular mail, but either way, we did not get that letter. I don’t know if my old tenant signed them and throw them away. Or if they send a regular mail, would that count as proper notice? Or maybe they didn’t send it. All I know is there’s absolutely no way for them to prove that my family received them, because we did not!",
                    "score": 1,
                    "author": "dllzf2007"
                }
            ]
        }
    ]
}