{
    "id": "148qqaa",
    "score": 0,
    "title": "Medical Malpractice Question",
    "author": "eyerollpusheen",
    "date": 1686693308.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148qqaa",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi Everyone,\n\nI have some questions to see if my family has a case. It is a long story so bare with me.\n\nMy mother is deaf and has had health issues for a few years. She suffered from a stroke in February of 2022, and was in a rehabilitation center a couple weeks later and they discharged her. They discharged her out of rehab without an interpreter provided during physical therapy and occupational therapy. Since she did not have the interpreter, she was not provided the OT or PT. \n\nA couple weeks later she broke her hip because she was not provided the necessary therapy. She needed to get a hip replacement, and for a year she suffered from pain and was neglected by medical professionals. She got an MRI in October of 2022, and they found a small fracture still in her hip. During her total hip replacement, they broke her femur. \n\nOn December 30th, 2022, she was admitted in the hospital for knee pain and suffered from Type 1 Diabetes and was diagnosed with Diabetic KetoAcidosis. She was supposed to be released the next morning because her health and sugars were stable and they wanted to keep her one more night to monitor her blood sugars. During that night, they did not check her glucose levels for 12 hours (3 missed sugars) and when a CNA checked her sugar, her glucose was 37. At that point she was displaying decorticate posture and was intubated. \n\nWhen I was informed I was told that she had gone through kidney/liver failure and was not informed she was intubated. When she was showing that she would not get better, we were told it was acetaminophen overdose. We had the state review her case, and now we know she died because she was not being taken care of. I don't know what to do at this point. I need advice. I want to get justice for her. \n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Med mal cases are both fact and jurisdiction specific, and it’s a complicated area of law in general. You need to consult with an attorney about this; this is above Reddit’s pay grade. The good news is they almost always work on contingency and do free consultations.",
            "score": 1,
            "author": "Creative_username969"
        }
    ]
}