{
    "id": "148tp9y",
    "score": 1,
    "title": "cat I list former-roommates cat under my care on adopt-a-pet with proof of neglect &amp; a lack of consent",
    "author": "aulei",
    "date": 1686701863.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148tp9y",
    "media_urls": [],
    "other_urls": [],
    "postText": "my former roommate was evicted as of yesterday &amp; is now essentially homeless (she is staying with a friend &amp; has no source of income or transportation &amp; no motivation to get a job)\n\nas of her eviction, she could not bring her cat with her, so the agreement was that I’d watch him until I could get him into our local crisis boarding program, and then she’d have a month to find stable housing and upon doing so could reunite with her cat. \n\nhowever, upon bringing that cat home, I found out that not only is he visibly malnourished (not to an extreme, only slight) but that his litter box looked as though it hadn’t been cleaned in months (more poo than litter, literally molding and deterioration of poo etc.). immediately I tried to deep clean it, but it was so dirty and disgusting that I had to end up throwing it out &amp; buying him a new box. \n\nbecause of both of these reasons, I don’t feel safe for him to go back into my friend’s care. \n\nas far as I know he hasn’t seen a vet under her care, and has no license, registration or microchip nor anything that specifically proves he is her cat. \n\nour animal welfare agency is notoriously awful with neglect claims &amp; the only way to get him into their care would be through claiming him to be a stray. even then, they are a kill shelter. \n\nso my questions are:\n\n•am I able to legally report him as a stray? \n•if I want him to go to a better no-kill shelter or better yet, a foster or adoptive home, am I allowed to list him on adopt a pet or bring him into a shelter without my friends consent? \n\nI know that my friend is not willing to admit neglect or give him up permanently, but this cat is NOT safe with her &amp; I can’t keep him. \n\nlegally, what can and can’t I do?",
    "comments": [
        {
            "level": 0,
            "comment": "If you're going to steal you friend's cat, why go through all the extra steps?",
            "score": 4,
            "author": "Internet_Ghost"
        }
    ]
}