{
    "id": "148u5vo",
    "score": 1,
    "title": "Can I leave My Apartment",
    "author": "bawlsdeepinmilf",
    "date": 1686703270.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/148u5vo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Ive been living with a \"friend\"(lets call him RM) of mine and my step brother splitting rent 3 ways, things arent even rough but RM just went through a break up, has been treating himself like shit(staying up till 3am and waking up at 7am for work, coming home and sleeping on the couch until almost 9pm only to wake up grouchy and moody). Well today was the worst one yet, stomping and screaming and throwing a fit that reminded me of my moms abuser from a long, long time ago. What was it about? Only having 10 chicken nuggets in a bag after one of his great naps and a long night before hand, he acts like the most annoying 300lb child ever and blames us despite that we literally are the only reason he has a place to live or food to eat. Now we're thinking about leaving RM on his own, this is too much and I cant believe someone i thought was my friend would make my old ptsd rise from the depths after i put it down for so long. I can't feel safe in my own home because this guy has anger issues out the ass and blames everyone but himself for everything else and I just can't.  Is there anyway i can leave my house 4 months into a 12 year lease with my step brother? Hes done whatever happens afterwards to himself",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; Is there anyway i can leave my house 4 months into a 12 year lease with my step brother?\n\nYou can move out at any time but if you signed the lease with him you are still liable for rent and damages *in full*.",
            "score": 1,
            "author": "mattlines98ta"
        },
        {
            "level": 0,
            "comment": "It seems to me like you're asking what will happen if you break the lease? The answer is, look at the lease. The terms of what happens if you break a lease early will be laid out there.",
            "score": 1,
            "author": "Mysterious_Clue_3500"
        }
    ]
}