{
    "id": "90ipuc",
    "score": 17871,
    "title": "Bored middle age neighbor has been giving me a hard time because I dress like a \"hussy\", is that a crime?",
    "author": "uthotright",
    "date": 1532113011.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/90ipuc",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have been accused of a litany of sexual crimes, some against children because of the way I dress. My neighbor is so adamant about all of this she's got me a bit worried. \n\nAbout a month ago, I moved in with my sister and her boyfriend into a neighborhood that's mostly families. I didn't expect any trouble. My first introduction to this woman, let's call her Karen, was my first week here. I went to check the mail and I wasn't wearing a bra. I had on a baggy t shirt and basketball shorts, though. Karen is one of *those* Southern women who spend all day in their yards, pretending to garden, but are really spying on their neighbors. You know the type. She waved at me and I waved back, trying to be pleasant. She came at me, I thought to make a proper introduction, or whatever, but she started lecturing me about not having on a bra.\n\nIt was creepy and weird. I am not at all well endowed, I go without frequently and so far, no one seems to pick up on it, but not Karen. Karen urged me to think of her children and Jesus, who was always watching, and my parents (bless their hearts) she *knows* they raised me better than this. It was so goddamn weird, I felt like laughing in her face, but I didn't want there to be issues so I said I'd be more diligent in the future and Karen went about her business.\n\nWell, wearing a bra wasn't good enough for Karen, y'all, oh no. Not only is blasting my nips lewd, so are regular women's shorts and any form fitting type of bottoms even if they cover my sinful legs. Karen seems to have an issue with the lower half of my body. While my breasts are small and humble, I am \"aesthetic\" from the waist down.\n\nThe second time Karen confronted me, her brood was playing in the street and any semblance of pleasantness was gone. She threatened to call the police on me for indecent exposure in front of her children, insinuated I got off on arousing her tween boys, called me a hussy, a Jezebel and that I needed Jesus. Because I was wearing Jean shorts.\n\nWe live in a nice area, lots of woods, by lakes and parks and I like to go out for walks, but it seems every time I step foot out of my door, there's fucking Karen making snide remarks, outright threatening to call the police, or gossiping with other bored housewives. It's getting annoying. \n\nThis is in Florida, by the way.\n\nEDIT: I got dressed up in my skimpiest daisy dukes that barely cover my ass and a legit camel toe, a half shirt with no bra on, my abs exposed to check the mail (I do not regularly dress like this) I must have been quite a sight to Karen who immediately stormed over once she spotted me, nearly knocking over her lawn chair she stood up so fast. She started laying into me. I just stood there letting her bump her gums for a minute then I said \"you can stop the games, Karen. I see the way you look at me, I know you want me.\" Her face went beet red and she stammered out, \"I'll pray for you.\" Then scurried away. Actually went inside her house. 😂",
    "comments": [
        {
            "level": 0,
            "comment": "Okay, there seems to be a problem with people staying on-topic and providing actual legal advice.  Question has been answered.  Post is locked.  Thanks.  \n\nEven in Florida, it is a crime to impersonate a fashion police officer.  (thanks to /u/KayakAuFond)",
            "score": 1,
            "author": "Biondina"
        },
        {
            "level": 0,
            "comment": "You can't stop her from being annoying, but you don't have to engage. If she's coming onto your property, you can tell her to leave - she's trespassing if she doesn't - but otherwise… it's unlikely that this is going to give rise to a harassment complaint. If you do want to engage, \"Fuck off, Karen\" is a fairly comprehensive reply.\n\nIf she does call the cops, this is one of the few times I'd suggest that you're probably fine to explain the situation to them without an attorney. If your genitals are covered, you're not indecently exposed.",
            "score": 5398,
            "author": "derspiny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Karen claims she can see the outline of my labia through my clothes, which she claims is also illegal. I doubt the veracity of both those claims. I don't know why she's so obsessed me. ",
                    "score": 3629,
                    "author": "uthotright",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Karen sure is paying a lot of attention to your junk.\n\nEdit: one amusing strategy might be to turn this around on her. Get your back up: \"are you saying you're staring at my genitals? In public? Are you a pervert? You have _kids_, for gods' sakes. Are you raising them to be perverts just like you? If I see you staring at my crotch again I'm going to put up posters warning everyone about the pervert in the neighbourhood, I swear to god.\"\n\nActually putting posters up would be a _terrible_ idea, for a lot of reasons, but I'd be very surprised if she was prepared for this.",
                            "score": 6178,
                            "author": "derspiny",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Love it. At this point, I have to.",
                                    "score": 2932,
                                    "author": "uthotright"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell Karen to go fuck herself and not talk to you again. \n\nFor bonus points go get your mail in a bikini. \n\nNo this is not illegal. Indecent exposure in FL requires exposure of sexual organs. \n\nRepeated attempts to contact/bother you after being told to piss up a rope and leave you alone CAN be harassment. \n\nEdit to your edit: Well now I need a new keyboard cuz I just did a spit take on this one.",
            "score": 8028,
            "author": "phneri",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; For bonus points go get your mail in a bikini.\n\n\nThis is so diabolical, it's genius! ",
                    "score": 2633,
                    "author": "Rhonin1313",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Question: could I go 'round in my boxers? They're less revealing than bikini bottoms, but technically undies, but they're just so comfy. :)",
                            "score": 1622,
                            "author": "uthotright",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "IMO as far as the [Florida law](http://www.leg.state.fl.us/statutes/index.cfm?App_mode=Display_Statute&amp;URL=0800-0899/0800/Sections/0800.03.html) goes you could walk around in 3-4 pieces of appropriately-applied duct tape. \n\nAgain, the statute involves exposing your sex organs. If you're covered you're covered. ",
                                    "score": 2467,
                                    "author": "phneri",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just for absolute clarification -- \"sex organs\" only includes the stuff below the waist, correct?\n\nIf so, OP's neighbor might be in for a shock.",
                                            "score": 715,
                                            "author": "DiabloConQueso",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Except for \n\n&gt; or to be naked in public\n\nRe: Topless? I dunno. The US is weird about that and FL is one of those areas that hasn't had a defining case on nipples outside of the breastfeeding exception in the statute.\n\nEdit: Well, small correction. There was Moffet v. Florida that affirmed bare breasts were a nono but that was 42 years ago and a different statute. So I'm sticking with no current defining case. ",
                                                    "score": 891,
                                                    "author": "phneri",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 10,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Thanks! I know some places are weird and have outlawed exposed underwear",
                                            "score": 313,
                                            "author": "uthotright",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just keep your pink parts covered and you'll be fine. You may want to call the non-emergency police line and let them know that she is harassing you and why. That way, if she ever does call the police on you, they will already know she's a nutcase. ",
                                                    "score": 678,
                                                    "author": "Gingersnaps_68"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, you'll definitely want to check county laws and city ordinances.",
                                                    "score": 148,
                                                    "author": "Yoder_of_Kansas"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 15,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have the non emergency number for the police. When she threatens to call the cops on you just call the number and tell them your neighbor is harassing you for wearing jean shorts and you would like an officer to come out and trespass her from your property. If she comes up to you again you can have her arrested for trespassing. This women has some crazy ideas about what is sexual content and I would be worried about her kids.",
            "score": 1301,
            "author": "MrsGrownManFriend"
        },
        {
            "level": 0,
            "comment": "Hahaha, your edit was great. Well done! You might want to check local ordinances, but even the most strict would be very hard to enforce anything as long as you are wearing a top and bottom of some sort.",
            "score": 1686,
            "author": "yensid7"
        },
        {
            "level": 0,
            "comment": "Next time she threatens to call the police on your lewd dress, be like \"Okay.\" and then call the cops yourself on her harassment.  \n\nIt may very well be legal for you to be *topless* in public, though from what I understand the laws in FL are ambiguous and female public  toplessness has only been \"tested\" successfully on a beach in South Miami Beach.",
            "score": 859,
            "author": "Astramancer_"
        },
        {
            "level": 0,
            "comment": "While repeated unwanted interaction may rise to harassment one incident probably won't get anyone's attention. You could start recording her ridiculous behavior to document and call the non emergency police line. If it continues you may have grounds for a restraining order.",
            "score": 333,
            "author": "s-dubya"
        },
        {
            "level": 0,
            "comment": "1)  I would just ignore her and not respond.  2)  I live in Missouri and decency laws are both state and local.  In some places in the United States topless for women is legal.  Where I live, the law currently states that the nipple cannot be exposed.  \n\nI have a problem neighbor.  I have found that headphones, sunglasses, and not talking to her helped.",
            "score": 373,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Ignore her, nothing you're doing is illegal. Just let her talk to the wall for a while. If she escalates or gets confrontational or threatening, call the police. ",
            "score": 235,
            "author": "Rhonin1313"
        },
        {
            "level": 0,
            "comment": "The r/legaladvice community would like to welcome our guests from r/all and/or r/popular. We are glad you are visiting. There are a few things you should know before you post here:\r\n\r\n**We lock update posts that do not contain additional questions**. There are two reasons for this. First, this is a forum for legal advice and if none is sought, none will be offered. Second, those posts were moderating nightmares filled with off topic ranting and pointless arguments. We welcome update posts - particularly when a poster reports that they used our advice successfully. Even when they are locked in r/legaladvice there is almost always a discussion of the update in r/bestoflegaladvice for your popcorn needs.\r\n\r\n**Nothing here constitutes the formation of an attorney/client relationship**. This is not a substitute for an informed local attorney. At best, the advice herein assists the posters in taking the first step toward resolving their legal issue.  \r\n\r\n**We are not a popcorn sub**. We remove posts and ban posters who do not participate in good faith. We lock posts that meander off topic, devolve into pointless bickering, or result in too many reports to the mods. This is not to say that there isn't entertainment to be found here, indeed that is why most of us became involved in the law. It is fun. And when justice results, it is rewarding as well. \r\n\r\n**Our rules are in the sidebar to your right**. They are available in detail [here](https://np.reddit.com/r/legaladvice/comments/3jm6u2/the_law_of_the_land_please_read_before/) and our wiki is [here](https://np.reddit.com/r/legaladvice/wiki/index). For those of you who want more popcorn and fewer vegetables we invite you to visit our sister subs /r/bestoflegaladvice and /r/legaladviceofftopic. \r\n\r\n**Shitposting and brigading will earn you a permanent ban**. We respond to the situation at hand and the laws that apply.  This is not the place to grind your political axe or talk about what you think the law should be. If you want to change the law, get involved in local politics. \r\n\r\n**Personal anecdotes are not useful**. This is not the place to talk about how once your sister's roommate got out of a ticket by doing X. The fact that you have an anecdotal counterexample is not proof that the advice offered is wrong. \r\n\r\n**This is legal advice, not moral advice**. Sometimes we have posts on hot button issues such as abortion, child custody, rape, racial prejudice, sexism, and so on. People come here to learn about their legal options. Advice relating to their immortal souls can be found elsewhere on reddit, online, and at local mosques, churches, temples, and philosophy departments. Sometimes, however, legal advice is indistinguishable from life advice.\r\n\r\nThank you for visiting our sub. We hope you enjoy your time here and consider subscribing.\r\n\r\n\r\n---\r\nLocationBot 4.0 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
            "score": 61,
            "author": "LocationBot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tabby cats are thought to get their name from Attab, a district in Baghdad, now the capital of Iraq.\r\n\r\n\r\n---\r\nLocationBot 4.0 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
                    "score": 186,
                    "author": "LocationBot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will from now on. I've taken the kill 'em with kindness approach, but it hasn't been working.",
                    "score": 87,
                    "author": "uthotright"
                }
            ]
        }
    ]
}