{
    "id": "9t6902",
    "score": 19421,
    "title": "[Update] 62 Days in jail, Mistaken identity",
    "author": "whyiscorporatecrazy",
    "date": 1541045085.0,
    "url": "https://www.reddit.com/r/legaladvice/comments/9t6902",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/legaladvice/comments/9skxh8/i_was_arrested_kept_in_jail_for_62_days_and_then/?utm_source=reddit-android"
    ],
    "postText": "Original post:\n https://www.reddit.com/r/legaladvice/comments/9skxh8/i_was_arrested_kept_in_jail_for_62_days_and_then/?utm_source=reddit-android\n\nI've spoken to several attorneys and law firms throughout the state and have settled on one and signed the papers and all that stuff today. I want to thank all of you for giving me advice on what to ask and look for when speaking to them all, it really helped in narrowing it down and figuring out who was the best to go with. I can't really give out a whole lot of information because we are just starting to gather all the pieces and put it all together. There most likely will not be any updates to this for quite some time.\n\nTo answer the endless messages I received about race, I am white and early 20's, the person I was misidentified as is also white but in his 30's.\n\nI spoke to my boss and HR and will be back at work very soon and 2 months pay advance that will be paid back with OT. Also my landlord was really nice and is letting me pay the back rent over the next few months in installments.\n",
    "comments": [
        {
            "level": 0,
            "comment": "The r/legaladvice community would like to welcome our guests from r/all and/or r/popular. We are glad you are visiting. There are a few things you should know before you post here:\r\n\r\n**We lock update posts that do not contain additional questions**. There are two reasons for this. First, this is a forum for legal advice and if none is sought, none will be offered. Second, those posts were moderating nightmares filled with off topic ranting and pointless arguments. We welcome update posts - particularly when a poster reports that they used our advice successfully. Even when they are locked in r/legaladvice there is almost always a discussion of the update in r/bestoflegaladvice for your popcorn needs.\r\n\r\n**Nothing here constitutes the formation of an attorney/client relationship**. This is not a substitute for an informed local attorney. At best, the advice herein assists the posters in taking the first step toward resolving their legal issue.  \r\n\r\n**We are not a popcorn sub**. We remove posts and ban posters who do not participate in good faith. We lock posts that meander off topic, devolve into pointless bickering, or result in too many reports to the mods. This is not to say that there isn't entertainment to be found here, indeed that is why most of us became involved in the law. It is fun. And when justice results, it is rewarding as well. \r\n\r\n**Our rules are in the sidebar to your right**. They are available in detail [here](https://np.reddit.com/r/legaladvice/comments/3jm6u2/the_law_of_the_land_please_read_before/) and our wiki is [here](https://np.reddit.com/r/legaladvice/wiki/index). For those of you who want more popcorn and fewer vegetables we invite you to visit our sister subs /r/bestoflegaladvice and /r/legaladviceofftopic. \r\n\r\n**Shitposting and brigading will earn you a permanent ban**. We respond to the situation at hand and the laws that apply.  This is not the place to grind your political axe or talk about what you think the law should be. If you want to change the law, get involved in local politics. \r\n\r\n**Personal anecdotes are not useful**. This is not the place to talk about how once your sister's roommate got out of a ticket by doing X. The fact that you have an anecdotal counterexample is not proof that the advice offered is wrong. \r\n\r\n**This is legal advice, not moral advice**. Sometimes we have posts on hot button issues such as abortion, child custody, rape, racial prejudice, sexism, and so on. People come here to learn about their legal options. Advice relating to their immortal souls can be found elsewhere on reddit, online, and at local mosques, churches, temples, and philosophy departments. Sometimes, however, legal advice is indistinguishable from life advice.\r\n\r\nThank you for visiting our sub. We hope you enjoy your time here and consider subscribing.\r\n\r\n\r\n---\r\nLocationBot 4.125 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
            "score": 1,
            "author": "LocationBot",
            "replies": [
                {
                    "level": 1,
                    "comment": "A queen (female cat) can begin mating when she is between 5 and 9 months old.\r\n\r\n\r\n---\r\nLocationBot 4.125 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
                    "score": 1,
                    "author": "LocationBot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "---\r\n&gt; http://imgur.com/a/myIAb\r\n\r\n---\r\n*I am a bot whose sole purpose is to improve the timeliness and accuracy of responses in this subreddit.*\r\n\r\n---\r\n**It appears you forgot to include your location in the title or body of your post. Please update the body of your original post to include this information.**\r\n\r\n---\r\n***Do NOT delete this post - Instead, simply edit the post with the requested information.***\r\n\r\n---\r\n\r\nAuthor: /u/whyiscorporatecrazy\r\n\r\nTitle: **[Update] 62 Days in jail, Mistaken identity**\r\n\r\nOriginal Post: \r\n\r\n&gt; Original post:\n&gt;  https://www.reddit.com/r/legaladvice/comments/9skxh8/i_was_arrested_kept_in_jail_for_62_days_and_then/?utm_source=reddit-android\n&gt; \n&gt; I've spoken to several attorneys and law firms throughout the state and have settled on one and signed the papers and all that stuff today. I want to thank all of you for giving me advice on what to ask and look for when speaking to them all, it really helped in narrowing it down and figuring out who was the best to go with. I can't really give out a whole lot of information because we are just starting to gather all the pieces and put it all together. There most likely will not be any updates to this for quite some time.\n&gt; \n&gt; To answer the endless messages I received about race, I am white and early 20's, the person I was misidentified as is also white but in his 30's.\n&gt; \n&gt; I spoke to my boss and HR and will be back at work very soon and 2 months pay advance that will be paid back with OT. Also my landlord was really nice and is letting me pay the back rent over the next few months in installments.\n&gt; \r\n\r\n\r\n\r\n\r\n---\r\nLocationBot 4.125 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
            "score": 1,
            "author": "LocationBot"
        }
    ]
}