{
    "id": "10xp1kf",
    "score": 4,
    "title": "Looking to change Majors from Crim to EE or ME",
    "author": "SavageKensei",
    "date": 1675929149.0,
    "url": "https://www.reddit.com/r/fresnostate/comments/10xp1kf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Are the programs here worth it? Anything to look out for. Professors to get in contact with. Any and all advice/experiences are welcome. I know securing an internship(s) is paramount. I’m taking EE-1 and ME-1 so hopefully by the end of the semester I will know exactly what I want to go into. Thanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm in Computer Engineering which is similar to the EE degree, we take like 85% of the same classes, and it's great. Extremely rigorous so be prepared, but it's very rewarding. I know a lot of people, and myself, who secured internships so it's definitely setting you up for success. \n\nECE gets incredibly math intensive in the upper levels where it's basically applied mathematics. Ask any ECE major about ECE 124 and they will tell you their horror stories about that class.",
            "score": 2,
            "author": "LeeKom",
            "replies": [
                {
                    "level": 1,
                    "comment": "So do you just enjoy software more? Id considered CE as well, but I'm not that big into coding/programming. Any places you recommend to try to internship with?",
                    "score": 1,
                    "author": "SavageKensei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm a software guy, all my internships were software engineer internships. A good amount of people I know in ECE got internships in aerospace/ defense companies. I know some did NASA internships, some were with Intel. You can really intern anywhere as long as you put the work in. I grinded hard for internships and I got like 4 offers this season. \n\nWhether you're EE or CE you'll be taking a lot of similar classes. CE just opens up the software engineering world more.",
                            "score": 1,
                            "author": "LeeKom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "EE program is good. Talk to Dr Reaisie, he's the department chair.",
            "score": 1,
            "author": "T--Wrecks559"
        },
        {
            "level": 0,
            "comment": "I'm in ME right now and I would say that our engineering programs are definitely worth it. You have to do a lot of work obviously since the majors are really intensive, but we have a lot of clubs and opportunities within our programs that make it easier to get through. We also go to conferences and things like that for job fairs and so on - that's how a lot of us get internships/jobs, and it's how I got my internship for the summer. ME is extremely physics-intensive along with being math-intensive, but is a good program here at fresno state. The thing about ME is that you can go into pretty much anything with the major, so you'll have a lot of options if you go that route. For ECE, I know that there's a lot of math involved when it comes to upper levels if that's something you're interested. There's a great payoff for both, but be prepared to work for it.",
            "score": 1,
            "author": "StreetSwing3321",
            "replies": [
                {
                    "level": 1,
                    "comment": "What clubs are you in? And what internship were you able to secure + where are you at in your degree path; if you’re comfortable sharing or if you want to DM. I’m only at the beginning so I really have no idea what to apply for or look at, as I have barely got into CAD and MATLAB.",
                    "score": 1,
                    "author": "SavageKensei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm in a lot of clubs - ASME, SWE, IEEE, TBP, PTS but the mains are asme and swe for sure. I got an internship with Northrop Grumman, and I'm in my second year but have credits to count as a \"senior\" (from ap classes in hs/all of that). Your best bets for internships are to probably to keep track of even emails from LCoE (there's tons of events/career fairs/notices about internships and jobs), and to attend conferences if you can. I found that getting involved with clubs and groups that are attached to LCoE really helps to do all of this. You still early along though so I wouldn't worry too much if I were you.",
                            "score": 1,
                            "author": "StreetSwing3321"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice",
            "score": 1,
            "author": "angelaW-A"
        }
    ]
}