{
    "id": "q50uz",
    "score": 23,
    "title": "Fresno State hacks",
    "author": "caulfieldryecatcher",
    "date": 1330140580.0,
    "url": "https://www.reddit.com/r/fresnostate/comments/q50uz",
    "media_urls": [],
    "other_urls": [
        "https://googleapps.fresnostate.edu/mobilepassword/),",
        "http://www.usc.edu/its/google/config/apple.html)"
    ],
    "postText": "I thought it'd be cool to start a list of things we've learned or picked up about our campus that make life easier.\n\nA couple from me are:\n\n* You probably know how to [set up the school email on your iphone](https://googleapps.fresnostate.edu/mobilepassword/), but if you want to connect it to a regular email client like Mail for Mac, follow [this tutorial](http://www.usc.edu/its/google/config/apple.html) (obviously replacing USC’s server info with ours).\n\n* If you’re buying a fountain drink, buy it from Taco Bell Express or The Bucket, where you will get free refills, instead of The Pit or snackbar, where you won't.\n\n* If you’re taking Math 45, take it with Jim Ryan.",
    "comments": [
        {
            "level": 0,
            "comment": "Is there computer labs other than the libraries for general use?",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sometimes the lab in McKee-Fisk (second floor) is open, if there isn't a CSCI lab in progress.  Otherwise I usually go to the Engineering labs, the one in E. West is usually a good choice during school hours.",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Ok, two hidden computer labs, one which lets you install programs and one which has the biggest screens on campus (good for reading ebooks and taking notes at the same time!). The install anything lab is located on the second floor of McLane building next to the girl's restroom in the southeastern wing. The one with the huge screens is in the business building, across from the University Business center theres a door that leads into a hallway, third door on the left (can get pretty noisy because of finance people doing finance stuff). ",
                    "score": 3,
                    "author": "indiggnantuser"
                },
                {
                    "level": 1,
                    "comment": "3rd floor of engineering east is all computer labs and always has one open.  Not sure if you have to be an engineering student to use them, but if it isn't busy nobody cares.",
                    "score": 3,
                    "author": "girldinosaurs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Need a filler class? Take drama 62 with Ed (i forgot his last name) Easiest class ever. You just watch movies and listen to the professor's stories. The tests are open note and he tells you exactly what is going to be on it. ",
            "score": 3,
            "author": "Ejoty"
        },
        {
            "level": 0,
            "comment": "Could have sworn the bucket makes you pay for refills, or at least has a sign about it...",
            "score": 3,
            "author": "modusoperendi",
            "replies": [
                {
                    "level": 1,
                    "comment": "it has a sign for it, but no one enforces it or cares. ",
                    "score": 3,
                    "author": "decaado"
                },
                {
                    "level": 1,
                    "comment": "I thought the exact same thing, I guess now I don't have to sip my soda like a toddler.",
                    "score": 1,
                    "author": "jerryher"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The snackbar sometimes has day old cookies. You can get two cookies for a $1, and they taste better instead of the gooey shit you get for $1.25. ",
            "score": 6,
            "author": "Emelius"
        },
        {
            "level": 0,
            "comment": "I wish I knew the Math 45 protip. I have Kryder.",
            "score": 3,
            "author": "raraahahah",
            "replies": [
                {
                    "level": 1,
                    "comment": "[good luck.](http://i.imgur.com/x8Oei.jpg)",
                    "score": 4,
                    "author": "caulfieldryecatcher",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know this is a month old, but holy shit did I laugh.",
                            "score": 3,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "HOLY CRAP. Thank you!!",
                            "score": 2,
                            "author": "raraahahah"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jim Ryan made me love math! But I ended up getting my degree in history anyway. ",
                    "score": 1,
                    "author": "Shellion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're parking midday, either be relentless or be prepared to walk.  Like three years ago when I first experienced to parking I was totally screwed, because I was used to being polite.  FS has fixed that haha.",
            "score": 2,
            "author": "christeeny"
        }
    ]
}