{
    "id": "rzhh2s",
    "score": 6,
    "title": "Is it worth it to stay in the Kennel bookstore program where they pretty much automatically buy your books for you that you have to pay using your financial aid money. They claim to have special pricing but I just want to make sure I really am getting the best price.",
    "author": "healer1515",
    "date": 1641696517.0,
    "url": "https://www.reddit.com/r/fresnostate/comments/rzhh2s",
    "media_urls": [
        "https://i.redd.it/bd601tl3tka81.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Opt out. Some instructors will let you use an older version, or won't use the book at all. Ask your instructors. If they're ok with an older edition of a book then the savings there will be better than whatever they're saving you by forcing books on you.",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know where to opt-out I’m on a website that has the option to opt-out but it only shows a page saying I can’t opt-out until 2/5/2022 and if I do idk if I’ll get a refund from it",
                    "score": 1,
                    "author": "healer1515",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I cannot for the life of me find where to opt out. The website told me the same thing. I contacted the bookstore via the email on their contact page about this and will let you know when I receive a reply. In the meantime, I recommend you do the same thing demanding to be opted out as this program is just a way to lock students into a buying books they may never need.",
                            "score": 1,
                            "author": "J-Dubbleu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ikr, I’ll be waiting thanks for the notice",
                                    "score": 1,
                                    "author": "healer1515",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They told me to sign up for the account and do it from there, but I cannot for the life of me find it. This is such bullshit.",
                                            "score": 1,
                                            "author": "J-Dubbleu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Look for the email in your student account, like the one I posted on here. Go to your Gmail app or website and type in opt-in until you see the highlighted words and it’ll say make an account using the link below",
                                                    "score": 1,
                                                    "author": "healer1515"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If you need, I can send photos for example",
                                                    "score": 1,
                                                    "author": "healer1515",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Figure it out thanks for the help. Still a pita lol. Really appreciate it.",
                                                            "score": 1,
                                                            "author": "J-Dubbleu",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Were you able to opt-out?",
                                                                    "score": 1,
                                                                    "author": "healer1515",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yes. It was on the first site mentioned in the emails about the book. It just took a day after receiving the book to be able to \"refund\" it and opt out.",
                                                                            "score": 1,
                                                                            "author": "J-Dubbleu",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Can you send me a picture of it so I know what I’m looking for. Nothing about it saying refund shows up for me so I think it’s another website that I might’ve missed",
                                                                                    "score": 1,
                                                                                    "author": "healer1515",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Opt out. Get cheap older versions or “other” versions of textbooks.",
            "score": 5,
            "author": "D3ATHfromAB0V3x",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know where to opt-out I’m on a website that has the option to opt-out but it only shows a page saying I can’t opt-out until 2/5/2022 and if I do idk if I’ll get a refund from it",
                    "score": 2,
                    "author": "healer1515"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All I can say is, “Arr matey!”",
            "score": 1,
            "author": "ConsciousArt3"
        }
    ]
}