{
    "id": "s1zna0",
    "score": 8,
    "title": "How is the CS program at Fresno State?",
    "author": "Admirable_File2386",
    "date": 1641969687.0,
    "url": "https://www.reddit.com/r/fresnostate/comments/s1zna0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone in the CS program or who knows someone in the program at Fresno state, how is it?? How are the teachers, classes, etc? Are there much opportunities to get internships or jobs in Fresno?",
    "comments": [
        {
            "level": 0,
            "comment": "The CS program is alright. You can definitely get jobs and internships at big companies. There isn't much for work in the Fresno area, you'll definitely have to take a remote internship or move for the summer. The Computer Engineering program is much better. It depends on what you want to do for a career.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If my end goal is web developer or software developer or even software engineer, can computer engineering work well with getting those jobs?? What about cogsci with a minor in CS or taking CS classes for all electives in cogsci major? Would that option work for these career choices as well? If you know",
                    "score": 1,
                    "author": "Admirable_File2386",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have friends that work in all of the areas you mentioned coming out of the CompE program. It is much harder than the CS program but the professors are great and the degree opens so many more doors.  I graduated from the CompE program and I now work for Intel. Also, the alumni for CompE are much more active than most other programs and are very helpful with job placement. For example, I recruit for Intel at Fresno State and we look for CompE students. \n\n&amp;#x200B;\n\nIf anyone has any questions, just DM me and we can talk on discord. \n\n&amp;#x200B;\n\nYou can get a CSCI degree and a minor in CompE or the other way around.",
                            "score": 0,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Computer engineering is computer science on hard mode. I’d just go CS if your end goal is web/software development. Most people are self taught these days anyways.",
                            "score": 0,
                            "author": "Imposter1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is CS on hard mode, but you can get so many different jobs afterwords.",
                                    "score": -1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}