{
    "id": "12tjc6u",
    "score": 2,
    "title": "Dorm Questions",
    "author": "lurkystudent",
    "date": 1682034164.0,
    "url": "https://www.reddit.com/r/CofC/comments/12tjc6u",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\n\nI’m an upcoming freshman, and I’m really hoping to get a single room (mostly for mental health purposes, I struggle with overstimulation and social anxiety.) Would anyone have good advice for this? I know I am kind of late to the housing application, but nonetheless I would greatly prefer it. I am trying to get an appt. with my doctor before may 1, to maybe get accommodation request/suggestion in?\n\nAlso, what type of questions are on the housing application? I know you can’t be in a roommate group while requesting a private room, but can you still list preferences for flatmates? Ex. interests, demographics, politics, whatever. \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Definitely have you therapist write a letter explaining why it's important you get a single room. There are more single rooms than they let on. HOWEVER, it might be hard to get one your first year. Try again your second year.",
            "score": 3,
            "author": "oopsyeveryday14",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you, that makes me very relieved to hear :) side note, but, technically, I’m not sure if I count as a first year or not? I have ~60+ transfer credits from dual enrollment during HS. It will be my first time living at college, but in a way not my first year as a college student.",
                    "score": 3,
                    "author": "lurkystudent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not sure that'll matter from a student life point of view. They want to make sure you have opportunities to find your cofc family and are happy. But def start with a letter from your therapist and maybe include other ways you intend to get to know people, etc. They don't want you to feel isolated or alone. But there are SO MANY ways to get involved and be social outside of residence life, so you should be good. 🤗",
                            "score": 3,
                            "author": "oopsyeveryday14"
                        }
                    ]
                }
            ]
        }
    ]
}