{
    "id": "3eue5k",
    "score": 5,
    "title": "So how is it over there?",
    "author": "LilAFromTheBlock",
    "date": 1438046578.0,
    "url": "https://www.reddit.com/r/CofC/comments/3eue5k",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm a senior in high school who is pretty interested in CofC. If there are any out of state students on this sub, I would love to hear how it is for you and what the college is like. ",
    "comments": [
        {
            "level": 0,
            "comment": "This sub is pretty dead. I'm a recent alumni from instate but we actually have a surprising amount of out of state students. Ive met people from Connecticut, new Jersey, England, Alaska, Georgia, Spain, etc. I'd advise you to come visit though and try to talk to a few students once classes start up again.",
            "score": 5,
            "author": "CKitch26",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I've just been doing this for a few colleges. Trying to get like an uncensored and honest opinion. Thanks for the advice. ",
                    "score": 2,
                    "author": "LilAFromTheBlock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really enjoyed my time at the college.. If you have any specific questions I'll try my hardest to answer. I graduated in 2011 with a chemistry bs. ",
            "score": 2,
            "author": "Hlaford",
            "replies": [
                {
                    "level": 1,
                    "comment": "Were you from in state or out?",
                    "score": 1,
                    "author": "LilAFromTheBlock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was from in state. ",
                            "score": 1,
                            "author": "Hlaford"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm an alumnus who was kind of in-state, but moved here to go to the college. People come from all over, which was really fun.",
            "score": 2,
            "author": "darkhorse_defender"
        },
        {
            "level": 0,
            "comment": "Why not stay in-state? CofC's out-of-state tuition is as much as the University of Michigan's entire estimated cost of attendance(including housing, meal plan, etc) for in-state students.",
            "score": 2,
            "author": "atzenkatzen"
        },
        {
            "level": 0,
            "comment": "Despite its many flaws, I'm deeply in love with CofC and the city. That being said, I am an in state student. If you have the resources, look for a more well known college. ",
            "score": 2,
            "author": "yorkiepie"
        }
    ]
}