{
    "id": "p99lk",
    "score": 6,
    "title": "[Discussion] Bars and Restaurants",
    "author": "empw",
    "date": 1328279685.0,
    "url": "https://www.reddit.com/r/CofC/comments/p99lk",
    "media_urls": [],
    "other_urls": [],
    "postText": "What fits your style? What would you avoid? What are some really good unknown places?",
    "comments": [
        {
            "level": 0,
            "comment": "I go to the recovery room mainly, upper deck, burns alley, the blind tiger, big johns.\n\nI avoid the bars like silver dollar, O'Malley's, Midtowns.\n\nA bar relatively unknown, have you heard of the speak easy?",
            "score": 7,
            "author": "awakenseraphim",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have not. Love the upper deck, can do that almost every night. ",
                    "score": 2,
                    "author": "empw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just make sure someone else has to clean it up",
                            "score": 6,
                            "author": "spacemanspiff30"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've heard the speakeasy is expensive",
                    "score": 1,
                    "author": "ThatFluffyBunny"
                },
                {
                    "level": 1,
                    "comment": "add Mercury and Torch to that list of avoided listed bars and you would've nailed it.",
                    "score": 1,
                    "author": "heyitscharles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I avoid AC's, Silver Dollar, and O'Malleys mainly because of the cover/crowd. It's way too crowded and full of sloshed freshmen. Fish is either empty or waaaay too crowded. \n\nI tried that new bar beside Midtown (I can't remember the name) the other weekend but it gave it a weird euro-trash vibe and there was a cover. I won't be going back.\n\nBurns is great, and I go to Midtown every now and then.",
            "score": 2,
            "author": "internetbrunette"
        },
        {
            "level": 0,
            "comment": "I just adore The Tattooed Moose. Their pork belly is incredible (you can add it to the burger!), I love the duck fat fries with blue cheese and a whole head of roasted garlic, and the Duck (confit) Club, and the Lucky #1 with pork belly, bbq sauce and kimchi (which I ate yesterday and partially for lunch today, incidentally)... and they have a huge beer selection, and Magners, which not a lot of places have. Plus they have board games and you can write on the tables.",
            "score": 2,
            "author": "vactuna"
        },
        {
            "level": 0,
            "comment": "AC's is fun. Also, The Tattooed Moose.",
            "score": 1,
            "author": "theninetyninthstraw",
            "replies": [
                {
                    "level": 1,
                    "comment": "AC's can be fun, but it is a total sausagefest and on weekends it's very difficult to get to the actual bar.",
                    "score": 2,
                    "author": "ThatFluffyBunny"
                },
                {
                    "level": 1,
                    "comment": "I tend to stay away from places like Club Light unless I bring a girl because it can be a sausage factory up in thur.",
                    "score": 1,
                    "author": "theninetyninthstraw"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's all about Closed for Business.",
            "score": 1,
            "author": "heyitscharles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahahaha holy shit. I posted this months ago. Lulz. Yeah I like CFB, pretty expensive sometimes though. EPIC HUGE BEERS though.",
                    "score": 1,
                    "author": "empw"
                }
            ]
        }
    ]
}