{
    "id": "yfaef3",
    "score": 7,
    "title": "Anyone else think CofC just isnt what you thought it appeared to be?",
    "author": "Fit_Ad5212",
    "date": 1666921986.0,
    "url": "https://www.reddit.com/r/CofC/comments/yfaef3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was super excited to start here, but it just plain sucks. Theres not a lot of help even with the “resources” offered at the math center and other tutoring services…. the food at both liberty st fresh food Co. and city bistro suck… I have heard the staff there getting into arguments and they always have an attitude when I try to be nice because I have been working food and bev for years…. the admissions department put a hold on my account for registration because they never got my last transcript but i sent it into transfer resource center and was given credit for that class to be placed into the class I am currently in… before I even started school they lost my transcript 3 times. I got an email about a transfer only pre-orientation session and I called within minutes to try to do that and my “name wasnt on the list” the lady called me back at the end of the day and said sorry I have been taking calls for appointments all day so now im booked out 2 weeks… causing me to register late and get last minute picks on classes. The only good department was the counseling center… the math class at maybank hall upstairs are packing us in like sardines I feel so bad for the overweight person in our class bc I am struggling at 120lbs 5ft 2…. The desks are so tiny in there I cant even fit my laptop on it without it creeping over the edge.",
    "comments": [
        {
            "level": 0,
            "comment": "Well my kid had a 1st year experience that traumatized her.\n\nGee I wonder what happens when you put 8 girls in 1 dorm room.\n\nShe is now at a different school and is thriving. CofC has no school spirit at all and I’ve found that it appears to be a “2nd choice” school for the majority of kids.",
            "score": 4,
            "author": "Sooowasthinking",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was for me lmao.",
                    "score": 1,
                    "author": "PacificGrim02"
                },
                {
                    "level": 1,
                    "comment": "This is why I did not dorm there and lived at home and commuted. Wouldn’t want to be stuck with other people and deal with their shit.",
                    "score": 1,
                    "author": "myulaflaga"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You don’t go to CofC to go to school",
            "score": 2,
            "author": "sailnlax04",
            "replies": [
                {
                    "level": 1,
                    "comment": "By your comment do you mean its supposed to be a “party school”?",
                    "score": 1,
                    "author": "Fit_Ad5212"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And yeah, anything in Maybank just sucks. I had my maths in there and sometimes it gets hot in there 🥲 you’d be lucky if your class was in the AT&amp;T building. I was a comp sci major so I don’t want to worry about going to the main campus all the time.",
            "score": 1,
            "author": "myulaflaga"
        }
    ]
}