{
    "id": "z745f3",
    "score": 4,
    "title": "LGBTQ Scene?",
    "author": "843Gray",
    "date": 1669660072.0,
    "url": "https://www.reddit.com/r/CofC/comments/z745f3",
    "media_urls": [],
    "other_urls": [],
    "postText": "How is it at COC?  I always heard it was really good in Charleston, but thinking i might wanna go to COC &amp; wanna see if it's a good place for it.",
    "comments": [
        {
            "level": 0,
            "comment": "Not personally LGBTQ but I had a lot of friends at CofC that were. It’s definitely a positive environment and iirc there’s a club specifically for LGBTQ members. Also I’m pretty sure there’s an option in dorm selection to be placed with other members. \n\nCofC is a really progressive school despite being very very Southern and rooted in tradition and I’m sure you would have a good time there l",
            "score": 11,
            "author": "butt3rnugg3t"
        },
        {
            "level": 0,
            "comment": "I'm queer and was on the PRISM board last semester. PRISM is the gay club on campus, open to allies too. They weren't my scene so I left the board, but if you just wanna hang out with other queer people and have game nights and stuff then they're your group.\n\nThere's plenty of queer people who don't interact with PRISM tho. I've met so many people who just do a little bit of everything or nothing on campus. It's varied but pretty open all things considered.\n\nIf you want a better idea, I could send you the PRISM email address and they could explain things better, and perhaps give you the discord link- there's about 100 of us chilling on there most of the time!",
            "score": 1,
            "author": "Bullet_Poison"
        },
        {
            "level": 0,
            "comment": "I was really wary about going to college in the south when I first started, but I had almost nothing but good experiences. \n\nI can't speak for all professors, but the ones I had (mainly from the Classics department, because that was one of my majors) were great about LGBT stuff. I started going by a different name and pronouns and everyone was pretty chill about it. I was able to get an ID without my deadname within 24 hours of requesting a preferred name change even though I hadn't legally changed it yet. \n\nThere were sometimes students would would say something shitty, but they were shut down *fast* by professors.",
            "score": 1,
            "author": "gentlybeepingheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always have to remind people that Charleston city is a blue city. Pretty progressive city tbh.",
                    "score": 3,
                    "author": "myulaflaga"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am a bisexual freshman at CofC and so far it seems pretty welcoming to LGBT members, I took a first year experience class that was about Queer American History and it was amazing and I loved learning about it. The teacher was also super sweet as well and is openly queer if I remember correctly. I don't live on campus and don't interact with other students too much but I think most of them are accepting of LGBT students.",
            "score": 1,
            "author": "gossamerfae"
        }
    ]
}