{
    "id": "143rjz2",
    "score": 683,
    "title": "Conservative revolt paralyzes US House for second day",
    "author": "VictorChristian",
    "date": 1686177880.0,
    "url": "https://www.reddit.com/r/politics/comments/143rjz2",
    "media_urls": [
        "https://www.reuters.com/world/us/mccarthy-faces-sudden-challenge-hardliners-after-us-debt-ceiling-bill-2023-06-07/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Tom Emmer (majority whip) is just as incompetent as McCarthy. It's clear the republican party has no consensus on a direction or plan.",
            "score": 133,
            "author": "happyfuckincakeday",
            "replies": [
                {
                    "level": 1,
                    "comment": "They never wanted to govern. Only to obstruct progress and cause chaos.",
                    "score": 129,
                    "author": "SacamanoRobert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mission accomplished",
                            "score": 39,
                            "author": "esteban-was-eaten"
                        },
                        {
                            "level": 2,
                            "comment": "They are really good at that",
                            "score": 17,
                            "author": "Toothlessdovahkin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seriously. Like, what do they even want? They're being contrarian just for the sake of it. I hope their voters are happy with those chucklefucks not doing a single useful thing",
                    "score": 29,
                    "author": "gearstars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They want to be contrarian. Their voters want them to be assholes. The ~~donors~~ owners want them to do nothing (because the status quo heavily favors the wealthy).",
                            "score": 30,
                            "author": "Gonkar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If all they want is ro get nothing done then why don't they just oust Mccarthy and go back to having endless votes for speaker? They got a lot more media attention and more opportunities to air their grievances into microphones doing that than doing whatever the hell they think they're doing now.",
                                    "score": 6,
                                    "author": "Responsible_Pizza945",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because that belies their incompetence. They don’t want to be forced into acting ok ANYTHING, which is why they love being the minority party. They can squeal and rage all they want then blame the lack of meaningful legislation on democrats. When they’re in power, they’re ducked because the majority of Americans hate their policies and they’re beholden to the crazies who elected them, so it puts them between a rock (having policies that people hate) and a hard place (being forced to enact those policies whether they believe in them or not in order to keep votes and not lose their jobs).",
                                            "score": 7,
                                            "author": "PadKrapowKhaiDao"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Con-Cons",
                                    "score": 2,
                                    "author": "coffeeeducation"
                                },
                                {
                                    "level": 3,
                                    "comment": "No, they don’t.",
                                    "score": -3,
                                    "author": "invisible___hand"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, they’re not.",
                            "score": -3,
                            "author": "invisible___hand"
                        },
                        {
                            "level": 2,
                            "comment": "They want to be \"tough,\" which they conflate with \"being an asshole.\"",
                            "score": 0,
                            "author": "HeatherFuta"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "tbf the nutbags are impossible i guess they’re at the find out stage for getting die hard nuts elected",
                    "score": 3,
                    "author": "whatproblems"
                },
                {
                    "level": 1,
                    "comment": "They want a failed state with total access on tax budget to make it their personal slush funds like Russia. That's the goal. But there's too much infighting when there's no head honcho like Trump at the top to put pressure on their crazies to get in line.",
                    "score": 5,
                    "author": "KickBassColonyDrop"
                },
                {
                    "level": 1,
                    "comment": "Their only plan all along has been to grift their idiot base",
                    "score": 2,
                    "author": "le_fez"
                },
                {
                    "level": 1,
                    "comment": "Minnesotan who lives in Emmer’s district. Dude sucks and it kills me that he keeps getting elected out here. As progressive as my state has become in some ways, we’ve got a lot of regressive idiots here too. On behalf of a pretty kick-ass state, my apologies to everyone.",
                    "score": 2,
                    "author": "BearsOnUnicycles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s like these morons don’t realize their House majority of under half a dozen representatives doesn’t give them complete control of the government like they thought it would. They thought the concessions McCarthy gave them in January would hog tie him regarding their demands on legislation. Now that they see it didn’t, they don’t know what else to demand in order to achieve that end. The problem for them is that even if they somehow succeed in forcing McCarthy to bow, the Senate and Biden aren’t going to just go along as hostages. The original GOP bill never ever had a chance of actually becoming law, contrary to what the freedumb caucus may have thought.",
            "score": 68,
            "author": "D-Smitty",
            "replies": [
                {
                    "level": 1,
                    "comment": "They didn't intend on passing anything. The entire goal from the beginning was to tank the economy and blame the democrats for it.\n\nTrump was all for it.\n\nGaetz was even saying at one point something about how they shouldn't have to negotiate with their *hostage.*\n\nI have to be honest I'm surprised McCarthy *wasn't* on board with this and was willing to *actually* pass something bipartisan.\n\nHe's fucked himself.",
                    "score": 8,
                    "author": "Hikaru1024",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm really tired of waking up in the morning and wondering if I'll have a functional government that day.",
                            "score": 5,
                            "author": "poppyash"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "These people think they’re patriots. They’re not.",
            "score": 56,
            "author": "deezy54",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read \"potatoes\"... still upvoting.",
                    "score": 27,
                    "author": "wombatshit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know it was a mistake, but you should apologize to the next potato you see.",
                            "score": 5,
                            "author": "Pyro1934"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The label \"conservative\" is a misnomer as well. They're extremists. Really wish the label conservative could stop being used to describe them cause it makes it sound less insidious.",
                    "score": 5,
                    "author": "BowlofDumplings"
                },
                {
                    "level": 1,
                    "comment": "They dont think that. They have to pretend to think that though.",
                    "score": 6,
                    "author": "Senorpoppy117"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So is there anyway for the Dems to meaningfully take advantage of this infighting?",
            "score": 22,
            "author": "Blacklight100",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would be funny if Jeffries pulled 6 to 10 of the least batshit Republicans into a sort of coalition government, vacated the chair, and got the Speakership.  I'm sure the Democrats would hang together through Jan '25.",
                    "score": 22,
                    "author": "ristoril"
                },
                {
                    "level": 1,
                    "comment": "“Never interrupt your enemy when he is making a mistake” ― Sun Tzu",
                    "score": 33,
                    "author": "PoorPappy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're not making a mistake? Holding up the process of policy making is what they're trying to do. They are successful. \n\nThe only reason you think it is a mistake is because you think they're trying to **do** the same things as Democrats. They're not. Their goals are different and their measures of success are different. \n\nWe should not sit around and let them continue to obstruct progress, simply because they look like idiots doing it. They don't care about their image. They care about obstructing progress on policies that would help working Americans.",
                            "score": 14,
                            "author": "HealthcareIsKillUs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You've given me a new way to look at the GOP.",
                                    "score": 3,
                                    "author": "PoorPappy"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Never argue with an idiot, they'll only bring you down to their level and beat you with experience. - my old HS friend",
                            "score": 10,
                            "author": "Sansey0408"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You've already got funny shit like this happening. \n\n&gt;The ultra-conservative House Freedom Caucus sided with Democrats on Tuesday to block two bills that would prevent the federal government from putting new regulations on gas stoves",
                    "score": 5,
                    "author": "BurkeyTurger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The fuck? Is it the 1800s? Are gas stoves some sort of hot button topic?",
                            "score": 1,
                            "author": "stixyBW"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another paralyzing, dysfunctional display of ineptitude by the only party simply unable and unfit to govern anything or anyone, ever. Sad.",
            "score": 14,
            "author": "RoachBeBrutal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lincoln would be so pissed off to see what’s become of his party.  I used to be a registered Republican until Obama’s second term.  I will never vote for a Republican or Libertarian, or any variety right wing nut job for that matter, ever again.      \n\nIt’s been generations since the GOP did anything that actually made the lives of common Americans better.  The next few election cycles will be really interesting.  I wonder if enough people are outraged enough to turn the tide of fascism that is quickly approaching.  Have enough MAGA idiots and hateful boomers died of covid and old age?  Will the Independents plan swing left like they did in the last midterms?  Are millennial and Gen Z voters pissed off enough to fulfill their civic duties?  Are women and LGBTQ+ frightened and angry enough to demand our rights be returned to us, and for real this time no takebackseys?  I could go on for mma y different groups who continually suffer under Republican policies but you get it.  \n\nThat’s what it’s going to take.  We only have maybe one or two more elections to get this right or we can kiss it all goodbye.",
                    "score": 16,
                    "author": "DeutschlandOderBust"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not like they were going to pass anything that'd get signed into law anyway.",
            "score": 38,
            "author": "o8Stu"
        },
        {
            "level": 0,
            "comment": "I'm still waiting for the vacate option that they insisted on back in January.",
            "score": 13,
            "author": "2_Sheds_Jackson"
        },
        {
            "level": 0,
            "comment": "Paralyzed? Just this week they voted on some gas stove bill thing...oh nevermind",
            "score": 9,
            "author": "muahtorski",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah yes the freedom to keep the deep state from saving your kids from asthma act",
                    "score": 1,
                    "author": "JohnF_President"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's what happens to people when they overdose on ivermectin.",
            "score": 25,
            "author": "Heelajooba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some that play on golf courses take pills meant for horses.",
                    "score": 29,
                    "author": "Michael_In_Cascadia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aw, that's so sad!  Popcorn, anyone?",
            "score": 23,
            "author": "NomDePlume007"
        },
        {
            "level": 0,
            "comment": "So cute when they eat their own.",
            "score": 22,
            "author": "jhuston44"
        },
        {
            "level": 0,
            "comment": "they keep trying to close down government. If not by insurrection, then, by any other means.",
            "score": 7,
            "author": "Quinquilharia"
        },
        {
            "level": 0,
            "comment": "We need to use a different word. These troglodytes are not conservative in any way.",
            "score": 5,
            "author": "Projectoratoring",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could we call them 'anarchists'?",
                    "score": 3,
                    "author": "CalvinCopyright",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d like to be able to call them “convicted felons”",
                            "score": 3,
                            "author": "kiltedturtle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Conservatives are as conservatives do. Ultimately, it's just a fancy word for selfishness. Look at what conservatives have championed over the years: \n\n* Slavery - \"I want to own people for free labor.\"\n\n* Bigotry - \"I want people who look/love like me to be treated better, and the right to mistreat everyone else.\"\n\n* Corporate tax breaks - \"I want more money.\"\n\n* Deregulation - \"I want to be able to exploit people/environment to increase profits, regardless of the harm.\"\n\n* Union-busting - \"I don't want my workers to have any negotiating power.\"\n\n* Anti-masking - \"My comfort is more important than public health.\"\n\n\nConservatism has ZERO accomplishments that we can look at and be proud of. Literally ZERO things we can point to and say \"good thing conservatives defeated progressives on that.\" Every conservative accomplishment was some bigoted or selfish bullshit that had to or needs to be undone.",
                    "score": 1,
                    "author": "paul_miner"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m totally fine with the House being in chaos and nothing coming out for a few years! Can’t have a horrible bill if they can’t even hold a session.",
            "score": 3,
            "author": "Least-Fail-5005"
        },
        {
            "level": 0,
            "comment": "Republicans are revolting. But, you already knew that.",
            "score": 3,
            "author": "jodyleek67"
        },
        {
            "level": 0,
            "comment": "If Kevin was even semi competent he would see this as an opportunity to purge the radicals from his party by working with some of the more conservative Dems to get the votes he needs.\n\nKevin McCarthy is not competent however",
            "score": 3,
            "author": "Deck_of_Cards_04"
        },
        {
            "level": 0,
            "comment": "Get that gavel banger of decorum MTG back in the speaker seat. She'll soccer mom 'em all back into shape. /s/",
            "score": 8,
            "author": "BadAsBroccoli"
        },
        {
            "level": 0,
            "comment": "Doesn’t matter. None of their partisan legislation will go anywhere anyway.",
            "score": 2,
            "author": "Msmdpa"
        },
        {
            "level": 0,
            "comment": "4 day weekend!!!",
            "score": 2,
            "author": "Previousman755"
        },
        {
            "level": 0,
            "comment": "Well, at least they passed the debt ceiling.",
            "score": 2,
            "author": "GTGearZero"
        },
        {
            "level": 0,
            "comment": "Lol, tots and pears, whomp whomp, and all that jazz. 😂",
            "score": 2,
            "author": "HaxanWriter"
        },
        {
            "level": 0,
            "comment": "Remember this?\n\nhttps://i.imgur.com/ip5J6Ec.jpg",
            "score": 2,
            "author": "Ditka85"
        },
        {
            "level": 0,
            "comment": "I feel so owned right now.",
            "score": 2,
            "author": "ApatheticWithoutTheA"
        },
        {
            "level": 0,
            "comment": "Republican politicians are lazy, mean, and dumb.",
            "score": 2,
            "author": "PunishTraitorTrump"
        },
        {
            "level": 0,
            "comment": "Its not a revolt. They are just strategizing how they are going to handle trumps arrest tomorrow",
            "score": 2,
            "author": "Iridemhard"
        },
        {
            "level": 0,
            "comment": "Take advantage dems, take advantage.",
            "score": 2,
            "author": "Mysonsanass"
        },
        {
            "level": 0,
            "comment": "They've always been revolting; now, they're rebelling.",
            "score": 2,
            "author": "raresanevoice"
        },
        {
            "level": 0,
            "comment": "Incapable of governing.",
            "score": 2,
            "author": "daspiredd"
        },
        {
            "level": 0,
            "comment": "Wish I could revolt at my job, do nothing and still get paid.",
            "score": 2,
            "author": "The_Great_Xandinie"
        },
        {
            "level": 0,
            "comment": "Only the second? They’ve been revolting for decades! Oh, you didn’t mean loathsome?",
            "score": 2,
            "author": "BeeRye3"
        },
        {
            "level": 0,
            "comment": "“Conservative”",
            "score": 1,
            "author": "_gaba_ghoul"
        },
        {
            "level": 0,
            "comment": "My prediction: the MAGA republicans are going to attempt to oust McCarthy and replace him with one of their own. The Dems and the so called “moderate” republicans will then join to keep him in office. Which will result in the MAGAs being relegated into the ineffective squad in the corner. Couple that with Trumps pending arrest for espionage and that will be the end of this fascist movement but for the final shouts and squirms (which will probably be violent).",
            "score": 1,
            "author": "Ok-Ease7090"
        }
    ]
}