{
    "id": "143vktv",
    "score": 3295,
    "title": "Trump Reportedly Gets Target Letter; Testimony Includes Meadows",
    "author": "Master_N_Comm",
    "date": 1686188216.0,
    "url": "https://www.bloomberg.com/news/articles/2023-06-07/trump-reportedly-gets-target-letter-testimony-includes-meadows",
    "media_url": "https://www.bloomberg.com/news/articles/2023-06-07/trump-reportedly-gets-target-letter-testimony-includes-meadows",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The ultimate icing on the cake is if he starts taking out all the republican congressmen's skeletons in the closet he has been hoarding over the years in a vain attempt to save himself. To see all those politicians being outed who've protected him all that time would be so so beautiful.",
            "score": 998,
            "author": "bsmknight",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awww yiss. This orange dude must have truck loads of blackmail.",
                    "score": 265,
                    "author": "jessie-farsi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The orange dude doesn't have it.. His russian mafia masters do. And they may prefer to let their orange assett suffer, instead of using up ammo.",
                            "score": 152,
                            "author": "Vimes3000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I’m sure he has some. His term was neither careful nor clean and I’m sure a lot of what he knows he knows directly.",
                                    "score": 67,
                                    "author": "maskedbanditoftruth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s how kompromat works. Do something dirty with someone then hold it over their head.\n\nAnyone within 100 yards of this loser is corrupt and you’ve essentially walked into the lions den if you’re “clean”, so to speak.\n\nIf you had a cup of coffee with one of half the people he’s spent decades around you would raise multiple flags at all sorts of agencies.\n\nRoll around with pigs…",
                                            "score": 43,
                                            "author": "Shreddit69"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’d love to see Rs get caught between Trump blackmail and Russian Kompromat. Shit starts flying, and ends when Russia releases the P tape.",
                                            "score": 15,
                                            "author": "liberal_texan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That pee tape wouldn’t end anything. No one would care.",
                                                    "score": 6,
                                                    "author": "maskedbanditoftruth",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don’t think the P stands for urine",
                                                            "score": 9,
                                                            "author": "liberal_texan"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Orange is the new blackmail.",
                            "score": 13,
                            "author": "always-a-hoot"
                        },
                        {
                            "level": 2,
                            "comment": "he does, but he won't. the people who have his blackmail have made it very clear why he can't do that.",
                            "score": 7,
                            "author": "Sciencessence",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;This orange dude must have truck loads of blackmail.\n\nIt's kompromat and it's on both him and the Republicans. There's a reason Lindsey Graham keeps waddling back to Trump and it's almost certainly tied to his 'confirmed bachelor' lifestyle.",
                            "score": 5,
                            "author": "ashok36",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There has got to be mountains of dirt on Lindsay Graham. I secretly hope there's more mountains on Jim Jordan, Matt Gaetz, and Clarence Thomas. Drain the swamp!",
                                    "score": 3,
                                    "author": "lcmillz"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nobody would trust him with information. He'd tweet it the next time he finds himself on the toilet.",
                            "score": 2,
                            "author": "nmeofst8"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "With how hard Cruz trolls for him, Trump is bound to have actual proof that he’s the zodiac killer",
                    "score": 46,
                    "author": "Barqck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or an actual lizard person what with all the UFO news lately.",
                            "score": 23,
                            "author": "rjrgjj"
                        },
                        {
                            "level": 2,
                            "comment": "He probably doesn’t need proof, one tweet and any texas sheriff will round up a posse on Ol Ted",
                            "score": 2,
                            "author": "BigJSunshine"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We’re giving him a lot of credit by assuming he remembers things.",
                    "score": 20,
                    "author": "ChinDeLonge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He has a good memory for blackmail don’t worry. Spite and vengeance is 90% of his memory and the other 10% is McDonalds and Ketchup Steaks.",
                            "score": 30,
                            "author": "ApatheticWithoutTheA",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That would be wonderful. If he does then that only is the patriotic thing he has ever done in his life.",
                    "score": 72,
                    "author": "SameResearcher",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't give him any credit, if it wasn't done from a love of country or sense of duty then it isn't patriotic. This would just be the latest petty and vengeful act from an extremely petty and vengeful person.",
                            "score": 70,
                            "author": "goldleaderstandingby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He did say it would be patriotic. He said it would be the most patriotic thing Trump ever did.",
                                    "score": 14,
                                    "author": "Bmcronin"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They all have tapes on each other. It’s gonna get wild.",
                    "score": 12,
                    "author": "striker69"
                },
                {
                    "level": 1,
                    "comment": "Well, he did have the DOJ reporting to him. I figure he’s probably got info on many cases the DOJ didn’t pursue because of how privileged the perp was.",
                    "score": 10,
                    "author": "janzeera"
                },
                {
                    "level": 1,
                    "comment": "I read, “iceberg on the cake.” Ima take that and run",
                    "score": 8,
                    "author": "gattboy1"
                },
                {
                    "level": 1,
                    "comment": "The schadenfreude experienced by this could power the world for a generation.",
                    "score": 5,
                    "author": "Dirtydeedsinc"
                },
                {
                    "level": 1,
                    "comment": "Stop 1 better be Lindsey Graham.  What does TFG have on him?",
                    "score": 6,
                    "author": "CertainAged-Lady",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kompromat on Graham being homosexual and hiring male prostitutes to probe his ladybugs.",
                            "score": 6,
                            "author": "usernicktaken"
                        },
                        {
                            "level": 2,
                            "comment": "He suspiciously met with the Proud Boys prior to the failed coup and he also spent a long time trying not to testify before Fani Willis's Special Grand Jury - he also attempted to get some votes discounted, he will probably be swept up in the RICO charges.",
                            "score": 3,
                            "author": "noelcowardspeaksout"
                        },
                        {
                            "level": 2,
                            "comment": "Has to be way more than just his obvious gayness…",
                            "score": 2,
                            "author": "Utterlybored"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lindsay Graham starts sweating feverishly. I think his kompromat that Trump held over him is that he is a pedo.",
                    "score": 16,
                    "author": "weeburdies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It has to be something like this. Why else would a grown man cry over Trump being indicted?",
                            "score": 7,
                            "author": "WoodySurvives"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If? He 100% goes the scorched earth route",
                    "score": 3,
                    "author": "drapparappa"
                },
                {
                    "level": 1,
                    "comment": "Well there is a reason he's been hoarding all those classified documents.",
                    "score": 3,
                    "author": "poorbill",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And wouldn’t make a difference in the charges. I think he should do it.",
                    "score": 6,
                    "author": "Ptizzl"
                },
                {
                    "level": 1,
                    "comment": "Pls, stop. My penis can only get so erect!",
                    "score": 5,
                    "author": "soysaucepapi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same! And I’m a lady!",
                            "score": 3,
                            "author": "Tall_aussie_fembot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "His handlers would never let him out the rest of their operatives",
                    "score": 2,
                    "author": "TheTaxman_cometh"
                },
                {
                    "level": 1,
                    "comment": "Especially easy because all he has to do is make shit up and his base will believe him. I mean he could say anything he wants about how Lindsey Graham had sex with all those puppies while sucking on George Soros toes, while reanimated disguised Hitler (aka Barack Obama) looked on and applauded.",
                    "score": 2,
                    "author": "vulgrin"
                },
                {
                    "level": 1,
                    "comment": "He will sell absolutely anyone up the river to save his own skin.",
                    "score": 2,
                    "author": "MoeSzyslakMonobrow",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This! People called me crazy, but there is and always was ONE good thing about Trump and his presidency: pride, fall, ironically drain the swamp. One step back for two forward.",
                    "score": 2,
                    "author": "dgobrien"
                },
                {
                    "level": 1,
                    "comment": "50/50 odds\n\nTrump will be killed by those that know he'll throw out every bone they've hidden.  It won't be just those politicians looking to shut Trump's hole up either...  Everybody within that web of corruption from Russians, Saudis, and even his own family are going to want Trump dead if he's incarcerated.  \n\n...because everybody knows that Trump would sing like a canary on crack, if he's in prison.",
                    "score": 2,
                    "author": "RealityMask"
                },
                {
                    "level": 1,
                    "comment": "Finally draining the swamp",
                    "score": 1,
                    "author": "therealpigman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Breaking: Mystery Flood Soaks Target Letter, Trump Seeks to Discard and Pretend it Doesn’t Exist",
            "score": 104,
            "author": "Dear_Profession_8297",
            "replies": [
                {
                    "level": 1,
                    "comment": "~~Mac~~ [45 Eats The Contract](https://www.youtube.com/watch?v=aWyh1W3GJEc)",
                    "score": 23,
                    "author": "fence_sitter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What happened to Rob Riggle? He was everywhere and now I never see him",
                            "score": 7,
                            "author": "RestrictedAccount",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He was at the NFL draft, he's apparently collaborating with Fireball to release a barrel aged [whiskey](https://thewhiskeywash.com/whiskey-styles/american-whiskey/fireball-introduces-a-barrel-aged-cinnamon-whisky-in-partnership-with-rob-riggle/)",
                                    "score": 2,
                                    "author": "yankeesfan14"
                                },
                                {
                                    "level": 3,
                                    "comment": "His wife went nutso and he had to file a restraining order.",
                                    "score": 2,
                                    "author": "thrakkerzog"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In Trumps defense, he can’t read.",
            "score": 464,
            "author": "TheTonyExpress",
            "replies": [
                {
                    "level": 1,
                    "comment": "“This indictment can’t stop me because I can’t read”",
                    "score": 160,
                    "author": "TheCovfefeMug",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ironically he thinks his initials are D.W. cause he can't spell either",
                            "score": 42,
                            "author": "DarkWolf966",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can’t you hear the flugelhorns???",
                                    "score": 8,
                                    "author": "Horknut1"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If Trump could read, he'd be very upset.",
                            "score": 29,
                            "author": "StephanXX"
                        },
                        {
                            "level": 2,
                            "comment": "I'm Donald Trump, I'm 76 years old, and I never learn how to read",
                            "score": 3,
                            "author": "Feeling-War4286"
                        },
                        {
                            "level": 2,
                            "comment": "If that orange ketchup covered dummy inside could read, he’d be very upset",
                            "score": 2,
                            "author": "BigJSunshine"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or use the right spelling of words since Meadow's \"through him under the bus\" according to his own truth social rant.",
                    "score": 29,
                    "author": "j1akey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Milk toast lol",
                            "score": 7,
                            "author": "originalityescapesme"
                        },
                        {
                            "level": 2,
                            "comment": "“I never even saw this guy. He maybe brought me coffee.”",
                            "score": 18,
                            "author": "TheTonyExpress",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How many people does Trump hire at a time to bring him coffee or cofveve?",
                                    "score": 3,
                                    "author": "Utterlybored",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting that he doesn't know the ones who bring him coffee, but he's got a guy whose sole purpose is to bring him diet Coke.  I bet he knows THAT guy.",
                                            "score": 3,
                                            "author": "JohnOliverismysexgod"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Meadows? Never heard of him.”",
                    "score": 8,
                    "author": "DweEbLez0"
                },
                {
                    "level": 1,
                    "comment": "It needs to be on a big piece of paper drawn with crayons and crepe paper.",
                    "score": 5,
                    "author": "RandomWombat11523",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hear he prefers sharpies",
                            "score": 5,
                            "author": "RojoTheMighty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He is not allowed sharpies cos he kept drawing on the furniture with them.",
                                    "score": 9,
                                    "author": "RandomWombat11523"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The suspense is killing me Donnie, how did it taste???",
                    "score": 1,
                    "author": "Rofl_Stomped"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey Donnie, why dontcha just write Jack back to explain that you did EVERYTHING RIGHT and have done NOTHING WRONG. I'm sure he'll understand.",
            "score": 73,
            "author": "No-Menu-2524",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dear Jack I wrote you, but you still ain't callin'   \nI left my cell, my pager and my home phone at the bottom.   \nI sent two letters back in autumn, you must not've got em.",
                    "score": 35,
                    "author": "Bitey_the_Squirrel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There probably was a problem at the Mar A Lago server room or something.",
                            "score": 14,
                            "author": "PresentArea6919"
                        },
                        {
                            "level": 2,
                            "comment": "Hey donnie sorry I havent been able to write back, someone let some secrets out and we were under attack.",
                            "score": 3,
                            "author": "Senorpoppy117",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All of this needs to become a thing.",
                                    "score": 2,
                                    "author": "fapping-factivist"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "DeJoy must’ve fucked up the post office or something.",
                            "score": 4,
                            "author": "riskybiscutz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"What's this word?\"  \nThis  \n\"What's this word?\"  \nis  \n\"What's this word?\"  \nto  \n\"What's this word?\"  \ninform  \n\"What's this word?\"  \nyou  \n\n*etc*",
            "score": 221,
            "author": "gasahold",
            "replies": [
                {
                    "level": 1,
                    "comment": "If he needs to read a letter to figure out he's under investigation, he's got bigger issues.",
                    "score": 63,
                    "author": "Beelzabub"
                },
                {
                    "level": 1,
                    "comment": "reminds me of the scene on Dumb and Dumber where Lloyd is reading Harry the newspaper.... \n\n\"t-he, t-he....\" \n\n\"it says \"the\"",
                    "score": 26,
                    "author": "Status_Arachnid9722",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Samsonite!",
                            "score": 20,
                            "author": "Accurate-Savings-430",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was way off!",
                                    "score": 13,
                                    "author": "dlchira"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“A new all….anal you….”\n\n“That’s a a tough one, it’s annual”",
                            "score": 12,
                            "author": "6BigZ6"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Stupid Borat.",
                    "score": 6,
                    "author": "MississippiJoel"
                },
                {
                    "level": 1,
                    "comment": "“Taa…. Taaa heeeh.”\n\n“That’s ‘the’ sir”",
                    "score": 2,
                    "author": "groceriesN1trip"
                },
                {
                    "level": 1,
                    "comment": "[Trump reminiscing about his visit to Epstein island](https://youtu.be/xhHPyjJIS0w)",
                    "score": 1,
                    "author": "OverconTrolling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you think a person can get numb to finding out about criminal investigations against them? Not Trump, necessarily, since his emotional reactions to things are clearly off. But a person with reasonably healthy mental processes? Can they get to the point where they're just like... meh, add it to the list?",
            "score": 151,
            "author": "stormywhethers321",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trump has never really been held accountable for anything. He's got enough money to tie up white collar stuff in the courts basically forever. So, he probably thinks he can get the government to settle, pay people off, and generally make it go away.\n\nIt probably hasn't occurred to him, or quite sunk in, that these are national security charges in Federal court. He can try to outlast the government, but I suspect the DOJ will make that excruciatingly difficult. He can try and tie up the process with bullshit and appeals, but it's doubtful that lasts forever or even works.\n\nIf the DOJ is indicting, they have him dead to rights. Zero wiggle room, and no appeals are going to get him out of it.\n\nI think it's not so much him being numb, but rather him not understanding the gravity of the situation.",
                    "score": 167,
                    "author": "monkeybiziu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or he thinks he's gonna win the election pardon himself, fire the entire DOJ, fire everyone at the FBI and then start going after his enemies with all the new lackies he just installed.",
                            "score": 126,
                            "author": "jagid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This. All he needs is a Republican to take the White House and all these federal charges go away he's also trying to pull the state charges in NY and GA into federal court instead.... I wonder why 🤔",
                                    "score": 66,
                                    "author": "TheyCallMeSlyFox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Georgia governor has no pardon power",
                                            "score": 14,
                                            "author": "boxer_dogs_dance"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup. Any GOPer who wins the election will pardon Dump and all the Jan 6 traitors",
                                            "score": 7,
                                            "author": "weeburdies",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I wouldn’t be so sure of that. When (normal) people take the job the weight of it actually hits them. This is also based on the very unlikely situation where a Republican won. Trump lost by 7 million votes. The only way a Republican could win and have the political capital to do it is nearly impossible in the first place but look how pardoning Nixon is talked about now. Nixons was significantly less offensive too.\n\nTrump tried to stage a coup. He might have been selling or just giving away National security secrets.",
                                                    "score": 9,
                                                    "author": "MagicalTargaryen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Republicans care about his MAGA base A LOT.",
                                                            "score": 6,
                                                            "author": "Utterlybored",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If they beat trump for the nomination and win the general he becomes irrelevant. What would be in it for them?",
                                                                    "score": 3,
                                                                    "author": "MagicalTargaryen"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Like Republicans give two shits about anything Trump ever did or will do.",
                                                            "score": 0,
                                                            "author": "Chrome-Head"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not so sure they would. Don't get me wrong I'm not saying they'd do it for the good of the country but trumps an albatross for the party\n\nGetting rid of him AND being able to scream how the dems are coming for everyone  because of it is goof for them",
                                                    "score": 1,
                                                    "author": "Buffmin"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;\tAll he needs is a Republican to take the White House and all these federal charges go away\n\nI’m not too sure that’s true if Pence wins.  He did almost get murdered because of Trump after all.  He has to put on a show like he’s cool with that, but you can tell there is lots of resentment there.",
                                            "score": 2,
                                            "author": "dquizzle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I honestly don’t see Pence winning. I’m hoping it’s not Trump, but don’t see it being Pence.",
                                                    "score": 6,
                                                    "author": "Joeuxmardigras",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I definitely can’t see that either, I just doubt the statement that any Republican win means a pardon for Trump.",
                                                            "score": 2,
                                                            "author": "dquizzle"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Or he thinks he's gonna win the election pardon himself\n\nWhen he took office one of the first things he did was start asking his lawyers if he could do this. He knows :)",
                                    "score": 10,
                                    "author": "conejodemuerte"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He's an old man. It doesn't need to last forever for him to die free and unconvicted.",
                            "score": 17,
                            "author": "LurkerFailsLurking"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;but rather him not understanding the gravity of the situation.\n\nThere's an irony in Trump's fat ass not understanding the gravity of a situation.",
                            "score": 14,
                            "author": "Vlad_the_Homeowner"
                        },
                        {
                            "level": 2,
                            "comment": "From what I understand Mar-a-lago actually has a wiggle room.",
                            "score": 7,
                            "author": "DaveMTIYF"
                        },
                        {
                            "level": 2,
                            "comment": "So much truth",
                            "score": 5,
                            "author": "showmeyourkitteeez"
                        },
                        {
                            "level": 2,
                            "comment": "The DOJ doesn’t have him and they aren’t indicting ….yet \n\nWe can speculate for years, I did with Mueller and then I read how bad Mueller wanted to join Trumps golf club back in the day. \n\nAnd remember a NY prosecutor already stepped down in one case against Trump. \n\nI’m not holding my breath. I’m hoping but ..",
                            "score": 3,
                            "author": "drakeftmeyers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Barr was blocking Mueller.",
                                    "score": 12,
                                    "author": "boxer_dogs_dance",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And Mueller attends the same church as Barr.",
                                            "score": 10,
                                            "author": "babysinblackandImblu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They are GOP buddies",
                                                    "score": 8,
                                                    "author": "weeburdies"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its only recently that he's actually been held accountable and indicted after all the shit he did.  so ya he probably feels invincible but now the walls are stating to crumble",
                    "score": 11,
                    "author": "nanixay799"
                },
                {
                    "level": 1,
                    "comment": "So far he has been indicted for falsifying business records. That's the kind of crime where his lawyers can drag it out on appeals for decades or work out a plea deal to avoid jail time. The documents thing could be an espionage charge. That's a capital offense. If he gets one of those \"Trump hating judges\" that he keeps complaining about he could get the death penalty. If he doesn't think this is a big deal, he's even dumber than I thought.",
                    "score": 37,
                    "author": "starmartyr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The death penalty isn't a possibility for the espionage charge he's likely to get, but he's old enough that he'd likely die in prison.",
                            "score": 32,
                            "author": "Moccus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There was an FBI agent who was imprisoned for espionage and recently passed, in prison, at 78. Made room?",
                                    "score": 24,
                                    "author": "ClusterFoxtrot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Robert Hansen.  Convenient timing.",
                                            "score": 14,
                                            "author": "fellatio-del-toro",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A cell now available",
                                                    "score": 5,
                                                    "author": "MrWhite"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We don't actually know that. We don't know the content of the documents he had or what the DOJ can prove he did with them.",
                                    "score": 7,
                                    "author": "starmartyr"
                                },
                                {
                                    "level": 3,
                                    "comment": "...or until he's pardoned fully by the next boot licking R pres.",
                                    "score": 2,
                                    "author": "MrRourkeYourHost"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But now a trial might be ‘closer to the crime’ in Florida. If so, the is more of a chance a MAGA slips their way on the jury. For some reason I’m convinced this will happen.",
                            "score": 3,
                            "author": "babysinblackandImblu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trump's superpower is No Shame.",
                    "score": 5,
                    "author": "FlounderSubstantial7"
                },
                {
                    "level": 1,
                    "comment": "Of course. If you’ve been indicted for 8 murders you probably won’t much care when they find the 9th body.",
                    "score": 3,
                    "author": "-MtnsAreCalling-"
                },
                {
                    "level": 1,
                    "comment": "Would a person with reasonably healthy mental processes have enough legal actions against them to worry about their sanity?",
                    "score": 1,
                    "author": "ReallyGlycon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hell fucking yeah. Bring it.",
            "score": 49,
            "author": "abstractattack"
        },
        {
            "level": 0,
            "comment": "I find it very delightful that he and his followers would chant “Lock Her Up!”… now the tables are turning",
            "score": 49,
            "author": "kennyj2011",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s the crowd that staunchly supports law &amp; order. They’ll be chanting “Lock him up!” any minute now.",
                    "score": 14,
                    "author": "FreedomSynergy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": " Hilary does Nelson Muntz' \"Ha Ha!\"",
                    "score": 2,
                    "author": "ozspook"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've gotten very jaded waiting for this crook to finally be held accountable for his crimes, but it does seem like finally the wheels of justice are moving and Trump will actually face federal charges. I saw the Independent reported that he's likely getting indicted on espionage charges as well as obstruction of justice.",
            "score": 46,
            "author": "ithinkimparanoid84",
            "replies": [
                {
                    "level": 1,
                    "comment": "Max 10 years negotiated down to 2 years served 3 months of house arrest then comes out saying they couldn’t find shit so 3 months of witch hunt by Biden Justice Department … profit!",
                    "score": -2,
                    "author": "OHMG69420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Somebody told him Target is woke, he won't read it.",
            "score": 20,
            "author": "Corndog_bouquet"
        },
        {
            "level": 0,
            "comment": "Oh good! Maybe he can hide THAT and claim he never got it.",
            "score": 9,
            "author": "crashomon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol Best comment",
                    "score": 2,
                    "author": "Joeuxmardigras"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, I can not wait to see justice served.  The way Trump has behaved with impunity makes me a cynic. Please let it me be surprised.",
            "score": 8,
            "author": "Elijandou"
        },
        {
            "level": 0,
            "comment": "Here’s a thought provoking question for you guys. Let’s say Trump has damning info on 10 Republican Senators. The worst ones. And it’s straight to prison type shit…. Let’s throw in DeSantis to sweeten the deal. \n\nDo you give Trump immunity to take down 11 of them? Do we fry Trump because holy shit he deserves it and it would feel good to see him in prison?\n\nI don’t know what I’d want.",
            "score": 7,
            "author": "ApatheticWithoutTheA",
            "replies": [
                {
                    "level": 1,
                    "comment": "The great thing about Trump is he so spiteful, turn down the deal he will still rat out those senators",
                    "score": 16,
                    "author": "CodenameZoya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s honestly true. He will have expected them to save him somehow even if it’s impossible and throw them right in prison with him lol.\n\nThinking about Matt Gaetz and Trump sharing a cell in federal prison is some funny shit now that I think about it. I’d watch that sitcom.",
                            "score": 7,
                            "author": "ApatheticWithoutTheA",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You offer a deal to Trump on the charges that he has offered information on. The 11 GOP senators go to prison. Trump is cleared of those charges.\n\nYou then charge Trump with the other federal charges you had in your back pocket and he goal to jail. \n\nYou turn cut to Don Jr, weeping softly to the cameras and muttering about how it’s great to own the Libs .\n\nThe end.",
                    "score": 11,
                    "author": "Robw_1973",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good answer. I like it.",
                            "score": 4,
                            "author": "ApatheticWithoutTheA"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\" Big, beautiful letter! Oh wait..\"",
            "score": 27,
            "author": "kestrel1000c"
        },
        {
            "level": 0,
            "comment": "Do people under criminal investigation normally get letters telling them about it?",
            "score": 6,
            "author": "try_to_be_nice_ok",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, getting a 'target letter' is normal, unless you're getting arrested in a sting operation. It's basically just a 'heads up' that you're getting indicted, since the actual indictment is going to follow the target letter very shortly. You become a 'target' only once the prosecutors have decided to indict you - before that, you're only a 'subject' of an investigation.",
                    "score": 17,
                    "author": "TheOrqwithVagrant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks!",
                            "score": 4,
                            "author": "try_to_be_nice_ok"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"You can't indict me, I'm leading in the polls!\"",
            "score": 6,
            "author": "canuck47"
        },
        {
            "level": 0,
            "comment": "Can someone explain the benefit (to the prosecution) of informing someone they are a target?",
            "score": 36,
            "author": "lcmillz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know there’s a benefit to the DOJ except that it can often jar the target into cooperation.  It’s more a courtesy.  Going from a “subject” to a “target” is significant.  In essence they’re saying, “We’re coming for you.”",
                    "score": 63,
                    "author": "RegattaJoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That makes sense. I’m still unclear about why someone who is about to be charged with a crime deserves any acts of “courtesy”. Am I missing something?",
                            "score": 23,
                            "author": "lcmillz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would guess that from that point onward, the prosecutors are trying to be careful to avoid any appearance that the suspect has been denied a fair chance to defend himself; not because they like the guy, but to ensure that nothing gets overturned on appeal.",
                                    "score": 54,
                                    "author": "tamsui_tosspot"
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s just DOJ practice.  I don’t know if it’s done in every case but it’s not uncommon",
                                    "score": 17,
                                    "author": "RegattaJoe"
                                },
                                {
                                    "level": 3,
                                    "comment": "So that later on, there cannot be a series of appeals that question his right to due process. If they can point to common processes unexplainably not afforded to their client, it can tie up precious time being presented to a judge. Just dot the customary Is and cross the customary Ts so there is less things to appeal on in the future.",
                                    "score": 13,
                                    "author": "ChrysMYO"
                                },
                                {
                                    "level": 3,
                                    "comment": "You tend to receive a lighter sentence when you choose to cooperate.",
                                    "score": 9,
                                    "author": "CupcakesAreTasty"
                                },
                                {
                                    "level": 3,
                                    "comment": "Being charged doesn't mean you are guilty.  And everyone deserves to be treated like a human being.",
                                    "score": 2,
                                    "author": "JohnOliverismysexgod"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's to cover their ass later. The target now knows that they are a target and can choose to testify before the grand jury. Trump won't be able to argue later that he had no idea he was the target of an investigation and had no chance to set the record straight before the indictment. Prosecutors usually wait until the last minute to do this. If Trump got a letter, the indictment is likely going to happen soon. Possibly as soon as tomorrow.",
                    "score": 79,
                    "author": "starmartyr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crossing all those T’s and dotting all those… lower case j’s…",
                            "score": 23,
                            "author": "Sinestro1982",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aka due diligence 😊",
                                    "score": 4,
                                    "author": "jessie-farsi"
                                },
                                {
                                    "level": 3,
                                    "comment": "Are you wearing Brute?",
                                    "score": 5,
                                    "author": "stenmarkv"
                                },
                                {
                                    "level": 3,
                                    "comment": "crossing the Ts and wiping those rumps.",
                                    "score": 3,
                                    "author": "marcol-copperpot"
                                },
                                {
                                    "level": 3,
                                    "comment": "go get 'em, Jack!",
                                    "score": 2,
                                    "author": "Plow_King"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for this. Makes perfect sense now.",
                            "score": 9,
                            "author": "lcmillz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it's so the target of the letter will start working with their attorney to talk over a plea deal would look like.",
                    "score": 9,
                    "author": "wookiee42"
                },
                {
                    "level": 1,
                    "comment": "1) It tells the target that they better not try to destroy materials that could be used as evidence or obstruct investigations at this point, and 2) it gives them an invitation to come address the grand jury and give their version of events before a GJ votes on indictments.",
                    "score": 2,
                    "author": "gerbilsbite"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remember that scene in Lion King when the hyenas kept getting the shivers when he would say Mufasa? That's me with Jack Smith.",
            "score": 21,
            "author": "voting-jasmine",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Oooh... Say it again!*",
                    "score": 9,
                    "author": "I_Am_The_Mole"
                },
                {
                    "level": 1,
                    "comment": "\"Blucher!\"\n\n*&lt;crazed neighing&gt;*",
                    "score": 2,
                    "author": "money_for_nuttin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The part that I find hysterical and infuriating is that Trump brought all of this on himself. The Feds asked for the documents back. If he just gave them back this would have been a non story. Unless he had already sold State secrets to a foreign government. Then he was screwed anyway.",
            "score": 13,
            "author": "hwgl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which could explain why Jared got $2b from the Saudis.",
                    "score": 19,
                    "author": "Four4106"
                },
                {
                    "level": 1,
                    "comment": "He’s brought everything on himself. It’s never just been a blind fishing expedition with Trump. He repeatedly shit his own bed.",
                    "score": 10,
                    "author": "originalityescapesme"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He can read letters just fine. It's words he struggles with.",
            "score": 3,
            "author": "Ankhros",
            "replies": [
                {
                    "level": 1,
                    "comment": "person, man, woman, camera, tv.",
                    "score": 7,
                    "author": "Plow_King",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those weren't even the right words from the test.",
                            "score": 1,
                            "author": "Ankhros"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The disgusting thing is seeing these articles, and then seeing articles about him running for president again and his campaign. The fact that both can happen at the same time is all kinds of fucked up.",
            "score": 4,
            "author": "tcoh1s"
        },
        {
            "level": 0,
            "comment": "I'm sure we'll soon find many of the same people from his inner circle who will publicly call this a political witchhunt have also given testimony admitting they repeatedly told Trump he was committing crimes and practically begged him to change course.",
            "score": 3,
            "author": "davewashere"
        },
        {
            "level": 0,
            "comment": "Don’t take that, Donald! Destroy the Republican Party!",
            "score": 3,
            "author": "The_Notorious_Donut"
        },
        {
            "level": 0,
            "comment": "I wish I was rich so I could commit crimes and just get a letter in the mail.",
            "score": 3,
            "author": "9_of_wands"
        },
        {
            "level": 0,
            "comment": "Paywall",
            "score": 7,
            "author": "SeattleDrew"
        },
        {
            "level": 0,
            "comment": "So, why aren't they even mentioning this on, for example, Good Morning America?",
            "score": 2,
            "author": "climatelurker"
        },
        {
            "level": 0,
            "comment": "Christmas in July!? 🙏🙏🙏🙏🙏🙏🙏",
            "score": 2,
            "author": "W_MarkFelt"
        },
        {
            "level": 0,
            "comment": "Target credit cards find everyone",
            "score": 2,
            "author": "accidentalhousing"
        },
        {
            "level": 0,
            "comment": "Visit to Target.com\n\nGreat housewares, food and more",
            "score": 3,
            "author": "Aleashed"
        },
        {
            "level": 0,
            "comment": "go get 'em, Jack!",
            "score": 2,
            "author": "Plow_King"
        },
        {
            "level": 0,
            "comment": " Mueller 2.0 until proved otherwise.",
            "score": 0,
            "author": "psufan5"
        },
        {
            "level": 0,
            "comment": "Wake me up when nothing happens again",
            "score": -45,
            "author": "ShenanedAgain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t believe any sitting or former president has ever gotten a letter of that magnitude.  Trump will probably make an NFT out of it to keep the grift going, but the historical significance is unprecedented.",
                    "score": 49,
                    "author": "TakingSorryUsername",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no sitting or former president has been indicted on criminal charges. twice impeached, one term, former president trump already has in NY.",
                            "score": 6,
                            "author": "Plow_King"
                        },
                        {
                            "level": 2,
                            "comment": "This is number two??",
                            "score": 3,
                            "author": "masterhogbographer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who does number two work for?",
                                    "score": 11,
                                    "author": "TakingSorryUsername"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t know how you can see what’s happening now and still hold that attitude. Smith is clearly charging him.",
                    "score": 39,
                    "author": "Larry-fine-wine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a huge gap between that and Trump seeing justice which unfortunately I doubt will be bridged.",
                            "score": -6,
                            "author": "InterPunct",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;There's a huge gap between that and Trump seeing justice which unfortunately I doubt will be bridged.\n\nYou can move the goal posts if you wish, however, the federal government coming even remotely close to holding a former president accountable for anything is a big fucking deal. This will still be history book material next century leaving Watergate as a footnote.",
                                    "score": 22,
                                    "author": "Grandpa_No"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To me, this is all just performance art. The people and organizations with the REAL money and power are keeping us tethered to the Trump drama to distract us from the fact that the real perpetrators of the destruction of America are at a pay scale way ABOVE Trump's level. \n\nI am willing to bet that Trump has been 'groomed' to be the whipping boy with a promise that he will never do actual jail time if he just distracts the nation from the Elon Musks and Jeff Bezos's of the world...\n\nYou know, people who, if we actually taxed them, would cause our economy to turn into a Utopia.",
            "score": -9,
            "author": "exiledfromreality",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m for raising some rich people taxes, but let’s cool it with the unfounded conspiracies. That’s for Trump’s people.",
                    "score": 6,
                    "author": "webs2slow4me"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ignorantia juris non excusat",
            "score": 0,
            "author": "comebacktome23",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How come, his ex-lawyer on tv last night was saying- the papers found in his personal desk were only copies of the documents; therefore they were not the original documents and there is the loop hole ?? So a copy of Top Secret papers aren’t Top Secret papers??",
                            "score": 2,
                            "author": "Educational-Run7247",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Speaking to his followers, to give them an out.",
                                    "score": 2,
                                    "author": "JohnOliverismysexgod"
                                },
                                {
                                    "level": 3,
                                    "comment": "Haha 😂",
                                    "score": 1,
                                    "author": "webs2slow4me"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe backstabbing comes in threes? These backstabbings have to be easy af after Jay Monahan cucked to the Saudis.",
            "score": 1,
            "author": "ubzrvnT"
        }
    ]
}