{
    "id": "144bh9w",
    "score": 2080,
    "title": "Supreme Court Rejects Voting Map That Diluted Black Voters’ Power",
    "author": "TheCee",
    "date": 1686236162.0,
    "url": "https://www.reddit.com/r/politics/comments/144bh9w",
    "media_urls": [
        "https://www.nytimes.com/2023/06/08/us/supreme-court-voting-rights-act-alabama.html?unlocked_article_code=2wvGbLgWRhXiBi88f84dn91TR9-Lm5ojgcbDxkd2PYG_d2YHOGQC0DTFwMzLiZbtiyoYs7ch1AVTzQPiStLRfNugmaiCM7oYogP2cYay6Y1r1mDTaj1KhKnlNr0EO0eTsJvC5ZXV_e_FR1MEmeZdyzLd6ZlJ0jV4E1GEeIdgQPWhJdY4SL-1IPo_Buli1p8dAmRHnCAgJboqeXCNLGIheS3fg8BnGImWyfpw9PpsNESY77-IGFH_XS8tMEVRNNk1e4NaXTjUwg-zMjwq6ABNFo_NOy4n3L4GtAxrRveY71mDJzCFaTzKwWxxGJUUy0R3YGuPmatjhEdWxgdrPSp7LDjlVryOZwh-sreSpQ&amp;smid=nytcore-ios-share&amp;referringSource=articleShare"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Don’t forget, last year a majority trump appointed district federal court ordered Alabama to redraw the map. That’s how bad it was. It was the Supreme Court that swooped in with a 5-4 decision to stay that order, keeping the racially discriminatory map for the 2022 election.\n\nI guess Brett Kavanaugh still has some shame and Robert’s convinced him to flip back now. Although he gets very little credit for doing so now *after* the 2022 election. \n\n[Here’s a great podcast episode](https://www.fivefourpod.com/episodes/merrill-v-milligan/) reviewing the earlier opinion of the district court. It was such a blatant violation of the Voting Rights Act that the two Trump appointed judges on the 3 panel court agreed that Alabama should redraw it.",
            "score": 64,
            "author": "andresmdn",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I guess Brett Kavanaugh still has some shame and Robert’s convinced him to flip back now.\n\nGiven Roberts' hard on for rolling back voting rights, I wouldn't be surprised if he had to be convinced by the liberals and/or Kavanaugh.",
                    "score": 20,
                    "author": "WarWolf343"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wing so the Republicans from using the map anyway. Ohio used a court rejected blatantly illegal map in the last election",
            "score": 85,
            "author": "FontOfInfo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rejected 4 times with a conservative agreeing they were illegal. They just ran out the clock and waited for that justice to retire and now they are trying to make it harder to amend the state constitution.",
                    "score": 78,
                    "author": "castle_grapeskull",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course, why should representatives need to get permission or direction from the people on stuff like voting or abortion. Just let your betters decide for you /s.",
                            "score": 3,
                            "author": "Few-Bug-807"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Florida did the same thing.\n\nI think Wisconsin tried to ungerrymander their state and the SCOTUS shot that attempt down.",
                    "score": 26,
                    "author": "Rawkapotamus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SCOTUS handed the WI case back down to the state, essentially, which at the time had a conservative majority on our Supreme Court; however, with our new progressive majority I anticipate that WI will end up with new and fairer maps.",
                            "score": 28,
                            "author": "AlbatrossFrequent173"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Of course ol' boy Clarence didn't find anything wrong with the map 🙄 Good boy Clarence, your handlers are proud of your continued support/protection of discriminatory election maps that dilute the black vote...🥴",
            "score": 76,
            "author": "Narrow_Competition41",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you mean Clarence as in Clarence Thomas, the slimeball who had his nephew’s tuition and superyacht vacations paid for by GOP mega donors and is now postponing his disclosure statements Clarence Thomas?",
                    "score": 30,
                    "author": "bethtadeath",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, that'd be the Clarence i speak of. I have never seen so much questionable conduct swirling around a SCOTUS justice in my +50yrs of breathing air on this planet... seems that m'fers corrupt asf!!! 🤬",
                            "score": 16,
                            "author": "Narrow_Competition41"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The damage had already been done. They’re not going to redo any elections that have happened with the benefit of gerrymandering. They blocked the lower court until they could get results.",
            "score": 18,
            "author": "ventodivino",
            "replies": [
                {
                    "level": 1,
                    "comment": "yep. I'm sitting here in Ohio, which literally has illegal voting districts...and an illegal special election coming up",
                    "score": 8,
                    "author": "P1xelHunter78"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is good but I reckon Alabama will drag their ass with this and say they don't have time to draw a fair map, have an election with said illegal maps and then find some legality to appeal on for the next election. \n\nYou draw a map that's illegal, you shouldn't be allowed to participate in the next election",
            "score": 13,
            "author": "rounder55"
        },
        {
            "level": 0,
            "comment": "I think they're feeling the heat",
            "score": 8,
            "author": "vamonosgringos"
        },
        {
            "level": 0,
            "comment": "&gt; The ruling drew a sharp rebuke from Justice Clarence Thomas, who wrote that the question is whether the Voting Rights Act “requires the State of Alabama to intentionally redraw its longstanding congressional districts so that black voters can control a number of seats roughly proportional to the black share of the State’s population.”\n\n&gt; The law, he said, “demands no such thing, and, if it did, **the Constitution would not permit it.**”\n\nI guess Section 2 of the Fifteenth Amendment no longer exists, same with [Article I, Section 4, Clause 1](https://en.wikipedia.org/wiki/Article_One_of_the_United_States_Constitution#Clause_1:_Time,_place,_and_manner_of_holding_elections).  \n\nThis is truly shocking, I thought for sure they would gut Section 2 even further.",
            "score": 7,
            "author": "WarWolf343"
        },
        {
            "level": 0,
            "comment": "It's a shame we'll have to praise them for voting the way they should have and not by party Allegiance or beliefs",
            "score": 8,
            "author": "dmanjrxx"
        },
        {
            "level": 0,
            "comment": "WAPO: Supreme Court: Alabama must draw new voting map favorable to black residents.\n\nThey make it sound like blacks are getting a favor FFS.",
            "score": 5,
            "author": "Zealousideal_Word770",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently \"must draw fair voting map\" wasn't good enough. Nice subtle racism.",
                    "score": 8,
                    "author": "dainthomas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "5 to 4 ruling. Very easily could've gone the other way unfortunately..",
            "score": 26,
            "author": "Gillemonger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Take the win in a 6-3 court",
                    "score": 38,
                    "author": "NANUNATION",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right! Bet that guys a lot of fun at parties... 🥴",
                            "score": 2,
                            "author": "Narrow_Competition41"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But it didn't.",
                    "score": 3,
                    "author": "Traherne"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very surprising that Roberts both joined and wrote for the majority, given his open hostility to the VRA in the past",
            "score": 5,
            "author": "Chi-Guy86",
            "replies": [
                {
                    "level": 1,
                    "comment": "Court watchers were fully expecting another attack on the VRA, so this is a (pleasant) surprise. I mean, I'll take the W, but we shouldn't even be here (contesting a patently racist map in the year 2023) in the first place....",
                    "score": 3,
                    "author": "Narrow_Competition41"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is just throwing a bone to the democratics so they don’t expand the court.",
            "score": 3,
            "author": "NeverStopLifting"
        },
        {
            "level": 0,
            "comment": "“Look what we did for you, democrats! Please don’t look at our corruption now kthnx”",
            "score": 2,
            "author": "everybodytotheIimit"
        },
        {
            "level": 0,
            "comment": "but ruled against the KS maps that split the 1 county in KS with a large minority population into 2 districts?",
            "score": 2,
            "author": "pattymelt9"
        },
        {
            "level": 0,
            "comment": "This is make up call…they know they lost legitimacy.",
            "score": 2,
            "author": "PDXalreadtused"
        },
        {
            "level": 0,
            "comment": "Great. Now do Florida, North Carolina, Alabama, and Georgia. \n\nDeSantis gerrymandered away two congressional districts held by Black democrats *before* the midterm elections. Democrats were down two house seats before any votes were cast or counted.\n\nSauce: https://www.propublica.org/article/ron-desantis-florida-redistricting-map-scheme",
            "score": 2,
            "author": "JosephWelcher"
        },
        {
            "level": 0,
            "comment": "Yay for not being totally corrupt",
            "score": 1,
            "author": "Weary-Okra-2471",
            "replies": [
                {
                    "level": 1,
                    "comment": "A broken clock is right twice a day.",
                    "score": 2,
                    "author": "Daynebutter"
                },
                {
                    "level": 1,
                    "comment": "No, they are still totally corrupt, they just have to show some since because they know their legitimacy is up in question. \n\nWhen the vote *really counts* and can do the most damage is when they will disappoint. \n\nNone of those judges are too big to fit in a Pocket.",
                    "score": 1,
                    "author": "GandizzleTheGrizzle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Barely",
            "score": 1,
            "author": "astro80"
        },
        {
            "level": 0,
            "comment": "I’m shocked this court did the right thing.  Which is something one should never have to say about a “court.”",
            "score": 1,
            "author": "Formerlurker617"
        },
        {
            "level": 0,
            "comment": "But will they reject a map that Dilutes Democrats votes",
            "score": 1,
            "author": "Big-D-TX"
        },
        {
            "level": 0,
            "comment": "Reminds me of the gerrymandering by NY Democrats that the court also shot down.\n\n[https://www.npr.org/2022/04/27/1095100208/new-york-redistricting-rejected](https://www.npr.org/2022/04/27/1095100208/new-york-redistricting-rejected)",
            "score": 0,
            "author": "SpecialNotice3151"
        }
    ]
}