{
    "id": "144dulq",
    "score": 180,
    "title": "Supply Chain Woes Spur GOP Push to Cut Amtrak’s Track Rights | Amtrak’s passenger trains would no longer be given priority over freight trains on certain railroads under legislation being introduced",
    "author": "bloomberggovernment",
    "date": 1686241669.0,
    "url": "https://www.reddit.com/r/politics/comments/144dulq",
    "media_urls": [
        "https://about.bgov.com/news/supply-chain-woes-spur-gop-push-to-cut-amtraks-track-rights/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Zero chance that Joe \"Amtrak Joe\" Biden does not veto this on sight.",
            "score": 38,
            "author": "OkVermicelli2557",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope so because fuck this shit.",
                    "score": 19,
                    "author": "SoundHole"
                },
                {
                    "level": 1,
                    "comment": "It won't even make it to his desk.",
                    "score": 3,
                    "author": "dedicated-pedestrian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my region, the capital corridor Amtrak route is popular and used by commuters. Thank you for highlighting this",
            "score": 22,
            "author": "boxer_dogs_dance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for reading. We love sharing our reporting with the Reddit community!",
                    "score": 8,
                    "author": "bloomberggovernment"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Or, build more rail?",
            "score": 22,
            "author": "ARandomWalkInSpace",
            "replies": [
                {
                    "level": 1,
                    "comment": "But that would create jobs under Biden. Can’t be having that",
                    "score": 3,
                    "author": "Tigerboop"
                },
                {
                    "level": 1,
                    "comment": "What is this infrastructure improvement you speak of?  Why ever would we need functioning freight and passenger rail systems?  Politicians have better things to do with their time, like making enemies of \"others\" and banning books.",
                    "score": 3,
                    "author": "Viperlite"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm confused, the bill doesn't blame \"woke\" or LGBT once. Is this a trick?",
            "score": 19,
            "author": "Corn_Polkadots",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is attacking public transportation. You know. Going green. So this falls under woke.",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're putting the trans back into transportation.",
                            "score": 9,
                            "author": "pushing_past_the_red"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There might be something about deep state hunter bidens woke trans laptop buried in it someplace.",
                    "score": 2,
                    "author": "BringOn25A"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The GOP is a regressive dangerous organization.  They really want more crashes and push people on to ecologically damaging solutions.",
            "score": 39,
            "author": "TintedApostle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Corporations with money are the priority.",
                    "score": 8,
                    "author": "lackdueprocess"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep Biden is one of the biggest supporters of Amtrak this bill will not become law.",
                    "score": 11,
                    "author": "OkVermicelli2557"
                }
            ]
        },
        {
            "level": 0,
            "comment": "GOP: Our billionaire owners don't ride Amtrak so we want to end it.",
            "score": 5,
            "author": "IrishJoe"
        },
        {
            "level": 0,
            "comment": "Biden would veto it , should it reach him.  How about spending some money to improve rail infrastructure in the US?..just a thought.",
            "score": 5,
            "author": "Space_Man_Spiff_2",
            "replies": [
                {
                    "level": 1,
                    "comment": "But if the railroads spent money maintaining their tracks up to the standard they agreed upon when Amtrak was created then that would increase the operating ratio. Won’t someone please think of the poor shareholders?\n\nAmtrak only exists to relieve railroads from an obligation to provide passenger service. In removing that obligation the railroads were supposed to be responsible for maintaining tracks so that Amtrak could move at a high speed and to give Amtrak priority on their tracks.",
                    "score": 2,
                    "author": "sgkorina"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Scoop from reporter Lillianna Byington**:\n\n\"The bill, first obtained by Bloomberg Government, would cut Amtrak’s right of track preference within 50 miles of a port or rail yard. Republicans say the legislation, dubbed the Freights First Act, would help ease supply chain challenges and improve business conditions. Still, the measure would likely frustrate the passenger rail corporation.\n\n'Railway bottlenecks and time delays at critical junctures create empty shelves in stores and higher prices for consumers,' Eric Burlison (R-Mo.), the bill’s sponsor and a member of the House Transportation and Infrastructure Committee, said. 'We should find ways to cut red tape to benefit our supply chain instead of providing special treatment to poor stewards of the people’s money like Amtrak.'\n\nDemocrats, on the other hand, pushed for legislation in the last Congress that would have given Amtrak the ability to enforce its preference rights over freight railroads in court.\"\n\n[Read more here](https://about.bgov.com/news/supply-chain-woes-spur-gop-push-to-cut-amtraks-track-rights?utm_source=reddit.com&amp;utm_medium=bgov)**.**\n\n\\[edited for formatting\\]",
            "score": 11,
            "author": "bloomberggovernment",
            "replies": [
                {
                    "level": 1,
                    "comment": "One thing is for sure. Amtrak is not blocking access to ports or large freight yards. That’s the railroads own doing of cutting capacity to bare bones to save on property taxes.",
                    "score": 12,
                    "author": "saxmanb767",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sure a large part of it is the huge trains the railroads are running now. Most yards and sidings weren’t built to handle trains as large as they’re running now. Making room to let Amtrak pass is difficult when you don’t have anywhere long enough to hold the train off the main line so freight trains get delayed because they have to let Amtrak go by. I don’t know how many hours I sat waiting around for my train to be able to leave the yard because Amtrak was coming our way and there was no place between us and Amtrak big enough to hold our train so Amtrak could pass.",
                            "score": 2,
                            "author": "sgkorina"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And they want people to return to the office lol",
                    "score": 1,
                    "author": "Tigerboop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These GOP people keep it up they will be riding the rails as my grandma used to tell me when I did wrong.",
            "score": 3,
            "author": "Antelope-Subject"
        },
        {
            "level": 0,
            "comment": "It's like Republicans want to touch every single thing in America and make it worse. Dumb as hell to delay Amtrak trains even more",
            "score": 4,
            "author": "usctrojan18"
        },
        {
            "level": 0,
            "comment": "It’s not like they follow the rules now anyways. I’ve been on plenty of Amtrak rides in the Midwest where we stop in the middle of nowhere to let the more important Bakken oil cars go by. \n\nThis is going in the wrong direction. We need to step up enforcement, not screw over Amtrak even more. Rail companies were ~~given these lines~~ were allowed to cease their own passenger service on the condition of allowing Amtrak right of way. If they don’t like it, they are free to return the lines entirely.",
            "score": 4,
            "author": "phoenix1984",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t believe railroads were given tracks. They were already privately owned. The creation of Amtrak relieved the railroads from their obligation to operate passenger service which was less profitable than freight.",
                    "score": 3,
                    "author": "sgkorina",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, thanks. I’ve been reading up to clarify my fuzzy memory of railroad history. My original statement is mostly incorrect. Many lines acquired some of their land through imminent domain, but yeah, most lines were privately built and run.",
                            "score": 1,
                            "author": "phoenix1984"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd assume some of that is because the freight companies are now running trains so long they won't fit into sidings to let other trains pass. So if there's only a single track they literally *can't* give passenger trains, which do still fit in sidings, priority.",
                    "score": 2,
                    "author": "Himerance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Republicans are just salty they can't tie poor people to railroad tracks like Snidely Whiplash.",
            "score": 3,
            "author": "e_t_"
        },
        {
            "level": 0,
            "comment": "So they want citizens to crash with hazardous chemicals instead of hazardous chemicals crashing into hazardous chemicals?",
            "score": 2,
            "author": "HeyItsMacho"
        },
        {
            "level": 0,
            "comment": "We need more passenger and freight rail, not less. \n\nWe never should have cast aside rail in favor of using truck and cars for every transportation need to begin with. Such an unnecessary contribution to climate change.",
            "score": 1,
            "author": "Blu_Skies_In_My_Head"
        },
        {
            "level": 0,
            "comment": "The biggest problem with Amtrak is that already freight rail doesn't adhere to the passenger priority rule, illegally",
            "score": 1,
            "author": "Unfair-Thought5814"
        },
        {
            "level": 0,
            "comment": "No it’s more like, the freight carriers have a huge manpower issue caused by their own greed and shortsightedness and would prefer having track rights so they don’t have to recrew trains as much that are held up by passenger lines.",
            "score": 1,
            "author": "cokethesodacan"
        },
        {
            "level": 0,
            "comment": "I find this interesting. In Canada, most freight trains have priority over passenger trains. But we really only have one main line across the country and it would be difficult to try to give VIA passenger trains priority. \n\nThe CP100 and 101 run across the country daily and much of the NA economy relies on those trains arriving on time (think stuff like JIT auto manufacturing). So they receive priority over all other trains and never slow down outside of safety considerations. But cross-country VIA trains can be over a day late sometimes and I’ve been on trains between Ottawa and Toronto with delays of like 25-30%. \n\nI didn’t realize that Amtrak had special priority. I know that it would be a blow to passenger service to take that away, but that’s just a practical consideration we made here a long time ago. I wonder if some compromise could be reached.",
            "score": -2,
            "author": "NegativeAd1432",
            "replies": [
                {
                    "level": 1,
                    "comment": "No.  Amtrak is still recovering from the last time the freight lines were allowed to slide on scheduling priority.",
                    "score": 5,
                    "author": "StarInTheMoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not at all saying they should! Compromise in that sense would look like building more rails or something. In the American railways, both sides have legitimate claim to need priority.\nIn Canada, local commuter trains don’t use freight lines. Our situation is very different, so our solution is as well.",
                            "score": 1,
                            "author": "NegativeAd1432",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In the US freight has no legitimate claim to priority. Amtrak was created to relieve railroads from their legal obligation to operate passenger trains which were less profitable than freight. In exchange for taking the responsibility of passenger trains from the railroads they agreed that Amtrak would be given priority.",
                                    "score": 2,
                                    "author": "sgkorina"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "On the East Coast and the West Coast, certain Amtrak lines are used by commuters getting to work. Delaying them would be a hardship.\n\nThe Cross country train might be less urgent to be on time but it still sucks for the passenger",
                    "score": 1,
                    "author": "boxer_dogs_dance"
                },
                {
                    "level": 1,
                    "comment": "It's worth noting that in the US, the railroads gave this right to Amtral to free themselves from the obligation of running their own passenget trains, so there was a benefit to them.",
                    "score": 1,
                    "author": "fatnoah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, I recognize that, having looked into the situation after reading the article. I feel like everybody thinks I’m saying that Amtrak should just bow down, which I don’t think is that case at all. \n\nWhen I mention compromise, I’m thinking of the railroads building more siding and bypass infrastructure to meet with the demand on the rail lines. Or some other solution I’m not equipped to think about. \n\nAmtrak has, and deserves their priority on the lines. There is also an economic interest in ensuring that freight is delivered on time.\n\nCanada couldn’t give priority to passengers any more than US should give priority to freight. The NA car industry especially relies on the fact that we can send a train across the country in 4 days and do so every day, on schedule 99% of the time. The American side relies on these trains as well, because that could obviously not happen using American lines.\n\nAs the rail lines get more congested with both freight and passengers, there will be an economic cost. The economy shouldn’t take priority above people’s lives, but in another 10 or 20 years, it could become a real issue.\n\nAnd so I wonder if there may be solutions beyond “Me first!” That is all. I doubt there are any easy solutions to the problem, but like to think it’s worth considering.",
                            "score": 1,
                            "author": "NegativeAd1432",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I’m thinking of the railroads building more siding and bypass infrastructure to meet with the demand on the rail lines.\n\nThis is absolutely what is needed, and I expect that the nature of how RR land is taxed in some (many?) states contributes to the lack of siding infrastructure. i.e. Land with usable sidings is taxed more than land without.\n\nRegardless, much of the brittleness results from the shift towards fewer high-capacity lines  and staffing/infra choices that mean there's little ability to adjust or pick up slack.",
                                    "score": 2,
                                    "author": "fatnoah"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}