{
    "id": "144ie6e",
    "score": 1203,
    "title": "Rural Voters Want Economic Answers From Democrats They Gave Up On",
    "author": "bloomberg",
    "date": 1686252129.0,
    "url": "https://www.bloomberg.com/news/features/2023-06-08/democrats-winning-rural-voters-in-2024-depends-on-economy-inflation-jobs-plans",
    "media_url": "https://www.bloomberg.com/news/features/2023-06-08/democrats-winning-rural-voters-in-2024-depends-on-economy-inflation-jobs-plans",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1295,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. I like to bring up when I tried to get politically active back in 2019 in my rural conservative town prior to moving. \n\nOur town had nothing but conservatives in charge for over 40 years. Well before I even was born. I spoke up at a town hall when people were bitching about the town economy going to hell, asking them how they can blame the Democrats when they've had the same politicians and political parties in charge for their entire lives and we had only 2 Democrats on our town board with 11 Republicans. They would blame everything on the 2 Democrats, both officially and by the populace. Taxes went up? It wasn't the 11 Republicans at fault, it was the Democrats. Uptick in local crime, Obama. \n\nI'm pretty sure those people would have burnt me at the stake for speaking up that they were wrong and misguided. One of the board members even doxxed me and I started having MAGA dudes show up at my job  threatening to kill me because I was a trans \"liberal.\"",
                    "score": 630,
                    "author": "Good-Expression-4433",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 402,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And yet a lot of conservatives I've met are very cynical about government. You'd think they'd be the first ones to vote the bastards out.",
                                    "score": 144,
                                    "author": "arensb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;You'd think they'd be the first ones to vote the bastards out.\n\nthey haven't been instructed to yet.",
                                            "score": 132,
                                            "author": "desubot1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "when your whole plan of action once elected is to prove that government can't work it's a never ending project.",
                                                    "score": 50,
                                                    "author": "bubblesound_modular"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Republicans are the party that runs on a platform that states the government doesn't work. And then once elected do everything in their power to prove themselves right.",
                                            "score": 62,
                                            "author": "dameon5"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "they hate the same people, that's more important to them",
                                            "score": 29,
                                            "author": "UrbanArcologist"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They are cynical about the government because that's what the right wing media has told them to be.  It is always that the government is trying to take power from them and screw them over...and that's why they need to elect Republicans to protect them from the evil government!\n\nIt makes no damn sense, but I can tell you as someone who was indoctrinated from birth into conservatism...it works.  It wasn't until I got out of my parents' sphere of influence and started researching things on my own that I figured it out.\n\nBeing heavily computer and internet savvy helped me a great deal to escape that indoctrination.  But most people who are hardline conservative don't become computer geeks.  They follow in their parents' footsteps.  My dad tried to get me to do that and follow him into the oil and gas industry.\n\nIf I had done so, I'd probably still be one of the delusional conservative followers.",
                                            "score": 6,
                                            "author": "Rhysati",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The robber baron class doesn’t like government due to the pesky employment and environmental laws. They like government because they build the roads, airports and other infrastructure that they use either freely or cheaply. Mass media is part of the robber baron class so they shape the narrative to suit their minders. This is a classic case of having your cake and eating it too because government is bad because it is and bad when the infrastructure starts crumbling because an under funded government can’t maintain it.",
                                                    "score": 2,
                                                    "author": "needsmoresteel"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;And yet a lot of conservatives I've met are very cynical about government. You'd think they'd be the first ones to vote the bastards out.\n\nIn their mind, if government could help them, voting Republican would have solved their problems, if voting Republican didn't solve their problems it's only because government can't help them",
                                            "score": 3,
                                            "author": "winespring"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not just the messenger, they shoot the people who are willing to help and vote for people who are causing their problems.",
                                    "score": 15,
                                    "author": "trisul-108"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's easier to con a person than to convince them they've been conned.",
                                    "score": 35,
                                    "author": "Randomousity"
                                },
                                {
                                    "level": 3,
                                    "comment": "Fear of embarrassment is a powerful.",
                                    "score": 11,
                                    "author": "metsjets86"
                                },
                                {
                                    "level": 3,
                                    "comment": "You need to give ‘em an off ramp like BIden just did with McCarthy and the debt ceiling.",
                                    "score": 3,
                                    "author": "uncle_jafar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah, they BEEN given off ramps for years. They just love driving on I-Racist.",
                                            "score": 11,
                                            "author": "sportjames23"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 54,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No hate like Christian love.",
                                    "score": 69,
                                    "author": "kevnmartin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sorry you went thru that, sounds awful.",
                            "score": 25,
                            "author": "tbizzy1985"
                        },
                        {
                            "level": 2,
                            "comment": "If you tell them that those are shadows on the wall and there is another world behind them they will not thank you they will attack you,",
                            "score": 5,
                            "author": "Trygolds"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A Democrat hasn't been elected statewide in Texas since 1990, but all the right wingers in that state will blame the Dems for any issues they have.  It is so 1984-esque.  These people are so goddamn stupid, and there is unfortunately no remedy.",
                    "score": 186,
                    "author": "Rated_PG-Squirteen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The remedy for stupidity is education. Why do you think right wingers are so against public education?",
                            "score": 40,
                            "author": "Thatbastard0",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Whats crazy about this to me is that people have been saying since Obama that Texas is going to turn blue. I'm not denying its possible but Ted Cruz is coasting by in elections. Abbott was elected as the gov. Statewide bright red republicans still win with relative ease most of the time.",
                            "score": 16,
                            "author": "Stennick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Texas is way more liberal than the vote counts would have you believe.\n\nIt is very difficult to properly register to vote and stay registered. By design, it is voter suppression. If 100% of the eligible populous voted, I'd estimate it would be 65/35 dems.",
                                    "score": 24,
                                    "author": "FirstAmendAnon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Liberal or not when there is talk of it going blue that's what needs to happen I see no evidence it's more liberal large populations in that state are card carrying MAGA",
                                            "score": 5,
                                            "author": "Stennick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nearly every large urban county in TX is blue. The valley is blue. That’s where most people in the state live. But the Rs have been carving up the state so badly, it’s even harder to turn the entire state blue.",
                                                    "score": 10,
                                                    "author": "AnastasiaNo70"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As a man once said, you can't fix stupid",
                            "score": 19,
                            "author": "Odd-Confection-6603"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly, the Republicans are fighting Democrats tooth and claw to get money away from the poor rural voters and into hands of billionaires .... and yet these voters still vote Republican while complaining about Democrats. Had they voted for Democrats last election, they would now be in a better position economically and billionaires would have less.",
                    "score": 12,
                    "author": "trisul-108"
                },
                {
                    "level": 1,
                    "comment": "Republicans are really good at messaging (Fox News does the heavy lifting, though). These people actually believe that helpful policies enacted by Democrats (despite opposition by people they voted for) are given to them by Republicans. \n\nThe economic answer they're looking for is that Democrats are trying to help them, but the people they elect are getting in the way. They just won't believe the answer.",
                    "score": 57,
                    "author": "sapientia-maxima",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People say Republicans are better at messaging but I disagree slightly. I think Republicans have a simpler more vague message to communicate. Saying \"no\" to everything and pointing fingers is much easier than explaining an economic policy or an international relationship.",
                            "score": 14,
                            "author": "shortieXV",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Far easier to tear something down than to build something.",
                                    "score": 2,
                                    "author": "havegunwilldownboat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same idiots who thought that that awful Obamacare was going to take away their beloved ACA healthcare.",
                            "score": 32,
                            "author": "Lady_von_Stinkbeaver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I once worked in registration at a hospital and always made sure people knew that the ACA and Obamacare were the same thing. Some people actually refused to get insurance after hearing this. I know at least one woman followed through on that even though she was probably eligible for Medicaid under the expansion. She had to have gone bankrupt.",
                                    "score": 13,
                                    "author": "Magicaljackass",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don’t worry Jesus provides.",
                                            "score": 3,
                                            "author": "AMC_Unlimited"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But it’s not really a level playing field is it? How much is Republicans being better at messaging and how much is corporate media pressing the mute button every time Democrats start talking liberal economics? \n\nAre Republicans actually any better at messaging? Or do they just have more control over the flow of information?",
                            "score": 12,
                            "author": "urk_the_red",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s that hate fits on a bumper sticker. \n\nIt’s ridiculous that we are looking at “Blue Lives Matter” and “Let’s Go Brandon” and calling them messaging geniuses. Anyone could cone up with good Republican messaging if so inclined. \n\nDems don’t want pithy maxims.",
                                    "score": 8,
                                    "author": "DoobieBrotherhood"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Rural white voters are full of shit. They voted for Democrats when the Democrats were the part of economic populism and racism. Now the Republicans are the party of billionaires and racists, and their voting for Republicans.\n\nWhat is the common denominator here?",
                    "score": 7,
                    "author": "gordo65"
                },
                {
                    "level": 1,
                    "comment": "They want more socialism.  More farming aid money,  subsidized broadband, bail out the rural hospitals.",
                    "score": 7,
                    "author": "adrr",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yes red state republicans will always blame democrats for how shit things are in their state despite the gop driving the state policy that more directly impacts their lives. Remember Republican governors turning down the Medicare expansion funding from the fed? That would have helped a lot of their constituents. Can’t have their lives getting better though.",
                    "score": 25,
                    "author": "Phallic-Monolith"
                },
                {
                    "level": 1,
                    "comment": "&gt;So the rural voters that elected republicans are blaming the democrats that don't control their state governments for the results of the policies that the republicans they elected put into place, do I have that right?\n\nYes. You have it right. They don't, but you do.",
                    "score": 5,
                    "author": "PM_ME_JAR_JAR_NUDES"
                },
                {
                    "level": 1,
                    "comment": "&gt;So the rural voters that elected republicans are blaming the democrats that don't control their state governments for the results of the policies that the republicans they elected put into place, do I have that right?\n\nLeft-wing Texans have been saying this refrain for... Well, my whole life at least.",
                    "score": 13,
                    "author": "Ok-Inevitable-5698",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. Leftist Texan here.",
                            "score": 5,
                            "author": "AnastasiaNo70"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's like that time when my dentist said I needed a root canal, but I didn't want that, so I took a homeopathic pill instead, and when my toothache didn't go away, I sued the dentist.",
                    "score": 16,
                    "author": "arensb"
                },
                {
                    "level": 1,
                    "comment": "So basically admitting that they expect democrats to clean up their fuckups.",
                    "score": 4,
                    "author": "AMC_Unlimited",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Seriously.",
                    "score": 3,
                    "author": "sportjames23"
                },
                {
                    "level": 1,
                    "comment": "They have all the information they need to see through this, even from Fox. They know it’s not true but they choose the tribe not the truth.",
                    "score": 3,
                    "author": "dinosaurkiller"
                },
                {
                    "level": 1,
                    "comment": "Yep, sounds ~~white~~ right to me.",
                    "score": 23,
                    "author": "PandaMuffin1"
                },
                {
                    "level": 1,
                    "comment": "That's kind of the definition of racism right? - it's an irrational fear of another race.  Basically, the republicans have convinced rural voters to put their irrational fears above their rational self-interest.  \n\nUmm.. what's that line again?  \"The greatest trick the Devil ever pulled was convincing the world he didn’t exist...\"",
                    "score": 7,
                    "author": "Bodhief",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no, that's bigotry. racism is the intersection of bigotry and power.",
                            "score": -4,
                            "author": "bubblesound_modular"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The republicans stoke division and hatred in these areas because they can’t campaign on their actual policies like the TCJA which transfers trillions of dollars of wealth to shareholders, institutional and otherwise. That said, the democrats 100% gave up on these people. It was decades ago at this point, but they were the party that advocated for workers until that platform was abandoned for free trade policy and the slow corporatization and privatization of public institutions. I like to point out according to Fox polls in both 2016 and 2020 Bernie Sanders far outperformed any other democratic candidate among their viewers. Anecdotally, most my family in rural Texas liked Bernie more than Trump in the beginning. They knew Trump was a con artist but voted for him any way to shake things up. If you spend time in these areas it’s pretty obvious to see where the resentment comes from. They pay taxes yet get almost nothing in return in terms of a safety net. Their hospitals, all private now, close due to lack of profitability, their schools can’t afford to keep teachers around, meth is everywhere and there are no serious centers for treatment. The democrats dedicate almost nothing to channel legitimate populist resentment, and because of that, because of greed and cynicism within the upper echelons of the DNC, they’ve handed rural voters over to the republicans, the party with a vivid abject history of ruling class politics, to stoke Christian nationalism, because neither republican or democratic donors have to live in the awful world their policies help create.",
                    "score": 3,
                    "author": "travalavart"
                },
                {
                    "level": 1,
                    "comment": "Um, back up. Democrats and Republicans are BOTH beholden to monied interests and have sold rural and urban America down the river. Infrastructure is decaying everywhere. \n\nIf you think rural folks are to blame by buying the red package, urban voters are just as to blame for buying the blue one. Both packages do not not give a shit about working people at all. Words are not actions. Dens talk a lot, but then they still serve the wealthy through their actions.",
                    "score": -5,
                    "author": "LilyKunning"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let's not forget that the Obama administration threw [millions of dollars at retraining initiatives](https://www.reuters.com/article/us-trump-effect-coal-retraining-insight-idUSKBN1D14G0) throughout Appalachia. \n\nMost seats were empty as they banked on coal coming back under Trump, than learn new skills for good pay and jobs.\n\nMany would rather live in poverty and hope Pappy's and Grandpappy's coal jobs come back than let a black man and a Democrat give them something useful.\n\nThey'd rather whine about the evil Dems than change to give themselves a chance to live a decent life. They forsook the Dems, not the other way around.",
            "score": 568,
            "author": "spoobles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugh, I forgot about. Stubborn lazy and delusional. Democrats also wanted to give them paid parental leave, and free universal health insurance w.",
                    "score": 200,
                    "author": "meowmeow_now",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lazy no. So stuck on tradition they can’t see any other way: yes.\n \nThat isn’t laziness. That’s years of fool-hearty “independence” while accepting shit tons of state and federal aid via SNAP and other programs. This is the result of years of isolation. Hell they have their own creole that is as unintelligible to folks from the outside as the creole in Louisiana/Mississippi.\n\nLook at (few) kids that go to college after coming out of a holler. Those kids, 97 times out of 100, become bleeding heart liberals by the end of their second semester.",
                            "score": 102,
                            "author": "Mundane_Edge_8883",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Those kids, 97 times out of 100, become bleeding heart liberals by the end of their second semester.\n\nHence Republicans' intent to revamp colleges and universities. See:\n\n[Ohio Senate passes massive higher education overhaul bill,](https://ohiocapitaljournal.com/2023/05/18/ohio-senate-passes-massive-higher-education-overhaul-bill-house-version-hears-opponent-testimony/)",
                                    "score": 52,
                                    "author": "Busman123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That bill is laughably ill-equipped to tackle what actually makes colleges liberal, namely their exposure of people to others with diverse backgrounds and beliefs.",
                                            "score": 35,
                                            "author": "GrafZeppelin127"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;That’s years of fool-hearty “independence” while accepting shit tons of state and federal aid via SNAP and other programs. \n\nRemember. Every one of them thinks they are one lotto ticket away from being the next billionaire. They are all a bunch of temporarily embarrassed billionaires and things like federal and state aid will come for their billions when it finally happens for them.",
                                    "score": 6,
                                    "author": "ImTheFilthyCasual"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's absolutely mental laziness.\n\nActually paying attention to legislation that is passed, then comparing that to the results of introspection of one's beliefs and circumstances requires effort. \n\nTime and time again, rural conservatives refuse to ask themselves tough questions ( or at least refuse to be honest with themselves ), and therefore continue to vote against people who offer genuine aid, in favor of  people who are actively fucking them.",
                                    "score": 26,
                                    "author": "musicspren"
                                },
                                {
                                    "level": 3,
                                    "comment": "There’s a difference between physical laziness and intellectual laziness. In this case, I think intellectual laziness is an apt descriptor.",
                                    "score": 11,
                                    "author": "urk_the_red"
                                },
                                {
                                    "level": 3,
                                    "comment": "Minor point, but the word is foolhardy 😊",
                                    "score": 8,
                                    "author": "Sea_Elle0463"
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean you could argue it is intellectual laziness.",
                                    "score": 1,
                                    "author": "theholiday3778"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You are overall not incorrect but let's not act like free, universal health insurance is a settled issue within the Democratic party.  You'd be hard pressed to find more than a small handful of politicians holding a national office that actually support free at point of service universal healthcare coverage",
                            "score": 11,
                            "author": "beiberdad69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most of us would live it but have basically had to acknowledge that these things drive about half the country into a frothing panic and then we suddenly lose women’s rights to their own body.\n\nLosing Roe is a direct line from attempting universal health care and then going with Romneycare (way better than nothing).",
                                    "score": 7,
                                    "author": "ConfidenceNational37"
                                },
                                {
                                    "level": 3,
                                    "comment": "That's true, but Dems are overwhelmingly in favor of expanding Medicaid - which is free at the point of delivery, and expanding Medicare - which is heavily subsidized. The issue of course with a fully universal system is cost - and Dems fear of broad based tax increases required to fund it. But expansions of existing programs are an easier pill to swallow.",
                                    "score": 4,
                                    "author": "veerKg_CSS_Geologist",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The second real epidemic in America Foxitis. They have been conditioned by years of Murdoch Sinclair brainwashing.",
                    "score": 50,
                    "author": "RealLiveKindness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is not foxitis and is a hill I’m willing to die on. It’s the near total isolation of the communities in Appalachia. They don’t know the outside world because most are too poor for internet and their teachers aren’t doing much better either. It’s not “fuck that black guy” it’s “this is the way my pappy and my grandpappy did it”. That’s all they know.",
                            "score": 15,
                            "author": "Mundane_Edge_8883",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My grandfather was a coal miner in Nemacolin, Pa. It is a tiny coal town less than 20 miles from the WVa border. He could see that coal was ending and the mines were incredibly dangerous. He had all 5 of his sons join the military so they could get out. They went to college on the GI bill, married women from anywhere but there.  If a coal miner with a high school education could figure this out 70 years ago, these people are willfully pretending they don’t have to change.",
                                    "score": 41,
                                    "author": "cissabm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;My grandfather was a coal miner in Nemacolin, Pa. It is a tiny coal town less than 20 miles from the WVa border. He could see that coal was ending and the mines were incredibly dangerous. He had all 5 of his sons join the military so they could get out. They went to college on the GI bill, married women from anywhere but there. If a coal miner with a high school education could figure this out 70 years ago, these people are willfully pretending they don’t have to change.\n\nThe people that are there are the descendants of the ones that could not figure it out.",
                                            "score": 3,
                                            "author": "winespring"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Excellent example. Thank you.",
                                            "score": 6,
                                            "author": "Opposite-Frosting518"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;This is not foxitis and is a hill I’m willing to die on. It’s the near total isolation of the communities in Appalachia. They don’t know the outside world because most are too poor for internet and their teachers aren’t doing much better either.\n\nThey have TV, they see movies, they can read books, magazines, and newspapers. They know life is different in other places, and they reject it. They have no interest in understanding anyone who isn't like them.\n\n&gt;It’s not “fuck that black guy” it’s “this is the way my pappy and my grandpappy did it”. That’s all they know.\n\nIt's not all they know. It's all they'll accept. You can lead a horse to water, but you can't make it drink.\n\n&gt;Those kids, 97 times out of 100, become bleeding heart liberals by the end of their second semester.\n\nIt's why they drive away their own kids, because half of them would rather be estranged from their kids and never see them than reconsider that an interracial relationship makes their kids happy and they should be happy for them, or a same-sex relationship, or a interfaith relationship, or whatever else. And then they'll get mad at Democrats for supposedly destroying their relationship with their own children.\n\nTheir kids can come home from college, or from their jobs, and tell them news of the world, and instead of learning and accepting, they'll just reject it. It's not a lack of exposure.",
                                    "score": 12,
                                    "author": "Randomousity"
                                },
                                {
                                    "level": 3,
                                    "comment": "Appalachia isn’t on the far side of the moon for Pete’s sake. These folks aren’t any more ignorant of the outside world than they choose to be.",
                                    "score": 4,
                                    "author": "urk_the_red"
                                },
                                {
                                    "level": 3,
                                    "comment": "Could you all take two seconds to actually talk to any Appalachians?? Most of us aren’t oblivious to the rest of the world, a fair portion of Appalachia that are out here and under 50 are further left than the coastal bullshit democrats. The reason we are here is that most of us at some point moved to the cities and were overwhelmed with the cruelty and indifference. \n\nAnd yes, Appalachians aren’t super welcoming or wanting to be involved with others, often because they or their families were victims of exploitation by people not from here. Y’all are pointing at a bear in the zoo and wondering why the bears don’t like you.",
                                    "score": 6,
                                    "author": "mioxm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "To be fair, they’re pointing at the bear who built a zoo around themself to avoid the looky loos because once upon a time the bear was exploited for their resources by the same people they ask to argue on their behalf with the looky loos.",
                                            "score": 9,
                                            "author": "PoopulistPoolitician",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Again, this feels like an age-blind response. Pretty much anyone who grew up here did not ask to grow up in a community that was robbed of people and their health, exploited by the opiate crisis at an exponentially higher rate than the rest of the US, or to be forced into nearly criminal work conditions because the market has been strangled to death by greedy capitalists from the city. To say we all built this cage is no different than saying an actual bear built the zoo. And before you come at me with “then just leave,” you have to understand the absolutely jarring difference between rural life and city/suburban life coupled with most people flat out cannot afford to leave. Not to mention, telling someone that their home isn’t worth it and they should just leave is exactly how regions like this become so depressed in the first place. \n\nI know it’s really in vogue to shit all over Appalachians right now since everyone feels the need to other people they don’t agree with, but Appalachians, much like fucking every other subculture in this country, are not a monolith. There are wildly stubborn right-wing douche bags everywhere, just like there are painfully accepting leftists who just want everyone to be able to survive. \n\nTo just dismiss Appalachians as a legion of stubborn, poor, uneducated idiots who can’t help themselves is exactly why most of us openly hate city folks. The assumptions come without knowing a single thing about us and often comes with “advice” that lacks 100% of the nuance of living outside of your bubble. (Source: myself, a PhD psychologist).",
                                                    "score": 11,
                                                    "author": "mioxm",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was being a bit facetious, but here we go. I will try not to hold your pseudo appeal to authority against you. PhD indeed. I don't know what you mean by \"feels like an age-blind response\". I'm damn near geriatric by Reddit standards if that helps inform your presumptuousness. You've provided plenty of justification for this group of people, who vote against their own self interests and actively vote to harm others, to not like the Democratic Party.  Based on your analysis it's misplaced anger. Okay. I'll accept that. What I do not hear from you is why should the tens of millions of people who make up the Democratic Party change their platform to accommodate this paltry sum of people so ignorant and hate-filled that their rage is supporting and electing the very people who help lash them to poverty and exploit them. Obviously, they are not monolith as no group truly is, but the majority are clearly \"wildly stubborn right-wing douche bags\" while the minority don't fall into the group we are all so happy to denigrate. So what are you trying to accomplish here? You want those seeking progress to let this \"legion of stubborn, poor, uneducated idiots\" kick up their heals on a fainting couch and commiserate? Or should the left just accept that there's a middle between *brown skin people shouldn't exist* and *all people are equal*? Or maybe, we should let them siphon more resources from the big bad cities so they can continue to live in the zoo they maintain (more palatable for you?) while still being provided a voice that far exceeds their numbers and contributions. To those \"painfully accepting leftists who just want everyone to be able to survive\", I say stay the course, because beside you their are Progressives, Democrats, Socialist, and Leftists  pouring sweat and treasure into making this country what it should be. With respect to the people of rural Appalachia who are \"wildly stubborn right-wing douche bags\", they can go fuck themselves and die in their diseased, poverty stricken hovels knowing that they were never truly useless, because they clearly allowed themselves to be used. (Source: me, because pretentious twat reasons, Esq.)",
                                                            "score": 2,
                                                            "author": "PoopulistPoolitician",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What I mean by an age-blind response is that you are under the impression that everyone in Appalachia seems to only fit into one box, but the overwhelming majority of people 35 and under in the region are not republicans (so, age blind in the subject, not you). In the region there is an overwhelming feeling of hopelessness due to how poorly folks (read: capitalists and the lay public who thinks of us through the lens of J.D. Vance’s brain dead propaganda) treat us from the outside without knowing anything about us. \n\nAppalachia has proportionately a higher rate of lgbtq+ folks than most of the country and an overwhelming amount of gerrymandering/voter suppression that no one pays attention to because it’s again not vogue to give a shit about rural voters. The overwhelming majority of us aren’t hateful conservatives, we are more often than not apathetic, disenfranchised people who want the best for others but frequently don’t have anyone to vote for (look at how money is distributed within the Democratic Party and how often they would rather save money than run a candidate in a race they think is a foregone conclusion). So, while I am a leftist that wants everyone to be able to live, eat, and survive without going into deep poverty, the Democratic Party has abandoned rural voters for my entire life and doesn’t deserve praise for it. \n\nI’d also implore you to consider that you are doing exactly what the Conservative Party wants you to do, in-fight.  There’s a lot of new movement in trying to find people to represent at the local level against the GOP, but it’s hard to start grassroots movements because most of us are dead broke no matter how educated or determined. To follow up on the money support being sent into the region, it  has been working to help progress the region. Hell, I live in a unincorporated town of only about 1000 people and we have fiber optic internet, a growing coding program in our high school, an ecological science program that promotes climate/citizen science, and a handful of community-based organizations that look to help folks find good jobs, feed their families, and teach each others the folk arts/practices, all of which are running on budgets smaller than one average suburbanites’ yearly income. \n\nSo no, most of us aren’t just sucking resources out and voting against our own interests. We’re largely stuck without any representation and then getting shit all over by folks who think we’re all just shoeless hillbillies, rather than a population who has had to try and raise up out of systematic abuse and poverty to make any progress while being robbed of everything we have to offer (tobacco, coal, our lives, etc.)",
                                                                    "score": 4,
                                                                    "author": "mioxm"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If you are a progressive, why are you rooting for the day when the rural poor all literally die off? We should aim to eliminate poverty wherever it exists, not point and laugh. I'm not surprised, though. Now that the white rural working class is staunchly Republican it's not surprising we see strident classism among some Democrats now.",
                                                                    "score": 0,
                                                                    "author": "conspicuousperson",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They were advocating for the end of poverty for all. How is it not clear my now that anyone voting Republican is voting against ending poverty, including Appalachians.",
                                                                            "score": 4,
                                                                            "author": "Bitter-Juggernaut681"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This doesn’t read well. Were you speaking for people you don’t know, or from an area you are not from? \n\nIf so, how would we imagined that would’ve turned out?",
                                    "score": 2,
                                    "author": "AfroThunderOC"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "25% of all coal miners lost their jobs in the 4 years of the Trump admin.\n\nhttps://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/us-coal-jobs-down-24-from-the-start-of-trump-administration-to-latest-quarter-61386963",
                    "score": 15,
                    "author": "veerKg_CSS_Geologist"
                },
                {
                    "level": 1,
                    "comment": "I feel like this view is missing some nuisance, like lack of jobs in the area outside the coal mines, or how hard it is to up and move your family trying to get a tech job. Retraining is good but if the jobs you are retraining people for aren't in the area and they don't have the infrastructure, which in rural Appalachia you might not it won't help.",
                    "score": 8,
                    "author": "sigurd27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It also takes time. Like 3-5 generations of time. \n\nIf you’re in one of those middle generations and don’t get the lucky break? What do you have?\n\nThe perspective of this article and most of the commentors here is kinda bass ackwards on this one",
                            "score": 7,
                            "author": "ttown2011"
                        },
                        {
                            "level": 2,
                            "comment": "When their great great grand pappies left whatever east coast city they lived or landed and traveled to these coal regions to secure employment in order to provide for their families I wonder if they would be proud of these pill popping losers crying and complaining about how the jobs went away and won’t come to them.",
                            "score": 6,
                            "author": "Strick1600"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hillary plan went even further in great detail",
                    "score": 8,
                    "author": "ClintGreasewood"
                },
                {
                    "level": 1,
                    "comment": "The Dems literally handed out free bootstraps. And these morons couldn’t pull themselves up.",
                    "score": 10,
                    "author": "Franklin_le_Tanklin"
                },
                {
                    "level": 1,
                    "comment": "Look, the truth is that retraining just doesn't fucking work for most middle-aged workers. It just doesn't.\n\nThe sad truth is that the government should downright buy out those folks out of those mining towns and relocate them to places where they can take jobs, for instance in the Dakotas' oil fields.\n\nBasically, managed retreat for jobs. Uncle Sam buys your property, and gives you a relocation bonus to places where you can find a job.\n\nThe people willing to retrain will retrain. But you can't force them. You can't even expect it.\n\nProblem is obviously the entitlement mentality (and I don't mean it in a condescending way) where some families expect that because the family men works have been riding mine elevators for three generations, the next one should too.",
                    "score": 10,
                    "author": "SpaceJackRabbit",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The infrastructure bill would have been great for the USA especially since everyone can tell our old pipes are poisonous, trains are slow and unsafe, bridges are barely safe and every road has potholes. \n\nBut West Virginia senator held the bill hostage because it wanted to pivot the strong coal mining industry into a more sustainable energy industry through wind farms and solar. Basically he killed the whole country chance to bring our infrastructure to the 21 century.",
                    "score": 2,
                    "author": "OkBeing3301"
                },
                {
                    "level": 1,
                    "comment": "That’s not so true. The truth about rural America is more complicated than just sentimentalism about long gone coal jobs which were terrible btw",
                    "score": 1,
                    "author": "yourpalharvey"
                },
                {
                    "level": 1,
                    "comment": "I am originally from WV. You’re right…\n😔",
                    "score": 1,
                    "author": "DasKritter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mom grew up in Wheeling.\n\nWheeling Steel was going to save the town, until it didn't. Still have people expecting steel to come back and give everyone a job, and turn the town into utopia.\n\nMy grandpa, retired as a Wheeling Steel executive in the late-90s. I remember, after his retirement he would volunteer religiously at a local prison, sometimes teaching classes in business or different trades, and I remember him talking about how each time he would run into some worker who he knew from Wheeling steel in there it killed him a little bit.\n\nHe always described them as 'steel guys' sitting in there for the next big steel boom that would never come, and lament they were rarely the ones in the classes or even in the yard when he would go just to play chess in there, except when they wanted to ask about whether he had heard anything about the steel mill hiring again, or any new steel company thinking about coming to town. I think it always irked him, all the young guys there would be first in line for any training course, jumping at any chance to better themselves, but these middle-aged, laid off steel workers that he knew had a family back home would be sitting there daydreaming of when it would all just fall right back in place. He would ask them what they would do when they got out, and they would just say that by that point the economy would be good and Wheeling Steel would be hiring like mad, and that Obama fellow, well he would be out of office and the republican would fix it all.",
                            "score": 5,
                            "author": "This-is-Redd-it",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn dude. You just summed up half the people i graduated with. They all think coal will come back and that will cause the trains to come back followed by the hotels etc. I live on the other side of the country now and drive a car that charges from a panel on my roof. These industries aren’t coming back and the fact that they think Donald Trump, the alpha predator of capitalism, is going to usher all of this in and save them is just insane. It’s frustratingly depressing.",
                                    "score": 2,
                                    "author": "DasKritter"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Fox News said all the libs hate me, so I took a bunch of opiates, and voted for Trump. You need to fix my mess now.\"",
            "score": 36,
            "author": "Ok_Door_9720",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"but if you continue to support the people I hate - like. Black people, gay people and women - while you fix my mess, I'll throw you over for a Republican who will fuck my shit up in the next election\"",
                    "score": 4,
                    "author": "mowotlarx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What economic questions did they ask the people they elected -  you know - republicans?",
            "score": 92,
            "author": "TintedApostle",
            "replies": [
                {
                    "level": 1,
                    "comment": "What ecunomic sancshuns you gunna institute to hurt dem dam Mehicans and colurds I keep seein in my trailer park who keep playin dat durn Tejano and Trap music. This is Murica, we listen to two types of music! Country and Western!",
                    "score": 28,
                    "author": "melotron75",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They know better than to say \"colored\". Or n*****, or f****t.. The new term is \"woke\".",
                            "score": 18,
                            "author": "arensb"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Enough with the Cletus safaris.  The media has been doing them since 2016 and at this point there is nothing left to be learned.  Democrats shouldn't change their entire policy platform - and upset a big chunk of their base - to make Cletus happy.  And even if Democrats did that and ran off most of the social liberals and environmentalists in their coalition, Cletus would still vote Republican.  \n\nAs for the economic challenges faced by rural America, I'd advise them to learn how to eat the culture war and tax cuts for the rich.  Because that's all they'll ever get from Republicans.",
            "score": 259,
            "author": "bem783",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;As for the economic challenges faced by rural America, I'd advise them to learn how to eat the culture war and tax cuts for the rich. Because that's all they'll ever get from Republicans\n\nI fucking over that way of stating this particular truth.  Well done!",
                    "score": 21,
                    "author": "Umbrage_Taken"
                },
                {
                    "level": 1,
                    "comment": "For real. There's nothing to learn about these people. They're dumb and bigoted. That's all there is to them.",
                    "score": 4,
                    "author": "Sweatier_Scrotums"
                },
                {
                    "level": 1,
                    "comment": "Amen.\n\nThis is one reason I'll never vote for Pete Buttigeig: he's a apologist who wants to appease the rural, white-lash voters who handed Trump the win in 2016.\n\nThe time for reaching across the isle is long past. We need solutions that don't hinge on people acting in bad faith, or the \"look at what you made us do!\" crowd.",
                    "score": 46,
                    "author": "ASharpYoungMan",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Cletus not real bright",
                    "score": 5,
                    "author": "fpcoffee",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; And even if Democrats did that and ran off most of the social liberals and environmentalists in their coalition\n\nWhere would they run to? It's not like they are going to vote for a Republican. At worst, they'd stay home on election day, but even that seems unlikely for that group.\n\nNo, Democrats just need to be better at selling wealth redistribution that would actually help rural voters (and everyone else). Like universal healthcare, parental leave, universal college-level education, better funding for their public schools, etc.\n\nDon't let Republicans scream \"socialism\" and \"communism\" every time someone tries to better people's lives.",
                    "score": 6,
                    "author": "TrackFittyTwo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If Democrats do a sharp right turn on social and environmental issues to win over Cletus, a lot of liberals - especially young voters who already turn out at low rates - will stay home.  Plus, a lot of the socially liberal/economically moderate suburban voters who have switched to the Democrats over the past few election cycles can easily go back to voting Republican.  \n\nAs for Democrats doing a better job of selling their economic agenda to rural America, that's been a fantasy for decades ever since \"What's The Matter With Kansas?\" was published.  The sad reality is that Republicans have been very effective at demonizing \"wealth redistribution\" as primarily a racial handout to \"those people.\"  Plus, despite the economic problems facing rural America, it is very clear that their top priority is still God, guns, and gays.",
                            "score": 11,
                            "author": "bem783"
                        },
                        {
                            "level": 2,
                            "comment": "That’s been the party platform for decades. The party effectively quarantines actual progressives and hard sells to Republican lite voters. The “big tent” they always try to sell, but the numbers haven’t budged in their favor in these areas. There are far more non-voting left leaning young people than potential Republican voters who can be convinced otherwise. The party platform should be courting these potential voters who want to see action not hand wringing over whether or not fascists and their supporters and apologists might, maybe, someday, possibly consider pulling the lever on the D.",
                            "score": 9,
                            "author": "PoopulistPoolitician"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If a voter thinks the Republicans better represent their interest they should vote Republican. Every piece of evidence I can find says they certainly don’t. Ignorance is bliss they say. It’s like Mississippians blaming Democrats for anything happening in their state. Republicans have run the state for decades. You are witnessing the result.",
            "score": 22,
            "author": "CatAvailable3953"
        },
        {
            "level": 0,
            "comment": "Seriously, fuck them.\n\nThey haven’t figured it out and they won’t.\n\nSource: grew in a red state county of 500 sq miles with a total population of 7500. I am regularly in similar counties and the people are mean, paranoid, and disagreeable, flying thin blue line flags and sporting all sorts of trump BS.",
            "score": 21,
            "author": "tries4accuracy"
        },
        {
            "level": 0,
            "comment": "What do they want from us? They called us demons and pedophiles and we smiled and nodded through it for decades asking them to just listen and they didn’t. They voted us out, they slandered and threatened us, and now that they’re finally starting to realize the party that promotes dysfunctional government, zero social programs, are against unions, pro-child labor, anti-education and make their states a never ending suck on OUR tax dollars isn’t looking out for them, they want help. Sounds like they’re looking for some kind of a hand out. I’ve got a whole box of bootstraps for them, but not much else.",
            "score": 69,
            "author": "dc551589"
        },
        {
            "level": 0,
            "comment": "\"We hate you and think you drink the blood of children.   Help us, while we vote for people to stop you!\"",
            "score": 137,
            "author": "meatball402",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be fair, our reptilian overlords *do* eat aborted fetuses and drink the blood of children.\n\nThese people just haven't figured out that it's not *just* the Democrat lizardmen, but also the Republican lizardmen as well.\n\nEdit: Silly me, forgot about the snakemen; I feel great shame.",
                    "score": 2,
                    "author": "RectalSpawn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just remember that while all adrenal gland slurping lizard people are Reptilian Humanoids, not all adrenal glad slurping Reptilian Humanoids are lizard people. You don’t want to find yourself in the hollow earth calling snake people “lizard men” or it might just be your adrenal gland they slurp on",
                            "score": 6,
                            "author": "CurseofLono88"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So the people they kicked out of power are supposed to now help them? With what power? Not enough self awareness to realize that the people they voted for are currently responsible for their problems.",
            "score": 49,
            "author": "sugarlessdeathbear"
        },
        {
            "level": 0,
            "comment": "If these voters don't take the time to educate themselves on the true state of politics and political parties, that's their problem.  Their ignorant and blind voting for one party has already cost America its greatness.  We are now no better than Russia or China..",
            "score": 10,
            "author": "sugar_addict002"
        },
        {
            "level": 0,
            "comment": "Democrats doing nothing for the lower class. Wtf do they think Republicans are doing for them?!",
            "score": 11,
            "author": "snaila8047"
        },
        {
            "level": 0,
            "comment": "Vote for Republicans. Blame dems when Republicans pass laws that hurt them..",
            "score": 12,
            "author": "humanmade7"
        },
        {
            "level": 0,
            "comment": "The trouble is to get these people to vote Dem they have to be happier, better educated and more prosperous. Repubs know this and make sure it doesn’t happen.",
            "score": 9,
            "author": "survivor2bmaybe"
        },
        {
            "level": 0,
            "comment": "Quoth LBJ:\n\n“If you can convince the lowest white man he's better than the best colored man, he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.”",
            "score": 9,
            "author": "sportjames23"
        },
        {
            "level": 0,
            "comment": "They keep voting for increasingly extreme Republicans only to blame Democrats when their lives continue to get worse.",
            "score": 27,
            "author": "DickySchmidt33"
        },
        {
            "level": 0,
            "comment": "We need to just erase Republican officials from the process entirely. Just ignore them and act as if they don't exist. They are not a serious party and cannot be viewed as a legitimate part of our government. We would get **so** much done if we simply pretended they were not there.",
            "score": 8,
            "author": "MoonChainer"
        },
        {
            "level": 0,
            "comment": "Why don;t rural voters seem to want economic answers from the Republican titans of industry who offshored their jobs, destroyed their unions and presently replace many of them with robots?",
            "score": 8,
            "author": "Ok_Loquat_2692",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because nobody wants to work anymore!  Haven't you heard?  The bird, burd, bird is the word.",
                    "score": 1,
                    "author": "deadra_axilea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Why isn't you fixin' that 'conomy?\"\nYou keep voting in obstructionists, fascists,  pedofiles, and morons to own the libs.",
            "score": 7,
            "author": "Zanos-Ixshlae"
        },
        {
            "level": 0,
            "comment": "Rural, white, privileged and entitled.\n\nSauce: I live in rural Calibama.\n\nTheir willful ignorance, reflexive belligerence and resistance to any forward progress, even that which would improve their lives,  makes me quite unsympathetic.",
            "score": 8,
            "author": "Important_Outcome_67"
        },
        {
            "level": 0,
            "comment": "Where are the Republicans, supposedly elected, in charge, and receiving salary from tax payers... where are they in this discussion. Why do rural voters always point to liberals to solve their own problems? \n\nHere are some bootstraps. Good luck.",
            "score": 28,
            "author": "GoneFishing36"
        },
        {
            "level": 0,
            "comment": "Maybe stop voting for republicans first 🤷‍♀️",
            "score": 18,
            "author": "TruthandHonorLost"
        },
        {
            "level": 0,
            "comment": "Here's what I don't get. Why would they just default to the Republican Party then? Like, ok sure, I can understand you want some economic solutions. But what if I told you that the economy is just going to do what it's going to do to a great extent regardless of which political party is in charge? What if I said that there really isn't all that much to be done? What if the Republicans had even less to offer economically than Democrats? Because that's true.\n\n Which brings me back to my original question. Why are they defaulting to Republican votes? Probably because they were born and raised conservative and believe Democrats are evil, and so this whole notion that Democrats just aren't doing enough to capture their attention is completely disingenuous and a waste of time. Democrats could make their 401Ks quadruple in value and they would still vote Republican because Fox News is bald faced propaganda and will lie anyways.\n\nWant people to start voting based on issues again? Then it's time we did something about the propaganda in this country.",
            "score": 7,
            "author": "Mysterious-Wasabi103"
        },
        {
            "level": 0,
            "comment": "our boarders have thousands of people trying to get to America to make a better life for their kids. Every American embassy has a line of people waiting for the chance to get a visa, every year hundreds of thousands participate in a visa lottery to get a better life for their family. And I'm supposed to feel sorry for these folks in coal country that refuse to move 100 mile to find more opportunity and who can't stop complaining that all the jobs left them? JD Vance pointed this out in his shit book, that these folks value their land and their ties to it over things like shoes for their kids and economic security. when someone refuses to help themselves and demands the entire economy be reworked to help them out i'm not sure there's much to be done in a real sense.",
            "score": 6,
            "author": "bubblesound_modular"
        },
        {
            "level": 0,
            "comment": "Haha what is happening with this story here? They want to frame rural vs dems narrative? \n\nMaybe that’s just stirring the pot and not helping anyone.\n\nMaybe journalists should educate the public about rural initiatives? How does the IRA help rural America? Where’s that story? Maybe it’s better to run that than to conjure up resentment, huh?",
            "score": 7,
            "author": "yourpalharvey"
        },
        {
            "level": 0,
            "comment": "Saving rural economies has been a real important question for a couple decades now. People should take it aeriously.\n\nPersonally I think it can't be done. Giant agribusiness is just too efficient to compete against except maybe around the edges. Network effects are too strong - if you're not around where an industry is thriving you get frozen out. At least we backtracked on those wretched global free trade agreements so factories can come back again. But it's still not enough.\n\nBut anyone got a great vision and strategy I don't care who you are it's welcome.",
            "score": 16,
            "author": "SunsetKittens",
            "replies": [
                {
                    "level": 1,
                    "comment": "At the end of the day there needs to be a real focus on what the rightwingnuts pretend to want: make groups pay for things and compete to be economically viable.\n\nThe fact is that most rural places aren't economically viable as they exist, they have massive subsidies from wealth transfers of taxes from populatrd areas.\n\nForce the reckoning and maybe there can be change. There are higher costs even if land is relatively cheap - higher shipping costs and so on.\n\nBut there does need to be some room for movement of people - let them leave dying towns or make certain prices/pay rise. Farm subsidies don't go to the workers but the corps, if we switched that somewhat, maybe subsidized certain point of sale costs, that would shuffle things up a bit so viable places have extra people and other places don't.\n\nAlso underestimated in these instances is the need for water.\n\nI don't think a bunch of rural places can be saved, without certain exploitations, areas will turn into Indian reservations - and that's been a nationally ignored problem :(",
                    "score": 4,
                    "author": "showingoffstuff"
                },
                {
                    "level": 1,
                    "comment": "Personally I think agribusiness is not efficient. At least not when it comes to feeding people. It's only efficient at making money. I think with our technology having more people own farmland that they work would be a better system. \n\nAnd yes, I realize that implies taking land back from banks and corporations and I still think it should be done. Those entities gamed our governmental system to acquire that land.",
                    "score": 2,
                    "author": "LingonberryHot8521"
                },
                {
                    "level": 1,
                    "comment": "It's not like we have tried much. \n\nWe spend billions on farm subsidies, we could skew the distribution of those resources towards independent farmers. \n\nWe could pass new antitrust legislation to break up Tyson and Monsanto. \n\nWe could pass right to repair laws to make farm equipment more affordable. \n\nWe could change our gasoline from E10 to E20. \n\nWe could pass a universal healthcare bill with funding to rebuild rural clinics and bring good paying healthcare jobs to many small towns. \n\nWe could fund reforestation and prairie restoration efforts in areas where there just won't be enough water to use all the farmland. \n\nWe could incentivize companies to create more remote work positions so that these jobs are available for people in rural communities and so highly skilled workers might seek out small towns in search of better home ownership opportunities. \n\nWe could accelerate the shift towards wind and solar to move our energy production (and associated jobs) to rural areas.\n\nThese things are only politically possible if rural voters stop voting against their interests and if Democrats actually bother to pursue a 50 state strategy again, but we always do better when we ask \"what's possible?\" not \"what's politically possible?\".",
                    "score": 2,
                    "author": "stevez28"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And another article about it that they will never read",
            "score": 5,
            "author": "daxxarg"
        },
        {
            "level": 0,
            "comment": "I’m tired of catering toward rural voters. I’m tired of the breakdowns on what they are thinking. They aren’t thinking, they are just feeling",
            "score": 5,
            "author": "DaddyDontTakeNoMess"
        },
        {
            "level": 0,
            "comment": "The coal industry has been dying. \n\nThe problem is regulating coal, but allowing fracking to go with minimal regulation. This made natural gas cheap.\n\nThey need to blame oil and gas exec who lobbied for it, and politicians who refused to regulate it.",
            "score": 25,
            "author": "HopeFloatsFoward"
        },
        {
            "level": 0,
            "comment": "\"You said fuck me and I was like \"Cool\". Now what's the problem?\"",
            "score": 13,
            "author": "M_R_Ducs"
        },
        {
            "level": 0,
            "comment": "That ship sales, they elected disatorous Republicans.\n\nLegit, they're going to die broken and poor, because that's what they chose.\n\nEven with a massive cash infusion the time to accept it was 2008... Fast forward they are 15 years deeper down the hole.  Recovery for their communities likely doesnt happen in their lifetimes... If ever.\n\nSorry, not sorry",
            "score": 12,
            "author": "LoveArguingPolitics"
        },
        {
            "level": 0,
            "comment": "It’s amazing to me that people will vote against their best interests.",
            "score": 5,
            "author": "AnalystNo764"
        },
        {
            "level": 0,
            "comment": "Chasing votes in rural areas is a fool’s errand. In statewide and national elections the Democrats need to focus on activating voters in cities and suburban college educated women. Trying to get folks in WV to vote for democrats is just throwing good money after bad. You couldn’t help those folks if you tried, and god knows we have tried.",
            "score": 10,
            "author": "Flat-Story-7079"
        },
        {
            "level": 0,
            "comment": "Yeah well the rural voters decided trump and owning the libs was the most important thing, their economic issues can go  take a hike",
            "score": 12,
            "author": "rupiefied"
        },
        {
            "level": 0,
            "comment": "I desperately want to blame these folks who keep voting for pro-rich Republicans. Yes, this is partially your fault, and you got what you voted for. Maybe local government Republicans care, but at the Federal and state level these fuckers don't give two shits about you. They believe in the economic hierarchy, and you aren't on their level.\n\nThat being said, both Bill Clinton, some corporate Democrats, and an exhaustive list of Republicans helped bring about NAFTA, Chinese manufacturing, WTO, and the end of various Wall Street protections. \n\nHell, our current president is solely responsible for making it near impossible to discharge student loan debt through bankruptcy, and this was during the time that the banks provided the loans.\n\n9 Democrats, and whatever the fuck Kirsten Sinema thinks she is, helped vote down raising the minimum wage. A Democrat killed the public option during Obamacare. \n\nThe Republicans are evil and reprehensible. The people who vote for them are reactionary and, at times, hateful fools. \n\nBut don't think for a second the Democratic party has been perfect because they absolutely have failed this country. We should expect better, but right now everyone here hates the GOP so much they just much on whatever the hell Democrats do.",
            "score": 8,
            "author": "NotTheRightHDMIPort"
        },
        {
            "level": 0,
            "comment": "The three in the photo look like two Dreadnoks from G.I. Joe and a kid brother.",
            "score": 3,
            "author": "Long_Before_Sunrise",
            "replies": [
                {
                    "level": 1,
                    "comment": "Xymot and Timox? or something like that??",
                    "score": 1,
                    "author": "slightlyused",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those were the identical twins who were big business moguls.",
                            "score": 2,
                            "author": "Long_Before_Sunrise"
                        },
                        {
                            "level": 2,
                            "comment": "The Dreadnoks are a reprehensible group of mercenaries, vandals and thieves who worked for both Zartan and Cobra over the years. Specializing in violence and destruction, the Dreadnoks have no regard for anyone or anything but themselves and fast money. Their diet consists of little more than chocolate-covered donuts and grape soda",
                            "score": 1,
                            "author": "General_Tso75"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so sick of trying to help stupid people that I’m done helping stupid people. If they’re going to vote for folks that rip them off, then I’m going to let them do it and then, as a non stupid person, find a way to benefit off their stupidity. Unfortunately this is how republicans are made. Stop being stupid stupids. I really don’t wanna cross that aisle.",
            "score": 3,
            "author": "rastagrrl"
        },
        {
            "level": 0,
            "comment": "We\n\nTold\n\nYou\n\nSo.\n\nWe tried to help.\n\nYou want industry that's not coming back, to come back, it's not happening.\n\nThere are your answers.",
            "score": 3,
            "author": "UrbanGhost114",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As much as we make fun of this, Democrats did kinda sell out farmers pretty hard when they let the large agricultural conglomerates take over",
            "score": 3,
            "author": "ConjectureProof"
        },
        {
            "level": 0,
            "comment": "&gt; “If you can convince the lowest white man he's better than the best colored man, he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.”\n\n&gt; President Lyndon B. Johnson",
            "score": 3,
            "author": "walkinman19"
        },
        {
            "level": 0,
            "comment": "Enough with these people, and enough with reporters going out to Red America to hear Jethro and Maude's opinion on the libruhls. Why doesn't the media head to a diner in downtown Detroit to hear from Democratic voters? Or a college cafeteria to hear what students are facing? \n\nThese are the people who put Trump in the White House and Marjorie Taylor Greene in Congress. I'm pretty sure I know what they want: chaos and division. No reason for another think piece.",
            "score": 5,
            "author": "44035",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are more people than college students and people who live in major cities.",
                    "score": 1,
                    "author": "MobbinIsAPrivledge_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can lead a horse to water…",
            "score": 9,
            "author": "RoachBeBrutal",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re not leading. You don’t campaign or even have representation of democrats in rural America. If you overlook a group and don’t show up. Why would they vote for you?",
                    "score": 0,
                    "author": "MobbinIsAPrivledge_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a good point. And I’ll counter by pointing out the fact that republicans have demonstrated time and time again that they will vote against their own self-interests. Even when presented with a better choice.\n\nAnd when you say “you’re not leading” and “you don’t campaign” I know you are speaking proverbially: You must assume I am a democrat.",
                            "score": 3,
                            "author": "RoachBeBrutal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And while he’s distracted with that, you can steal his dewormer paste to avoid “the jab” and wonder if maybe he’s tucking his massive horse dong inside some panties and wearing a skirt when you’re not looking. \n\nLife is complicated. That’s why it’s so important to prioritize your concerns accordingly.",
                    "score": 1,
                    "author": "jabdtx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The answer doesn’t lie in any political party, though the fascists of the GOP are light years worse. \n\nIt’s capitalism. Period. Even elected Dems are very invested in the capitalist system. I vote for Dems because what choice do I have, but I know full well the damage capitalism does.",
            "score": 6,
            "author": "AnastasiaNo70"
        },
        {
            "level": 0,
            "comment": "Remember when Hillary Clinton was giving a big economic speech that could have moved the needle on all the fuckery we saw get worse after?\n\nBut instead of covering that, all of the news stations ran the access Hollywood tape story for a week?\n\nAlmost like it was planned.",
            "score": 2,
            "author": "Careful_Trifle"
        },
        {
            "level": 0,
            "comment": "Then stop voting against democrat policies, you fucking bumpkins...\n\nSincerely,\n\nex-bumpkin",
            "score": 2,
            "author": "SubKreature"
        },
        {
            "level": 0,
            "comment": "If you make a wage or a salary aka a worker I encourage you to look into Class Conflict because the ruling class will always win under a capitalist organization of the economy.",
            "score": 2,
            "author": "Dxmndxnie1"
        },
        {
            "level": 0,
            "comment": "But they now vote Republican and expect nothing from them.",
            "score": 2,
            "author": "wish1977"
        },
        {
            "level": 0,
            "comment": "Oh, I'll answer them. They can go fuck themselves.",
            "score": 2,
            "author": "BrofessorFarnsworth"
        },
        {
            "level": 0,
            "comment": "Then give them a solid generation of support to undo the erosion the GQP has been imposing on America since the 80s. Work with the left to build the country we need.",
            "score": 2,
            "author": "whyreadthis2035"
        },
        {
            "level": 0,
            "comment": "Probably as many brain cells as teeth in that picture. How many times do morons have to be told you get what you voted for",
            "score": 2,
            "author": "Marckthesilver13",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I couldn't read anything because it's behind a paywall..",
            "score": 2,
            "author": "Shibby513",
            "replies": [
                {
                    "level": 1,
                    "comment": "Googled the headline and read it on yahoo news without paywall",
                    "score": 2,
                    "author": "PlatinumKanikas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why don’t these food stamps buy diapers.",
            "score": 2,
            "author": "Uffizifiascoh"
        },
        {
            "level": 0,
            "comment": "OMG fuck these people.",
            "score": 6,
            "author": "jimjam721"
        },
        {
            "level": 0,
            "comment": "[Read the full story by signing up with your email.](https://www.bloomberg.com/news/features/2023-06-08/democrats-winning-rural-voters-in-2024-depends-on-economy-inflation-jobs-plans)  \n\n\n*From Bloomberg News reporter Christian Hall:*  \n\n\nWhen Danny Patrick cast his ballot for former President Donald Trump, it was in part to spite the party that had once counted his West Virginia coal country vote as a given.  \n\n\n“I felt like \\[Democrats\\] weren’t ever doing nothing for the lower class down here,” said Patrick, 57, a former miner who lives in McDowell County, designated by the US Census Bureau as being in “persistent poverty” — a poverty rate of more than 20% for more than 30 years.  \n\n\nThat perception of abandonment, particularly on economic issues, has contributed to a decades-long erosion of rural voters from the Democratic coalition. Now, there is fresh urgency for the party to try to win them back.  \n\n\nWith Democrats losing their grip on some of the non-White voters who have powered their recent victories, rural residents could prove crucial in the 2024 election cycle. The presidential contest will hinge on results in swing states including Wisconsin, which has a significant rural population. US Senate races in places such as Montana and West Virginia also will help decide control of that chamber.",
            "score": 3,
            "author": "bloomberg",
            "replies": [
                {
                    "level": 1,
                    "comment": "According to a 2016 Washington Post article, 60% of the 20,000 visits to one major care clinic in the area were from patients on Medicaid…more than double the number that were covered by Medicaid in the same clinic before the ACA took effect.",
                    "score": 13,
                    "author": "McParadigm"
                },
                {
                    "level": 1,
                    "comment": "Well sir every time democrats talk about changing the industry focus in West Virginia with a view to future skills in technology or other industries it is met with ...  \"You are trying to go green and shut down our mines...\"  This is then followed by electing local republicans who fight to make sure the coal owners keep you in poverty. \n\nThere .. there is your answer.  \"Better smoke than woke\" am I right?\n\nYou stopped voting for Dems so they stopped trying.",
                    "score": 44,
                    "author": "TintedApostle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; You can't swap out an industry overnight, especially with a lot of unknowns about said industry.\n\nDemocrats had been talking and trying for decades.  Decades of trying.  I have a few friends who got out of WV in the 1990s and into technology.  They have told me that there was no way they could have remained in WV and had the kind of career or education they got by leaving. \n\nThe training is to get out of a dying industry (coal) and create a more diversified economy in the state.  Green energy is but one industry, but if WV was a bit more progressive people might remote work there or even move there, but the population is leaving if they can.",
                                    "score": 23,
                                    "author": "TintedApostle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've never been anywhere near there, I just have been around rural poverty and figure a lot of it is similar.  One of the places I grew up used to be a logging town.  California Loggers isn't all that big of an industry these days, so yeah.  \n\nI honestly just don't know what the solution is, as these communities are also fairly resistant to change, they are unwelcoming to modern solutions and opportunties, don't want things to change, are scared of change, etc.",
                                            "score": 5,
                                            "author": "childrenofruin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thing is they all have TVs, cell phones and cars.  It isn't like the 1930s listening to the 3 networks on the radio.  They can see what is going on.",
                                                    "score": 11,
                                                    "author": "TintedApostle"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the point is that if they had accepted any of the green industries over the past couple of decades they might already be starting a rebound. No one expects an industry to popup overnight. But they need to let someone plant seeds if they want some shade in the next couple of decades.",
                                    "score": 14,
                                    "author": "CharlieChop",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean, yeah, had we all done things differently in the past things would be different.  \n\nThe issue is that these communities are not highly educated, they only know what they know, and telling them that Intel is going to build a campus and create a bunch of jobs isn't going to really hit home for the uneducated people that just want a job to do.",
                                            "score": 1,
                                            "author": "childrenofruin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea, but they would literally gnaw off their own arm rather than take help they see as \"liburl handouts\". Sadly, all I have to say anymore is bon appetite.",
                                                    "score": 7,
                                                    "author": "newge4"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve worked on a few campaigns (local, state, and national) and Democrats could have permanent power if they actually listened and created a viable rural/suburban strategy and executed 50% of it. \n\nIt’s a very unsexy topic, but soil degradation and individual family farms, transportation issues, right to repair, internet issues, actual environmental issues, and some solid policy that helps actual people, Republicans would be fucked. \n\nThere’s a lot more to be said and a lot more work with rural folks and their orgs and whatnot, but there’s a real opportunity here to explain how national initiatives like universal healthcare and college tuition/debt reform will help the towns and communities that are currently dying off. \n\nBut I’m prepared for Dems to fuck it up.",
            "score": 2,
            "author": "PapillionPapa",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work for a small town. This is a much needed reality I feel some liberals need to accept.\n\nYes, Republicans deserve half the blame for the decline of liberal concerns in rural areas, but democrats are also to blame. The problem isnt that there are no winnable voters in rural areas, it is that since Clinton the democrats have struggle (either purposefully or accidentally) to actually speak to rural voters and acknowledge their concerns in a manner that actually appeals to them. \n\nThe primary reason rural voters vote so conservatively isnt because they see any actual benefits from the republican suits, it is because the republican suits will come down to their towns, walk their streets, listen to their problems, and then talk their language. In reality, the fixes republican politicians may make are small, but sometimes that is enough.\n\nFor example, recently my towns state house representative visited my town and discussed a number of issues in a town hall. A couple weeks later, the state DOT came in and installed a guardrail along a stretch of interstate where multiple cars had left the right of way leading to two fatalities, because the representative called up the DOT chief and insisted it needed to be done. There was no fanfare. The (Republican) representative came down. The (republican) representative saw the problem. The (republican) representative fixed it.\n\nSure, it was a tiny, minute little fix that should have been done decades ago. But it wasn't. While the (majority democratic) state government hadn't fixed this problem in decades, it took the Republican a month to get the DOT off their ass to fix this. Why wouldn't the residents support him, even if this is one tiny, nearly insignificant fix? \n\nI'm not saying the democratic state government doesn't care, but it certainly doesnt prioritize their needs, so why should they vote for them? People watch as the big cities - where the majority of the democratic electorate lives - get millions of dollars of investment while their little town needs to get on its knees and beg for a project that would cost a tiny fraction of what the bigger cities get without asking for. And sure, in reality, the state government is prioritizing the larger cities because, proportionally, those repairs and fixes will serve the greater good, however do you really expect people living in the rural town to find solace in that? \n\nI'm a liberal, a democrat, but I can understand why these populations feel like they are ignored and why they feel like they are being talked down to. And that is the crux of the issue. As democrats, we have to find a middle ground where we can actually improve these people's lives - even if they seem minor - on a daily basis. Because nothing motivates an electorate more then if they feel like they are being spurned.",
                    "score": 4,
                    "author": "This-is-Redd-it",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "No they fucking don't.\n\nStop with the \"economic anxiety\" bullshit. Just fucking stop. 2016 wants it's journism trope back. \n\nRural voters want to attack minorities, LBGTQIA+, and anyone not in the evangelical religion.\n\nThey don't give two shits weather they live or die, they just wanna take a \"liberal\" with them when they go.",
            "score": 2,
            "author": "Hyperion1144"
        },
        {
            "level": 0,
            "comment": "It was the Clinton strategy to abandon rural areas in the 90s. It made sense for several reasons.\n\n1. They knew NAFTA and WTO were going to destroy small town manufacturing jobs, so they needed to chase other voters.\n2. Bill and Hillary assumed all rural voters were as racist and unreasonable as rural Arkansas. That wasn't necessarily true in the Midwest, where Obama did better than either Clinton.\n3. The interests of the major donors corporate Democrats were chasing and the interests of working-class rural voters are directly opposed to each other. Clinton Democrats chose major donors over traditional Democratic voters.",
            "score": -6,
            "author": "AlwaysOuttaCash",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; They knew NAFTA\n\nAnd by *they,* of course you must mean Reagan and Bush.\n\nhttps://www.investopedia.com/articles/economics/08/north-american-free-trade-agreement.asp",
                    "score": 10,
                    "author": "SeductiveSunday"
                },
                {
                    "level": 1,
                    "comment": "Don't forget Ronald Reagan and Bush Senior. Their policies did far more damage than NAFTA. Gotta go back to the 80s.",
                    "score": 7,
                    "author": "NowThatsAnAdventure"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The gd nerve of these people",
            "score": 1,
            "author": "OnlyFreshBrine"
        },
        {
            "level": 0,
            "comment": "Republicans have tanked the economy. Here's the proof. Oh, you don't believe facts?",
            "score": 1,
            "author": "DawgPound919"
        },
        {
            "level": 0,
            "comment": "So the hillbillies are looking for woke solutions?",
            "score": 1,
            "author": "PackOutrageous"
        },
        {
            "level": 0,
            "comment": "These people have almost no education or understanding about the real world. All they know is God and Guns....\n\nThey on fear and emotion only.\n\nWho gives a fuck what they want.",
            "score": 1,
            "author": "Therocknrolclown"
        },
        {
            "level": 0,
            "comment": "Did these people not vote for Republicans to fix the fucking economy?",
            "score": 1,
            "author": "SpudgeBoy"
        }
    ]
}