{
    "id": "144icie",
    "score": 710,
    "title": "GOP Congressman Says It’s Too Soon to Talk About Climate Change, Amid Raging Wildfires: Stop politicizing the weather, says man whose state is living under an air quality warning.",
    "author": "thenewrepublic",
    "date": 1686252030.0,
    "url": "https://newrepublic.com/post/173398/gop-rep-molinaro-too-soon-talk-climate-change-amid-wildfire",
    "media_url": "https://newrepublic.com/post/173398/gop-rep-molinaro-too-soon-talk-climate-change-amid-wildfire",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Too soon. \n\nLet's not politicize this. \n\nThoughts and prayers. \n\nThe science isn't settled. \n\nMany good people have said...",
            "score": 96,
            "author": "cbsson",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where's the part where they offer bad solutions that pad the pockets of business like folding safe rooms  in classrooms.",
                    "score": 26,
                    "author": "nanixay799",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Later, right after:\n\nIt's a Hoax.\n\nA Witch hunt.\n\netc., etc. ad nauseam",
                            "score": 13,
                            "author": "cbsson"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don’t forget - “Jesus is coming back so do we really care?”",
                    "score": 10,
                    "author": "Maximum_Vermicelli12"
                },
                {
                    "level": 1,
                    "comment": "Something something *weaponized.*",
                    "score": 1,
                    "author": "whoelsehatesthisshit"
                },
                {
                    "level": 1,
                    "comment": "The people screaming, \"This is a hoax!\" deserve to be taken seriously, even if they had to pause twice to catch their breath to do it.",
                    "score": 1,
                    "author": "smurfsundermybed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Too soon to talk about climate change? Did this MFer get his talking points a out gun control and school shootings mixed in with his climate denial talking points?",
            "score": 44,
            "author": "AmrokMC"
        },
        {
            "level": 0,
            "comment": "GOP Rep. Marc Molinaro’s state, New York, has some of the worst air quality in the world right now. Yet he says it’s too soon to talk about climate change.",
            "score": 30,
            "author": "thenewrepublic",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's too soon for them because they are still politicizing a virus...",
                    "score": 19,
                    "author": "AgentRedFoxs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a climate crisis, and if anything it's too late.\n\nIt's not the temp or the sea level, it's the increasingly extreme weather events that we are already experiencing.",
            "score": 16,
            "author": "bytemage",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;it's the increasingly extreme weather events that we are already experiencing.\n\nNo, that's because God is angry at the gays.  And trans in sports.  And kids reading books. /s",
                    "score": 9,
                    "author": "Vlad_the_Homeowner"
                },
                {
                    "level": 1,
                    "comment": "It really is too late. With that new publication coming out saying that the Antarctic summer ice will not be forming this year and for any year after.\n\nWhich just means that the Antarctic ice itself will continue to melt off and there’s nothing we can do about it.",
                    "score": 1,
                    "author": "Duchess0612"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A fellow was stuck on his rooftop in a flood. He was praying to God for help.\n\nSoon a man in a rowboat came by and the fellow shouted to the man on the roof, “Jump in, I can save you.”\n\nThe stranded fellow shouted back, “No, it’s OK, I’m praying to God and he is going to save me.”\n\nSo the rowboat went on.\n\nThen a motorboat came by. “The fellow in the motorboat shouted, “Jump in, I can save you.”\n\nTo this the stranded man said, “No thanks, I’m praying to God and he is going to save me. I have faith.”\n\nSo the motorboat went on.\n\nThen a helicopter came by and the pilot shouted down, “Grab this rope and I will lift you to safety.”\n\nTo this the stranded man again replied, “No thanks, I’m praying to God and he is going to save me. I have faith.”\n\nSo the helicopter reluctantly flew away.\n\nSoon the water rose above the rooftop and the man drowned. He went to Heaven. He finally got his chance to discuss this whole situation with God, at which point he exclaimed, “I had faith in you but you didn’t save me, you let me drown. I don’t understand why!”\n\nTo this God replied, “I sent you a rowboat and a motorboat and a helicopter, what more did you expect?”",
            "score": 24,
            "author": "Minifig81",
            "replies": [
                {
                    "level": 1,
                    "comment": "“He sent you a priest, a rabbi, and a Quaker, Mr. President, not to mention His son, Jesus Christ. What do you want from me?”",
                    "score": 1,
                    "author": "Brunt-FCA-285"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I will never understand the resistance to climate change. I know it’s economic and fossil fuel and business based- BUT there is a lot economic opportunity in renewals. If anything isn’t it worth a shot especially if you can still make money?",
            "score": 8,
            "author": "hdiggyh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Think of climate change in the GOP like polytheism in the Catholic Church.\n\nYou can look around, see that the text talks about a Devil, demons, and angels.  You can see Saints venerated as supernatural and depicted with glowing halos in the stained glass windows.  You can hear sermons that differentiate between a father, his son, and a holy spirit as distinct supernatural entities.  \n\nIf you say \"this is polytheistic,\" you get fired.  You lose your job.  You lose your social standing and connections.  If you say, \"this is clearly a monotheistic religion that we have with only one godlike entity in it\" you are demonstrating faith and loyalty.  If you are loyal, you get to run a church.  People respect you and ask you for help with their problems.  You are important and you get to lead a happy life.  The Catholic church simply isn't a polytheistic organization.  So any sort of argument you might make about that point isn't useful.  It doesn't make your life better.  It doesn't really matter one way or another whether there is any logic to it.  By demonstrating acts of Faith, you prove loyalty and you climb the latter and you live well.\n\nThe GOP no longer functions as a traditional political party.  It just doesn't.  It's an organization built on loyalty above all else.  It's mostly an organization of highly religious people with thing in terms of faith being inherently good.\n\nHelping the economy, helping the planet is all just off the radar inside the org.  It's just about demonstrating loyalty to the GOP by repeating whatever the current messaging is.  As a GOP state rep, you don't personally get rich by mitigating long term insurance rate rise, or lowering climate change related health issues.  And a bunch of the rich backers of the GOP are True Believers.  They got rich, so they must have been doing something right, so they'll keep funding people who support their way of doing things.\n\nWhen you understand the localized power and incentive structures at play, it makes sense.",
                    "score": 6,
                    "author": "wrosecrans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; It's an organization built on loyalty above all else. It's mostly an organization of highly religious people with thing in terms of faith being inherently good.\n\nThis is a tough sell. I know they pander to the religious, but based on their actions, it's hard to actually call them religious. They pray at the alter of power and wealth, and their only deities are the billionaires that pave the way to office...",
                            "score": 4,
                            "author": "ayers231"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate the term “politicizing the weather.” The weather just *is*, and the meteorology and climatology behind it are apolitical sciences. Republicans once again reject truth and insist absolute horseshit they just made up be given equal weight.",
            "score": 8,
            "author": "waterdaemon"
        },
        {
            "level": 0,
            "comment": "I'd love to throw a 'it's too soon to talk about banning drag shows' at one of them.",
            "score": 6,
            "author": "doowgad1",
            "replies": [
                {
                    "level": 1,
                    "comment": "CRT has entered chat",
                    "score": 2,
                    "author": "katholique_boi69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same song and dance they do for mass shootings. \"Now is not the time. Stop politicizing.\" Fuck at least get new excuses for doing nothing.\n\nEdit: A foreign nation could nuke their state and they'd still cry about \"not the time.\"",
            "score": 6,
            "author": "sugarlessdeathbear"
        },
        {
            "level": 0,
            "comment": "The planet is going to be a burning, hazy, stinking rock if these goobers get their way. People need to wake up and stop letting morons just chest thump their way to a horribly bad future.",
            "score": 4,
            "author": "penguished"
        },
        {
            "level": 0,
            "comment": "Too soon to talk about feeding/educating kids (especially all the incoming forced birth ones).\n\nToo soon to talk about guns/mass shootings.\n\nIt's always time to talk about tax cuts!",
            "score": 5,
            "author": "No_Pirate9647",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tax cuts for those who least needed them, at that.",
                    "score": 2,
                    "author": "Maximum_Vermicelli12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. Of course. Let's just wait until the climate calms down, then we'll talk about it.",
            "score": 3,
            "author": "freeski919"
        },
        {
            "level": 0,
            "comment": "We should have been talking about climate change for the last 20 years.  It's not too soon to talk about climate change.  It's too damn late.",
            "score": 3,
            "author": "clueless_in_ny_or_nj",
            "replies": [
                {
                    "level": 1,
                    "comment": "The warnings about future water shortages started in the 1960s.",
                    "score": 3,
                    "author": "Long_Before_Sunrise"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok, let's make it simple. Only states that \"believe in\" climate change qualify for FEMA relief. When you're ready to stop shilling for big oil and big coal, we can talk.",
            "score": 3,
            "author": "ayers231"
        },
        {
            "level": 0,
            "comment": "“We gotta wait until the world is *actually* on fire before we discuss this.”",
            "score": 2,
            "author": "fowlraul"
        },
        {
            "level": 0,
            "comment": "Somebody just received his newest talking points and can’t wait to use them, sounds like",
            "score": 2,
            "author": "Magic8BallLiedToMe"
        },
        {
            "level": 0,
            "comment": "It's inherently political. Assholes like him think enough money will protect him and his family from the world burning so he thinks we should shut up and watch  it burn like sheep. How many places have been laid bare by mega fires in the last few years? I don't seem to recall millions of acres burning in the past but it's the norm now.  Just like All the climate scientists said it would be.  Vote them all out of office and bring sanity back.",
            "score": 2,
            "author": "axebodyspraytester"
        },
        {
            "level": 0,
            "comment": "They're just as anti-science as they were over covid or, going back further, tobacco. They're paid mouthpieces of companies that are going to kill us if they're not stopped.",
            "score": 2,
            "author": "futatorius"
        },
        {
            "level": 0,
            "comment": "So when is it time to talk about climate change when our climate resembles Venus?",
            "score": 2,
            "author": "Grampishdgreat"
        },
        {
            "level": 0,
            "comment": "If you want to take meaningful action on climate, reach out to any friends/family in any of [these districts](https://www.reddit.com/r/citizensclimatelobby/wiki/index/#wiki_finding_your_niche_.28and_key_demographics.29) and ask them to [write their lawmaker](https://citizensclimatelobby.org/get-loud-take-action/energy-innovation-act/).",
            "score": 1,
            "author": "ILikeNeurons"
        },
        {
            "level": 0,
            "comment": "Big Oil. Making your GOP congress member the Best Money Can Buy.",
            "score": 1,
            "author": "jsudarskyvt"
        },
        {
            "level": 0,
            "comment": "GOP Congressman says that his fossil fuels industry donors have ordered him that say it's too soon to talk about climate change.",
            "score": 1,
            "author": "ZafodJustThisGuy"
        },
        {
            "level": 0,
            "comment": "GOP are literally the \"this is fine\" dog.",
            "score": 1,
            "author": "Oalka"
        },
        {
            "level": 0,
            "comment": "the onion is losing their relevance by real news",
            "score": 1,
            "author": "tough_napkin"
        },
        {
            "level": 0,
            "comment": "\"Too soon\"? People trying to trot out these old phrases from other political misdirection campaigns need to shown the door immediately. Like, *you* don't want to talk about it? Fine. Sit down and shut the fuck up.\n\nIt is decades too late to start talking about this. There really is no more pressing issue, or anything that needs more urgency then this.",
            "score": 1,
            "author": "upfromashes"
        },
        {
            "level": 0,
            "comment": "Lmfao it’s over.  Humans are irreparably ignorant.",
            "score": 1,
            "author": "What_Is_The_Meaning"
        },
        {
            "level": 0,
            "comment": "Climate change is not political and does not give a fuck about these tiny bugs called “human”’s political structures.",
            "score": 1,
            "author": "Phallic-Monolith"
        },
        {
            "level": 0,
            "comment": "Don’t look up!!!",
            "score": 1,
            "author": "DeMonet75"
        },
        {
            "level": 0,
            "comment": "This was a \"clever\" albeit wildly wildly immoral thing to say 20-30 years ago. But at this point the evidence is overwhelming, and we are experiencing the effects often.",
            "score": 1,
            "author": "BackAlleySurgeon"
        },
        {
            "level": 0,
            "comment": "He’s right, this is not the moment to start lecturing people about climate change.  That moment was thirty years ago.",
            "score": 1,
            "author": "Charles5Telstra"
        },
        {
            "level": 0,
            "comment": "&gt;stop politicizing the weather\n\nYou first.\n\nThis should never have been a political issue to begin with.",
            "score": 1,
            "author": "Isredel"
        },
        {
            "level": 0,
            "comment": "I live in MI.  My grandkids have CF.  Don’t f’in tell me it’s too soon.  It’s probably too damn late!!",
            "score": 1,
            "author": "PissedOffByStupid"
        },
        {
            "level": 0,
            "comment": "TOO SOON?!! Is he waiting until ice doesn’t fucking exist in the wild???",
            "score": 1,
            "author": "ReturnOfSeq"
        },
        {
            "level": 0,
            "comment": "I just hope Climate Change claims them first.",
            "score": 1,
            "author": "jojvh"
        },
        {
            "level": 0,
            "comment": "I bet if the LBTGQ community became climate deniers, it would be a priority for him and his cronies",
            "score": 1,
            "author": "DubyaWolf"
        },
        {
            "level": 0,
            "comment": "The GOP never wants to discuss the issues",
            "score": 1,
            "author": "walksinthesun"
        },
        {
            "level": 0,
            "comment": "They not too smart those republicanz. Ain’t right in the head. .",
            "score": 1,
            "author": "Educational_Permit38"
        },
        {
            "level": 0,
            "comment": "Too soon. That implies that they think a time will come. But if they can put it off they can fly their private jets and golf the rest of their lives.",
            "score": 1,
            "author": "malakon"
        },
        {
            "level": 0,
            "comment": "Cuz rightwingnuts can’t chew gum and walk at the same time.",
            "score": 1,
            "author": "daspiredd"
        },
        {
            "level": 0,
            "comment": "for the last 30 years you've been saying its not time to act on climate change",
            "score": 1,
            "author": "Traditional_Key_763"
        },
        {
            "level": 0,
            "comment": "“It’s too soon!” - congressmen as they get on their lifeship to antartica.",
            "score": 1,
            "author": "CaptSmallette"
        },
        {
            "level": 0,
            "comment": "Politicizing the weather? FUCK YOU!\n\nWTF do they think the whole petrochemical industry has been doing for the past 30 years?!? \n\nThere are lobbyists who have spent their ENTIRE CAREERS politicizing climate change.",
            "score": 1,
            "author": "snappla"
        },
        {
            "level": 0,
            "comment": "Shall we fire a nuke at the fire? You know, they say fight fire with fire.",
            "score": 1,
            "author": "LiluLay"
        },
        {
            "level": 0,
            "comment": "Too soon. It’s a fifty year old conversation that’s too young to take seriously.",
            "score": 1,
            "author": "fluffybottom"
        }
    ]
}