{
    "id": "144ksm7",
    "score": 302,
    "title": "How the SCOTUS 'Supermajority' is shaping policy on everything from abortion to guns",
    "author": "nosotros_road_sodium",
    "date": 1686257621.0,
    "url": "https://www.reddit.com/r/politics/comments/144ksm7",
    "media_urls": [
        "https://www.npr.org/2023/06/06/1180389289/supreme-court-supermajority-michael-waldman-abortion-guns"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Well, I can answer that one for you.  They're slowly steering us into a Christofascist Oligarchy.   \n\nSimple!  And they're going to keep doing it unless they're stopped.",
            "score": 32,
            "author": "OppositeDifference",
            "replies": [
                {
                    "level": 1,
                    "comment": "And how do you stop someone with a position for life, with no oversight other than their own? lets not pretend they can be impeached by the very people who put them there, to do the very job they are doing..how do you stop that again? Tougher than stopping the y'all Quada in texas, for sure",
                    "score": 14,
                    "author": "blackandbluebehind",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe we don't.\n\nA bunch of folks who were unhappy with their 2016 options decided to \"send a message.\" Message sent? \n\nThose who warned about the severe consequences of playing such a game were told to fuck off.\n\nAnd here we are.\n\nMaybe... This is something to keep in mind for next time. Sometimes winning is impossible, so you just vote not too lose. \n\nIf there is a next time.",
                            "score": 15,
                            "author": "Hyperion1144"
                        },
                        {
                            "level": 2,
                            "comment": "The answer is the same as the Krogans answer to the genophage.  To ignore it. To grow past it, and laugh at the lamentations of their funders, as they see the fruits of their labors turn to folly.   A court that has no basis in justice is not a body that can sustain itself.",
                            "score": 1,
                            "author": "ScionofSconnie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "so you stop it by ignoring it. At least that is what I think you are saying? I am not sure that is a valid way to stop it.",
                                    "score": 1,
                                    "author": "blackandbluebehind"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And getting paid off by billionaires to do it.",
                    "score": 2,
                    "author": "Heelajooba",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Having a justice in your pocket is the new black.",
                            "score": 1,
                            "author": "Tackleberry06"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Gilead 2: Racist Boogaloo",
                    "score": 1,
                    "author": "Bogan_Paul"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A big thank you to Ruth Bader Ginsburg for allowing her pride and arrogance to torpedo at least most of her legacy.\n\n[/s]\n\nIt's kinda like she never served at all.",
            "score": 26,
            "author": "Hyperion1144",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or those in swing states who voted for Jill Stein. Imagine a world where Hillary Clinton got to nominate three new SCOTUS justices, including two replacing Republican seats (Scalia and Kennedy).",
                    "score": 16,
                    "author": "nosotros_road_sodium",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Roe would still exist.",
                            "score": 13,
                            "author": "Hyperion1144"
                        },
                        {
                            "level": 2,
                            "comment": "And the electoral college. Every vote should count equally.",
                            "score": 3,
                            "author": "emo_kid_forever"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "SCOTUS judges are suppose to be independent from playing political games.  She played the game and nothing of value was lost.",
                    "score": -12,
                    "author": "JCuc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Every reputable legal scholar disagrees. The Federalist Society is the most dangerous force working against an entire history of judicial progress.",
                            "score": 3,
                            "author": "jonathanrdt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Every reputable scholar\" = my opinion\n\nLol",
                                    "score": 2,
                                    "author": "JCuc"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like this was a bad time to drop the article",
            "score": 7,
            "author": "AWall925",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nothing was changed. At best they will temporarily maintain the status quo on race while still other rights, environmental protections, and democratic institutions are torn down.",
                    "score": 1,
                    "author": "heroic_cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The court isn't supposed to have policy, though.",
            "score": 2,
            "author": "rebelintellectual",
            "replies": [
                {
                    "level": 1,
                    "comment": "They shouldn't, but Ruth did.  She played politics and well, politics beat her.",
                    "score": 2,
                    "author": "JCuc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh well.  That’s what you get for losing elections.  That’s what you get for nominating a giant turd in 2016.  It’s worked out for the liberal elites anyways though.  They got their massive tax cuts and massive asset appreciation.  Regular folks not so much but they are scum anyways",
            "score": 2,
            "author": "giabollc"
        },
        {
            "level": 0,
            "comment": "Congress can't do what's necessary so the dark money donors took over the courts so they can get what they want. In case you had not noticed it's working. Their goals: End Roe v. Wade. Burn the planet. Proliferate firearms. Cut government services. End taxes on the rich. Funnel money to the one percent. Cut all regulations. The ultimate goal? End democracy. What could possibly go wrong? Vote like your life depends on it.",
            "score": 5,
            "author": "jsudarskyvt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please seek help or at least stay away from social media.  You're in crazy land.",
                    "score": 0,
                    "author": "JCuc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Experiencing a bout of Denial? Or do you just not pay attention and need to look upwards?",
                            "score": 2,
                            "author": "jsudarskyvt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The conservative majority is getting older in the SCOTUS. The Pendulum swings the other way. They set the president of overturning previous SCOTUS decisions. Let this be a learning lesson for future progressive majorities in the SCOTUS. It's sad that we have to go through this but people have to get out there and fucking vote. It sucks to have to hold your nose and pick one of two but that's the system we have.",
            "score": 2,
            "author": "TheIrishbuddha"
        },
        {
            "level": 0,
            "comment": "You mean how greed took over and SCOTUS sold our democracy for personal gain ….",
            "score": 2,
            "author": "TruthandHonorLost"
        },
        {
            "level": 0,
            "comment": "We should ignore them.",
            "score": 0,
            "author": "Maximum_Future_5241"
        },
        {
            "level": 0,
            "comment": "For starters we should do something, anything, about the supreme court’s bribery problem.",
            "score": 0,
            "author": "ReturnOfSeq"
        },
        {
            "level": 0,
            "comment": "So much for three equal branches of government.",
            "score": 1,
            "author": "Icy_Ratio6281"
        }
    ]
}