{
    "id": "1457q6g",
    "score": 1425,
    "title": "Trump case assigned to judge who halted FBI access to some seized documents last year",
    "author": "DarkFlounder",
    "date": 1686323194.0,
    "url": "https://www.washingtonpost.com/national-security/2023/06/09/trump-indicted-charges-classified-documents/#link-WGPCYGUFPNCQLP34BZET6T234M",
    "media_url": "https://www.washingtonpost.com/national-security/2023/06/09/trump-indicted-charges-classified-documents/#link-WGPCYGUFPNCQLP34BZET6T234M",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Meanwhile the judge in the desantis and Disney case recused himself for having a family member with Disney stock.",
            "score": 307,
            "author": "shiftdnb",
            "replies": [
                {
                    "level": 1,
                    "comment": "30 shares by the way. THIRTY. That’s $2,760 as of right now",
                    "score": 131,
                    "author": "FerociousPancake"
                },
                {
                    "level": 1,
                    "comment": "That was because a party moved for it. \n\nThe prosecutors could do the same in this matter if they wanted to",
                    "score": 43,
                    "author": "2ndprize",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, no they didn’t. They asked for recusal for comments during hearings in other cases that had nothing to do with this one.",
                            "score": 26,
                            "author": "shiftdnb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They motioned the court for it. He didn't just make the decision out of the blue.",
                                    "score": 16,
                                    "author": "2ndprize",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But it’s not even a valid reason for doing it and then recused himself for an even dumber reason",
                                            "score": 10,
                                            "author": "shiftdnb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dude took the quick out before he was stuck with a shit show",
                                                    "score": 22,
                                                    "author": "2ndprize",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or put the case in front of a more favorable Republican judge. This is Florida after all, it's all swamp here.",
                                                            "score": 5,
                                                            "author": "Butt-Fart-9617",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Remember the board member that quit a couple weeks ago after his wife was made a judge by Desantis?",
                                                                    "score": 2,
                                                                    "author": "fellatio-del-toro"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Perhaps he didn't want to be at the center of the political shitstorm and this was the best \"out\" he could come up with?",
                                                    "score": 8,
                                                    "author": "Anon22Anon22",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Welp if we’re going to have judges that are afraid of politics over the rule of law then we have certainly failed as a nation.",
                                                            "score": 8,
                                                            "author": "shiftdnb",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We have judges on our Supreme Court guilty of MUCH worse than dodging political cases... that ship sailed long ago",
                                                                    "score": 8,
                                                                    "author": "Anon22Anon22",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Doesn’t mean it’s right. Judges shouldn’t be afraid of being made targets by the defendants and their followers because they have a persecution fetish that could lead them to being targets of violence.",
                                                                            "score": 2,
                                                                            "author": "Paidorgy"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Any potential bias is valid for recusal. That’s the point. The judge could just not personally like desantis or had a bad trip to Disney one time as a kid. Anything he thinks might give him a bias he can’t ignore during trial.",
                                                    "score": 2,
                                                    "author": "AuroraFinem"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How is this not a conflict of interest? “A case being decided by a judge who was appointed by the defendant” seems like an obvious call for recusal.",
            "score": 421,
            "author": "smut_troubadour",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just heard on MSNBC that Judge Reinhart who approved the Mar a Lago raid is also listed on the summons",
                    "score": 135,
                    "author": "Dangerous_Variety_29",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read this as \"Judge Reinhold\" and couldn't help thinking of \"Mock Trial with Judge Reinhold\". Glad it's like, an actual judge, and I'm just an idiot that can't read.",
                            "score": 117,
                            "author": "wizard_of_awesome62",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No shirt, no shoes, NO DICE!\n\nLearn it, know it, live it...",
                                    "score": 31,
                                    "author": "jaggazz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*Something happened to them, man*",
                                            "score": 7,
                                            "author": "Jeff_Spicoli420",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hope you had a hell of a piss, Arnold!",
                                                    "score": 4,
                                                    "author": "standardcapacityman"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Doesn’t anyone fucking *knock*?",
                                            "score": 2,
                                            "author": "chuckangel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I pictured Judd Nelson.",
                                            "score": 2,
                                            "author": "mbmcginnes"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I hope William Hung comes back to do the theme song.",
                                    "score": 23,
                                    "author": "theodoraofalexandria",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mock trial with Judge Reinhold.",
                                            "score": 8,
                                            "author": "spautrievas",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Never met the guy or saw him on any interview show or anything, but he has to be a pretty good guy based on the characters he has played. He has played some classic good, funny guys.",
                                                    "score": 4,
                                                    "author": "ABobby077"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "William Hung's hung jury!",
                                            "score": 3,
                                            "author": "pirategaspard"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "some 2000s flashbacks",
                                            "score": 2,
                                            "author": "habb"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I love Judge Reinhart. She was great on American Idols!",
                            "score": 2,
                            "author": "AnalSoapOpera"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because Republicans have no morals and will do whatever shady shit they want and don’t care what the public thinks.",
                    "score": 6,
                    "author": "AnalSoapOpera"
                },
                {
                    "level": 1,
                    "comment": "A little unprecedented, but I would agree",
                    "score": 16,
                    "author": "hifumiyo1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't think she winds up being the judge, but when have trumps people ever cared about norms, integrity, and doing what's right?",
                            "score": 24,
                            "author": "jagid"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You would think Clarence Thomas would have recused himself from voting for a case involving his wife.\n\nRepublicans have no morals.",
                    "score": 3,
                    "author": "TruthHurts1322"
                },
                {
                    "level": 1,
                    "comment": "First, the, at least, initial appointment of Cannon here is just judicial best practices because she was overseeing the connected civil motions regarding the search, seizure, and inspection of the documents.\n\n\nThen, of course it's not a conflict of interest.  Obviously, cases involving the President are usually civil, but judges rule on cases involving the President who appointed them all the time.  A judge in DC probably has at least one case involving the President who appointed them on their docket at all times until the President leaves office.\n\nAnd it's not just the President involved in judicial nominations.  The President might actually have the least to do with it.  There are many aides and lawyers in and out of the White House, Judiciary Committee staffers, personal staffers for the Senators on the Judiciary, etc. who source candidates and then shepherd nominees through the process.  Marco Rubio presented Cannon to the Trump administration.  Then there are the 57 Senators who voted to confirm Cannon.  Should federal judges recuse themselves from any cases involving any of these people?  And what about the 21 Senators who voted against and the staffers who worked against her?  \n\nAlso, I've never met a judge who felt like they owed their position to a President, or really anybody besides themselves.  They get their assignment and move on with their lives.  This feeling of gratitude and obsequiousness that people, including Trump, imagine judges have is just not a thing.  The world they come from is historical.  They spend their whole lives reading old opinions.  They care more about how their most obscure opinion will stand up to law students reading it in 50 years than they do the President and all of their rulings are going to satisfy their personal judicial philosophy.\n\nMaybe there would be more attention paid to the President and others if they had to ask for reappointment, but that's why the system isn't set up that way.",
                    "score": -5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think she already showed just how much she feels indebted to him when assigned the pointless Special Master in the 1st case.",
                            "score": 19,
                            "author": "Spirit0f76ers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She told the FBI it wasn’t allowed to investigate the documents they seized, despite the national security implications! It was a crazy ruling, and obviously the reason the trump lawyers filed in her particular court,",
                                    "score": 8,
                                    "author": "combustioncat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s a very logical and well-explained reminder about the judicial system. I think it’s different in this context, however, in that presidents aren’t usually sole defendants, their administrations are sued.",
                            "score": 5,
                            "author": "smut_troubadour",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right, so if you're looking for conflicts of interest, (again, I don't think any of this is a conflict of interest for the reasons I explained, but if you feel like you need to find one) it would actually be in cases involving incumbent Presidents because the administration gets judges confirmed, not just the President.  Presidents just sign off on lists made by their aides and other peoples' aides.  If you're a lawyer in the White House, you could be working on a judge's confirmation in January and then writing a brief to be read by that judge in July.  You could be working on a judge's confirmation in January and then challenging a congressional subpoena for yourself in front of that judge in July.  A President's personal connection to a judge they appointed is tangential, not grounds for recusal.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Potential conflict aside,  federal cases are generally pretty airtight with 95% conviction rates. Toss in Trump continually provides evidence that will be used against him. It is hard to see any path that doesn't lead to conviction.  Best they can do is delay, which is why the lawyers have quit or been fired. He will drag it out for years.",
                                            "score": 4,
                                            "author": "ToastTurtle"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "former president* aka citizen",
                            "score": 10,
                            "author": "stuartdenum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The only time I referred to Trump was as a citizen\n\n&gt;This feeling of gratitude and obsequiousness that people, including Trump, imagine judges have is just not a thing.",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There’s a vast ocean of difference between a case “involving” a president, and a case against a president.",
                            "score": 1,
                            "author": "DanimusMcSassypants"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Who the *FUCK* was dumb enough to assign this case to the same judge who was overturned TWICE?",
            "score": 72,
            "author": "Ghost_of_Till",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, that's the bigger concern here IMO. No way in hell this was anything but an intentional effort to help the fat bastard. The cockroach that chose her needs to be viewed under a spotlight.",
                    "score": 42,
                    "author": "tourettes_on_tuesday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see it as a good thing\n\nIt removes a major appeal argument they might have. This judge will bend over backwards to give Trump the rulings he wants. Then those rulings will be overturned on appeal. That removes Trumps ability to appeal the ruling that will ultimately be in place.\n\n3D Chess\n\nThe only downside is it'll make this trial last two years.",
                            "score": 31,
                            "author": "DarkwingDuckHunt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It will only last two years if he loses the election. If he wins and this hasn't been concluded it will be shut down and he will escape all consequences",
                                    "score": 6,
                                    "author": "DavrosRising"
                                },
                                {
                                    "level": 3,
                                    "comment": "To my knowledge most states don’t allow for criminal prosecutors to make appeals, I am guessing federal courts are the same but maybe not.",
                                    "score": 2,
                                    "author": "Wallace_of_Hawthorne",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How were the previous rulings by this judge in trumps favor appealed then?",
                                            "score": 2,
                                            "author": "Techiedad91",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Because it wasn’t part of a trial?",
                                                    "score": 1,
                                                    "author": "B0bTh3BuiIder"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Only if DeSantis loses the primary",
                                            "score": 1,
                                            "author": "BoltTusk"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I actually think Aileen Cannon could prove to be Trump's worst nightmare. She will be warned that her every action will be scrutinized to the nth degree and this is her only shot at rehabilitating her reputation. She's smart enough to know that her shit won't fly this time around and Trump's goose is cooked anyhow.",
                    "score": 0,
                    "author": "No-Menu-2524",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She got overturned twice. \n\nWhich means she knew she was under a microscope and did it again.",
                            "score": 10,
                            "author": "Ghost_of_Till",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah. She shouldn’t even be holding office after that bullshit she tried to pull.",
                                    "score": 3,
                                    "author": "AnalSoapOpera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Now, she has to decide if she wants to fall on the sword for Trump.. or continue her career as a Judge. Either way, her place in history is secured.",
                                            "score": 4,
                                            "author": "frogking"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://twitter.com/joycewhitevance/status/1667166126881619969?s=46&amp;t=eFj6P2vDwhcuzdM2oX6lAQ",
            "score": 48,
            "author": "Sungreenx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Joyce and Preet are on the case",
                    "score": 7,
                    "author": "nevus_bock"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hot Take: Case is brought in Florida supposedly so Trump’s lawyers can’t argue the venue and waste time. Now the case is assigned to a Trump appointee judge - if nothing else, this will keep Trump’s lawyers from arguing over the judge and wasting time. If the case being brought against Trump is airtight, Cannon may not be able to help Trump here, and a conviction would be more convincing to Trump’s supporters.",
            "score": 110,
            "author": "seanbeedelicious",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can't convince them of anything.  They'll say the democrats paid off the judge (and that's somehow lays guilt on the democrats and not the corruptible judge). They'll call the judge a RINO, etc, etc, etc.  We've seen it all for years now.",
                    "score": 72,
                    "author": "jagauthier",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, that's why appeasement doesn't work. Stop trying to cater to and appease them",
                            "score": 45,
                            "author": "a_corsair",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For real. The opinion of trump supporters is completely meaningless.",
                                    "score": 21,
                                    "author": "Dyspaereunia"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's always something with these clowns.",
                            "score": 7,
                            "author": "Frankenmuppet"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 27,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even if she does act like a partisan hack it doesn't matter. It'll get appealed for the next *X* years all the way to the top no matter what happens.",
                            "score": 11,
                            "author": "drewthepirate"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like the thought process. I think you’re right whatever Smith has is so airtight that once public it won’t matter who the judge is.",
                    "score": 15,
                    "author": "RallyHound",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But that doesn't matter though. There could be video of Trump holding up the documents and bragging about how they were secret and he stole them and wasn't going to give them back, and she'd look right in the camera and throw the case out with a smile on her face. We're not dealing with normal reality anymore.",
                            "score": 8,
                            "author": "binkkit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a fair and legitimate concern. The cult factor can’t be ignored. \n\nThe indictment is air tight though, have you read it yet? Her interfering in the case for procedural grounds would only delay things, not fully stop them.",
                                    "score": 5,
                                    "author": "RallyHound",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh I agree it should happen! I just feel like we can't count on anything with these people.",
                                            "score": 1,
                                            "author": "binkkit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Couldn't she give Trump a slap on the wrist sentence if he's convicted?",
                                            "score": 1,
                                            "author": "zzxxccbbvn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Theoretically, within the sentencing guidelines. Which based on other recent document retention cases isn’t nothing. Not nothing x 37 = a lot of something. \n\nHonestly though a pic of her at a trump rally in face paint just surfaced (or maybe re-surfaced and I had missed it in the past) .There’s no way she’ll be the judge who actually hears the case.",
                                                    "score": 5,
                                                    "author": "RallyHound",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Where can I find this photo?",
                                                            "score": 1,
                                                            "author": "904Pens",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well following up on that , I just read this AM that the story isn’t true and it’s not her in the photo…..I can’t find that link atm but it appears I was spreading false info , if I come across it again I’ll post it.",
                                                                    "score": 1,
                                                                    "author": "RallyHound"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol. The truth ended up being pretty close to your comment.\n\nAudio, not video. But same basic premise.",
                                    "score": 2,
                                    "author": "Knosh"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;If the case being brought against Trump is airtight, Cannon may not be able to help Trump here\n\nWhile I'm not an Eeyore doomer like you see a lot here regarding Trump, I honestly have to say that was the thought this last time in the documents case and she (Cannon) went and surprised everyone.  I'm hoping for recusal here.",
                    "score": 24,
                    "author": "Ghstfce",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think there’s a 0% chance Cannon is the judge on this one. If she doesn’t voluntarily recuse herself (which would be surprising in its own right after the last verbal lashing she got from the appellate court) then Smith and the DoJ have options and an extremely solid argument for getting a new judge. But honestly, I don’t think Cannon is willing to go down this road again.",
                            "score": 28,
                            "author": "MrCrowley1984",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm confident you hit the nail on the head here.  Finger crossed anyway though to hedge the bets.",
                                    "score": 11,
                                    "author": "Ghstfce"
                                },
                                {
                                    "level": 3,
                                    "comment": "Regardless of everything else, she does not even have enough experience for this type of case.",
                                    "score": 2,
                                    "author": "ontopofyourmom"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is brought in Florida because that's where defendant resides and where the offense was committed. The government filed the complaint, where the fuck else? Maine?",
                    "score": 8,
                    "author": "GhettoChemist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The offenses were also committed in DC, since they started the second those documents left the SCIF.",
                            "score": 7,
                            "author": "TeutonJon78",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "DDC isn't a rocket docket court. Trump has already announced candidacy for a new election and going with a slower court like DDC risks having way too many motions drag this past Election Day 2024. In the chance something were to occur these months and he be reelected, he could attempt to purge the courts of their personnel or request a pause to proceedings as he makes nominations for replacement judges and pull some yet other trick the likes of what McConnell did with Garland.",
                                    "score": 1,
                                    "author": "reachouttouchFate"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm skeptical this all isn't political theater:\n\nBecause the Democatric base wants a pound of flesh, the Dems (and by extension, the DOJ) route this through Florida (with a backdoor deal that Trump will get let off &amp; slink away).  The hack judge neuters the case &amp; Trump walks.  Dems can say \"whelp, we tried.\"  Reps don't get dragged through the mud.  Trump avoids prison food.  And the public is stuck going WTF -- like we always are.\n\nEdited to clarify that I'm 100% for Trump getting justice.. I'm just skeptical/jaded because there NEVER seems to be consequences for the powerful and/or affluent.  Remember how Nixon skated?",
                    "score": -9,
                    "author": "CloudsGotInTheWay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nixon skated in exchange for resigning from the presidency. Stop being a doomer.",
                            "score": 1,
                            "author": "ontopofyourmom"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Quite the risk to take when democracy literally hangs in the balance.",
                    "score": 1,
                    "author": "psufan5"
                },
                {
                    "level": 1,
                    "comment": "Same lawyers who just resigned?",
                    "score": 1,
                    "author": "SkollFenrirson"
                },
                {
                    "level": 1,
                    "comment": "Is the judge the one deciding the sentencing in this case?",
                    "score": 1,
                    "author": "ckal09"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Serious question: His lawyers are obviously going to try to get this thrown out immediately for some stupid reason. Does Cannon have the power to do that? If so, what options does the DOJ have after that?",
            "score": 10,
            "author": "kg_digital_",
            "replies": [
                {
                    "level": 1,
                    "comment": "1) yes, Cannon will hear a motion to dismiss the indictment.\n\n2) DOJ can do what every litigant does: oppose the motion.\n\n3) If Cannon dismisses the indictment (and I don't think she will -- granting a stay of a special master order is far different than dismissing the first federal prosecution against a president), DOJ can appeal it to the 11th Circuit. That was the appellate court that was hostile to Cannon's original decision.",
                    "score": 25,
                    "author": "Guhonda",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That overturned *both* of her rulings with 🔥🔥🔥scathing rebukes",
                            "score": 17,
                            "author": "SiWeyNoWay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And who she doesn’t want to cross again so soon as it would be grounds for a lot of investigations and potential ethics violations.",
                                    "score": 6,
                                    "author": "SpiritOfSpite",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Republicans and Ethics. \n\n\nYeah. I don’t think they really care about ethics or how they look.",
                                            "score": 1,
                                            "author": "AnalSoapOpera",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ethical issues will result in a person losing their ability to practice law. This isn’t political pretend ethics, these are stratified ethical requirements that are required to be held to to stay in good standing with the bar",
                                                    "score": 1,
                                                    "author": "SpiritOfSpite"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for explaining this! I’ve been searching for info for over an hour, and watching news coverage and yet didn’t find an answer this clear",
                            "score": 3,
                            "author": "PaigeforWellness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My pleasure.  Law is hard.  And so is explaining stuff, so let me clarify #1.  Cannon will hear a motion to dismiss the indictment **if Trump files one** and if **she remains the judge in the case**.  Neither is a guarantee. Although I don't agree with some of the analysis I've seen out there suggesting that Cannon must recuse.",
                                    "score": 2,
                                    "author": "Guhonda"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They can appeal and much like last time they will win that.",
                    "score": 3,
                    "author": "Purplebuzz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I understand that the assignment of the case to her was purely random, but anyone who thinks she is or can be or will be impartial is living in a fantasy world.",
            "score": 11,
            "author": "amoshart",
            "replies": [
                {
                    "level": 1,
                    "comment": "She did get repeatedly overruled by the appellate court, so she may be more cautious not to look like a complete hack this time, but that also might be my wishful thinking…",
                    "score": 4,
                    "author": "silverbeat33"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Judge that committed actionable Obstruction under color of authority, given chance to do it again, in the same case.",
            "score": 9,
            "author": "JubalHarshaw23"
        },
        {
            "level": 0,
            "comment": "Good news is the Judge is not the trier of fact.  That is for the jury to decide.  The Judge just calls the balls and strikes.  But I agree, definitely a conflict of interest and needs to recuse.",
            "score": 46,
            "author": "TheCredibleHulk7",
            "replies": [
                {
                    "level": 1,
                    "comment": "The judge also chooses when to allow people to talk in their court. They can give more time to one party or the other. They can sway the way the jury thinks. \n\nTake Kyle Rittenhouse the murderer.  The judge did not allow his victims to be referred to as victims, but as looters and rioters.",
                    "score": 3,
                    "author": "TruthHurts1322"
                },
                {
                    "level": 1,
                    "comment": "But the judge could dismiss the case, thereby eliminating the need for a jury.",
                    "score": 16,
                    "author": "Fit-Firefighter-329",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is a mountain of evidence against him.  This is not getting dismissed.",
                            "score": 33,
                            "author": "TheCredibleHulk7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If found guilty doesn't she decide sentencing??? Couldn't she suspend the sentence?",
                                    "score": 14,
                                    "author": "infiniteimperium",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She does decide sentencing.  Possibly could suspend it but in all honesty, I think that may be likely regardless of the judge given that he’s a former president.",
                                            "score": 10,
                                            "author": "TheCredibleHulk7",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So then what are we even doing here? 😑",
                                                    "score": 17,
                                                    "author": "infiniteimperium",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Theater for the sake of theater?",
                                                            "score": 2,
                                                            "author": "Wallace_of_Hawthorne"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Going through the motions...",
                                                            "score": 1,
                                                            "author": "MyPasswordIs222222"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Given she has already involved herself in one Trump case when she was not to, can't that be used against her to say there has to be other available judges within that circuit to be chosen in lieu of her until all these judges eventually have had at least one exposure to his proceedings and then perhaps shuffle her back in as a possibility?",
                                                    "score": 3,
                                                    "author": "reachouttouchFate"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nobody is above the law.",
                                                    "score": 5,
                                                    "author": "jmcdon00",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Trump seems to be...",
                                                            "score": 4,
                                                            "author": "Fit-Firefighter-329"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Federal sentencing guidelines are very specific to prevent judges from different states doing whatever they want. She could not follow them but she would be removed and he would likely be resentenced immediately as an improper sentence isn’t enforceable. If they could make a case that be influenced her in anyway, they could tack that on too. The GOP made sure of that to prop up their war on ~~minorities and voting~~ drugs.",
                                            "score": 3,
                                            "author": "SpiritOfSpite"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That assumes they can find a Florida jury that'll convict him. Maybe a tall order.",
                                            "score": 11,
                                            "author": "BGOOCHY"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How badly can she ratfuck things just through other discretionary decisions?\n\nI'm imagining the impeachment conviction hearing in the Senate that were a farce since mitch designed them to be",
                    "score": 2,
                    "author": "DM_me_ur_tacos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's going to be funny watching Trump attack a judge he appointed.",
            "score": 7,
            "author": "Hayes4prez"
        },
        {
            "level": 0,
            "comment": "How DOJ responds to this will tell us a lot. If they don't make any moves to force her to recuse, that sends a pretty strong signal: they think their case is so air-tight that not even an unfavorable judge can fuck with it.",
            "score": 27,
            "author": "Das_Man",
            "replies": [
                {
                    "level": 1,
                    "comment": "The problem is that she is not a judge.  She is a politician.  Just like the majority of assholes on the Supreme Court.  They don't care about anything except power and who makes profit.",
                    "score": 9,
                    "author": "thegooseisloose1982"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The DOJ had to do this. Trump is going to attack the judge no matter who it is... this way he looks foolish.",
            "score": 6,
            "author": "Hayes4prez"
        },
        {
            "level": 0,
            "comment": "lol… she was such a hack.",
            "score": 15,
            "author": "RufusDuSolstice",
            "replies": [
                {
                    "level": 1,
                    "comment": "She IS such a hack!",
                    "score": 11,
                    "author": "Fit-Firefighter-329"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How the fuck is that even possible? What fucking dumbass gave the trump case to the one judge who all but said \"trump is untouchable and hes innocent\"? I hope they can ask for a new judge or something",
            "score": 5,
            "author": "internetbrowser23"
        },
        {
            "level": 0,
            "comment": "It won’t matter.  The appeals court will keep her in check.  Trump isn’t going to win anyway.  Schedule away.",
            "score": 5,
            "author": "ramencents"
        },
        {
            "level": 0,
            "comment": "This is why I can't bring myself to be hopeful that any of this will lead to any sort of justice.",
            "score": 39,
            "author": "_Murderapolis_",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’s one of a few judges in that district where the jurisdiction lies. It’s tough to get around that part",
                    "score": 12,
                    "author": "hifumiyo1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah she was appointed to that district for these reasons, to run interference for Trump",
                            "score": 28,
                            "author": "RowanIsBae"
                        },
                        {
                            "level": 2,
                            "comment": "Why does the district,where they finally found the documents, matter? Shouldn’t a trial take place where they were taken from? That’s where the crime was committed right?",
                            "score": 0,
                            "author": "Victory33",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, the jurisdiction is typically where the crime took place or the location of the prosecution , which in this case is florida",
                                    "score": 2,
                                    "author": "hifumiyo1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not terribly worried about this. She couldn’t save him then, and she can’t save him now.",
            "score": 14,
            "author": "sil863",
            "replies": [
                {
                    "level": 1,
                    "comment": "Assuming it's tried in Florida, the jury pool is far more concerning than Cannon.",
                    "score": 12,
                    "author": "Vlad_the_Homeowner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The grand jury who voted to indict him was made up of Floridians",
                            "score": 9,
                            "author": "mattyjhiggs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, I know, but a grand jury doesn't have to be unanimous to indict.",
                                    "score": 4,
                                    "author": "Vlad_the_Homeowner"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly think this is a good thing? I'm sure there's some way for the DoJ to get a change of presiding  judge. Instead of getting assigned someone who's probably a federalist society hack, who would quietly swing the trial to trump however they can, they got Captain Crazy Pants, who already tried to invert the legal system to protect trump, and got unanimously smacked down by a conservative majority judicial panel. This gives them a much stronger case to appeal, in my mind",
            "score": 20,
            "author": "Darth_drizzt_42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here.",
                    "score": 3,
                    "author": "accountabilitycounts"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm wondering if this was actually a deliberate choice.  If this is the judge running the show, it will be pretty hard for the right to say Trump didn't get a fair shake. That could make sense if the prosecutors are overwhelmingly certain they have an airtight case. \n\n\nIf it's not something like that, then this is absolutely terrible luck or fuckery.",
            "score": 8,
            "author": "OppositeDifference",
            "replies": [
                {
                    "level": 1,
                    "comment": "It still worries me. Judges can have a lot of influence on everything, including the timeline of different elements of the case. Yes, if something really out there happens they can absolutely appeal but that ends up delaying things more and only helps trump. \n\nI’m cautiously optimistic that they know what they are doing but the level of fuckery that the right is willing to go to still makes me nervous",
                    "score": 6,
                    "author": "Paw5624",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She can and will declare a mistrial , she’ll withhold evidence and all sorts of fuckery.",
                            "score": 1,
                            "author": "bt2184"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; I'm wondering if this was actually a deliberate choice. \n\nWhy appease terrorists who are going to cry \"witchhunt!\" no matter what? I think the DoJ is too smart for that. They're playing it straight and avoiding PR considerations as much as possible.",
                    "score": 5,
                    "author": "NotEveryoneIsSpecial",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I don't get anyone who for the last 8 years has been pushing for appeasing republicans to avoid being called biased",
                            "score": 2,
                            "author": "netrunui"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a deliberate choice, both judges that oversaw the first part of this were selected to oversee the second part. She was chosen because this is a continuance of the case she was already overseeing.",
                    "score": 3,
                    "author": "Ellimistopher"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's just for his arraignment.....",
            "score": 8,
            "author": "Tothewallgone"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who does the \"random\" selection?",
                    "score": 1,
                    "author": "netrunui",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Believe it or not, they actually spin a wheel (at least they used to) to randomly assign cases.  But I haven’t seen anything to indicate that this has happened yet?  Wondering if she’s listed (along with the special master judge) because they participated in the previous proceedings?",
                            "score": 3,
                            "author": "kochbrothers"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aileen was openly corrupt and admonished by the appeals court for exceeding her justification.\n\nShe’s a joke.",
            "score": 3,
            "author": "EminentBean"
        },
        {
            "level": 0,
            "comment": "That’s a travesty she is not competent and one wonders if she got that job by dropping a brown bag at Mar-a-Lago.",
            "score": 3,
            "author": "Good_Intention_9232"
        },
        {
            "level": 0,
            "comment": "I'm sure this Trump appointed Judge will be fair and unbiased. /s",
            "score": 9,
            "author": "TheKexia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just like she was during the special masterbation bullshit.",
                    "score": 1,
                    "author": "Sethmeisterg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did this happen?",
            "score": 2,
            "author": "BerryExpensive"
        },
        {
            "level": 0,
            "comment": "like who has this power to assign judges??",
            "score": 2,
            "author": "daj0412",
            "replies": [
                {
                    "level": 1,
                    "comment": "I caught some of the news this am - it’s a super small pool of judges in that district (or whatever it’s called) so the chances of her being assigned were high going into this. \n\nHowever, 2 scathing rebuke from the 11th circuit is problematic for her to proceed as the judge of this case and gives the prosecution some solid meat to have her removed \n\nSo I guess… more to be revealed",
                    "score": 7,
                    "author": "SiWeyNoWay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that’s so interesting… thanks for the info",
                            "score": 2,
                            "author": "daj0412"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is some bullshit",
            "score": 2,
            "author": "habb"
        },
        {
            "level": 0,
            "comment": "I hope that anyone who aids trump knows that they are putting themselves in legal or career jeopardy.  She would be super dumb to do things on his favor that are no objective at this point. He is loyal to no one. Why are they loyal to him ? I don’t get it",
            "score": 2,
            "author": "kaaikala"
        },
        {
            "level": 0,
            "comment": "Please……….Lock him up",
            "score": 2,
            "author": "gent4you"
        },
        {
            "level": 0,
            "comment": "This is US Justice. Just now becoming pubicly obvious",
            "score": 4,
            "author": "topcomment1"
        },
        {
            "level": 0,
            "comment": "The crimes took place in Washington DC. That should have been the venue.\n\n.",
            "score": 1,
            "author": "hamilton_burger"
        },
        {
            "level": 0,
            "comment": "Lmfao you really gotta love the decisions of the people who are suppose to know what's best  /s",
            "score": 0,
            "author": "JoeyCrakk"
        },
        {
            "level": 0,
            "comment": "Of fucking course it did.",
            "score": 0,
            "author": "soyboyconspiracy"
        },
        {
            "level": 0,
            "comment": "Come on, we all expected this twist in the plot didn’t we?",
            "score": 1,
            "author": "SetterOfTrends"
        },
        {
            "level": 0,
            "comment": "Upping the ante huh Jack? Love it.",
            "score": 1,
            "author": "scottywoty"
        },
        {
            "level": 0,
            "comment": "I wouldn’t want to be on that jury.",
            "score": 1,
            "author": "kmurp1300"
        },
        {
            "level": 0,
            "comment": "Lock scum up. Lock scum up. Do not underestimate r / dumbcons getting all school shootery over this. The dumb con is not the most intelligent of amoebas.",
            "score": 1,
            "author": "seanosul"
        },
        {
            "level": 0,
            "comment": "Baby hands",
            "score": 1,
            "author": "MaineDreaming"
        },
        {
            "level": 0,
            "comment": "No matter what this is going to be appealed so all this is going to do a stall",
            "score": 1,
            "author": "flirtmcdudes"
        },
        {
            "level": 0,
            "comment": "This fucking nutjob.",
            "score": 1,
            "author": "AnalSoapOpera"
        },
        {
            "level": 0,
            "comment": "Why",
            "score": 1,
            "author": "AmericaRunsOnKillin"
        },
        {
            "level": 0,
            "comment": "Maga Judge",
            "score": 1,
            "author": "WaitingFor45sArrest"
        },
        {
            "level": 0,
            "comment": "Were these the documents in the garage?",
            "score": -7,
            "author": "ProverbsC3H8",
            "replies": [
                {
                    "level": 1,
                    "comment": "No these are the ones the other guy had and exerted numerous efforts to obstruct the government from getting them back.",
                    "score": 4,
                    "author": "surrealtom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, nothing like corrupted pedophiles gumming up the works",
                            "score": -1,
                            "author": "ProverbsC3H8"
                        }
                    ]
                }
            ]
        }
    ]
}