{
    "id": "1457r5p",
    "score": 3630,
    "title": "Rep. Raskin: Trump has transformed Lincoln's party; he runs it like a religious cult",
    "author": "Incunebulum",
    "date": 1686323261.0,
    "url": "https://www.msnbc.com/morning-joe/watch/rep-raskin-trump-has-transformed-lincoln-s-party-he-runs-it-like-a-religious-cult-181374021944",
    "media_url": "https://www.msnbc.com/morning-joe/watch/rep-raskin-trump-has-transformed-lincoln-s-party-he-runs-it-like-a-religious-cult-181374021944",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Trump definitely transformed the party into a cult, but it had stopped being \"Lincoln's party\" many, many moons ago.",
            "score": 518,
            "author": "pragmatic_zealot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Around Goldwater/Nixon. Another thing to remember is the Roe V Wade ruling was made by a Republican-controlled Supreme Court.",
                    "score": 65,
                    "author": "danmathew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, Goldwater's stink is all over that whole mess since he came up with the \"Southern Strategy\" which was literally a plan to use the racism of southern Democrats to get them to switch parties.",
                            "score": 40,
                            "author": "pragmatic_zealot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They made us read Conscience of the Conservative for AP Government. All I saw was the lack of conscience in action.",
                                    "score": 17,
                                    "author": "olivebranchsound"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well that lines up with Protestants voting Republican. Abortion used to be much more of a Catholic issue which largely voted Democrat back then.",
                            "score": 9,
                            "author": "pilsner9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think you're conflating Protestants with Evangelicals. To my knowledge, non-evangelical Protestants don't have an abortion stance and Evangelicals didn't oppose abortion until the late '70s.",
                                    "score": 4,
                                    "author": "danmathew",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m not conflating them and then what you added seemed to prove my point. Also, evangelicals are Protestants, but not all Protestants identify as evangelical",
                                            "score": 2,
                                            "author": "pilsner9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Also, evangelicals are Protestants, but not all Protestants identify as evangelical\n\nThat's my point.",
                                                    "score": 0,
                                                    "author": "danmathew"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It is a grievous insult to Lincoln to call today's Republican party \"Lincoln's Party\".",
                            "score": 2,
                            "author": "Zealzew"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hasn't been since the 80s\n\nThe 1880s",
                    "score": 19,
                    "author": "Britton120"
                },
                {
                    "level": 1,
                    "comment": "It was a cult beforehand. Or has everyone conveniently forgotten the Reagan worship and the Tea Party?",
                    "score": 10,
                    "author": "foil_gremlins_r_real",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Newt Gingrich and Rush Limbaugh were a big part of that.",
                            "score": 9,
                            "author": "Big_Baby_Jesus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bingo.  Newt didn't just leave all the propaganda to Rush though, he was constantly in the limelight and was himself, a minor deity in the big republican monster manual.",
                                    "score": 3,
                                    "author": "Robinhood4real"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ideology is a hell of a drug",
                            "score": 2,
                            "author": "MidwestRed9"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would you say they are \"RINOs\"?",
                    "score": 33,
                    "author": "whiterhino1982",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now, I'd say they're basically bigoted facsist morons. There was a time when I disagreed with Republican politics and tactics, but could respect some of them. Now, if I see you're a Trump supporter I question your intelligence and ethics right off the bat.",
                            "score": 80,
                            "author": "pragmatic_zealot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Only three types of people vote republican.  Fascists, allies of fascists, and people too stupid to realize they are part of the first two categories.",
                                    "score": 45,
                                    "author": "DASTARDLYDEALER",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Only three types of people vote republican.  Fascists, allies of fascists, and people too stupid to realize they are part of the first two categories.”\n\nNot in a cult\n\n“Only three types of people vote Democrat.  Socialists, allies of socialists, and people too stupid to realize they are part of the first two categories.”\n\nIn a cult \n\nKnow the difference",
                                            "score": -39,
                                            "author": "MarcoPierreGray",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The Democrat party as a whole isn't even *remotely* socialist, so you're not making a very good point.",
                                                    "score": 20,
                                                    "author": "NotUniqueOrSpecial",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They never do",
                                                            "score": 11,
                                                            "author": "Open_Action_1796"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That wasn’t the point I was making; the point is “fascist” republicans say the same exact thing with fascism swapped out for socialism.",
                                                            "score": 1,
                                                            "author": "MarcoPierreGray",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ah, gotcha. Sorry for the confusion.",
                                                                    "score": 2,
                                                                    "author": "NotUniqueOrSpecial"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just because they don’t know what the word fascist means",
                                                                    "score": 1,
                                                                    "author": "whereismymind86"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Wow Marco, you really thought you had something there",
                                                    "score": 5,
                                                    "author": "RulerofReddit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 0,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "*you’re",
                                                                    "score": 1,
                                                                    "author": "RulerofReddit",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You really are the RulerofReddit",
                                                                            "score": 0,
                                                                            "author": "MarcoPierreGray",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Indeed\n\nWell it was embarrassing enough for you to delete your comment, so I guess it did the trick lol",
                                                                                    "score": 1,
                                                                                    "author": "RulerofReddit",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, my statement is accurate, yours is a false equivalent.",
                                                    "score": 2,
                                                    "author": "DASTARDLYDEALER",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What statement am I making genius?",
                                                            "score": -2,
                                                            "author": "MarcoPierreGray"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You don’t have to question. If they are a Trump supporter I know they are either incredibly unintelligent, evil, or both. There are no redeeming qualities at this point.",
                                    "score": 15,
                                    "author": "DancesInTowels",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, I agree. We had a few good friends that we enjoyed &amp; respected. \n\nThen Trump came along. When we discovered these “friends” supported Trump, we polity disengaged. (We could NOT fathom being friends with people who were either “very gullible” or “very selfish”.)",
                                            "score": 2,
                                            "author": "MiepGies1945"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's fascinating to me how far gone some people are.\n\nBefore I was the same I might disagree with you but hey world needs all types now if a conservative *thinks* you disagree with them it's the world's biggest problem",
                                    "score": 3,
                                    "author": "Buffmin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "honestly? the republicans really are republicans in name only\n\ntheres a lot of push to reduce the impact of democracy and increase executive powers from the republican side",
                            "score": 4,
                            "author": "SeiCalros"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree. He simply made it beyond a reason of a doubt that it was long dead. Which we gotta at least acknowledge him for.",
                    "score": 1,
                    "author": "Das-Noob"
                },
                {
                    "level": 1,
                    "comment": "For real! Learning about Thaddeus Stevens recently really showed me how much the Republican Party has changed since their day.",
                    "score": 1,
                    "author": "breezy013276s"
                },
                {
                    "level": 1,
                    "comment": "It never was, flipping the parties doesn’t give them claim to everything the liberal party did prior to the name change",
                    "score": 1,
                    "author": "whereismymind86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Lincoln's party\" has waved Confederate flags for *decades.*",
            "score": 118,
            "author": "CAESTULA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Since at least the early 1960s.",
                    "score": 25,
                    "author": "danmathew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What we call the \"confederate flag\" (and isn't) was popularized by the segregationist Dixiecrat Party in 1948. Look at pictures of any pro-segregation event. Everyone has those flags.",
                            "score": 9,
                            "author": "Big_Baby_Jesus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's the same year the Armed Forces were desegregated.",
                                    "score": 3,
                                    "author": "SanguShellz"
                                },
                                {
                                    "level": 3,
                                    "comment": "Just to save me some research, what is the accurate term? Dixiecrat flag?",
                                    "score": 1,
                                    "author": "lawofficeofbobloblaw",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's the battle flag of Lee's Army of Northern Virginia. It features prominently in Gone With The Wind, and people thought it was the main confederate flag. The real confederate flag is a shitty knock off of the US flag. Same basic design with fat stripes.",
                                            "score": 3,
                                            "author": "Big_Baby_Jesus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It isn't even that. The battle flags of the Army of Northern Virginia were square, not rectangular. The modern Confederate treason rag was specifically brought about during the Civil Rights Movement.",
                                                    "score": 3,
                                                    "author": "CAESTULA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It is actually the 2nd confederate naval jack.\nNot many people realize that because the Confederacy did not have much of a navy and what they did have wound up on the bottom pretty quick.",
                                                            "score": 1,
                                                            "author": "jar1967"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stop calling it the party of Lincoln. It hasn’t been that since the southern strategy.",
            "score": 77,
            "author": "thelazyanzellan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or the Teddy Roosevelt administration",
                    "score": 9,
                    "author": "dhuntergeo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think Teddy didn’t find himself fitting squarely in the Republican Party either. Bull Moose and all that",
                            "score": 8,
                            "author": "pilsner9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. Trust busting was trending away from the Republicans at the time!",
                                    "score": 2,
                                    "author": "dhuntergeo"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly when republicans didn't support the Voting Rights Act in 1965 is really when they transformed Lincoln's party.",
            "score": 184,
            "author": "GratefulPhish42024-7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. Democrats used to be the ones carrying the Confederate Flags. Now it's the Republicans.",
                    "score": 80,
                    "author": "GoatboyTheShampooer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is why trying to frame stuff as \"the party of Lincoln\" or \"democrats were the ones fighting for slavery\" is pointless. Defining things by values is much more accurate. Conservatives fought for slavery. Progressives fought to overthrow it. etc",
                            "score": 79,
                            "author": "SekhWork",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I always say when they keep bringing up the party of Lincoln. I say “Okay, so who is constantly flying the traitor rebel flag nowadays?”",
                                    "score": 27,
                                    "author": "DancesInTowels"
                                },
                                {
                                    "level": 3,
                                    "comment": "The racist Democrats of the 50s _abandoned the Democrat Party_ because the D's weren't racist enough, and Republicans were happy to embrace them. The culminated in Nixon's \"southern strategy\" which amounted to \"embrace the confederate flag waving racists.\"",
                                    "score": 20,
                                    "author": "StephanXX"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's not just pointless, it's disingenuous. A bad faith argument, part of their usual gaslighting.",
                                    "score": 11,
                                    "author": "Stifu"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even though party strategists like Kevin Philips said at the time they SHOULD support it... and encourage Black voters to register as Democrats, so they could scoop up the southern \"Negrophobe\" voters who would leave the Southern Democrats over it.\n\n&gt;From now on, the Republicans are never going to get more than 10 to 20 percent of the Negro vote and they don't need any more than that... but Republicans would be shortsighted if they weakened enforcement of the Voting Rights Act. The more Negroes who register as Democrats in the South, the sooner the Negrophobe whites will quit the Democrats and become Republicans. That's where the votes are. Without that prodding from the blacks, the whites will backslide into their old comfortable arrangement with the local Democrats.",
                    "score": 10,
                    "author": "Ulgeguug"
                },
                {
                    "level": 1,
                    "comment": "The current Republican Supreme Court is slowly repealing it.",
                    "score": 2,
                    "author": "danmathew"
                },
                {
                    "level": 1,
                    "comment": "What are you talking about? In the Senate, of the 32 Republicans, 30 supported it. 8x more Democrats were against it. In the House it was 112 for, 24 against for the Republicans. Again, far more Democrats were against it.\n\nhttps://en.m.wikipedia.org/wiki/Voting_Rights_Act_of_1965\n\n\nAnd the previous voting rights acts were done by Republicans and Democrats --like LBJ-- gutted them of all teeth.",
                    "score": -2,
                    "author": "fastinserter"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They havent been there party of Lincoln since mid 20th century if im being generous",
            "score": 21,
            "author": "ScalyPig"
        },
        {
            "level": 0,
            "comment": "Still amazes me that so many professed Christians have gone all in on a nonstop liar. \n\nWasn’t Satan supposed to be the father of lies?",
            "score": 16,
            "author": "Blu_Skies_In_My_Head",
            "replies": [
                {
                    "level": 1,
                    "comment": "They want the antichrist to take over, they want the apocalypse.",
                    "score": 7,
                    "author": "Infamous-Werewolf196",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yup.. its all part of the plan.  luckily it will devolve into sectarian shit eventually. they start to differ on exactly what happens (Premillennialism) and how rapture works.",
                            "score": 2,
                            "author": "sambull"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pro-Tip: See Moral Majority.",
            "score": 13,
            "author": "TintedApostle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where? Every time I go looking for it I can't find it...",
                    "score": 2,
                    "author": "coolcool23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "🤦‍♂️ \n\nRepublican party hasn't been Party of Lincoln since like 1877, when they ditched freedmen in favor of presidency and subsequently kept on shitting on black people in favor of power.",
            "score": 11,
            "author": "Proud3GenAthst"
        },
        {
            "level": 0,
            "comment": "like? It is a fucking cult and if things keep going this way soon there is going to be a lot of spicy kool aid provided, you know reverend Jones legacy.",
            "score": 8,
            "author": "jay105000"
        },
        {
            "level": 0,
            "comment": "It was a religious cult before. But now it’s more so.",
            "score": 9,
            "author": "comma_in_a_coma",
            "replies": [
                {
                    "level": 1,
                    "comment": "Supply side  and cutting rich people’s taxes is always the right answer is indistinguishable from religion.",
                    "score": 1,
                    "author": "comma_in_a_coma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "On policy, Lincoln would be a modern-day democrat. He was seen as a big government tyrant. But w/e.",
            "score": 21,
            "author": "AFlockOfTySegalls",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was also socially progressive. Those who supported slavery, were Conservatives.",
                    "score": 10,
                    "author": "danmathew"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is strikingly like hitler I mean strikingly like Germany in the 30s in the GOP.",
            "score": 15,
            "author": "REYMEGA"
        },
        {
            "level": 0,
            "comment": "I think Trump less transformed the GOP and more took advantage of what it already was.",
            "score": 5,
            "author": "PearlDivers"
        },
        {
            "level": 0,
            "comment": "You can only do this when you have enough weak-minded individuals who are susceptible to being hoodwinked and bamboozled with the dissemination of Lies that they take as facts",
            "score": 4,
            "author": "dmanjrxx"
        },
        {
            "level": 0,
            "comment": "Chuckling at the insinuation that the GOP didn’t stop being Lincoln’s party well over a century ago. Theodore Roosevelt was already complaining about the party no longer being that of Lincoln before the nineteenth century was even over.",
            "score": 5,
            "author": "abruzzo79"
        },
        {
            "level": 0,
            "comment": "It hasn't really been \"the party of Lincoln\" since the Eisenhower administration. The Republicans were started by a bunch of former Whigs, Lincoln called himself \"an old Henry Clay Whig\" they were a party of modernization they argued that free labor was superior to slave labor and bred civic virtue. They wanted to build infrastructure like railroads and factories as well as give western lands to farmers in order to isolate and surround the slave states of the south and let slavery fall in time due to its own institutional weaknesses. They wanted public schools and colleges. This was a party of modernization and progress, not a party of regression. If we look at Eisenhower's platform in 1956, it was a natural growth of these ideas, federal assistance to low income areas, a higher minimum wage, extended unemployment benefits, support of unions and labor laws, and equal pay for equal work regardless of sex. The Republicans of today are basically the opposite.",
            "score": 3,
            "author": "standard-issue-man"
        },
        {
            "level": 0,
            "comment": "Supporters of Lincoln's initial campaign were called Wide Awakes.",
            "score": 3,
            "author": "earl-j-waggedorn"
        },
        {
            "level": 0,
            "comment": "Nah, they’re still the party of Lincoln…\n\nLincoln Rockwell",
            "score": 3,
            "author": "usernames_are_danger"
        },
        {
            "level": 0,
            "comment": "Lol Lincoln’s party hasn’t been his party for decades",
            "score": 3,
            "author": "KCDinoman"
        },
        {
            "level": 0,
            "comment": "Replace trump with Regan and then we’re getting somewhere",
            "score": 3,
            "author": "Clam_Bake231915"
        },
        {
            "level": 0,
            "comment": "OT: why does he wear a bandana?",
            "score": 3,
            "author": "pm_me_your_lub",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently, he’s undergoing chemo for Non Hodgkins Lymphoma, and Steve Van Zandt (known for wearing a bandana) gave it to him to express his support for Jamie’s fight against cancer. \n\nPretty neat story actually",
                    "score": 18,
                    "author": "edcculus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow! Jamie fighting hard despite being sick. I like the dude more now. Thanks for the info 💪",
                            "score": 10,
                            "author": "pm_me_your_lub"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cancer patient",
                    "score": 7,
                    "author": "Musesoutloud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lincoln's party LOL, these racists lose their minds when you criticize the fucking confederacy",
            "score": 3,
            "author": "greeperfi"
        },
        {
            "level": 0,
            "comment": "It is a grievous insult to Lincoln to call today's Republican party \"Lincoln's Party\".",
            "score": 3,
            "author": "MoonBatsRule"
        },
        {
            "level": 0,
            "comment": "Nonsense--the transformation of the GOP into its current state started with Nixon and Goldwater more than 50 years ago.  Trump recognized the transformation and grabbed reins.  He did not remake the GOP in his own image--it had already been remade.  \n\nThat is why the old Nixon hands like Manafort gravitated to him.",
            "score": 3,
            "author": "daveashaw"
        },
        {
            "level": 0,
            "comment": "Because that’s what it is, don’t blame Trump, christians have completely disagreed with Christ since Reagan.\n\nBlame that dead scumbag Pat Robertson more than you blame that idiot traitor Donald Trump, if this is what we’re blaming for. \n\nChristians abandoned Christ as hard as they could.",
            "score": 3,
            "author": "J_Warphead"
        },
        {
            "level": 0,
            "comment": "it hasn't been \"lincoln's party\" since the nixon era.",
            "score": 3,
            "author": "defaultusername-17"
        },
        {
            "level": 0,
            "comment": "This is a transition that has been going on since the late 1970s, it isn't Trump he is just a frontman hawking their products.",
            "score": 3,
            "author": "Lamont-Cranston"
        },
        {
            "level": 0,
            "comment": "It’s been a religious cult for a long time. They just finally found their demagogue (demigod).",
            "score": 3,
            "author": "Ghost2Eleven"
        },
        {
            "level": 0,
            "comment": "...You seriously think Trump transformed the Republican Party?  Were you born yesterday, or did you just overlook the last  century of US political history?",
            "score": 5,
            "author": "cyrusm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course he did",
                    "score": 1,
                    "author": "HunterWindmill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate when anyone, including the very much respected Rep Raskin, calls the republicans the party of Lincoln. Lincoln would not stand with their ideals or under the banner they say represents their heritage. The parties switched ideologies long ago.",
            "score": 5,
            "author": "tickandzesty"
        },
        {
            "level": 0,
            "comment": "It's disingenuous to refer to it as Lincoln's Party.  The Republicans then were progressives.  That all changed in the 50s and 60s as they courted southern racists to gain power.",
            "score": 4,
            "author": "-Clayburn"
        },
        {
            "level": 0,
            "comment": "This is the problem with moderate Democrats. They give Republicans too much credit. Republicans try to wrongly claim to be Lincoln’s party, but there’s been such a tremendous shift in party ideals over the last 150 years. It hasn’t been Lincoln’s party for a long time and anyone with any sense should not give that claim any legitimacy. How many Democrats do you see waving Confederate flags?",
            "score": 3,
            "author": "wafair"
        },
        {
            "level": 0,
            "comment": "It was going that way well before Trump. It started when Talk radio host started dictating policy.",
            "score": 2,
            "author": "Silly_Pace"
        },
        {
            "level": 0,
            "comment": "Except Republicans during Lincoln’s time were what Democrats are today.",
            "score": 2,
            "author": "Gronkattack"
        },
        {
            "level": 0,
            "comment": "Why would you give them what they want and equate it with Lincoln",
            "score": 2,
            "author": "Oogaman00"
        },
        {
            "level": 0,
            "comment": "It hasn't been Lincolns party for a VERY LONG TIME.",
            "score": 2,
            "author": "FarmhouseFan"
        },
        {
            "level": 0,
            "comment": "No Trump didn’t. The GOP laid the groundwork for DECADES in order to lead via cult of personality. Unfortunately for them a literal, honest-to-god traitor beat them to the punch and stole all that hard work for himself. \n\nFuck the GOP. Fuck their supporters. Fuck that traitor.",
            "score": 2,
            "author": "ARazorbacks"
        },
        {
            "level": 0,
            "comment": "Literally, literally RINO, republican in name only.\n\nThe dead giveaway that the parties switched identities is that all the states that ceeded from the union all either lean or are hardcore republican strongholds.\n\nIf I recall my history correctly, Lincoln kinda went to war with these states.",
            "score": 2,
            "author": "vapescaped"
        },
        {
            "level": 0,
            "comment": "No, the Republican party started down that road at a leisurely pace with the idolatry of Reagan. Picked up their pace with the whole Teabag idiocracy. Then went full hell bent for danger sprint with Trump. \n\nThis is 40 years in making, look at Robertson's contribution of \"moral majority\". Gingrich and the focus on evangelical vote. Rush Limbaugh cheering all the insanity on then Fox carrying the water to a bigger audience.\n\nDon't minimize the extent of the malaise by simply pointing out the sins of the latest figurehead. The rot is much deeper in America's soul.",
            "score": 2,
            "author": "Salt-Southern"
        },
        {
            "level": 0,
            "comment": "What did the Lincoln Project did to his legacy is horrible",
            "score": 2,
            "author": "Reddeer333"
        },
        {
            "level": 0,
            "comment": "It is a cult",
            "score": 2,
            "author": "JoeDirtsMullet00"
        },
        {
            "level": 0,
            "comment": "No, Regan did that.",
            "score": 2,
            "author": "Roflattack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, it's been a religious cult since at least 1980. Orange Hitler just took the polite veneer off.",
                    "score": 3,
                    "author": "Lorax91"
                }
            ]
        },
        {
            "level": 0,
            "comment": "isnt the democrats technically lincolns party, since that whole Civil rights era swap?",
            "score": 2,
            "author": "4runninglife"
        },
        {
            "level": 0,
            "comment": "He’s not wrong.",
            "score": 1,
            "author": "hskfmn"
        },
        {
            "level": 0,
            "comment": "Damn professor Quirrel really let himself go after the events of the sorcerers stone.",
            "score": 1,
            "author": "FlifloCloud"
        },
        {
            "level": 0,
            "comment": "So did Reagan and the Bushes.",
            "score": 1,
            "author": "toxie37"
        },
        {
            "level": 0,
            "comment": "Or, like the way vast swaths of the US \"run.\"",
            "score": 1,
            "author": "LakewoodHayandGrain"
        },
        {
            "level": 0,
            "comment": "Why does he wear a bandana?",
            "score": 1,
            "author": "No_Fox_7864",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's undergoing cancer treatment",
                    "score": 3,
                    "author": "Ibelieveinphysics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough",
                            "score": 2,
                            "author": "No_Fox_7864"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Like\" a cult?",
            "score": 1,
            "author": "Infernoraptor"
        },
        {
            "level": 0,
            "comment": "It is a religious cult",
            "score": 1,
            "author": "angelcake"
        },
        {
            "level": 0,
            "comment": "Doomsday cult more like.",
            "score": 1,
            "author": "DAEDALUS1969"
        },
        {
            "level": 0,
            "comment": "They got the party they wanted.",
            "score": 1,
            "author": "KaleidoscopeSlight80"
        },
        {
            "level": 0,
            "comment": "It IS a cult",
            "score": 1,
            "author": "49GTUPPAST"
        },
        {
            "level": 0,
            "comment": "Trump has handed out a lot of Kool-Aid",
            "score": 1,
            "author": "notatrollallthetime"
        },
        {
            "level": 0,
            "comment": "It's stressful for republicans who are not in the cult",
            "score": 1,
            "author": "Overall-Importance54"
        },
        {
            "level": 0,
            "comment": "Like a mob boss.",
            "score": 1,
            "author": "ElderFlour"
        },
        {
            "level": 0,
            "comment": "Newt Gingrich did that decades ago",
            "score": 1,
            "author": "Archimedesinflight"
        },
        {
            "level": 0,
            "comment": "They have got  to find the courage/leadership to denounce all of this MAGA, election denial, deep state, conspiracy, woke nonsense and rebuild from the ground up.\n\nIt takes hitting rock bottom and allthough close, sadly, not quite there yet. More to come I am afraid.",
            "score": 1,
            "author": "Old_Scholz58"
        },
        {
            "level": 0,
            "comment": "It stopped being “Lincoln’s Party” with the Southern Strategy like three quarters of a century ago",
            "score": 1,
            "author": "The-Shattering-Light"
        },
        {
            "level": 0,
            "comment": "That’s being dishonest, calling them Lincoln’s Party. His party left decades ago and nothing but the shell of a name remains.",
            "score": 1,
            "author": "Yavin4Reddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "They call them RINOs and most of them are a pale , faded expression of Lincoln’s Republicans.",
                    "score": 1,
                    "author": "CatAvailable3953"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most cults end pretty badly.",
            "score": 1,
            "author": "Particular_Sun8377"
        },
        {
            "level": 0,
            "comment": "Because he is the Antichrist. I don't believe in a lot but IF any prophecy were true - this country will fight a war against itself as China and Russia tear us apart. If he's not the Antichrist he is either the beast of the sea or the beast of the earth.",
            "score": 1,
            "author": "mbrown7532"
        },
        {
            "level": 0,
            "comment": "I hole heartedly welcome the era of the formal durag.",
            "score": 1,
            "author": "thong_butt"
        },
        {
            "level": 0,
            "comment": "I really am proud of my congressman here. I mean, it’s such a blue district, he could turn into trump and still win, so I’m happy he works hard.",
            "score": 1,
            "author": "PlutoniumNiborg",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish I felt that way about my representation at the State and National levels. Mine are an embarrassment.",
                    "score": 1,
                    "author": "CatAvailable3953",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It could get Mike Lee. I mean worse.",
                            "score": 1,
                            "author": "Racecarlock",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Marsha is an incompetent as compared to Mike. He is more dangerous to be fair. Bet you can’t name our other Senator unless you look it up.",
                                    "score": 1,
                                    "author": "CatAvailable3953",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Got me there.",
                                            "score": 1,
                                            "author": "Racecarlock"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tasking has more hats than anyone I’ve ever seen",
            "score": 1,
            "author": "Funny-Company4274"
        },
        {
            "level": 0,
            "comment": "Does this feel like gaslighting their association with a party of values?",
            "score": 1,
            "author": "Ok_Contribution4714"
        },
        {
            "level": 0,
            "comment": "To be fair, it was changed from “Lincoln’s Party” for a long time before that.",
            "score": 1,
            "author": "dwayne_jetski69"
        },
        {
            "level": 0,
            "comment": "Is that Kendall Roy",
            "score": 1,
            "author": "FleekasaurusFlex"
        },
        {
            "level": 0,
            "comment": "Lincoln was a Dixiecrat?",
            "score": 1,
            "author": "JakeInDC"
        },
        {
            "level": 0,
            "comment": "I like Raskin, but I have a petty comment: Can somebody please get this guy a surgeon's cap so that he doesn't look like a fortune teller in a suit?  I know that the man is dealing with chemo, but there are better options.",
            "score": 1,
            "author": "I_NamedTheDogIndiana"
        },
        {
            "level": 0,
            "comment": "That dude looks like Neil Peart",
            "score": 1,
            "author": "thatchroofcottages"
        },
        {
            "level": 0,
            "comment": "Pfsch. Trump didn't do it, but will serve as a scapegoat. There's so many GOP folk who made it happen.",
            "score": 1,
            "author": "GeebusNZ"
        },
        {
            "level": 0,
            "comment": "I really hate when people say Trump transformed the GOP, that he changed it like nobody else. BS. You're 1) giving him way too much credit and 2) making him the patsy/fallguy for all the despicable GOP terrorists that have been saying and doing exactly what Trump does for the past 20 years. McConnell is a terrorist and traitor to this country, and has irreparably damaged this country forever. He's just one of dozens of key GOP operators responsible for our downfall. Not Trump. Trump makes things worse (kind of his super power), but he didn't design any of this. He just yelled it louder.",
            "score": 1,
            "author": "rodentmaster"
        },
        {
            "level": 0,
            "comment": "Donald Koresh",
            "score": 1,
            "author": "redzeusky"
        },
        {
            "level": 0,
            "comment": "Always has been",
            "score": 1,
            "author": "whereismymind86"
        },
        {
            "level": 0,
            "comment": "Also like…the democrats are the party of Lincoln, let’s stop letting republicans act like the southern strategy didn’t flip the parties in the 60’s\n\nThe republicans are the party of Jefferson Davis",
            "score": 1,
            "author": "whereismymind86"
        },
        {
            "level": 0,
            "comment": "Religious cult?  You meant mob.",
            "score": 1,
            "author": "katkost1"
        },
        {
            "level": 0,
            "comment": "I’m in laws came over the other night for desserts and coffee stated talked nonsense about the political witch hunt against trump and blah blah I nicely told them to get the fuck gone with that bullshit…. Oh and they were still pissed about “bud light”",
            "score": 1,
            "author": "Gold_Championship_46"
        },
        {
            "level": 0,
            "comment": "That is absolutely true",
            "score": 1,
            "author": "Vetruvian01"
        },
        {
            "level": 0,
            "comment": "Or rather the R’s want to be run like a religious cult…",
            "score": 1,
            "author": "Thekingofchrome"
        },
        {
            "level": 0,
            "comment": "Raskin is great.  We need more like him in government.",
            "score": 1,
            "author": "Robinhood4real"
        },
        {
            "level": 0,
            "comment": "True... People with critical thinking skills don't tend to wind up in cults so much.",
            "score": 1,
            "author": "pwzapffe99"
        },
        {
            "level": 0,
            "comment": "GOP: just feed them things to be angry about and they vote for you every time, though we do nothing for them.\n\nGOP problem solving: complain, feign outrage, project, deflect, distract, then do nothing.",
            "score": 1,
            "author": "LoveBabesCarsPoems"
        },
        {
            "level": 0,
            "comment": "It started with Reagan",
            "score": 1,
            "author": "jar1967"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -38,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "BoTh siDeS gUyS",
                    "score": 24,
                    "author": "Helfix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -23,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your comment is definitely not a centrist one.\n\nThere is only one party that has gone off the rails and straight into fascism.\n\nThe Democratic party is still considered a center right party by Western standards.",
                                    "score": 25,
                                    "author": "Helfix"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ll keep voting incompetence over fascism thanks",
                    "score": 16,
                    "author": "wr0ngdr01d"
                },
                {
                    "level": 1,
                    "comment": "Can you provide anything that shows that democrats are even remotely on the same level as republicans as far as “off the rails” goes?",
                    "score": 5,
                    "author": "A_Soft_Fart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "… so misspeaking is the same thing as trying to overthrow the government? \n\nI don’t think this article is the “gotcha” you think it is.",
                                    "score": 4,
                                    "author": "A_Soft_Fart"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What the hell is on his head?!?! Did he just have hair implants?!?! HA HA HA HA!!!",
            "score": -13,
            "author": "SpecialNotice3151",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's undergoing chemo, nimrod",
                    "score": 12,
                    "author": "Vamanoscabron"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok I’m a big Raskin fan, but I’m getting serious prison Mike vibes. Is that a religious head-ware?",
            "score": 0,
            "author": "earthatnight",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was diagnosed with cancer last year and went through chemo.",
                    "score": 3,
                    "author": "nld01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh that’s right. I forgot about that.",
                            "score": 1,
                            "author": "earthatnight"
                        },
                        {
                            "level": 2,
                            "comment": "Didn’t realize head scarfs were common for men, I just thought they rocked the dome.",
                            "score": 1,
                            "author": "Broad-Ad-4720"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "WTF is on that guys head?",
            "score": 0,
            "author": "NotYourMutha",
            "replies": [
                {
                    "level": 1,
                    "comment": "A chemo cap.",
                    "score": 2,
                    "author": "NopeNotUmaThurman"
                }
            ]
        }
    ]
}