{
    "id": "145czr1",
    "score": 319,
    "title": "Aileen Cannon, Trump-appointed judge, assigned initially to oversee documents case",
    "author": "HeinieKaboobler",
    "date": 1686335591.0,
    "url": "https://www.reddit.com/r/politics/comments/145czr1",
    "media_urls": [
        "https://www.cbsnews.com/news/judge-aileen-cannon-assigned-trump-indicted-documents-case/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "after what she allready tried, she should be right next to him being charged",
            "score": 78,
            "author": "lastdarknight"
        },
        {
            "level": 0,
            "comment": "[Joyce Vance on Cannon being assigned to the case:](https://twitter.com/JoyceWhiteVance/status/1667166126881619969)   \n\n\n1/ Before everyone gets too spun up about reports Judge Cannon has been assigned to the Trump case, a little law. I used to be an appellate chief in the 11th Circuit (where Florida is) and I litigated a few appeals where we asked the court of appeals to order a judge to recuse.   \n\n\n2/ Altho a judge's behavior in court generally doesn't form the basis for recusal, the 11th Circuit has ordered \"reassignment\" where a judge leans so heavily for a defendant they call their objectivity in the eyes of the public into question. This is from US v. Martin  \n\n\n3/ This is persuasive authority that Judge Cannon must step aside if the case falls to her as a permanent assignment. Her court &amp; certainly the 11th won't tolerate the damage it would do to their credibility if she failed to voluntarily recuse. \r  \n\n\n4/ It is not clear Cannon is permanently assigned to the case. If she is, it's extremely unlikely it stays with her and as a last resort, DOJ will challenge her participation and win.",
            "score": 63,
            "author": "Ken808",
            "replies": [
                {
                    "level": 1,
                    "comment": "Joyce is so awesome!",
                    "score": 10,
                    "author": "SirAlonsoDayne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you like Joyce, you might enjoy her as cohost on Preet Bharara's podcast, Cafe Insider.  It's a paid subscription podcast, but it's one of the best legal pods out there.   Worth every penny imo.  They also do a free podcast that isn't cohosted by Joyce, called Stay Tuned with Preet.\n\n[https://cafe.com/cafe-insider-podcast/](https://cafe.com/cafe-insider-podcast/)\n\nhttps://cafe.com/stay-tuned-podcast/",
                            "score": 3,
                            "author": "Ken808",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She also does the SistersInLaw podcast.",
                                    "score": 3,
                                    "author": "Blueeyedgenie69"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh yes! Been listening since 2017. Today’s episode is *chef’s kiss* https://podcasts.apple.com/us/podcast/stay-tuned-with-preet/id1265845136?i=1000616337306",
                                    "score": 1,
                                    "author": "SirAlonsoDayne"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hope this is true but I am not going to hold my breath. Based on her biased previous behavior, it is extremely unlikely that she will recuse herself. The DOJ will have to get her removed. \n\nThis is more evidence that something is going on behind the scenes. It isn’t plausible that Trump has avoided being charged with a crime for this long without some kind of insider help.",
                    "score": 4,
                    "author": "FFN001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The DOJ will move to get rid of her.  They'll probably say Cannon is a witness to obstruction, all thanks to that special master debacle, and that she will have to recuse.",
                            "score": 5,
                            "author": "Ken808"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My fellow commenter in Christ, thank you for this before I got all spun up on this jank and the click farm articles like slate making me all queezy",
                    "score": 10,
                    "author": "Skooma_Lite"
                },
                {
                    "level": 1,
                    "comment": "Thank you for the information.",
                    "score": 3,
                    "author": "TrooperHoop509"
                },
                {
                    "level": 1,
                    "comment": "I don’t agree with this. The chances Cannon will recuse or will be forced to give up the case are slim. And it is not common for an appellate court to order recusal.",
                    "score": 3,
                    "author": "FlintBlue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are right of course but I think other folks are going to “shoot the messenger”. We all want the Orange Clown to be held accountable for his many many over-the-top crimes that he obviously committed and spent zero effort trying to cover up. But that is the point—he isn’t being held accountable in the first place because of some behind-the-scenes manipulation. Cannon is obviously part of it. Instead of burying our heads in the sand and hoping this time will be different (after decades of crime) we should start asking what is going on. I mean really going on. \n\nI bet Trump will get convicted this time but somehow he will get off with a slap on the wrist because of…reasons.",
                            "score": 1,
                            "author": "FFN001"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also worth mentioning they must get a unanimous verdict from a south Florida jury.",
            "score": 21,
            "author": "dust-ranger",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m hoping that if you made even most Trump supporters sit down and listen to a detailed presentation of the evidence, like… “on x date he showed y map of US nuclear facilities to z campaign donor,”… that even they would be like, “wow, this isn’t what Tucker said… he’s guilty.”",
                    "score": 18,
                    "author": "moralprolapse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you don't state that you are an ardent trump supporter, but youhave a ton of online posts showing this, you can be charged with contempt or obstruction.",
                            "score": 22,
                            "author": "Udjet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most likely perjury.",
                                    "score": 9,
                                    "author": "GigMistress"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lol sounds like a fairy tale world. I’ve talked to trump voters who can’t even accept a hypothetical of him breaking the law. It’s unimaginable to some of them. It’s all “liberal Bs, and the fbi is corrupt, not trump”",
                            "score": 11,
                            "author": "mostdope28",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol, now that you mention, I’ve had that conversation.\n\n“No, no, I’m not saying that he did. Listen to me. I’m just trying to give an example, I’m saying IF… no, I know he didn’t… no, I’m saying we’re pretending for a second he did; would you… no, you’re not understanding me… for the purpose of this scenario, he… ah never mind.”",
                                    "score": 4,
                                    "author": "moralprolapse"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think even on a subconscious level they might be aware of how shitty the sweater has been put together.... One tug and everything else will unravel.",
                                    "score": 3,
                                    "author": "citizenjones"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah and those types won’t make it through jury selection",
                                    "score": 2,
                                    "author": "Dane1414",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Let's hope. It seems like more than 1 in 12 of the population are too far gone.",
                                            "score": 1,
                                            "author": "dust-ranger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Those 12 are usually picked from a much larger group, allowing the prosecution and defense the ability to weed out any jurors that are too biased in either direction",
                                                    "score": 2,
                                                    "author": "Dane1414"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Even if they acknowledged it was true, they can’t reconcile him being guilty with their worldview at this point. Anybody who’s been trump supporter maga mode for the last 6 years had too much of their own identity and sense of self tied up in this fiction of trump to be able to look at these facts in the cold light of day and entertain what it means for their own identity. It means they were wrong. It means everything they’ve chosen to make themselves into is a sham. They were tricked and lied to and believed it… and it’s gone on too long to back out now. \n\nThese people would have to experience ego death before they will be able to reconcile the truth about trump with their own chosen beliefs",
                            "score": 3,
                            "author": "bossmcsauce"
                        },
                        {
                            "level": 2,
                            "comment": "bUt huNtErz LapToP!",
                            "score": 1,
                            "author": "fractal_pudding"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If Cannon ends up being the trial judge, I would expect his lawyers to advise him to waive the jury trial if that's an option. A bench trial would more likely end in his favor if she's presiding.",
                    "score": 3,
                    "author": "Thadrea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Judge appointed to her job by the defendant.  No color of bias there at all.",
            "score": 20,
            "author": "yrbmegr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats absolutely wild, how is that allowed?",
                    "score": 5,
                    "author": "Bagz402",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It won't be. They'll push for another judge. Technically she should recuse herself as it could create a perception of impropriety but judges aren't always so great about applying ethical guidelines.",
                            "score": 7,
                            "author": "Mysterious-Text-2005"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully Cannons assignment is not permanent. If it is, DOJ can appeal the assignment to the 11th Circuit Court of Appeals. My worry is Justice Clarence Thomas oversees the 11th Circuit.",
            "score": 16,
            "author": "Lvielle"
        },
        {
            "level": 0,
            "comment": "With all of the problems that came up with her the last time she was given a Trump case, why do it again? \n\nAt least this time the DOJ and the country know what to expect. So hopefully the DOJ can plan ahead of the obvious and amateurish obstruction and anticipate that she will do everything in her power to cover for Trump.",
            "score": 13,
            "author": "hearsdemons"
        },
        {
            "level": 0,
            "comment": "Lots of her bullshit has been overturned like during the special master debacle, but that took time and Trump's #1 strategy is *delay, delay, delay.*",
            "score": 16,
            "author": "Squirrel_Chucks"
        },
        {
            "level": 0,
            "comment": "Eh, I'm not worried. The DOJ will appeal and she'll have to step aside. It's a clear conflict of interest.",
            "score": 35,
            "author": "Detective-Signal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could you articulate the conflict?",
                    "score": -12,
                    "author": "GigMistress",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When she appointed a special inspector, the legal reasoning she used was riddled with errors and improper reasoning.  It was apparent to everyone that she was paying back Trump by attempting to delay the investigation. \n\nThen, after the barrage of criticism she walked her decision back, but most importantly, failed to address the criticisms with anything resembling a valid legal opinion. \n\nGiven her record, she is indisputably unsuited to hearing this case.",
                            "score": 15,
                            "author": "vicegrip",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure. She's an unqualified hack. She's unsuited to hear a small claims case.\n\nThat has exactly zero to do with \"conflict.\"",
                                    "score": -6,
                                    "author": "GigMistress",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The conflict of interest is that she was appointed by Trump. However, on its own that’s not enough to warrant a recusal. \n\nBut add in all the mistakes and errant rulings that were so egregious she got the federal appeals court version of “what the fuck is this?”, and that they just all so happened to favor Trump, there’s a pretty good case to be made that she is too biased to reside over anything to do with Trump.",
                                            "score": 6,
                                            "author": "Dane1414"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Her stupidity is a conflict of interest with her position.\n\nThe fact she is obviously prejudiced in favor of Trump is a conflict of interest with respect to this case.",
                                            "score": 3,
                                            "author": "vicegrip"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The judge was given her job by the defendant. And she’s already been overruled for a ridiculous decision that unfairly favored trump previously.",
                            "score": 24,
                            "author": "Dont__Grumpy__Stop"
                        },
                        {
                            "level": 2,
                            "comment": "She’s a trump appointed judge with clear right wing bias and fucked with another case relating to trump",
                            "score": 14,
                            "author": "moralquary"
                        },
                        {
                            "level": 2,
                            "comment": "Do you not understand what \"conflict of interest\" means?",
                            "score": 8,
                            "author": "Detective-Signal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So, you're unable or unwilling to articulate the perceived conflict?",
                                    "score": -15,
                                    "author": "GigMistress",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Perceived Conflict: Appointed by Defendant\n\nActions that need action: Precious decisions by judge biased in defendant’s favor reversed by overseeing Court of Appeals",
                                            "score": 4,
                                            "author": "RandomFactUser",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for the first attempt at a meaningful answer. \n\nThe appointment issue is clearly not a slam dunk, since she presided over the prior proceedings. \n\nIs having been wrong in his favor previously sufficient? I think (as do many other attorneys) that's unclear. The only published precedent I've seen on that issue from the 11th circuit regarded a judge who had sentenced a client in a case, the appellate court had reversed and remanded, the judge had re-sentenced and the appellate court AGAIN reversed and remanded. As bad as Cannon's rulings were, it doesn't seem to rise to that standard--which means the question is open.",
                                                    "score": 1,
                                                    "author": "GigMistress"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Other commenters have explained it to you already, do you understand now?",
                                            "score": 4,
                                            "author": "Terminal_Chill",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I understand that there seems to be an incredibly simplistic view of conflict, which has people believing that Trump having appointed her creates a conflict that everyone just somehow accidentally overlooked the last time she presided over a case against him, but which will magically be obvious to everyone this time around.\n\nVery curious about how many of these experts are attorneys or judges and/or have ever argued a conflict motion.",
                                                    "score": -8,
                                                    "author": "GigMistress",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh okay, so you don’t understand. Nevermind then.",
                                                            "score": 4,
                                                            "author": "Terminal_Chill"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Here, I will take a stab at it:\n\nI get hired by boss to company as an auditor.  I enjoy a cushy lifestyle because of this and I am a big fan of the boss.  Boss loves to embezzle, and everyone, including me, has heard rumors of it but we don't really care.  Boss gets arrested for embezzlement.  As an auditor, I should be impartial but the boss got me the job, so it's in his and my corrupt interest to say he did nothing wrong.",
                                            "score": 2,
                                            "author": "AgITGuy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Now take a stab at explaining why this is a conflict now and it wasn't last time around.",
                                                    "score": -6,
                                                    "author": "GigMistress",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It absolutely was.   Which is also part of why Cannon’s previous efforts were overruled.",
                                                            "score": 10,
                                                            "author": "AgITGuy",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Really? Can you share a ruling that addresses that? I read them all at the time and only recall substantive and procedural issues being addressed. Lots of news outlets discussed conflict, and people on Twitter and such. But I must have overlooked where the appellate court overruled something on that basis.\n\nEthics complaints against her based partly on failure to recuse were dismissed.",
                                                                    "score": -1,
                                                                    "author": "GigMistress",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "My god, it amazes me you have all this time to make comments but none to actually research anything you’re talking about.  \n\n&gt; Judges may not hear cases in which they have either personal knowledge of the disputed facts, **a personal bias concerning a party to the case**, earlier involvement in the case as a lawyer, or a financial interest in any party or subject matter of the case.  \n  \nSince you’re apparently incapable of looking up the definition yourself, that quote is from the code of conduct for US judges. I even bolded the relevant part. Her personal bias was on full display in the prior case (that she also should have recused herself from) with her insane rulings that were overturned. How could you possibly think there’s no conflict there?  \n  \nSince you also somehow missed the appellate court ruling, despite you “reading them all the time”, [here’s that too.](https://amp.miamiherald.com/news/local/article269511242.html)",
                                                                            "score": 7,
                                                                            "author": "Terminal_Chill",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Re your link, that's a news article, not an opinion. \n\nI gave your article a quick skim and even that doesn't seem to mention bias or conflict. Perhaps give the actual opinion a read and you may get a bit more of an understanding of the appellate court's grounds for its decisions.",
                                                                                    "score": 0,
                                                                                    "author": "GigMistress"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I don't need to do a lot of research at this point, since I learned all about conflicts in law school, put forth and argued recusal motions as an attorney, and read the appellate court's orders overturning Cannon's rulings and the order dismissing ethics complaints against her for failure to recuse in real time. \n\nSince this conversation started, I've also seen quite a bit of discussion among attorneys and lawyers quoted in news pieces, many saying that they aren't at all sure this is an actionable conflict. \n\nBut, I'm sure you and your cut-and-paste definition know more than the legal community.",
                                                                                    "score": -1,
                                                                                    "author": "GigMistress",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I remember correctly, she is not among the best and brightest.",
            "score": 8,
            "author": "RamonaQ-JunieB"
        },
        {
            "level": 0,
            "comment": "Not just favorable rulings, the “judge” issued injunctive relief he hadn’t even asked for.\n\nShe was essentially acting as his lawyer as well as the judge.\n\nShe’s a swamp creature.",
            "score": 10,
            "author": "llahlahkje"
        },
        {
            "level": 0,
            "comment": "This is a rather severe conflict of interest that needs to be addressed.",
            "score": 21,
            "author": "jayfeather31"
        },
        {
            "level": 0,
            "comment": "r/wellthatsucks",
            "score": 7,
            "author": "teedeeguantru"
        },
        {
            "level": 0,
            "comment": "It is not going to happen. Cannon will have absolutely nothing to do with this case.",
            "score": 6,
            "author": "CPfromFLA"
        },
        {
            "level": 0,
            "comment": "Wow... What reality are we living in?",
            "score": 6,
            "author": "vamonosgringos"
        },
        {
            "level": 0,
            "comment": "Part of his reasoning for appointing loyal judges whenever possible",
            "score": 6,
            "author": "ZRX1200R"
        },
        {
            "level": 0,
            "comment": "Every single one of his appointments should be annulled. I know there's no mechanism for this but it is simply unconscionable that a traitor like Trump should be allowed to have lasting, ongoing influence on the country's justice system.",
            "score": 6,
            "author": "Naiehybfisn374"
        },
        {
            "level": 0,
            "comment": "They have the right to reassign it to a judge with experience in these cases.",
            "score": 5,
            "author": "Maliamh"
        },
        {
            "level": 0,
            "comment": "They have the right to reassign it to a judge with experience in these cases.",
            "score": 3,
            "author": "Maddyar"
        },
        {
            "level": 0,
            "comment": "They have the right to reassign it to a judge with experience in these cases.",
            "score": 2,
            "author": "Majayme"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think one or two of the judges who overturned her on appeal were also Trump appointees, so there's that",
                    "score": 3,
                    "author": "Squirrel_Chucks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "3rd world level corruption... this POS should recuse &amp; this shit needs to be made illegal.",
            "score": 1,
            "author": "Dangerous_Molasses82"
        },
        {
            "level": 0,
            "comment": "“Initially” is doing most of the heavy lifting in this headline",
            "score": 1,
            "author": "BoysenberryAshamed59"
        },
        {
            "level": 0,
            "comment": "Fucker is going to get away with it again",
            "score": -1,
            "author": "Sea_Analysis_8033"
        }
    ]
}