{
    "id": "145dwhe",
    "score": 5118,
    "title": "Watch live: Special counsel in Trump documents case delivers first remarks",
    "author": "LamentablyTrivial",
    "date": 1686337758.0,
    "url": "https://thehill.com/homenews/4042793-watch-live-special-counsel-in-trump-documents-case-delivers-first-remarks/",
    "media_url": "https://thehill.com/homenews/4042793-watch-live-special-counsel-in-trump-documents-case-delivers-first-remarks/",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "level": 0,
            "comment": "The unsealed indictment document if youre interested \n\n&amp;#x200B;\n\nhttps://storage.courtlistener.com/recap/gov.uscourts.flsd.648653/gov.uscourts.flsd.648653.3.0.pdf",
            "score": 485,
            "replies": [
                {
                    "level": 1,
                    "comment": "This looks like a stronger case than I previously imagined. It appears there are at least three or four witnesses, text messages and tape supporting different elements--and that's assuming Nauta doesn't flip.",
                    "score": 364,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nauta is gonna have to flip, imagine looking at the difference between 5-10 or dying in jail for a younger man. He was probably on the phone with lawyer and DOJ within 15 minutes of indictment unsealed",
                            "score": 115,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who says they are even trying to flip Nauta?  You can charge multiple people in a crime. It doesnt have to be a domino effect to get one single person",
                                    "score": 83,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "true, but this guy was close enough to Trump he probably has knowledge of crimes that aren't even in the indictment",
                                            "score": 37,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Read the whole indictment. His *lawyers* have given damning testimony against him. Nauta is a third stringer.",
                                                    "score": 39,
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Trust me I would love for the truth to be later out, but ultimately if the doj has a sure fire case againast trump that will lock him up for the rest of his life then I’d say you get that done ASAP. \n\nThe truth will reveal itself, I would hope.",
                                                    "score": 19,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This could be the biggest case in American history. You keep adding evidence even if it's not necessary and even if some lower guys get away with their crimes",
                                            "score": 11
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Why flip him when he already has to plead guilty to avoid life in prison?  And once he confesses, Trump becomes guilty, ipso facto… it’s a conspiracy, it takes two to do it.",
                                    "score": 31,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "from what I read elsewhere, it was said that Nauta was saying, to the FBI, that the whole thing was a joke, that the investigation is unethical blah blah blah and that he claimed, directly that he didn't do any of the things they said he did.\n\nSo they showed him *video* evidence of him doing exactly what he said he didn't do to which he then immediately stated \"I won't talk any further without an immunity deal\". \n\nSo they indicted him instead lol. Dude fucked around and found out **fast**.",
                            "score": 101,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe they won't even give him the chance to flip. That would be fun.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He’s unreliable as a witness and their case is already strong without him. Don’t jeopardize a good case with a bad witness.",
                                            "score": 41,
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They don't need anything he would have as info. Unreliable as well is just not worth much to the DoJ when they also know, for sure, he committed crimes and are now going to charge him.",
                                            "score": 12
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You have to be pretty fucking dumb to attach yourself to Trump with all the bodies behind him. You have to be even more of a fucking idiot to not take that deal. After reading the indictment, I don’t think they even need Nauta flipping.",
                            "score": 167,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe Nauta flipped in the end, but initially he told the DOJ to fuck off, he would not cooperate. I guess that may be why he was the only Trump lapdog who got the FAFO prize from Jack Smith. By that logic, it's safe to assume that a lot of far more important people than Trump's toilet valet, may have become world-class snitches. The trial will tell the tale, but at this point it looks like Mark Meadows might have tossed Donny pretty far under the bus, lol.",
                                    "score": 61,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If Meadows is cooperating, he's talking about something a lot bigger than documents.",
                                            "score": 47,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Like (hopefully) the already-established seditious conspiracy.",
                                                    "score": 28,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah, everyone's acting like this is it.  there's still all that J6 shit, not to mention GA.",
                                                            "score": 27,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can his supporters just say he's forking dumb to show classified documents and admit he kept classified documents to a book writer. I mean-like what?!",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Trump scrambling to flip on Nauta first",
                            "score": 31,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I highly doubt the prosecution would let that fly. Nauta is insignificant next to Trump. There's Nauta thing he can do about it.",
                                    "score": 78,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That took me a sec but that's a beautiful dad joke right there.",
                                            "score": 18
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow.  The motherfucker was storing our national secrets in a fucking bathroom.  \n\nThis is a great read.  They got this guy by the short hairs.",
                    "score": 102,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not just yours, other countries’ too.",
                            "score": 26,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This. I don't think enough people fully understand just how much damage he has done to our current *and future* relationships with other countries.",
                                    "score": 18
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for posting this. These are just the charges they know they can prove. 37 charges, max sentence: 400 years.\n\nEdit to add: When your max sentencing is longer than the country who is charging you has been in existence, you done effed up.",
                    "score": 86,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "its encouraging to see folks taking the time to read it",
                            "score": 23,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh hell yeah! I wanted to see for myself exactly how much they had as far as proving intent and oversight of this. He has zero plausible deniability.",
                                    "score": 11
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "38 counts. Gonna love reading this!\n\nEdit:\n\nCounts 1-31 pertain to the willful retention of national defense information. Each count corresponds to a specific document with classification markings (SECRET/NOFORN, TOP SECRET, etc).\n\nCount 32: Conspiracy to obstruct justice\n\nCount 33: Withholding documents or records\n\nCount 34: Corruptly concealing a document or record\n\nCount 35: Concealing a document in a federal investigation\n\nCount 36: Scheme to conceal\n\nCounts 37 &amp; 38: False statements and representations",
                    "score": 61,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "38 is all Nauda's, so the final count for Trump is 37 counts, all gloriously supported by hard evidence.",
                            "score": 20
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone pointed out in another thread, remember that many GOP members voted against impeachment because they said the criminal Justice system could hold Trump accountable.",
            "score": 2070,
            "replies": [
                {
                    "level": 1,
                    "comment": "Right?! How quickly they change their tunes. Seriously no actual principles or spines on any of them.",
                    "score": 793,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve heard more than once since the paperwork stuff first came out, that “he’s already been impeached. That’s the punishment. The liberals need to move on.”",
                            "score": 356,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Put anther way, in the language of today: President Trump is still liable for everything he did while he was in office, as an ordinary citizen, unless the statute of limitations has run, still liable for everything he did while in office, didn't get away with anything yet – yet.\n\n&gt;**We have a criminal justice system in this country. We have civil litigation. And former presidents are not immune from being held accountable by either one**.\n\nMitch McConnell’s [closing remarks](https://www.usnews.com/news/politics/articles/2021-02-14/read-mcconnell-speech-after-trumps-impeachment-trial-acquittal) after Trump was acquitted in the impeachment trial",
                                    "score": 365,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Geezus christ but I heard that in the Turtles voice. Scary!",
                                            "score": 64
                                        },
                                        {
                                            "level": 4,
                                            "comment": "McClownel reminds me of wormtounge in LOTR.",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "doublespeak",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Based on the last 8+ years, conservatives don't have principles, spines, ethics or morals. What they have is goals. They'll do anything, destroy anything, take any position, or any whatever is required to achieve the goals. No more. No less.\n\nThey've demonstrated time and again that listening to what they say is completely worthless outside of knowing that every accusation they levy is an admission.",
                            "score": 133,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They played the long game. Hoping that someone else would result in Trump’s demise, allowing them to still hopefully appeal to his base come election time.",
                    "score": 202,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, they saw how quickly desantis fizzled out against trump and are afraid of the base",
                            "score": 102,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Will be curious to see, if Trump ends up going to jail, how his supporters will react. Will they lash out at both parties or just the democrats?",
                                    "score": 59,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I honestly think the right will erupt into violence. They have nothing else to rally around.",
                                            "score": 107,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe, but it will be short lived and highly disorganized violence.",
                                                    "score": 81,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But still capable of completely upending many people's lives.",
                                                            "score": 31,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Once they see one of them getting done in like that idiot Ashli Babbitt, they'll pipe down.",
                                                    "score": 19
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is it really a \"long game\" if it was flagrantly transparent and absolutely nobody ever believed they would ever speak in favor of criminal charges regardless of any imaginable future evidence?  \n  \nI think that's just called cynically lying.",
                            "score": 26
                        },
                        {
                            "level": 2,
                            "comment": "I’m in my 40s. They’ve been playing the long game my  whole life sadly",
                            "score": 6
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm beginning to think, and please, hear me out, that they're intellectually dishonest.",
                    "score": 55,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "But let’s be real, they never meant that. Just another example of kicking it down the road with empty pronouncements like “We need to take a step back and look at this,” which is another way of saying they’re gonna stall and obstruct until it goes away.",
                    "score": 25
                },
                {
                    "level": 1,
                    "comment": "I certainly remember Mitch McConnell saying that on the floor after Trump's second impeachment for inciting a violent insurrection.",
                    "score": 23
                },
                {
                    "level": 1,
                    "comment": "This was always going to be the move though. Hypocrisy is their bread and butter. It's what they do best. They constantly shift the goal posts, and if you try to call them out they call you the liar. Honestly, the whole lot of them are exhausting with their doublethink and constant logical fallacies. They make Democrats seem like good honest, hard working people.",
                    "score": 10
                },
                {
                    "level": 1,
                    "comment": "Challenge accepted",
                    "score": 10
                },
                {
                    "level": 1,
                    "comment": "No, not like that though! Same GOP members today",
                    "score": 10
                },
                {
                    "level": 1,
                    "comment": "Which is nonsense because only the Senate can ban him from office.  Which they can and should still do.",
                    "score": 10,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "that's like calling out a mugger's hypocrisy for losing interest in the time after they've taken your wallet",
                    "score": 5
                }
            ]
        },
        {
            "level": 0,
            "comment": "Short and sweet. Trump is indicted. No political spin just facts.",
            "score": 266
        },
        {
            "level": 0,
            "comment": "Thirty Fucking Seven. \n\nThats my new favorite number.",
            "score": 185,
            "replies": [
                {
                    "level": 1,
                    "comment": "In a row?",
                    "score": 104,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;In a row?\n\ntry not to commit any espionage on your way through the parking lot",
                            "score": 100,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey! Hey you! Get back here!",
                                    "score": 36,
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm not even supposed to be president today!",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey Trump - try not to steal any documents on your way through the parking lot.",
                            "score": 25,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I saw it pointed out elsewhere - Nixon was the 37th president. How fucking poetic.",
                    "score": 30,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man has resting find out face.",
            "score": 857,
            "replies": [
                {
                    "level": 1,
                    "comment": "Never has a man in a purple robe looked so intimidating.",
                    "score": 196,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Personally, I am sure that this man is an Inquisitor sent from the year 40,000",
                            "score": 40,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I thought everyone was making some kind of star wars meme or some shit when I first saw Mr. Smith.",
                            "score": 62
                        },
                        {
                            "level": 2,
                            "comment": "Basil II was pretty scary",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He reminds me of Coach Beard from Ted Lasso.",
                    "score": 19,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm petrified of him. Doberman vibes. Glad he's on our team.",
                    "score": 133,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The only team he's on is America's team. That's the point. This isn't political. There are no teams.",
                            "score": 191,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, I'm on America's team.  Some folks in other subs and who fly certain flags are very obviously not on America's team.",
                                    "score": 45
                                },
                                {
                                    "level": 3,
                                    "comment": "Yup. That's what I meant.",
                                    "score": 78
                                },
                                {
                                    "level": 3,
                                    "comment": "Well republicans are only on team Putin, so unfortunately that does mean Jack’s on our team, America’s team",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Team America! Fuck Yah!!",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Solid Gold.",
                    "score": 8
                },
                {
                    "level": 1,
                    "comment": "Thank you for making me laugh out loud.",
                    "score": 18
                }
            ]
        },
        {
            "level": 0,
            "comment": "Refreshingly professional and underwhelming. Making Boring Great Again.",
            "score": 1080,
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm getting a kick out of the r/conservative meltdown lmao.\n\nThey are categorically incapable of defending Trump without mentioning the names \"Clinton\" or \"Biden.\"\n\nIn all seriousness they should just admit that their only \"defense\" - if a logical fallacy can even be called a \"defense\" - is to suggest someone else should have been charged with a similar crime but wasn't.",
                    "score": 670,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Holy crap they are deranged over there. First time I've gone, and it was exactly what I expected.",
                            "score": 92,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It seems like a parody. Like if the Onion wanted to photoshop a Conservative Forum",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can't believe that real people are actually saying \"I don't care, I'm gonna vote so hard for him\". Probably because that sub is a Russian propaganda outlet, but still. \n\nHow anyone can look at the indictment and say, \"nah him getting Americans killed by leaking sensitive information is totally fine\" is insane.",
                                            "score": 55,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There are people for whom loyalty supercedes all other considerations. Tribalism will be the end of our kind, in time.",
                                                    "score": 20
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;He'll have to get really aggressive campaigning. If he loses, they will make sure he dies in jail.  \n&gt;  \n&gt;I'm 100% voting for him, and I'm sure he will win the primary. From there is doing anything to win and making crazy deals to develop a strong coalition to ensure he gets to the presidency in 2024.\n\nThese people are insane.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "These people are inbreds",
                                                            "score": 9
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Don’t forget that that’s one of the moderate spaces. \n\nIIRC they wanted to transition to one of the reddit alternates after T_D got banned, but got called things like race traitors so they came back.",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Should see the things they post on the subreddits for things like Crowder, Daily Wire, and Pool. \n\nThe FBI should have been in contact with Reddit over the stuff they post there on the regular.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm sure plenty of FBI are well aware of where they post regularly...",
                                                    "score": 13
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, I hop in there every now and then and just feel like I've slipped into an alternate universe. It's crazy, like listening to my parents try to talk about politics.",
                                    "score": 12
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was over there a minute ago and they were saying that he didn't do anything wrong but also that Trump should've lied better and been smarter about getting rid of evidence. It's mind boggling.",
                            "score": 322,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I also saw them trotting out the “he declassified them” BS.",
                                    "score": 153,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well if they were capable of complex thinking they wouldn’t be supporting him in the first place",
                                            "score": 143,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In order to drain the swamp, one must first *become* the swamp.",
                                                            "score": 17,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My favorite is people suggesting Trump should've pardoned himself while in office.\n\nBy that logic, Biden could magic-wand whatever accusations they're lobbing against him and it'd be completely fine.",
                                            "score": 53,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Even if he had. These crimes happened after he was out of office. The pardon wouldn’t cover them",
                                                    "score": 31,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Of course. I'm just hilighting how far adrift these people are.",
                                                            "score": 12
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He is literally caught on tape saying he could've declassified them but didn't and can't now.",
                                            "score": 95,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They are claiming it was a joke.",
                                                    "score": 48,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Favored defense of fascists and bigots everywhere!",
                                                            "score": 55,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Abusers as well. \n\n“It was just a joke!”",
                                                                    "score": 29
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Also, a very strange joke. \n“Haha this document is unclassified. Psych! I already declassified it with my mind! Ha!”",
                                                                    "score": 26
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, why not a joke?  Trump's whole administration was a joke.  I just wish we *could* laugh about it.",
                                                            "score": 13,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "*with his miiiind*",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's telekinesis, kyle",
                                                    "score": 28,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Mind bullets!!",
                                                            "score": 16
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "How about the power to move you?",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Won’t you take me far away from the mucky muck?",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[Unagi.](https://miro.medium.com/v2/resize:fit:750/0*iytAB_E04y3GVMRP.jpg)",
                                                    "score": 6
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Perhaps they need to be reminded that Nuclear secrets, among others, cannot, never can be, declassified, but talking and trying to reason with them is like reasoning with a swastika shaped shit.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Obviously they haven't heard about the tapes yet.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I love how they have a pinned post about how they plan to deal with brigading. I say they're welcome to their flaired-user only threads as long as every one of their flairs reads \"I am a fucking snowflake and this is my safe space.\"",
                                    "score": 19
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I'm getting a kick out of the   \n&gt;  \n&gt;r/conservative  \n&gt;  \n&gt; meltdown lmao.\n\nSome of the top comments are \"I don't care what he did, still voting for MAGA\"   \n\n\nIt's wild to watch the level of brainwashing the cult has eagerly slurped up",
                            "score": 45,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People who are undereducated are notoriously easy to manipulate. Hence Trump’s “I love the poorly educated” quote",
                                    "score": 19
                                },
                                {
                                    "level": 3,
                                    "comment": "It's a cult. If Biden did crimes I'd have no problem sending him to jail. \n\nIf Joe didn't return classified documents, asked Russia to help him win an election, or asked state officials to \"find\" votes for him to win, then I would burn my Biden flag and scrape off the Biden bumper stickers AND happily see him go to jail. (And of course I don't have Biden flags or Bumper stickers...I'm not in a cult.)",
                                    "score": 16
                                },
                                {
                                    "level": 3,
                                    "comment": "There’s one guy that was posting a lot of stupid shit so I went to his profile and he’s posted probably 200+ comments on those stories just over the last 24 hours lol. For the last two hours it looked like it was averaging a comment every 2-3 minutes.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lots of unemployed foaming at the mouth neckbeards living in their parents' basements who just shitpost all day in between fellating Trump online.   \n\n\nWell the ones who aren't in jail for the Jan 6th coup attempt, anyway.",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’ve seen a few level head comments about how “this looks bad” and “if he just gave them back when they asked this wouldn’t be bad.” I hope the tides start turning. How anyone can keep defending him drives me insane. Just pick a different front runner! I’m so sick of this man.",
                            "score": 31,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Think that’s bad? Check out  r/askthe_donald . That’s where the real maga nuts are.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The thread that said that the DOJ had indicted Trump just because they had found big evidence against Biden the same day is gold.\n\nThe GOP House has no proof(can't show you it's top secret) and all their so-called witnesses either disappear or can't testify because no one has heard about the Witness Protection Program.\n\nThat board is like what I think the Q forums are like.",
                                            "score": 18
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Holy god, that subreddit is another universe.",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I asked a person on Twitter can't they just admit it looks bad for Trump. Hiding classified documents, showing them to others. \n\nOf course they had to talk about Biden. Who returned all his documents when the Archives asked him. If Donny would have done this, he could have avoided this.\n\nBut it's all Biden and the Deep State and even though Biden has dementia he can still assassinate opponents and get the DOJ to bring up bogus charges. Their reality is weird.\n\nMeanwhile most Republicans I know have slowly moved on from Trump and support DeSantis. They are tired of all the chaos.",
                            "score": 17,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If I recall correctly, the National Archives wasn't even aware those documents were missing. Biden's team discovered them and immediately notified the NA and the FBI and asked them to search for any more. Similar to what Pence did. ( Dear God I hate to defend him but he also did the right thing in his case)",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The guy who pointed out trump should go to jail and that it would be his fault HAD to add the edit where he said Clinton should be behind bars. \n\nPhysically incapable of agreeing with the left on anything",
                            "score": 51,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I still don’t even understand what they think Hilary Clinton did.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They are so tribal and Fox rotted, it is stunning. My elderly boomer neighbor spends dozens of hours a week in front of the TV, staring at the propaganda spewing shitbags from Fox. He started to babble to me some nonsense about LGBTQ evils. I asked if he personally knows a trans. person?  Nope.  Has he ever seen an actual trans. person, to his knowledge? Nope. Does he know of a relative, friend, or fellow church member that had ever interacted with a trans. person? Nope.\n\n So, you are essentially allowing these propagandists to rot your brain, and trick you into fearing someone that as far as you know is as real as the Easter Bunny.  You are being taught to hate somebody, and harm them, since you are told that they are evil and working hard to harm you, but they have never done a damn thing to you, in your seventy years of being an adult, and have neither harmed nor even interacted with hundreds of people you know, right?  \n\nYea, my friend, you are really walking aside Jesus on this issue, eh?",
                                                    "score": 6
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She was having secret parties with Buttery Males in the basement of a pizza shop that doesn't have a basement. She's also probably a lizard person, unlike Actual Human Ted Cruz.",
                                            "score": 20,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, I agree that if Hillary did something illegal, she should be in jail. But, the Republicans investigated her vigorously for years and never found enough to do that. So...I dunno what they want.\n\nOn a separate note, it is kind of infuriating how all of these politicians are being found to have classified documents at home just forgotten and they barely even get a slap on the wrist. There are people who get charged for taking home a single document by accident.",
                                    "score": 28,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If only it wasn't a far right safe space. I'm feeling generous and want offer ice bags for their balls.",
                            "score": 11
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit they’re losing it",
                            "score": 11
                        },
                        {
                            "level": 2,
                            "comment": "My favorite are the ones who are saying \"Chill, if he declassified the documents like he said he did, they got nothing.\"",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "God I just took a look over there and I’m genuinely baffled. Under every post, it’s a “wow this is totally a coverup of the (insert Fox News Biden “scandal” of the week)”\n\nOver and over again, every time I’ve looked there since biden got elected.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's GLORIOUS",
                            "score": 8
                        },
                        {
                            "level": 2,
                            "comment": "The fact they can’t distinguish between voluntary cooperation with classified documents compared with deliberate obstruction/dissemination of SCI is simultaneously disappointing and par for the course.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Just popped over there for the first time. I made it like 37 seconds, holy fuck those are some wierdos!",
                            "score": 6
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The spokesman for Robert Mueller is taking notes",
                    "score": 10
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr. Smith goes to Washington and kicks some ass. The movie I am referencing is very old, but very relevant today.",
            "score": 112,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Jack Smith does not seem like the type of guy to fuck around, but certainly seems like he’d help those who do find out.",
            "score": 444,
            "replies": [
                {
                    "level": 1,
                    "comment": "Prosecuted Eastern European war crimes at The Hague. The stuff he has seen, the cases he has prosecuted... I suspect they would break most people.",
                    "score": 177,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "War crimes are the stuff of litaral horror movies. Romeo Dellaire's book is not for the faint of heart. Smith put the sitting president of Kosovo in jail. Crimes he prosecuted include organ harvesting from prisoners for sale on the black market by the Kosovo Liberation Army [(ref.) ](https://www.thedailybeast.com/donald-trump-special-prosecutor-jack-smith-has-a-history-of-indicting-presidents) and getting testimony from witnesses who had every reason to believe they and their families would be tortured and killed of they cooperated, and they still did.\n\nJack Smith is the real deal.",
                            "score": 67,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So Garland brought in the Nuclear Option. Here's to hoping we get justice and that the Blues keep the Oval Office",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My thoughts exactly.",
                    "score": 43
                },
                {
                    "level": 1,
                    "comment": "I thought he had the best press conference. Rule of law, innocent until proven guilty and no one is above the law. Wouldn't be surprised if in 10-15 years, he'd be an AG for a Democratic POTUS.",
                    "score": 70,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "its hard to tell, but I do see him being in charge of the prosecution of Putin back at the Hague, in the next 5-10 years.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If Mueller had been half as serious as this guy is, we wouldn't be here today.",
                            "score": 58,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He doesn’t need to fuck around, he already found out.",
                    "score": 16
                },
                {
                    "level": 1,
                    "comment": "With a beard like that, hell yeah.",
                    "score": 10
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jack \"fuck around and find out\" Smith everybody.",
            "score": 73,
            "replies": [
                {
                    "level": 1,
                    "comment": "He brought the jack hammer down on Traitor Trump.",
                    "score": 23
                }
            ]
        },
        {
            "level": 0,
            "comment": "He looks like an inquisitor and I am about it.",
            "score": 44,
            "replies": []
        },
        {
            "level": 0,
            "comment": "He, Jack Smith, appears to be the very definition of “gravitas.”",
            "score": 43
        },
        {
            "level": 0,
            "comment": "Jack Smith looks like a Warhammer 40K character though fr. I wouldn’t want to be on the receiving end of what he’s about to dish out.",
            "score": 45
        },
        {
            "level": 0,
            "comment": "Everyone who voted for trump or any senatorial republican. This is what you voted for. This is what we told you would happen. This is what you wanted. This is what you caused. Also everyone who didn’t vote for the best option in every race.",
            "score": 180,
            "replies": [
                {
                    "level": 1,
                    "comment": "And by best, I mean the non treasonous option.",
                    "score": 45
                },
                {
                    "level": 1,
                    "comment": "Their go to response will always be \"fake news/witch hunt\" anytime someone tries to reason with them.\n\nThe ones who haven't seen the light at this point need deprogramming.",
                    "score": 22,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Watching r/conservative meltdown and still try to somehow blame Hillary for their sediitonous votes is hysterical",
                            "score": 20,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And they act like Hilary wasn’t investigated. I mean…whole reason this dude even BECAME president in the first place is because the FBI announced in the worst way possible that they were re-opening their investigation into Hilary. \n\nSo, she’s been investigated. Ad nauseam. And it was found that while she did do some things that weren’t proper procedure, it was hard to find any criminal intent in her actions and that it likely was a result of just being a bit of an idiot around digital security. And that they wouldn’t bring charges because they don’t think any prosecutor would be willing to bring charges against her based on such a relatively small mistake lacking in criminal intent. \n\nWhich very much goes to the point that what Trump is being indicted for VERY MUCH carries the element of criminal intent. He willfully disobeyed repeated requests and orders to return the documents. Repeatedly. He moved the documents around to keep their location hidden from those trying to retrieve them. He bragged on tape that he knew they were still classified and that he knew he no longer had the power to declassify them. Some documents, like the one being referenced in that tape recording, STILL haven’t been recovered and no one knows where they are. \n\nIt’s night and fucking day and the only people who won’t acknowledge as much are those who are operating in willful bad faith.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The fact that Reddit allows such a cesspool  to exist post Jan 6 boggles my mind",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; \"But Hillary did similar things!\"\n\nI'm assuming they're referring to her email bs again, but it doesn't matter which accusation they're referring to because:\n\n1. Even if she did the exact same thing that wouldn't excuse Trump.\n2. She was accused and investigated to the end of earth and back and wasn't charged with any crimes. \n3. Trump's crimes have clear evidence, and motive and the investigation has been pretty transparent (as far as they can be with a former president and classified docs).\n\n\nWTF are they even talking about over there?",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing  that his two impeachments have nothing to do with his two indictments. That man has a collection!",
            "score": 38,
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just hope they expand it to kushner and everyone else who was involved or benefited.",
            "score": 97,
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a feeling Kushner and Ivanka sold Daddy out for some deals if we're being realistic here. They rode the grift train until they saw the missing tracks and got the fuck out of dodge.",
                    "score": 41,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "there is ref to a female member of trump's family helping him out: either Melania, Ivanka, or Lara",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This guy is like if Uncle Sam and the Grim Reaper had a baby. Jesus christ",
            "score": 85,
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the greatest description I've ever heard.",
                    "score": 18
                }
            ]
        },
        {
            "level": 0,
            "comment": "This guy is the hero America needs right now.",
            "score": 27,
            "replies": []
        },
        {
            "level": 0,
            "comment": "I bet Trump loves the indictment. It's got TRUMP in bold letters all over it. Perfect!\n\nAlso amusing how much TRUMP there is in it.",
            "score": 22,
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Beautiful mind paper boxes\". omg.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "45 charges would have been far more painful.",
            "score": 22,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dudes a savage. That indictment was detailed AF.",
            "score": 20
        },
        {
            "level": 0,
            "comment": "Remember when Trump was in office how there was a major crisis of Russian's killing a ton of our CIA and covert ops agents abroad?  Remember how he wouldn't condemn that? Remember????",
            "score": 20
        },
        {
            "level": 0,
            "comment": "Trump will definitely be serving a term in 2025, but unfortunately for his supporters, it just won't be in the White House.",
            "score": 18,
            "replies": [
                {
                    "level": 1,
                    "comment": "Just the Big House.",
                    "score": 5
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice to hear your voice Jack, for the first time.",
            "score": 18
        },
        {
            "level": 0,
            "comment": "They call him *Mr. Find Out*.",
            "score": 15,
            "replies": []
        },
        {
            "level": 0,
            "comment": "This document is DENSE. It’s long and it’s all straight-up content. No flowery language. Facts and quotes. Shit is tight.",
            "score": 17,
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love him",
            "score": 14,
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s already done more than Mueller ever did. That’s something.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "remember that many GOP members voted against impeachment because they said the criminal Justice system could hold Trump accountable.",
            "score": 37,
            "replies": [
                {
                    "level": 1,
                    "comment": "But that was then..... This is now.\n\nTotally different /s",
                    "score": 16
                }
            ]
        },
        {
            "level": 0,
            "comment": "And his lawyers have resigned.  Probably realised that he was never going  to pay them.   Looks like he’ll need a court appointed lawyer despite his ‘billions’ 🤣",
            "score": 44,
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s got to go to court Tuesday without lawyers? Is that the current situation?",
                    "score": 7,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, Trump issued a press release announcing new attorneys for this case and thanking the old ones without mentioning they quit on him. He has a new set of suckers, I mean lawyers.",
                            "score": 20,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Attorney… just one. Claimed more soon.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One the biggest surprises from the indictment is that “Waltine” is the guy’s full name, not “Walter”.",
            "score": 13
        },
        {
            "level": 0,
            "comment": "He has the balls to do what Mueller wouldn’t.",
            "score": 11,
            "replies": []
        },
        {
            "level": 0,
            "comment": "After reading the indictment: \n\na) They (those involved in the conspiracy) were all exceedingly dumb. With or without bias, the actions taken read like Keystone Cops.\n\nb) Given the amount of physical evidence referenced in the indictment (text messages, CC tapes, and witness statments), I don't see how they will wiggle out of this. The feds also won't let Trump delay things forever and ever.\n\nc) Nauta is certainly going down given the clear recorded transcript of him lying to the FBI with the evidence to back up the accusation.\n\nd) The cleverest thing Trump did here was make sure he was never on the record of telling anyone to move the boxes. This is a trick that mob bosses use as well; have someone else distribute the order to give themselves culpable ignorance of what happens. Sadly, he had everything funnel through his co-defendant, who I'm sure will look for any means to lessen his sentence by cooperating now. Also, there is a text message from a female family member mentioning that all the boxes won't fit in the jet to Bedminster, so that kind of puts some direction in his hands.\n\ne) If maximums are given and they are found guilty of all counts, Trump is looking at 400 years in prison. Nauta is looking at 90 years.",
            "score": 11
        },
        {
            "level": 0,
            "comment": "To the point with the message he wanted out and thanked the FBI and was proud to be working with them, something no one mentioned",
            "score": 12
        },
        {
            "level": 0,
            "comment": "Send him to the shadow realm coach Beard",
            "score": 9
        },
        {
            "level": 0,
            "comment": "This guys photo is so badass.",
            "score": 9
        },
        {
            "level": 0,
            "comment": "Why does that picture of Jack Smith look like a picture of a cleaned up version of Coach Beard from Ted Lasso.\n\nBut seriously, Trumps charges are way way worse than I imagined it would be. These are pretty much capital punishment crimes. He will rot in prison, recieve the death penalty due to treasonous crimes and espionage alone, or just simply die in prison. There really is no other way this ends him or anyone associated with him. It isn't going to stop with Trump. Some of Congress better start lawyering up real fucking quick.",
            "score": 8
        },
        {
            "level": 0,
            "comment": "I wouldn’t want to argue with this guy over a parking space let alone having his undivided attention in a court of law.",
            "score": 9
        },
        {
            "level": 0,
            "comment": "I’m sorry but daddy",
            "score": 8,
            "replies": []
        },
        {
            "level": 0,
            "comment": "“I’m a man of few words. Any questions?”",
            "score": 19,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thanks coach beard",
            "score": 6
        },
        {
            "level": 0,
            "comment": "The way he hits the word “dedicated” might be meaningless. But I’m choosing to believe that he was throwing some shade at the UNdedicated public servants that we’re all very well aware of at this point. Chief among them would be that orange fella that used to live in the White House. His name always escapes me…",
            "score": 7
        },
        {
            "level": 0,
            "comment": "A good time to remind everyone that Jack was assigned to this case as a consequence of Trump declaring his candidacy.\n\nSo, in a way, Trump brought this competent, experienced badass into the ring.\n\nIt's glorious.",
            "score": 7
        }
    ]
}