{
    "id": "145ps3w",
    "score": 290,
    "title": "Former DeKalb DA says Pres. Trump’s indictment could have major impacts on Fulton investigation",
    "author": "ParadeSit",
    "date": 1686369271.0,
    "url": "https://www.wsbtv.com/news/local/fulton-county/former-dekalb-da-says-pres-trumps-indictment-could-have-major-impacts-fulton-investigation/MBTS7KPNLZFIXFHN2I7SNU7UAU",
    "media_url": "https://www.wsbtv.com/news/local/fulton-county/former-dekalb-da-says-pres-trumps-indictment-could-have-major-impacts-fulton-investigation/MBTS7KPNLZFIXFHN2I7SNU7UAU",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I hope DA Willis doesn’t hold back. She should be emboldened to act in the interest of justice.",
            "score": 73,
            "author": "Brundleflyftw"
        },
        {
            "level": 0,
            "comment": "Absolute non-story. This is the last paragraph of the article:\n\n- The Fulton County DA’s office said this federal indictment will have no impact on their investigation.\n\nWhat a garbage headline.",
            "score": 59,
            "author": "WilHunting2",
            "replies": [
                {
                    "level": 1,
                    "comment": "This sub needs to do headlines like /r/savedyouaclick",
                    "score": 8,
                    "author": "Now__Hiring"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, like, good or bad? Does this help her case, or does this make him unavailable to her now?",
            "score": 9,
            "author": "MississippiJoel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Non-story. It makes jury selection more interesting since the federal case will already have made so many headlines and people will have already formed opinions.",
                    "score": 15,
                    "author": "Frnklfrwsr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I formed my opinion when I listened to the phone call 2 years ago",
                            "score": 4,
                            "author": "Either-Progress4847",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I formed my opinion about his character when he started pushing birther conspiracy theories during the early Obama administration.",
                                    "score": 2,
                                    "author": "Frnklfrwsr"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"James said if Fulton County District Attorney Fani Willis decides to indict Trump and it goes to trial, this indictment could have an impact on jury selection.\n\n“Everybody in the general public knows what’s going on, and, by that point, if they don’t know now, they will then, and the concern is they will have formed an opinion,” James explained.\n\nHe says the timeline of a possible trial will also depend on the federal case.\n\n“The federal government is going to always, assuming that they have something going on at the same time as the State Court has something going on, the Federal Court is always going to trump anything the state court has going on,” James said.\"",
            "score": 20,
            "author": "itemNineExists",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;\"and the concern is they will have formed an opinion,” James explained.\n\nThe Jury selection process is designed to mitigate this.",
                    "score": 1,
                    "author": "Dead_Cash_Burn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's true, but  \nDo you know anyone who hasn't formed an opinion on Trump?",
                            "score": 1,
                            "author": "itemNineExists",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do actually. There are plenty of people out there who do not follow politics or even care about it.  Based on voting alone it's a significant amount of the country.",
                                    "score": 1,
                                    "author": "Dead_Cash_Burn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's spurious. The election system in this country is hardly fair enough to infer that conclusion with certainty. Sure, some people don't know the value of voting down the ballot--they know that they're in a blue or red enough state/district that their vote won't swing those big offices they do care about. That doesn't mean they haven't formed an opinion on Trump. Or Biden. Maybe their opinion is that neither is sufficient to vote for. Sure, they don't understand that protest voting is more effective than not voting, bc no one knows why one didn't vote, but again, it doesn't mean they don't follow politics. Finally, you have disenfranchisement etc. Republicans pass these restrictive voting laws that bring turnout down, meanwhile we saw in 2020 that when mail-in is easier, turnout goes up. No way to know how turnout would look if voting were even easier.\n\nI'm sure there are people who haven't formed an opinion and don't follow politics. I believe you that you know them. But turnout has way too many factors to draw a conclusion like that. \n\n[The last poll when he left office, 4% of people had \"No opinion\"](https://news.gallup.com/poll/203198/presidential-approval-ratings-donald-trump.aspx)\n\nAnd in sept-nov of 2020, only 1 or 2% said they had no opinion",
                                            "score": 1,
                                            "author": "itemNineExists",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah everyone knows how active polling is...",
                                                    "score": 1,
                                                    "author": "Dead_Cash_Burn"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; this indictment could have an impact on jury selection.",
            "score": 4,
            "author": "HarryPyhole"
        },
        {
            "level": 0,
            "comment": "He can be pardoned for the dox case but not the Georgia state case",
            "score": 3,
            "author": "gracemig",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. Georgia pardon law is kind of different. The governor has no pardon power.",
                    "score": 1,
                    "author": "boxer_dogs_dance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; James also commented on why Willis hasn’t made a decision yet. She has said that she expects to make a charging decision by the end of August.",
            "score": 2,
            "author": "SubZero_dot785"
        },
        {
            "level": 0,
            "comment": "Republicans &amp; GOPer's deserve to be left behind, along with their family &amp; friends, to suffer the consequences of their inbred racist, lying, seditionist &amp; treasonous conservative family values and their support of 2x impeached, defeated, and impotent former POTUS Trump!!!",
            "score": 2,
            "author": "Boomersailor-633"
        },
        {
            "level": 0,
            "comment": "The amount of completely useless articles validated by the words like \"could\" and \"may\" nowadays",
            "score": 2,
            "author": "This_Red_Apple"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 3,
            "author": "MDAZIZBD2023"
        }
    ]
}