{
    "id": "145tssn",
    "score": 367,
    "title": "The FBI Is Back to Its Old Habits: Illegally Spying on Protesters: There should be no future for Section 702, an enduring vestige of the post-9/11 security state. To kill it, all Congress has to do is do nothing.",
    "author": "AlanGranted",
    "date": 1686382669.0,
    "url": "https://www.reddit.com/r/politics/comments/145tssn",
    "media_urls": [
        "https://www.thenation.com/article/society/fisa-section-702-fbi-surveillance/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Normally Congress is great at accomplishing nothing, so I'm sure this will sail through reapproval with bipartisan support.",
            "score": 27,
            "author": "technicolored_dreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don’t you dare underestimate the alacrity with which congress will fuck you over. Don’t blink",
                    "score": 13,
                    "author": "UGECK"
                },
                {
                    "level": 1,
                    "comment": "The military industrial complex and the surveillance state seem the evergreen exceptions to Congress accomplishing nothing.\n\n-\n\nThey will always be funded/expanded.",
                    "score": 8,
                    "author": "SmartAssClown"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's because spying on criminal billionaires can get you smoked.",
            "score": 8,
            "author": "Heelajooba"
        },
        {
            "level": 0,
            "comment": "End the effing Patriot Act, too. I can’t believe people cheered to lose their civil liberties and freedom of privacy. The Patriot Act was a victory for the bad guys, not us.",
            "score": 21,
            "author": "itsl8erthanyouthink",
            "replies": [
                {
                    "level": 1,
                    "comment": "As everyone chanted \"don't let the terrorists win\", we let the terrorists win through our own actions. Punished the wrong nations and our own citizens.",
                    "score": 6,
                    "author": "nullvalue1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "GOP in the Bush days…if you have nothing to hide why worry???",
            "score": 1,
            "author": "Takeonlyone"
        }
    ]
}