{
    "id": "1462btt",
    "score": 2951,
    "title": "These potential Trump indictment defense strategies reek of desperation",
    "author": "J_ablo",
    "date": 1686408960.0,
    "url": "https://www.reddit.com/r/politics/comments/1462btt",
    "media_urls": [
        "https://www.msnbc.com/opinion/msnbc-opinion/trump-indictment-lawyers-defense-weak-classified-documents-rcna88454"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The evidence is overwhelming.",
            "score": 476,
            "author": "ElysiumSprouts",
            "replies": [
                {
                    "level": 1,
                    "comment": "And the fact that his supports will never see the facts is the problem. \n\nI read the entire indictment and can - with zero doubt - say he's a criminal at least and traitor at worst (leaning the latter)\n\nAnyone who actually reads the charges and comes away with a different POV is liar",
                    "score": 68,
                    "author": "slowpoke2018",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After reading those counts, and the ridiculous behaviors of everyone involved, I completely and legitimately believe he is a traitor",
                            "score": 54,
                            "author": "Jakesummers1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The indictment was certainly an interesting read! It's not quite clear whether his attorneys broke the law (besides Trump Attorney #3, obviously), but the evidence against Trump and Nauta is overwhelming.\n\nI was pleasantly surprised at the nature of the evidence. I assumed much of it would be witness testimony, and the right wing media would just have to discredit the witnesses to defend Trump in the court of public opinion. That mostly was not the case - only count 32 (which is mostly based on statements he made to his lawyers and Nauta) depends heavily on any witness testimony. \n\n(The incident with the PAC representative also seems like it could rely on witness testimony, but it happened in Bedminster and isn't part of these charges.)\n\nMost of the evidence is rather concrete - photos, audio recording, surveillance footage, and text messages.\n\nIt sort of ended on a cliff hanger with the unknown fate of the boxes that were loaded into the jet, and it seems like there is a strong possibility of a separate indictment in Bedminster.\n\nIt baffles me that the media strategy of repeating Trump's claim that this is hoax and blathering about how unprecedented this is could work on anyone. I guess it shows how far gone much of the country is. The evidence here is undeniable, and no one is even disputing that he retained the documents, but people are falling in line and obeying instructions on what they're told to think and believe.",
                                    "score": 26,
                                    "author": "stevez28",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oddly, I’m hoping what Christie says comes true. That as things come out, more Republicans will jump ship\n\nSeems like a death flag for that hope, but still… the sooner they turn on him the better (if they even do)",
                                            "score": 7,
                                            "author": "Jakesummers1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "100%",
                                    "score": 7,
                                    "author": "slowpoke2018"
                                },
                                {
                                    "level": 3,
                                    "comment": "Somewhere between traitor and treasonous.",
                                    "score": 6,
                                    "author": "Apprehensive_Loan776",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He literally had a plan of attack against Iran drafted so he could sell it *to Iran*. We've landed square and center in treason territory.",
                                            "score": 21,
                                            "author": "Dispro",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t doubt it, but if the evidence for that further step of selling military secrets to enemies of the state was strong enough, I think we’d see it presented in this or another indictment. \nSufficient evidence may still appear.",
                                                    "score": 3,
                                                    "author": "Apprehensive_Loan776"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Anyone who actually reads the charges and comes away with a different POV is liar\n\nOr illiterate, which is almost (also) as likely.",
                            "score": 7,
                            "author": "aintnochallahbackgrl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha, point taken!",
                                    "score": 2,
                                    "author": "slowpoke2018"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And the order finding no attorney- client privilege is a final judgment from another case. As such, it's *res judicata* which prohibits it from being relitigated.",
                    "score": 107,
                    "author": "Beelzabub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or more accurately *collateral estoppel*",
                            "score": 15,
                            "author": "Beelzabub",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Explain both of those in simple terms? Genuinely curious.",
                                    "score": 16,
                                    "author": "IFartOnCats4Fun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Per ChatGPT:\n\nThis means that a decision has been made in a previous case, stating that there was no \"attorney-client privilege\" involved. This \"attorney-client privilege\" usually keeps conversations between a lawyer and their client private. Because this decision was made and is considered a \"final judgment,\" it is now \"res judicata.\" That's a legal term meaning \"a matter already judged,\" and it prevents the same issue from being brought up and argued again in another lawsuit. So, in simple terms, the decision that there was no attorney-client privilege can't be questioned or reargued in future cases.\n\nEdit: I parsed the original from the comment above text to get a laymen’s version in “plain English”",
                                            "score": 4,
                                            "author": "Solonym",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You shouldn't use ChatGPT as a search engine. It tells you what you want to hear, not necessarily facts. It is a story telling robot, not a search engine!",
                                                    "score": 10,
                                                    "author": "microsoftmaps",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You don’t think google does that?",
                                                            "score": 0,
                                                            "author": "IFartOnCats4Fun",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Google is becoming shittier and shittier every day. Chat GPT literally has a disclaimer on the front page saying not to use it as a search engine because what it tells you may not be accurate and it makes things up and even lies to you.",
                                                                    "score": 3,
                                                                    "author": "microsoftmaps"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The finding of lack of privilege in relation to the grand jury sitting in the D.D.C. isn't a final judgment; the case is still live and the grand jury is still sitting.  It is an order which was appealed on an interlocutory basis to the D.C. Cir. which he lost (thus far). He is very likely precluded from a viable argument in that forum, but he absolutely can, and likely will, raise the same arguments in other fora on this point.   Similarly, if a final judgment is reached in the criminal case in D.C., assuming an indictment issues and he is convicted, he can, and absolutely will, argue that decision was erroneous in connection with any post trial motion as well as in direct appeal and to the Supreme Court, assuming he seeks certiorari review.  As such, I would call it neither res judicata nor collateral estoppel; at this point it's more like losing a discovery order.",
                            "score": 3,
                            "author": "lexaproquestions"
                        },
                        {
                            "level": 2,
                            "comment": "Res judicata is Latin and a legal term of art. It essentially is the standard of review required by rule or law that the judge must follow.\n\nRes judiciata = get fucked this has been decided. I believe it’s also been appealed but not sure where it would have de novo review standard.\n\nDe novo = review the case and get to change shit.\n\nMoral of the story is there are a million rules in the field of law and “standard of review” is just a thimble of water in the Olympic pool.",
                            "score": 2,
                            "author": "PulsatingGrowth"
                        },
                        {
                            "level": 2,
                            "comment": "Does Canon know what that is?",
                            "score": 2,
                            "author": "StatusCount7032"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wonder if his defense strategy is “I licked them and so they are mine” - classic 5 year old stuff",
                    "score": 11,
                    "author": "froo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably thought he’d come up with a good excuse or defence before an indictment came, or not he just willing to do the time for the money he got?? Who knows.  I wish they would go this hard after Scomo he was just as bad yet we ignore it, at least they get mad about it.",
                            "score": 2,
                            "author": "F1lthyAn1m4L"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trump owned himself by admitting he “could have declassified as president, but didn’t”.  His supporters  always refuse to acknowledge that point",
                    "score": 6,
                    "author": "mrbigglessworth"
                },
                {
                    "level": 1,
                    "comment": "But it won’t matter to the Florida judge",
                    "score": 98,
                    "author": "ptum0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She's not going to be involved with this for long.",
                            "score": 151,
                            "author": "roastbeeftacohat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s incredible that partisan hack was selected a second time. How does that happen? I’m sure Jack Smith and the DOJ had planned for this and have remedies available to deploy but what a shit show.",
                                    "score": 126,
                                    "author": "DGD1411",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There was a former 11th circuit employee who broke it down on Twitter, but basically since they’ve already peepee slapped her once for partisan bs, she’s under a microscope. It’ll actually look bad reputation wise for everyone if she doesn’t voluntarily recuse herself, and she will be made to by the 11th circuit or by Jack Smith because they both have good reasons to. It just happened to fall into her lap because of prior experience with the case. I wouldn’t sweat it.",
                                            "score": 148,
                                            "author": "Lager89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She *will* try to run interference because she wants to loyalty points for the next SCOTUS seat.",
                                                    "score": 26,
                                                    "author": "Corgi_Koala"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I think you’re talking about this\n\nhttps://twitter.com/JoyceWhiteVance/status/1667166126881619969",
                                                    "score": 45,
                                                    "author": "Most-Resident",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I have a lot of faith in Ms. Vance, but I’m still gonna sweat it.",
                                                            "score": 27,
                                                            "author": "Utterlybored",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 27,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think the only \"defense\" that might work is stalling until the election, getting elected again and pardoning himself.",
                                                            "score": 7,
                                                            "author": "Availablntext681",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "His own party has already turned on him.\nHe won’t even make it past the mid terms. \nHe’s already told all of his supporters that voting is worthless and rigged. None of them are going to vote yet again.",
                                                                    "score": 5,
                                                                    "author": "lswins"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He can’t pardon people for crimes they haven’t officially been convicted of. So, even if he were to be elected while the trial were still ongoing, he wouldn’t be able to just pardon himself out of it.",
                                                                    "score": 1,
                                                                    "author": "joszma",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "People like to point out that you're wrong, but the fact is that no preventative pardon, which violates the letter and spirit of the presidential pardon power, has been challenged in court, and you are absolutely correct that the power is written to be after conviction and acceptance that you committed the crime as convicted. It's supposed to be for a check against political prisoners and to allow a president to act in good faith to release a convict who they believe either shouldn't be punished the way they are, or that the law should be changed because of its scope or application. While I do feel that they are very rarely a good thing, allowing it unchecked is basically tantamount to saying as long as you do it for the president, you're never going to be held to account for anything.\n\nNixon should have rotted in prison, we wouldn't be where we are today if he hadn't been treated like a child that took a cookie from the jar. \n\nWhy is it always Republicans doing this, by the way? Preventative pardons, I mean. Why can't Republicans just stop doing crime so bad that the president has to write them a get out of jail free card so fucking often? (I know why, but the peanut gallery response may be interesting, I'm feeling lucky on asking for wrong answers only)",
                                                                            "score": 3,
                                                                            "author": "zojeqgi769"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He pardoned Bannon and others before charges were even filed. He should not have been able to do it and DOJ should have fought to overturn it, but he got away with it. Also Ford pardoned Nixon the same way.",
                                                                            "score": 3,
                                                                            "author": "JubalHarshaw23"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’ll still be sweating. Cannon has no career except for trump. She was literally appointed by trump to cover his butt.\n\nShe already showed last time how far she would go. I image this time she can tie things up or delay things for awhile.",
                                                    "score": 8,
                                                    "author": "Spector567",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That’s why the court of appeals exists.",
                                                            "score": 5,
                                                            "author": "Lager89",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I agree. That’s what happened last time. But it took months. Every decision was delayed and cannon kept trying to sneak things in to stall the investigation. \n\nShe can do this all again. Ultimately she will be removed. But before or after she allows trump to publish agents names, unseal things that trump wants.",
                                                                    "score": 4,
                                                                    "author": "Spector567"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 7,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It would be hilarious if he's working harder to keep his ass out of prison now than he ever did as history's laziest POTUS. \n\nEven if he's letting his handlers take care of the bulk of his legal issues while he continues to watch television and play simulated golf all day (as per usual), we can still be certain he's doing a helluvalotta sweaty petite-fingered doomscrolling at all hours, even in his dreams as he sleeps, and that certainty is oh so — \n\n*chefs kiss* — \n\ndélicieux",
                                                            "score": 5,
                                                            "author": "SerDigbyChicknCzar"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly. Also the Miami Herald, who ended the career of Alexander Acosta for giving Epstein a short sentence and hurting the victims, is all over this.\n\nThe DOJ can and will move this case to another venue if she starts her bull shut.",
                                                    "score": 15,
                                                    "author": "2manyfelines",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Pssst. I don't think you read to the end if you think Acosta ended after he let epstein walk. He got a cabinet spot in 2017",
                                                            "score": 5,
                                                            "author": "Dance__Commander",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "From which he had to resign. And then he couldn’t get his prosecutor job back.\n\nYou need to read a little further.",
                                                                    "score": 5,
                                                                    "author": "2manyfelines",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah, but that was well after the Miami-Herald reporting AFAIK. Some would call being in the cabinet amongst the most prestigious office you can hold.",
                                                                            "score": 2,
                                                                            "author": "Dance__Commander",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Not widely known is that Acostas spent his whole time on White House staff pushing for the department that over sees sex trafficking to be defunded by 80 percent.\n\nAcostas also sealed a Trump rape case at Epstein's property just months before Epstein's \"sweet heart deal\".\n\nOther lawyers on the Epstein case would reveal Trump as the rat in the case \"Trump was the only one freely giving information on Epstein\".\n\nUpon Acostas resigning Trump would give two speeches in the following 3 days stating how great a guy Acostas was and how important his work in the White House was.... The only thing Acostas worked towards was defunding department over seeing sex trafficking....",
                                                                                    "score": 5,
                                                                                    "author": "idontneedjug",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A dismissal is not a trial. If a case is dismissed a prosecutor can try again and again as long as there isn’t a jury result. Not to mention 11th circuit isn’t gonna let that fly.",
                                            "score": 33,
                                            "author": "Rolemodel247",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Cant a judge dismiss with prejudice to stop it from being refiled? I dont think that stops the 11th circuit from intervening either way tho",
                                                    "score": 11,
                                                    "author": "ChangsManagement",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Prejudice only attaches when a jury has been seated, a bench trial starts, or there has been misconduct by the prosecutor which “offends justice”.\n\nIf this Judge dismisses the charges at summary judgement that can be appealed; a first year law student can see the prosecutor has alleged plausible crimes which when viewed in the most favorable light raises triable issues of fact, therefore this would proceed to trial by any standard. \n\nThere aren’t even colorable defenses to many of the crimes Trump is alleged to have committed. Meaning he has no affirmative defenses.",
                                                            "score": 25,
                                                            "author": "InstructionTiny6581",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They brought the case to a jurisdiction with only three judges.. one in three chance for this outcome.",
                                            "score": 7,
                                            "author": "beekeeper1981"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There four judges that could have been assigned the case. She always had a 25% chance.",
                                            "score": 4,
                                            "author": "MoonageDayscream"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My dream is Jack will make her read the indictment to her crime boss then tell her to take a shame hike",
                                            "score": 2,
                                            "author": "ConfidenceNational37"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Exactly. This will be reassigned.",
                                    "score": 12,
                                    "author": "howlandwolf",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I hope you're right....",
                                    "score": 2,
                                    "author": "phrygiantheory"
                                },
                                {
                                    "level": 3,
                                    "comment": "All she has to do is act semi-normal until they are able to empanel a jury.  Once that happens she can dismiss the case for whatever insane reason she feels like and the 5th amendment will kick in (double jeopardy).   \n\nAnd Trump cannot be charged with any of this stuff again.",
                                    "score": -15,
                                    "author": "amateur_mistake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m assuming that’s why they charged him with 37 counts. They have more too so unless the judge plans on pardoning him for other crimes they haven’t brought forward or can nullify evidence they haven’t shared, she’s gonna have some problems clearing trump from trial.",
                                            "score": 9,
                                            "author": "Pleasant-Rutabaga-92",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Judges don't give pardons.    However, I think I take your meaning.\n\nShe will absolutely be within her power to declare certain evidence inadmissible.  That could be a reason for the prosecution to go to a higher court for appeal though.  And if they end up doing that and winning enough, that is a way to get her removed from the case.     \n\nShe really doesn't have to \"Clear Trump from trial\" (I'm not a hundred percent sure what you mean there).    \n\nShe just needs the trial to actually start with a jury.   Once that happens, there are dozens of options to end the case.  And because of double jeopardy, Trump could never be charged again.",
                                                    "score": 4,
                                                    "author": "amateur_mistake",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;\tJudges don’t give pardons.    However, I think I take your meaning.\n\nYeah apologies, I was being facetious same with the “clear from trial” part of my comment. \n\nYou’re right. There’s certainly cause for a lot of concern with her being the judge, but I’m confident that prosecutors have planned for this.",
                                                            "score": 3,
                                                            "author": "Pleasant-Rutabaga-92",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm with you.  I bet they have.  I am rooting for them.",
                                                                    "score": 1,
                                                                    "author": "amateur_mistake"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The prosecution already have grounds to ask for a new judge, the defencs has yet to be highered",
                                            "score": 12,
                                            "author": "roastbeeftacohat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They won't force her recusal based on her behavior in previous cases.  They are reluctant to do it at all.  They generally only force those things when there are obvious (often monetary) conflicts of interest outside of the case itself.   \n\nSo maybe the pictures of her wearing trump makeup on facebook and swearing loyalty to him could be enough but it is in no way guaranteed.  \n\nIn general, the argument of \"we need a judge who is more hostile to the defendant\" doesn't work and shouldn't.   Which is how this can be framed.  As grotesque as that is.     \n\nForcing a judge off of a case does not happen very often.   And all she really has to do is pretend normalcy until there is a jury.   If she can hold out that long, she can just end this whole thing forever.   \n\nI would like to be wrong and this is going to be an uphill battle.   I truly hope the DOJ has a plan.",
                                                    "score": -2,
                                                    "author": "amateur_mistake",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "She’s already been slapped once with being bias about this very case, they have every reason to remove her.",
                                                            "score": 10,
                                                            "author": "Lager89",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I mean, I think they do also.   The courts just don't do that though.  Because our legal system is largely bullshit.   \n\nThe times when they remove a judge are like when they decide to give someone probation for a very serious crime, then it goes up to a higher court that says \"No, the law requires prison time.\"  Then it goes back to the judge who assigns probation again.  Then repeat that 3-5 times.   \n\nOnly then do the courts decide to take a judge off of a case.      \n\nI hope the DOJ has a plan, because getting Cannon off this case will actually be hard.   And she can basically destroy the whole thing if she hits her marks correctly.",
                                                                    "score": 2,
                                                                    "author": "amateur_mistake",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "If there is one thing I am certain of, is that the DOJ has a plan.",
                                                            "score": 7,
                                                            "author": "Visual-Hunter-1010",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And I am rooting for them.   I think they can get it done.",
                                                                    "score": 2,
                                                                    "author": "amateur_mistake"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If she doesn’t recuse herself voluntarily, her court will likely expel her.",
                                            "score": 6,
                                            "author": "LordRaeko"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She won’t be the sitting judge. This is a federal case , not a backwater Everglades kangaroo court. And this case is under granular examination by the other federal offices as well as the press.\n\nI may be in the minority, but I think the only way he escapes consequences is by dying before they read the verdict.",
                            "score": 21,
                            "author": "2manyfelines",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Since so many of the alleged crimes occurred not only in Florida but also in New Jersey (and who knows where else), could the DoJ simply file another indictment in another state if the FL case were to be dismissed?",
                                    "score": 2,
                                    "author": "SerDigbyChicknCzar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Theoretically, yes. But he committed federal crimes and the state of Florida has no jurisdiction over the case. Also, a grand jury made up of Florida citizens agreed to indict him. \n\nThe DOJ actually chose the Southern District of Florida because it is a very efficient court. It is used to hearing everything from drug trafficking to money laundering to endangered animal smuggling. It has historically been really good at the process of court.\n\nBut, let me tell you. I live in Texas, the reddest of States and one with similar problems to Florida. If this case were heard in Dallas or Harris County, I have zero doubt he would be convicted.",
                                            "score": 2,
                                            "author": "2manyfelines",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Music to my ears. Thank you for setting me straight",
                                                    "score": 2,
                                                    "author": "SerDigbyChicknCzar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We aren’t there yet, but it sure as hell is a start,\n\nAlso, we are putting Ken Paxton, the Texas AG who got Roe overturned, in prison. And black Alabama voters won their case to stop Republican gerrymandering, and, as that takes shape in Southern states, it should flip the House back to blue.\n\nIt was a good week for democracy.",
                                                            "score": 2,
                                                            "author": "2manyfelines"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thankfully, she doesn't have the power to unilaterally shut things down. I don't know why people keep bringing this up like it's certain doom. Hell, after the way she was shut down last time, I wouldn't be surprised if she's forced to recuse herself and accepts so she doesn't have to get owned again.",
                                    "score": 7,
                                    "author": "SarcasticCowbell"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Problem is we have people in power that are willfully lying to save this guys ass just to keep his base in their side or they lose. The rhetoric they are using is seriously dangerous to this country and no one is doing anything about it.",
            "score": 144,
            "author": "shiftdnb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly this. \n\nPrivately, these GOP lying hypocrites know that Trump's committed serious federal crimes and are actually hoping he goes down for those crimes but they will never say it publicly for fear of being primaried and/or losing out on the goldmine (aka all the votes and donations from Chump's easily-persuaded, brain-dead base) when Chump is eventually found guilty. So they go along with the lies, regardless of the immnense damage it's caused and will continue to cause on the country. \n\nIn the end, all these p.o.s. will ever care about is themselves, which is basically the description of Republican/conservative voters: it's all about me, myself and I, and fuck everyone else, *especially if you're not white*.",
                    "score": 67,
                    "author": "VeryBadThings67",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The only color that matters to these people is green. Ask Clearance Sale Thomas.",
                            "score": 20,
                            "author": "Redditmodsrcuntz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Green and Red",
                                    "score": 2,
                                    "author": "signaturefox2013"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly the damage to the country has already been done.  It will be decades, if ever, before our allies can trust us again knowing a former president, and one tens of millions of Americans and most of the Republican Party still support, potentially shared their most top secret information with others.  The fallout from this has just begun.",
                    "score": 44,
                    "author": "TooAfraidToAsk814",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep.",
                            "score": 3,
                            "author": "square_so_small"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When a person doesn't have a good defense, desperation is all they have left.",
            "score": 62,
            "author": "GratefulPhish42024-7",
            "replies": [
                {
                    "level": 1,
                    "comment": "When you have the law on your side pound the law. When you have the facts on your side pound the facts. When you're Donald Trump's lawyer pound your head on the nearest brick wall.",
                    "score": 46,
                    "author": "JohnBramley",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And find a good lawyer for yourself once the concussion heals.",
                            "score": 8,
                            "author": "Cyneheard2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm pretty certain the evidence Smith culled will pretty much shoot down any attempt to either absolve Donald's involvement, or deflect to sacrificial goats. I think especially the tactic of deflecting is as tired as the delay. All of their strategy revolve around these two concepts + bringing up whataboutisms of unsubstantiated/disproven crimes committed by others.",
            "score": 52,
            "author": "jjjijjji",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the indictment does a good job of using his own words to prove he knows how sensitive these documents are and how they should be handled. Of course he meant it towards Hilary but now it’s biting him in the ass.\n\nThen they have evidence and testimony of him trying to hide and keep the documents after being asked for them, which is how they got the co conspirator.\n\nI didn’t really see it touch on charges for showing documents, but it proves he knowingly did and knowingly shouldn’t have. I don’t see any counter argument to the charges that would get a not guilty outcome.",
                    "score": 40,
                    "author": "Unlucky_Clover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It'll be interesting how the \"missing\" documents-requested is addressed. I mean we all know they have probably been sold to either the Saudis, N. Koreans, or Russia, or, he still has them and using them as collateral (probably stashed under Eric's car- or bunk-bed).",
                            "score": 11,
                            "author": "jjjijjji",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What I don’t understand is the indictment mentioned the golf club at Bedminster NJ multiple times. Trump showed the missing documents there at least twice. Why has that place not been searched? With how Trump treated the documents, I wouldn’t be surprised if he left it in a drawer. I also believe he was around the Saudis during this time, or at least one time, so it’s highly suspicious circumstances on a missing document(s).",
                                    "score": 13,
                                    "author": "Unlucky_Clover",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ditto.  Is it something the govt is keeping out of the press?  What's the deal?  It's obvious Trump had no problem ignoring all the laws.  There's no reason why he wouldn't have moved the classified docs to any of his other properties.",
                                            "score": 6,
                                            "author": "gokism"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I bookmarked this long ago for my S.O.: https://www.businessinsider.com/mar-a-lago-fbi-wont-raid-other-trump-properties-bedminster-trump-tower-ex-doj-predicts-2022-8?op=1",
                                            "score": 3,
                                            "author": "jjjijjji"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Of course he meant it towards Hilary but now it’s biting him in the ass.\n\nThis equally applies to the \"lock her up!\" thing.",
                            "score": 6,
                            "author": "thuktun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Whataboutism is their only defense.",
                    "score": 6,
                    "author": "beekeeper1981"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it looks like desperation, sounds like desperation, and stinks of desperation, it's desperation.",
            "score": 149,
            "author": "Heelajooba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no, it’s much, much, more desperate than that…",
                    "score": 33,
                    "author": "Spottswoodeforgod"
                },
                {
                    "level": 1,
                    "comment": "Gonna be the best movie, the ending no matter the outcome is just a bonus at this point",
                    "score": 10,
                    "author": "F1lthyAn1m4L",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read this in Trumps voice.",
                            "score": 3,
                            "author": "Joloven"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think the only \"defense\" that might work is stalling until the election, getting elected again and pardoning himself. \n\nI don't know how actually realistic that is, but the fact that it's  a non-zero chance is disturbing.",
            "score": 46,
            "author": "Naiehybfisn374",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really, I'm thinking *any* republican president immediately pardons and pushes the DOJ to go after Hunter Biden, while fishing for something against Hillary and Joe. \n\nEvery perceived indignity suffered by godboy Trump will be met in spades with Republican vengeance.",
                    "score": 29,
                    "author": "stupidlyugly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can't if they never hold a majority every again",
                            "score": 7,
                            "author": "PrestigiousStable369"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m pretty confident Biden would beat Trump again, especially given all the legal issues that have come to light over the past year.\n\nWhat I’m worried about is Biden dying right before the election.\n\nWhat happens? Does the second-place primary candidate take his place? Kamala? Either way, Trump would almost certainly win because the incumbent advantage is lost and neither Kamala nor any of the few Democrat primary candidates are very popular.\n\nEchoes of RBG passing away weeks before the 2020 election. \n\nI know I’ll be nervously checking the news every day until Nov 6th.",
                    "score": 5,
                    "author": "fe-and-wine"
                },
                {
                    "level": 1,
                    "comment": "Thus was my question, since trump fors through lawyers like crazy, could he simply always claim his \"new\"defense needs time to prepare?",
                    "score": 3,
                    "author": "bderr1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Criminal trials are different.  In order to fire his attorneys,  he would need to get the approval of the court.",
                            "score": 3,
                            "author": "smurfsundermybed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I assumed as much, but knowing trump...",
                                    "score": 2,
                                    "author": "bderr1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "While the judge did show a lot of deference to trump the last time, keep in mind that her actions caused the higher court to yank her chain. Hard. And this time, everyone is watching closely.",
                                            "score": 4,
                                            "author": "smurfsundermybed",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; getting elected again and pardoning himself. \n\nHe does not need to pardon himself at all in the beginning. The president has full executive control and can stop DOJ immediately without any issue. He only needs to pardon himself before the end of his second term.\n\nRegardless, some here make it seem like this is a done deal, pro tip it is not.",
                    "score": 1,
                    "author": "Impossible-Sea1279",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what Nixon tried and look how well it turned out.",
                            "score": 2,
                            "author": "Eisn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Didn’t two of his lawyers quit after the new indictment? It baffles me how his staunchest supporters are never bothered that he cannot keep attorneys. It’s just not normal to have to constantly seek new counsel. But they seem to be fine with it instead of thinking that maybe, just maybe, the problem is trump.",
            "score": 26,
            "author": "Electrical_Beyond998",
            "replies": [
                {
                    "level": 1,
                    "comment": "They quit cause they're going to be called as witnesses against him.",
                    "score": 25,
                    "author": "Generallybadadvice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People have postulated several reasons for their “quitting”.  \n\nSome people feel that the game show host fired them for not stopping the indictment against him.\n\nSome people think, as you stated, that they might be called as witnesses.\n\nSome people have postulated that they quit when they realized trump is famous for not paying his attorneys, and this case is going to eat all of their time, possibly for years.  It will be impossible to take other cases, ones that actually pay.  So they quit.  Someone even suggested that they asked for money upfront, and when it was refused, they walked.\n\nAll perfectly good reasons to get the hell out of there.",
                            "score": 14,
                            "author": "readerf52",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My personal opinion is that they quit right before arraignment so trump can extend it out for lack of counsel. \n\nWith it being Cannon, there's no doubt that she will allow it and probably give him months to find counsel and get them up to speed, which puts it right at the time when campaign season starts. \n\nHe'll use that extension as a grift point, which I understand he has already begun.",
                                    "score": 8,
                                    "author": "eyeflyfish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Anyone that thinks he’s going to be in jail before the election is kidding themselves. That trial won’t start until well into 2024",
                                            "score": 1,
                                            "author": "ill0gitech",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The 11th court is known as the \"Rocket Docket\" and Smith agrees that a speedy trial (as enshrined in the constitution) is the best for the trial. It should be done by the end of the year. \n\n(He says looking at the aged like milk subreddit)",
                                                    "score": 5,
                                                    "author": "phoneusername"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He has a legitimate strategy of trying to delay this trial until he can become president again and pardon himself.\n\nIs it stupid and corrupt and something an 8 year old would think of? Yes. And sadly also viable.",
                                                    "score": 3,
                                                    "author": "we_are_sex_bobomb"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They’re not getting out of dodge or not being paid they’re witnesses to the crimes. Read the indictment. It’s in there.",
                                    "score": 6,
                                    "author": "-dsp-"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "let’s examine the trump strategy:  delay delay delay delay delay.  He fires lawyers at this point as a delay tactic.  it’s not like we haven’t seen this before.",
                    "score": 3,
                    "author": "jonny_jon_jon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "His best defense at this point is to start making a plea deal",
            "score": 19,
            "author": "Head_Albatross3265",
            "replies": [
                {
                    "level": 1,
                    "comment": "The only plea deal I think the American people would accept, is that he doesn’t run for office but he turns over every  shred of dirt he has on the Republican Party and every crime a Republican has committed, at least that’s what I want",
                    "score": 22,
                    "author": "Luke95gamer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would take that. Also add that he is banned from ever making a public statement, interviews, social media, etc.",
                            "score": 9,
                            "author": "Diligent-Will-1460"
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn't accept that. He needs to be held personally accountable for his actions, our democracy depends on it.",
                            "score": 7,
                            "author": "stevez28"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Normal us attorney offices have like 90-95+% plea rate because they don’t indict unless all the evidence is there.",
                    "score": 5,
                    "author": "th3on3"
                },
                {
                    "level": 1,
                    "comment": "I don't think DOJ is/will offer a plea deal with that one document that is missing....",
                    "score": 2,
                    "author": "lyn73"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; According to Parlatore\n\nThat's the first clue that a lie/complete bullshit is coming next.\n\n&gt; Parlatore claimed that Trump, under the presidential records law, **had two years to review documents** shipped from the White House to Florida before being required to send presidential papers to the National Archives.\n\nA lie/complete bullshit.\n\n[National Archives refutes claims Trump had two years to go through presidential records in rare public statement](https://www.cnn.com/2023/06/09/politics/national-archives-refutes-trump-claim-classified-documents-indictment/index.html)",
            "score": 17,
            "author": "VeryBadThings67",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are those pesky facts again.",
                    "score": 7,
                    "author": "RegattaJoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I often wonder what TFG does every day. He must be using several phones a day to keep up with his legal issues with meetings and calls….it must start early and go all day.  His stress level must be eating at his life expectancy daily. \n\nIt’s the best show on right now…no one knows how it’s going to end, and it will go on for a while. I like to watch a different news station each night to hear what both sides are saying.\n\nI keep myself healthy, just so I can live long enough to piss on the guys grave. Sure, I’ll get arrested, but that will be my 15 minutes of fame. It will be worth it.  I’ll get a great lawyer who will get me out of it for being insane.",
            "score": 12,
            "author": "Senorbuzzzzy"
        },
        {
            "level": 0,
            "comment": "Simple point...\n\nWhen clients ask their lawyers to conspire with them, the \"attorney client privilege\" disappears because the lawyer is now a co-conspirator in the alleged crimes.",
            "score": 13,
            "author": "duchessofalabama",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crime-fraud exception, yo.",
                    "score": 5,
                    "author": "RegattaJoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They should just go for the Shaggy defense.\n\n\"It wasn't me.\"",
            "score": 29,
            "author": "raevnos",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought you meant the other Shaggy. \"Like not cool man.\"",
                    "score": 17,
                    "author": "ControlLayer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Zoinks! Like, it wasn't me Scoobs!?",
                            "score": 9,
                            "author": "Responsible-Still839",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But she caught in the scoob snacks? It rasn’t me raggy reheeheehee!",
                                    "score": 3,
                                    "author": "Chashoef"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "*They found the docs at Mar-a-Lago?*\n\n*Wasn’t me*\n\n*They found more docs in my crapper?*\n\n*Wasn’t me*\n\nThey even got me on tape!\n\n*Wasn’t me*",
                    "score": 2,
                    "author": "ill0gitech"
                },
                {
                    "level": 1,
                    "comment": "The \"whatabout\" defense is their goto.",
                    "score": 1,
                    "author": "smeagol90125"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like Trump’s strategy of just falsely denying the government owns the records. Sounds like a winner to me.   /s.",
            "score": 8,
            "author": "Utterlybored"
        },
        {
            "level": 0,
            "comment": "MAGA\n\nmake attorneys get attorneys\n\nmake assistants get attorneys\n\nmake anyonewhoworksforme get attorneys",
            "score": 7,
            "author": "NoLack5170"
        },
        {
            "level": 0,
            "comment": "Revealing these national defense and nuclear secrets was way worse than I could have imagined. Trump put countless lives of military and other personnel at risk.\n\nThere's no defense, they have Trump recorded and verified by multiple witnesses admitting to the crimes, admitting he knew they were crimes AND admitting he was instructing his attorneys to commit additional crimes to hide the previous crimes by instructing attorneys to make documents disappear.\n\nTrump is fucked.",
            "score": 6,
            "author": "fuckaliscious"
        },
        {
            "level": 0,
            "comment": "&gt; potential Trump indictment defense strategies\n\n*It didn't happen.*\n\n*And if it did, it wasn't that bad.*\n\n*And if it was, it's not a big deal.*\n\n*And if it is, that's not my fault.*\n\n*And if it was, I didn't mean it.*\n\n*And if I did, you deserved it.*",
            "score": 8,
            "author": "NeoPstat"
        },
        {
            "level": 0,
            "comment": "&gt; At least some of that alleged misconduct, according to Parlatore, focuses on Justice Department counterintelligence chief Jay Bratt’s team’s obtaining a search warrant for Mar-a-Lago in August. Parlatore claimed that Trump, under the presidential records law, had two years to review documents shipped from the White House to Florida before being required to send presidential papers to the National Archives.\n\n\nTrump may have had two years to review presidential papers, but his deliberate taking of classified military documents, improper storage of said documents and showing these classified documents to people without security clearances, were criminal.",
            "score": 51,
            "author": "Shr3kk_Wpg",
            "replies": [
                {
                    "level": 1,
                    "comment": "[National Archives refutes claims Trump had two years to go through presidential records in rare public statement](https://www.cnn.com/2023/06/09/politics/national-archives-refutes-trump-claim-classified-documents-indictment/index.html)",
                    "score": 65,
                    "author": "SimplyTennessee"
                },
                {
                    "level": 1,
                    "comment": "Let's not forget having *certain* boxes moved but leaving others for return, suggesting lawyer 1 could 'pluck' out 'the bad ones' and \"this is secret....look!\"",
                    "score": 15,
                    "author": "bruceleeperry"
                },
                {
                    "level": 1,
                    "comment": "Two years of *plausible deniability*, not two years of waving around classified docs and yelling \"look how cool I am!\"",
                    "score": 10,
                    "author": "dravenonred"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's because it's not a defense as much as it is damage control.",
            "score": 6,
            "author": "hotpackage"
        },
        {
            "level": 0,
            "comment": "None of this would have ever happened if he was capable of honesty",
            "score": 6,
            "author": "Nabrok_Necropants"
        },
        {
            "level": 0,
            "comment": "The fact that his lawyers quit reeks of desperation.",
            "score": 5,
            "author": "michaelorth"
        },
        {
            "level": 0,
            "comment": "Whatever else happens, that tape cannot be defended. It's insane how precisely he incriminates himself and substantiates the accusations. There's no way to overcome that tape, and whatever that document was (I think it was the Iran invasion plan) will doom him.",
            "score": 5,
            "author": "3SquirrelsinaCoat"
        },
        {
            "level": 0,
            "comment": "Doesn’t help when you have a reputation for throwing your lawyers under the bus and not paying them. He could undoubtedly have much better counsel otherwise but of course he’s not gonna listen to anyone so it probably doesn’t matter regardless",
            "score": 6,
            "author": "th3on3"
        },
        {
            "level": 0,
            "comment": "You mean the defense strategy of 2/3 of your legal team resigning, with no replacement?",
            "score": 5,
            "author": "WateryTartLivinaLake",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m fairness to the lawyers, they are likely to be busy soon defending themselves as Co-conspirators",
                    "score": 2,
                    "author": "J_ablo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A motion to dismiss is standard; ask a partisan and you will get a partisan answer.",
            "score": 3,
            "author": "BobbyB90220",
            "replies": [
                {
                    "level": 1,
                    "comment": "The 11th Circuit would be on her like a chicken on a june bug.",
                    "score": 2,
                    "author": "RegattaJoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For a guy that is so adamant that he has done no wrong, you would think that he would insist on a swift trial.  Yea, that's not going to happen!",
            "score": 3,
            "author": "Confussed25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Instead the Special Counsel wants a quick trial. The indictment says they only need 21 days to make their case in court.",
                    "score": 4,
                    "author": "alien_from_Europa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Special Counsel has spent a lot of time getting this case together. No big surprise that they want to get the trial started sooner than later.",
                            "score": 3,
                            "author": "Confussed25"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can the trump judge that is over the arraignment dismiss the charges if they file that motion? She has shown already that she will go out of her way to protect the orange terd.",
            "score": 3,
            "author": "Shaman7102",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hypothetically, she could grant a motion to dismiss but it’d be overturned by the 11th Circuit so fast she wouldn’t know what hit her.",
                    "score": 3,
                    "author": "RegattaJoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Assuming he is found guilty on a pile of charges, if he only gets fined (even if it’s several million), I’m going to really unhappy. He has done plenty to deserve the rest of his days be spent behind bars. Throw his orange ass in a supermax.",
            "score": 3,
            "author": "Away_Ad_5328"
        },
        {
            "level": 0,
            "comment": "The evidence\nBefore the court is\nIncontrovertible \nThere’s no need\nFor the jury to retire",
            "score": 3,
            "author": "Boondala"
        },
        {
            "level": 0,
            "comment": "Trump is screwed in every direction imaginable.",
            "score": 3,
            "author": "zoroddesign"
        },
        {
            "level": 0,
            "comment": "I’m betting DOJ offers Nauta a plea deal to testify against Trump….",
            "score": 3,
            "author": "pjvincentaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "He would be a lunatic not to take it.",
                    "score": 3,
                    "author": "J_ablo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Desperation is a stinky cologne.",
            "score": 2,
            "author": "Great-Heron-2175"
        },
        {
            "level": 0,
            "comment": "tRump should use the Chewbacca defense.\n[Chewbacca defense ](https://youtube.com/watch?v=aV6NoNkDGsU)",
            "score": 2,
            "author": "senorvato"
        },
        {
            "level": 0,
            "comment": "Well he doesn't really have any good lawyers left now. Everyone working for him now is the shady type",
            "score": 2,
            "author": "jmaneater"
        },
        {
            "level": 0,
            "comment": "Other than he’s dumb idk 🤷🏽‍♂️ what he would say",
            "score": 2,
            "author": "BUSYMONEY_02"
        },
        {
            "level": 0,
            "comment": "“Sir, you don’t want a criminal lawyer, you need a lawyer that is a criminal.”",
            "score": 2,
            "author": "Fenderjazzbass4"
        },
        {
            "level": 0,
            "comment": "\"Your honor, I'd like to plea insanity.\"\n\n\"Ok Mr Trump, while I struggle to understand your strategy, it's clear you've discussed this with your counsel so I will enter your plea as *not guilty due to temporary insanity*\"\n\n\"No no, not *temporary* insanity, the other kind\"",
            "score": 2,
            "author": "PuterstheBallgagTsar"
        },
        {
            "level": 0,
            "comment": "The reek is overwhelming.",
            "score": 2,
            "author": "Earth_1st"
        },
        {
            "level": 0,
            "comment": "I'm amazed Trump didn't just duck out of here to some resort abroad.\n\nHe's 76 years old...  he could have happily retired.",
            "score": 2,
            "author": "Mindraker"
        },
        {
            "level": 0,
            "comment": "You mean they can’t just attack the prosecutors like Fox News :D",
            "score": 2,
            "author": "trogdor1234"
        },
        {
            "level": 0,
            "comment": "There is very little chance DOJ has overlooked anything with indictment. With these charges, he will get some leniency by pleading guilty. Of course, he won’t do this.",
            "score": 2,
            "author": "99999999999999999901"
        },
        {
            "level": 0,
            "comment": "Lock him up!",
            "score": 2,
            "author": "hans_guy"
        },
        {
            "level": 0,
            "comment": "If the facts are against you, argue the law. \n\nIf the law is against you, argue the facts. \n\nIf the law and the facts are against you, pound the table and yell like hell \r― Carl Sandburg",
            "score": 4,
            "author": "Troll_in_the_Knoll"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No. If she dismisses on day one there will be no negative professional repercussions.\n\nShe has lifetime appointment and Congress won’t remove her.\n\nShe’ll be declared a saint by the fascists and showered with riches.",
                    "score": 2,
                    "author": "tendervittles77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She won't dismiss on day one because that could be appealed.    \n\nShe will take clues from Trump's lawyers on whether they want to delay, then she will delay the trial.   Instead of taking a year, maybe it will take five.   \n\nThen she can pretend to be sane until a jury is involved.   Once that happens, she can dismiss the case and Trump can't ever be charged again because of double jeopardy.   \n\nIf she actually lets the jury make a ruling, which seems almost impossible, she can just decide that he gets no punishments for his crimes.   That could be appealed though.",
                            "score": 2,
                            "author": "amateur_mistake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Let’s calm down.  Unless I’m missing something, she’s only been assigned the arraignment at this point.  The trial judge has not been appointed.",
                                    "score": 2,
                                    "author": "RegattaJoe"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks.\n\nI have a problem doom spiraling.",
                                    "score": 1,
                                    "author": "tendervittles77",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know that the people at the DOJ know all of this and are smarter about it than I will ever be.   I truly hope they have a plan.  I assume they do.  \n\nUnlike the moderates in our world who desperately want to keep the status quo in the face of *obvious* corruption, prosecutors really want to win their cases.   \n\nSo we will see.",
                                            "score": 2,
                                            "author": "amateur_mistake"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When the facts are on your side, pound the facts. When the laws on your side, pound the law. If neither the facts or the law are on your side, pound the table\n\n-2 Corinthians 4:12",
            "score": 2,
            "author": "BraveOmeter"
        },
        {
            "level": 0,
            "comment": "Only real viable defense Trump has is 2024 election.\n\nThe question is then, how stupid is Trump voters (the majority of white American voters).",
            "score": 3,
            "author": "ExpressPoint9912",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; the majority of white American voters\n\nYou make their case when you find the need to constantly make everything about race. How about treating people on the content of their character, I am sure I heard that once from an important figure in American history.",
                    "score": 3,
                    "author": "Impossible-Sea1279",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "White voters favored Trump over Biden by almost 60 to 40 in 2020.",
                            "score": 1,
                            "author": "ExpressPoint9912"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s desperation in the Mar-A-Largo region of Florida, everywhere else it is sparkling patheticness.",
            "score": 1,
            "author": "llahlahkje"
        },
        {
            "level": 0,
            "comment": "lol, I gets it.  reading the actual indictment was pretty good.",
            "score": 1,
            "author": "Bursuc23"
        },
        {
            "level": 0,
            "comment": "His only realistic option here is a pardon. \n\nHe should work on that",
            "score": 1,
            "author": "riverbedwriter"
        },
        {
            "level": 0,
            "comment": "Is’nt Clarence Thomas the SCJ overseeing the 11th circuit? He handles emergency applications for this circuit. This is a ridiculous coincidence.",
            "score": 1,
            "author": "Paulbunyip"
        },
        {
            "level": 0,
            "comment": "What scares me is this case was assigned to a completely unqualified hack judge who did Trumps bidding during the search warrant “special master” debate and had to be dragged in front of the Appeals circuit. She’s going to throw every wrench she can at this case, and perhaps the prosecution can get her biased a** replaced.",
            "score": 1,
            "author": "Pineapple_Express762",
            "replies": [
                {
                    "level": 1,
                    "comment": "Arraignment only.  No judge has been assigned the trial.",
                    "score": 5,
                    "author": "RegattaJoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh…it sounded like she got the case itself",
                            "score": 1,
                            "author": "Pineapple_Express762",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not to my knowledge.  Just because she was assigned the arraignment doesn’t mean she’s got the whole thing.",
                                    "score": 4,
                                    "author": "RegattaJoe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good",
                                            "score": 2,
                                            "author": "Pineapple_Express762"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd argue that Judge Cannon being in charge is itself a defense strategy.",
            "score": 1,
            "author": "DonnyMox",
            "replies": [
                {
                    "level": 1,
                    "comment": "She’s not in charge.  She’s been assigned the arraignment.",
                    "score": 6,
                    "author": "RegattaJoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now every Republican candidate can campaign on pardoning Trump. This is a huge win for them.",
            "score": 1,
            "author": "lightranger",
            "replies": []
        }
    ]
}