{
    "id": "146gnp8",
    "score": 4919,
    "title": "Trump Supporters’ Violent Rhetoric in His Defense Disturbs Experts",
    "author": "eggmaker",
    "date": 1686445969.0,
    "url": "https://www.reddit.com/r/politics/comments/146gnp8",
    "media_urls": [
        "https://www.nytimes.com/2023/06/10/us/politics/trump-supporter-violent-rhetoric.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Also disturbed: literally everyone else",
            "score": 1023,
            "author": "fattymcassface",
            "replies": [
                {
                    "level": 1,
                    "comment": "For a long ass time, no less.",
                    "score": 297,
                    "author": "Infinite-Horse-49",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Remember them threatening “second amendment remedies” if enough republicans didn’t win elections?\n\nEdit:  oh, and the former President threatening it too if Hilary Clinton was elected?",
                            "score": 161,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"There's nothing you can do, folks although the Second Amendment people — maybe there is, I don’t know.”",
                                    "score": 21,
                                    "author": "MuscaMurum"
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 24,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Repost bot. [Comment](https://www.reddit.com/r/politics/comments/146gnp8/trump_supporters_violent_rhetoric_in_his_defense/jnq6mvk/) here.",
                                            "score": 6,
                                            "author": "jamesbra"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": " It’s a violent cult mob mentality.",
                            "score": 43,
                            "author": "CommitteeDixws",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right? I’m no “expert”, but I definitely find this disturbing",
                    "score": 88,
                    "author": "pterribledactyls",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I consider myself an expert...I was raised by these lunatics, I read Breitbart for fun....please don't sick the reddit help bot on me.  Unpopular opinion:  \n\n\nI believe Maga in it's current manifestation is dead in short order.  They will deny they ever knew him. The violence they're cosplaying at will not be coordinated. \n\nBut they will resurrect under the next prophet, who will be competent and won't be recognized at first.  Desantis is not it.",
                            "score": 102,
                            "author": "octopusboots",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"They will deny they ever knew him\"\n\nTrump = Jesus confirmed!",
                                    "score": 38,
                                    "author": "s1far",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jesus washed the feet of his disciples, Trump did too, with paper towel.  Jesus spent 40 days in the desert and resisted temptation to break his holy fast, and Trump did too, once, have to wait until his hamberder was delivered, when the shiftless asshole assistant was late.  Jesus loved prostitutes, and so does Trump.  Jesus said to visit the prisoner, and Trump is going to do just that.     \n\n\nIT'S THE SAME GUY.",
                                            "score": 48,
                                            "author": "octopusboots",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Those idiots are dumb enough to believe in that actually",
                                                    "score": 15,
                                                    "author": "Master_Bayters"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hey!",
                                            "score": 13,
                                            "author": "JesusSavesForHalf"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You/we are good resources in this-- have to know your opponent.\n\nAnd I believe you are right.",
                                    "score": 3,
                                    "author": "Ok-Inevitable-5698"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Seriously, experts in what?  Toking on a bong?  It’s almost never specified.",
                            "score": 27,
                            "author": "Foolazul"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you aren't concerned you either like it or you haven’t been paying attention",
                    "score": 20,
                    "author": "sixtus_clegane119",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“n’t”\nHere, you dropped this",
                            "score": 8,
                            "author": "RandyB1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And well we should be.  Fuck.",
                    "score": 8,
                    "author": "krunchberry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe it's his call to action to the Miami Courthouse on Tuesday",
                            "score": 6,
                            "author": "Enginening"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He's a walking head Case and so are his crazy cult followers. This turd is dangerous. He awakens the absolute worst in people.",
                    "score": 3,
                    "author": "rayrayruh",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah, doesn’t take an expert to be disturbed.  As a matter of fact, if they’re just now disturbed, I question their expertise.",
                    "score": 3,
                    "author": "amoorefan2"
                },
                {
                    "level": 1,
                    "comment": "All the more reason this case needs to be brought to a just conclusion.",
                    "score": 2,
                    "author": "OneYouhgh"
                },
                {
                    "level": 1,
                    "comment": "Experts like Chuck Todd were the last to notice",
                    "score": 2,
                    "author": "Skooby1Kanobi"
                },
                {
                    "level": 1,
                    "comment": "Lol, came here to say that!!",
                    "score": 2,
                    "author": "lolitalula"
                },
                {
                    "level": 1,
                    "comment": "Specifically about political violence, it's almost uncanny",
                    "score": 2,
                    "author": "Ok-Inevitable-5698"
                },
                {
                    "level": 1,
                    "comment": "Everyone *except* law enforcement.",
                    "score": 2,
                    "author": "TheRynoceros"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These loudmouth, gun fetish shitheads aren’t going to do one goddamn thing because they’re a bunch of loser, victim mentality crybabies who haven’t been able to adjust to the changes in American society for the last 40 years. \n\nThey wrap themselves in a flag they don’t believe in, carry a bible they haven’t read, and call themselves patriots in the most self-unaware and ironic way imaginable. \n\nAll they know is grievance politics because it conveniently relieves them of the need for both critical thinking and introspection, and they’ll believe and do anything a rancid, orange, traitorous rapist grifter tells them because he feeds their hate.\n\nGood luck taking up arms with your AR-15s against the actual US military that, to a woke woman, man, and yes, any LGBTQ+ orientation you can imagine, swore an oath to support and defend the Constitution against all enemies, including domestic seditionist asshats like you.\n\nYou’re better off just sticking to what you know and are capable of, like shooting up schools.\n\nPiss off, wankers. The rest of us have no time for your weak, fake bullshit.",
            "score": 188,
            "author": "TestFlyJets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hear! Hear!",
                    "score": 11,
                    "author": "RodIron1"
                },
                {
                    "level": 1,
                    "comment": "Conservatives aren’t the only Americans exercising 2A.  See r/liberalgunowners for example.",
                    "score": 20,
                    "author": "warblingContinues",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only gripe I have with that sub is that you *must* approach conversation from a pro-2A stance.... what seems to me a 2A stance derived from a conservative's definition of it. \n\nI own guns. I have no issue with people owning guns for hunting, self-defense, sport shooting or what have you... but I dont believe owning guns should be a right as much as a revokable privilege.",
                            "score": 20,
                            "author": "aqlu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Reading this comment was so satisfying. Thanks.",
                    "score": 3,
                    "author": "5G_Robot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He is a domestic terrorist.",
            "score": 179,
            "author": "AutoBot82"
        },
        {
            "level": 0,
            "comment": "It’s all they have. Intimidation is all they have left.",
            "score": 133,
            "author": "Hoobs88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Intimidation has been DT’s MO for most of his life and unfortunately it seems to have worked for him. I hope it has finally run out for him and that he gets everything that he rightfully deserves",
                    "score": 44,
                    "author": "Pauly_Walnutz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They’re (not their or there) like Putin. No wonder they love him.",
                    "score": 11,
                    "author": "MSMB99"
                },
                {
                    "level": 1,
                    "comment": "It’s the same thing when you argue with an idiot. Once you’ve thoroughly demonstrated their arguments are bullshit, instead of examining their ideology, requiring they experience a mournful period of self reflection, self doubt, self discovery and experience sadness, embarrassment, loneliness, victimization… etc … instead of processing any of that and growing as a person, they find it much easier to double down and take it personally so they feel justified jumping to the only emotion they understand other than horney… they jump to anger. Angry they can’t just force the world to work in a way which it ought to, according to themselves. \n  \nAnger is impotant though, causing the person distress as it seethes and humiliates, stewing inside. Unfortunately once they realize their anger is as impotant as their ideology, they feel a justification in threatening or using physical violence/force. This intimidates people forcing them into a situation where they shut up, or they’re beaten into  submission, both results convenient for the idiots because now they don’t suffer from chronic cognitive dissonance, and they feel happiness from their power trip, reinforcing the behavior.\n  \nThe same kind of people who never apologize for anything, and always shift blame back to the person they’ve wronged.  \nThey’re also not curious or empathetic people who never ask honest questions … They are only interested in the world if they get to shape the rules and how they belong and are perceived by others within their version of it. Instead of being interested in learning about the way the world is, it’s rather much easier for them to assume their own distorted view is accurate.   \n   \nThey just assume they’ve always been right, about everything they believe.   \n  \nThey often use their anger and their impotence as a cudgel to threaten and and silence anyone with different ideas. “Why should I live through the pain of all of those other emotions when I can just use anger and force to require those  around me to accept my position, or at least make them so uncomfortable that they shut up so I don’t have to be reminded of how intellectually and emotionally weak I am? “.  \n  \nNaturally anger and violence are the tools they’re most comfortable (if not the only tools they are comfortable with.) \n  \nTLDR  They can’t beat us with their brains, and because they are emotionally stunted adult children, they will instead try to beat our brains.",
                    "score": 27,
                    "author": "simeonthewhale"
                },
                {
                    "level": 1,
                    "comment": "Fantastic.  These assholes will slowly remove themselves from decent society.  Here is one idiot _who threw his life away_ and nobody gives a shit about him.  Guess he won't be voting for Loser Trump anymore.\n\n[Armed FBI attacker shot dead by police believed to be enraged Trump supporter]\n\nhttps://www.theguardian.com/us-news/2022/aug/12/fbi-attacker-trump-capitol-riot-truth-social",
                    "score": 14,
                    "author": "crog212"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Its because its a fascist party that is willing to use violence to get its way. The media needs to quit beating around the bush and being afraid to tell the truth.",
            "score": 686,
            "author": "sedatedlife",
            "replies": [
                {
                    "level": 1,
                    "comment": "But the media thinks they will still be able to handle the newest Goebbels.",
                    "score": 14,
                    "author": "Icarusmelt",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The people making the decisions in the media, as well as the Democratic Party leadership, are people who won't bear the consequences if the fascists get their way.\n\nI think one wise thing Democrats should do is abandon gun control and encourage gun safety, as well as community preparedness.\n\nThese fascists think they can do this because they're certain nobody will shoot back.",
                    "score": 123,
                    "author": "Screwball_Actual",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why abandon gun control? Something like 65% of Americans support it.",
                            "score": 87,
                            "author": "DavidDunn87",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "These fucking idiots think gun control takes away their guns. It’s just putting requirements and safety nets around gun ownership.",
                                    "score": 92,
                                    "author": "DweEbLez0",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Many circles have already started calling it Gun safety anyway just because people are too willing and eager to misrepresent it, just like with Climate Change. There were too many “gotchas” with “well what about when it’s cooooooold,” etc.",
                                            "score": 21,
                                            "author": "originalityescapesme"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well many of them would actually lose their guns as they probably are not owning them legally now to begin with.  Many are ex felons or actively in violation of some parole.",
                                            "score": 6,
                                            "author": "piejlucas",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Most of that 65% probably support some form of background check. \n\n“Gun control” is HELLA vague. \n\nThat fits into gun control. You see how that happened?",
                                    "score": 18,
                                    "author": "mashupsnshit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s what happens when folks vaguely word policy proposals. Republicans contort the verbiage in bad faith and run away with a false narrative: \n\nExamples: “gun control”, “defund the police”, etc.\n\nThen we’re left having to backtrack what was said. “What that *really* means is X”",
                                            "score": 16,
                                            "author": "my_Urban_Sombrero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Policy victim blaming is a new one. \"You should have written better policy if you didn't want us to misinterpret it intentionally\"",
                                                    "score": 8,
                                                    "author": "QuillVance",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If we really want gun reform we need to arm the people the right wants to protect itself against.  Nothing short of putting firearms in the hands of those 'not supposed to have them' is going to bring gun control.    \n\nThere should be minority gun drives.  There should be pride festivals where you can purchase guns.  \n\nYou'd see gun control then.  QUICKLY.",
                            "score": 4,
                            "author": "Yourmoms401k"
                        },
                        {
                            "level": 2,
                            "comment": "Just as long as I have a shot at that huge teddy bear if I hit three inna row.",
                            "score": 4,
                            "author": "BeeRye3"
                        },
                        {
                            "level": 2,
                            "comment": "Conservatives view gun safety as gun control.",
                            "score": 5,
                            "author": "markymarks3rdnipple"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And they call themselves patriots. What a joke.",
            "score": 238,
            "author": "wish1977",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because Republicans are paid actors, not real politicians. Everything they claim to stand for, is nothing more than a performance:\n\nSmall government? Nope, they bloat every piece of legislature they touch with caveats and loopholes for the explicit purpose of trying to force votes on unpopular measures.\n\nBalanced budget? Their policies are causing the worst debt crisis in history.\n\nPatriotism? When was the last time a Republican called for increasing pay of troops, and funding for VA hospitals? Or increasing veteran benefits in general? No, it is always personnel cuts. The grunt never sees a cent of the increased military budget, no matter how bloated.\n\nFreedom? They are the ones calling for violence against the LGBTQ, minorities, and immigrants. And for increasing the world's largest prison system. And for increasingly harsh punishments for crimes in general. And for the calling of military crackdown on protestors.\n\nThe economy? Not the average person's, that is for sure. Middle class is dying, all while they continue to pretend that only a rapist billionaire can save them, and don't even get me started on what they think of those in poverty.\n\nNo, for every single talking point they have, a thousand more examples about how they HARMED their position can be found. Their entire political platform is little more than a dog and pony show. And since they get paid big money to do a lot of pretending? They are nothing but paid actors. And the so-called \"media\" doesn't have an incentive to stop the programming.",
                    "score": 327,
                    "author": "ragingreaver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The payout in terms of easy-to-fudge campaign donations is a lot better for audacious negative politics than it is for honest legislating. These GOP fuckers did the math and decided they want the money, not the respect. Whether they keep their freedom is a gamble they are willing to take.",
                            "score": 30,
                            "author": "grunkage"
                        },
                        {
                            "level": 2,
                            "comment": "He's not a rapist billionaire, just a rapist millionaire deluding himself.",
                            "score": 12,
                            "author": "Bowman_van_Oort"
                        },
                        {
                            "level": 2,
                            "comment": "That’s because you guys don’t have a real democracy. Never had one either. It’s an illusion, a fake.\n\nThat’s why you end up with sociopathic clowns pretenders in government.\n\nIt’s a shame.",
                            "score": 23,
                            "author": "MarameoMarameo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is undoubtedly true. We have a “democracy” in about 20% of House districts and a couple handfuls of states in Senate and Presidential elections. Every other citizen knows the winning party in their general elections right this minute. \n\nBoth parties obviously are responsible for this, but Republicans leaned into it big time, with even Paxton admitting out loud he was able to prevent hundreds of thousands from voting in Harris County. So basically even the states that demographically are “turning purple”, the Repubs have the state governments so locked up that they can prevent any losses. Just as Trump wanted to do when he tried to overturn the election by saying screw the voters, let the state legislatures install me. \n\nI see no way out of it honestly. With an 80% uncontested House, we’re going to end up with more and more sideshow winners like Gaetz and Greene. All they have to do is be nuts enough to get noticed for the primaries, and win the “I’m the most MAGA” war, and they’re in.",
                                    "score": 20,
                                    "author": "Names_Stan",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's been my experience in just about everything that the louder someone screams about being something, they're usually the opposite.",
                    "score": 8,
                    "author": "TwooMcgoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IS KARI LAKE GOING TO BRING ALL 9 OF HER SUPPORTERS? WHAT WILL WE DO?",
            "score": 147,
            "author": "Tom-Cruises-plumber",
            "replies": [
                {
                    "level": 1,
                    "comment": "The funny thing about Kari Lake is having lost she is doing exactly what she promised she'd spend all her time doing if she had won, that is attacking people. What's especially nice about the \"L\" in Lake standing for Loser is we can just chose to totally ignore her, which is what most of the country has done.",
                    "score": 61,
                    "author": "FriesWithThat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I voted for Katie Hobbs here in Arizona and it’s prob one of the best decisions I ever made. Can’t even imagine if things had gone differently.",
                            "score": 47,
                            "author": "MobilePenguins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Have an upvote for Hobbs",
                                    "score": 19,
                                    "author": "cellocaster"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s almost like we were right when we said they were Nazis.",
            "score": 35,
            "author": "uGotSauce",
            "replies": [
                {
                    "level": 1,
                    "comment": "For four fucking years we've been told we're overreacting. I know it's rude to say \"I told you so\" but I think it's well deserved.",
                    "score": 5,
                    "author": "secretlyamimikyu",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know if it's just me but I have the feeling I had right before Jan 6. Like something is about to happen soon and no one is doing anything to stop it...Maybe it's his call to action to the Miami Courthouse on Tuesday",
            "score": 105,
            "author": "walkerb79",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whatever the security radius was in place, it definitely got doubled. But also, what are they gonna do? Whisk in and save Trump and transport him in a convoy to some compound? Takeover a courthouse? Just makes me nervous from the sheer uncertainty",
                    "score": 50,
                    "author": "Coup_De_Gras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just more innocent people get hurt or killed who have nothing to do with Trump's indictments.",
                            "score": 29,
                            "author": "BadAsBroccoli"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, this exactly. I am not looking forward to Tuesday. It could get ugly.",
                    "score": 28,
                    "author": "Beginning_Disk1539",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think they’ll be prepared this time. National Guard will be on standby. 3 letter orgs will be paying close attention I hope.",
                            "score": 21,
                            "author": "jereman75",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is Florida. DeSantis won't do shit to prepare.",
                                    "score": 16,
                                    "author": "dropbear_cum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They are competitors atm...",
                                            "score": 3,
                                            "author": "bunkSauce"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Last time TFG called for people to show up, like 10 people did. Even his rabid supporters are seeing far right leaders put away for sedition. Their golden pile of shit didn't save them. They know they can't get away with it, and in this case, Dump can't direct security resources away from the courthouse. The area is going to be very well protected, as the national guard can be deployed by the president or governor. We can't count on DeSNAFU to do it, but Biden for sure will.",
                            "score": 4,
                            "author": "Frank_Jesus",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They don't have shit. There literally isn't anything that can be done short of having Trump assassinated. They are calling for violence and protest and war, and you know what keeps happening?\n\nFewer and fewer people keep showing up to the rallies. Fewer and fewer people are becoming extremists. Fewer and fewer people are staying right-wing.\n\nThe culture of conservatives is on its last legs. They are raging like a cornered animal, yes. They will lash out. They will threaten and scream and kick. Trump likely will get off on technical or outright favoritism bullshit. But the beast is officially mortally wounded.\n\nUnfortunately, what comes after is going to be the true storm. Because once conservatism is dead, then comes the true war between capitalism and anti-capitalism. And that will kick off with the collapse of the economy, which is all but certain once companies begin reporting mass loss in profits caused from exhausting the income of the working class.",
                    "score": 31,
                    "author": "ragingreaver",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Norway, for example, is a capitalist country. Capitalism works just fine with some well meaning people in charge, or at least some social structures mandated in law.  Norway as a country and per capita, is rich as fuuuuuck.  Don't just look at gdp, add the wealth fund.\n\nThe problem is American laissez-faire capitalism. \n\nCan you imagine the usa nationalising all its oil and gas, investing the profits and using that humongous wealth fund for the benefits of its citizens? Nope lol. Cause thats what Norway did in the 70s/80s. They are now the largest investment fund in the world. Tiny country but they have something like $300k for every citizen in the country, growing every year.  The UK found roughly the same quantity of oil and gas in roughly the same area, the government allowed their corporate paymasters to take it all, for free. Because they said they would pay taxes on the profits (they didnt even do that lol) All because 'Reagonomics'/Milton Freidman/Thatcherism laissez faire bullshit. Now they have more charity run food banks than branches of mcdonalds and public services barely exist, even after being taxed through the arsehole.\n\nUsa and uk both followed this Chicago school of economics 'trickle down' crap and the poor got poorer and the already wealthy, got wealthier.",
                            "score": 32,
                            "author": "Bannedin_3_2_1",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Or millions of jobs disappear within a couple of years due to AI.",
                            "score": 7,
                            "author": "justconnect",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And*",
                                    "score": 10,
                                    "author": "cellocaster"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So start arresting them. Start not putting them on tv. Stop reporting on them.  Stop giving them views.",
            "score": 93,
            "author": "Carnivore_Crunch",
            "replies": [
                {
                    "level": 1,
                    "comment": "But that would seem so partisan!! \n\n/s/",
                    "score": 25,
                    "author": "BadAsBroccoli"
                },
                {
                    "level": 1,
                    "comment": "Billionaires won't let the media do that, because then that might start letting people get ideas about not voting for pro-billionaire politicians. And make no mistake, billionaires own every media platform in existence. It is long since high time that people began seeing most news sources as a threat.",
                    "score": 12,
                    "author": "ragingreaver"
                },
                {
                    "level": 1,
                    "comment": "Trump neofascists taking themselves out of circulation would be a good thing.   Like this asshole.\n\nhttps://www.theguardian.com/us-news/2022/aug/12/fbi-attacker-trump-capitol-riot-truth-social\n\n[Armed FBI attacker shot dead by police believed to be enraged Trump supporter]",
                    "score": 2,
                    "author": "crog212"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Say what it is.  Stochastic terrorism.",
            "score": 18,
            "author": "Quiet_Dimensions",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is actual terrorism at this point",
                    "score": 7,
                    "author": "DirtyReseller"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does the GOP have any adults in the room to stand up and put an end to this?",
            "score": 17,
            "author": "jwfowler2",
            "replies": [
                {
                    "level": 1,
                    "comment": "We will find out on Tuesday. \nI suspect the answer is no, the Republicans as a party have no allegiance to peaceful civil society. They will not spend political capital to step up to say “we should let the jury decide “. \nI pray I am wrong.",
                    "score": 9,
                    "author": "Febril"
                },
                {
                    "level": 1,
                    "comment": "Mitt Romney has tried, and the cult just dismisses him.",
                    "score": 17,
                    "author": "sgjo1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 45,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are vastly more armed Americans who are not members of the NRA than there are members of the NRA.",
                    "score": 36,
                    "author": "yrbmegr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": ":waves quietly from the back of the room:",
                            "score": 22,
                            "author": "Chihlidog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "r/liberalgunowners",
                                    "score": 6,
                                    "author": "warblingContinues"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She threatened the President of the United States, The Attorney General and the Special Prosecutor.  I think a visit by the FBI is warranted at this point.",
                    "score": 68,
                    "author": "candmjjjc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No no no, she *very clearly* stated that this was not a threat but rather a “public service announcement.” That makes it all cool, right?",
                            "score": 7,
                            "author": "Nurse_Hatchet"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How many fighter jets do you have, Ms. Lake?",
                    "score": 17,
                    "author": "authentic_mirages",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She’s only 10,000 Pepsi points away from getting her fighter jet.",
                            "score": 3,
                            "author": "found_a_penny"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why? Have y'all mfers not been paying attention for the last several years? This shit's par for the course for these assholes.",
            "score": 16,
            "author": "DAFUQisaLOMMY"
        },
        {
            "level": 0,
            "comment": "Ban fox like the dangerous drug it is.  \nIf i can't vape around children, then some aussie shouldn't be able to fash around our grandparents.",
            "score": 15,
            "author": "Living-Log-6956"
        },
        {
            "level": 0,
            "comment": "He’s gonna do it again… “SAD”",
            "score": 13,
            "author": "LoserBigly"
        },
        {
            "level": 0,
            "comment": "Disturbs experts, comes as no surprise whatsoever to the laymen.",
            "score": 13,
            "author": "FriesWithThat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As I have always told my son. When they are about to lose they are at their most dangerous. Be on guard.",
            "score": 11,
            "author": "besart365",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like a cornered animal indeed",
                    "score": 4,
                    "author": "originalityescapesme"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The US has a serious fascist problem right now. Unless the Justice Department amps up their efforts against this movement, I fear we are going to be in for a wild ride over the coming few weeks/months/years. Good for trying to stop Trump. But let’s not forget about the self-admitting 12-million other Americans who believe that a civil war and terroristic violence is somehow justifiable.",
            "score": 11,
            "author": "LostMyTakis"
        },
        {
            "level": 0,
            "comment": "The Dems and the remaining sane members if the GOP need to have a sit down and figure out how to fix this. We must return to the rule of law, regardless the party. These MAGA are criminals and if they are permitted to continue this could all get very dangerous.",
            "score": 29,
            "author": "Spin_Quarkette",
            "replies": [
                {
                    "level": 1,
                    "comment": "If there were \"sane\" Republicans, wouldn't they be calling for a stand-down, for calm on one of the national stations that cater to the right?",
                    "score": 22,
                    "author": "BadAsBroccoli",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s probably a few but a handful out of several hundred congressional reps doesn’t amount to much.",
                            "score": 2,
                            "author": "pliney_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At a minimum, Biggs the congressman on Twitter said, “We have now reached a war phase.\n\nEye for an eye.”\nHe should be censured in the House; if he isn’t it will be a sign that Republicans have no basic sense of a peaceful civic society. That kind of language should have no place among politicians who on Jan 6th 2020 were the targets of an attack by people who thought they could use violence and threats to overthrow the results of an election won by a candidate they did not support.",
                    "score": 8,
                    "author": "Febril",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "MTG was spouting out similar stuff today too, at whatever event she was at.",
                    "score": 4,
                    "author": "BlueCX17"
                },
                {
                    "level": 1,
                    "comment": "Under no circumstances does any Republican stray from the strict party line. Not even to get a pipeline built in their district to create jobs for their constituents.  \n\n**FOLLOW THE MONEY.**",
                    "score": 15,
                    "author": "DogyKnees"
                },
                {
                    "level": 1,
                    "comment": "If they still call themselves republicans then they are part of this.",
                    "score": 2,
                    "author": "GoNutsDK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd rather the headline read 'Trump's supporters violent rhetoric disturbs Americans'.\n\nEdit : Clariry",
            "score": 30,
            "author": "rms76"
        },
        {
            "level": 0,
            "comment": "If i say something isn't a crime while committing that exact crime....is that plausible to anyone?",
            "score": 7,
            "author": "MakeADeathWish",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt; If you want to get to President Trump, you are going to have go through me, and you are going to have to go through 75 million Americans just like me\n\nA bit optimistic. While there are some, not every republican shares the same level of batshit crazy \"screw law and order if I can't get what I want\". It's quite possible that some actually do have morals and boundaries.",
            "score": 8,
            "author": "upandrunning",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is fucking nuts. How is Kari Lake not in prison?",
            "score": 7,
            "author": "e4aZ7aXT63u6PmRgiRYT"
        },
        {
            "level": 0,
            "comment": "Time to call their bluff. Jan 6th showed us what a bunch of clowns these idiots are. Their “cream of the crop” is in prison.",
            "score": 7,
            "author": "mightyFoo"
        },
        {
            "level": 0,
            "comment": "I’m not an “expert” and it sure as shit disturbs me.",
            "score": 6,
            "author": "Sea_Dawgz"
        },
        {
            "level": 0,
            "comment": "Domestic terrorists",
            "score": 7,
            "author": "GearInteresting696"
        },
        {
            "level": 0,
            "comment": "Maybe we need to set up some defensive decoys that might wear them out? Mickey Mouse piñatas and gargantuan cans of Bud Light?",
            "score": 6,
            "author": "BeeRye3"
        },
        {
            "level": 0,
            "comment": "It disturbs non experts too",
            "score": 6,
            "author": "dangroover"
        },
        {
            "level": 0,
            "comment": "Rhetoric? Doesn't anyone remember 1/6? We've past that long ago.\n\nGOP/Trump are a \n\nCLEAR AND PRESENT DANGER",
            "score": 7,
            "author": "SeanOfTheDead1313"
        },
        {
            "level": 0,
            "comment": "They're not \"supporters\". It's a cult.",
            "score": 5,
            "author": "cyber_billy45899"
        },
        {
            "level": 0,
            "comment": "She’s looking haggard. Must be getting exhausting shoveling all that bullshit into MAGA mouths.",
            "score": 6,
            "author": "SnooCats1906",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Any expert that didn’t see that coming isn’t much of an expert.",
            "score": 4,
            "author": "brothers1201"
        },
        {
            "level": 0,
            "comment": "Start charging them with uttering threats!",
            "score": 5,
            "author": "OldDesmond"
        },
        {
            "level": 0,
            "comment": "There are so many more people who are heavily armed than these yeehawdists can conceive.  I am not worried.",
            "score": 20,
            "author": "yrbmegr",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am.  This isn't going to be a battle between any sort of standing armies.  If political violence does break out, it'll look like lone-wolf assholes bombing shit or going on shooting sprees.  We already have a problem with the latter.",
                    "score": 29,
                    "author": "PredatorRedditer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And they'll be all over social media getting called out for being the assholes they are. Like what happened in Virginia after a bunch of right wing nut jobs began attacking power stations with the explicit purpose of trying to bring down the grid around Richmond. People, rightly, called them terrorists, even if the media didn't report heavily on it.\n\nNo one wants war. Not even conservatives. And the more violent conservatives get, the less public support they have. Billionaire media is still trying to \"both sides\" the public in an effort to exploit them, but the talk is already out there: whoever shoots first is in the wrong; and conservatives are having a very difficult time saying it wasn't them.",
                            "score": 3,
                            "author": "ragingreaver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh great! They’ll be called assholes! Too bad all those people are still dead.",
                                    "score": 7,
                                    "author": "Oceanflowerstar"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://youtu.be/WOSqCjMRXWA",
                    "score": 7,
                    "author": "NoImpulsivePosting"
                },
                {
                    "level": 1,
                    "comment": "Americans fighting Americans should worry you, regardless of cause or results.",
                    "score": 2,
                    "author": "Nurse_Hatchet",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly these folks need to be rounded up and deprogrammed. It’s a violent cult mob mentality.",
            "score": 32,
            "author": "1mmapotato",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been wondering how to undo mass brainwashing for some years now. I still have no ideas.",
                    "score": 6,
                    "author": "myopicdreams",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cant help but feel like we just have to keep people from becoming newly brainwashed and just wait 30-60 years for the existing brainwashed to die off gradually.\n\nSome kind of de-fanging or something amounting to some form of sequestration perhaps in the mean time? I dont know what that would even look like. Like when you dont kill bacteria or a virus but you deactivate its ability to grow and reproduce? It would be great to neuter them somehow. (As a figure of speech. Not literally. Probably lol.)",
                            "score": 3,
                            "author": "Anamolica",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure how that could be done without becoming a society I would be equally afraid of living in.  Only light cures darkness and we are all human beings.",
                                    "score": 3,
                                    "author": "myopicdreams",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh i totally agree. Just musing out loud.",
                                            "score": 2,
                                            "author": "Anamolica"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Something like this? https://youtu.be/w80ZSg7kNbE\n\nHappy hut from Addams Family Values",
                                    "score": 2,
                                    "author": "speakbela"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Take Fox News off the air, and a bunch of AM radio hosts. \n\nIf you take away the sources of propaganda given some time at least some of these people would come back to reality.",
                            "score": 3,
                            "author": "pliney_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are the experts calling them fascists yet or are they still \"evaluating\"??",
            "score": 5,
            "author": "MarameoMarameo"
        },
        {
            "level": 0,
            "comment": "Has anyone ever looked at Kari Lake and said, “Wow she’s intimidating, I’m not messing with her”? I mean, cmon.",
            "score": 5,
            "author": "ImprovementSilly2895"
        },
        {
            "level": 0,
            "comment": "It’s not great but at the same time they did this same crap for his last indictment and the turnout of support on the ground was laughable.  I think after January 6th even his sense followers have realized actualyl acting isn’t going to payoff",
            "score": 3,
            "author": "Cactusfan86"
        },
        {
            "level": 0,
            "comment": "No, it disturbs all rational people",
            "score": 4,
            "author": "lowpine"
        },
        {
            "level": 0,
            "comment": "Last time this happened, one genius thought a nail gun was the answer to bulletproof glass, and a handful of others couldn't get together so much as a lemonade stand without all their potential allies claiming it's a fed trap. That's the level of tactical expertise we're dealing with.",
            "score": 4,
            "author": "Ephdis"
        },
        {
            "level": 0,
            "comment": "Does anyone think that Tuesday will be worse than Jan 6? I believe these people will march to a liquor store then forget what they were doing and go back home",
            "score": 3,
            "author": "Zestyclose_Meet1034",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not sure. The right has kind of been running on fumes since Jan 6th and Trump ran to his resort with his tail between his legs to grift NFTs. Lots of conservatives killed themselves licking doorknobs to deny covid is real. Fascists are disillusioned due to how weak and pathetic jan 6th was. More people than ever have accepted Trump is a criminal jackass idiot.\n\nBut his supporters that remain will probably be more desperate than ever since well. This indictment has a very real possibility of seeing Trump actually face prison. Guess it depends on who decides to show up but his call to arms in NY for that indictment went over like a wet fart. I wonder if conservatives have it in them besides a minority of terrorists and nazis like the patriot front idiots.",
                    "score": 3,
                    "author": "Malaix"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The MAGA movement are for all intents and purposes terrorists.",
            "score": 4,
            "author": "tom-branch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right, and real justice and democracy has been thrown out the window.",
                    "score": 2,
                    "author": "FreeThinker627"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And another thing miss lake. You should be arrested on site for threatening to shoot people. That’s exactly what you did. Remember what happened to the people on January 6. All those big shots are doing time right now. Just because you have a position in government doesn’t give you the right to mouth off and threaten the American people. Stop putting a wedge in this country. If you don’t like it, I’ll help you pack your bags and move the hell out of here.",
            "score": 5,
            "author": "gumbo12d"
        },
        {
            "level": 0,
            "comment": "No shit",
            "score": 3,
            "author": "TruthandHonorLost"
        },
        {
            "level": 0,
            "comment": "Kari has her finger up again..",
            "score": 3,
            "author": "BadAsBroccoli"
        },
        {
            "level": 0,
            "comment": "Ok it disturbs them. Let’s hope this time those experts don’t sit on their hands.",
            "score": 3,
            "author": "DucksItUp"
        },
        {
            "level": 0,
            "comment": "Oh, look, more pearl clutching when the people carrying Nazi flags do Nazi shit even though we’ve been telling them this the entire time.",
            "score": 3,
            "author": "tcmart14"
        },
        {
            "level": 0,
            "comment": "All the more reason this case needs to be brought to a just conclusion.  Same with all of Trump’s crimes.",
            "score": 3,
            "author": "Foolazul"
        },
        {
            "level": 0,
            "comment": " Fight back. Stop spending money at their businesses. Look them up on [fec.gov](https://fec.gov) before you buy.",
            "score": 3,
            "author": "redcountx3"
        },
        {
            "level": 0,
            "comment": "As long as they don't win elections...if they want to check into prison for decades at a time, I'm fine with that.",
            "score": 3,
            "author": "sliverstyles"
        },
        {
            "level": 0,
            "comment": "If it hasn’t been said already, I know a few not experts, myself included, who are also disturbed  👍👍👍",
            "score": 3,
            "author": "sign_in"
        },
        {
            "level": 0,
            "comment": "\"Wow, we totally didn't see this coming!\" -Expert Idiot",
            "score": 3,
            "author": "Solar_Sails"
        },
        {
            "level": 0,
            "comment": "Kind of telling that her nips got hard….",
            "score": 3,
            "author": "tx_nonnative"
        },
        {
            "level": 0,
            "comment": "Fuck them. Don't care.",
            "score": 3,
            "author": "Straight-Birthday815"
        },
        {
            "level": 0,
            "comment": "Have these “experts” not been paying attention since 2016?",
            "score": 3,
            "author": "Suspicious-Ad3136"
        },
        {
            "level": 0,
            "comment": "Well do something about it, like arrest someone.",
            "score": 3,
            "author": "Calvinshobb"
        },
        {
            "level": 0,
            "comment": "Mind blowing that people didn’t see this coming.  \n\n/s",
            "score": 3,
            "author": "judgehood"
        },
        {
            "level": 0,
            "comment": "It was obvious in 2015 that they would respond this way. Anyone waking up now is an idiot.",
            "score": 3,
            "author": "thenotoriouscrg"
        },
        {
            "level": 0,
            "comment": "This will be evidence.",
            "score": 3,
            "author": "musememo"
        },
        {
            "level": 0,
            "comment": "Promote violence, go to jail. Lock them up.",
            "score": 3,
            "author": "Skiboy712"
        },
        {
            "level": 0,
            "comment": "Threatening imminent violence is not protected speech. \n\nLet the prosecutions begin.",
            "score": 3,
            "author": "Richandler"
        },
        {
            "level": 0,
            "comment": "It should disturb the national guard.",
            "score": 3,
            "author": "NotmyRealNameJohn"
        },
        {
            "level": 0,
            "comment": "Follow the process. If he's making threats, deny him bail.",
            "score": 3,
            "author": "futatorius"
        },
        {
            "level": 0,
            "comment": "It would seem to disturb EVERYONE, except those that are entrusted to enforce the laws pertaining to oaths, treason and inciting violence.",
            "score": 3,
            "author": "Appropriate_Mess_350"
        },
        {
            "level": 0,
            "comment": "That’s OK Kari Lake and others like you. The federal government has an army that has Abram tanks, which has a gun bigger than anything you can carry on your hip. We are back. Do not threaten the US people or government. I appreciate your stance sticking up for who you like and respect, but when it comes down to it, you probably just like everybody else.",
            "score": 3,
            "author": "gumbo12d"
        },
        {
            "level": 0,
            "comment": "Read the effing indictment!!",
            "score": 3,
            "author": "Whiskeyrich"
        },
        {
            "level": 0,
            "comment": "Imagine being so stupid you’d vote for that guy. Now imagine you are so brainless you’d continue to support him. Anyone who does should be laughed the fuck out of this country. Piece of shit traitors.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Plot twist: Republicans don't care about experts, expertise, education, logic, or consequences",
            "score": 3,
            "author": "greeperfi"
        },
        {
            "level": 0,
            "comment": "No Kari, nobody is going to go through you to get to Trump. He is going to surrender himself on Tuesday and you will be nowhere near Florida. Her rhetoric is geared at getting Trump’s attention in hopes of a VP bid.",
            "score": 3,
            "author": "lookydis",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What they’re saying is: “we will literally kill so that this man child who’s never worked a day in his life and doesn’t care about anyone than himself can do whatever he wants without impunity. This makes me a patriot.”\n\nThey are radicalized, plain and simple.",
            "score": 3,
            "author": "frostfall010"
        },
        {
            "level": 0,
            "comment": "Call the bluff. Rip the band-aid off. Or as they love to say *fook round n fine out*",
            "score": 2,
            "author": "citizenjones"
        },
        {
            "level": 0,
            "comment": "And non-experts",
            "score": 2,
            "author": "HelpfulNotUnhelpful"
        },
        {
            "level": 0,
            "comment": "Experts: How did you think this was going?",
            "score": 2,
            "author": "freeformz"
        },
        {
            "level": 0,
            "comment": "This is disturbing a lot of people. That’s why they are losing nationally and only winning Congress due to gerrymandering",
            "score": 2,
            "author": "Carthonn"
        },
        {
            "level": 0,
            "comment": "We’re all about to watch the shortest, most ill-fated insurrection in US play out in front of us in real time. Don’t blink, you might miss it.",
            "score": 2,
            "author": "grigsbie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's very scary the rhetoric being bandied around.  Trump doesn't give a shit about them but will use any means to destabilize the situation.  The \"normal\" Republicans need to calm the situation and try to get the right wing nutcases out of there.",
            "score": 2,
            "author": "morts73",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m no expert \n\nBut it disturbs me too.",
            "score": 2,
            "author": "SoNerdy"
        },
        {
            "level": 0,
            "comment": "Really, a MAGA GQP base reacting with violent talk disturbs experts? Have these experts been vacationing the past five years. Time to zero in on these zealots and bring then into the light.",
            "score": 2,
            "author": "zestzebra"
        },
        {
            "level": 0,
            "comment": "Like she’s surprised she didn’t get voted in",
            "score": 2,
            "author": "Zestyclose_Meet1034"
        },
        {
            "level": 0,
            "comment": "Kari Lake is dangerous.",
            "score": 2,
            "author": "Mugwump6506"
        },
        {
            "level": 0,
            "comment": "When the ongoing GOP attempt to destroy American democracy ultimately fails, some MAGA will turn to terrorism. There will be bombings, murders and kidnappings for a generation or more.",
            "score": 2,
            "author": "urbanprovocation"
        },
        {
            "level": 0,
            "comment": "Lake is a buffoon. Literally nobody is paying attention.",
            "score": 2,
            "author": "ProfessorTicklebutts"
        },
        {
            "level": 0,
            "comment": "Who’s is this ?",
            "score": 2,
            "author": "DeezNutz7707",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kari Lake. Ran and lost for gov of Arizona. Republican.",
                    "score": 3,
                    "author": "BrewKazma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well then they haven’t been paying attention…",
            "score": 2,
            "author": "KingGidorah"
        },
        {
            "level": 0,
            "comment": "You should be required to post the text of paywall sites on this subreddit. Clearly no one here has even read the article",
            "score": 2,
            "author": "SandyScrotes2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Make them walk their talk I say",
            "score": 2,
            "author": "incognito_ginger"
        },
        {
            "level": 0,
            "comment": "This loser tv news anchor from Phoenix ruined what little name and reputation she had.  She’s a joke in AZ now.",
            "score": 2,
            "author": "J-Rocks-baby-mama"
        },
        {
            "level": 0,
            "comment": "Time for the culmination of the hypocrisy of the whole “back the blue” movement. It kind of has to happen for us to move forward as a society.",
            "score": 2,
            "author": "Fortunatious"
        },
        {
            "level": 0,
            "comment": "Been disturbed by these antics long before Trump. \n\nThis is anti-American traitorous trash that needs to be taken to the curb…",
            "score": 2,
            "author": "Economy_Ask4987"
        },
        {
            "level": 0,
            "comment": "Remember when they would all say violence had no place in politics? Those were the good old days. Republicans know they can't win without the threat of violence.",
            "score": 2,
            "author": "uncleawesome"
        },
        {
            "level": 0,
            "comment": "These people are bullies.\n\nI don't know anyone else's experience but the same people I grew up with that were bullies, or the type of people who would sit by and root for the bully are now all republican trump supporters.\n\nYou can't let them just walk all over you with threats. Sometimes you have to finally stop just let them live out their ridiculous fantasy and suffer the consequences. They clearly learned nothing for January 6th.",
            "score": 2,
            "author": "AbazabaYouMyOnlyFren"
        }
    ]
}