{
    "id": "146tt1f",
    "score": 7073,
    "title": "The next Georgia? Biden campaign targets North Carolina to reshape 2024 electoral map",
    "author": "lucerousb",
    "date": 1686489650.0,
    "url": "https://www.usatoday.com/story/news/politics/2023/06/11/biden-campaign-eyes-north-carolina-to-reshape-2024-electoral-map/70299006007/",
    "media_url": "https://www.usatoday.com/story/news/politics/2023/06/11/biden-campaign-eyes-north-carolina-to-reshape-2024-electoral-map/70299006007/",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "If Cal Cunningham could have kept his dick in his fucking pants we’d have a Senator from there and Manchin would have been irrelevant the last two years.",
            "score": 682,
            "author": "Bits-N-Kibbles",
            "replies": [
                {
                    "level": 1,
                    "comment": "He did though. His infidelity was texts like: \"I would like to kiss you goodnight\"",
                    "score": 253,
                    "author": "goldbman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The most vanilla sex scandal in history.\n\nCome on, Cal! At least make it salacious!",
                            "score": 205,
                            "author": "Majestic-Macaron6019",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah just grab em by the pussy",
                                    "score": 29,
                                    "author": "TomboBreaker"
                                },
                                {
                                    "level": 3,
                                    "comment": "Might have won over enough Trump voters to win the election!",
                                    "score": 15,
                                    "author": "oneoftheguysdownhere"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit I just looked them up \"And I kiss you\" smooth.",
                            "score": 52,
                            "author": "naatkins"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe that’s what hurt him more, he sounds kinda dorky. Like how DeSantis would try to cheat on his wife.",
                            "score": 52,
                            "author": "RickMoranisFanPage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "DeSantis would cheat on his wife by intentionally mispronouncing words around other women to see if they correct him or not. Its a whole 'nother level of weirdo.",
                                    "score": 53,
                                    "author": "TurelSun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Some of us really like thigh food though.",
                                            "score": 21,
                                            "author": "UtahCyan"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah voters don’t like the weirdos",
                                            "score": 7,
                                            "author": "RickMoranisFanPage"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Casey would literally murder him wearing a tiara.",
                                    "score": 4,
                                    "author": "okcdnb",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The woman who he was texting confirmed they had sex so... no?",
                            "score": 9,
                            "author": "MooseFlyer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "His biggest sin was being in NC and tweeting that he was excited to do some barbecuing, and he got roasted, no pun intended, because he was in fact grilling. Hotdogs and hamburgers are grilled here in the South, not barbecued.",
                    "score": 21,
                    "author": "zeppelinoasis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf, that’s actually a major blunder. Full crudité. Failing a key cultural shibboleth.",
                            "score": 5,
                            "author": "PPvsFC_",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Eh? In the midwest, we refer to that as barbecueing - it's the burning of meat. Whatevs.",
                            "score": 2,
                            "author": "blackcain",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seriously. Dude fucked up big time",
                    "score": 28,
                    "author": "peterpeterllini"
                },
                {
                    "level": 1,
                    "comment": "When the scandal broke, perhaps it reminded enough people of former Senator John Edwards’ infidelity.",
                    "score": 6,
                    "author": "Ryan29478",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Fucking Cal",
                    "score": 3,
                    "author": "songintherain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, please!",
            "score": 814,
            "author": "LolAtAllOfThis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. So tired of this state being pulled down by the General Assembly's quest to maintain power at any cost.",
                    "score": 307,
                    "author": "Sam_L_Bronkowitz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And the general assembly doesnt do shit. But the republicans get reelected anyway",
                            "score": 102,
                            "author": "PxcKerz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Very true. And NC only goes red because of the gerrymandered maps. You can tell how skewed it is by comparing 2008’s map to 2022’s. \n\nDemocrats in NC should do more to target rural voters rather than playing it safe and expecting the cities to carry the votes. THATS the biggest thing and that could be my hot take but the messaging needs to be better",
                                            "score": 21,
                                            "author": "PxcKerz",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did you literally just steal a comment one level up?",
                                            "score": 4,
                                            "author": "Pickle_Juice_4ever",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, good catch. That’s a comment-stealing bot. Report it. Report -&gt; spam -&gt; harmful bots",
                                                    "score": 7,
                                                    "author": "KellyJoyRuntBunny"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It’s a bot",
                                                    "score": 3,
                                                    "author": "Squeakyduckquack",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I always report them. If I have time, I find the original, copy the link to the original comment, and then put that info into a “custom response” box in the report feature. I figure it’s nice to have the evidence and the mods don’t have to figure out what kind of a bot it is.",
                                                            "score": 3,
                                                            "author": "KellyJoyRuntBunny"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Obama won NC in 2008. Democrats just let their foot off the gas. As the Tea Party took to the streets Democrats looked for safe blue shelters to avoid confrontation.",
                            "score": 67,
                            "author": "Workisual6281",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People forget but Obama also won Indiana in 2008. Democrats have just completely given up there too.",
                                    "score": 35,
                                    "author": "KenmoreSquare",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Indiana was a complete anomaly. I didn't understand then and I still don't understand now how Obama managed to carry that state.",
                                            "score": 26,
                                            "author": "ComCypher",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He went to the blue collar counties and spoke to the small populations in 4H centers and shit. I lived in Vigo county when he came through and saw him speak in a barn. It wasnt often that a candidate would stop off in a meth laden city to talk to factory workers.",
                                                    "score": 33,
                                                    "author": "trippedwire",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Howard Dean was the DNC chair back then and he was extremely effective at this type of strategy.\n\nEDIT: https://en.wikipedia.org/wiki/Howard_Dean#Fifty-state_strategy",
                                                            "score": 30,
                                                            "author": "poopyheadthrowaway",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dean's strategy was perfect and i wish they would revert back to his plans.",
                                                                    "score": 29,
                                                                    "author": "trippedwire"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I still can’t believe that stupid scream ended his political career. I don’t even think something like that would make the news nowadays (maybe it would make it to tv as a moment of zen, or something)",
                                                                    "score": 20,
                                                                    "author": "veronica_deetz",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Still not sure why the scream was such a big deal.",
                                                                            "score": 2,
                                                                            "author": "AquaSnow24"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I remember going to see Obama when he visited Lancaster County, PA back in September, 2008.",
                                                            "score": 10,
                                                            "author": "fungobat"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Sure but that makes it sound too easy, like all you have to do is talk to people to convince them to cross party lines. That hasn't really been demonstrated to work in most cases. Indiana also reverted to it's usual voting pattern in 2012 so clearly whatever magic happened there didn't last.",
                                                            "score": 8,
                                                            "author": "ComCypher",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "For all intents and purposes, 2008 was a landslide election. Sure it was only D+7, but in the 21st century that’s the best you’re gonna get. The days of 20 point blowouts are over.\n\nIndiana voted Democratic for the 4th time since 1920 (after FDR’s wins in 1932 and 1936, and the landslide of 1964). Hell, Obama held McCain to single digits in the Dakotas, kept him under 50% in Montana, won Pennsylvania by double digits, won Wisconsin by over 15 points, and became the only Democrat to sweep every New Hampshire county since favorite son Franklin Pierce in 1852.",
                                                                    "score": 12,
                                                                    "author": "TheSameGamer651"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hell he lost missouri by 4,000 votes",
                                            "score": 9,
                                            "author": "gowiththeflohe1",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So much beauty, culture, and INTELLIGENCE (RTP) in NC. Should be a Democratic stronghold.",
                    "score": 56,
                    "author": "EverybodyBuddy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "RTP is not the greatest intellectual beacon in the state, it just happens to have a lot of people from particular fields due to, you know, being RTP.",
                            "score": 6,
                            "author": "rumpghost",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok… how bout Duke, UNC, and NC State for starters? I should have just the Triangle I guess.",
                                    "score": 7,
                                    "author": "EverybodyBuddy",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Let’s go 👏👏",
                    "score": 9,
                    "author": "zchivago"
                },
                {
                    "level": 1,
                    "comment": "Seriously.",
                    "score": 5,
                    "author": "Nekrames"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We have a gop governor so I wouldn't say reliably blue.",
                            "score": 6,
                            "author": "MicroBadger_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for having the NC tag and saying Exactly what I thought as I read this headline! ( Born and have lived in NC except while serving for all my life  )",
                    "score": 3,
                    "author": "BusFear"
                },
                {
                    "level": 1,
                    "comment": "North Carolina/\nCome on and raise up/\nTake your shirt off/\nTwist it ‘round your hand and/\nSpin it like a helicopter/\nMaple leaf of intelligence/ \nTwirling toward the ground/\nWhere the soil is rich/\nWith the compost of republican rot/",
                    "score": 2,
                    "author": "thebeautifulseason"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here's some data:\n\n- NC was only 75,000 votes difference in 2020:\nhttps://en.wikipedia.org/wiki/2020_United_States_presidential_election_in_North_Carolina\n\n- NC migration continues at a good pace.  It seems a wash between traditionally red and blue states folks moving in, though.  So leave it to others to try and make something of the data.  https://www.ncdemography.org/2023/02/08/where-are-north-carolinas-newest-residents-moving-from-2/#:~:text=Nearly%20366%2C000%20individuals%20moved%20to,%2Dmigrants%20from%20Puerto%20Rico.)",
            "score": 120,
            "author": "newestJourney",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would like to see the immigration numbers broken down by age. I bet there’s lots of millennials moving here for work but also retired folks. I’ve been even heard the term “half backers” for Florida retirees who move halfway back. That said I’m still optimistic that NC is attracting lots of young people.",
                    "score": 39,
                    "author": "sarcago",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "North Carolina is actually a place a lot of Floridians retire. Floridians love the North Carolina foothills.",
                            "score": 16,
                            "author": "RickMoranisFanPage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Everyone should. The Virginia, NC and SC foothills are beautiful places.",
                                    "score": 16,
                                    "author": "Strokethegoats",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would love to live in North Carolina but not how it is right now.  The climate seems perfect",
                            "score": 10,
                            "author": "Sloth_grl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just moved here from Illinois last fall. The politics are maddening but I’m hopeful it can change. The climate is great even if a bit humid. We have beaches, mountains, and forests. Winter gets cold but we didn’t have any snow accumulate this year. Cost of living is getting high though.",
                                    "score": 18,
                                    "author": "sarcago",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've heard that the immigration is quite equal. There's also retirees moving in.  If you look at the racial demographics of the NC cities and campare with Atlanta, NC is quite a bit whiter if that matters.  \n\nNC is worth the long term investment tho.  Without NC they prob can't get a senate majority once they lose the MT, OH &amp; WV seats.",
                    "score": 13,
                    "author": "cup-cake-kid",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Everyone I know of from NYC that moved to North Carolina is conservative though. Whether it was pandemic-fleeing or post George Floyd. \n\n\nThe liberals moved to the Hudson Valley, the conservatives moved out to LI, down to North Carolina, or down to TN. The start up founders and product managers all moved to Austin lol",
                    "score": 2,
                    "author": "BigBrownDownTown"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NC should have always been the investment, far more than Florida.  It's near equal parity between left leaning Democrats and Independents, and right leaning people. It almost always votes for Democrat Govs and AG, there is a massive college population.  \n\nIt's issues are gerrymandering related, people not voting and that causes a slight deficit in Republicans favor since their demo is older, the more reliable voting bracket",
            "score": 622,
            "author": "shaunrundmc",
            "replies": [
                {
                    "level": 1,
                    "comment": "I plan on canvassing 2024 for Biden in NC. It was the state trump won by the smallest margin in 2020. There are absolutely enough dem votes they just gotta show up to the polls",
                    "score": 160,
                    "author": "bilbo_swagginz_boi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 78,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Blurple lol",
                                    "score": 25,
                                    "author": "themagicalelizabeth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If there is a blurple, the Lord keeps it hidden for a reason",
                                            "score": 6,
                                            "author": "Lehmanite"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree with this, Florida in my estimation is no where near purple overall especially how the map is drawn. NC I feel like is purple as purple as can be, but democratic pressure and campaigning in it has left a bit to be desired. \n\nOf course it doesn't help when gerrymandered maps get sent back and made even worse",
                    "score": 51,
                    "author": "Gazelle_Inevitable",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Florida is now a lost cause unfortunately. As in, it’s not the best bang for your buck campaigning in anymore. A lot of Republicans moved there during Covid because of politics. Which in turn might have tipped the scales in Michigan, Wisconsin, and Pennsylvania to Biden.",
                            "score": 49,
                            "author": "Tagawat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't think it's only due to republicans moving in as well. Democratic messaging to the Cuban/Hispanic community has been marginally bad. And many fear it's socialism/communism.\n\nRegardless that it's not messaging is bad in Florida if the gop can spin it that way as well",
                                    "score": 35,
                                    "author": "Gazelle_Inevitable",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A lot of the democratic candidates in Florida have also been terrible. When the “democratic” candidate is a former Republican governor, it doesn’t exactly inspire turnout. That’s how you get DeSantis winning in a landslide.",
                                            "score": 34,
                                            "author": "boregon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's a great point. The democrats can't help themselves make the republicans look ok in Florida sometimes \n\nIf they had someone who was really good and ruthless on messaging, man they could carve out some of these states.",
                                                    "score": 16,
                                                    "author": "Gazelle_Inevitable"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yea the democrat party of florida seems criminally incompetent.  It seems like the new mayor of Jacksonville is solid, hopefully she does well!  \n\nBut what you don't see in Florida is democrats overperforming in urban counties - if we can get it back Florida can be purple again.",
                                                    "score": 9,
                                                    "author": "ooo-ooo-oooyea",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Dems keep changing leadership and nothing changes. One problem is that the party was only strong in one region (cough Broward) and failed to understand they had to win the whole state. Now they have more strength in Central Florida, but lost ground in all the coastal counties due to MAGA retirees.\n\nCrist ran as a sacrifice. There was no way a Dem was going to win it. Yes there was definitely a thing where Gillum volunteers refused to volunteer for Crist. I suspect they are Bernie/Jill Stein fans too. Let the perfect be the enemy of the good. But even the best candidate would still have been like 10 points behind, folks.",
                                                            "score": 6,
                                                            "author": "Pickle_Juice_4ever"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; Yea the democrat party of florida seems criminally incompetent.\n\nNominating Charlie Crist for governor in 2022 is exhibit A in this regard.",
                                                            "score": 3,
                                                            "author": "KenmoreSquare"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah it’s relatively easy for Republicans to canvas in South Florida compared to other areas. You have a lot of right leaning people packed in together so it’s easier to canvas the vote.\n\nDeSantis took advantage of this and won. Drop off a bunch of ballots at apartment complexes across Hialeah and come back the next week to collect them. You bet so many votes that way.",
                                            "score": 8,
                                            "author": "RickMoranisFanPage",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah it's a good point. I wish the Dems would give better candidates with better strategy in Florida and other real gettable places (NC, Texas etc.)",
                                                    "score": 3,
                                                    "author": "Gazelle_Inevitable",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "North Carolina Democrats actually has a pretty good strategy of winning with white frat boy type candidates there. Someone like a Jeff Jackson might have a shot at the Senate.\n\nFlorida is a little hard because the Democrats have so many differing coalitions there compared to other states. Possibly a moderate Cuban-American candidate?\n\nIt’s been so long since a Democrat has won in Texas it’s hard to picture what a good candidate would look like. Beto came close to winning, but is that a signal to double down on a candidate like him to get across the finish line or to try something new? They have a former football player and executive official running against Cruz so we’ll see.",
                                                            "score": 4,
                                                            "author": "RickMoranisFanPage"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "FL GOP state party apparatus is on point while dem state party is crap.  Dems also went to sleep during covid.  GOP built permanent infrastructure and moved into dem strongholds, kept registering which allowed them to outnumber dems.  Good outreach to latinos.  GOP put in long term work.  Dems did that in AZ and GA.",
                                    "score": 8,
                                    "author": "cup-cake-kid"
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s not a lost cause for the House though for Democrats. There are a few seats like Lina’s that are in swing districts, plus the VRA ruling may create a new swing/blue district in the northern part.",
                                    "score": 7,
                                    "author": "RickMoranisFanPage"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeup. The reason we lost the 22’ senate race was\n\n1) Poor turnout among crucial groups (youth, minorities, women ect)\n\n2) what felt like spending disparity. I saw 3 Budd ads for every Beasley add. \n\nI will concede she should’ve responded to the attacks ads better but fixing 1 and 2 probably helps mitigate that.",
                    "score": 83,
                    "author": "jgjgleason",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Beasley\n\nYou mean the Cheri Beasley that's been trafficking with the devil? The same Cheri Beasley that shape-shifts under our front door at night to lick our toothbrushes? The same Cheri Beasley that can unhinge her jaw and devour children whole?\n\n/s (the attack ads on her were almost this insane...)",
                            "score": 16,
                            "author": "Ben2018",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I saw Goody Beasley consorting with the devil.",
                                    "score": 3,
                                    "author": "Muvseevum"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m still sad that Jeff Jackson stepped aside so early — talk about a candidate who was about speaking to everyone he could and going *to* them. I moved to CA shortly after this but I still think Jackson has a lot of promise.",
                            "score": 8,
                            "author": "icario"
                        },
                        {
                            "level": 2,
                            "comment": "Unfortunately, I live here and the youth do not care to vote unless their parent's drag them to the polls.\n\nAnd you can imagine which type of parent forced their kids to vote ...",
                            "score": 25,
                            "author": "Therocknrolclown"
                        },
                        {
                            "level": 2,
                            "comment": "Obama won NC in 2008. Democrats just let their foot off the gas. As the Tea Party took to the streets Democrats looked for safe blue shelters to avoid confrontation.",
                            "score": 7,
                            "author": "Chancgitimate7157"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In addition to the massive college population, RTP is one of the fastest growing areas in the entire country for the last decade. Tons and tons of educated people moving here.",
                    "score": 13,
                    "author": "Atheist_3739",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not all those educated people are democrats though.  They like low taxes.",
                            "score": 4,
                            "author": "leeringHobbit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They aren't all democrats but I live in the triangle and it is pretty liberal and is getting more liberal",
                                    "score": 6,
                                    "author": "Atheist_3739",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That's fair, but I'd guess that's way less of a factor in moving to NC than it is in states like TX &amp; FL that are tripping over themselves to be right-wing business havens.",
                                    "score": 2,
                                    "author": "Ben2018"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s very weird actually. One place there’s rainbow flags, new age stuff, hippies etc. Drive 20 mins away from that place you see trump and confederate flags. Especially in Asheville area.",
                    "score": 11,
                    "author": "sickest_000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds like driving down 85 towards Gastonia from Charlotte.",
                            "score": 2,
                            "author": "LeDauphin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Always? the 2018 gubernatorial was won by half a percent in Florida. It’s obvious why it’s a target.",
                    "score": 5,
                    "author": "shotputlover",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Fuck FL. I haven't paid close enough attention to NC though! Does it really feel like it's able to turn?",
                    "score": 3,
                    "author": "Optimus-Maximus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For the very reasons I cited it very well could, but NC is perpetually the red headed step child of the south when it comes to the democratic party. They put more money and effort in South Carolina than they ever have in NC, hell NC was an easier get than Georgia but they pumped more money there (even though it worked out)",
                            "score": 4,
                            "author": "shaunrundmc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love this not only in terms of the national election, but also mobilizing voters for Josh Stein in his race against Mark Robinson. It’s going to be a close race, so any help we can get to increase voter turnout is huge.",
            "score": 75,
            "author": "btfsame",
            "replies": [
                {
                    "level": 1,
                    "comment": "That race is almost the whole ball game for the state either becoming completely like Florida or not.",
                    "score": 17,
                    "author": "RickMoranisFanPage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100%. I don't think how objectively insane Mark Robinson is has gotten enough press.  If half the things he's said over even the last few years come back into the spotlight it should be disqualifying. The guy has enough misogyny to win an election in Gilead, hopefully not NC...",
                            "score": 6,
                            "author": "Ben2018",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He has also stated that science and social studies shouldn't be allowed to be taught until the 5th grade. No way he is winning any of the 77% of parents that send their kids to public school here.",
                                    "score": 3,
                                    "author": "3nl"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\n&gt;The next Georgia? \n\n\"No, seriously. We're asking. We're only allowed to recognize one battleground state per election cycle.\" -USA Today Editors",
            "score": 144,
            "author": "buttergun",
            "replies": [
                {
                    "level": 1,
                    "comment": "I so look forward to the day when I can say I live in a blue state. I hope it doesn't turn out to be a pipedream",
                    "score": 41,
                    "author": "GelatoGiraffe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NC is close honestly. A lot of these southern states are making it interesting. Georgia went blue for the president, it has two blue senators but the governor is solid red. None the less I'm excited some of these southern states haven't been in play since Obama and only for Obama.",
                            "score": 42,
                            "author": "Stennick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And that makes me really happy for NC. Unfortunately, I'm a Texas boi, so my hopes are further off.",
                                    "score": 11,
                                    "author": "GelatoGiraffe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Usually they are good with two but for the last four elections before 2016 those states were Florida and Ohio. I still remember Ohio going for Obama and Karl Rove dying on camera. \n\nIts a bit frightening but good how many battle ground states there seem to be right now AZ, Georgia, Nevada, maybe NC this election. Ohio's tough. Since 2000 it went red twice, then blue twice, then red twice. The only blues were Obama and I think we can mostly agree Biden is not Obama when it comes to charisma. Florida is the same way. If Obama's not on the ticket its a red state, same thing with it since 00 two red, two blue, two red.",
                    "score": 9,
                    "author": "Stennick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohioan here. We’re a lost cause for the foreseeable future. Solid red state now. Yes, one of our senators is a Dem, but he’s the exception that makes the rule, and I seriously doubt he’ll win another term.",
                            "score": 13,
                            "author": "OwnManagement"
                        },
                        {
                            "level": 2,
                            "comment": "I think Ohio is drifting away from presidential swing state status. It's still essential for Republicans, but less so for Democrats.",
                            "score": 10,
                            "author": "Majestic-Macaron6019"
                        },
                        {
                            "level": 2,
                            "comment": "Dems lost the NV governorship to republicans when i think all other dem incumbents won.  That should be a warning.  The state party is in disarray.  If RCV wins at the ballot again in 2024, it will be used from 2026 onwards and that helps republicans in NV slightly as they have 2-3 right aligned spoiler parties that siphon a little off.",
                            "score": 6,
                            "author": "cup-cake-kid"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obama won NC in 2008. Democrats just let their foot off the gas. As the Tea Party took to the streets Democrats looked for safe blue shelters to avoid confrontation. The result was catastrophic. \n\nStates like FL, IA, OH, and NC where Obama had won were shied away from. Democrats looking to avoid arguments or partisan optics mistakenly concede ground. In parts of the country the only voices voters have heard for 12yrs are Republican voices.",
            "score": 221,
            "author": "8to24",
            "replies": [
                {
                    "level": 1,
                    "comment": "See I look at it different. Obama was different, I remember being in my 20's and voting for him. It was like a movement FOR him. That 08 election was a combination of people being done with the GOP at that time and Obama having a movement. That being said as happy as I was to vote for Obama in 08 I'm not the only liberal to feel like he let his own foot off the gas by 2012. \n\nI think these southern states weren't voting liberal as much as they were voting Obama. He's the only guy to win Florida and Ohio and NC and Indiana  in the last two decades and for states like Indiana hes the only Democrat to win the state since 1964. It was more about Obama than red and blue with him. \n\nI agree with your point that we cede ground though.",
                    "score": 90,
                    "author": "Stennick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well after 8 years of Bush that ended in a huge recession even a lot of conservatives were second guessing the GOP.",
                            "score": 19,
                            "author": "Mysterious-Wasabi103",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "4 years of Trump ended in an even worse recession and an insurrection, but we're not seeing the same second-guessing.  The fact of the matter is that the culture war wasn't near as big of a deal around the 2008 timeframe.  It was pre same-sex marriage and Obama didn't even openly support it during his first campaign.  Whenever the culture war is front and center, Republicans usually win as they did in 2000, 2004, and 2016.",
                                    "score": 16,
                                    "author": "beedubaya",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The culture war in 2024 will be abortion which Republicans are on the losing side of.",
                                            "score": 12,
                                            "author": "RickMoranisFanPage"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Bill Clinton and Obama won in FL. Arguably so did Gore. \n\nBill Clinton, Obama, and Gore all won in IA. \n\nBill Clinton and Obama won in OH. \n\nHad only Obama won in these places I would agree that Obama and the this is around those victories were different. Thing though it wasn't just Obama and it wasn't just '08.",
                            "score": 38,
                            "author": "8to24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure if you were trying to make a different point, but IA is Iowa, not Indiana. The last time Indiana was blue prior to Obama in 08 was in 1964.",
                                    "score": 6,
                                    "author": "reluctanttopost"
                                },
                                {
                                    "level": 3,
                                    "comment": "Project Redmap sends their regards.",
                                    "score": 8,
                                    "author": "JDSchu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly!! Democrats didn't combat it. Still aren't to a large degree.",
                                            "score": 6,
                                            "author": "8to24"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Project red map removes democracy from legislative elections but not state wide races. The problem with state wide races is voter suppression tactics and polices.",
                                            "score": 4,
                                            "author": "down_up__left_right",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Those policies that discourage voting and make voting more difficult in targeted areas are often decided by people elected in local and legislative elections. Gerrymandering absolutely has an impact on all elections, up to statewide and national votes.",
                                                    "score": 14,
                                                    "author": "JDSchu"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When competitive districts reduce and dems have no chance in more districts outside the metro and inner suburb areas the party machine retreats.  That has an impact on statewide races too.\n\nDems aren't even running in many races eg. NC state house last cycle.\n\nI had a look at the KS state house and a majority of seats are not contested by the other party, dems don't run in more of them.  There's not even an election in many of those aside from a few where a 3rd party runs.  If margins are close, then down ballot races can help swing it.",
                                                    "score": 6,
                                                    "author": "cup-cake-kid"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If Cal Cunningham could have kept his dick in his fucking pants we’d have a Senator from there and Manchin would have been irrelevant the last two years.",
                                    "score": 10,
                                    "author": "Usuxdcodpe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why did you copy and paste one of the top comments?",
                                            "score": 18,
                                            "author": "PatrioticHotDog"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I agree that Obama was something else. It wasn't a cult of personality in exactly the same way Trump is because that's not how Democrats operate for the most part, but he certainly brought out and brought together voters in a way I've never seen anyone do in my lifetime.  Then we had a first term which was ok, but pretty disappointing to a lot of progressives.  Still enough to win a second term of course, but a lot of the shine was off by that point so it wasn't the same feel.",
                            "score": 5,
                            "author": "YakiVegas",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ohio is a wash the city centers can’t attract people and the state isn’t growing. \n\nFlorida got invaded by MAGA.\n\nNC and Georgia can be be claimed dem. NC just has to have the turnout and Georgia is pretty much Atlanta and then the boonies + some small cities.",
                    "score": 18,
                    "author": "bilbo_swagginz_boi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "According to population projections in 2040, OH loses population.  FL increases significantly.  NC &amp; GA increase significantly too.  Obviously stuff like climate events etc can affect it.  I think OH is gone.  Other rust belt swing states may be vulnerable too as their populations stagnate at best.  So unless there is reverse immigration due to water, those prob will be susceptible to turning red.",
                            "score": 7,
                            "author": "cup-cake-kid",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah make sure Georgia is the next Georgia before just declaring a victory and looking for the next",
                    "score": 10,
                    "author": "merlin401",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think there is a segment of the population that responds positively to confidence. Fretting about potential losses makes one look weak to some people. That is why politicians, athletes, celebrities, sales people, etc always try to project confidence. \n\nAs such treating GA like it's already safely blue helps keep it blue.",
                            "score": 5,
                            "author": "8to24"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hell, Obama won Indiana in 2008.",
                    "score": 30,
                    "author": "IngsocInnerParty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bill Clinton won FL, IA, and OH too.it wasn't that '08 was wildly unique.",
                            "score": 10,
                            "author": "8to24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "BC is also a highly charismatic figure, running against an incumbent with a recession in the same way Obama was still very much running against Bush’s 8y of failed policies that McCain really didn’t differentiate himself from.",
                                    "score": 12,
                                    "author": "thatgeekinit"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Iowa and Ohio are the wildest to me, especially Iowa. It went from a 10 point Obama state to a 10 point Trump state.\n\nFlorida has actually been consistently around 4-7 points to right of the country as a whole for Presidential elections since Bush. During that same time North Carolina has been one of the most stagnant states compared to the country at large. They’ve pretty much voted 6 points to the right of the country as a whole from 2008 on in Presidential elections.",
                    "score": 7,
                    "author": "RickMoranisFanPage"
                },
                {
                    "level": 1,
                    "comment": "This was the result of Howard Dean’s very effective 50 state strategy.\n\nObama allowed the Democratic party’s national machine decay once he took office.",
                    "score": 12,
                    "author": "OneHundredChickens",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Obama allowed the Democratic party’s national machine decay once he took office.\n\nI disagree. After the ACA passed and Republicans went bananas and the Tea Party rose many Democrats went fully in to retreat. Obama is broadly left standing alone defending the ACA. \n\nDemocrats are often afraid of optics. Democrats I've gotten better since Trump first hit the scene but still struggle. Being labeled socialist, radical, communists, etc is something too many Democrats fear.",
                            "score": 9,
                            "author": "8to24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And they're right to be concerned. Latinos in Florida went GOP after voting Dem before because of a perception that Dems were leaning towards socialism. Bernie Sanders praised Castro on TV, which was pretty outrageous, and then you had the people who thought it was funny to call government spending socialism to trigger the cons... well the swing voters got triggered while the Republicans counted their checks.",
                                    "score": 6,
                                    "author": "Pickle_Juice_4ever"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hell even Obama won Indiana and that’s a deep red state now",
                    "score": 8,
                    "author": "Individual-Ad-4640",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was deep red too as well. We just had the combination of Bush leaving with a 25% approval rating, Obama being Obama, and the possibility of the first black president. It went back to deep red 4 years later.",
                            "score": 2,
                            "author": "Jon_Huntsman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please. Just went to a Pride Event yesterday in very red NC. One of the big talking points was ending the ID at polls and ungerrymendering of the state.",
            "score": 24,
            "author": "Karsa69420",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Absolutely a smart move. Now I know it is the white whale but Texas also needs to be a serious target. The governor all but admits that the state would have gone for Biden if they had not blocked mail voting in Harris county",
            "score": 256,
            "author": "Ven18",
            "replies": [
                {
                    "level": 1,
                    "comment": "Texas needs a lot of groundwork first. Once dems manage to unfuck it enough to win some statewide elections, then it makes sense to put money into the \"flip Texas\" effort we hear about every two years",
                    "score": 35,
                    "author": "rilehh_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There has been a lot of ground work actually. But the GOP in TX is very entrenched and openly corrupt. They do everything to override local rule and make it hard for urbanites to vote. \n\nThe same work was done in AZ with better results. \n\nAlso in TX you have the situation where the Dem stronghold border counties were very, very corrupt so they were easy pickings for the GOP.",
                            "score": 14,
                            "author": "Pickle_Juice_4ever"
                        },
                        {
                            "level": 2,
                            "comment": "If we could reduce the insane voter suppression in Texas that would help a lot also. Texas has arguably been the most difficult state to vote in in the entire country for years and the republicans keep making it even harder.",
                            "score": 33,
                            "author": "boregon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, that's probably the hardest part to fix, which is why I wish the party would spend on state and local races the way the GOP did",
                                    "score": 7,
                                    "author": "rilehh_"
                                },
                                {
                                    "level": 3,
                                    "comment": "And by design. They do this on states that either are purple or on the cusp of it. There's a reason why polling places had the largest closures in Texas, Arizona, and Georgia in the last decade.",
                                    "score": 3,
                                    "author": "rounder55"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol texas is a waste of time and money at this point. If they can get a fetterman esque candidate who is tailored to the Texas machismo voter bloc then maybe it would be worthwhile. Beto is such a bad candidate for Texas, it's crazy they keep running his wimpy ass but the national democrats love him I guess. Sucks but that's just how the game is played",
                    "score": 113,
                    "author": "WhatIfThatThingISaid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao so if we're constructing this candidate, is it some big dude with a Yosemite Sam mustache, boots and spurs, a big ass pistol on his hip, and a wad of chaw in his cheek, but who advocates for universal health care and voting rights? I think I can get on board with this.",
                            "score": 110,
                            "author": "bozosphere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s worked in Montana with Tester.",
                                    "score": 57,
                                    "author": "jgjgleason"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hell yeah there's plenty of guys like that to choose from out there. I've had good ol' boys tell me they voted Trump because he promised health care. I can't help but think a Fetterman with cowboy boots type with good policy ideas could clean up",
                                    "score": 11,
                                    "author": "rilehh_"
                                },
                                {
                                    "level": 3,
                                    "comment": "Kinky Friedman was that guy but he ran 3rd party.",
                                    "score": 10,
                                    "author": "exitpursuedbybear"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's Sam Elliott, just run Sam Elliott",
                                    "score": 5,
                                    "author": "rendeld",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That sounds like a fun dude! I’d vote for him lol",
                                    "score": 3,
                                    "author": "Ventorus"
                                },
                                {
                                    "level": 3,
                                    "comment": "Like Mayor Wild West in Quahog",
                                    "score": 5,
                                    "author": "12characters",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Usually they are good with two but for the last four elections before 2016 those states were Florida and Ohio",
                                            "score": 3,
                                            "author": "Statusedroom563",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ted Cruz’s main Democratic challenger for Senate in 2024 is Colin Allred, a former NFL linebacker who is currently a congressman representing the Dallas area.",
                            "score": 22,
                            "author": "FIalt619",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Texan here, voting age since 2007. My selected candidate in *any* election here has only won 3x since then - Obama x2 and Biden. It’s discouraging. I had hope with Beto for Governor but he’s too despised because of his gun comments. I have hope again for Allred, maybe more so than I did with Beto.",
                                    "score": 7,
                                    "author": "FlatEggs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A moderate pro-gun and “green cautious” minority candidate would be the easiest play for a democratic victory in a state wide TX election but they’ll never get the nomination.\n\n\nBy “green cautious” I do not mean climate change denier. I mean something more along the lines of Klobachar/Hickenlooper than Inslee. Both O&amp;G and Wind are massive parts of Texas economy. Somebody who plays up a balance of domestic energy security with the energy transition (cut off Russia and the Saudi’s first). \n\n\nThat’s how you flip TX. Won’t happen though.",
                            "score": 17,
                            "author": "wcprice2",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was just going to say, Colin Allred is the perfect candidate for Texas. Beto had a movement behind him but I think Allred can capture the votes that Beto couldn’t.",
                                    "score": 26,
                                    "author": "b_writes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Texas is a better investment than Florida, because with Texas you're actually seeing percentage points getting shaved off every cycle.",
                            "score": 5,
                            "author": "shaunrundmc"
                        },
                        {
                            "level": 2,
                            "comment": "No. But it won’t be so easy to flip. The democrats should have NEVER given up on rural Texas. The rural areas aren’t as red as they seem, they are just non voting. And there are little battles showing up in small towns that should give liberal Texans some hope. The Dems need to build a grassroots movement in Texas to start flipping local elections. And they need to begin making the case against hate. There are young people in all these rural areas that are ready to see communities get opportunities. Follow the LBJ method. So much could be done.",
                            "score": 4,
                            "author": "u2aerofan"
                        },
                        {
                            "level": 2,
                            "comment": "That’s every state. Florida is the same way—a democrat that connects with the people will win. The problem is the democrats keep putting up milquetoast candidates in Florida.",
                            "score": 5,
                            "author": "anaxcepheus32"
                        },
                        {
                            "level": 2,
                            "comment": "I mean talking about banning assault weapons is virtuous but not politically smart in Texas. We have to remember that the south is probably 50 years behind the north in education and moral values.",
                            "score": 15,
                            "author": "DollyPartWithOn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Funny, I was thinking that this weekend. The south is what California was in the 70’s - mostly conservative and white areas outside the cities. Over the next two decades, those states are going to go through a lot of changes.",
                                    "score": 3,
                                    "author": "kippypapa"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not happening until 2028 or 2032 at a minimum. Texas got within 5 points last election but still needs more demographic favors",
                    "score": 10,
                    "author": "bilbo_swagginz_boi"
                },
                {
                    "level": 1,
                    "comment": "Love this not only in terms of the national election, but also mobilizing voters for Josh Stein in his race against Mark Robinson.",
                    "score": 5,
                    "author": "Lectureovel76"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The biggest reason Georgia flipped is that years were spent investing in the local Democratic infrastructure, giving a good ground game in addition to federal money. I hope they realize this.",
            "score": 20,
            "author": "TheCleverestIdiot",
            "replies": [
                {
                    "level": 1,
                    "comment": "More important was bad republican candidates.",
                    "score": 2,
                    "author": "leeringHobbit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hasn't stopped a lot of states otherwise just like Georgia from voting for those kinds of candidates. It doesn't matter how shitty of a person the other guy is if you don't have a decent base to work off.",
                            "score": 4,
                            "author": "TheCleverestIdiot",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I travel to NC from SC frequently to visit family. Seeing the billboard saying that NC supports abortion makes me incredibly hopeful that NC can become a true blue state",
            "score": 18,
            "author": "Dr_When"
        },
        {
            "level": 0,
            "comment": "Please, yes 🙌  \n\n\n&amp; Thom turns Dem 😱",
            "score": 68,
            "author": "thedentrod",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thom Tillis was the leader of the original Republican abuses in the NC State Legislature when they had their first supermajority. Think granddaddy bathroom bill before anti-trans issues were so cool. The fact that he looks like a moderate now is a testament to how far the Overton window has shifted. He will never be a Democrat",
                    "score": 50,
                    "author": "opalracketpie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He also makes regular appearances on the top of the list for highest contributions from the NRA. At least Burr is gone now, I think we were the only state to have both senators in the top 5.",
                            "score": 5,
                            "author": "AlternativeStory1027"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Absolutely not, Thom Thillis retire",
                    "score": 12,
                    "author": "rilehh_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ooohoohooo this is gonna be good",
            "score": 13,
            "author": "Wizelf402"
        },
        {
            "level": 0,
            "comment": "NC teacher here in a relatively large red leaning county.  The pandemic, in my opinion, really got to the Gen Z voters for the 22 and 24 voting cycles. They saw a clear difference.  The see the GOP do nothing and the Dem attempt to do things.  Thus, they’re not so convinced of this “both sides are the same” argument.  In short, my graduating students have been talking way more about voting and going to register to vote like it’s the important thing that it is. And I know it’s not just my school that has these same observations.  Gen Z actually gives me hope for a better state and a better future.",
            "score": 11,
            "author": "Fresh__Pup"
        },
        {
            "level": 0,
            "comment": "Georgia isn't even settled business. They need to hit the ground running there too.",
            "score": 12,
            "author": "esoteric_enigma",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a North Carolinian...I hope so...but there's a few differences between Georgia and NC. Georgia seems to have bottomed out with WWC voters, NC still has not. The share of black voters has declined every year since Obama, while Stacy Abrams created a program in Georgia to galvanize and register black voters. While there is a lot of migration into the state and into Charlotte and the Triangle, its not enough to offset those trends. NC is to democrats what Nevada is to Republicans, always seemingly in grasp but always falling short.",
            "score": 29,
            "author": "rwaawr",
            "replies": [
                {
                    "level": 1,
                    "comment": "North Carolina seems to have both Georgia and Florida trends occurring at the same time that are somewhat offsetting and making the state electorally stagnant.\n\nGeorgia’s area of population growth is urban/suburban and those areas are shifting blue. Georgia has been stagnant or somewhat losing rural population that is shifting red.\n\nFlorida has growing urban/suburban/exurban populations and they’re all shifting red.\n\nNorth Carolina has growing urban population that’s blue, however they have a growing suburban/exurban population that’s red. \n\nCharlotte, for example, netted more blue votes in its core county from 2016 to 2020. However, it’s surrounding suburban/exurban counties also netted more red votes over that same time period. They didn’t directly offset each other, but it was close.",
                    "score": 10,
                    "author": "RickMoranisFanPage"
                },
                {
                    "level": 1,
                    "comment": "I’d be surprised if Georgia doesn’t swing back red",
                    "score": 2,
                    "author": "Pat0124"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good. Forget Florida. Democrats can win without it.",
            "score": 24,
            "author": "Knoxcore",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The great thing about NC is that so many people coming in are younger, meaning they’re more likely to vote blue. The problem, however, is the gerrymandering because I live here and believe me when I say that the gerrymandering is absolutely appalling. Continuing this, Roy Cooper is trying his best but Republicans have supermajority and it makes me angry because everything Cooper vetoes just ends up passing anyway. So glad Biden is targeting us, I’ll be excited to vote for him in 2024!",
            "score": 7,
            "author": "XilaXena"
        },
        {
            "level": 0,
            "comment": "Oo, oo! Do Tennessee next please!",
            "score": 6,
            "author": "sugiina"
        },
        {
            "level": 0,
            "comment": "Fuck it let’s go for texas",
            "score": 5,
            "author": "DuckmanDrake69"
        },
        {
            "level": 0,
            "comment": "I am still worried about Georgia staying blue...",
            "score": 5,
            "author": "Violent0ctopus"
        },
        {
            "level": 0,
            "comment": "Please Papa Biden save my state",
            "score": 5,
            "author": "age_of_empires"
        },
        {
            "level": 0,
            "comment": "Without the massive gerrymandering it’s known for, NC would be blue purple at  very least.",
            "score": 13,
            "author": "Newyew22",
            "replies": [
                {
                    "level": 1,
                    "comment": "That doesn't explain why Republicans consistently win statewide elections. NC is tougher for Dems than Georgia because while the white population votes Republican at a similar level as in GA, the black population is 10% smaller and the black share of the electorate has been decreasing in the last decade.",
                    "score": 14,
                    "author": "Mundane_Rabbit7751",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Local politics dictate voting locations and rules. Gerrymandering districts within states absolutely affects statewide races.\n\nSigned,\n\nTexas",
                            "score": 17,
                            "author": "JDSchu",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If Trump is the nominee for the Republicans, Biden is going to win North Carolina and every other swing state.  That'll be fun to watch.",
            "score": 4,
            "author": "ViolaNguyen"
        },
        {
            "level": 0,
            "comment": "Smart. It was less than a 1.5% loss. They should also heavily target Texas. With what the attorney general is on the record saying about suppressing millions of votes and an unpopular senator is up for reelection. If NC is the next Georgia then I think Texas can be the next Arizona",
            "score": 4,
            "author": "Gaeneous"
        },
        {
            "level": 0,
            "comment": "Do I want to vote for Biden? No. I want a progressive democrat in the White House, not a conservative moderate. \n\nWILL I vote for Biden? Hell yes, over any  criminal the right throws up.",
            "score": 14,
            "author": "AngryZen_Ingress",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good, North Carolina should be a purple/blue state rather than the mess it currently is.",
            "score": 3,
            "author": "urbanlife78"
        },
        {
            "level": 0,
            "comment": "GERRYMANDERING should be ILLEGAL period",
            "score": 4,
            "author": "Brickback721"
        },
        {
            "level": 0,
            "comment": "Come to Tennessee! We need Dems to get feet on the ground because the state Dem party is an inept piece of garbage.",
            "score": 2,
            "author": "I_Brain_You",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Please please please!! Lots of opportunity here as the state’s population grows. My company has brought in lots of millennials and I’m sure other companies are doing the same. Could help swing the state left.",
            "score": 2,
            "author": "sarcago"
        },
        {
            "level": 0,
            "comment": "It's issues are gerrymandering related, people not voting and that causes a slight deficit in Republicans favor since their demo is older, the more reliable voting bracket",
            "score": 2,
            "author": "FirmDcream"
        },
        {
            "level": 0,
            "comment": "Fuckin do it. \n\nStart Liberating some of these states for the bullshit.",
            "score": 2,
            "author": "Back2Reality4Good"
        },
        {
            "level": 0,
            "comment": "The thinking used to be that North Carolina would be the next swing state, not Georgia. Metro Atlanta however both exploded in size and moved left.",
            "score": 2,
            "author": "NotAnotherEmpire"
        },
        {
            "level": 0,
            "comment": "I feel like absent gerrymandering and fuckery NC is even more purple or blue than GA",
            "score": 2,
            "author": "apitchf1"
        },
        {
            "level": 0,
            "comment": "you've got my vote",
            "score": 2,
            "author": "fwambo42"
        },
        {
            "level": 0,
            "comment": "Bring it on. NC is a cesspool of MAGA bs.   Lets get this bread in ‘24",
            "score": 2,
            "author": "Odd_Sweet_880"
        },
        {
            "level": 0,
            "comment": "Just lose the electoral colllege bullshit. One adult, one vote. Automatic registration. Most votes wins.",
            "score": 2,
            "author": "Apprehensive_Loan776"
        },
        {
            "level": 0,
            "comment": "I disagree, as Democrats have not been able to consistently win statewide in North Carolina aside from the popular incumbent governor Roy Cooper. Republicans control both U.S. Senate seats, a majority of the (statewide elected) North Carolina Supreme Court, and are about to win a huge majority of its U.S. House delegation. Since 1980, North Carolina has only voted for a Democratic presidential candidate in 2008 (Obama).",
            "score": 8,
            "author": "Such-Armadillo8047",
            "replies": [
                {
                    "level": 1,
                    "comment": "NC has had 3 total Republicans since 1960, they only had 4 total since 1880.\n\nThere has only been 1 republican AG since 1900.\n\nNC can elect Democrats they can win state wide but there needs investment which hasn't happened much.",
                    "score": 14,
                    "author": "shaunrundmc"
                }
            ]
        }
    ]
}