{
    "id": "147a43b",
    "score": 623,
    "title": "Supreme Court rejects lawsuit that sought to hold Reddit responsible for hosting child pornography",
    "author": "yhl3052",
    "date": 1686529616.0,
    "url": "https://www.reddit.com/r/politics/comments/147a43b",
    "media_urls": [
        "https://www.cnn.com/2023/05/30/politics/reddit-responsibility-immunity-supreme-court-child-pornography/index.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "This is good news for the entire internet, not just Reddit. If sites were liable for users posts, the internet as we know it would come to an end",
            "score": 209,
            "author": "vestedinterests1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do think that sites should be liable and responsible for the content they *recommend* though.\n\nThis is the best and easiest way I have seen talked about to control the issues we see today.\n\nNot the only solution, but a very big and simple step.",
                    "score": 22,
                    "author": "Barneyk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like this.",
                            "score": 9,
                            "author": "UrbanGhost114"
                        },
                        {
                            "level": 2,
                            "comment": "A lot of sites wouldn't bother with the risk of making an algorithm at all if that was the case.\n\nSo what I'm saying is that this is a wonderful idea.",
                            "score": 5,
                            "author": "WizardingWorldClass",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;A lot of sites wouldn't bother with the risk of making an algorithm at all if that was the case.\n\nI was preparing to start arguing with you here.\n\n&gt;So what I'm saying is that this is a wonderful idea.\n\nTo just basically make this point. :)",
                                    "score": 4,
                                    "author": "Barneyk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Litterally my exact thought process was: \"That would break content recommendation functionality on most of the sites that get a meaningful chunk of internet traffic...is that a bad thing?\"",
                                            "score": 5,
                                            "author": "WizardingWorldClass"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sorry but section 230 of the communications decency act already addresses this and hosting child porn is one of the few exceptions a internet services provider can in fact be held liable for.  \n\nSounds like a bad decision.",
                            "score": 0,
                            "author": "Turbulent_Summer6177"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I remember a world before ‘user media posts’ were a common thing. I believe it was a better world. People constantly talk about how FB, Instagram, TikTok, et Al. are ruining society. If sites being held liable for the content they host and broadcast to the world takes us back to that place and ends the internet as we know it; I’m fine with that. In fact, that sounds pretty freaking awesome!",
                    "score": -2,
                    "author": "TheRareWhiteRhino",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It would be awful. The entire internet would look like cable tv or a 90s shopping mall",
                            "score": 44,
                            "author": "riverbedwriter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Worse, the entire internet might look like the 1990s internet!",
                                    "score": 23,
                                    "author": "jlking3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey, 90s internet was the shit. You could throw up a web page in minutes just with some html.\n\nIt took 3 minutes to dial up and another minute to load the page, and good luck finding it with the search engines back then, but still!",
                                            "score": 6,
                                            "author": "Funda_mental"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Web 1.0 lol those were the days.",
                                            "score": 8,
                                            "author": "Adolf-Redditler"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Certain people loved that world.\n\nWhen only an \"elite\" few controls all of media.\n\nHell, half he music from before the 2000s only became popular because we were all fo ced to listen to the same handful of songs a day.\n\nThen the same thing with TV shows and movies, and even books.",
                                    "score": 13,
                                    "author": "Politicsboringagain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i call it \"the monoculture\" when i try to explain it to my younger friends",
                                            "score": 5,
                                            "author": "mikesmithhome"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No technology would be lost. Only user generated media from social media sites that can’t police child porn would be done away with. I’m fine with that.",
                                    "score": 1,
                                    "author": "TheRareWhiteRhino"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The above comment is censored",
                            "score": 3,
                            "author": "theFuzz1"
                        },
                        {
                            "level": 2,
                            "comment": "I think one of the beauties of the internet is that you could create a view that was exactly that. If there was commercial value in it (I.e. other people want that view of the internet), then you could create a business around it\n\nJust because people post user media, doesn’t mean you have to see it or even be aware of it\n\nThe alternative would be to police US citizens any time they’re on the web - block foreign sites that refuse to follow the US rules, and (presumably) fine or imprison us citizens that find a way to get round the rules - in order to preserve a random time in internet history that a few consider “the golden age”",
                            "score": 2,
                            "author": "nudistinclothes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, OF COURSE, people can choose not to watch. The kids that are being raped for the entertainment of adults do not get to choose. People who view those videos SHOULD be policed. Foreign and domestic sites that host child porn SHOULD be shut down. Citizens that get around the rules so they can watch child pornography SHOULD be imprisoned. If ending the internet as we know it so that user media can no longer be posted, so be it. It seems that children being raped isn’t enough for you to care. I guess user media is just that important to you. How disturbing.",
                                    "score": 3,
                                    "author": "TheRareWhiteRhino",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think that’s what you were proposing in the comment I responded to. Your points are all valid, and I agree with all of them. But your original comment was about returning to an internet with no user-sourced media, which is not what your reply is about \n\nIt kind of feels like a straw man attack, tbh",
                                            "score": 1,
                                            "author": "nudistinclothes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Child porn is what the post is about. \n\n“If sites being held liable for the content they host and broadcast to the world takes us back to that place and ends the internet as we know it; I’m fine with that,” was what I wrote. \n\nI don’t know how you could get it confused, but fine, you misunderstood.",
                                                    "score": 2,
                                                    "author": "TheRareWhiteRhino",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah, I got ya. I misunderstood",
                                                            "score": 2,
                                                            "author": "nudistinclothes"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Every support forum would shut down. You would never find answers online again.",
                            "score": 1,
                            "author": "flatline000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Support forums can’t operate without hosting child pornography?",
                                    "score": 0,
                                    "author": "TheRareWhiteRhino",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Support forums can't operate if they're required to inspect every single post made before the post can be accepted and displayed.",
                                            "score": 0,
                                            "author": "flatline000",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So what? If they can’t run their business without hosting and therefore disseminating child pornography, they shouldn’t be in business. This isn’t difficult. If we have to CALL support instead of getting help ONLINE, then so be it! If it helps fight the scourge of children being raped for the entertainment and enjoyment of adults, that’s a deal I’m eager to make. I would hope that calling support wouldn’t be too much to ask from you; but maybe it is.",
                                                    "score": 0,
                                                    "author": "TheRareWhiteRhino"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; the internet as we know it would come to an end\n\nIf ever there were an argument for sites being liable for the content they allow, this is it. The internet used to actually be good.",
                    "score": 1,
                    "author": "darkhorsehance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't know why it got to the SCOTUS. Telephone companies have never been responsible for the content of the conversations.",
            "score": 70,
            "author": "Im_Talking",
            "replies": [
                {
                    "level": 1,
                    "comment": "There’s a difference. A telephone company is only passing the bits and they don’t know what’s in there. As long as they are not inspecting traffic they have no liability.  Reddit has full knowledge of what’s on its forums. They have to police illegal content or they could be held liable.",
                    "score": 17,
                    "author": "routerg0d",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Reddit has full knowledge of what’s on its forums. They have to police illegal content or they could be held liable.\n\nAn argument can be made that _at best_ Reddit is negligent because it is so large and defers most moderation to users so it isn't as involved in awareness of content posted to their platform as one would like them to be. \n\nReddit only takes action IF they are made aware of the content - either through Reddit oversight or user submitted reports. If the content is in a niche subreddit with clandestine users all seeking the same illegal content, awareness of the illegal content may take some time. \n\nThe repost issue that the plaintiff argues is absolutely a product of the platform and it's moderators abiding by reposts because it creates too much value for the platform (traffic) and the user (karma). Reddit doesn't have robust enough tools in place to moderate user-submitted reposts of content. They may be able to filter out reposts of links, but not uploads (reuploads) of video or user-ripped and re-uploaded content.",
                            "score": 14,
                            "author": "BurstEDO"
                        },
                        {
                            "level": 2,
                            "comment": "That's not a fully true statement.\nReddit does NOT know what's on all it's forums, which has created most of this issue.\nAlso, phone companies Can listen to all phone calls.\n\nThey only actual difference is the public can see reddit posts, but they can't hear all phone calls.\n\nI'm sure there have been a massive amount of illegal emails, we just don't know about it.",
                            "score": 3,
                            "author": "Spnwvr"
                        },
                        {
                            "level": 2,
                            "comment": "The difference is not that big, just like the telephone company have to listen through each call, Reddit needs to go through all posts. The biggest difference is that a call is between two people and Reddit potentially millions. There’s probably an AI that could go through the posts and flag potential bad content, but then a human would have to check it, that’s not a job anyone wants I’d believe.",
                            "score": 9,
                            "author": "nicholasruunu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a job hundreds of people have in Tampa, and that causes trauma:   \nhttps://www.theverge.com/2019/6/19/18681845/facebook-moderator-interviews-video-trauma-ptsd-cognizant-tampa",
                                    "score": 7,
                                    "author": "tek_ad"
                                },
                                {
                                    "level": 3,
                                    "comment": "I spent a week shadowing the abuse department at Yahoo back in the late 2000's. They had a team that had to go through every report and review the material to determine if it was a violation or not. \n\n1 week was enough for me to know it wasn't a job I wanted. People are fucked up.",
                                    "score": 3,
                                    "author": "snakebite75"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Reddit has full knowledge of what’s on its forums. \n\nThere is no way that is true. There are hundreds of new posts, and thousands of new comments every minute.\n\n&gt;They have to police illegal content or they could be held liable.\n\nThey have to make a good faith effort to remove illegal content they are aware of, but it's still a reactive process of identifying illegal content, and removing it as they become aware of it. They don't actually know all the illegal content on the site at any one time.",
                            "score": 1,
                            "author": "Rogue100"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man, can you imagine if this came down on reddit the same week as the mass blackout?",
            "score": 25,
            "author": "ElderCunningham"
        },
        {
            "level": 0,
            "comment": "&gt; Doe’s lawyer said in court papers that she was a minor when her then-boyfriend created multiple videos of the two of them engaging in sex, sometimes without her knowledge, and posted them online. She reported the content to Reddit and said it took days to remove the content but then allowed it to be reposted. \n\nThis is not ok",
            "score": 36,
            "author": "ILikeNeurons",
            "replies": [
                {
                    "level": 1,
                    "comment": "The boyfriend and reposters are criminals here, not the site.",
                    "score": 75,
                    "author": "Liar_tuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "¿Por qué no los dos?",
                            "score": -24,
                            "author": "ILikeNeurons",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's impossible to programmatically determine what content to block, too expensive to pay folks to review everything that gets posted, and impractical to be held accountable for things that get through despite best-effort policies.\n\nIf aws was culpable every time encrypted illegal content was shared via s3, they would have to drop DropBox as a client and probably just shutter.\n\nIf you want tools like DropBox, GMail, and sites like Reddit to exist, you can't hold them accountable for the crimes their users commit without their knowledge",
                                    "score": 16,
                                    "author": "its_spelled_iain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;It's impossible to programmatically determine what content to block\n\nThat's not *entirely* true, is it? Apple was gonna ban CP with hashes or something till people freaked. Wouldn't stop a first post but makes reposts less likely and easier to spot.",
                                            "score": 0,
                                            "author": "Grow_Beyond",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Doesn't help if the users tweak one bit or encrypt",
                                                    "score": 3,
                                                    "author": "its_spelled_iain",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But it would help in all the cases they didn't.",
                                                            "score": 0,
                                                            "author": "Grow_Beyond",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sure but you're not determining what to block, you have a sieve instead of a filter",
                                                                    "score": 2,
                                                                    "author": "its_spelled_iain"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Why would the company/platform be a criminal? They didn't conduct any illegal activity; a criminal abused their platform and the content was removed when they were notified.",
                                    "score": 13,
                                    "author": "mckeitherson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Removed eventually, and then allowed to be re-posted.",
                                            "score": 0,
                                            "author": "ILikeNeurons",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're making it out to be malicious or negligent with \"allowed to be re-posted\", when the reality is that's an ability everyone has to upload content to Reddit. Reddit isn't responsible for the content uploaded by users per Section 230, so if something like that gets reuploaded, just report it again to be removed.",
                                                    "score": 2,
                                                    "author": "mckeitherson",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's why Section 230 needs a re-work. \n\nYou might feel differently about this if it was your non-consensual content being uploaded.",
                                                            "score": 1,
                                                            "author": "ILikeNeurons",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "A lot of the internet would disappear or change completely with a Section 230 rework that changes the responsibility model. Maybe advocate for criminal charges for this behavior by individuals instead.",
                                                                    "score": 2,
                                                                    "author": "mckeitherson",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Given that a lot of the internet harbors child porn and rapists, maybe that's not a bad thing.",
                                                                            "score": 1,
                                                                            "author": "ILikeNeurons",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "As the Justices rightfully pointed out in these cases, you're seeking to punish platforms because of individuals who violate the law and ToS, a responsibility model no other service providers is held to.",
                                                                                    "score": 1,
                                                                                    "author": "mckeitherson"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Because thats not how it works",
                                    "score": 33,
                                    "author": "Reitter3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[It could be](https://www.propublica.org/article/addressing-rape-in-four-minutes-or-less-dating-app-reps-left-unprepared-to-respond-to-assault-victims).",
                                            "score": -29,
                                            "author": "ILikeNeurons",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The article has nothing to do with a big web page like reddit?",
                                                    "score": 18,
                                                    "author": "Reitter3",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; Section 230 was created to protect websites from being held liable for their users’ speech unless it was criminal. But dating platforms, including Match Group, have successfully invoked Section 230 to deflect lawsuits claiming negligence for incidents involving users harmed by other users, including victims of sexual assault. Often, judges dismiss cases before an aggrieved party can even obtain information about the company’s response to the assault. One result of this obstacle is that very few civil suits have been filed against online dating companies seeking to hold them liable for harm suffered by users.\n\nChild porn is criminal.",
                                                            "score": -14,
                                                            "author": "ILikeNeurons",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What's your point? \n\nNothing in 230 shall be construed to impair the enforcement of section 110 (relating to sexual exploitation of children) of title 18, or any other Federal criminal statute. [https://www.law.cornell.edu/uscode/text/18/part-I/chapter-110](https://www.law.cornell.edu/uscode/text/18/part-I/chapter-110)\n\n18 U.S. Code § 2258A - Reporting requirements of providers [https://www.law.cornell.edu/uscode/text/18/2258A](https://www.law.cornell.edu/uscode/text/18/2258A)\n\n230 leaves in place something that law has long recognized: direct liability. If someone has done something wrong, then the law can hold them responsible for it.",
                                                                    "score": 3,
                                                                    "author": "DefendSection230"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "“CHiLd PoRn iS CrImInal” You dont say? Still there is a reason for things being the way they are. Websites and dating sites wouldn’t exist otherwise. There is a reason these lawsuits keep failing. “Think of the children!” Has always been a bad faith argument.",
                                                                    "score": 10,
                                                                    "author": "Reitter3",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[Dude](https://www.txst.edu/philosophy/resources/fallacy-definitions/Is-ought.html).",
                                                                            "score": -4,
                                                                            "author": "ILikeNeurons",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Its not a fallacy, if there is a reason. Which is that website cant control the amount of content that its posted on them. This lawsuit on reddit, for example, was brought forward by a anti porn group. By the way, thinking of fallacies, here is yours: https://pt.m.wikipedia.org/wiki/Argumentum_ad_misericordiam",
                                                                                    "score": 12,
                                                                                    "author": "Reitter3",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Section 230 FTW!",
            "score": 10,
            "author": "tendervittles77",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Section 230 needs a rework](https://www.propublica.org/article/addressing-rape-in-four-minutes-or-less-dating-app-reps-left-unprepared-to-respond-to-assault-victims).",
                    "score": -3,
                    "author": "ILikeNeurons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds like dating apps need more regulation not 230 in general",
                            "score": 6,
                            "author": "Waderick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "230 is protecting them.",
                                    "score": 0,
                                    "author": "ILikeNeurons",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Which additional regulation could change. 230 effects way more than just dating sites and apps.",
                                            "score": 1,
                                            "author": "Waderick"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No it doesn't.",
                            "score": 3,
                            "author": "mckeitherson"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe but removing or gutting like some have said kills the internet opening it only to massive corporations that can afford lawyers",
                            "score": 7,
                            "author": "ianrl337"
                        },
                        {
                            "level": 2,
                            "comment": "230 leaves in place something that law has long recognized: direct liability. If someone has done something wrong, then the law can hold them responsible for it.",
                            "score": 1,
                            "author": "DefendSection230"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If someone glued unlawful content onto a light pole, you can't hold the power company responsible unless they refuse a court order to remove it.",
            "score": 2,
            "author": "CosmicDave"
        },
        {
            "level": 0,
            "comment": "Reddit's definition of child porn I reported what I believed to be child porn, and I was told there was nothing wrong with what I reported.",
            "score": 6,
            "author": "Notduckie_uwu",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s extra weird because there was a period of time where some people discovered some sort of “reporting loophole” that allowed them to report anyone’s Reddit and get it banned automatically before a human evaluation could take place, and they used it against sex workers leading to dozens of them losing their accounts. They weren’t posting anything underage or nonconsensual, either. \n\n\nIt feels like a sick joke when it’s easier to get an adult who posts their own nudes banned than an adult posting nudes of an underage kid.",
                    "score": 6,
                    "author": "madamevanessa98"
                },
                {
                    "level": 1,
                    "comment": "I wonder how they make that call. Do they have some dude look at NSFW post and go “2)3 checks out”. \n\nI reported a video once of a woman who’s bathing suit looked like it was knocked off by mistake. They told me the video was fine to stay up. Or definitely looked like she didn’t intentionally expose herself",
                    "score": 6,
                    "author": "Algoresball",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I wonder how they make that call. Do they have some dude look at NSFW post and go “2)3 checks out”.\n\n\nI know FB does, I'm sure reddit does something similar.",
                            "score": 5,
                            "author": "keyjan"
                        },
                        {
                            "level": 2,
                            "comment": "Hmm, I'm assuming a machine-learning algorithm scans the reported imaged which is then followed up by an actual person checking it... if it's anything like Grindr, anyway. Poor bastard. Gotta be an awkward and deeply unpleasant task.",
                            "score": 0,
                            "author": "No-Environment-3997"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Interesting but if you misspell a word.  \nTnuC   the mods go crazy threatening to ban you and remove your comment",
                    "score": 1,
                    "author": "CommunicationNo1140"
                },
                {
                    "level": 1,
                    "comment": "I reported a CP post yesterday in which the OP is extremely explicit. Reddit decided it’s fine.",
                    "score": 0,
                    "author": "Neolithique"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If the sites aren’t responsible for anything then how are we ever going to control the videos of men raping babies. Yes, the worst of the worst, but that is what the bible thumping Josh Dugger had on his laptop. It provides a lucrative way for these sick people to encourage others and make money.  I don’t understand who is supposed to stop it?",
            "score": 2,
            "author": "DauOfFlyingTiger"
        },
        {
            "level": 0,
            "comment": "Reddit mods on suicide watch",
            "score": -1,
            "author": "Substantial_Monk_781"
        },
        {
            "level": 0,
            "comment": "It would out too many of their friends and benefactors.",
            "score": -5,
            "author": "Zanos-Ixshlae"
        }
    ]
}