{
    "id": "147ekla",
    "score": 378,
    "title": "The Three Biggest Obstacles to Convicting Trump",
    "author": "rowrbazzle75",
    "date": 1686543181.0,
    "url": "https://www.reddit.com/r/politics/comments/147ekla",
    "media_urls": [
        "https://www.theatlantic.com/ideas/archive/2023/06/three-biggest-obstacles-convicting-trump/674366/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Can’t wait for Trump to blurt out that he’s going to win because he appointed Cannon and she owes him.",
            "score": 74,
            "author": "MadBlue",
            "replies": [
                {
                    "level": 1,
                    "comment": "His own mouth is the only thing that could be his downfall.",
                    "score": 14,
                    "author": "tcoh1s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;His own mouth is the only thing that could be his downfall.\n\nNot entirely true......a steep Ramp maybe too?",
                            "score": 1,
                            "author": "GougeM",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A really heavy glass of water, perchance.",
                                    "score": 2,
                                    "author": "BigTentBiden"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wouldn't be surprised if there was correspondence between the two in previous months and recently.\n\nHe so dumb I'm sure emails or calls exists and an aide was present.",
                    "score": 1,
                    "author": "jcamp088"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Smith’s most notable advantage is the factual strength of his case\n\nWould be all it took in a system that wasn't completely corrupt and broken. \n\nTrump being extremely obviously guilty would have been all that mattered if the whole thing wasn't rigged in favor of rich and powerful people unapologetically lying about indisputable facts.",
            "score": 199,
            "author": "Viking_Hippie",
            "replies": [
                {
                    "level": 1,
                    "comment": "If trump doesn’t get some kind of conviction or punishment for this, then there is no justice and it’s a slippery slope.",
                    "score": 34,
                    "author": "backcrackandnutsack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's well past a slippery slope at this point. It's a Nickelodeon slime cliff.",
                            "score": 21,
                            "author": "Badger87000"
                        },
                        {
                            "level": 2,
                            "comment": "Absolutely. He's guilt incarnate.",
                            "score": 9,
                            "author": "Viking_Hippie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He may go make the argument that what he did was illegal, however it would be unfair to punish him now since he never got caught or in trouble before. Trump is a societal criminal. He wants to put society on trial and say that they can't turn him down now since it has never turned him down before. He wants us to admit we are at fault and let him win because he cheated fair and square.",
                                    "score": 14,
                                    "author": "stevez_86"
                                },
                                {
                                    "level": 3,
                                    "comment": "You give him too much credit.  If Ron somehow beats Don in the primaries,  I suffer to think the absolutely chaos we'll witness. That one is more extreme and doesn't advertise his wrongdoings",
                                    "score": 3,
                                    "author": "rdcomma"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The damage has already been done.  It doesn't really matter anymore.  Our allies now know that every 4 years you have a risk of major secrets being sold to the highest bidder.  In addition, you have half the country basically rubber stamping this activity as long as it results in the gain of political power.\n\nOur democracy cannot recover when the rot goes so deep.  The situation mirrors that of the latter days of the Roman Republic.",
                            "score": 14,
                            "author": "oblivion476"
                        },
                        {
                            "level": 2,
                            "comment": "Oh I think we are well toward the bottom of that slippery slope. The bottom being no accountability whatsoever for the rich.",
                            "score": 4,
                            "author": "OkEnvironment3961"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;If trump doesn’t get some kind of conviction or punishment for this, then there is no justice and it’s a slippery slope.\n\nI think he is familiar with the slippery slope....:)",
                            "score": 1,
                            "author": "GougeM"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Would be all it took in a system that wasn't completely corrupt and broken.\n\nOr filled with people that will be hearing his case that were appointed by him, with no requirement to recuse themselves.",
                    "score": 42,
                    "author": "mckeitherson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That would very much fall under the headings \"corrupt\" and \"broken\" IMO..",
                            "score": 23,
                            "author": "Viking_Hippie"
                        },
                        {
                            "level": 2,
                            "comment": "Or having members of the MAGA cult in the jury pool. It only takes one to make it impossible to convict.",
                            "score": 16,
                            "author": "gordo65",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm curious whether or not they will have to make sure the jury pool contains only those who have clearances...  Mostly because the nature of the case.  If that's the case it narrows the options and could tilt it in the governments favor.\n\nAs to the judge?  There's definitely a case to be made that she's biased against the prosecution and has already had 2 rulings overruled on appeal.  Which could force them to remove her from being allowed to hear the case.  I strongly suspect Smith is savvy enough to fight to change judge.  It's also easy to prove that she shows Trump favor.",
                                    "score": 9,
                                    "author": "Ferelwing",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That would be facially unconstitutional.",
                                            "score": 3,
                                            "author": "Ornery-Ticket834",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's kinda what I'm waiting to find out.",
                                                    "score": 1,
                                                    "author": "Ferelwing"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes that's another issue too, and I wonder if they would be identified for replacement by a judge or it would result in a retrial due to a hung jury.",
                                    "score": 1,
                                    "author": "mckeitherson"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What YOU said.",
                    "score": 5,
                    "author": "StillGotLove4GOT"
                },
                {
                    "level": 1,
                    "comment": "This system is acting exactly as it was designed",
                    "score": 2,
                    "author": "Lurker-DaySaint",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, people forget and/or are in denial about the fact that it was written by and for rich and powerful people from the start and increasingly so since then",
                            "score": 2,
                            "author": "Viking_Hippie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fadchists don't care about facts they care about their chosen figurehead maintaining power and eventually getting absolute power so those who they detest can be harmed or disappeared and they can get the theocracy they long so much for. #ConservativesAreUnfitToGovern",
                    "score": 2,
                    "author": "DirtSunSeeds",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://imgur.com/qY4ImCh.gif",
                            "score": 2,
                            "author": "Viking_Hippie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Four: He's a demon. How any individual can have so much sway over so many people while being such a horrible human being defies normal physics. How a poor person from the South can consider a rich New York City Penthouse Plaboy Con-Artist his champion is unreal.",
            "score": 98,
            "author": "RedditRage",
            "replies": [
                {
                    "level": 1,
                    "comment": "You may be interested in Timothy Egan's new book, A Fever in the Heartland, in which he talks about how a truly monstrous grifter wandered into Indiana 100 years ago, gave rebirth to the KKK, and got a slate of state and national politicians elected, all in 4 years. In a state that lost 25,000 sons to the battle against slavery (sorry, I mean \"state's rights\" /s) just 60 years prior. The children and grandchildren of Union soldiers joined the KKK by the 100s of 1000s. The egregiously bad judgment of the people is not unheard of.",
                    "score": 66,
                    "author": "_JJMcA_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm interested, that sounds like a fascinating book, thanks for the recommend.\n\nedit: i bought this book it's great.",
                            "score": 16,
                            "author": "basketballsteven"
                        },
                        {
                            "level": 2,
                            "comment": "What's the secret sauce to bigotry propaganda?",
                            "score": 1,
                            "author": "spiegro"
                        },
                        {
                            "level": 2,
                            "comment": "What's the secret sauce to bigotry propaganda?",
                            "score": 1,
                            "author": "spiegro"
                        },
                        {
                            "level": 2,
                            "comment": "Bigotry and hatred are blinding forces.",
                            "score": 1,
                            "author": "jonathanrdt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The racism and contra-factual everything was baked into the Republican party starting in the 50s.\n\nhttps://www.thenation.com/article/archive/exclusive-lee-atwaters-infamous-1981-interview-southern-strategy/",
                    "score": 22,
                    "author": "VintageLunchMeat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "More like the 1850s.",
                            "score": 3,
                            "author": "Positive_Cat_3252",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Republicans were actually the progressives for a while there. Lincoln and Grant were both pretty great. To get into where things went wrong we have to do a deep dive into the forgotten age of American politics. \n\nThings *started* to go wrong in the middle 1870's when (southern) Democrats managed to suppress black turnout enough to steal the south back-Republicans then accepted a devils compromise for the presidency, withdrawing the last troops in exchange for Hayes winning the nomination. \n\nThis was really caused by Grant fucking up and letting corruption run his presidency, but that's a messy topic.\n\nIn any case this broke the Republicans social progressive platform in it's moral core, as now the North/South line was basically reestablished-Black voters were put back into slavery, both de facto and quite literal slavery, until WW2. \n\nStill, the party up to and including Theodore Roosevelt proved to be socially and fiscally progressive, and made great strides in breaking the corruption and inequity of American society. Roosevelt wasn't perfect, but was legitimately better than the time he lived and really did try. Then he broke with Taft, split the vote, and Wilson won.\n\nAnd, to be entirely and fully clear, America has been pretty thoroughly *fucked* since.\n\nAt this point the Democrats were still the racist ones, and Wilson was the worst. Wilson is so bad that, even understanding what some other presidents have done, Wilson is still either the worst or second worst president of all time. Wilson is basically Hitler with a veneer of academia. He's that bad. He's the reason segregation reached DC. He's the reason the KKK came back. He's the reason anti-communist raids became normal. He's the reason blatant American colonialism became public policy. If something bad happened, Wilson started it. The greatest failure of the American social studies education program is that Wilson somehow scores in the top 10-20 of Presidents even now-Wilson was an *absolute shit*. *Everything* bad is due to Wilson. \n\nThe presidents in between Wilson and Eisenhower were *all* at best social moderates. FDR got the closest to reform, but no one was a saint. Eisenhower is the last reasonable Republicans president, and the parties at this time were hardly clearly divided-Democrats tended to be economically progressive but socially conservative and Republicans tended to be economically conservative and socially progressive, but both combinations of those traits prevent real progress from happening and differences were slight.\n\nAnd then we get JFK and LBJ. This is where the swap happened. JFK starts socially progressive policies and LBJ delivers, truly delivers. And the Republican party loses its shit.\n\nHence the timeline is basically-Republicans good \\~Lincoln, mediocre \\~Hayes, good \\~Teddy, *not the fucking antichrist* \\~Wilson, and everyone is mediocre until JFK and LBJ turn the democrats liberal and republicans conservative. \n\nThat was supposed to be quicker, but I got distracted explaining why *Wilson the racist antichrist fuckstick* ruined everything.",
                                    "score": 17,
                                    "author": "DM_DM_DND",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "1948 was the major turning point. Truman had already pissed off the racists by desegregating the military, then the Dems added Civil Rights to their platform at the 1948 convention causing Strom Thurmond to leave the party to run for president under the new Dixiecrat party. Everyone thought Truman was toast (Dewey Defeats Truman!). \n\nThe Dixiecrats were a fairly powerful voice in politics until Nixon’s Southern Strategy turned them all Republican, which they have been since.",
                                            "score": 9,
                                            "author": "Nater_the_Greater"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Eh. The racists moved from one party to another. I'm shaky on the fine details, but knowing that the Southern Strategy is a thing basically unlocked American politics for me.",
                                    "score": 8,
                                    "author": "VintageLunchMeat"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Never underestimate the power of stupid people in large groups. -George Carlin",
                    "score": 8,
                    "author": "StillGotLove4GOT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The judge should be forced to recuse. If she does 1 thing wrong, mistrial and they will just have to do it over again. There are really no “obstacles” here. \n\nTrump is a criminal and not even a smart one. Shitty articles like these need to stop acting like he’s Corleone.",
            "score": 102,
            "author": "reck1265",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;mistrial and they will just have to do it over again\n\nThis is not completely true, because this is a criminal case. There are limits to the government's ability to retry the same case against the same defendant, including a prohibition on \"double jeopardy\" that would apply to certain efforts to retry the case.",
                    "score": 5,
                    "author": "maybenotquiteasheavy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are limits to retrying the case after two sometimes three trials. Double jeopardy is not implicated in no verdict cases.",
                            "score": 3,
                            "author": "Ornery-Ticket834",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right but the worry isn't about a no verdict case, it's about the judge entering an acquittal (which would implicate DJ) or issuing evidentiary rulings that lead to a jury acquittal (same) or, again, JNOV.",
                                    "score": 1,
                                    "author": "maybenotquiteasheavy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A JNOV can be appealed. A directed verdict cannot. I truly doubt she will issue either. The evidence rulings may be interesting but if they go against basically black letter law, those can be appealed during the trial. After the appeals court rulings that were issued on her opinions, she may be a little gun shy about going over the top. Let’s see. She is certainly a worthless hack.",
                                            "score": 2,
                                            "author": "Ornery-Ticket834",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am hoping she will be gun shy in light of past guidance, and I doubt she takes it from the jury, but I hope she just refuses herself or gets recused.",
                                                    "score": 1,
                                                    "author": "maybenotquiteasheavy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "She is a hack. She will never recuse herself. I agree she knows that the Appeals court will be looking over her shoulder, and hopefully that will help. She cannot , in my opinion stop this from getting to a jury. She will be most useful to him for stalling, and perhaps some evidentiary issues if he is allowed to relitigate the judges rulings in DC. I am not even sure he can do that but frankly am unsure since it’s an unusual situation. I believe the law of the case may apply,meaning the rulings that have been made and not appealed or appealed are final. I know there will be howling by him about everything and anything.",
                                                            "score": 1,
                                                            "author": "Ornery-Ticket834"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If they have a judge that they can already prove isn't impartial they can change the venue and call her impartiality into question.  The real question is whether or not she recuses herself.  If she doesn't then even if she throws the book at Trump an argument can be made against her.  Trump's lawyers could then claim that she did so to avoid it going to the Appeals court on Appeal.  \nIf she continues to help him then that furthers the questions about her impartiality.  If she is smart she recuses and sends the case to someone else by pointing to the problems of her being in charge of overseeing this case.\n\nThe real question is will she.",
                            "score": 0,
                            "author": "Ferelwing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with all of this but it doesn't change the fact that there's *no appeal* if Cannon doesn't recuse herself and kicks them on Rule 29 or JNOV.",
                                    "score": 1,
                                    "author": "maybenotquiteasheavy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They could retry elsewhere by pointing to her obvious bias as far as I know.",
                                            "score": -1,
                                            "author": "Ferelwing",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They, uh, can't, because that's double jeopardy.",
                                                    "score": 1,
                                                    "author": "maybenotquiteasheavy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If the judge kicks it before a jury hears it then it's not double jeopardy especially if they can show bias.\n\n\"Mistrials are generally not covered by the double jeopardy clause. If a judge dismisses the case or concludes the trial without deciding the facts in the defendant's favor (for example, by dismissing the case on procedural grounds), the case is a mistrial and may normally be retried.\"\n\nAnd then we have this: https://ncpro.sog.unc.edu/manual/203-1",
                                                            "score": 2,
                                                            "author": "Ferelwing",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;If a judge... *without deciding the facts in the defendant's favor*....\n\nAll the scenarios that have been discussed here *do* involve cannon deciding the facts in Trump's favor. If that happens, then you can't retry. That's why it's scary and bad.\n\nEdit: JNOV and Rule 29 from my prior comment are decisions a judge can make that are basically \"The prosecutors didn't prove their case, D wins.\" They would be fact determinations and trigger double jeopardy.\n\nEdit 2:\n&gt;if the judge kicks it before a jury hears it\n\nThen that's not a retrial, it's just a trial.",
                                                                    "score": 0,
                                                                    "author": "maybenotquiteasheavy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't think she will be the judge.  I think Smith is feeling her out, he has 5 days to decide.\n\nAs for the she dismisses it without the jury, that's the scenario that they are claiming.  I don't think Smith is willing to let her just kick it out of court.\n\nEdited to add: Things that can be used to remove her https://www.leg.state.nv.us/NRS/NRS-001.html#NRS001Sec235",
                                                                            "score": 1,
                                                                            "author": "Ferelwing",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Thanks for the link! I didn't realize Federal Judge Aileen Cannon, who sits in Florida, is a Nevada State Court judge governed by Nevada law. This Nevada law for removing Nevada State Court judges from cases will be a huge help.",
                                                                                    "score": 1,
                                                                                    "author": "maybenotquiteasheavy",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It isn’t the article that promotes the Corleone thing, it is because his cult is rabid. He got 80 million votes in 2020 - he lost some, but not enough. Why else would he be leading in the polls?",
                    "score": 13,
                    "author": "Yelloeisok",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He got 74MM, not 80MM.\n\nNot just being pedantic, because Biden only got 81MM, so claiming 80MM for Trump makes it sound close, when it really wasnt.",
                            "score": 5,
                            "author": "Quirky-Mode8676"
                        },
                        {
                            "level": 2,
                            "comment": "The fact he was a former president doesn't help. They can litterally dole out pardons to whoever they choose while in power.",
                            "score": 3,
                            "author": "good_from_afar"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "From the article:\n \n\n&gt;&gt;To begin with, Smith was exceedingly unlucky in his drawing of a judge. The case was assigned to Judge Aileen Cannon, the same judge whose interference in the original search of Mar-a-Lago was roundly criticized and rejected by the Eleventh Circuit (the appellate court that oversees her district). Her past rulings suggest that her instincts will favor Trump. Federal district judges have substantial discretion in the conduct of trials, and so their underlying proclivities can matter.\n\n&gt;&gt;To take one extreme example, consider the impact of Federal Rule of Criminal Procedure 29(a). This rule—obscure to most Americans, though well known in the criminal-defense bar—gives a federal judge the power to dismiss a prosecutor’s case at the end of the prosecutor’s presentation on a finding that the government has not presented sufficient evidence from which a jury could find guilt beyond a reasonable doubt. This broad discretion is rarely used, because it allows a judge to substitute their own judgment for that of the jury. But it does exist and, more important for our purposes, it is completely unreviewable. For reasons of double jeopardy, if a judge dismisses a case at the close of the prosecutor’s presentation, that’s the end of it. One does not have to be completely Machiavellian to see in this power the prospect of judicial interference and disruption.\n\n&gt;&gt;Within certain boundaries, trial judges have almost unreviewable discretion to determine what evidence will, and will not, be presented to a jury. Often, judges use that authority to trim frivolous defense arguments. Sovereign-tax protesters, for example, are not allowed to offer evidence that they think shows that the U.S. government is not constitutionally authorized to impose an income tax. Nonsense arguments like that are simply ruled out of bounds.\nMany of Trump’s defenses to the espionage charges border on frivolous. The “I can declassify a document just by thinking about it” and the “I’m entitled to keep whatever documents I want from my presidency” defenses genuinely have no legal basis. Many judges would, quite properly, exclude testimony about those issues as an attempt to confuse the jury with irrelevant matters. But that decision is not inevitable, and a small minority of judges might reach the opposite conclusion, inevitably complicating Smith’s presentation of the case and reducing the likelihood of a conviction.\n\n&gt;&gt;Far more prosaically, trial judges have near absolute and plenary authority over the timing of trials in their courtroom. They set the deadlines for when discovery must be completed, for when motions must be filed, for how quickly (or slowly) they decide those motions, and, ultimately, for when the trial will be scheduled.",
            "score": 55,
            "author": "Naiehybfisn374",
            "replies": [
                {
                    "level": 1,
                    "comment": "Small three things are the same thing? The judge. \n\nArticle is trying to breath out the three issues with the judge?",
                    "score": 33,
                    "author": "HonoredPeople",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No. The judge, the jury, and nullification are the three problems, as I read it – any one of which would be sufficient to avoid holding Trump accountable for the crimes Smith is clearly capable of proving beyond a reasonable doubt. \n\nThis is the article I was hoping someone would write, to dampen down the enthusiasm for the indictments and the assumption that NOW is the time when Trump will finally be held responsible for shitting on democracy and our constitution. Our system has been, for decades, no impediment to Trump, or to most powerful, wealthy white men. We may hope that that is about to change, but history – and these factors – make glee ill-advised.",
                            "score": 33,
                            "author": "_JJMcA_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can they argue that she shouldn't be the judge on the case pre-emptively?\n\nEdited to add: Further reading suggests they can in fact attempt to change the judge by pointing to her previous bias and her being overruled on Appeals.  Her giving Trump preferential treatment twice before will work against her.",
                                    "score": 4,
                                    "author": "Ferelwing"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't think the case will ever see a jury. Cannon will dismiss it right away - and Trump will consider her a hero, and she'll be happy that she served her lord and savior.",
                                    "score": 7,
                                    "author": "Fit-Firefighter-329",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The only way she can dismiss it permanently and without review is if she dismisses it after the prosecution presents its case to a jury.",
                                            "score": 14,
                                            "author": "Lou_C_Fer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And the DoJ will petition the 11th Circuit for a replacement judge long before that happens. I don't see Cannon being assigned to the case as a major obstacle. Just a small hurdle to be taken.",
                                                    "score": 12,
                                                    "author": "Rannasha",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Right, she would have to be really sly to get away with that. Basically playing nice until the time came. I also think doing that would be much more overt than what she did in delaying the investigation.",
                                                            "score": 6,
                                                            "author": "Electrical-Bread-988",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don't think Smith will take the chance.  I think he's going to immediately point out that she has twice overreached on behalf of Trump and was overruled on Appeal.",
                                                                    "score": 7,
                                                                    "author": "Ferelwing",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "She won’t.",
                                                                            "score": 1,
                                                                            "author": "Ornery-Ticket834",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah, I don't think she will recuse either.",
                                                                                    "score": 1,
                                                                                    "author": "Ferelwing"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We can only hope.",
                                                                    "score": 1,
                                                                    "author": "DonnyMox"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She cannot dismiss it on the known facts and the law. If she did the Appeals Court would reinstate it immediately. She is aware of that.",
                                            "score": 1,
                                            "author": "Ornery-Ticket834"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In fairness, this is a REALLY bad judge.",
                            "score": 21,
                            "author": "jayfeather31",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So bad it’s quite possible the 11 district will remove her.",
                                    "score": 7,
                                    "author": "SirLitalott",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I dont think there is any doubt that refusal should be forced after the issues with the investigation portions she handled. She is obviously biased and anybody that has paid attention knows it.",
                                            "score": 9,
                                            "author": "Lou_C_Fer"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nobody talking about the clerk who assigned this case. Can we trust this person?",
                    "score": 11,
                    "author": "bigniek",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what I'm curious about",
                            "score": 8,
                            "author": "netrunui"
                        },
                        {
                            "level": 2,
                            "comment": "The clerk of courts there is apparently a member of the base, I have no idea whether that person can direct the assignment of a judge or if there is an automated system to insure it is random",
                            "score": 2,
                            "author": "sunnywaterfallup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think I heard somewhere (meidastouch maybe) that the case was assigned to her because of het knowledge of the case before this. Which is a load of bs, because she was removed and reprimanded for that case",
                                    "score": 4,
                                    "author": "bigniek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually you’re both probably off. What the clerk said is that it was random but that some of the more senior judges already are at their cap of cases for the year, so it got assigned to more junior ones like Cannon. And there’s not that many judges in the pool to begin with so the odds of her getting picked weren’t that low.",
                                            "score": 3,
                                            "author": "bodyknock"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Actually you’re both probably off. What the clerk said is that it was random but that some of the more senior judges already are at their cap of cases for the year, so it got assigned to more junior ones like Cannon. And there’s not that many judges in the pool to begin with so the odds of her getting picked weren’t that low.",
                                            "score": 1,
                                            "author": "bodyknock"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She was probably assigned the case based on the prior action.",
                            "score": 1,
                            "author": "Ornery-Ticket834"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I only see one. GOP corruption. I wonder if the Trump team will ask for a bench trial Given the blatantly corrupt republican Judge that has this case.",
            "score": 9,
            "author": "Trygolds"
        },
        {
            "level": 0,
            "comment": "Anyone who thinks Cannon will be chastened by what happened in her previous case and won't blatantly grift for Trump in this one (as some TV commentators seem to suggest) is deluding themselves.",
            "score": 25,
            "author": "the_cla",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anyone who thinks Cannon won't be overturned for any bias on motions and orders by appeal to the 11TH circuit didn't read the two appeals she lost on the special master and jurisdiction rulings regarding the search warrant in this case, especially the order to vacate her rulings by judge Prior.",
                    "score": 19,
                    "author": "basketballsteven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What stops her from just dismissing the case?",
                            "score": 3,
                            "author": "arch-angle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The facts and the law. Also a dismissal is subject to an immediate appeal. It would then be reinstated. Over the weekend if that long.",
                                    "score": 1,
                                    "author": "Ornery-Ticket834"
                                },
                                {
                                    "level": 3,
                                    "comment": "Would she use her previous top notch legal reason that she applied to appointing the special master order that was overturned and vacated, which was \"what's the harm\"?\n\nBut seriously.\n\nIf she dismisses she would be reversed by judge prior on the eleventh circuit appeals court (which already reversed her twice).\n\nIf you want to know the most likely what ifs are, go to YouTube and search for Midas Touch or legal AF or Michael Popoff or Ben Misalas.",
                                    "score": 1,
                                    "author": "basketballsteven"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Anyone who thinks having a judge completely destroy the justice system over the most public court case in decades won't lead to a collapse of the government is delusional",
                    "score": 9,
                    "author": "netrunui"
                },
                {
                    "level": 1,
                    "comment": "The problem is if she doesn't recuse herself no matter which way she rules and no matter how she handles this case, it will not be viewed as impartial.  If she throws the book at Trump, then his defenders can claim that she was scared because of her previous experience of having rulings overturned.  If she continues with her behavior towards Trump it proves she gives him special treatment.  This case is not the case she should be celebrating getting. \n\nIf she were to recuse herself she could at least avoid these issues, but I honestly doubt she will.",
                    "score": 1,
                    "author": "Ferelwing"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Registering to vote for the next election is very easy.  Select your state  https://vote.gov and follow the instructions and help save our country by voting for Biden!  🇺🇸🕶️",
            "score": 14,
            "author": "Swimming-Delay-16"
        },
        {
            "level": 0,
            "comment": "Right now the biggest one is probably Judge Cannon. But there's also making sure the Jury is non-biased. \n\nWe'll see what happens. Everything seemed to be going perfectly until we began to hear the details behind how the trial will go down. Jack Smith seems confident, but as great of a track record he has, I'm not sure if he's dealt with people as detached from reality as MAGA. I fear he may overestimate his ability to sway them.",
            "score": 15,
            "author": "DonnyMox"
        },
        {
            "level": 0,
            "comment": "The judge that he appointed who tried to derail the investigation is a huge obstacle then of course you have the maga Floridians that’ll be on the jury. Registering to vote is very easy and voting has become more important than ever we can not stand by and let America be destroyed by these tyrants",
            "score": 4,
            "author": "CAM6913"
        },
        {
            "level": 0,
            "comment": "They’ll ask for a different judge",
            "score": 3,
            "author": "devnoid",
            "replies": [
                {
                    "level": 1,
                    "comment": "If they actually want a conviction they will. After mueller I’m going to need to see a bit more of a desire to lock the bastard up before I get too excited.",
                    "score": 6,
                    "author": "arch-angle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If they get a conviction can they then compel him to answer any and all other questions regarding his previous dealings?",
            "score": 9,
            "author": "SolarSalsa",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s what they typically do to spies. Once they get a conviction, they negotiate life in prison as opposed to the death penalty. In exchange they get a full accounting of his dealings with foreign agents, the secrets he sold, his tradecraft, etc. Not the case here as Trump isn’t accused of getting anyone killed. But still, a man his age, 10 years in jail is a lot. 5 and he’ll sing I’m sure. Especially because the longer he lives, the longer the electorate will be motivated to keep people out who would pardon him. Hopefully this’ll be the longest lived effect from this case.",
                    "score": 17,
                    "author": "mrbeck1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s going to try to delay it until after 2024 and hope he wins or another Republican wins and pardon him",
                            "score": 9,
                            "author": "Pretend-Customer7945",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For a truely rigged election.",
                                    "score": 6,
                                    "author": "SolarSalsa"
                                },
                                {
                                    "level": 3,
                                    "comment": "He can try but as Jack Smith has implied, the People are entitled to speedy justice and he’ll fight for that.",
                                    "score": 2,
                                    "author": "mrbeck1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No.",
                    "score": 1,
                    "author": "Ornery-Ticket834"
                }
            ]
        },
        {
            "level": 0,
            "comment": "His cult\nHis sycophants \n“Both sides” people",
            "score": 8,
            "author": "docwho76"
        },
        {
            "level": 0,
            "comment": "There's one issue and it's always been the issue: the complete and total unwillingness to ever hold him accountable to anything he's ever done. Trump's crimes are so brazenly open and unquestionable that the only thing that's stopped his convictions is that the criminal justice system is full of corrupt scum and cowards who refuse to ever punish the rich.",
            "score": 8,
            "author": "NotMyBestMistake",
            "replies": [
                {
                    "level": 1,
                    "comment": "We could just put him away and make it an example that there are consequences. \n\nBut we won’t. And we’ll continue to ruin the country with more corruption.",
                    "score": 2,
                    "author": "tcoh1s"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope folks read this. It lays out the manner in which judge Cannon could torpedo the case and prevent it from being retried with no chance of appeal.",
            "score": 21,
            "author": "SomeCatsMoreCats",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate these articles because it’s highly unlikely these imposters would come up with this strategy on their own.",
                    "score": 23,
                    "author": "resjohnny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even if you think Trump and his lawyers are too stupid to come up with it, the people pulling his strings from behind the curtain are obviously not.\n\nThis very much looks like the judge is being set up to take the fall. The prosecution will put forth a strong case. Defense will do what it can. The judge will acquit Trump and everyone else will say 'we did what we could.'",
                            "score": 1,
                            "author": "ocdscale"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm not going to read something that's behind a paywall.  Does the article mention how prosecution will file a motion to disqualify her if she decides not to recuse herself?\n\nIt's called judicial disqualification.  Higher courts aren't going to allow her to be the judge for this case.",
                    "score": 13,
                    "author": "CrudeNewDude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I keep reading her disqualification is no sure thing.",
                            "score": 9,
                            "author": "copyboy1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cannon outed herself as a MAGA moron during the investigation phase. She can no longer help our boy Donnie. Either she recuses, or she'll be recused.",
                                    "score": 16,
                                    "author": "No-Menu-2524",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I highly doubt she recuses. And I thought it was a sure thing she'd be recused. But the experts I'm reading keep saying it's no sure thing.",
                                            "score": 10,
                                            "author": "copyboy1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well, we know that the supreme court is not actually bound to any ethics and they can do whatever they want for anyone for the right amount of money or free vacations.",
                                                    "score": 7,
                                                    "author": "clintCamp"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They will probably try the case in front of her.",
                                                    "score": 1,
                                                    "author": "Ornery-Ticket834"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I'm not going to read something that's behind a paywall. \n\nThis is why journalism is in the state that it's in.  If you want good investigative journalism, then the professionals who do the research and writing need to be able to pay their bills.  If people don't want to pay for it, then they need to use advertising.  If advertisers are paying for your news, then the articles get more click-baity, lower quality and advertiser friendly.  You are either the customer, or the product.  If you ain't payin', you're the product.",
                            "score": 15,
                            "author": "hikealot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 2,
                                    "author": "monthoftheman"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm not going to subscribe to The Atlantic when sources like the Associated Press are free.",
                                    "score": 4,
                                    "author": "CrudeNewDude"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Does the article mention how prosecution will file a motion to disqualify her if she decides not to recuse herself?\n\nI dunno, I didn't read it.",
                            "score": -6,
                            "author": "SomeCatsMoreCats"
                        },
                        {
                            "level": 2,
                            "comment": "People keep saying this. If they were going to do that, surely they would have by now.",
                            "score": 0,
                            "author": "DonnyMox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not necessarily, they will probably wait until she makes the first move and then file it. Id imagine they would win that motion given the recent history with the judge but idk what that process entails",
                                    "score": 4,
                                    "author": "Hamwise420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Problem is, her first move might be to torpedo the case and prevent it from being retried with no chance of appeal. And then, of course, it would be too late.",
                                            "score": 4,
                                            "author": "DonnyMox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "she cant do that right away, there is still jury selection and pretrial motions to go through before they bring in the jury, and dismissing it before the jury is seated will not apply double jeopardy afaik",
                                                    "score": 5,
                                                    "author": "Hamwise420"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "She is flatly unable to do that.",
                                                    "score": 1,
                                                    "author": "Ornery-Ticket834"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They probably won’t. They are stuck with her.",
                            "score": 1,
                            "author": "Ornery-Ticket834",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You base that off of your years of experience in the appellate courts?",
                                    "score": 1,
                                    "author": "CrudeNewDude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I base it on my legal understanding of the law. Just so you understand you can go read the statute yourself. If you think a judge making what are seen as favorable rulings for a party is grounds for removal or recusal , you are simply mistaken. Nor is the fact her rulings were reversed make any difference. Also rarely does a motion like that get appealed. But even more likely is that the DOJ will not bother asking to disqualify her. That would just give him more time to delay and scream, and look bad in general. I don’t do appellate law and as I stated I don’t even believe an appeals court would remove her. I am an attorney so I have some understanding of the mechanics of the situation. Let’s see what happens. I bet they don’t even try and disqualify her. That will give Trump one more thing to scream about.",
                                            "score": 1,
                                            "author": "Ornery-Ticket834"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Smith has the option to point to her previous bias and force her to be removed from the case.  In this instance he can argue that she is not an unbiased judge when it comes to this particular case due to her previous preferential treatment that led to two of her rulings being overruled on Appeal.  Smith is savvy enough I think he can and will get her removed from the case.",
                    "score": 2,
                    "author": "Ferelwing"
                },
                {
                    "level": 1,
                    "comment": "It the bind a pay wall with ads to boot. Not buying a subscription for a newspaper with ads.",
                    "score": 2,
                    "author": "HonoredPeople"
                },
                {
                    "level": 1,
                    "comment": "Paywall with ads.",
                    "score": 2,
                    "author": "HonoredPeople"
                },
                {
                    "level": 1,
                    "comment": "I’m counting on the rule of law being more powerful than Cannon, plus, downvote me if you want, but I don’t believe she is crooked",
                    "score": -27,
                    "author": "KaraAnneBlack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"I don’t believe she is crooked\"\n\nBro she literally ruled in Trump's favor last year in a situation where doing so went completely against all established law and outright admitted that it went against all established law but that she didn't care.",
                            "score": 16,
                            "author": "DonnyMox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She also granted injunctive relief *Trump’s lawyers hadn’t even asked for* in a move so bizarre it beggars belief.\n\nShe was acting in a manner consistent with being his lawyer but was the judge.",
                                    "score": 14,
                                    "author": "llahlahkje"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As you wish",
                            "score": 4,
                            "author": "Positive_Prompt_3171",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I second this. May your wishes always come true.",
                                    "score": 3,
                                    "author": "PeachesPeachesPeachs"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'd have agreed with you had she not gone above and beyond what Trump's own lawyers asked for in one of her rulings.  Because she did however, I doubt her ability to be impartial.",
                            "score": 1,
                            "author": "Ferelwing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just think she is inept. Hopefully she will be more careful this time.",
                                    "score": 1,
                                    "author": "KaraAnneBlack",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She went above and beyond on a case that she recognized within her filing that she didn't really have standing in.  \n\nBeing inept is a possibility but adding to the likelihood of bias is her having been appointed by Trump, then her taking jurisdiction over a case she didn't actually have any jurisdiction over, then her giving Trump's lawyers things that were not asked for as remedies within their filing, and having all of her rulings as concerned with Trump overruled and vacated upon appeal.\n\nWhen it comes to judges she can prove best that she was inept by choosing to recuse herself from the case by pointing to how any ruling from her could be looked at as biased.  If she throws the book at Trump, then it could be argued by Trump's legal team that she was overreacting because her previous ruling was overruled by the Court of Appeals.  If she gives him a light sentence then it can be argued she's continuing to \"help\" him.  There is no way she comes out of this situation looking impartial.",
                                            "score": 1,
                                            "author": "Ferelwing"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How could you possibly come to that conclusion after seeing her rulings over *this exact same case*?\n\nShe was so brazenly biased, even the uber-conservative appeals court had to publicly smack her down.",
                            "score": 1,
                            "author": "tlsr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There should be zero obstacles. If there are zero obstacles to put people in jail for small things, there should be zero obstacles for putting the entire country at risk. Unreal. No one should be above the law. I don’t care what position or party.",
            "score": 3,
            "author": "tcoh1s"
        },
        {
            "level": 0,
            "comment": "Another take I've read is that Smith knows that if he filed anywhere but Florida, Trump would file for a change of venue on the basis that it happened in Florida and everyone involved is in Florida. She he might reasonably get it. But that process will delay everything and if he delays enough, he could get elected and pardon himself.\n\nHe must feel like the evidence is strong enough that he can't lose no matter the judge.",
            "score": 4,
            "author": "KevinAnniPadda",
            "replies": [
                {
                    "level": 1,
                    "comment": "Having \"strong enough\" evidence would imply that she cares in any way about the evidence, which she very VERY clearly doesn't. There's absolutely nothing that could be presented that wouldn't result in her torpedoing the trial.",
                    "score": 6,
                    "author": "SpectralMalcontent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How is she still in the bench after the last time she obviously sold out her country?",
                            "score": 3,
                            "author": "arch-angle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not sure, but I know impeachment or anything taking her out of the picture would require at least some House Republicans to sign off on it, which is not happening. She has a lifetime appointment. There's very little recourse in actually disciplining her, so the DOJ would have to watch her like a hawk and appeal the second she does anything out of line. If they don't act fast enough, she will let Trump walk.",
                                    "score": 1,
                                    "author": "SpectralMalcontent",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Obviously not a lawyer but it seems like she is pretty guilty of trying to obstruct justice..",
                                            "score": 3,
                                            "author": "arch-angle"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lifetime appointment.",
                                    "score": 0,
                                    "author": "aJoshster"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is there not a second grand jury investigating the crimes that allegedly took place in DC, that could soon issue its own indictments?\n\nI think the FL investigation just matured first and there was so much evidence of the crimes committed there from MAL security cams, staff, one of Trump's lawyers, etc.  And that a DC trial could be prone to delay/seeking a change of venue.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nAs for evidence.... some of it is coming from one of Trump's former attorney's.  He's been exempted from attorney-client privilege because Trump used legal counsel to continue perpetrating crimes of holding onto the documents/obstructing.  A ruling against that as admissible evidence could be a setback, but there's a lot of other evidence, and the higher court would probably have cause to strike it down.",
                    "score": 1,
                    "author": "arkaine23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Could someone boiler plate this please and thank you.",
            "score": 5,
            "author": "HonoredPeople",
            "replies": [
                {
                    "level": 1,
                    "comment": "The judge and her known/demonstrated pro-trump bias; potential (probable?) misuse of broad judicial powers.\n\nJuror selection/voir dire; \"the jury pool from which the jurors will be drawn, will also be challenging.\"\n\nJury nullification; \"the possibility that an adamant pro-Trump supporter will be seated on the jury with the committed mission of refusing to convict Trump, against all the evidence.\"",
                    "score": 17,
                    "author": "Critical_Aspect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "some of what I read involved the need for those with security clearances, so that would further limit the jury pool.  Assuming the need for clearances is correct that is.",
                            "score": 3,
                            "author": "Ferelwing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Any attempt to seat a jury with security clearances only is facially unconstitutional.",
                                    "score": 1,
                                    "author": "Ornery-Ticket834",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's an interesting question though.",
                                            "score": 1,
                                            "author": "Ferelwing"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Doing the lords work - thank you!!!!",
                            "score": 2,
                            "author": "reyiativas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're welcome!",
                                    "score": 1,
                                    "author": "Critical_Aspect"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "His mouth, his lawyers, and the fact we are too big of a pussy to deal with him.",
            "score": 5,
            "author": "Redditanother",
            "replies": [
                {
                    "level": 1,
                    "comment": "His lawyers? He has shit lawyers. Look at the case Trump's lawyers put on against E. Jean Carroll, their expert witness in that case called in sick the day of and so they didn't present a single defense witness in that case, or in defense of the Trump ORG. CFO Alan Wiselberg (17 felony convictions) same subset of lawyers he has now, they hired a top Florida lawyer Chris Kise (solicitor general of Florida) and he made recommendation on this document case that Trump argue it was all a big mistake but Trump wanted to argue he had every right the docs belong to him and so that guy was out.\n\nTrump is acting as his own lawyer and the lawyers are writing legal briefs that include Trump's nonsense I'm a victim screed. Have you read the motions they file on his behalf in various cases, they are a legal joke?\n\nHis lawyers are terrible.",
                    "score": 6,
                    "author": "basketballsteven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He should be in jail 10x over by now. His lawyers aren’t too shabby.",
                            "score": 3,
                            "author": "Redditanother",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He just keeps filing and throwing whatever he can at them.  Habba got hit with a massive fine.  Most of his lawyers haven't even been paid.\n\nThe reason he's not been in jail boils down to the prosecution getting tired of dealing with him and just giving him a fine rather than dealing with his endless filings.  Trump has taken advantage of the legal system for years by constantly putting out frivolous lawsuits.  What's surprising is that he can find any law firm to represent him at all with his track record of refusing to pay them.",
                                    "score": 3,
                                    "author": "Ferelwing"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just do not see the case can be wrapped up in 2 years. If Trump’s team is of any competence, they can easily exploit the legal system to keep delaying the trial of the case. In the meanwhile Trump will try to get elected such that he can pardon himself.",
            "score": 2,
            "author": "Changeup2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty sure self-pardon should be denied as unconstitutional, because then presidents could essentially be the judge in their own trial.  They'd be able to insulate themselves from crimes they committed while in office.  It'd be a step in a very dangerous/authoritarian direction.  And who would be the check on that being possible?  The Supreme Court?  F\\*ck.",
                    "score": 2,
                    "author": "arkaine23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it probably will go to the Supreme Court and that does not look good.",
                            "score": 1,
                            "author": "Changeup2020"
                        },
                        {
                            "level": 2,
                            "comment": "He wouldn’t pardon himself. If there was no conviction at the time the Attorney General’s would simply dismiss the case.",
                            "score": 1,
                            "author": "Ornery-Ticket834"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The trial must happen within 100 days (the law) and will only take 21 days according to the prosecution",
                    "score": 1,
                    "author": "TransportationAway59",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Speedy trial can, and is, waived all the time and it almost assuredly will be. That’s why the Rhodes seditious conspiracy case took nearly a year to get to trial even which him in custody.\n\n I’d be very surprised if a case of this magnitude makes it to trial w/in 2 years.",
                            "score": 1,
                            "author": "Generalbuttnaked69"
                        },
                        {
                            "level": 2,
                            "comment": "180 and with a shitload of exceptions.",
                            "score": 1,
                            "author": "Ornery-Ticket834",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Speedy trial act is 100 days. And while there are often exceptions made, when it comes to a defendant who is believed to be an active national security threat I believe there are far less exceptions to be had.",
                                    "score": 1,
                                    "author": "TransportationAway59",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You are correct it is 100 days. Our state has a 180 day rule. It’s unlikely Canon will view him as an active national security threat,if she hasn’t already.",
                                            "score": 1,
                                            "author": "Ornery-Ticket834"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. He’s rich.\n2. He’s white.\n3. He’s a republican politician.",
            "score": 2,
            "author": "familyparka"
        },
        {
            "level": 0,
            "comment": "Oh great here come the escape routes. I doubt he’ll ever  be held accountable for anything.",
            "score": 3,
            "author": "Lazy_Squash_8423",
            "replies": [
                {
                    "level": 1,
                    "comment": "My husband agrees with you - I still have hope.",
                    "score": 4,
                    "author": "Yelloeisok"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Paywall. So probably no one here has read the article, but will still have plenty to say about the headline.",
            "score": -5,
            "author": "SnapedDoctorStrange",
            "replies": [
                {
                    "level": 1,
                    "comment": "Without reading it, my.biggest three would be (1) judge, (2) jury, (3) lawyers.\n\nPerhaps (4), the media.",
                    "score": 4,
                    "author": "HonoredPeople",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, close. It is judge, judge, judge. If you come back article is now top comment.",
                            "score": 4,
                            "author": "Skooma_Lite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, it's judge, jury pool, and nullification",
                                    "score": 3,
                                    "author": "_JJMcA_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. MAGA judge\n\n2. MAGA jury\n\n3. He flees to Russia",
            "score": 1,
            "author": "tlsr"
        },
        {
            "level": 0,
            "comment": "The amount of legal nonsense in this thread is astounding. In fact, these articles and many of these replies are as harmful to the justice system as the things they are warning about.",
            "score": 1,
            "author": "tr0pix"
        },
        {
            "level": 0,
            "comment": "Its not the charges, the evidence or even the judge....\n\nOur biggest concern is a sleeper getting onto the jury.....\n\nSays all the right things during selection while having every intent of freeing Trump ...\n\nThe GOP will go bonkers thinking this is payback for OJ or something....",
            "score": 1,
            "author": "Therocknrolclown"
        },
        {
            "level": 0,
            "comment": "White people racism and money",
            "score": 1,
            "author": "f_elon"
        },
        {
            "level": 0,
            "comment": "Trump will not see the inside of a prison cell",
            "score": -5,
            "author": "screenedforfailure",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope your wrong",
                    "score": 2,
                    "author": "Sir_Agreeable"
                },
                {
                    "level": 1,
                    "comment": "That doesn't mean he won't be convicted.",
                    "score": 1,
                    "author": "PRpitohead"
                },
                {
                    "level": 1,
                    "comment": "Doesn’t mean he won’t be convicted.",
                    "score": 1,
                    "author": "Ornery-Ticket834"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The biggest obstacle is that this is a political witch hunt, and everyone with an ounce of intelligence can see that.",
            "score": -30,
            "author": "TripleDude",
            "replies": [
                {
                    "level": 1,
                    "comment": "Translation: I didn't read the indictment, I just let someone else tell me what to think.",
                    "score": 16,
                    "author": "ClusterFoxtrot"
                },
                {
                    "level": 1,
                    "comment": "Read the indictment and get back to me. If you still think it’s a witch hunt, your brain was melted by Fox and you’re beyond saving.",
                    "score": 11,
                    "author": "NiceTryModzz"
                },
                {
                    "level": 1,
                    "comment": "Sometimes the simple answer is the correct one. \n\nHe consciously took classified material out of the White House and stored it, unsecured, at his personal property, lied about it, showed some to individuals without clearance to whom he bragged about having it, his some from investigators, attempted to destroy evidence by flooding an electronic storage facility with pool water, and continues to deny he did anything wrong. \n\nOh, and he packed the boxes with these classified materials himself and ordered them to be delivered to his property. \n\nHe no longer has the clearance to view these documents, never mind possess them. \n\nThe simple answer is that this is not about politics, but about crimes committed against the nation. Against you. \n\nNot unlike the hundreds of millions of your tax dollars that he laundered through his properties while president.",
                    "score": 10,
                    "author": "fluffybottom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You forgot at least one is missing  - maybe the one the Saudi’s bought for $2Billion and paid to Kushner under the guise of a made up ‘service’.",
                            "score": 3,
                            "author": "Yelloeisok",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That one for me is the most troubling.  Especially because Saudi Arabia and Iran started talking all of a sudden recently.  Previously, I'd just assumed it was because of protests etc but given what we learned from the indictment it makes me very uncomfortable.",
                                    "score": 5,
                                    "author": "Ferelwing"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, no.  Read the indictment. (Everyone who plans to vote should read the indictment.)",
                    "score": 8,
                    "author": "keyjan"
                },
                {
                    "level": 1,
                    "comment": "Hard to call this a witch hunt when he lied about having classified material, they found it at MaL, and he admitted on audio to possessing more classified material.",
                    "score": 6,
                    "author": "mckeitherson"
                },
                {
                    "level": 1,
                    "comment": "Yes, Trump didn’t do anything wrong because he said he didn’t do anything wrong therefore he is innocent. Always believe whatever an accused person tells you because they would never lie about doing a crime!",
                    "score": 5,
                    "author": "Just-a-Mandrew"
                },
                {
                    "level": 1,
                    "comment": "So that means you didn't read the indictment then and have no idea what sorts of top secret information he took with him, where he stored it and most importantly how he moved it to prevent the US government from retaking control over it.\n\nEdited to add: It mentioned nuclear secrets, many of the various plans the US Department of Defence had in case of an attack on US soil.  The strengths and weaknesses of the US defenses.  The strengths and weaknesses of our allies.   Please take the time to read the indictment.",
                    "score": 4,
                    "author": "Ferelwing"
                },
                {
                    "level": 1,
                    "comment": "Which of the charges do you disagree with? These crimes are completely obvious based on undeniable facts, unless you think Biden snuck into trumps tacky palace to plant the hundreds of boxes of classified material? \n\nIf you think this is not valid, wait for the charges about election interference in Georgia - that’s all on tape.",
                    "score": 3,
                    "author": "arch-angle"
                },
                {
                    "level": 1,
                    "comment": "Well, people that have ONLY an oz perhaps",
                    "score": 5,
                    "author": "No-Amoeba-7217",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes I think you've pointed out the problem that this person thinks it only takes an oz and that's probably about what they have, which in order to function they probably have to let Fox do their thinking for them.",
                            "score": 3,
                            "author": "basketballsteven"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh, the irony",
                    "score": 1,
                    "author": "Simple_Opossum"
                }
            ]
        }
    ]
}