{
    "id": "147par5",
    "score": 1044,
    "title": "Angry Taylor Swift fans push lawmakers to take on Ticketmaster",
    "author": "Ajkrouse",
    "date": 1686579585.0,
    "url": "https://www.washingtonpost.com/business/2023/06/11/taylor-swift-ticketmaster-ticket-meltdown-bills/",
    "media_url": "https://www.washingtonpost.com/business/2023/06/11/taylor-swift-ticketmaster-ticket-meltdown-bills/",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I just bought 20 dollar tickets for a show with ten dollars in fees fuck ticket master.",
            "score": 135,
            "author": "GottaKeepGoGoGoing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Buddy of mine was quoted 95 dollars for ONE ticket online...this venue has a box office still where you can buy tickets in person (shit hours tho) and he bought 2 tickets to the same concert for 60 dollars including tax. \n\nUnbelievable.",
                    "score": 54,
                    "author": "bizarrebinx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish I could do that my venue only sells through ticket master",
                            "score": 18,
                            "author": "GottaKeepGoGoGoing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My local venue has started charging Ticketmaster service fees in person at the box office now.",
                                    "score": 22,
                                    "author": "ihatebroccotots",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probably because they are contractually obligated with Ticketmaster to do so. It’s outrageous thinking about paying for a service you’re not even using to get tickets from a physical person at a counter in front of you. But yes please charge me $70 in fees, Daddy Ticketmaster.",
                                            "score": 16,
                                            "author": "rzalexander",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s wild because they’ve always been a live nation/Ticketmaster venue, but they just started charging the in person fees this year. Same with another venue down town, ticket master won’t allow them to print tickets anymore. So even if you purchase them at the window, you only have access to a digital copy sent via text message.",
                                                    "score": 6,
                                                    "author": "ihatebroccotots",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah that all reeks of Ticketmaster contract terms. These venues are getting fucked because it’s either go with Ticketmaster, or become an indie venue exclusively.",
                                                            "score": 4,
                                                            "author": "rzalexander",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They are the most blatant example, besides Amazon, of a company that needs to be regulated under anti-trust laws. I'm sure there's some legal mumbo jumbo for why it has not happened, but it is a very clear monopoly. In both cases.",
                                                                    "score": 5,
                                                                    "author": "bizarrebinx"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Robert Smith (of The Cure) did a great job in pushing back on Ticketmaster when they pulled that shit for their current US tour. While a $5-10 refund per ticket isn't much to the individual purchaser, altogether it was *millions* they had to refund.\n\nEdit to add band Robert Smith is in, just in case some people don't know.",
                    "score": 15,
                    "author": "NnyIsSpooky"
                },
                {
                    "level": 1,
                    "comment": "I bought a ticket to a show for $6 recently (still unsure why it was so cheap since a friend paid over $100 for the same show), the fees were $8.",
                    "score": 4,
                    "author": "ImA13x"
                },
                {
                    "level": 1,
                    "comment": "But who is giving Ticketmaster the right to sell in the first place? Fuck them.",
                    "score": 4,
                    "author": "TopCheesecakeGirl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dear Taylor,\n\nPlease tell your fans that they all need to vote in every election.",
            "score": 157,
            "author": "VaguelyArtistic",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe she already cuts pro democrat ads during election seasons",
                    "score": 37,
                    "author": "Savior1301",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope, only a couple.",
                            "score": 11,
                            "author": "Sleepybat7"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She does!",
                    "score": 5,
                    "author": "assflea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "1990s Pearl Jam has entered the chat\n\nhttps://www.rollingstone.com/music/music-news/pearl-jam-taking-on-ticketmaster-67440/\n\nIn 1991, Ticketmaster bought out its main competitor at the time called Ticketron. Then by taking out exclusive ticketing contracts with the majority of major venues, Ticketmaster had basically cornered the ticketing market in the United States by 1993. As Pearl Jam would soon prove, if you refused to work with the company or the venues they had exclusive ticketing deals with, you were basically dead in the water.\n\nIn an attempt to circumvent Ticketmaster, Pearl Jam tried to set up its own tour by utilizing outdoors spaces where Ticketmaster had no jurisdiction. They also tried to set up certain concerts as benefits since the Ticketmaster contracts with certain venues allowed charities and non-profits to do their own ticketing. Despite the band’s best efforts, the tour became a logistical nightmare. Eventually, Pearl Jam canceled the tour “in protest,” but in truth, it became impossible to pull off at the level that Pearl Jam was at without working with Ticketmaster, which according to the band, proved Ticketmaster was truly a monopoly.\n\nDespite the Vs. tour being a disaster, the situation significantly helped raise awareness about the issue. Investigative journalist Chuck Philips continued to stay on the story, and was able to obtain copies of the contracts venues were forced to sign with Ticketmaster, and a legal monograph was drafted that concluded, “The pervasiveness of Ticketmaster’s exclusive agreements, coupled with their excessive duration and the manner in which they are procured, supported a finding that Ticketmaster had engaged in anticompetitive conduct under section 2 of the Sherman Act.”\n\nMost notably, a United States House of Representatives subcommittee opened an investigation, and on June 30th, 1994, Pearl Jam guitarist Stone Gossard and bassist Jeff Ament came to Capitol Hill to testify in front of the committee. It caused quite a stir in both the national news, as well as entertainment news when two grunge rockers dressed in grunge attire appeared before Congress, giggling initially as they were sworn in by the subcommittee.\n\n\n\nhttps://www.savingcountrymusic.com/mad-at-ticketmaster-pearl-jam-has-you-beat-by-28-years/",
            "score": 91,
            "author": "mynamesyow19",
            "replies": [
                {
                    "level": 1,
                    "comment": "2022-2023 Pearl Jam fully embraces dynamic pricing to maximize revenue.\n\n\nI'm just dying for a full senate investigation, including hearings that lay bare all the juicy contract details to show how heavily complicit the artists are with the high ticket prices.\n\nHell, Bruce Springsteen straight-up told his fans he was cashing in on this tour and they *still* believed it's all on Ticketmaster. \n\nThat being said, the Ticketmaster/LiveNation merger needs to be undone.",
                    "score": 18,
                    "author": "Iz-kan-reddit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We need Trust Busting again. Any single business that has more than 50% dominance in any given service or good should be broken up.",
            "score": 17,
            "author": "BlitzkriegOmega",
            "replies": [
                {
                    "level": 1,
                    "comment": "We would see a lot of oligopolies broken up…don’t tempt me with a good time",
                    "score": 1,
                    "author": "Ajkrouse"
                },
                {
                    "level": 1,
                    "comment": "I agree but they should start with tech. Meta, google, apple and Amazon need to be smashed to pieces",
                    "score": 1,
                    "author": "DanMarinoTambourineo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ticketmaster is symbolic for the entire economy right now. Student loans, mortgages, rent, etc. one asshole institution after another grifting and robbing working people to enrich themselves.",
            "score": 14,
            "author": "IndIka123"
        },
        {
            "level": 0,
            "comment": "While my thoughts towards Taylor Swift herself are neutral, I wholly support her fans in this endeavor.",
            "score": 44,
            "author": "supes1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a bit anti-Swift on this, just because all she needs to do is print 'Not to be resold by ticketmaster' and immediately the Ticketmaster situation would be 100% sorted.  But she won't, because she likes the money.\n\n\nHINT:  Her appearance fee is MORE than the price of all tickets face value and the merch/beer sales.  How can this possibly be, I hear you ask :)",
                    "score": 7,
                    "author": "britboy4321",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a Taylor Swift fan/eras tour attendee I gotta say I don’t understand why she allowed resale. Her tickets at face value were very reasonable considering the scope of the show and I don’t think she’s making more money on the ridiculous resale tickets so what is the benefit to not change it..?",
                            "score": 12,
                            "author": "assflea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the problem is if artists do that, it opens up issues. Let's say Joey wanted to go to Eras however Joey gets called into work and despite having the off day in the calendar, Joey is told \"Show up or never show up to work again.\" Now let's say the job market is tighter than it is right now, Joey may have to resell the ticket, find someone to give it too, or be fired with no guarantee of a job.\n\nNote, I am not condoning the Ticketmaster or other ticket broker fees, but I will say that I think artists not allowing resale may hurt would be concert goers just as much as allowing them.",
                                    "score": 2,
                                    "author": "reallymkpunk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True, no resale over face value is really what we want.",
                                            "score": 3,
                                            "author": "assflea"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yea she is making more money.\n\nBasically, as an example\n\n1)  Put face price at $50\n\n2)  Sell 80%, per show, to ticket master  for $120 each (they have $50 printed on them) - on the understanding they will sell them for $150.  Ticketmaster signs NDA regarding price they paid.\n\n3)  Take the $120, pretend to your fans your fucking outraged at ticketmaster therefore keeping your fans onside, rake in the $120 per ticket - profit.\n\n\n\nbasically ticketmaster is happy to be the bad-man when artists need one, to extract maximum $$ from fans.",
                                    "score": 1,
                                    "author": "britboy4321",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What does that have to do with the resale ticket prices though? My understanding has been that artists don’t make any more money on the resale tickets - Ticketmaster double dips on fees so maybe she’s benefitting in that way, but if someone purchases a ticket for $200 and then resells it for $1000, they’re profiting $800 minus whatever the fees are. That’s not Taylor Swift making an extra $800 on that ticket so I don’t understand what the benefit is for an artist to allow resale like that. \n\nI’m not defending Taylor Swift here, I heard Ed Sheeran and other artists don’t allow their tickets to be resold higher than face value and if they can do it, she can do it. I just think we’re talking about different things here.",
                                            "score": 6,
                                            "author": "assflea",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think the point they are trying to make is that ticket master is buying the first round of tickets inflated and then selling them secondhand",
                                                    "score": 4,
                                                    "author": "joedirtfan01"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The artists are given big blocks of tickets to their own shows. They put those tickets on sale through the reseller market.",
                                                    "score": 2,
                                                    "author": "kiltguy2112"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ticketmaster is a bullet sponge for these artists by design and they know it, it’s why they promote the Live Nation brand - the artists 100% know the score but Ticketmaster helps them maximize their profits. Taylor Swift is full of shit.",
                                            "score": 1,
                                            "author": "mulls"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In some states it doesn’t matter what the artist wants - resale and transfer can’t be banned in those states.",
                            "score": 2,
                            "author": "codinginacrown"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meanwhile, Robert Smith of the The Cure is like “hold my beer”",
            "score": 43,
            "author": "Furcheezi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was so happy to see them last week. My only complaint is that my seats were fairly crappy because the Ticketmaster “Verified Fan” bs put me at the bottom of the list despite signing up to everything the second it was available, having zero resales in my history, and following the band on the site for years. By the time my slot was open, more than half the arena was on resale sites at 200%+ cost and the site kept timing out. Then I tried getting Guns n Roses tickets last week and it kept telling me I was a bot. When they finally let me on 20 mins later, there was barely any original tickets left and tons were already on official Ticketmaster resale. I’d rather take time off work to sit in line than deal with this crap. There’s got to be SOMETHING they could do.",
                    "score": 14,
                    "author": "Hellogiraffe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ticket master profits off resales , they are incentivized to do nothing.  System is working as designed.",
                            "score": 18,
                            "author": "Savior1301",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A couple years ago I bought NFL tickets through Ticketmaster. For a $120 ticket I paid about $30 in fees. \n\nThen I couldn’t go to the game, and resold then through Ticketmaster. Again, I had to pay them about $30 in fees per ticket to sell them. And the person who bought them also had to pay about $30 per ticket in fees. \n\nSo for a $120 ticket, they ended up getting $90+ in fees. It’s insane.",
                                    "score": 17,
                                    "author": "02K30C1"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe we should go back to physical lines for things.  I don't see a way out with AI coming down the pipeline.  Tech is just making this stuff too easy.",
                            "score": 4,
                            "author": "boops_the_snoots"
                        },
                        {
                            "level": 2,
                            "comment": "Ticket master is only part of the problem, companies make millions pulling tickets with the sole purpose of reselling at markup",
                            "score": 1,
                            "author": "Ambitiousshank"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck Swifties. No one can defeat Ticketmaster.",
            "score": 18,
            "author": "ispeektroof",
            "replies": [
                {
                    "level": 1,
                    "comment": "If she doesn’t come out and take a hard stance against ticket master themselves, no change will come. \n\nartists need ticket master in the end. so they have to be a level of complacent.",
                    "score": 14,
                    "author": "Stuck_at_Work_Till_5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Artists abide Ticketmaster only because they have no choice. We would all be better off without their greedy monopoly. Ticketmaster needs artists, not the other way around.",
                            "score": 3,
                            "author": "BruceBanning",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Ticketmaster needs artists, not the other way around.\n\nYes but ticketmaster doesn't need any specific artist because there are hundreds of thousands of acts releasing new music and touring each year and many do not care whatsoever about what it costs their fans to go to their shows as long as they can keep making money performing.  It would take a massive coalition of top-earning artists to topple the ticketmaster monopoly on the open market and they'd also need the next generation of hot up-and-coming artists on board or else ticketmaster just says \"ok then just retire and we'll work with your replacements\".\n\nThe government could finally break them up... but politicians care next to nothing about this issue with only a few exceptions and mostly for twitter clout not anything actionable.",
                                    "score": 3,
                                    "author": "geoffbowman",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Taylor actually has the clout and following to make a difference here, and she has done it a couple of times before. As a small artist, she has helped ME get paid in the past. I really don’t care about her music, but she is clever and I love the way she wields her power. She is likely the top artist in the game revenue-wise (and gaining) so she stands a chance.",
                                            "score": 5,
                                            "author": "BruceBanning",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is what makes me a bit frustrated with Taylor. I’m already not really a fan. But she comes out against it and then does..\n\n…nothing? \n\nBecause she is gaining just as much with the system in place. Girl could rock their world by removing any Ticketmaster venues and doing things so dramatically different they have to listen. But naw. Same ole game I suppose.",
                                                    "score": 0,
                                                    "author": "gmasterson",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I am a huge fan (who can't go to her concerts this weekend because I don't have $1300 in spare change), and I think this is a big character flaw of hers. She's basically a real-life Liz Lemon when it comes to political engagement.",
                                                            "score": -1,
                                                            "author": "reggiecide"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is absolutely ridiculous for me to pay … get this….$411 for 2 Ringo tickets that were originally $55 each. I hate that they Jack up with fees and more than doubled the price $139 each. It is criminal and you can’t even get a printed ticket anymore. I miss where you went to the box office and got your tickets no fees. Ticketmaster and other sites are making more than the artists",
            "score": 5,
            "author": "antsinmypants3"
        },
        {
            "level": 0,
            "comment": "If anyone can overcome the bloated Ticket Bastard, it’s the Swifties. God speed. Take no prisoner.",
            "score": 14,
            "author": "SockFullOfNickles"
        },
        {
            "level": 0,
            "comment": "Who would've thought the swifties would be our saviours?",
            "score": 5,
            "author": "turd_star"
        },
        {
            "level": 0,
            "comment": "Link that skips the paywall? I'd like to not put in my email address to Washington Post, even if Redditors get free articles",
            "score": 3,
            "author": "wonderwall999"
        },
        {
            "level": 0,
            "comment": "Can the Washington post rag be permanently banned with its obnoxious paywall? Can it be used to line the bottom of birdcages? Can it be toilet paper?",
            "score": 4,
            "author": "BachthovenIB"
        },
        {
            "level": 0,
            "comment": "I like that they are pushing for this but I would like to point out that Taylor Swift fans are always angry.",
            "score": 7,
            "author": "RockChalk2024"
        },
        {
            "level": 0,
            "comment": "I bought tickets for a band called Cannons. Purchasing directly from the venue was like $28 + $5 fee. Ticketmaster was charging $58 before fees.",
            "score": 2,
            "author": "Zerostar39"
        },
        {
            "level": 0,
            "comment": "She should just sell tickets to her events herself. Buy the tickets at the door. That’s how it was when I first attended concerts 84 yrs ago. And her songs are hers too. WTF?!",
            "score": 2,
            "author": "TopCheesecakeGirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s not an option for her - the stadiums she’s performing in have contracts with ticketmaster and if it was a first come first served situation buying tickets at the door it would be utter chaos. She had over 20k people show up in Philadelphia just to listen outside the stadium. Something like 14 million people signed up for presale codes for this tour.",
                    "score": 4,
                    "author": "assflea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She could say \"no resale\" for all her tickets - she chooses not too, because she also gets a cut from ticket master",
                            "score": -3,
                            "author": "hexiron",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course she could say no resale - that’s not what I was responding to. She does in fact have to go through Ticketmaster because she’s too big to play anything but stadiums, and they are all contracted with Ticketmaster. Resale is avoidable, Ticketmaster is not.",
                                    "score": 2,
                                    "author": "assflea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Resale is the bigger issue than fees. Get resale under control and the fees will become an easier target",
                                            "score": 2,
                                            "author": "Ambitiousshank",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The bigger problem is Ticketmaster (allegedly) using bots to self-enrich themselves through reselling or not blocking bots who tie up the line for the real fans and not resellers. Sure Taylor and other artists could block resales, but Ticketmaster is great at finding workarounds that screw their customers over in the end.",
                                                    "score": 3,
                                                    "author": "reallymkpunk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They are not running the bots themselves(from what I understand) but certainly aren’t trying very hard to stop the folks that are. They have no interest to do so, buying tickets from themselves does not generate revenue. They want as many tickets to sell as possible, if they sell multiple times all the better thus not putting in effort to stop the folks whose sole goal is to buy as many tickets as early as possible and then post for resale.",
                                                            "score": 1,
                                                            "author": "Ambitiousshank",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I do not believe they do not but the tickets aren't going to Ticketmaster but rather a shell company.",
                                                                    "score": 1,
                                                                    "author": "reallymkpunk"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Her fans are some of the most entitled, rude people in music. That said, anyone down to go after corporate ticket resellers is okay in my book.",
            "score": -6,
            "author": "Alternative-Gas270",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe online, as are most people who become passionately engrossed in their idol's affairs. That's like 95% of all huge fanbases. Myself, having attended the Eras Tour just two weeks ago and not even being a fan at the time, I found the atmosphere electric and extremely welcoming. Not a single altercation, just vibes. Even leaving the stadium was very chill and orderly. The only negative thing that happened was them overselling merch from the previous two nights and running out not even an hour into the start of the show.\n\nedit: Fuck Ticketmaster for what they let scalpers get away with and fuck scalpers. Resale tickets for pretty much any remotely popular artist are routinely going for 200%+ original ticket value and that's the *starting price.*",
                    "score": 19,
                    "author": "theyburnedmyfriend"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Taylor Swift fans when it comes to gun violence, violence against LGBTQ people, and insurrection: \\*silence\\*\n\nTaylor Swift fans when it comes to not being able to get concert tickets: WE DEMAND CHANGES! WE DEMAND LAWS BE PASSED!!",
            "score": -9,
            "author": "Detective-Signal",
            "replies": [
                {
                    "level": 1,
                    "comment": "What?\n\nSo if someone isn’t a social Justice advocate, they shouldn’t be allowed to advocate for any change whatsoever?",
                    "score": 13,
                    "author": "WakeNikis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She's doing this to ingratiate herself with her fans more - whilst ask her to stop selling the tickets to ticketmaster, and print on them 'not to be resold by ticketmaster' and she goes all quiet.\n\nHint:  She wants the money, she knows that people will pay $200 a ticket, she knows she has to pretend to be fair to her fans by printing '$20' on the ticket or people will stop liking her BUT SHE WANTS THE $200, so the difference in price is sorted by ticketmaster FOR HER - they're the bad guys FOR HER.  They take their cut, she takes hers, everyone laughs at the fans who think Taylor is not complicit.\n\nIt's a game.",
                            "score": -3,
                            "author": "britboy4321"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What makes you think that none of these people have been involved in other sorts of advocacy? If an individual wants to protest gun violence, they probably wouldn't do so under the banner of being a Taylor Swift fan, so you would have no idea.",
                    "score": 7,
                    "author": "RuhWalde",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "because the vast majority of swift fans are white women, and white women gave us trump.",
                            "score": 1,
                            "author": "Detective-Signal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re making assumptions based on nothing lol. The Swifties are a more liberal fan base than you think - Taylor Swift has same sex dancers on stage with her at the Eras tour and cast a trans man with visible top surgery scars as her love interest in a music video this year and her fans still pressure her to do more. She’s losing people lately because she started dating a dude who made racist comments on a podcast. The white women following Taylor Swift are not the white women who voted for Trump - those are the swifties’ mothers and grandmothers.",
                                    "score": 1,
                                    "author": "assflea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure. Whatever you say. All of that stuff Taylor has done regarding supporting queer people has been nothing but PR for her. She recently had to have immense backlash just to acknowledge the anti LGBT laws being passed around the country. And why is that? Because she didn’t want to turn off the base she has that she knows is filled with conservatives.",
                                            "score": 1,
                                            "author": "Detective-Signal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Seems like a weird PR choice to have same sex couples dancing on her stage right in the face of all her conservative fans though, doesn’t it? \n\nI don’t doubt she has conservatives in her fan base but they’re definitely not the majority. I just attended one of her concerts in a red state and it’s very clear where she stands on the issues - the freaks flipping out about the pride section in target would not have wanted to be there. \n\nYou can hate Taylor Swift if you want to but saying her fan base elected Trump is just not accurate.",
                                                    "score": 1,
                                                    "author": "assflea"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf is this paywalled bullshit asking for my Reddit email\n\nFuck this app",
            "score": 1,
            "author": "Dewy_Wanna_Go_There"
        },
        {
            "level": 0,
            "comment": "0 Fucks, I got a billion bucks \n\n- T Swift",
            "score": 0,
            "author": "HyruleJedi"
        },
        {
            "level": 0,
            "comment": "Wtf us taking so long already?! Break up Ticketmaster!",
            "score": 1,
            "author": "Dangerous_Molasses82",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like telecom, I sadly think big ticket sellers are \"too big to break up\" or if you do, they'll naturally comeback together. Look at Bell Systems for reference. You pretty much have Verizon, Quest (or whatever they are now) AT&amp;T as the new Ma Bells with maybe a local option like Cox in Arizona and Nevada.\n\nEdit: you may downvote my post if you don't like it, I'm just telling you how it is. Not if it is right or not (which it isn't.)",
                    "score": 1,
                    "author": "reallymkpunk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then you break them up too. Problem with the Bell breakup was there was no follow through. Nothing is too big to breakup.",
                            "score": 1,
                            "author": "Dangerous_Molasses82",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The problem was post-Reagan politics. Every president and Congress since the Bell system break-up has been pro business and pro monopoly. Microsoft want broken up over Internet Explorer versus Netscape in the 1990's.",
                                    "score": 2,
                                    "author": "reallymkpunk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And the oldies and sickies are saying young people can't make a difference. Mocking them, in fact.",
            "score": 1,
            "author": "thatissubpar"
        },
        {
            "level": 0,
            "comment": "There is no free market in event tickets",
            "score": 1,
            "author": "brucescott240"
        },
        {
            "level": 0,
            "comment": "Not happening because big business.",
            "score": 1,
            "author": "reallymkpunk"
        },
        {
            "level": 0,
            "comment": "*Phish fans have entered the chat*",
            "score": 1,
            "author": "LowEndLion"
        },
        {
            "level": 0,
            "comment": "i hate ticketmaster with every once of my soul. I am an idiot and didn't do verified fan for taylor tickets. Instead went through capitalone presale and got booted out of the line. Now I see verified fan sales going on for taylor tickets, today one is going on for 5 hours and I cant get in to buy a ticket. I'd even deal with their fees, as they are less then seatgeek, etc. But what the HELL, let some of us who are fans not bots get a god damn chance to buy a ticket. At this point, my head could explode.",
            "score": 1,
            "author": "WheelAcrobatic8797"
        },
        {
            "level": 0,
            "comment": "They should instead take their anti-psychotics",
            "score": -25,
            "author": "Kritt33"
        },
        {
            "level": 0,
            "comment": "They should instead take their anti-psychotics",
            "score": -23,
            "author": "Kritt33"
        },
        {
            "level": 0,
            "comment": "Ticketmaster is only a façade used by artists so they aren't hated and all the blames falls on Ticketmaster instead",
            "score": -1,
            "author": "Manofoneway221"
        },
        {
            "level": 0,
            "comment": "Support the artists by buying their stuff instead of paying to go to Ticketmaster venues?",
            "score": 0,
            "author": "podunkpropunk"
        },
        {
            "level": 0,
            "comment": "The haters gonna hate hate hate hate hate hate.",
            "score": 0,
            "author": "flambasted"
        },
        {
            "level": 0,
            "comment": "This is where Taylor Swift makes me cringe a bit. She has been vocal about this issue again. \n\nIf Taylor *really* wanted to make a change…she could force a stranglehold on Ticketmaster. Her Eras tour is enormous and she would have so much leverage to use.",
            "score": 0,
            "author": "gmasterson"
        },
        {
            "level": 0,
            "comment": "Finally, an issue worthy of government oversight, with the backing of the public. Gun violence… meh. Universal Medicare… nah. Domestic terrorism… pfft. Concert tickets… YESSSS!!!!",
            "score": 0,
            "author": "KingGidorah"
        }
    ]
}