{
    "id": "147tjcg",
    "score": 22094,
    "title": "‘This is war’: Police monitoring online far-right threats and pro-Trump protests with federal indictment",
    "author": "Beckles28nz",
    "date": 1686593303.0,
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-protests-indictment-florida-rally-b2356096.html",
    "media_url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-protests-indictment-florida-rally-b2356096.html",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Well a no fly zone has been established for the court house area tomorrow.",
            "score": 2728,
            "replies": [
                {
                    "level": 1,
                    "comment": "Pence needs a no fly zone",
                    "score": 2773,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I still have one of the fly swatters the Biden campaign started selling online that night.",
                            "score": 101,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Truth over Flies",
                                    "score": 37,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This will never get old!",
                            "score": 472,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;This will never get old!\n\nJust like the fly that died on Mike Pence's brittle, empty head that night.",
                                    "score": 238,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for reminding me about that.",
                            "score": 96,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m out of the loop? Mother would be most dissatisfied with me.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "His debate with Kamala Harris in 2020 featured a fly chilling in his hair.",
                                            "score": 35,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I watched his whole stupid town hall, hoping that fly would show back up for nothing!",
                            "score": 97,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " LOL, when that happened at that debate r/politicalhumor had to shutdown for a bit - there was only one mod on duty and there were hundreds of posts about it. Ah, those were the days...",
                                    "score": 70,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "/r/politics had a live thread during the debate.  The fly was there for minutes.  So there were thousands upon thousands of comments and jokes all rolling in.",
                                            "score": 57,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If YOU were that fly AND sat that long on Mike Pence’s head, would you come back?",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought it got stuck from the hairspray",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "closed-crotch trousers only, less salacious that way",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And the battle line has been drawn between the Walmart parking lot and the Target parking lot.",
                    "score": 893,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This weirdly makes sense",
                            "score": 451,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ikr? I fucking hate this timeline. \n\nThese bigot fucks got so blindsided by a black man becoming president that they’ve become this real life satirical political party. Nazis are OK, guns for toddlers, but think of the children. \n\nThere has to be evidence of a certain pizza parlor with a jr vip section in the files the russians obtained back when they hacked the RNC in like 2015-16. \n\nThey hacked both the DNC and RNC. Only released the data from the DNC hack. \n\nIts the only thing that makes sense on how conservatives torched their dignity for this embarrassment of a man. Its ~~bit~~ *not* like he was received well by republicans at first. \n\nThey’re embarrassments from the perspective of rational Americans. \n\nI wish i could just like, see the timeline where Hillary won in 2016 for even like 5 minutes.",
                                    "score": 554,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My favorite one is: teachers are groomers and can’t be trusted with books, also teachers should have guns,you know, to protect the children.",
                                            "score": 291,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They don't want *current* teachers to have guns.  Current teachers are liberal snowflake trans feminist union members with blue hair and master's degrees.  What they *really* want is to drive so many real teachers from the profession that unqualified parents, military veterans and church leaders can be brought in as \"emergency teachers.\"   *Those* are the teachers that will be carrying guns.",
                                                    "score": 79,
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Republicans are trash who have a bottomless fetish for violence, chaos, and cruelty. Is it any surprise that they think schools should just become prisons where the 'teachers' are just there to act as armed guards? \n\nThat said, based on a number of right-wingers I know, they're *also* tacitly pro-school-shootings because children are (a.) people who are not them and (b.) alive. Any disaster or tragedy is the only thing that can get these people fully erect because their nihilism/inhumanity is *total*. Even going back to the Las Vegas mass-shooting some years back, I remember talking with some asshole Republican whose best contribution about that was something along the lines of 'oh well. There's too many fuckin' people out there anyway...' Whether they can articulate it or not, I just feel like a lot of them want almost everyone in America to die, possibly including themselves (but of course, everyone else has to go *first*).",
                                                    "score": 101,
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "education = bad\n\nviolence = good\n\nthat's it, that's literally what people think.",
                                                    "score": 29
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Obama committed the unforgivable sin.  He came along with his eloquence, education, huge success, competence and a pretty wife.  He stole from them the lie that they're better than black people.  This is what made them lose their minds.",
                                            "score": 577,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "America elected the best black man, so they had to then elect the worst white man just to prove that they could.",
                                                    "score": 211,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well that's a bit of a stretch and very unfair to a former President. He was closer to orange.",
                                                            "score": 92,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;a pretty wife.\n\nRemember when the Republicans said she was Trans?\n\n\n&gt;He stole from them the lie that they're better than black people. This is what made them lose their minds.\n\n“If you can convince the lowest white man he's better than the best colored man, he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.”\n\n― Lyndon B. Johnson\n\nIt is like LBJ had a crystal ball and saw this future.",
                                                    "score": 89,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; It is like LBJ had a crystal ball and saw this future.\n\nHe was from Texas. He'd seen it his entire life.\nTrump isn't the disease. Trump is just a symptom of a dystopian America that's been around for a long time.",
                                                            "score": 67,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; He came along with his eloquence, education, huge success, competence and a pretty wife. \n\nNot to even mention his tan suit and like for mustard.",
                                                    "score": 170,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or choosing to have his presidential portrait be something of taste rather than the same old cliché",
                                                            "score": 83,
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Some say he even gives fiat bumps\n\nEdit: fist. But I kinda like fiat bumps as well",
                                                            "score": 39,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;fiat bumps\n\nThat sounds like he gives a lot of Tony's work.\n\nFix it again, Tony",
                                                                    "score": 11
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I heard he eats Kale and reads books for fun.",
                                                            "score": 32,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Reads? What’s that? ^^^/s",
                                                                    "score": 11
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "“If you can convince the lowest white man he's better than the best colored man, he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.”\r  \n― Lyndon B. Johnson",
                                                    "score": 104,
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My grandma was(?) a saint on earth. Never heard anything but positivity come from her. Lovely (?) woman. \n\nTowards the end of her life she texted a lot, tons of sweet, wholesome texts. So at her funeral, my dad had the cute idea of us reading our last few texts with her. \n\nOne cousin, for some reason, got all of her racist rants about Obama. I'll give him credit, that was ballsy reading them; he was 45-ish and seemingly upset that his grandma used a hard R, regarding Obama. \n\nNooooooooooooooooo idea grandma was racist. Ffs grandma",
                                                    "score": 66,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Hoppoooly moly.  That's cold-blooded and.. also fair",
                                                            "score": 18,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nailed it",
                                                    "score": 7
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Try going to the Texas coast. There are still people just as proudly ULTRA MAGA as they ever were. Just giddily proud of their own stupidity.",
                                            "score": 69,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unfortunately you don't have to go to Texas. They're everywhere.",
                                                    "score": 17,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;I wish i could just like, see the timeline where Hillary won in 2016 for even like 5 minutes.\n\nWould be a complete toss up how things would look now. \nThe Covid response wouldn't have been so bungled, and there might be a lot more die-hard republicans still alive.   \n    \nI really can't picture how things would have gone, other than a hell of a lot less stress from 2016 onward though. Having to constantly check the news to make sure we hadn't launched nukes or some other dumb shit was exhausting.",
                                            "score": 52,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Let's not forget the 3 Christo-fascist judges Trump confirmed and Roe overturned.",
                                                    "score": 60
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Covid might not have even been a pandemic. Trump dismantled the worldwide pandemic response team (which was run by the US) in 2019, and just a year and a half later there's a pandemic.",
                                                    "score": 63,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think about all the family, friends, and acquaintances that died indirectly and directly from the pandemic and this fact and am filled with so much hatred I cannot stand it.",
                                                            "score": 9
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Hillary would have kept Yellen on as Fed Chair and would not have been constantly threatening to fire her if she started gradually ticking up interest rates years earlier.  The inflation situation wouldn't have been as severe.  There's also high probability that Putin would not have invaded Ukraine.",
                                                    "score": 13,
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Very good points, but your last one stands out to me. \n\nI genuinely never thought I would have had the level of fear over our national security I had during those years. \n\nIt was absolutely stressful and exhausting knowing that another day could bring some previously unheard of political gaffe or dismantling of our already crumbling infrastructure (like the postal service fiasco we're still dealing with).\n\nIt's still exhausting and disheartening.\n\nEdit: Gaffe has an \"e\" at the end lol",
                                                    "score": 11
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How sad your life must be that almost 3 years later you'd be willing to throw your life away for a guy that is only running for President again so he can use it to stay out of prison.",
            "score": 419,
            "replies": [
                {
                    "level": 1,
                    "comment": "I wonder what their mental fantasy about this is like. That they \"save\" Trump from getting arrested, and then Trump awards them a medal on the White House front lawn. Then they go and hang out and Trump gives them a million dollars and a golden toilet. And then they are finally at peace. That'll bring the ex girlfriend back, surely.",
                    "score": 88,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "When the right finally ditches the very thin veil that they gave a flying fuck about law and order.",
            "score": 2199,
            "replies": [
                {
                    "level": 1,
                    "comment": "\"I'm a Constitutional Originalist\". Biggest red flag ever.",
                    "score": 1053,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Read: \"I just want slaves\"",
                            "score": 861,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s what they mean by “own the Libs.”",
                                    "score": 420,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's what they mean by \"states' rights.\"",
                                            "score": 200,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "States rights to do what?",
                                                    "score": 42,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "States' rights to let people own black people, and to compel other states to enforce that ownership. What else could it be?",
                                                            "score": 16,
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Marry children and segregation",
                                                            "score": 82,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hey, they also want those children working. Get those tiny hands making some sweet tiny gadgets!",
                                                                    "score": 51,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Do you know how much a slave used to cost back then?!\"",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why would we mistreat our tools?",
                                            "score": 19
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Depended on a lot of variables like age, sex, skills, disabilities. But that said the 1850 value was on average about $500, which is about $20k today. So think of a reasonably priced lightly used car.",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just wish they would come out and say it.\n\nLike, we all know what your trying to do...just say you want slaves and hate gay people and put it all to a vote and see who wins.",
                                    "score": 14
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "To them, \"Freedom\" means I can do whatever I want, while stopping anyone I don't like from doing anything at all.",
                            "score": 307,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Here is the Republican message on everything of importance:](https://imgur.com/gallery/y34OBpu) They can tell people what to do. You cannot tell them what to do.",
                                    "score": 289,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Damn that's spot-on. \n\n&gt;If Republicans could do this in every social space - tell the people who aren't like them too bad, get the fuck out -  I'm here to assure that would be something resembling their ideal society.\n\nAnd as he points out, that ideal is based around the \"right\" group being white males. And the media has a consistent inability to call them out on it.",
                                            "score": 86,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; And as he points out, that ideal is based around the \"right\" group being white males. And the media has a consistent inability to call them out on it.\n\nThe reason they never really win in the end with any of their 'wars on others' is because it isn't just \"white males\". That is the in group right now. White males who think like them. But when that is all that is left, there isn't an outgroup trying to oppress them any more so they have to divide that in-group into smaller groups. They do that already. Because it's white Christian males, that think like them. A Muslim who is white and thinks like them don't count. \n\nAfter they \"win\" It will be certain white Christian males that think like them. The group keeps getting smaller, till they are truly a minority of one, and as such don't exist after a bit.",
                                                    "score": 19,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Or put another way \n\n\"Conservatism consists of exactly one proposition, to wit: There must be in-groups whom the law protects but does not bind, alongside out-groups whom the law binds but does not protect.\"",
                                            "score": 36
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I hold out hope that one day science will find a cure for their mental inadequacies.",
                                    "score": 64,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, the problem is that we DID crack that nut. It's called \"Education.\" The problem is, they don't want it. Not sure what to do with that.",
                                            "score": 122,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Education and banning tetraethyl lead",
                                                    "score": 53,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "With how badly conservatives want to bring us back to the 1930s, I wouldn't be surprised if some right wing think tank starts saying we should bring back leaded gas.",
                                                            "score": 30,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"Right wing think tank\" is such an oxymoron.",
                                                                    "score": 18
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "\"It'll make you smarter and have more quality of life.\"  \n...  \n\"No thank you.\"",
                                                    "score": 34,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Personally, I think as the generation that grew up on leaded gas goes away things will get better",
                                            "score": 65,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fox News didn't help either.",
                                                    "score": 53,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fox News, the lead additive of political discussion",
                                                            "score": 58,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Chernobyl is less toxic.",
                                                                    "score": 27
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Constitutional Originalist\n\n\"You know, back when a person like me could own another person\"",
                            "score": 49,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And only white males could vote, get loans, and go to college",
                                    "score": 30,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They won't read the indictment.\n\nIf Biden did what Trump did? They'd be calling for his head on a pike.",
                    "score": 204,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The whole MAGA 2016 platform was sending a presidential candidate to jail for the (alleged) mishandling of classified information, there's no use looking for consistency here.",
                            "score": 225,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*Alleged* mishandling.  Clinton was investigated by the FBI and twice by the state department - once when Rex Tillerson was Secretary and again when Mike Pompeo  was appointed to the position.\n\nAll three investigations found that there was no criminal activity on the part of Clinton or her staff.",
                                    "score": 142,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;*Alleged* mishandling.  \n\n&gt;All three investigations found that there was no criminal activity on the part of Clinton or her staff.\n\nI'm a member of those communities. They did not prosecute Clinton because there was nothing found to be criminally negligent, and it was not worth going after her/her team for something that would boil down to politically motivated. It was obvious that Clinton wasn't doing things in a malicious light.  \n\nHer and her team *did* mishandle classified information. Someone on her team *should've* lost their access/been subjected to remedial training/lost their job. Their saving grace was that previously-mentioned lack of maliciousness and lack of evidence that any of the information had been compromised. They did *not* follow established rules and regulations. \n\nThe reason(s) Trump is cooked is because there is **overwhelming** evidence to suggest all of the above. The egregious nature of all of it is why there will be hell to pay.  \n\nShould Clinton have faced more scrutiny? Maybe. Maybe not. Her team of handlers that were moving that information around for her and overseeing the storage and processing of that information? **YES**. That said, she lost the election in no small part to the smear that came from it. Whether that's a good or bad thing, I'm not interested in the convo.",
                                            "score": 99,
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Clinton was investigated by the FBI and twice by the state department\n\nand how many times by republican congress with nothing to show ofr it?",
                                            "score": 10
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fascists exploit the expectation that they will behave consistently. They will loudly decry hypocrisy, even while being confronted with their own blatant two-faced behavior. Then they will cackle openly at the frustration of their opponents as they attempt to engage with good faith.\n\nBecause that's their not so secret weapon: they absolutely are not engaging in good faith, and they're just using the conversation to occupy their opponents while they exploit whatever weaknesses they can find.",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; If Biden did what Trump did? They'd be calling for his head on a pike.\n\nYou know what, we all would. We don't worship Biden as a God among Men.\n\nThese people are rubes.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They're already doing that.  Multiple Republicans are calling right now by arrest Biden for some nebulous \"crimes\" they can't even prove with evidence.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "And I would understand that. I still wouldn't talk about civil war to protect Biden if he violated the Espionage Act after leaving office.",
                            "score": 37
                        },
                        {
                            "level": 2,
                            "comment": "They are saying Biden did the same thing and are crying that nothing is being done to Biden for it. Nevermind Biden cooperated and handed things over ASAP where trump fought kicking and screaming among everything else to do with trumps classified documents.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They don't need Biden to do the same.  They didn't with Obama and the endless investigations. \n\nThey just make up shit and then act like it's real and it's a conspiracy that no one is ever convicted while ignoring it's bullshit.\n\nAs a result, now everyone in their base is trained to assume both\n\n1) Everything in charges against politicians is bullshit\n2) There is a conspiracy to only protect Democratic Party members",
                            "score": 29
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nope. It’s only about power; always has been.",
                    "score": 19
                }
            ]
        },
        {
            "level": 0,
            "comment": "If only there was an opportunity to punish Trump for asking his fans to do terrorism on his behalf.",
            "score": 425,
            "replies": [
                {
                    "level": 1,
                    "comment": "Literally what I think when I look to the USA from my home in Canada. He is literally obstructing justice by asking for people to show up in force and possibly commit acts of violence in his name. \n\nThe thing is, a lot of people are saying he won't face jail time. Maybe even be elected again! \n\nThat tells me not only is your justice system broken, but your democracy is also lost. \n\nTerrible.",
                    "score": 272,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tThe thing is, a lot of people are saying he won’t face jail time. Maybe even be elected again!\n\nThis is because he belongs to the class of “those” people. The legal system does not apply to elites in this country. Trump could straight up whip out a Glock, on live TV, put it to someone’s head, pull the trigger… and absolutely nothing would happen to him. He’d never see a jail cell, even if he committed blatant murder on live TV in front of the entire country. \n\nIt took Epstein raping *hundreds* of young girls over a decade+ long period with the FBI having mountains of evidence to get “jail”. And *even then* he was allowed to leave jail during the day. He only had to show up there to sleep more or less.\n\nThere are tons of cases of rich elites blatantly murdering someone (usually killing someone while DUI), and nothing happens. Hell it became a huge international problem when a US diplomat did exactly that in the UK and killed a 19 year old kid. They came here and…? You guessed it, nothing happened to them.\n\nThe justice system in this country only applies to the working/slave caste. If you’re part of the elite, it’s the land of the free. You can rape kids, do drugs, engage in blatant corruption, or murder people with absolutely zero consequences. The sad part is there are literal mountains of corpses that these people have left behind. Example: pharma execs caused a huge portion of the population to get addicted to opiates and now we have more than 100,000 people PER YEAR die to overdoses due to opiate addiction. That’s an entire fucking city that dies every year. The pharma execs were found to be responsible. Yet, zero consequences. They killed hundreds of thousands of people. Imagine a handful of people in Canada caused the entire of city Ottawa to die to drug addiction over the period of a decade, and then nothing happens to them. \n\n&gt;\tThat tells me not only is your justice system broken, but your democracy is also lost.\n\nWe’re beyond fixing at this point. Most Americans are afraid and in complete despair. Grifter politicians latch onto that fear and despair and name scapegoats (immigrants, LGBT, “woke” liberals, etc.) in order to seize power.\n\nThe average American just trying to survive out here has known that for a long, long time. Been this way for decades. It’s just accelerating now because we just tipped over the edge and are now collapsing.",
                            "score": 71,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "they are just tourarists",
            "score": 2084,
            "replies": [
                {
                    "level": 1,
                    "comment": "The Trump loving Capitol tourists loved their country so much, they smeared feces all over the wall of The Capitol.",
                    "score": 511,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 234,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But only for people that aren't them they've been screwed out of whatever they actually deserve",
                                    "score": 55
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They love the USA so much they fly the enemy flag.",
                            "score": 15,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is the one that really pissed me off. I know it's odd to be hyper focused on that but it just symbolizes the whole situation. They keep trying to use MY military service to say shit like people shouldn't use their first amendment rights to kneel during the pledge because it's \"disrespectful to the flag\" and then when they stormed the capitol they couldn't even have the decency to bring that same flag.\n\nAnd since I touched on it, the real way to respect my service isn't to \"respect the flag\" it's to use the very rights 20 year old me THOUGHT he was protecting.",
                                    "score": 9
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 547,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes indeed. It seems plausible to me that after Jan 6th the FBI is monitoring, perhaps even infiltrating these groups. The party is over for the \"Gravy Seals\".",
                            "score": 293,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are all part of the Insulin Resistance",
                                    "score": 88,
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 46,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bused in from Orlando…",
                    "score": 57,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ooooh, I hope Mickey Mouse can go!",
                            "score": 20,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope it's the Nazis that were in front of Disney World the other day. I hope they come all the way up from Florida with their disgusting nazi rags flying high and proud.  I hope they are there and saluting their Dear Leader just so the whole world can see what kind of cretins support this dipshit.",
                                    "score": 61,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "the rest of the world knows, it seems Americans are the ones slow on the uptake in seeing this for what it is.",
                                            "score": 50,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's definitely scary how many people support him and his ideas, but remember they are not even close to \"half\" of Americans. The right lies and cheats and uses propaganda to make their views seem more mainstream than they actually are. This douchecanoe lost the popular vote, and then lost the vote by millions. Over 60% of Americans support leaving trans people and gay people the fuck alone. Over half support climate legislation and fair voting laws and universal healthcare. \n\n\nThey're screaming and trashing because they are being told by their incredibly effective propaganda that inclusiveness means they will *lose* their privileges. It's all great replacement bullshit and it's capitalizing on fear. Most people don't buy that shit. \n\nBut our news is also run like sports and what even we see on news skews reality since sensationalist journalism became the norm. There's also the element of social algorithms now. You see more of what you already look at because that's how most algorithms work, in order to advertise you as a product.",
                                                    "score": 16,
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Agreed, Canuck here…it’s been pretty clear for a long time looking in from the outside.",
                                                    "score": 13,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;I hope they come all the way up from Florida\n\nThe arraignment is in Miami. Judge Cannon (yes, the same Judge \"Would you like a Special Master appointed?\" Cannon) presiding.",
                                            "score": 8
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If only there was an opportunity to punish Trump for asking his fans to do terrorism on his behalf.",
                                    "score": 43,
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh boy!",
                                    "score": 9
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They're stupid if they do\n\nWe're ready for their trash this time.",
            "score": 440,
            "replies": [
                {
                    "level": 1,
                    "comment": "I really hope we are.",
                    "score": 171,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Narrator: *”They weren’t”*\n\nCops policing the nationalist terrorists?\n\n**SpidermanPointingAtSpiderman.jpg**",
                            "score": 239,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think we're officially moving into the shock departure phase of the Republican party. The more justice is applied, the more violent the far right will become. The more violent they become, the more the center and 'fiscal' right will flee from them. And this cycle is going to continue until the Republican party is down to its hardest hardcore nationalists.",
            "score": 1168,
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The more violent they become, the more the center and 'fiscal' right will flee from them.\n\nWhen does this part start?",
                    "score": 610,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd argue that it occurred with Liz Cheney, and the GOP calcified as a whole around Trump, rather than leaving any rhetorical space for the \"center or fiscal\" right to leave. \n\nWhen McConnel decided to tie Trump around the neck of the GOP it was an albatross moment.",
                            "score": 347,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup.  We need the media to start blaming Mitch Turtle McConnell for this.  He refused to convict TFG for January 6 and that would have removed TFG from running again permanently.  Then we wouldn't be here and the GQP would have moved on by now",
                                    "score": 116,
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Bingo! We saw what happened when then started to happen and they saw how the primaries would go for them",
                                    "score": 62
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Joe Biden’s margins in suburbs were insanely high. As have a lot of other democrats in statewide and local elections. Colorado Springs elected an independent, which is nuts. Republicans are becoming an unviable party at the federal level.",
                            "score": 138,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As much as i love the republican party becoming unviable, i really think this country needs more viable parties as opposed to less!",
                                    "score": 42,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Spin up an alternative to democrat that doesn’t include white supremacy and I’m open to hearing more.",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Same.  Would LOVE a viable alternative honestly.",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's already somewhat starting, as those who aren't completely enthralled by the MAGA movement have been starting to flip parties...not to mention big corporations like Disney actively pushing back against Republican policies that affect their bottom lines.\n\nI do wish the process was *faster* though. Perhaps it will accelerate in 2024 as Violence done in favor of the GOP is accelerated in order to get Trump the Presidency.",
                            "score": 130,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Now, if only they would stop funding candidates in the Republican party. It's all well and good to say you aren't with the GOP for their batshit insanity, but a lot of these corporations are still funding their candidates. Frankly, it's an atrocity that we allow any corporation to fund any candidates to begin with, but I digress.",
                                    "score": 52
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Trump wasn't re-elected, so I'd say it started when he was still in office, running for his second term.\n\nLet's just hope people don't get bored with elections and decide not to bother to show up for the next election.",
                            "score": 45,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s started.",
                            "score": 10
                        },
                        {
                            "level": 2,
                            "comment": "This is why Biden won the election ^",
                            "score": 53,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Ohhh, dude... many of us who knew the pos left before Trump,and many more are starting to  get the picture. Only the fanatical are latching on to him. Unfortunately, there is a bunch of them. Republican leaders though are scares to even challange.him cause they're pussies.",
                            "score": 24
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Elected GOP will just call any violence they commit false flags etc, they would even call a group shooting everyone and evacuating trump to stop him from getting arrested a false flag op of BLM and the base would play along, they have no shame and effortlessly just disregard any evidence to the contrary of what they are saying. Jim Jordan earlier said that the recording of Trump saying he could have declassified the doc he was holding while President but now he can’t was him saying he declassified it, just straight upside-down world shit.",
                    "score": 175,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s all part of the Big Lie to seize control.",
                            "score": 36
                        },
                        {
                            "level": 2,
                            "comment": "Gym Jordan has head so far up Trump's Ass he can taste his last Big Mac he's a real smarmy POS who in his mind thinks he's a tough guy",
                            "score": 23
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is there such thing as a fiscal conservative in America?\n\nLike - republicans blow up the debt every time (bush with his invasions on false WMD’s, trump with his PpP untracked billions given away and tax cuts to ultra wealthy…)",
                    "score": 115,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Republican fiscal conservative are only against  taxes for themselves and the wealthy.  They view everyone \"else\" as needing to pay their fair share.",
                            "score": 91,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Fiscal conservatism is \"Don't give my taxes to welfare or healthcare for minorities.\"",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "There are Americans who honestly think “do/ingest/fuck/marry whatever/whoever you want, but leave my money alone.”  However, to the extent that they vote R, they are every bit as complicit as the MAGAnuts.",
                            "score": 48,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So a modest proposal was real after all",
                                    "score": 11
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm one of those.  \n\nIt sucks because I am 100% unrepresented because neither party is interested in leaving my money alone but at least the choice at the polls is easy:  I can vote for literal Nazis or I can not do that.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Most self-described 'libertarians' I've known over the years took a hard turn into Republicanism during the Obama years and were full-blown MAGA conspiracist trash by 2016. I remember a number of them turning because of situations like Ferguson, revealing that bald racism always meant more than whatever bullshit ideas they ever entertained about 'fiscal responsibility', 'non-aggression', etc...",
                                    "score": 22
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At some point we have to rip the bandaid off. We can't keep coddling them, we've been doing that for 160 years now and it's only brought misery and pain.",
                    "score": 42
                },
                {
                    "level": 1,
                    "comment": "this is how parties die and new parties emerge. Because of how the US system is designed, it will continue to gravitate to a two party system, for better or worse (mostly worse, but that's another argument).\n\nthe sane remainder of the old republican party will diverge away from the crazies who will continue to flail until they implode, and eventually we'll end up with a more rational center-right party, the democrats (some of which may switch to said center-right party (you know who I'm talking about), and a small meaningless remainder of insanity will will be about as relevant as the libertarians, and mostly be going to jail.\n\nbefore we get there though, there' s gonna be some dark days ahead. and of course, if people aren't engaged, they could win. so stay engaged and VOTE.\n\nnot a single GOP candidate will get my vote unless and until every aspect of the MAGA is purged from the party. that may never happen, so for the foreseeable future, i don't vote republican under any circumstances.",
                    "score": 49,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It bums me out that some of them are helping to drag the DNC farther to the right (Biden as a commie is still a jaw dropper)",
                    "score": 10,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No I agree. The last thing we need is a 'further to the right' Democrat party. The two party system is strangling this nation and corporations are what's holding the body down and allowing it to happen.",
                            "score": 22
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So you want to go to war against trained, government paramilitary personnel?  Well Cletus, stand up, hook up and shuffle to the door.",
            "score": 227,
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; want to go to war against trained, government paramilitary personnel?\n\nNo they don't.   \nThe memes I've seen and posts from the extreme right wing nuts on Twitter, Truth Social, Facebook, etc. all say the same thing:  \nOnce they feel like the \"war\" has started, and the green light to shoot is given, they intend to just start executing their \"enemies\" (gays, blacks, brave independent women, illegals, people with blue hair, anything with a rainbow, and anyone they think is a liberal).  \nThey *also* expect the police and military to just join in with them.",
                    "score": 187,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is exactly why, after Jan 6, so many Yehawdists broke down crying when they discovered that they were placed on No-Fly lists and were detained by security or arrested by police. \n\nAt least one of them even shouted, \"You're treating me like a black person!\" on video.",
                            "score": 113,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No…. Most black people can get on an airplane. You can’t. I’m treating you like a domestic terrorist, which accord to CPAC, you all are.",
                                    "score": 43
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They are nothing more than keyboard warriors, most couldn't handle the government cutting their power or living in the woods. They need their burgers and MTN dew to live.",
                            "score": 40,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're not just keyboard warriors. Not all of them. It doesn't take many people with weapons to harm and kill a lot of innocent people. There are far too many who see this as a kind of holy war.",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep. They're just following their bible, the Turner Diaries. \n\nFunny thing about the Turner Diaries, and racial supremacists in history in general, is they assume that everyone of their race is on their side, and nobody wkll fight back competently. The Turner Diaries literally have minorities fighting by throwing stones. \n\nRacial supremacists the world over rarely win actual wars because of the inherent mental bias where they underestimate their foes.",
                            "score": 24,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bring it ya freaks!!! Plenty of room in Federal prisons, and if we run out I’m pretty sure the rest of us will be happy to pay for building more!!!",
            "score": 637,
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean we could legalize weed at the federal level and release non violent drug offenders to make room for all these “patriots”",
                    "score": 510,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love this idea because it’s the right thing to do, but there are very few weed offenders in federal prison. They are in state prisons.",
                            "score": 149,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just let the Federal Government contract out for their sentences and store them in the state facilities as long as they release the non-violent drug offenders. Legalization at the state level would be huge plus as well.",
                                    "score": 49,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The prison industrial complex always needs bodies to feed it",
                    "score": 32,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We should dismantle that not endorse it. Its not great having the  world's highest incarceration rate per capita by far.",
                            "score": 40,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I encourage these imbeciles to continue openly threatening the government and their fellow citizens in full view of the public and law enforcement. You see how well that's worked out for the Jansix crowd.",
            "score": 169,
            "replies": [
                {
                    "level": 1,
                    "comment": "MAGA types think we fear them. We don’t. They’re a joke. They ironically hide behind masks and inside the back of Uhaul trucks. They are paper men who have no future.",
                    "score": 97,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The hollow men. Stuffed men. Headpiece filled with straw. Alas!\n\nShape without form, shade without colour,\n    Paralysed force, gesture without motion;\n\nhttps://allpoetry.com/the-hollow-men",
                            "score": 30,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On Truth Social, the former president sent a barrage of posts and videos declaring his innocence and urging his followers to face his political enemies. On 9 June, he wrote: “SEE YOU IN MIAMI ON TUESDAY!!!”",
            "score": 194,
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure, his hardcore followers will meet him down there as soon as they all get out of prison in a few years from the last meetup.",
                    "score": 128,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol like they have the means and ability to just get down to florida in a days notice, with their guns mind you…",
                            "score": 40,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "January 21, 2021 [PayPal boots Jenna Ryan, the Texas real estate agent who flew a private jet to the Capitol riots](https://www.cbsnews.com/news/jenna-ryan-paypal-capitol-riots/)",
                                    "score": 34,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lol ALL CAPS",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm always reminded of that [Dark Knight scene](https://www.youtube.com/watch?v=1z6o1GIEsQE&amp;ab_channel=PumaProductionsZF) where that guy tries to blackmail batman without considering the 'consequences'\n\nThese people are openly talking about taking up arms against the US Government, a government with one of the largest and most powerful militaries in human history, a government that spends more annually on military and intelligence than some countries do on their yearly budget...and you think you'll win?",
            "score": 71,
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who has a lot of future Oklahoma City Bomber relatives, allow me to explain:\n\nThey think there's two governments. One, the 'real' government, is full of blonde haired blue eyed good ol' boys who conveniently run the parts of the government they DO like (i.e. the military, DHS, ICE), and the other is the 'bad' government, ran by ~~jews~~ err, uhh, 'degenerates' and liberals, who conveniently run the parts of the government they don't like (i.e. the IRS, Social Security, the Post Office, FBI, etc.)\n\nThey legitimately think the 'real' government, who just so happens to be the gun wielding part, is champing at the bit to arrest and execute the 'bad' Government, and just need the go ahead by the US population. So in their head, they think if the stomp and cry enough in public the 'real' government will join them and coup the 'bad' one.",
                    "score": 56,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is bananas and scary so many people believe this crazy-cake.",
                            "score": 13
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They think they'll flip to their side.",
                    "score": 8
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can we charge them with sedition yet? Asking for person sickened by Jan 6th antics last time.",
            "score": 102,
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd also like to point out that these antics are the most Un-American of actions possible. There is no discourse and respect for the diversity of our population when a minority feels it can take actions by force which cannot be justified academically or even spiritually.   \n\n\ngood luck D students !!",
            "score": 100,
            "replies": []
        },
        {
            "level": 0,
            "comment": "In some ways - this early incitement by Trump is advantageous for our government and democracy later down the road.\n\nHe’ll get all the crazies and lunatics riled up and the FBI will simply be sitting somewhere with a big grin on their face as the domestic terrorists easily expose their identities, easily expose their plans, and ultimately get arrested.\n\nThey’re idiots. They will do idiot things. We just gotta catch ‘em sooner rather than later. \n\nThey kinda make it easy (more than not) too.\n\nYou’ve been played assholes.",
            "score": 181,
            "replies": [
                {
                    "level": 1,
                    "comment": "**The US Secret Service** is charged with the protection of former President Trump.  \nThey'd love nothing more than for the Governor or State Police to set a \"no firearms\" cordon area for a mile around that courthouse.  \nEven if they're sure that the ones bringing guns aren't aiming at their 'package', any time bullets start flying everyone is in danger.  \nAnd **no one** wants to jump on top of the orange gasbag and blow out his diaper.",
                    "score": 52,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cops are cops. I have no doubt some of those assholes in the secret service fuckin love his dictator wannabe ass",
                            "score": 30,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But they know lots of people *dont* love his ass.  \nSo they need to keep an eye out for weapons.  \nWhich makes their job REALLY hard when everyone has one.",
                                    "score": 14
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t know, it was very obvious last J6 and they did nothing. Couldn’t believe it went where it went. They were extremely sympathetic",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bet 10 people show up...",
            "score": 227,
            "replies": [
                {
                    "level": 1,
                    "comment": "Expect to see more confederate war flags and swastika symbols.\n\nIt would be hilarious of the cops could show up in rainbow themed riot gear.",
                    "score": 260,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And wearing those masks they wouldn't wear during COVID.",
                            "score": 102
                        },
                        {
                            "level": 2,
                            "comment": "Awfully bold to assume the police will oppose these guys.\n\nI expect to see yet another demonstration of treating these traitors with kid gloves while they continue to go hard on BLM, and other causes they don't agree with.",
                            "score": 55
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There will be 100 reporters for every 10 Trump supporters that show up.  \nAnd it's supposed to be near 90° with thunderstorms in Miami tomorrow.  \nIf the rain doesn't thin out the crowds, the heat will get them.",
                    "score": 49,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It will be reported like his rallies.  10 people will be photographed from 10 feet making it look like hundreds out of view.",
                            "score": 27,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live in Florida. I was on I-95 yesterday and saw a procession of about 7 old beat up former military humvees with trump flags off the back heading south towards Miami.  They were filled with people you would expect to look like the type.",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Maggots think they'll be fighting for Trump Pinocchio. In reality...they could end up fighting for their very lives. He's not worth your life people. Don’t start what you can't finish. Law enforcement will be there in huge numbers and extremely well prepared. You will not win. Trump will use any of your deaths as a badge of honor for himself. He does NOT care about you. EVERYTHING is about him. ALWAYS!",
            "score": 125,
            "replies": [
                {
                    "level": 1,
                    "comment": "I just wish they get treated like indigenous people trying to protect their land.",
                    "score": 24
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Mentally Unstable and Horribly Racist vs. The Humane.\n\nOr, Republicans vs. The Rest of America",
            "score": 41,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Even if they do try to start some kind of war, it was still the right thing to do.  If we let a president get away with what he did, we won't have too many more presidents.  We'll have kings.",
            "score": 73,
            "replies": [
                {
                    "level": 1,
                    "comment": "Land of the free, home of the brave\n\nThis means that we do the right thing, even if it is hard, because it's the right thing to do.",
                    "score": 10
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trump Republicans won't think twice about killing cops. But you keep voting Republican, law enforcement, what's the worst that could happen?",
            "score": 74,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Give us a “see something say something” email address so I can send pics of license plates of all the domestic terrorists I see driving on the highways. I wanna do my part!",
            "score": 106,
            "replies": [
                {
                    "level": 1,
                    "comment": "Here is one (the FBI tip line) which may be of help: [https://tips.fbi.gov/](https://tips.fbi.gov/) \n\nHere's another with several local tiplines, including the Floridian one (from the Department of Homeland Security): [https://www.dhs.gov/see-something-say-something/how-to-report-suspicious-activity](https://www.dhs.gov/see-something-say-something/how-to-report-suspicious-activity)",
                    "score": 41
                }
            ]
        },
        {
            "level": 0,
            "comment": "Far-right terrorism. Become what you're blaming others for. The ironic thing is White Extremists are literally the leading cause of domestic and terrorism in general in THE US. Most, if not all, White Extremist groups are far-right individuals anyways.\n\nWhat I'm saying is if it walks like a duck, and quacks like a duck, they're a domestic terrorist.",
            "score": 29
        },
        {
            "level": 0,
            "comment": "Hey, I totally encourage the Trump Neandethals to bring it on. After years of para-military cos-play and pizza afterwards, the utter shock of meeting the terrifying lethality of the American Army during their \"rebellion\" is going to be so satisfying to watch for this Vet. Got my popcorn.  Traitors, all in my book.",
            "score": 39,
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt;&gt;“If you want to get to President Trump, you’re going to have to go through me and 75 million Americans just like me,” [Kari Lake] said. “And I’m going to tell you, most of us are card-carrying members of the NRA … That’s not a threat, that’s a public service announcement.”\n\nOkay Kari. This isn't an insult, this is a fact. You're an idiot.",
            "score": 26,
            "replies": []
        },
        {
            "level": 0,
            "comment": "“We are all domestic terrorists” -CPAC 2022",
            "score": 19,
            "replies": []
        },
        {
            "level": 0,
            "comment": "[Neil Brennan’s joke about the disparities of the US military vs a militia is hilarious](https://youtu.be/WOSqCjMRXWA)",
            "score": 22,
            "replies": []
        },
        {
            "level": 0,
            "comment": "My take on Trump from day one is that he would destroy the Republican Party. We’re getting there, and it’s hilarious.",
            "score": 20,
            "replies": [
                {
                    "level": 1,
                    "comment": "The GOP history:\n\n* 1980 through 2010 was the rich using the conservaderps as their useful idiots to steal the treasury.\n* 2010 and onwards is the conservaderps who actually believe that crap destroying the world in their spite and ineptitude.",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Of course police are monitoring far right groups online. They're already in those groups.",
            "score": 19,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ummmm…..KKK and far right groups have been terror groups since the founding of America and we’re now just getting serious?   Oklahoma, score of mass shootings, Jan. 6- these groups need to be designated as such and dealt with under the terrorism laws.   You know- kind of like the black panthers.",
            "score": 103,
            "replies": []
        }
    ]
}