{
    "id": "147ufad",
    "score": 698,
    "title": "Ron DeSantis to attend fundraiser with Wall Street execs, including former Soros firm partner",
    "author": "e-r_bridge",
    "date": 1686595610.0,
    "url": "https://www.cnbc.com/2023/06/12/desantis-wall-street-fundraiser-ex-soros-exec.html",
    "media_url": "https://www.cnbc.com/2023/06/12/desantis-wall-street-fundraiser-ex-soros-exec.html",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "level": 0,
            "comment": "DeSantis has his plane info kept secret because otherwise his connections to Soros and the WEF would be obvious.",
            "score": 21
        },
        {
            "level": 0,
            "comment": "&gt;DeSanctimonious is a Soros backed globalist  who spent all of his Congressional years increasing your taxes.  With a sales tax here and a sales tax there.  His poll numers are like that meatball rolling off the table, going down to the floor. Remember this: If it weren’t for me, Ron DeSanctimonious would right now be working probably at a law firm, or maybe a Pizza Hut, they like meatballs there?  I don’t know.\n\n\\-@RealDonaldTrump",
            "score": 70,
            "replies": [
                {
                    "level": 1,
                    "comment": "Is Trump referencing:\n\nOn top of SPAGHETTI!\n\nAll covered with cheeese,\n\n\nI lost my poor meatball,\n\n\nWhen somebody sneezed.\n\n\nIT ROLLED OFF OF THE TABLE!\n\nAND ONTO THE FLOOR!\n\n\nAND THEN MY POOR MEATBALL,\n\nROLLED RIGHT OUT THE DOOR",
                    "score": 24,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*That's a spicy meatball!*",
                            "score": 7,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Speecey spicey! Speecey spicey!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "De beency bouncy burger, eh?",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That was Sean 'Spicey' Spicer",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "(you should write another.. on the mashed potatoes incident!)",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "GOP was never really anti-globalist. Maybe they want to or pretend to be now. They know where the donations are coming from.",
                    "score": 12
                },
                {
                    "level": 1,
                    "comment": "I just still get this really weird feeling when I read something Trump wrote when I try to reconcile that with the information that he was the 45th President of the United States for 4 years.  \n\nI really do feel like maybe some time in 2015 everyone reading this ended up in a \"what if\" case of an ancestor simulation.    Eventually someone running things is going to say \"well that was interesting..\" and flip a switch and this is all over.",
                    "score": 10,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"So that's what would have happened if I had invented the fing-longer.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Upvote for the appropriate Futurama reference. ;)",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ron desnutz",
            "score": 36
        },
        {
            "level": 0,
            "comment": "But I thought he despised the “elites”?!?",
            "score": 10
        },
        {
            "level": 0,
            "comment": "Wall Street supports fascists",
            "score": 9
        },
        {
            "level": 0,
            "comment": "Dion DeSanders is now officially Soros funded.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Fill my panties with dollars and I’ll dance for you if I get elected, daddy.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Ron DeepStatenis",
            "score": 8
        },
        {
            "level": 0,
            "comment": "Oh boy, Little Ronnie is meeting with Soros disciples. This is going to make some heads explode.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Ron got married at Disney World",
            "score": 3,
            "replies": [
                {
                    "level": 1,
                    "comment": "Casey TOLD him where he was getting wed!!",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "The prophecy of projection comes true once more, behold the George Soros human trafficking politician.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Soros is buying in ?  That's news!  (Especially since he - Soros - is retiring)",
            "score": 2
        },
        {
            "level": 0,
            "comment": "fascists know where the $$ is. they should be exposed by the media..hell-o are you listening??",
            "score": 2
        },
        {
            "level": 0,
            "comment": "We all knew Desantis is in cahoots with Soros. So much evidence it’s irrefutable.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "So he's hanging around Soros now huh...like best friends or something",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Ron DeSortis",
            "score": 2
        },
        {
            "level": 0,
            "comment": "“Ladies and Gentlemen, the Martian Ambassador is gonna say a few woids” *Ron lurches onto stage*",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Ooooh his pet Nazis ain’t gonna like that Soros connection",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Swampy",
            "score": 1
        },
        {
            "level": 0,
            "comment": " Money can’t buy Ronny a spine or the slightest of human decency.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Tax dollars well paid for... Just help American citizens Ronald",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Sounds like he’s enjoying rubbing elbows with his fellow elites while laughing at his rube supporters!",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Democrats should pump desantis, cause discord in the R ranks",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Florida Elitist to hang out with the fat cats. Voters too stupid to care.",
            "score": 1
        }
    ]
}