{
    "id": "1486dwa",
    "score": 334,
    "title": "Floridians Would Make Up Trump’s Jury Pool. Here’s What Some Are Saying.",
    "author": "MurphHodgkins",
    "date": 1686630458.0,
    "url": "https://www.reddit.com/r/politics/comments/1486dwa",
    "media_urls": [
        "https://www.nytimes.com/2023/06/12/us/trump-voters-florida-jury.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I'm not too worried. \n\nIf you're smart enough to fool a jury commissioner, you're probably not a Trump supporter anyway.",
            "score": 245,
            "author": "juncopardner2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Judge: has the jury reached a verdict?\n\nPresiding Juror: yes, your Honor. We have reached a verdict of whatabout Hunter Biden?",
                    "score": 229,
                    "author": "SirLitalott",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Judge Cannon: I hereby sentence Hunter and Joe Biden to 100 years hard labor in the mines of Rura Penthe",
                            "score": 107,
                            "author": "MaxZorin1985",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“That was not his knee…”\n\nCan also double for their desperation over the laptop?",
                                    "score": 23,
                                    "author": "oliversurpless"
                                },
                                {
                                    "level": 3,
                                    "comment": "Also Judge Cannon:\nI hereby clear Trump any and all wrong doing, furthermore declare Trump immune from prosecution of any and all further crimes.",
                                    "score": 21,
                                    "author": "49GTUPPAST",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also because we inconvenienced Trump everyone take out their wallets in the courtroom and donate to him, because he likes money.",
                                            "score": 16,
                                            "author": "Notoneusernameleft",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And in said “inconvenience”, they’re really proving how much white privilege exists.\n\nDespite how frequently they deny it exists…",
                                                    "score": 6,
                                                    "author": "oliversurpless"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&lt;Turns and looks at Trump&gt;\n\n\"Did I say that right m'lord?\"",
                                            "score": 4,
                                            "author": "Agent7619"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Dammit, Jim....",
                                    "score": 18,
                                    "author": "ENOTSOCK"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't worry\n\nBe happy",
                            "score": 5,
                            "author": "Art_Is_A_Confession"
                        },
                        {
                            "level": 2,
                            "comment": "Take my poor man’s award 🥇",
                            "score": 8,
                            "author": "chasedippen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trump supporters aren't great at keeping quiet. Should be easy to fine them by looking over social media.\n\nAbd it seems just as likely they get a DeSantis person who wants to burn Trump. I'm going to just assume the Justice Department is on the case here.\n\nPlus, this evidence is pretty overwhelming.  Gonna be hard to make an honest case that you think he's not guilty. \n\nWe'll see. He needs to run the table to survive. That seems... difficult.",
                    "score": 23,
                    "author": "JesseRKnight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I predict we are going to see an influx of articles in conservative media covering the idea of jury nullification",
                            "score": 4,
                            "author": "brock275",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope so. DoJ can take that to the judge.  Also creates good grounds for a retrial. I'm not worried but feel free.",
                                    "score": 2,
                                    "author": "JesseRKnight"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Does the jury need to be unanimous?",
                            "score": 2,
                            "author": "MakeADeathWish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's not going to be a problem.  You'd have to find someone willing to vote to aquitt on all counts who hasn't ever posted anything Maga related... \n\nAnd THAT just gets you a mistrial. There is no way out here.",
                                    "score": 16,
                                    "author": "JesseRKnight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wonder what attorneys he'd have to choose from after that.",
                                            "score": 1,
                                            "author": "canolafly"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "yes",
                                    "score": 1,
                                    "author": "hardtobeuniqueuser"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Will his lawyers actually know how to select jury?",
                            "score": 1,
                            "author": "watermystic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Justice Department? Yeah, they'll be fine.",
                                    "score": 4,
                                    "author": "JesseRKnight"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I remember the manafort trial. There was one juror who flat out refused to believe the evidence and kept him from being convicted on all counts.\n\nhttps://www.reuters.com/article/us-usa-trump-russia-manafort-juror-idUSKCN1L80AA",
                    "score": 35,
                    "author": "hamsterfolly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A talking head mentioned that case yesterday who was optimistic because that same juror did convict on some counts",
                            "score": 13,
                            "author": "MyNameCannotBeSpoken"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm not either\nThey convinced enough people to indict in the first place. It's not like this is outside the norm for their jobs.",
                    "score": 17,
                    "author": "ClusterFoxtrot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The grand jury was made up of between 16 and 23 members and 12 had to agree.  Also the standard is simply probable cause which is said to be about 30% certainty.  Whereas for a conviction they’ll need “beyond a  reasonable doubt”, which is like greater than 95%.\n\nI feel like they should convict, but the indictment tells up very little.  There a saying that you can indict a ham sandwich.",
                            "score": 4,
                            "author": "phxees",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You don't think the indictment is illustrative enough?",
                                    "score": 6,
                                    "author": "MakeADeathWish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately no for the reasons stated above.  \n\nA reasonably capable attorney may be able to convince a grand jury that there’s 30% chance that Trump is guilty of being a genius.  While there would be very low chance that a jury will return a unanimous verdict with a 95%+ confidence of the same.",
                                            "score": 1,
                                            "author": "phxees",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Your right, the indictment doesn't prove Trump knowingly withheld classified documents. Especially the part when he said they should lie to the government and tell them they don't have any classified documents.\n\nHe could have mentioned anything there.\n\n/s if it isn't obvious",
                                                    "score": 1,
                                                    "author": "ResidentBackground35",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My point isn’t that Trump isn’t guilty because he most certainly is. My point is that if you pick jurors from West Palm Beach Florida and you instruct them to only return a guilty verdict if they are nearly 100% certain that Trump knowingly committed a crime there’s a non zero chance that one Republican from that area is going to say, I’m not convinced.\n\nEspecially when you factor in the likely Judge presiding over the trial is a demonstrated Trump supporter.",
                                                            "score": 1,
                                                            "author": "phxees"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A jury commissioner?",
                    "score": 3,
                    "author": "maebyfunke980"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is Miami though so not exactly the reddest area of Florida. Shouldn't be too hard to find a jury that doesn't care about politics when nearly half of the public doesn't even register to vote.",
            "score": 48,
            "author": "JdSaturnscomm",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm waiting for the shock and surprise when the Magas find out a lot of Miami doesn't speak English. Imagine the conspiracy theories when they have to translate things for the potential jurors.",
                    "score": 29,
                    "author": "SBI992"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know I wouldn't want my fate to rest on a jury of 12 Florida men (and women)",
            "score": 50,
            "author": "vineyardmike",
            "replies": [
                {
                    "level": 1,
                    "comment": "My solution is simple: never let Florida have any jurisdiction over me.",
                    "score": 19,
                    "author": "Michael_In_Cascadia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OMG, as a FL lawyer, THIS!!!!",
                            "score": 11,
                            "author": "maebyfunke980"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Umm, these are Not my peers….your honor.”",
                    "score": 33,
                    "author": "DigNitty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You say that jokingly, but does anyone believe for a nanosecond that Trump views anyone in the actual jury pool his “peer”?  If we let him choose a jury of his peers, it would include all his favorite authoritarian leaders like Putin, the Saudi guy, etc.",
                            "score": 7,
                            "author": "neddiddley"
                        },
                        {
                            "level": 2,
                            "comment": "They never are. Wah Wah.",
                            "score": 5,
                            "author": "maebyfunke980"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“How did you get here today?”    \n“I rode an alligator!”",
                    "score": 3,
                    "author": "HeroDanTV"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a Floridian and fuck that traitor! We aren’t all crazy and stupid. I would argue through him in gen pop with lifers..",
            "score": 16,
            "author": "--h8isgr8--"
        },
        {
            "level": 0,
            "comment": "&gt;But even though she is a two-time Trump voter, she cannot really say *publicly* how she would lean as a juror weighing the case.\n\nSigh...FTFY",
            "score": 57,
            "author": "quitofilms",
            "replies": [
                {
                    "level": 1,
                    "comment": "“81 year old trump voter….calling the federal indictment a ‘witch hunt’”",
                    "score": 40,
                    "author": "DigNitty"
                },
                {
                    "level": 1,
                    "comment": "“Ma’am, 47 of your last 48 Facebook posts are supporting trump or demanding Biden be arrested.“",
                    "score": 27,
                    "author": "dan_craus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the one that isn't is a message you meant to send private but posted on your wall.  sorry about the glass bottle up the whooha",
                            "score": 7,
                            "author": "2cheeseburgerandamic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s either that or a “As of July 1st Fb will charge you…” type post",
                                    "score": 1,
                                    "author": "dan_craus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I relayed to my parents as way of seeing how dumb folks are.",
                                            "score": 1,
                                            "author": "2cheeseburgerandamic"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t trust South Florida at all. Ever.\n      \nEdit: She is a two time Trump voter but feels she could listen to the evidence and be impartial. FTFY.",
                    "score": 18,
                    "author": "maebyfunke980"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A jury full of Florida Mans. Lovely.",
            "score": 27,
            "author": "BigTentBiden"
        },
        {
            "level": 0,
            "comment": "What does the prosecution do in the event of a biased jury pool? I'm assuming there are standard legal proceedings to assure a fair trial.",
            "score": 21,
            "author": "bpeden99",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's one of the tricks the judge can affect.\n\nThe prosecution could say \"we would like to only pick jurors who said they did not vote,\" and the defense can say \"No, we would like to not even ask if they voted,\" and the judge can rule for the defense on that motion.",
                    "score": 31,
                    "author": "MississippiJoel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see, thanks for that \n\nWill it be a fair trial?",
                            "score": 9,
                            "author": "bpeden99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Remains to be seen. If this judge makes a foolish statement, she can be replaced.",
                                    "score": 16,
                                    "author": "MississippiJoel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok, that was one of my main inquiries. Checks and balances are active?",
                                            "score": 8,
                                            "author": "bpeden99",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Judge is a Trump appointee.",
                                                    "score": 9,
                                                    "author": "maebyfunke980",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But I've heard they aren't worried about that because of reasons I didn't understand. So I try not to go doomsday so quickly",
                                                            "score": 3,
                                                            "author": "bpeden99",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I like your optimism!!",
                                                                    "score": 3,
                                                                    "author": "maebyfunke980",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It keeps my blood pressure down, more people should try it",
                                                                            "score": 1,
                                                                            "author": "bpeden99"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, to a degree.",
                                                    "score": 5,
                                                    "author": "MississippiJoel",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Should I be worried about the glove not fitting or is it all pretty standard so far?",
                                                            "score": 3,
                                                            "author": "bpeden99",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Will there be a there a white bronco involved? Tune in to find out!",
                                                                    "score": 6,
                                                                    "author": "SpiritTalker",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "To me, it's even more funny because the new Broncos released just in time for this joke to repeat itself all over again. I'm slightly disappointed though, because I know trump doesn't know how to drive or do anything remotely interesting in a criminal sense.",
                                                                            "score": 3,
                                                                            "author": "bpeden99",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Nah, he'll just try to commandeer the wheel while someone else is driving!",
                                                                                    "score": 2,
                                                                                    "author": "SpiritTalker",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Those new Broncos are nice though. This will be a white Ram truck.",
                                                                                    "score": 1,
                                                                                    "author": "binglelemon",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He can afford a private flight.",
                                                                            "score": 2,
                                                                            "author": "maebyfunke980",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "But will it be white?",
                                                                                    "score": 1,
                                                                                    "author": "SpiritTalker",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The evidence appears to be the slam-dunkiest of slam dunks.\n\n...assuming the judge allows them to present evidence.",
                                                                    "score": 2,
                                                                    "author": "DuckQueue",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lol \"Tell you what. I'm going to let the US Senate vote to decide whether we need witnesses in this trial. Wait, did I say Senate? I meant the House.\"",
                                                                            "score": 1,
                                                                            "author": "MississippiJoel"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Doubtful. We will see.",
                                    "score": 2,
                                    "author": "maebyfunke980",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've heard otherwise, but yes we will see",
                                            "score": 1,
                                            "author": "bpeden99",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’ve tried enough cases (not in Federal Court) to know better than to ever trust a jury. I’ve won cases I shouldn’t have. I helped a former partner pick a jury for a DUI trial that he lost and shouldn’t have. Federal Court is a different ball game but lay people are the same. The jury instructions are legalese. They don’t get to take evidence into the jury deliberations. Maybe their notes but 12 people trying to apply complicated law to their memory of … days of evidence? Yeah even as a lawyer it would be tough and I’ve empaneled lawyers three times (regrettably). I’m hard headed. We aren’t smarter than most people nor do we understand areas outside our own practice area very well.",
                                                    "score": 7,
                                                    "author": "maebyfunke980",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I served on a jury in Federal court. We took notes, and were allowed to view the evidence (not physical evidence, but copies of the various internet communications that were submitted) in the deliberations.",
                                                            "score": 4,
                                                            "author": "Fight_the_bastards",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\\+1, they let us have copies of documents and photos of physical evidence",
                                                                    "score": 1,
                                                                    "author": "hardtobeuniqueuser"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The prosecutor used to work war criminal cases I've heard. Above my pay grade, I'll refer to him",
                                                            "score": 2,
                                                            "author": "bpeden99",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I’m all in on Smith!",
                                                                    "score": 2,
                                                                    "author": "maebyfunke980",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I think he knows what he's doing",
                                                                            "score": 2,
                                                                            "author": "bpeden99"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The Judge asks all the voir dire questions in Federal Court but both sides can submit questions they’d like asked. The Judge isn’t going to ask people who they voted for but a good background check by both sides and they don’t need her to ask.",
                            "score": 3,
                            "author": "maebyfunke980"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe it’s different in Florida, but where I live jurors are summoned from the voter rolls.",
                            "score": 3,
                            "author": "ApplicationHour",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, we're talking Federal, not \"Florida,\" but I'm sure it's something similar; I was just throwing an example out there.",
                                    "score": 2,
                                    "author": "MississippiJoel"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s a procedure to preserve an appeal but I’m not up for explaining a tedious process to ultimately say “there’s a means to try to strike the panel and preserve a mistrial/appeal.”",
                    "score": 4,
                    "author": "maebyfunke980",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a means to guarantee a fair trial though, which is reassuring. Thank you for not busting out the jargon and legalese.",
                            "score": 1,
                            "author": "bpeden99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m a trial lawyer and I don’t actually believe in “fair trials.” But I don’t practice criminal law. Yet I still don’t believe in fair criminal trials. I do believe Federal jurors are generally better than Circuit Criminal or Civil so that’s a tiny ray of hope. No legalese but I don’t doubt people will lie to get on this jury. The feds will know everything about every potential juror so that is also promising.",
                                    "score": 10,
                                    "author": "maebyfunke980",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I figured as much, I'll be keeping an eye out for a white bronco. Thanks for the insight though, I appreciate an experts information",
                                            "score": 3,
                                            "author": "bpeden99"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone above made a good point: \"If someone is smart enough to fool a Jury Commissioner, they are almost certainly too smart to have been a Trump supporter in the first place.\"",
                    "score": 8,
                    "author": "Bonesnapcall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for pointing that out, I hadn't seen or heard that yet... Though I assumed as much...\n\nWhen this all started happening initially with Trump's idiocy, that was a reassuring thought that there is no way anyone stoking or supporting him and his thoughts is truly smart enough to pull it off, let alone do any danger to the American public. \n\nI have learned however, that they can do plenty of damage but thank God they're as dumb as they are.",
                            "score": 2,
                            "author": "bpeden99"
                        },
                        {
                            "level": 2,
                            "comment": "I know it's fun to believe that everyone on the left is smart and everyone on the right is a hick caricature, but it's not the case. Just like everyone on the right believes everyone on the left is an idiot burnout who doesn't want to work.",
                            "score": 3,
                            "author": "D3vils_Adv0cate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fine by me if the Right keeps voting for people that will pollute their land, cut their services and slash slash social security and Medicare.\n\nIt will only kill them faster, leading to fewer votes for them.\n\nLet them keep loaded firearms stuck between the couch cushions for their children to find and kill themselves with.\n\nLet them have every argument end with one side shooting the other.\n\nLet them shoot every \"trespasser\" through the door so they end up a Felon and can't vote or own guns anymore.\n\nShow me a smart person that votes for allowing guns and pollution to run rampant and I'll stop my list.",
                                    "score": 2,
                                    "author": "Bonesnapcall"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you find an impartial jury for a partisan president in a polarized electorate?",
            "score": 2,
            "author": "psychoalchemist"
        },
        {
            "level": 0,
            "comment": "So he’s getting off. Makes sense.",
            "score": 5,
            "author": "Fair-Sky4156"
        },
        {
            "level": 0,
            "comment": "I'm not familiar with how cases of sedition and treason work. Is it really a case of go grab some local jurors and judge?",
            "score": 3,
            "author": "evrfighter",
            "replies": [
                {
                    "level": 1,
                    "comment": "In Federal Court, the Judge does 95% of voir dire (asking potential jurors questions about bias).",
                    "score": 10,
                    "author": "maebyfunke980"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They’re all bravado but put them in a room where there’s accountability and they will fold like cheap laundry..",
            "score": 1,
            "author": "PDXalreadtused"
        },
        {
            "level": 0,
            "comment": "Didn't nyt get caught on this yet again picking like a local republican party treasurer for this? Totally just your random Floridian.",
            "score": 1,
            "author": "bwillpaw"
        }
    ]
}