{
    "id": "148fxdo",
    "score": 3028,
    "title": "Aileen Cannon should not preside over the Trump trial",
    "author": "nutritionvegan",
    "date": 1686664200.0,
    "url": "https://www.washingtonpost.com/opinions/2023/06/13/judge-cannon-recuse-trump-documents-indictment/",
    "media_url": "https://www.washingtonpost.com/opinions/2023/06/13/judge-cannon-recuse-trump-documents-indictment/",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Based on her terrible rulings and the scolding she got from the conservative 11th Circuit, she shouldn't be a judge at all.",
            "score": 582,
            "author": "Reviews-From-Me",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or even a lawyer",
                    "score": 221,
                    "author": "UserNo24601",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or anywhere near a courtroom",
                            "score": 1,
                            "author": "markca",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "well I am not opposed to her being a defendant if needed",
                                    "score": 1,
                                    "author": "warcin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All these judges were picked by Pence and the Heritage Foundation.",
                                            "score": 1,
                                            "author": "Horrxcdschang1"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; if needed\n\nPretty sure that is already needed.",
                                            "score": 1,
                                            "author": "chron67"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yet here we are.",
                                    "score": 1,
                                    "author": "Interesting-Bank-925"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's an additional bushel of red flags right there.",
                            "score": 1,
                            "author": "Charahnfh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is why I’m not concerned. She’s gonna be on a short leash and if/when she fucks around the justice department will move to have her rescued and they’ll get it.",
                    "score": 1,
                    "author": "apier1on",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's inevitably going to cause delays, which could push the trial too close to November 2024, and then they'll delay it again until after the election.",
                            "score": 1,
                            "author": "Reviews-From-Me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I doubt it. \n\nI think the possibility she’d be assigned the case was accounted for when they decided to indict in Florida. They removed an guaranteed delay by just starting in Florida and all eyes are on Cannon, expecting her to get fucky. I don’t think she will this time.",
                                    "score": 1,
                                    "author": "apier1on",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why wouldn't she? She can't be removed from the bench, so she's beyond culpability.",
                                            "score": 1,
                                            "author": "Fit-Firefighter-329",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Even if she can’t be outright removed from the bench, she can be outright removed from the trial, and unlike the Supreme Court at least, she IS subject to ethics standards. Given the history it would be unwise for her to do anything that would further undermine her credibility if she wants to have any long term career as a federal judge.",
                                                    "score": 1,
                                                    "author": "apier1on",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Witness Congress, with cult followers like MTG, Jordon, Grassley, etc.",
                                                            "score": 1,
                                                            "author": "Lonfndicoo"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Her position as a federal judge is for life. Her long term career will be just fine no matter what happens",
                                                            "score": 1,
                                                            "author": "Mrsensi11x",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "people in positions of power like that are rarely satisfied with what they have at 40 or whatever she is. \n\nmy point is i hope she doesn't have any plans for future advancement in the DOJ because after last year's antics, she's not going to be leaving florida anytime soon. Maybe she can be a newsmax commentator, but that's about it.",
                                                                    "score": 1,
                                                                    "author": "apier1on"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It seems it is in her best interest to recluse herself. Imagine being her, this is a no-win situation as a judge.",
                                                            "score": 1,
                                                            "author": "jaybird1865",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; She can't be removed from the bench\n\nDon't want to 'well akchually' you here, but she certainly can be removed from the bench through the mechanism of impeachment.  Not politically possible at the moment but feasible going forward.",
                                                    "score": 1,
                                                    "author": "skeezyrattytroll",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Of course she can be impeached, but unless Dems have both the House and Senate that just won't happen - and in 2024 the Dems are slated to lose the Senate... That's what I meant.",
                                                            "score": 1,
                                                            "author": "Fit-Firefighter-329"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did you forget how the Mueller investigation turned out?  Through that investigation and its very anti-climactic ending, I think we learned that the DOJ and FBI are not infallible and not as detail oriented or inquisitive as they like to have us believe.",
                                            "score": 1,
                                            "author": "shinyogre",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ahh yes the same DOJ that Barr was appointed to lead and was able to then quash the investigation within 6 month? Something about a memo…sitting president bla bla bla. Just another cover up, nothing to see here…",
                                                    "score": 1,
                                                    "author": "TheLevelHeadedGuy"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, Mueller’s report was “Oh he 100% did it, and is guilty. But we can’t do anything ourselves to a sitting president.”",
                                                    "score": 1,
                                                    "author": "Jimthalemew"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah. Who was president at the time? Remind me.",
                                                    "score": 1,
                                                    "author": "apier1on",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You attribute to skill, expert knowledge, and expert foresight what I attribute to bureaucratic process and systemic constraints.\n\nIt would not surprise me in the least if we learned that Jack Smith and his team are hoping, just like we are, that their case is not ruined by shadow-puppetry and blind faith in process.",
                                                            "score": 1,
                                                            "author": "shinyogre",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "just watch.\n\nyou know how trump's fanboys liked to talk about 4-d chess and how great a strategist he was? \n\nthis is *actual* 4-d chess. trump's goose is cooked.",
                                                                    "score": 1,
                                                                    "author": "apier1on",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This is exactly why he's inevitably going down from at least *something*: the brain drain on the Trump side of things the past few years is very real.   And too many brains on the other side are ready and willing to take him down through any number of cases.",
                                                                            "score": 1,
                                                                            "author": "TheFlappy1"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm glad you are not jaded by past experience.  Maybe you're right.  But I am not optimistic.",
                                                                            "score": 1,
                                                                            "author": "shinyogre",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "it's understandible. especially the last 8 years, things have gone absolutely haywire. trump has been a curse on our democracy. but he didn't get there on his own. he was propped up by..well..take a guess. it wasn't anyone local, if you get my meaning. and right now they're a little preoccupied. \n\nIs it really a shock that things started to really come unraveled after March or so of last year? suddenly a lot of support dried up or got diverted....just saying. Hell you could see it right here on reddit.",
                                                                                    "score": 1,
                                                                                    "author": "apier1on",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": " I also hope for the rest of their careers Barrett, Gorsuch, and Boof will be recognized as Trump justices.",
                                                                                    "score": 1,
                                                                                    "author": "Ficxcdofessi"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "People expected a system to save them from Trump that is incapable of doing that. A republican was appointed to cook the goose of a republican president that enjoyed at times over 90% approval among republicans. A conspiracy involving the Russian federation was meant to produce a smoking gun and a signed confession instead of trying him for nearly anything(the exception being the extortion of Ukraine) he had actually done as president, naturally aided by a supposed opposition party.\n\nIt's like trying to play Xbox with a Sega Genesis controller.",
                                                    "score": 1,
                                                    "author": "MidwestRed9"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Mans just gonna ignore the unredacted Mueller report......\n\nLook at how it was released under Barr's DOJ, and the unredacted version under Garland.\n\nIts not like Mueller still did not immediately recommend impeachment, even after Barr's DOJ defended Trump.",
                                                    "score": 1,
                                                    "author": "ayanarox1"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "A lot of people were of the strong opinion that no charges against Trump were possible to come out of that investigation because of the DoJ policy on not prosecuting sitting Presidents.\n\nIt is my understanding that Mueller was prepared to lay charges but was prevented from doing so by that policy.",
                                                    "score": 1,
                                                    "author": "skeezyrattytroll"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe it’s just me but I don’t think they’d risk holding a trial after the election on the off chance he wins. It’s already a tall order throwing a former president in prison, let alone a president elect. So I think they’ll rush it to try and get a conclusion before the election.",
                                    "score": 1,
                                    "author": "CalculonsPride"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "recused",
                            "score": 1,
                            "author": "sesquiup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Stupid siri",
                                    "score": 1,
                                    "author": "apier1on"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Until he’s found guilty, and she gets to sentence to him to “1 high five, and one middle finger to the US Attorney.”",
                            "score": 1,
                            "author": "Jimthalemew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jury passes the sentence and there are guidelines for just that reason.",
                                    "score": 1,
                                    "author": "apier1on",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you sure? I've been on a jury for several criminal trials. As soon as the verdict comes in the jury is dismissed. \n\nThe judge says, \"I sentence you to...\"",
                                            "score": 1,
                                            "author": "Jimthalemew",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[Congress has established minimum and maximum punishments for many crimes which the judge uses to craft a sentence. The United States Sentencing Commissions has produced a set of sentencing guidelines that recommend certain punishments for certain crimes while considering various factors.](https://www.justice.gov/usao/justice-101/sentencing)\n\nI stand corrected. Jury does not recommend the sentence *in all cases* but it’s still irrelevant as there *are* guidelines and in this case…trump himself signed into law the law that determined the minimum sentence for a felony classified documents crime to be a minimum 5 years and he has what, 37 counts?  \n\nIn any case it’s a moot point. She doesn’t have a say here.",
                                                    "score": 1,
                                                    "author": "apier1on",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The problem is they are sentencing guidelines. Not rules. If she sentences him to too much time, he can appeal on those grounds. \n\nIf she sentences him to too little, or none, the government cannot appeal. Judges are given a wide discretion for sentences.\n\nIf she real is held to the 5 year minimum, and I think she will try to go much much lower, it will be concurrent sentences and house arrest.\n\nAnd if he moves to the White House, he can serve it there.",
                                                            "score": 1,
                                                            "author": "Jimthalemew",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No. They are rules. She can’t just give him 2 days and a high five any more than a judge can give you the chair for shoplifting",
                                                                    "score": 1,
                                                                    "author": "apier1on",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Unfortunately, I believe she's capable of behaving for the sake of the long game, which is sentencing Trump to zero prison time. No one could overrule her if she did that.",
                            "score": 1,
                            "author": "zoupishness7",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; rescued \n\nIt looks like auto-correct bit you here.  From context it seems you meant \"recused\" (challenged for conflict of interest, impartiality, etc, in a legal setting) and not \"rescued\" (saved from a perilous situation).\n\nOTOH, NGL rescued would work here also!  :o)",
                            "score": 1,
                            "author": "skeezyrattytroll",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks dad",
                                    "score": 1,
                                    "author": "apier1on"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Apparently once the trial starts, she can  arbitrarily dismiss the and Trump can't be recharged due to double jeopardy rules.  Ken White was talking about it on the Serious Trouble (paid) podcast last week. It was one of the most concerning things I've ever heard from a rule of law perspective.",
                            "score": 1,
                            "author": "IlliterateJedi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah no she can’t.",
                                    "score": 1,
                                    "author": "apier1on",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok, well, take it up with Ken White, who is a former assistant US attorney and a current defense attorney.",
                                            "score": 1,
                                            "author": "IlliterateJedi",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ken white has an agenda to push. Nothing against that. The pressure needs to be kept up on judge cannon. That’s what will keep her in line.",
                                                    "score": 1,
                                                    "author": "apier1on",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Surely",
                            "score": 1,
                            "author": "CollectionDry382"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;she shouldn't be a judge at all.\n\nIf there is one thing MAGA has taught me, they don't care about qualifications.\n\nMAGA - Lets have teachers without teaching degrees at challenger schools!\n\nMAGA - Let's have a president who can't even get a gaming license in Vegas for a casino.\n\nMAGA - Let's get Marge and Bimbert elected using our vast wealth\n\netc. etc.\n\nMoney and loyalty is all that matters to these sycophants, American Taliban to the letter.",
                    "score": 1,
                    "author": "KatiePorter2024",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a whole class of judges sitting on the bench that are about to have their legacy tarred because they're \"Trump judges\".  You know the guy who sold nuclear secrets to adversary nations for personal gain?  Yeah he thought Cannon would be a good judge.  I also hope for the rest of their careers Barrett, Gorsuch, and Boof will be recognized as Trump justices.",
                            "score": 1,
                            "author": "GhettoChemist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Trump is a traitor and none of his \"judges\" should warm a bench ever again, especially not on the supreme court.",
                                    "score": 1,
                                    "author": "KatiePorter2024"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If half the court had to recuse itself any time Trump gets in trouble, his cases could legitimately look political.",
                            "score": 1,
                            "author": "CalzxsEnthusi",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I live in Vegas.\n\nThat golden tower of a motel is a blight upon the strip.",
                            "score": 1,
                            "author": "LightWarrior_2000"
                        },
                        {
                            "level": 2,
                            "comment": "The only qualification they care about is \"will you be loyal to us\"",
                            "score": 1,
                            "author": "mdp300"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The scolding was not about her close relation to presiding over a case involving Trump; just specificly on her court order. \n\nI do not think this is going to go as smoothly as people think it will.",
                    "score": 1,
                    "author": "alien_from_Europa"
                },
                {
                    "level": 1,
                    "comment": "And, even if he’s convicted, isn’t she in charge of his sentencing? \n\nSo he could be guilty on all charges, and she can say, “Time served. You’re free to go.”",
                    "score": 1,
                    "author": "Jimthalemew"
                },
                {
                    "level": 1,
                    "comment": "My understanding is if she doesn't recuse herself they'll recuse her. Hopefully, she feels like she's embarrassed herself enough on this issue and does it sooner than later.",
                    "score": 1,
                    "author": "SadCommandersFan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aileen Cannon should not preside over any trial.",
            "score": 110,
            "author": "Larkfin",
            "replies": [
                {
                    "level": 1,
                    "comment": "She shouldn't preside over a fuckin Wendys.",
                    "score": 1,
                    "author": "Fire_RPG_at_the_Z"
                },
                {
                    "level": 1,
                    "comment": "10/10",
                    "score": 1,
                    "author": "Lonfndicoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Should” has nothing to do with it, unfortunately. \n\nI’m pretty sure the GOP is well beyond caring about right and wrong at this point.",
            "score": 98,
            "author": "ReadingGoat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hopefully the DOJ planned for this. If they got the case this far and chose the venue, I’m sure they considered the possibility it would land with Cannon.",
                    "score": 42,
                    "author": "hearsdemons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They filed to have the case tried in Palm Beach, and there was a 25% chance of getting Cannon. This is not unexpected.",
                            "score": 1,
                            "author": "v0w",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Im still confused on why they filed it there instead of DC.  I guess they just wanted to increase public perception, but i really doubt this changes a sizable amount of the populations perception of the proceedings. I think having the judge thrown out after they decided to use that court will also remove any of positive perception gained from choosing an area with more trump positive judges and jurors.",
                                    "score": 1,
                                    "author": "ApplicationDifferent",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The crimes in this indictment happened in Florida. However they could still file in DC for additional charges (related to either documents, January 6, or both).",
                                            "score": 1,
                                            "author": "forwardseat"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That is the venue where the crimes were committed. They had no choice",
                                            "score": 1,
                                            "author": "sunnywaterfallup",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not *all* the crimes; just obstruction, sharing documents and perjury.  There is an argument that taking the NARA docs in the first place was stealing from NARA in DC. The documents relating to nuclear secrets weren't even legal for the President to remove from the room and he did not legally have the ability to declassify it while President. \n\nThey said they chose not to jury shop but they absolutely could have.",
                                                    "score": 1,
                                                    "author": "alien_from_Europa",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If they came with him on 1/20/21 he was still president when he arrived in Florida so he was allowed to have the documents",
                                                            "score": 1,
                                                            "author": "sunnywaterfallup",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Show me the legal provision that said he could have nuclear compartmentalized documents at his home just because he was President.",
                                                                    "score": 1,
                                                                    "author": "alien_from_Europa"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I sure hope so. Jack seems like a very “by the books” guy. I hope he did consider this and wasn’t simply following logic and procedure. These people don’t play by those same rules.",
                            "score": 1,
                            "author": "forceblast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The problem with \"by the books guy\" meant he didn't bother to search all Trump's properties and electronic devices unless they were absolutely certain they were there and multiple subpoenas. With evidence of the documents in Bedminster, they absolutely should have done a no-knock warrant. Instead, they sent a subpoena and gave Trump plenty of time to flush or move the documents. There should have been wire taps for the Saudi conversations at Bedminster with Trump. This guy wouldn't take any risk of there was a shear possibility the evidence could be dismissed. And that's a major problem because this guy most likely sold secrets and wasn't *just* a raving lunatic.",
                                    "score": 1,
                                    "author": "alien_from_Europa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s more or less what I’m saying too. \n\nBeing a “by the books” guy is a major disadvantage when dealing with MAGA. You’re fighting in a nice neat line while they hide behind trees and lob grenades (metaphorically speaking of course.)\n\nThat said, this guy prosecutes war criminals so maybe he has less obvious tactics that regular people like us aren’t aware of.  That’s what I’m hoping for anyway.",
                                            "score": 1,
                                            "author": "forceblast"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The fact that George Santos is still a congressman is all the proof you need. They are 1000% shameless.",
                    "score": 1,
                    "author": "forceblast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Convenient how there is a known fraudulent sitting congressman and everyone is \"nice day isnt it\"..  The bar is so damn low now.",
                            "score": 1,
                            "author": "BarbequedYeti"
                        },
                        {
                            "level": 2,
                            "comment": "The fact that the GOP frontrunner for 2024 is the man who ran the most corrupt, incompetent, and cruel administration in modern US history is overwhelming evidence that Republicans no longer care about the rule of law or human life. \n\nThey only care about obtaining and using power to \"hurt the right people.\"",
                            "score": 1,
                            "author": "VanceKelley"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly. This is about what will happen. She will have her hand on the scale for Trump. She won’t stand on it as she did in the civil hearings but her bias will be clear",
                    "score": 1,
                    "author": "sunnywaterfallup"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trump appointment her. If that’s not a conflict I don’t know what is.",
            "score": 184,
            "author": "UtahUtopia",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are too many Trump appointed judges, can't avoid them all.  Two of the 11th circuit judges that overruled Cannon the first time were Trump appointed judges. \n\nThat said, Cannon is a special type of corrupt, one willing to put their career on the line to protect him.",
                    "score": 1,
                    "author": "Sirlothar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they were all ethical, you absolutely could. They would recuse themselves. \n\nThe problem is that they are all likely unethical.",
                            "score": 1,
                            "author": "Throw_away_turd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Literally half of the active 11th circuit judges are Trump appointees.  \n\nhttps://www.ca11.uscourts.gov/eleventh-circuit-judges\n\nIf half the court had to recuse itself any time Trump gets in trouble, his cases could legitimately look political.",
                                    "score": 1,
                                    "author": "Sirlothar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And they look political when he appointed those judges in the district he was committing crimes...",
                                            "score": 1,
                                            "author": "Throw_away_turd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is not exactly how it works, each circuit has a set number of Judges and the President fills vacancies.  \n\nNow of course there was some shenanigans where the Senate delayed the appointment of new judges until there was a republican President in office and allowed President Trump to nominate more then his fair share of judges but that is out of scope of this thread and not really his doing.",
                                                    "score": 1,
                                                    "author": "Sirlothar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I still see issues. \n\nHe probably decided to house and commit his crimes based on where he had the most appointed judges...",
                                                            "score": 1,
                                                            "author": "Throw_away_turd",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So let's play this out.  \n\nHe used to live in NY where he has appointed 5/12 of the judges to the 2nd circuit.  \n\nYou really think he moved to FL just because he appointed 6/12 there?  Let's not get crazy, Trump judges are everywhere across our nation.",
                                                                    "score": 1,
                                                                    "author": "Sirlothar",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't really think it. I look at history...\n\nI know that the \"claimed ultra rich\" will do **anything** to maintain or elevate their status.\n\nEdit: also... WHEN did he live in NY, and WHEN did he live in Florida? I am pretty sure he only *claimed* to not live in Mar a Lago for tax purposes...\n\nEdit 2: so he appointed judges WHERE he *has* lived. That just reinforces my claim...\n\n~~Edit 3: 11/12 appointed judges have been where he HAS/DOES live. What the fuck are you talking about? If they are ALL OVER THE COUNTRY, why are 91.75% of his appointed judges where he lives????~~ \n\n**THE ABOVE IS *DRUNK* MATH, PLEASE DISREGARD** as 11 of 24 appointed judges, not 11/12, were done in states he does or has lived in.\n\nEdit4: even with my drunk messed up math, 45% of the judges, *for those states*, he appointed ~~are in states he lived in...~~\n\nEdit 5: realizing he probably appointed lots more... but that still doesn't change the fact that **he appointed 45% of the judges that reside in states he *has* lived.**",
                                                                            "score": 1,
                                                                            "author": "Throw_away_turd"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Maybe he shouldn’t have done so many crimes.",
                                            "score": 1,
                                            "author": "Haunting-Ad788",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; career on the line\n\nLifetime appointment, so lol, that's not a problem.",
                            "score": 1,
                            "author": "BigTentBiden",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Especially if she waits for the jurors to be empanelled, then dismisses the case entirely.  Trump can never be charged again after that.   \n\nSo if he were to then win the election, she could be rewarded with the highest court appointment he could get her.   \n\nIt's a gamble.  Especially since trump is more inclined to punish disloyalty than he is to reward loyalty.  But honestly, for someone as unqualified as she is, it might be the best chance she has.   \n\nAnd if he doesn't win, she can just be a federal judge for the rest of her life.  A position a lot of people would be *stoked* to have.",
                                    "score": 1,
                                    "author": "amateur_mistake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Especially if she waits for the jurors to be empanelled, then dismisses the case entirely.\n\nAssuming she attempts some sort of unethical corrupt shenanigans, is there any mechanism to revers/avoid it? Appeal the decision to dismiss the case? Disbar/investigate her for corruption? Anything?",
                                            "score": 1,
                                            "author": "MonsiuerGeneral",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well, she could always be removed by impeachment (ha!).  There are various ethical complaints that can be filed.  The higher courts could actively remove cases from her docket (which they don't do as a habit).   She might have a hard time getting a promotion to a higher position because she has a black mark on her record.  \n\nThere have been arguments that federal judges actually have more ways to be removed but none of the people powerful in the current legal system believe them (as far as I can tell).  \n\nAnd once the jury is actually hearing the case, there are tons of ways to dismiss the case so it can never be heard again.   \n\nJust as one example:  There was a case where some police officers were using the court cameras to focus in on the the defense's paperwork, then giving that information to the prosecution.   When the judge found out, they were *pissed* and dismissed the whole case outright.   And the defendant can never be charged again.     \n\nThe judge did not wait for a different trial to prove that an actual crime had been committed.  Or for appeals of that trial.  They saw the evidence and dismissed the thing.    \n\nEdit:  Oh.  And you don't have to be a member of the Bar or even a lawyer to be a federal judge.  So getting disbarred wouldn't remove her from the position.    \n\n  I think you could probably investigate her for corruption but I am *very* skeptical of the idea that the FBI/DOJ should be opening investigations into the judges they have cases in front of.     \n\nLike, would they tap her phone?  The phone of a judge they are presenting in front of?   That's a terrible, dangerous idea.  Because it will instantly be used against poor black people en masse.   \n\nEdit 2:  I want to amend my thinking of investigating judges.  The DOJ should totally do that but it has to be a completely siloed department.   Which they have.   So maybe that group could be looking into it while the Trump people are doing their own things.",
                                                    "score": 1,
                                                    "author": "amateur_mistake"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We'll call her Aileen can'tnon, that'll show her. Surely she'll resign then",
                                    "score": 1,
                                    "author": "MidwestRed9"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But only the trial court judge has the power to enter in a not guilty verdict as a matter of law.\n\nYou can draw a line between the trial court and appellate courts in this matter very easily and reasonably.",
                            "score": 1,
                            "author": "AmateurHippopotamus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ideally, it shouldn't matter who appointed whom. She still had to be approved. I'd say her conduct on the bench is more than enough to cause her removal.",
                    "score": 12,
                    "author": "ResoluteClover"
                },
                {
                    "level": 1,
                    "comment": "Further conflict is that she tried to use her position to halt the same investigation over which she’s now assigned to preside over.\n\nThe judicial system has the obligation of preserving public confidence in the impartial and fair administration of justice\n\nIt is overwhelmingly clear that Cannon cannot do that. The public already knows she’ll put her thumb on the scales of justice in Trumps favor. \n\nShe must be recused from presiding over this case.",
                    "score": 1,
                    "author": "NeverEndingRadDude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why should a judge THE DEFENDANT APPOINTED be allowed to run the show? That there is even a question of this is a major crack in our system.",
            "score": 1,
            "author": "frog_jesus_"
        },
        {
            "level": 0,
            "comment": "If she doesn’t do her job correctly, the nation may end up dying. And if she does do her job correctly, she may end up dying.\n\nHard to think of a more compelling reason for a judge to recuse.",
            "score": 1,
            "author": "AlexFromOgish"
        },
        {
            "level": 0,
            "comment": "It's going to be the Rittenhouse trial all over again, the prosecution will be prohibited from presenting evidence, evidence will come out that the judge is influencing the outcome based on the politics, and the judge will face no accountability for their misconduct",
            "score": 74,
            "author": "throwawsy6667",
            "replies": [
                {
                    "level": 1,
                    "comment": "She was overruled by the appeals court last time with trump and lost jurisdiction over his trial.  It’ll happen again. Not sure why people think she will actually remain his judge. There’s no chance",
                    "score": 1,
                    "author": "dyerej93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because despite already being appealed and taken jurisdiction again she's right back at it like nothing happened. You'd think that the first time was enough to ensure that she wasn't allowed to come near it again, but here we are.",
                            "score": 1,
                            "author": "NK1337"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s a travesty of justice.",
            "score": 7,
            "author": "Aretirednurse"
        },
        {
            "level": 0,
            "comment": "Let's be honest. All these judges were picked by Pence and the Heritage Foundation. Do think Trump could/would read everyone's resumes?",
            "score": 1,
            "author": "TheIrishbuddha",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really McConnell",
                    "score": 1,
                    "author": "PDXftw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Cannon's case, Rubio, according to her Wiki\n\n&gt;In June 2019, the office of Senator Marco Rubio indicated to Cannon that he was considering her for a position of United States district judge. Cannon expressed interest that month, and subsequently was interviewed by representatives for Senator Rubio and Senator Rick Scott, as well as White House and Justice Department legal officials",
                            "score": 1,
                            "author": "gizzardgullet"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Two birds with one stone, Trump and Cannon?",
            "score": 5,
            "author": "RangeMoney2012"
        },
        {
            "level": 0,
            "comment": "Corrupt as hell. How is this even possible? Who decided that it would be her?",
            "score": 1,
            "author": "FaustVictorious",
            "replies": []
        },
        {
            "level": 0,
            "comment": "She has shown that she can’t do her job and remain impartial and follow the law when it comes the orangutang criminal",
            "score": 1,
            "author": "Vetruvian01"
        },
        {
            "level": 0,
            "comment": "Aileen Cannon is an embarrassment to the US judicial system. A pathetic little Trump fuck toy. A lot like Pence.",
            "score": 1,
            "author": "katuutaq",
            "replies": [
                {
                    "level": 1,
                    "comment": "She's a Q lunatic.",
                    "score": 1,
                    "author": "BotZapper98K"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Her own education and understanding of the law betrays her🤔",
            "score": 1,
            "author": "Ok_Percentage5092"
        },
        {
            "level": 0,
            "comment": "Didn’t it come out that a Magistrate was going to\noversee the process instead of her? Am I going crazy? 😂",
            "score": 1,
            "author": "SockFullOfNickles",
            "replies": [
                {
                    "level": 1,
                    "comment": "The court magistrate is going to preside over the arraignment but not that case itself. It is a bit confusing.",
                    "score": 1,
                    "author": "PDXftw"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I expect she’ll fuck around and find out…again. What worries me is that she’ll fail to protect the identity of jurors, leaving them wide open to harassment and threats.",
            "score": 1,
            "author": "GraceMDrake"
        },
        {
            "level": 0,
            "comment": "She wouldn't recuse herself even if she was caught humping a Tump inflatable doll right there on the bench in front of the jury.",
            "score": 1,
            "author": "AsparagusTamer"
        },
        {
            "level": 0,
            "comment": "Am I the only one who thinks Jack Smith and his team are setting her up to be disbarred/forced resignation?  \n\nI don’t know shit about fuck in legal worlds but the fact that they kind of requested her makes me think they planned for her. \n\nI don’t know though.",
            "score": 1,
            "author": "taddymason_76",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was initially skeptical of yet another Special Counsel but after finding out who Jack Smith was, it restored an iota of hope. He doesn’t seem to be the type to fuck around.",
                    "score": 1,
                    "author": "SockFullOfNickles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My reading about him and reading the indictment has made me pretty sure that Mr. Smith is not much about 'fuck around'.  He seems to be very much more about 'find out'.\n\nAs our former president is going to learn going forward.",
                            "score": 1,
                            "author": "skeezyrattytroll",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really hope so. There are mechanisms above Jack Smith that need to fire properly in order for there to be true accountability. If they shit the bed and let him off, I fear for the civil unrest it will cause.\n\nWe already have a huge credibility issue amongst the government right now. This would be the last nail in the coffin.",
                                    "score": 1,
                                    "author": "SockFullOfNickles"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve said this a lot but I’m confident Smith has planned for all contingencies, including this.",
                    "score": 1,
                    "author": "RegattaJoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember hearing this same sentiment when it came to Mueller.",
                            "score": 1,
                            "author": "Lokito_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mueller never filed an indictment and prosecution was never an option.",
                                    "score": 1,
                                    "author": "RegattaJoe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Am I the only one who thinks Jack Smith and his team are setting her up to be disbarred/forced resignation?\n\nYes. Federal judges are set for life, no one can force her to do shit.",
                    "score": 1,
                    "author": "BabettesBeast"
                },
                {
                    "level": 1,
                    "comment": "&gt; they kind of requested her \n\nNot really.\n\nThe indictment has to be brought in the jurisdiction where the alleged crime occurred.  \n\nThe Magistrate Judge conducting the arraignment today is the same one that issued the Mar-a-lago search warrants because that is standard operating procedure in the federal system.\n\nJudge Cannon, who is currently assigned to hear the cases, has previously handled this case (for which she was rebuked by the Special Master she appointed and by her appellate court for exceeding her authority in making the appointment).  Once again, by standard procedure, she was assigned this case because she has previously handled it.\n\nSmith and his team did not request her in any sense other than that by laying the charges in Miami they get her by default due to court policy.  \n\nHer assignment is not at all a 'bad thing'.  Either she will recuse herself, or the appellate court above her will recuse her and assign the case to another judge, or she will commit an error egregious enough for the prosecution to force her removal.\n\nOr, perhaps, she will actually conduct the trial fairly and without favoritism.  If she expects any kind of future on the federal bench beyond the next Democratic Congress' ability to impeach her then either this or self recusal is her best bet.",
                    "score": 1,
                    "author": "skeezyrattytroll",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i also see a benefit in the defendant not being able to complain about how the judge has been rigged against him (at least for now). maybe this could be like fox calling the election",
                            "score": 1,
                            "author": "the_atmosphere"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The approach of prosecution is not to object based on who appointed the judge or past rulings, but on actions taken by the judge during the trial. There are going to be Biden appointees in future trials and asking for a preemptive recusal will set a dangerous precedent. Remember, the judge is supposed to recuse themselves, not be asked to. Forcing the judge to make an unfair ruling also sets up grounds for appeal, since this is going to the supreme court whatever happens.",
            "score": 1,
            "author": "gerbil_111"
        },
        {
            "level": 0,
            "comment": "If the defendant is your diety you have a conflict.",
            "score": 1,
            "author": "Subject_Condition804"
        },
        {
            "level": 0,
            "comment": "Fire the Cannon!",
            "score": 1,
            "author": "BuffaloWilliamses"
        },
        {
            "level": 0,
            "comment": "We need a law that judges must recuse themselves from cases involving the person who appointed them to their position.",
            "score": 1,
            "author": "e9tjqh"
        },
        {
            "level": 0,
            "comment": "She's already making statements about what a historic trial it will be.  That's an additional bushel of red flags right there.",
            "score": 1,
            "author": "MissDiem"
        },
        {
            "level": 0,
            "comment": "Any judge nominated or confirmed by any elected official should be recused from presiding over any portion of any case against or brought by those elected officials.",
            "score": 1,
            "author": "epidemica"
        },
        {
            "level": 0,
            "comment": "She looks like she secretly vapes in her chambers",
            "score": 1,
            "author": "Iwanttowrshipbreasts"
        },
        {
            "level": 0,
            "comment": "But she will.",
            "score": 1,
            "author": "gentleman_bronco"
        },
        {
            "level": 0,
            "comment": "I dont see how any judge appointed by Trump should not be disqualified for conflict of interest",
            "score": 1,
            "author": "warcin"
        },
        {
            "level": 0,
            "comment": "She should be trump’s attorney, and then not get paid or be thrown under the bus by Trump, then she will be complete.",
            "score": 1,
            "author": "Greenmoutain"
        },
        {
            "level": 0,
            "comment": "There are photos of her in full blown MAGA gear (with face paint like a fucking child at the carnival). In no way is she remotely impartial/sane.",
            "score": 1,
            "author": "T1Pimp",
            "replies": [
                {
                    "level": 1,
                    "comment": "That photo isn't her. I think she sucks for many reasons, but it was taken at a Pennsylvania rally in 2022. The woman in that picture looks older than cannon, has different hair, jawline and nose.",
                    "score": 1,
                    "author": "forwardseat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She will fuck around and find out yet again that the DOJ has lawyers that are twice as sharp as she is,and the slap down will only help their case in the court of public opinion same as the Special Master fiasco did.",
            "score": 1,
            "author": "jertheman43"
        },
        {
            "level": 0,
            "comment": "After being shown some of the pictures of her I've seen on here, it shouldn't be hard to convince someone in charge she holds significant bias.",
            "score": 1,
            "author": "cohray2212",
            "replies": [
                {
                    "level": 1,
                    "comment": "What the heck does a photograph of her face tell you??",
                    "score": 1,
                    "author": "lex99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sadly, there is a hoax meme circulating with a photograph of a woman in full MAGA gear and facepaint that people are saying is Aileen Cannon.  \n\nIt's (probably) not true.  At best, it's unverified. \n\nHowever people who know her and her track record and if you've heard her and know her warped interpretation of her own story, you'd be very scared that she is indeed woefully underqualified and dangerously biased.\n\nShe's one of the young federalist society alt right wing nuts.  I've known many with a similar story.  She takes her family's history with cuba's and Colombia's regimes and has driven her straight into the fraudulent arms of hard right myths about communism and 'merica.  She has inherent distrust of traditional government.  Three guesses why the MAGA complex slammed her into her first judge job AFTER Trump had already been defeated by Biden...\n\nWe've seen how her lack of legal knowledge caused her to foolishly fall for the absurd \"executive privilege\" hoax, and now she's trying a complex espionage case?  Be very afraid.",
                            "score": 1,
                            "author": "MissDiem",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, I know for sure that she will be a disaster on this case.\n\nI only meant: if the comment was just about her face (not the face-paint thing), that'd be ridiculous.",
                                    "score": 1,
                                    "author": "lex99"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I didn't say anything about her face...? \n\nI was talking about the photo of her wearing a white cowboy hat with TRUMP printed on it while wearing American flag facepaint. \n\nWhy the fuck would a photo of a woman being a normal judge bring credibility into question? Is there some push bring sexism into this that I'm unaware of? Why am I being bombarded with persecution fetish nonsense?\n\nI mean... yeah, women don't belong in the workforce and they certainly shouldn't hold positions of judicial power but that has nothing to do with why I think she's biased. I actually quite enjoy women, nothing against them in general. So long as they keep quiet and stay out of men's business. /s",
                            "score": 1,
                            "author": "cohray2212"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's funny - any time a woman enters a conversation in politics/news, the proportion of comments discussing the person's appearance suddenly soars. Her appearance is fucking irrelevant. Find real reasons to critique women you don't like.",
                    "score": 1,
                    "author": "frog_jesus_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Haven't they already announced a magistrate will run the hearing? I didn't think she's involved now.",
            "score": 1,
            "author": "dimechimes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay so I’m not fully crazy! I also saw the mention of a Magistrate overseeing the process instead.",
                    "score": 1,
                    "author": "SockFullOfNickles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A magistrate is overseeing the arraignment today. Cannon is the trial judge",
                            "score": 1,
                            "author": "Drofmum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahhhh I see. I’m curious to see what tricks the DOJ has up their sleeve to deal with her. If she steps out of line, they won’t fuck around.",
                                    "score": 1,
                                    "author": "SockFullOfNickles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What power do they have to do a damn thing about it?",
                                            "score": 1,
                                            "author": "frog_jesus_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If she doesn’t act appropriately, there are mechanisms in place to hold them accountable. They can hit her with judicial misconduct via formal complaint, and they could go so far as to hit her with obstruction charges if it’s bad enough.\n\nI’m not a lawyer, but this is the DOJ we are talking about. They have weapons at their disposal that the average person does not. I’m going to look into exactly what those weapons are though once I get to my lunch break.",
                                                    "score": 1,
                                                    "author": "SockFullOfNickles"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Judge will ignore the evidence, proclaim Trump innocent, and his fans will gloat -",
            "score": -1,
            "author": "HasNoMouthButScreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trump's Lifetime Presidency is pretty much assured at this point. His disciples will see this as his triumph over the forces of woke, and God's smile of approval.",
                    "score": 1,
                    "author": "DangerousBill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[well, she's not](https://www.miamiherald.com/news/politics-government/article276328096.html)\n\nseriously, how is this news? she's still the lead judge on paper but is not presiding over the arraignment. such shoddy reporting",
            "score": 1,
            "author": "CandidateDecent1391",
            "replies": [
                {
                    "level": 1,
                    "comment": "The article isn't talking about arraignment.",
                    "score": 1,
                    "author": "CaptainNoBoat",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "First of all, this isn't \"news\", it's an opinion article, which you would have been able to tell if you'd clicked on the link at all since it says in huge writing next to the headline: \"OPINION\".\n\nSecond, Cannon *is* currently presiding over the trial; there's just a magistrate currently handling the arraignment (which is just one small aspect of the pre-trial and not the trial itself).",
                    "score": 1,
                    "author": "LouCage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did this same clown judge out of thousands of available judge get another trump documents case?",
            "score": 1,
            "author": "spacegamer2000",
            "replies": [
                {
                    "level": 1,
                    "comment": "this isn't some crazy random coincidence - DOJ chose to indict in her district, and based on how judges are assigned, it was essentially a 50/50 shot it was going to be her.  there is no way they didn't take this strong possibility into account.  i certainly don't know their thinking, but it will be interesting to see how it plays out.",
                    "score": 1,
                    "author": "awesometakespractice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree.  I strongly suspect Jack Smith has planned for all contingencies.",
                            "score": 1,
                            "author": "RegattaJoe"
                        },
                        {
                            "level": 2,
                            "comment": "My hope is that Mr. Smith is trying to give Judge Cannon as much rope as she needs to hang herself. (figuratively of course)",
                            "score": 1,
                            "author": "snakebite75"
                        },
                        {
                            "level": 2,
                            "comment": "The DOJ has shown themselves to be completely unwilling to charge Trump with anything. It's only because Trump can't fucking stop being a criminal that they're putting on this circus show to pretend they tried. Trump is not going to see the inside of a cell and the DOJ is seeing to this with these maneuvers.",
                            "score": 1,
                            "author": "reddeadspoon"
                        },
                        {
                            "level": 2,
                            "comment": "My understanding is that the case lands on her bench because she has handled elements of it previously.  Ditto why the Magistrate Judge that authorized the search warrants is the one conducting the arraignment this afternoon.",
                            "score": 1,
                            "author": "skeezyrattytroll"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is kinda nice that Trump isn’t trashing the judge and their family.  If it was literally anyone else, Trump and his minions would be doing everything possible to make their life hell.",
                    "score": 1,
                    "author": "FunkJunky7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well folks we tried",
            "score": 1,
            "author": "ConfidentVisit4629"
        },
        {
            "level": 0,
            "comment": "Waaa",
            "score": 1,
            "author": "CareerVarious4463"
        },
        {
            "level": 0,
            "comment": "Oh someone he appointed who is clearly a cult nutcase shouldn’t preside over his criminal trial?",
            "score": 1,
            "author": "Haunting-Ad788"
        },
        {
            "level": 0,
            "comment": "You guys don't get it... SHE IS presiding over this arraignment, [and given Trump's Legal team's strategy today to dismiss the case](https://twitter.com/paulsperry_/status/1668422446720983042), She most certainly can just dismiss it if she feels like it - despite what rebuking and backlash she may receive, because a dismissal in this case is NOT appealable!  \nAs much as I hate this to every core of my being, the likelihood this guy walks is extremely high :(",
            "score": 1,
            "author": "ssabripo",
            "replies": [
                {
                    "level": 1,
                    "comment": "John Goodman, a magistrate judge, is presiding over today's arraignment.  Cannon is the lead judge for the trial.",
                    "score": 1,
                    "author": "arkaine23"
                },
                {
                    "level": 1,
                    "comment": "This... Is misinformation",
                    "score": 1,
                    "author": "Simple_Opossum"
                },
                {
                    "level": 1,
                    "comment": "The magistrate is presiding over the arraignment, not cannon. Shes on for the trial tho",
                    "score": 1,
                    "author": "NANUNATION"
                },
                {
                    "level": 1,
                    "comment": "&gt; arraignment\n\nif she's dismissing this case Imma lose my shit",
                    "score": 1,
                    "author": "cctwa"
                },
                {
                    "level": 1,
                    "comment": "[Judge Aileen Cannon will not be presiding over the arraignment.](https://www.miamiherald.com/news/politics-government/article276328096.html) The case is appealable using [rule 29's 1994 amendment](https://www.law.cornell.edu/rules/frcrmp/rule_29#rule_29_c).\n\n&gt;Magistrate Judge Jonathan Goodman — not U.S. District Judge Aileen Cannon, who was randomly assigned Trump’s case — will be handling the former president’s arraignment and bond matters.\n\n***\n&gt; ... it should remove the dilemma in those close cases in which the court would feel pressured into making an immediate, and possibly erroneous, decision or violating the rule as presently written by reserving its ruling on the motion.\n\n&gt;Thus, the government's right to appeal a Rule 29 motion is only preserved where the ruling is reserved until after the verdict.",
                    "score": 1,
                    "author": "notwormtongue"
                },
                {
                    "level": 1,
                    "comment": "You're very much mistaken.  \n\nThe arraignment is a procedural formality, and she's not involved in it.",
                    "score": 1,
                    "author": "MissDiem"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She's so excited though to see her god and savior Jesus Trump and to help him break free of this legal mess... \"Like Jesus, Donald John Trump is an imperfect man, but still annointed by God Himself.\"",
            "score": 1,
            "author": "Fit-Firefighter-329"
        },
        {
            "level": 0,
            "comment": "Of course not.",
            "score": 1,
            "author": "keyjan"
        },
        {
            "level": 0,
            "comment": "Judges arent impartial????",
            "score": 1,
            "author": "anonict"
        },
        {
            "level": 0,
            "comment": "how does someone with such an obvious double-entendre nickname (\"loose\") make it this far behaving this way in the first place\n\nfuckin murkaaa",
            "score": 1,
            "author": "unpossabro"
        },
        {
            "level": 0,
            "comment": "It seems like the only photo we have of her is this one where she looks like a crazy lady promoting Ivermectin on Truth Social.",
            "score": 1,
            "author": "DolphinsBreath"
        },
        {
            "level": 0,
            "comment": "Fucking obviously.",
            "score": 1,
            "author": "charade_you_are"
        },
        {
            "level": 0,
            "comment": "Wasn’t she already ruled out yesterday?",
            "score": 1,
            "author": "Charming-Chard7558"
        },
        {
            "level": 0,
            "comment": "How is she even an option?",
            "score": 1,
            "author": "Artistic-Cannibalism"
        },
        {
            "level": 0,
            "comment": "Americans can't have a reasonable sense of legitimacy and fairness in the trial so long as she remains.",
            "score": 1,
            "author": "Paperdiego"
        },
        {
            "level": 0,
            "comment": "Her not being involved in the Trump trial makes too much sense.  Thus won’t happen",
            "score": 1,
            "author": "VegetableYesterday63"
        },
        {
            "level": 0,
            "comment": "No shit Sherlock. She should not even preside over a kindergarten much less a trial.",
            "score": 1,
            "author": "SpankMyButt"
        },
        {
            "level": 0,
            "comment": "She’s not qualified to run Night Court….",
            "score": 1,
            "author": "DanielCedar"
        },
        {
            "level": 0,
            "comment": "Prior to the American Civil War the judiciary was politicized to the point literally state backed armed conflict. They were upholding a way of life.",
            "score": 1,
            "author": "SeaSuch2077"
        },
        {
            "level": 0,
            "comment": "In other news, the sky is blue and water is wet",
            "score": 1,
            "author": "annaleigh13"
        },
        {
            "level": 0,
            "comment": "She won’t care, she is trying to ride absolute loyalty to a Supreme Court seat.  She has her current position for life so she can only really go up from here",
            "score": 1,
            "author": "Cactusfan86"
        },
        {
            "level": 0,
            "comment": "the justice department will move to have her rescued and they’ll get it.",
            "score": 1,
            "author": "Horrxcdschang1"
        },
        {
            "level": 0,
            "comment": " If that’s not a conflict I don’t know what is.",
            "score": 1,
            "author": "Lonfndicoo"
        }
    ]
}