{
    "id": "148i0qn",
    "score": 509,
    "title": "Biden edges Trump and DeSantis in poll, but voters are looking around",
    "author": "newnemo",
    "date": 1686670097.0,
    "url": "https://www.usatoday.com/story/news/politics/2023/06/13/biden-trump-desantis-2024-poll-third-party/70310496007/",
    "media_url": "https://www.usatoday.com/story/news/politics/2023/06/13/biden-trump-desantis-2024-poll-third-party/70310496007/",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Phrasing.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Are we not doing that anymore?",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Said Ripley to the android bishop.",
                            "score": 1
                        },
                        {
                            "level": 2,
                            "comment": "Edging? I don't know if we've moved on from that. But the article is about polls. Something about poll smoking I think.",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "r/blink182",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Puts a whole new meaning to the phrase \"bipartisanship\"",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Came here to say this lmao",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; 23% say they would support an unspecified independent contender\n\nThe advantage of an unspecified contender is that you can assume they believe all of the things that you believe and none of the things you find objectionable. That's why generic opponents often poll unreasonably high.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, Bernie and Mitch would fall under the same 23% as a \"unspecified independent contender\"",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember in 2020 trying to explain to a socialist friend that \"independent\" can mean anything from communeist to facist, and vorintng 3rd party in any race larger that county-wide is a wash at the moment.  \n\nThe rise in youth invovlement and rank-choice voting will hopefully change that.",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Almost every person I know in my generation (Z/late Millennial) are on board with or at least open to participating in elections and specifically ranked choice voting, it’s very reassuring. Alaska and Maine should be only the first among many, if all goes well.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Horse-race journalism is a disservice. It was never useful and it is practically malpractice at this point.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Nate Silver would like a word…oh, nevermind.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty common result for polls this early.  Lots of people aren’t really engaged and say they’re undecided or looking for a 3rd alternative and then come back to either the Republican or Democrat closer to the election",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup let's circle back in a year because any poll before July '24 is basically pointless. Only pols are paying attention right now, and in one year's time when normal folks start clocking in I'm going to take a wild guess and say the reasonable moderate incumbent is going to be looking more appealing than some reactionary facing 100 years in prison",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "I agree.  Polls are fairly useless at this point.  That being said, the media has focused so much on DeSantis and Trump that one inclusive of Biden was interesting, for me at least, particularly since he has a slight lead.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But take a look at what both Trump and DeSantis have been doing and saying.  And the shit that the GOP has been doing in general.  I don't think it says that much about Biden that he's ahead. If I have to pick between insane and sanity I'll pick sanity. That  doesn't mean I actually support him so much as the other candidate scares the fuck out of me. \n\nI really think at this point that's where we are when picking between Biden and whoever is the GOP nominee.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People don’t want Biden but they want Trump and DeSantis even less.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "The #1 reason they don't want Biden is because he is old.  That shouldn't be a reason to allow a traitor to be elected.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's too old and he screwed up on reproductive rights and police reform. Those are the biggest complaints I hear about him. As soon as Biden thought it was a brilliant idea to try and nominate anti-choice nutjob Chad Meredith to a **lifetime** federal judicial seat he landed straight on my shitlist. Roe got repealed because religious fanaticals like Meredith rose through the judiciary.  \n\nThat is not an action someone would even consider if they actually cared about reproductive rights. It says a lot about him.",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;He's too old\n\nSo elect a fascist?\n\n&gt;Biden thought it was a brilliant idea to try and nominate anti-choice nutjob Chad Meredith\n\nThere were rumors of Meredith being nominated to push more pro-choice judges through as part of a deal with McConnell but this never happened.  The Supreme Court overturning Roe had nothing to do with Biden and everything to do with electing a fascist in 2016.\n\nBut if you don't want to elect a fascist in lieu of Biden, who is your viable nominee by name?",
                                    "score": 1
                                },
                                {
                                    "level": 3,
                                    "comment": "I was skeptical about him, but 3 years in I really don't have too many complaints. He's kept it quiet, shrugged off the drama, did his job, and he's been a relatively good representative. I would love to have had more \"tax the rich\" policies and a bit more aggressive student debt cancelation, but all in all he's done well. Obama pulled some rather large controversial moves in his 2 terms but Biden hasn't so much yet.\n\nI rather wish he would just step down and endorse our next best candidate, but I'd most definitely vote for him again if there is not another democratic contender.  \n\n\nEdit:  \n\n\nJust to add, other notable things he's done is make a good push to jumpstart industry (and it's working), supporting Ukraine, and his administration is staying on top of technological advances instead of reacting to them as they develop (EVs, AI, etc).   \n\n\nI would really love to see someone push for a military budget audit. We have a massive leak there that needs fixed.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That it's even close shows how pathetic America has gotten.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah.  I'm not saying Biden is anything special, but we should be able to run a jar of expired mayonnaise and have it polling way above Trump.  The closest thing that man has to a redeeming trait is his incompetence; how *bad* he is at getting what he wants done.  If it weren't for more-competent enablers all over him he'd never accomplish anything.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Biden is actually more accomplished than Obama was.  He impressed me.",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hear you and generally agree, but saying that always results in a fight and simply wasn't relevant to my greater point - nearly any candidate is miles above Trump.",
                                    "score": 1
                                },
                                {
                                    "level": 3,
                                    "comment": "Someone posted a list of everything he's done and it was massive. Wish I screencapped it.",
                                    "score": 1
                                },
                                {
                                    "level": 3,
                                    "comment": "Which is why it bothers me so much that he screwed over the Rail workers the way he did. \n\nHe has my vote if he’s the democratic nominee.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I definitely hope he's going to stick around to be the right wing's lightning rod for stupid bullshit freakouts but step away at the end for someone younger/more palatable but left.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He’s the most progressive president we’ve had in decades. He’s not “exciting”, but has accomplished quite a lot. Especially when you consider the very slim majority in congress.",
                            "score": 1
                        },
                        {
                            "level": 2,
                            "comment": "What does this tell you about Biden as a candidate?",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That he's been the target of conservative smear campaigns for years.  Same as Clinton.\n\nHe's actually been quietly and unremarkably competent, getting an enormous amount done in the face of massive obstructionist behavior.\n\nI'm aware Republicans would say the same about Trump, but that doesn't really hold water in the face of him inciting an insurrection, stealing nuclear secrets, paying hush money to porn stars, etc.\n\nAnd if you believe for a split second that Trump had enough of a case to indict Hillary and/or Biden while he was in office but elected not to do so then I have a bridge to sell you, buddy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't know or care about what Trump did or didn't have on Clinton. I know that when Trump was president my family received thousands of dollars in direct payments. That ended when Democrats took over.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;That ended when Democrats took over\n\nDid you turn down the stimulus checks issued under Biden or something?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There was $2000 promised that was reduced to $1400 and that was back in 2021.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ah, in that case the people you want to be mad at are [Republicans](https://www.newsweek.com/why-joe-bidens-stimulus-checks-will-1400-not-2000-1561613).",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Wait which political party had full control of the federal legislature from January 2021 to January 2023?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Ah yes, reality makes you sad so you move the goalposts.  As a conservative, you're more or less what I expected.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Polls this far out are basically useless",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "You see it in the comments all the time about Biden.  (Presumably) Democratic leaning voters dismiss him for being old but they have no electable alternatives in mind at the same time.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Biden edges Trump\"",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "That's hot",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "But will he finish him off in the end?",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It will be some climax, come 2024",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\\*Cum 2024\n\n\\#ruinedorgasm",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a friendly reminder here that the last few Presidential elections have been decided by less than 5% and a whopping 40% of eligible voters don't vote. Of Republican voters, Democratic voters, and non-voters, non-voters are the largest group.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "^\n\n&gt;In a potential rematch of the 2020 contest, Biden is backed by 34% and former president Trump by 32%; 23% say they would support an unspecified independent contender. In a choice between Biden and DeSantis, Biden leads the Florida governor by 33%-26%; 25% indicate they would vote for a third-party candidate.\n\n&gt;The findings underscore both how close the race for the White House continues to be and how dissatisfied many voters are with their most likely choices. Support for independent candidates typically fades as elections near, but at the moment interest in voting beyond the two major parties is historically high.\n\n&gt;No third-party candidate has managed to get as much as 20% of the national vote since former president Teddy Roosevelt was the Progressive Party nominee in 1912.\n\narticle continues....",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Virtually no one is voting for a third party candidate. Certainly, less than 10% will, and most likely it will be fewer than 5%.\n\nIn any event, I think that the age of polling as we've known it is over, perhaps for good.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Obviously, those third-party numbers aren't likely to hold up and most people will eventually pull the R or D option, but it really is remarkable just how unpopular the current R and D options are.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; it really is remarkable just how unpopular the current R and D options are.\n\nThe politician you have in reality is almost always disappointing when compared with the hypothetical charismatic politician who shares all of your own views and has yet to compromise or fail in anything.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "To be fair, a RINO or progressive candidate would be even more unpopular, seeing how cultish Republicans are and centerist Democrats are.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "No I'm not. But I'm also not willing to participate in a poll.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "What kind of chance does Chris Christie have? He can speak in coherent sentences and is a Trump-hater, even if he did come late to that opinion. I’d say he has a better chance than Pence.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Trump already humiliated him in 2016, made him beg for a job, and then turned him down.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "He *should* be far and away the leading R candidate for sane Republicans.   So of course, he doesn't have a shot.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shouldn’t be close, a traitor and an old guy still smart enough to outplay republicans..",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Somehow those headline is so worrying. I will never understand how he is only just above them.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "A broken toaster oven would beat those clowns. If Biden can govern at least as well as a broken toaster oven, then I guess I have my answer.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "People answering the poll still show some preference for a 3rd party candidate.  However, lets face it.  Biden will be the Dem candidate, and Trump may well be the GQP candidate (unless the MAGAs have learned their lesson).\n\nIs there any other \"reality\"?  \nWell, it is still a bit early ... and a younger / \"attractive to both parties\" person might be found ... but there is definitely no agreement yet!",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "They're both pretty old and could die any day now\n\nThat's what they used to say about McCain when he was 71, so I assume it's fair to say about a couple of octogenarians",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would love a younger moderate Democratic choice but until I get one I'll choose Biden over authoritarians any day of the week.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "They can look around in 2028.  And hopefully they vote instead of complain.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "The choice is pretty fucking simple: Democracy or fascism.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "4 more years of Biden 👍🏻",
            "score": 1
        },
        {
            "level": 0,
            "comment": "These polls are dumb. The poll is from 1000 voters. The population of the US is 330,000x that amount. Not that they are all eligible and registered voters, but 1000 people is literally nothing, even when comparing it to one state’s population..",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "A sample size of 1000 is pretty common in polling.  As long as the polling is done on a representative random sample, it leads to an approximately 3% margin of error.  So if one candidate is polling at 40%, you can be reasonably certain (95% Confidence Interval) that their actual support is between 37%-43%.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden is only starting to campaign. They've been going for a while. Wait until he gets rolling and talks about the policy he's passed versus what David 6 and Trump have been up to",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Edges? Really? The corporate news media has successfully propped up republicans in order to keep the polls close, which then stimulates even more political advertising dollars.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Gov Walz from MN should run for president.  Biden is just too old.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Horse race journalism.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "It's sad that Americans can't come up with better choices",
            "score": 1
        },
        {
            "level": 0,
            "comment": "1-2% Biden win in the popular vote would result in a 100 vote electoral win for the GOP.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Biden take a retirement, Dems put anyone under 60 as candidate and collect 200. No needs the extra grandpa drama jfc",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Good. I’d vote for him against any republicans but he’s too old. I wish it could be Bernie but he’s in the same boat. Dems need young blood in the race.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Biden’s been the best president we could hope for. Yea he’s old, but god damn. A master class in avoiding a recession after Covid and trumps three day old diaper of a presidency. He’s got my vote.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Can we please please get anyone under 60 at least?",
            "score": 1
        },
        {
            "level": 0,
            "comment": "&gt;Biden edges Trump and DeSantis\n\nGo on",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I know, I know, it's way too early for polls to be anywhere close to accurate, but...\n\nThese numbers demonstrate one of the problems we face.  If those numbers were to hold true and some \\*sshole 3rd party gets that 23%/25%, that would result in Trump or DeSantis becoming President.  With our system, unless you get 270 electoral votes, it goes to the House which has one vote per state which selects between the top two electoral counts, which favors the GOP.\n\nWe really need to slap some reality into those on the left who may end up voting for an outcome that's against their self-interests or not voting at all.\n\nAnd again, while the polling is early, the current reality is that fundraising and announcements have already begun and damage is already being done.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s always the Left that you condescend to in comments about voter turnout, when it’s widely accepted that Independents influence elections the most. Take that bullshit trope elsewhere. \n\nThere are hundreds of thousands of people out there who just might vote for the GOP candidate so that there’s “balance” in Washington. Spare me the vilification of voters on the Left and go more into “Why aren’t the Dem politicians making themselves more attractive for the average voter.”",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It has been known for generations in political science circles that independent voters are a myth.  This is generally people lying to pollsters and/or themselves while voting mostly one party.  \n\nIt is more about which side gets their 'unlikely' voters to turnout that influences elections.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biden can edge me too. Seriously silver daddy woof woof",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Wait until they restart the student loan payments, and Trump is able to run against it by truthfully saying \"I suspended student debt payments and Biden restarted them\"",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "If that makes someone want to vote for fascism then we are fucked.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hundreds of dollars a month is worth A LOT to people that live paycheck to paycheck. And Trump was already the POTUS once, and the sky didn't fall. I don't know that you are gonna get any traction at all with the 'omg fascism' nonsense.",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You don’t have a problem with him committing all of the crimes laid out in the indictment? So much for the party of law and order.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't belong to either political party and no I really don't care about classified documents at all. Didn't care about Clinton's emails either. I do care about housing, wages, unions, healthcare, etc but I guess Democrats are too busy to address any of that, with all the money they need to funnel to Ukraine or whatever.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you want trump to be president as you said in another comment you are a republican voter. Republicans have voted against every single bill that would help with those things but keep blaming democrats.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What comment was this? lol I don't care who is president as long as they put money in my pocket. There was no difference in my life between Bush, Obama, Trump, or Biden being POTUS except for the stimulus checks I got under Trump.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Despite Bide doing everything he could to suspend them and the Trump Supreme Court and the GOP doing everything it could to restart them.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Biden made this deal! He agreed to it! And he has a history of wanting to make student debt as onerous as possible! He's literally the person responsible for this debt not being dischargeable in bankruptcy!",
                            "score": 1
                        },
                        {
                            "level": 2,
                            "comment": "Everything he could, eh? I call bullshit on that. He literally agreed to all of this. The GOP finessed the shit out of his Administration on the debt ceiling negotiations. The Dems are now ON RECORD voting to cut social programs.\n\nJust wait until they cave when social security and Medicare are on the chopping block. It will be the second time it’s happened in my lifetimeS",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "George Clooney for President!",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Why not! 🤜🏻🤛🏻",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "It just goes to show you that the people voting for this vegetable are as bad as him.",
            "score": 1
        }
    ]
}