{
    "id": "148kpnd",
    "score": 386,
    "title": "Shoes Yet to Drop in the Mar-a-Lago Investigation",
    "author": "just_say_n",
    "date": 1686677203.0,
    "url": "https://www.lawfareblog.com/shoes-yet-drop-mar-lago-investigation",
    "media_url": "https://www.lawfareblog.com/shoes-yet-drop-mar-lago-investigation",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The reflection in the window of more boxes stacked in the shower 👀",
            "score": 1,
            "author": "Volcanohiker",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can see them poking out over the shower curtain rod.",
                    "score": 1,
                    "author": "dangroover"
                },
                {
                    "level": 1,
                    "comment": "Well yeah but Donald pulled the curtain closed to cover them.  Security Protocols in place!",
                    "score": 1,
                    "author": "Optimus-Maximus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Curtain, locked. Check\"",
                            "score": 1,
                            "author": "redneckhatr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Curtains have locks on them, right?\"",
                                    "score": 1,
                                    "author": "Optimus-Maximus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“This is nice fabric. No one’s getting though this.”",
                            "score": 1,
                            "author": "Morbidly-Obese-Emu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The shower was for the super-duper classified stuff",
                    "score": 1,
                    "author": "oneir0naut0"
                },
                {
                    "level": 1,
                    "comment": "Visible above the shower curtain.",
                    "score": 1,
                    "author": "DecidedlyVague"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This article makes a point that has been a bit neglected in the conversations around this current indictment.   We have 37 felony charges right now in FL, but this is likely only the first indictment in what could turn into a relentless drumbeat of charges against Trump from the special council investigation.   Sure, the current charges could potentially be enough to see him in prison (or more likely house arrest) for the rest of his life, but they haven't touched on any of the January 6th stuff or election interference, or wire fraud from his blatant fundraising grifts.  \n\nMy confident prediction is that these are only the first of many charges we're going to see rolled out, and once everything is said and done, Trump will be remembered by history as an absolute prolific criminal who also was president at some point.",
            "score": 1,
            "author": "OppositeDifference",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remember that old saying about someone's name being Mudd?\n\nMaybe that name will change to Trump.",
                    "score": 1,
                    "author": "HellaTroi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Trumped up charges\n\nTrump card\n\nWill have whole new meanings, and they won't be good.",
                            "score": 1,
                            "author": "Bozee3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I still like the British meaning = fart.",
                                    "score": 1,
                                    "author": "HryUpImPressingPlay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As in, \"oof, too many beans I'm trumping all over the place today\"?",
                                            "score": 1,
                                            "author": "BourgeoisStalker"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do not defame the great and glorious name of Harcourt Fenton Mudd!",
                            "score": 1,
                            "author": "carageenanflashlight"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, and that was my point in posting it.",
                    "score": 1,
                    "author": "just_say_n"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check it:\n&gt;And federal prosecutors are not limited to just one bite at the apple; if they acquire sufficient evidence of additional criminal conduct, they can file updated or additional indictments, both in Florida and elsewhere.\\\n&gt;One obvious area where additional charges may yet be forthcoming is the other half of Smith’s mandate as special counsel: interference with the lawful transfer of power following the 2020 presidential election, including in relation to the Jan. 6 insurrection. While Friday’s indictment does not address these issues, we know from media reports that the special counsel is still actively investigating them. And if that investigation uncovers unlawful misconduct then additional indictments will likely follow.",
            "score": 1,
            "author": "jjjijjji",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought the article would have talked about the criminal stuff he did in Bedminster (NJ), if he hid more documents somewhere else and the documents that he kept in Mar-a-Lago but couldn't appear on the indictment because just public knowledge of their existence is too much of a security hazard.",
                    "score": 1,
                    "author": "Playful-Technology-1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ivankas grave",
                            "score": 1,
                            "author": "Baighou",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*ivana",
                                    "score": 1,
                                    "author": "celerydonut"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "he's saving that incase Cannon screws up this trial",
                    "score": 1,
                    "author": "jaymef"
                },
                {
                    "level": 1,
                    "comment": "Yup. He could be charged in Bedminster, NJ.",
                    "score": 1,
                    "author": "Appropriate-Welder68"
                },
                {
                    "level": 1,
                    "comment": "Yes, and this is exactly why I posted the article.",
                    "score": 1,
                    "author": "just_say_n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some of the language is very chewy, but it's well worth the read in full.",
                            "score": 1,
                            "author": "crb3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "TFA doesn't even mention the Liv Golf stuff and the Saudi connection which may well turn out to be related to the classified documents.\n\nI'm betting there is a grand jury in New Jersey we haven't heard about yet.",
            "score": 1,
            "author": "Print-Humble",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or he'll die from a heart attack suddenly and nobody will hear about it because it's too harmful to US and our allies if word gets out to our enemies",
                    "score": 1,
                    "author": "kerssem"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the \"shoes\" still up in the air:\n\n* Removal of Classified Documents from the White House\n* Disclosures of Classified Information\n* Further Unlawful Retention (and Possible Destruction) of Classified Documents\n* Possible Additional Co-Conspirators\n\n&gt;The charges brought in the indictment appear to be backed up by extraordinarily strong evidence, including text messages with Trump’s alleged co-conspirator, photographs of mishandled documents, audio recordings of Trump acknowledging his possession of classified documents, and incriminating accounts by Trump’s own lawyer. This sort of evidence is exactly what prosecutors would want to have in a case as high-profile and politically charged as this one. \n\n&gt;But it takes time and effort for investigators to collect this evidence and assemble the case necessary to secure an indictment. At the same time, the fact that Trump is a leading contender for the 2024 Republican presidential nomination is no doubt putting pressure on the special counsel and his team to move quickly and maximize the chances that any charges are resolved before the election takes place. In this context, it would arguably make sense for the special counsel to move forward with an indictment for the charges for which they have the strongest evidence first, even as they continue to investigate and build the case for additional prosecutorial steps down the line.",
            "score": 1,
            "author": "takesjuantogrowone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone with 'she' pronouns called Walt and told him to put the boxes in the plane (if I recall - it's been since Friday that I read the indictment). People have said it's not Ivanka because she was already on her NYC society redemption tour. Melania doesn't strike me as an administrative type that tells people to load boxes. Who was it?",
                    "score": 1,
                    "author": "BourgeoisStalker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"She\" called the stooge to say, don't put the boxes on the plane for the trip to Bedminster, it's full of luggage.  That sounds like a wife thing to do.",
                            "score": 1,
                            "author": "cassanthrax"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, y’know, consequences.",
            "score": 1,
            "author": "RegattaJoe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi i am a republican politician. i have never seen that last word in your post? what is it and what does it mean exactly?",
                    "score": 1,
                    "author": "Senorpoppy117",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s when the nasty stuff you’ve done circles around and bites you in the plum smugglers.",
                            "score": 1,
                            "author": "RegattaJoe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ohhhh so kinda like all the bad stuff i pass on to the people who vote me then blame them/make them question their own usefulness for not being able to handle it?",
                                    "score": 1,
                                    "author": "Senorpoppy117",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How else are.you going to get them to vote against their own best self-interest yet again?",
                                            "score": 1,
                                            "author": "InterPunct",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "youd think it gets more difficult as times goes on but actually its been getting easier and easier... go figure!",
                                                    "score": 1,
                                                    "author": "Senorpoppy117"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It means...  Code 18 section 794",
                            "score": 1,
                            "author": "TintedApostle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The judge assigned to Trump's case has only been on this bench for three years. \n\nSmith has served in the United States Department of Justice as an assistant United States Attorney, acting United States Attorney, and head of the department's Public Integrity Section.\n\nCannon is completely outmatched.",
            "score": 1,
            "author": "HellaTroi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah but Cannon is the judge so she gets to make the decisions to exclude or admit evidence, whether the charges should be dismissed, whether the jury verdict should be set aside, etc. the balance of power is WAY in her favor",
                    "score": 1,
                    "author": "Maybemmaybenot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its the jury we need to worry about. One stealth jury gets on and they will throw the verdict for Trump regardless of rational evidence.",
                            "score": 1,
                            "author": "Therocknrolclown"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn't that the Eastern European call girl (Melania) bathroom?",
            "score": 1,
            "author": "criptohore",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, no! Good Heavens I thought it was obvious! It's the hide your top secret government documents bathroom. Last I knew they were standard issue in all new houses being built.",
                    "score": 1,
                    "author": "Ande64"
                }
            ]
        },
        {
            "level": 0,
            "comment": "a fucking chandelier in the bathroom....\n\nand then that curtain rod",
            "score": 1,
            "author": "Therocknrolclown"
        },
        {
            "level": 0,
            "comment": "Is that window unlocked?",
            "score": 1,
            "author": "PiaggioBV350",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who cares, TFG had those boxes on a f*ck*ng stage before they were moved to that bathroom.\n\n[Photo evidence in the indictment with a random person redacted (for privacy issues) in the background. ](https://news.berkeley.edu/wp-content/uploads/2023/06/Trump_documents_Mar-a-Lago.gif)",
                    "score": 1,
                    "author": "Playful-Technology-1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The stuff from 1/6 is going to be harder to prove than the document related stuff. The only way anyone involved with 1/6 will have a reduced sentence is by turning on Trump. \n\nThe special prosecutor really is playing 3D chess against all sorts of checker players. \n\nThis is SOOO delicious!!!",
            "score": 1,
            "author": "ProSeNewbie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, but that may not be the point.\n\nLook how narrow the charges in the indictment are--even though it mentions facts that Trump personally packed the boxes in the White House and even though it says he showed people secret documents in New Jersey, it doesn't charge him with things related to that conduct and, should they charge that conduct, they could charge it in DC or NJ.\n\nThat is what I think is significant.",
                    "score": 1,
                    "author": "just_say_n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What I’m saying is that he painted himself into a corner and he’s surrounded. \n\nTV news had him and his accomplices on camera packing his vehicles with documents the day he left the White House. \n\nIt’s all a done deal no matter what.",
                            "score": 1,
                            "author": "ProSeNewbie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trying to make sense of the wall sconce with the dingle-dangle hanging over the towel bar.",
            "score": 1,
            "author": "DuchessofMarin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nothing about Donald Trump makes sense.",
                    "score": 1,
                    "author": "Jasonicca"
                },
                {
                    "level": 1,
                    "comment": "Maybe it’s a bell he rings when he needs someone to come wipe his ass",
                    "score": 1,
                    "author": "Alikona_05"
                },
                {
                    "level": 1,
                    "comment": "It is what you get if someone was perpetually stuck in the 70's/80's mentally that wants to look like they are rich without ever being fully part of that culture. \n\nBasically a poor person's version of a rich person, but horribly outdated. Tacky and hollow and lacking any actual substance.",
                    "score": 1,
                    "author": "kingsumo_1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are almost certainly Espionage charges pending. A $Billion bailout for Kushner would not have been a freebee.",
            "score": 1,
            "author": "JubalHarshaw23"
        },
        {
            "level": 0,
            "comment": "This is a great article and worth reading all the way through. The author address something I’ve wondered as well.",
            "score": 1,
            "author": "goalmouthscramble"
        }
    ]
}