{
    "id": "148nn1c",
    "score": 192,
    "title": "James Comer Doesn’t Seem to Care If Biden Probe Evidence Is Legit: The House Oversight chairman acknowledged the Republican Party doesn’t have a lot.",
    "author": "thenewrepublic",
    "date": 1686684965.0,
    "url": "https://newrepublic.com/post/173584/james-comer-finally-admits-no-idea-biden-probe-evidence-legit",
    "media_url": "https://newrepublic.com/post/173584/james-comer-finally-admits-no-idea-biden-probe-evidence-legit",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Kentucky GOP Rep. James Comer on Tuesday admitted again that he has no basis for his investigation into President Joe Biden.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe if they spend another 10 million they'll find more nothing.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The old Trey Gowdy ploy",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Of course they don't care. They literally just want to be able to say \"see, Biden is under investigation too!\" Pathetic.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. It’s all a show to try to equate Biden to Trump. \n\nIt’ll work for the base, not so sure about the bulk of independents.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What fries me is that, even after years of protecting and defending and making excuses for a man they all knew was a corrupt crook and a moron and a danger to us all, they will pay no price. Republicans will gladly vote for all of them again.",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And they're trying to give the impression that 'being under investigation' somehow proves that you are guilty.  I don't think they thought that one through very well.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When have the ever?\n\nFor *some* reason all they have to do is outwait any ”mistakes” or ”misjudgments” they make. Seems like everything is \"forgiven\" after it's not in a mainstream news outlet. [like Fox]",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But it's the White House weaponizing government against the people?\n\nI am so tired of these dillweeds.  Are there any Republicans who are not either straight up fascist authoritarian nut jobs or spineless, amoral shit stains that will go along with the nut jobs so long as they are on the winning side.\n\nI know CEOs and politicians tend to draw sociopathic personalities, but it seems like that is the only requirement for entry into the GOP... Well that and a burning hatred for anyone who isn't straight, white, Christian and preferably cis-male.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "&gt;\"We've turned up jack shit, and take this as encouragement to continue investigating until we find something.\"\n\nHim, probably\n\nThe point isn't the results, the point is to imply there's something worth investigating.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "What a waste of my money.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "\"Shame\" hasn't been a word in the conservative dictionary for a long time.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "They are truly an embarrassment. They're grabbing at shadows and when this goes south, they'll just do as they always do and turn on each other.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "It’s ok, the voters don’t care if it’s legit either",
            "score": 1
        },
        {
            "level": 0,
            "comment": "\"Eye for an eye\" only works among republicans because they all have dirt on each other.  They have to literally make up shit like Pizzagate to go after a Democrat.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Well, he told me to comb the desert, so I'm combing the desert.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Why would they care, it's not their money, they're still getting paid and still getting campaign contributions for going through the motions.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Lie loudly apologize quietly.",
            "score": 1
        }
    ]
}