{
    "id": "148p21j",
    "score": 368,
    "title": "Why Trump hoarded classified documents: More than \"trophies,\" they are weapons",
    "author": "BodieLivesOn",
    "date": 1686688808.0,
    "url": "https://www.salon.com/2023/06/13/why-hoarded-classified-documents-more-than-trophies-they-are-weapons/",
    "media_url": "https://www.salon.com/2023/06/13/why-hoarded-classified-documents-more-than-trophies-they-are-weapons/",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "More than that, they were for sale.\n\nDid he want so called Kid Rock to buy a map to frame?",
            "score": 1,
            "author": "laffnlemming",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Buy one of my Trump’s Top Secret Documents, get one absolutely FREE!”",
                    "score": 1,
                    "author": "MaxZorin1985",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doubt it’s a bogo deal but he will throw in a coupon for 10% off an NFT of trump in a superman costume.",
                            "score": 1,
                            "author": "Casual_hex_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just figured it was his Going Out of Business deal.",
                                    "score": 1,
                                    "author": "MaxZorin1985"
                                },
                                {
                                    "level": 3,
                                    "comment": "Trump's photoshopped head on a guy in a Superman costume (ftfy)",
                                    "score": 1,
                                    "author": "bisho"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Use the bathroom at Mar-a-lago and take some pics while you're in there.   And remember to grant me some trademarks in exchange. - probable DJT bartering move.",
                    "score": 1,
                    "author": "Heelajooba",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Actually you could bring some change and put it in the old school copy machine that was in there and make as many copies as you want. The Saudi’s, Russia and North Korea already have there copies so you will have to find your own countries to sale them to.",
                            "score": 1,
                            "author": "Silent_Ad_398",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bet DJT agreed to autograph their copies for an extra $1M since after all, use of the Trump name is trademarked.",
                                    "score": 1,
                                    "author": "Heelajooba"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He just wanted Kid Rock's input on North Korean attack plans.",
                    "score": 1,
                    "author": "Wiffernubbin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;“As with most crimes Trump commits, he appears to view these documents as a valuable commodity to be exploited for his personal benefit,”     \n\n\n\nThis pos my god",
            "score": 1,
            "author": "HoePleaser"
        },
        {
            "level": 0,
            "comment": "I also suspect that Putin \"suggested\" what to take when it came time for Trump to exit the WH. Remember that private meeting the two had?",
            "score": 1,
            "author": "gasahold",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone asked for specific documents, and it's highly doubtful that person was trump.\n\nMy guess is the requests came from Putin and the Saudis, with trump's team facilitating.",
                    "score": 1,
                    "author": "charcoalist"
                },
                {
                    "level": 1,
                    "comment": "Remember how Saudi Arabia treated Trump like a king when he inaugurated their dystopian surveillance super-bunker and ignited the Magic Orb of Doom?",
                    "score": 1,
                    "author": "Reasonable_racoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pepperidge Farms remembers.",
                            "score": 1,
                            "author": "apier1on"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;The indictment hints that Trump saw the documents not just as prizes, but leverage to gain political advantage\n\nGiven all that's been reported about the classified documents case there is no question in my mind, what. so. ever that Trump has been selling state secrets to the highest bidder from the first moment he set foot in the Oval Office - and stained it w/his foul presence.\n\nI just wish that - in addition to the evidence already found - that some outfit, like Anonymous for example, would get a hold of and release evidence that is beyond incontrovertible  showing Trump has indeed sold state secrets to Russia and Saudi Arabia, and others.\n\nFor which Trump, in my opinion, deserves the maximum penalty allowable by law.",
            "score": 1,
            "author": "BB4All",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll second that opinion",
                    "score": 1,
                    "author": "LukeTheLumberjack"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For blackmailing and leverage, let alone the potential for selling/exchanging to the highest bidder of course. This man serves only himself.",
            "score": 1,
            "author": "ThuggyDuneBuggy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, maybe--but given who we're talking about, it's at least as likely he took them for no particular reason or for no more complicated reason than that he could.",
                    "score": 1,
                    "author": "SSF415"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. Even his lawyers make this understanding explicit. One explained how the process works by saying that ex-presidents take documents, the national archive asks for them back, \"and then you negotiate\". Which is not how it works: when Biden and Pence discovered classified docs in their files, they called NARA and said \"come and get 'em!\"\n\nBut it's clearly how trump thinks the process goes, or should go, and how he explained it to the lawyer in question. He has something NARA wants, therefore NARA should give (\"negotiate\") something trump wants back in exchange for them. At a minimum, NARA should negotiate to allow trump to keep some of the docs for himself.",
            "score": 1,
            "author": "south3y",
            "replies": [
                {
                    "level": 1,
                    "comment": "The irony that he's the person that made it a felony to retain documents is the richest part of the fucking circus.",
                    "score": 1,
                    "author": "scorpyo72"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also cash cows.",
            "score": 1,
            "author": "ridemooses"
        },
        {
            "level": 0,
            "comment": "I wouldn't doubt he has some hidden away that he will send out somehow which is why he floated a plea deal.  I will not send these last ones to your enemies if you let me walk.  Then again, that would require him to have the intelligence to not get recorded admitting you still have the docs and showing them to random people after he was demanded to return them all.",
            "score": 1,
            "author": "clintCamp"
        },
        {
            "level": 0,
            "comment": "\"I have a big pile of papers,\" Trump raved, demanding that those present \"look\" because it \"totally wins my case.\" He added, \"Except it is like, highly confidential. Secret. This is secret information. Look, look at this.\"",
            "score": 1,
            "author": "worn_balle"
        },
        {
            "level": 0,
            "comment": "Very likely that some of these or copies of have found their way to Russia and maybe other countries. He has no idea the damage he’s done by just holding them never mind showing and sharing them with people who will use them against the US",
            "score": 1,
            "author": "mic-brechfa-knives"
        },
        {
            "level": 0,
            "comment": "They were supposed to be his shield in the January 6th insurrection case. He'd basically suggest he had something that might be of their interest and would exchange it for better terms in the plea. He didn't expect NARA to be as good as their jobs as they were. Once the search warrant got executed, they were fucked.",
            "score": 1,
            "author": "whenimmadrinkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it is simpler than that.  He just knows he will be dead before he ever serves jail time. So why not do it?   It's not as if he cares for his kids or his legacy.  He is to selfish to see thar far ahead.",
                    "score": 1,
                    "author": "CATSCRATCHpandemic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Daily Wire spinmeister Ben Shapiro argued that Trump took the documents \"not for any nefarious purpose, but because Trump likes things and so he takes them.\"\n\n\"Hello, Bank teller. I like money so I'm going to take all of yours.\"",
            "score": 1,
            "author": "fakelaughfred"
        },
        {
            "level": 0,
            "comment": "Dollar, dollar bills, yo",
            "score": 1,
            "author": "Bardfinn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trash rules everything around him.",
                    "score": 1,
                    "author": "DreddParrotLoquax"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They were something useful to him to monetize for either money like Nixon or influence or power.",
            "score": 1,
            "author": "Brundleflyftw"
        },
        {
            "level": 0,
            "comment": "He wanted to Flex and sell them. It’s pretty simple imo.",
            "score": 1,
            "author": "phiz36"
        },
        {
            "level": 0,
            "comment": "I am not a lawyer but have been around law enforcement. Jack Smith got a warrant signed to do a raid of a former presidents home. We just know surface level of the charges that Trump has been charged with. Jack Smith has gotten every court that he has challenged to side with him at every level. Donald Trump Sr. Has sold national secrets to foreign adversaries. I guarantee it. I believe there are several documents that have not been covered. They have evidence of them copying documents to a flash drive and a laptop. I was station overseas and plugged my iPod into a government computer and the military police knocked my door down and I was a military police lol. Just crazy how our law makers can use government time and resources and impede on a federal law enforcement investigation and not be breaking any laws for a private citizen. If I am talking shit to a police officer who is trying to give my wife a ticket I can get arrested for interfering in the police interfering in his job. Just two different Justice systems.",
            "score": 1,
            "author": "Silent_Ad_398"
        },
        {
            "level": 0,
            "comment": "I know the common thought is \"to sell\" but I don't think that fits with how it has all gone down; I agree with the \"trophy\" theory more than anything else.\n\nIf they are for sale there is no reason to keep the physical copies in a bathroom.  The NARA tracked all of the documents, they know what is missing.  If it was for sale then Trump would make a copy and either return the original or destroy it and force the NARA to prove he had it.\n\nIf the documents were for sale they would be organized for sale.  Instead investigators found them scattered in multiple locations, file folders empty, etc.  It is very hard to sell secrets to someone when you don't know what physical state they may be in.\n\nWhy continue to retain them once the NARA asks for them back?  He could have returned them at that point and gotten out without any legal penalty.\n\nThe only reason to retain the physical documents is out of some weird compulsion to say \"No!\" to anyone who wants anything from him.  The \"woke\" NARA wants *his* documents back?  They can get fucked.\n\nI think he is *that* petty and felt that invincible.",
            "score": 1,
            "author": "xtossitallawayx",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If they are for sale there is no reason to keep the physical copies in a bathroom.\n\nI think you are vastly overestimating tfg's intelligence.",
                    "score": 1,
                    "author": "liverlact"
                },
                {
                    "level": 1,
                    "comment": "You’ve heard him talk. This moron could not organize himself out of an open room. \n\nNow Ivanka on the other hand.",
                    "score": 1,
                    "author": "DepopulationXplosion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly!  Which is why I *don't think* he had the mental ability to pre-plan to steal select documents to sell or trade.  He is mastermind enough to know exactly which documents to get, but so stupid as to store them in a bathroom when the government came knocking to get them?\n\nIf he is an idiot then there is no master plan and he grabbed random stuff and is being intransigent because he is mentally ill.\n\nIf he is genius then why did he not cover his tracks in *any* way?  He literally just took the documents and when asked, refused to give them back, he didn't steal them in the dead of night.",
                            "score": 1,
                            "author": "xtossitallawayx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;\tOne doesn't need to believe Trump is some kind of super genius in order to see that he hoped these documents would later be useful for blackmail, threats, or creating political chaos. On the contrary, Trump's communications with people he showed documents to suggest he had no idea how he such a scheme would play out. Likely, he didn't have any concrete plan but was just holding out for an opportunity to weaponize them. \n\n&gt;\tThis fits Trump's larger pattern of constantly trying to find ways to cheat the system for personal or political advantage, and his willingness to take big risks in doing so. We see this pattern in his two impeachment trials. \n\nTrump is always looking for 1) money and 2) advantage over others. \n\nI think he’s smart enough to steal something that might help him later, and dumb enough to store it in a bathroom. \n\nI guess the trial may shed light on this.",
                                    "score": 1,
                                    "author": "DepopulationXplosion"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well put",
                    "score": 1,
                    "author": "fishinful63"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine what he could have taken if he had any technical skills. Put it all on an sdcard and hide it somewhere dank.",
            "score": 1,
            "author": "Thiezing"
        },
        {
            "level": 0,
            "comment": "Based on the indictment details we have proof he was using it to stay relevant within the RNC, but it's really difficult to imagine he didn't offer the information in trade to foreign agents and dignitaries in negotiations for favors.   \n\n\nSad part is that it wouldn't even be for anything interesting. Just business deals for resorts and joint partnerships. I would not be in the least bit surprised if conversation leaked indicating exactly this -   \n\n\n~~\"Hey, I have this crazy map of surveillance from some folks pretty interested in what you're doing in this region, just really silly stuff, anyhoo, what do you think about a Trump golf resort next to the Etihad Arena? Wouldn't that be great?\"~~",
            "score": 1,
            "author": "piscian19"
        },
        {
            "level": 0,
            "comment": "That’s his inventory of merchandise up for sale.",
            "score": 1,
            "author": "OldandBoldDude"
        },
        {
            "level": 0,
            "comment": "Trump - always the grifter, even when the grifting involves the security of the US and its allies.",
            "score": 1,
            "author": "inthekeyofc"
        },
        {
            "level": 0,
            "comment": "[Richard Nixon got $18 million for his classified documents. \"I was negotiating with NARA!\" -Trump](https://preview.redd.it/kz5bnln3ks5b1.png?width=640&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=2b79a74d143b186349443e97fa730a49fd148217)",
            "score": 1,
            "author": "_Pseismic_"
        },
        {
            "level": 0,
            "comment": "It’s hard to sit back and watch this man being attacked when he had a billionaire lifestyle, and all he wants to do is to make our country, stronger, safer, and more prosperous… the left are truly trying to destroy this country if you think anything otherwise that you are not a patriot.\n\nWhat they’re doing to Trump, they're doing it to everyone who voted for him.\n\nUnfortunately for the Democrats - inflation is a constant reminder of their failures.  Every day we are reminded. $8 for a dozen eggs. $100 to fill up my tank. $150/month water bill.  Very few things are still affordable - Car insurance ($23 per month from Insurance Panda) and gym ($20/month from Planet Fitness). But I’m sure those will go up soon thanks to Bidenflation.\n\nTrump is exactly who we need. Love him or hate him, nobody can deny that he will not put up with any nonsense from overseas. Our adversaries fear him that’s why they want to arrest him.",
            "score": 1,
            "author": "ljjjkk",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean we have all that up here in Canada too. The whole world is going through tough times.\n\nI don't really think you can attribute worldwide inflation to any single thing, it's too complex.",
                    "score": 1,
                    "author": "FederationEDH"
                },
                {
                    "level": 1,
                    "comment": "You forgot the /s…i hope.",
                    "score": 1,
                    "author": "murderspice"
                },
                {
                    "level": 1,
                    "comment": "Trump totally sucks.",
                    "score": 1,
                    "author": "jizz_bismarck"
                },
                {
                    "level": 1,
                    "comment": "Where are you paying $8 for a dozen eggs?",
                    "score": 1,
                    "author": "OddAstronaut2305",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LA",
                            "score": 1,
                            "author": "ljjjkk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At Aldi in the area eggs range from $1.45-$3.95/dozen.  The later are organic.",
                                    "score": 1,
                                    "author": "OddAstronaut2305"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or, Trump's a criminal.",
                    "score": 1,
                    "author": "Arbiter4D"
                },
                {
                    "level": 1,
                    "comment": "None of this is true.",
                    "score": 1,
                    "author": "OttoBlado"
                }
            ]
        }
    ]
}