{
    "id": "frx93e",
    "score": 97898,
    "title": "Opinion: If you’re ‘essential’ enough to work through a pandemic, you’re essential enough to be paid a living wage",
    "author": "LosIsosceles",
    "date": 1585596029.0,
    "url": "https://www.reddit.com/r/politics/comments/frx93e",
    "media_urls": [
        "https://www.latimes.com/opinion/story/2020-03-30/essential-workers-coronavirus-amazon-instacart-trader-joes-living-wage"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, **any** advocating or wishing death/physical harm, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/whitelist) to review our details as to whitelist and outlet criteria.\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "My partner is considered essential.\n\nHe’s working 6 days a week, 4 at the restaurant and 2 from home, for 90% of his salary.\n\nThey cut his pay 10% while he is working through a declared state of emergency.\n\nTotal bullshit.\n\n\n\nEdit: Obligatory **R.I.P. my inbox**\n\nSince this blew up and I don’t have the attention span to respond to everyone I’ll try to cover everything in this edit:\n\n1) I haven’t contacted a local news outlet because my man chef has asked me not to rock the boat so I am respecting his wishes.\n\n2) It’s not my job, I can’t quit and he isn’t going to quit he is going to “play the game” and stick it out. Do I agree with him? Fuck no. Do I respect that it is his job and his call to make? Yes.\n\n3) Honestly misery does love company because it has been unfortunately comforting hearing from everyone else in messed up work situations right now. It’s nice to know we aren’t alone and that there are others out there trying to figure out how to fix the broken system while also paying their bills.\n\n4) Wash your hands, be kind to each other and [make sure you are registered to vote! It’s our only hope. ](https://www.usa.gov/register-to-vote)",
            "score": 3982,
            "author": "milehighmagpie",
            "replies": [
                {
                    "level": 1,
                    "comment": "They can do that? Here it's not allowed to cut someones pay without consent or a court ruling.",
                    "score": 997,
                    "author": "erwin261",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is America baby. Employers can do whatever they want and employees are told to consider themselves lucky to even have a job.",
                            "score": 1976,
                            "author": "dirty_cuban",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And I work with a lot of people that are thankful that their corporate overlords are putting them in danger to produce non essential luxury items.\n\nThat kind of shit makes me sick, and it's why my workplace will never be able to unionize.",
                                    "score": 658,
                                    "author": "GettingFiredForThis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Username checks out",
                                            "score": 155,
                                            "author": "Just_One_Umami",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Funny, I work with a lot of people that are thankful that their corporate overlords are putting them in danger to *test* non essential luxury items. \n\nWe are going into work right now basically because large tech companies deemed themselves essential, and to get their luxury products on the market we must test them.\n\nI rallied my small department to push back for about a week before they vaguely threatened layoffs if we don’t get back to work (because the tech companies will test their devices elsewhere). So we are back in the labs now :(\n\nI was excited at first because we were all sticking up for one another, and we got some wins on our side too, but after the threat from the company everyone caved even though they couldn’t do shit to us right now. Fire your testing staff? Really? Who will replace us? How can you possibly train people with social distancing in practice?\n\nJust remember, a Union *always* exists, official or not. It’s strength is only determined by the loyalty of you and your coworkers. I have tried to teach my coworkers that, and they are learning, just slowly.",
                                            "score": 41,
                                            "author": "Buromid",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "More or less what I gathered from my boss in an emergency meeting last week.\n\nI work for an “essential” business with a few competitors and our boss told us the others cut back on their services and left some clients high and dry and we’re picking up some of those customers.\n\nWe are constantly going in and out of other businesses picking up and making deliveries and working in tight quarters with a coworker, but their not going to pay us hazard pay, and masks of any kind are still against company policy.\n\nBasically told us to consider ourselves lucky when we should’ve already been getting paid more for what we do. I’ve been here nearly 7 years and capped out on my hourly rate and I’m barely making it with a single bedroom apartment that costs $1,300/month, 2 car payments ($620/month), groceries for a family of 3, and debt of $14,000 that we have been trying to pay off for a couple of years.\n\nThese are the reasons why I don’t put my health first, because I can’t afford to go to the doctor for my back pain or the dentist for fillings.",
                                    "score": 138,
                                    "author": "AdventureHasAName",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A cap on hourly rate is synonymous with not caring about employee retention",
                                            "score": 132,
                                            "author": "Adorable_Raccoon",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "if this doesn't start a class uprising against hyper overpaid executives vs essential workers then I don't know what will",
                                    "score": 283,
                                    "author": "fappaderp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When I started as a sales associate at dicks sporting goods as a teenager I had to watch a 20 minute video and verbally state I would not try to form a union with my coworkers.",
                                            "score": 242,
                                            "author": "MozzerellaStix",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've worked for more than a few retailers.  They all have their version of that video.  \"Wouldn't you rather have the ability to speak directly to your manager on your own behalf, instead of having some group that doesn't have your best interest in mind negotiate for you!?!  Also, unions charge FEES!  How evil!  By the way, you should opt to have your pay provided on this pay card which charges a fee any time you use an out-of-network ATM and a monthly fee for maintenance.\"\n\nOpen door policies are great and all.  I can walk in and be told by my manager that he or she is too busy, or if they do hear me out... just be told that they can't do whatever it is you want.  At my work, there is a safety issue that gets brought to the attention of management every so often.  Has been present for 9 years.\n\nYeah, it is great having no negotiating power at all.  I mean at least I get to be told \"no\" directly!",
                                                    "score": 200,
                                                    "author": "Sabbatai",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "One of my students told me they had some atm card from their work and I thought they were lying to me. I told them to stop using that and get a real bank asap.",
                                                            "score": 77,
                                                            "author": "mandradon",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, most payment processing companies will charge their client (your employer), less if you agree to let them try to sell employees on these cards.    \n\n\nThey feature great benefits like... you don't have to open a bank account and fill out direct deposit paperwork.  And uh... well that's about it.  Maybe you get your pay a day early in some cases.  Otherwise, you can use any one of their 17 ATMs across America to avoid the fee!  \n\n\nI know a lot of banks also charge ATM fees, but many do not.  Some charge and reimburse you later.  Either way, it is usually less than these pay card fucks charge.  If you maintain a minimum balance there is more often than not, no maintenance fee either.  Again, not true with most pay cards.  \n\n\nThis alone, the fact that your employer would allow someone to offer you this kind of bum deal which is directly related to your pay... should prove to every employee that you NEED a union to speak for you.  Your voice alone means jack shit and absent any meaningful opposition they will naturally always opt for whatever makes them the most money at a cost to the employee.",
                                                                    "score": 44,
                                                                    "author": "Sabbatai",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Forreal though. I had a pay card for 7 years at my last job and at my new job, I told them straight outta the gate I want a paper check furnished every other Thursday.\n\nIt's three months later and now HR is trying to pressure me into getting one of these pay cards. I work for Walmart mind you.\n\nThey can afford the $.03 or whatever the fuck it costs to mail the check, and I'll put my cash where I want it, when I want it there, without fees for withdrawal / using / maintaining etc.",
                                                                            "score": 20,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "So does walmart not have the option to just do a direct deposit? check or pay cards are the only option?",
                                                                                    "score": 7,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The thing about paycards is that theyre popular for impoverished people.\n\nMy friends who had felonies and were extremely in debt had to get paycards because banks wouldn't open accounts for them anymore.\n\nThats how they get their clients. They prey on those who dont have any other choices. Kind of like check cashing places that also sell party things for some reason.",
                                                                            "score": 19,
                                                                            "author": "Choclategum",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;The thing about paycards is that theyre popular for impoverished people.\n\nYou work, you shouldn't be impoverished.  Unionization can help forward this goal, where individuals asking for more money are just told \"no\".\n\nThere are \"second chance\" accounts at many banks.  I have a felony on my record and was seriously in debt a few years ago.  I also have a bank account, and after a few years I was able to move on to a \"real\" account with the same bank.",
                                                                                    "score": 8,
                                                                                    "author": "Sabbatai"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "More Americans need to understand why Taft Hartley needs to be repealed and how it has been a main basis for a lot of fucked shit that goes down in the American workplace.",
                                                    "score": 41,
                                                    "author": "LarryLeadFootsHead",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "When Pete Buttface was running I saw that he worked at the management consultant firm McKinsey and knew that very second I could never vote for him. Their mandate is to gut unions and the middle class. \n\nI don't think people realized how much things have changed. I grew up in the 70's, my dad is an immigrant from eastern Europe. He worked as waiter then restaurant manager at a fancy hotel and was union. We had a solid middle class lifestyle (mom did not even work) with healthcare. I know that it can never be like that again and much of the difference is not because of pay but it needs to improve drastically.\n\nA major benefit of unions besides pay is stability. If you have no stability you are constantly afraid of losing what little you have and it's much more difficult to get loans or invest money.",
                                                            "score": 49,
                                                            "author": "DoItYourSelf2",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh totally, Pete's excellent for sugarcoating the the early seeds of \"fuck you I got mine\" for younger generations, it just didn't stick the landing because surprise surprise there's a lot of people out there especially younger generations(sake of argument say under 30 so younger millennials and all of eligible Gen Z) that are struggling to get down what he was putting out.  He's a solid ideas man for the unstable depraved status quo who habitually need physical rebranding and marketing when contemporizing the same spiel.  \n\nNo disagreements on unions, a lot of them can offer a level of stability for not too prohibitive of a level of entry. I worked a meat department union gig in college and I had all sorts of benefits right out of the gate like time and half on Sundays, healthcare, vacation, sick, personal days and compensation payouts in the case of an injury. I've worked proper full on professional jobs that barely offered anything close to a level of security and benefits. Even despite being a higher paying gig, my insurance was fucking outrageous and didn't cover shit, and vacation and personal time was always a battle to kick around.",
                                                                    "score": 11,
                                                                    "author": "LarryLeadFootsHead",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If it’s like other anti-union videos I’ve see, one of the actors said, “If I have a problem, I want to talk with my  boss directly!”",
                                                    "score": 12,
                                                    "author": "instagunny",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Which is stupid, because every person I've known who was in a Union, didn't lose their ability to talk directly to their managers....",
                                                            "score": 18,
                                                            "author": "gaeuvyen",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Walmart (and I'm sure other major companies) still do that.",
                                                    "score": 41,
                                                    "author": "ELL_YAY",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Target does",
                                                            "score": 27,
                                                            "author": "ChozenXNinja",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Alamo Drafthouse too",
                                                                    "score": 10,
                                                                    "author": "ULostMyUsername"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "holy shit you guys are fucked up",
                                                    "score": 52,
                                                    "author": "compressandequalize",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "US has been brainwashing against unions for decades now, they start when they are younger. Best Buy was the same thing in early 2000s.",
                                                            "score": 43,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Historically, only famines or conspiracy revolutionaries have motivated citizens to rebel. \n\nThe pandemic coupled with 1 in 4 Americans being classified as in poverty is a good motivator so far, but famine isn't widespread. There needs to be conspirators to form effective unions.",
                                            "score": 58,
                                            "author": "NewOpinion",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It probably needs to be deeper before there would be enough pressure. The last great pro-labor reforms in the west were the New Deal after 1933 in the US and social security in Europe after WW2 destruction (mainly to take the wind out of the sails of the communists)\n\nThe main thing we'd need is for production to be de-outsourced and de-globalized, for national security reasons for one, but it would have the side effect of increasing western workers' leverage as well when outsourcing becomes harder in a post-pandemic world.",
                                                    "score": 26,
                                                    "author": "The_Apatheist",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No one is starving yet. If that happens, then we'll get our wish.",
                                            "score": 18,
                                            "author": "hog_dumps",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep gotta protect people from evil unions who want $5 from your paycheck in exchange for more job protection than the government is willing to provide.",
                                    "score": 65,
                                    "author": "OrangeredValkyrie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How much do unions take? I’m guessing it’s not actually 5$ but idk I never been in one",
                                            "score": 11,
                                            "author": "DustySnortsDust",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Depends on the union. I pay $35 per month union dues, and then there’s a small amount taken out as a working assessment.\n\nEdited to add: the final total I pay toward the union is minuscule compared to the money I make, the benefits I have, and the ability to stand up for myself when asked to do something unsafe or inappropriate at work.",
                                                    "score": 59,
                                                    "author": "ShovelBubbles",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Most people *massively* underestimate the value of what you added as your edit. The only time I worked for a job with a union, they kept me from being fired for not providing proof of my grandmother’s death and the location of the funeral when taking bereavement. After telling me I wouldn’t need any of that. I could have grabbed a booklet (or whatever they are called) but I didn’t. It was already super sudden and wasn’t my most clear-headed moments, but having a corporation basically tell me to have my grandfather fax a copy of her death certificate days after she died was enough to convince me that these maniacs will do whatever they want to their employees unless legally obligated not to.\n\nFuck union busting pieces of shit. Unions are the way forward in this country, and one of the few things the billionaire elite class is actually scared of. There is a reason people literally went into armed conflict with the government over unions in the past. Maybe it’s getting closer to being time for the past to repeat itself.",
                                                            "score": 58,
                                                            "author": "DeusExMcKenna",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Agreed, we just had a massive push from the \"freedom foundation \" to get all of my coworkers to opt out of the union. Well guess what, thanks to that union we are all at home with pay right now and not laid off like so many other of my more unlucky country mates.",
                                                            "score": 11,
                                                            "author": "Hyrdoman503"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your employer has to pay you for work already performed at whatever rate you agreed upon, but they absolutely can lower your pay for work going forward at any time, as long as they notify you beforehand.\n\nYou consent by not quitting.\n\nIf you don't consent, you stop working there.\n\nU.S.",
                            "score": 150,
                            "author": "Big_Fat_MOUSE",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here it is seen as amending the contract and both parties have to sign for it. Or in case the company files pay reduction for economic reason or something than they need to get approval from court.",
                                    "score": 29,
                                    "author": "erwin261",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What country?",
                                            "score": 10,
                                            "author": "ItsAlwaysSmokyInReno",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Netherlands.",
                                                    "score": 14,
                                                    "author": "erwin261",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That would be true for conteacted work here, most employment relationships aren't fixed term though and instead at will",
                                            "score": 7,
                                            "author": "Drunken_Economist"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes; employment is \"at will\" which means either side can change it if they want. \n\nHis option if he doesn't like it is...to quit.",
                            "score": 67,
                            "author": "AgoraiosBum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That just sucks.\nMy company has decided to reduce the number of working hours due to the pandemic. We still get our full pay.",
                                    "score": 30,
                                    "author": "erwin261",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Happened to a buddy of mine as well. Cut pay 10% across his whole dept and is taking away everyone’s 401k match",
                    "score": 56,
                    "author": "Need_Help_Send_Help",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "what restaurant does he work at that's been deemed 'essential'?   Hospital cafeteria or something like that?",
                    "score": 32,
                    "author": "Stepwolve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope, just a regular old farm to table bistro. \n\nThey have structured their menu to accommodate take out only ordering.\n\nHe’s doing his best to support as many of the local farmers as he can. The owners have given him and the few members of his staff that he can keep around creative license over the menu to help with that as spring gets going here in CO.\n\nReally all ownership is looking to do is cover the cost of rent and the salaries of the FOH/BOH management. Their insurance doesn’t cover one bit of this and they had to wait for a government mandate to shut down for a week (before deciding to re-open) before they could apply for any aid. \n\nIt’s a super messed up situation.",
                            "score": 40,
                            "author": "milehighmagpie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My roommate works at a farm-to-table and they're doing a \"virtual farmers market\" with their vendors. They have staples like flour, bread, tortillas, eggs and milk, and they're selling produce boxes full of whatever vegetables the farm can supply on a given day. I'm not sure how well it's going for them, but I appreciate that they're thinking outside the box.\n\n[Link](https://dishsociety.olo.com/menu/dish-restaurant-1-lp) if curious. Farm-to-tables are certainly a good fit for this kind of offering.",
                                    "score": 5,
                                    "author": "mrpeabody208",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1561,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fight for 15 will be won in 2025 when it should be at least 20 an hour 🙄 Still corporate politicians will laud themselves for their ‘progressive’ push. Fuck off, so hard.",
                    "score": 765,
                    "author": "letsrollwithit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's only one other way out right now and he's not out of the fight yet. Currently walking the most presidential walk but not receiving the talk.",
                            "score": 203,
                            "author": "TinkerTanner12",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 305,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mind boggling. This is why Boomers could buy houses while working part time as janitors and work part time and pay for (much cheaper) higher education. Back when wealth was distributed differently. It sucks that every generation that came after them ended up being so lazy and not deserving of the same opportunity.",
                            "score": 292,
                            "author": "AntFace",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Boomers lived through literally the most economically prosperous decades of the US ever, and then pulled up the ladder behind them when things started to turn down.",
                                    "score": 185,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yet they still couldn't save for retirement",
                                            "score": 84,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That cabin cruiser ain’t gonna buy itself.",
                                                    "score": 14,
                                                    "author": "HenryTwenty",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "US Labor had global power in the post-war era, and that rising tide lifted all ships. Now, it's gone, so the service sector suffers.",
                                    "score": 45,
                                    "author": "jrizos",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Makes you wonder why boomers did such a bad job at raising their kids.",
                                    "score": 24,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cocaine in the 70’s, mostly.",
                                            "score": 19,
                                            "author": "DeusExMcKenna",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We have a regular  Boomer customer who is just bitchy and needy.. She learned about our wages being raised to $15 an hour and she was complaining about \"Back in my day we had to WORK for $15 an hour!\"  Implying we don't work?\n\nBut she's also told me how old she is before, so I was like \"Ya know what, I'm going to check this..\" So I looked up inflation, and I decided to be Generous and checked what $15 an hour was when she was 28. (I assume she thought I was like 20, most older people think I'm a child even though I've worked there for 8 years and am basically a supervisor.) When she was my age, $15 an hour was worth $100 an hour today.  Fucking mind boggling how people don't understand what inflation is.",
                            "score": 45,
                            "author": "BureaucratDog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; When she was my age, $15 an hour was worth $100 an hour today. Fucking mind boggling how people don't understand what inflation is.\n\nThat's probably where her mentality is at. She looks back at those years as her favorite years and refuses to believe that anything has changed since. Or she looks at it as the model for how things should always be, forever. If that were the case, I'd ask her how she felt about being paid $1.60/hr today.",
                                    "score": 15,
                                    "author": "Chapped_Frenulum"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do you have any evidence for that? Not that I don’t believe you but I would love to be able to throw this statistic around and be able to back it up in arguments with people.",
                            "score": 12,
                            "author": "abracadoggin17",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "National minimum wage makes no sense at all; 65k is a comfortable family raising lifestyle in Arkansas but poverty pay in New York.\n\nWe need minimum wage standards to be localized based on prices.  People should be basically able to provide for themselves and their dependants without luxury at the minimum wage.  This creates the proper incentives for bargaining but prevents harm to children and the elderly.",
                    "score": 53,
                    "author": "Relevant_Monstrosity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Many states are blocking cities from raising the [minimum wage. ](https://www.google.com/amp/s/www.washingtonpost.com/outlook/2019/07/18/cities-would-like-raise-their-minimum-wages-too-states-keep-blocking-them/%3foutputType=amp)",
                                    "score": 18,
                                    "author": "ImTryinDammit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A national minimum is essential, because many states won't implement any minimum at all.",
                            "score": 29,
                            "author": "MimeGod",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Texas would bring back slavery if they could.",
                                    "score": 23,
                                    "author": "ImTryinDammit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't they still have prison labor?",
                                            "score": 14,
                                            "author": "_far-seeker_",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "65k is twice as much as $15/hr",
                            "score": 10,
                            "author": "DLTMIAR",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The blue states need 25 though, in the city at least",
                    "score": 80,
                    "author": "Tepidme",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Don’t most individual states set their own minimum wage? That was the impression I was under, but maybe I’m wrong about that.",
                    "score": 23,
                    "author": "Lord_Kristopf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 79,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Living in Memphis, when I graduated trade school and went from making $10/hr to $16.50/hr I felt like I was living like a king.  Throw 10 hrs of overtime and wow was that nice for being 21.  \n\nJust saying that bc Memphis has one of the lowest col and 3 hours East, Nashville, has a pretty high col.  They’re both in the same state, but man I can’t imagine trying to live off of $7.25 in Nashville.  Hell its a pretty tight budget living off of $22.50.",
                                    "score": 28,
                                    "author": "Frostedpickles",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of red states have made it illegal for cities to have a higher minimum wage than the state. Small government and all that.",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The party of small government. \n\nUntil its regarding an issue they don't like. That's a no no, only our brand if freedom™️ is valid here. \n\nFucking assholes.",
                                            "score": 12,
                                            "author": "TCrob1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Actually some states are blocking cities from raising the [minimum wage.](https://www.google.com/amp/s/www.washingtonpost.com/outlook/2019/07/18/cities-would-like-raise-their-minimum-wages-too-states-keep-blocking-them/%3foutputType=amp)",
                                    "score": 18,
                                    "author": "ImTryinDammit"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Opinion: If you’re ~~‘essential’ enough to~~ working ~~through a pandemic~~ 40+ hours a week you~~’re~~ ~~essential~~ ~~enough~~deserve to be paid a living wage",
            "score": 5804,
            "author": "samx3i",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if my job doesn't want to give me 40 hours full time so I work two 30 hour jobs part time to make ends meet?",
                    "score": 1992,
                    "author": "kia75",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is one of the big benefits of universal health insurance. Benefits shouldn't be an on/off switch. It makes it easier for small companies to offer full time jobs.",
                            "score": 1795,
                            "author": "Atheist-Gods",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The myth that Republicans care most about small businesses boggles my mind. AFAIK health insurance being tied to employment is the most common complaint from small business owners. (Correct me if I'm wrong.) And we all know which political party is in the pockets of health insurance companies and is fighting hard to keep this status quo.",
                                    "score": 870,
                                    "author": "splendourized",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It is a burden on businesses that don't generate enough profit to warrant pre tax expenses. For bigger companies offering health insurance lowers their tax liability in the amount that they pay for the insurance, same for the employee. If your company operates on small enough profit margins to support the owners and employees only that pre tax benefit isn't enough to counteract the expenses including the overall tax liability. To put it simply; health insurance offered by large companies acts as a tax shelter. A big enough pool of participants could result in the tax liability being dropped to a lower marginal tax rate. Which is part of the reason why but business doesn't lobby to alleviate the burden of having to offer insurance. For small business it still is a burden.",
                                            "score": 236,
                                            "author": "stevez_86",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;For bigger companies offering health insurance lowers their tax liability in the amount that they pay for the insurance\n\nI didn't know that there was a tax credit equal to the amount paid for health insurance premiums by large companies. Where can I learn more about this program?",
                                                    "score": 83,
                                                    "author": "lolrobs",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nothing complicated about it.\n\nHealth insurance is a business expense. Business expenses are deducted from a business's taxable income. It's not a tax \"credit\". It's just how business tax code is written.",
                                                            "score": 92,
                                                            "author": "BoothTime",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 7,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I think he means it's an expense of doing business so any size company deducts the expense from gross revenue before interest and tax calculations; but for the bigger company it's not as painful an expense.",
                                                            "score": 14,
                                                            "author": "hahayouguessedit"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Theres a WHAT?",
                                                            "score": 27,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah it's literally why employer healthcare is so popular and prevalent in the US.",
                                                                    "score": 22,
                                                                    "author": "Hesticles",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "it allows them to give you a higher valued item (to you) that is significantly reduced in cost (to them). Meaning for every dollar they offer someone a smaller competitor will have to offer more just to have an equal offer.  Its a lopsided scale because of collective bargaining - or in other words... because they are a \"single payer\" representing many. \n\nYou on your own will have to pay a lot more for the same coverage, likewise, a smaller business will also have to pay more to offer the same.  \n\nThis makes it so small businesses end up having to pay more to attract the same labor that their bigger competitors would want.\n\nRemoving health insurance from the employer causes those bigger companies that don't need help to lose a weight on the scale.  And that... is why we can't have nice things.",
                                                                            "score": 39,
                                                                            "author": "Pizlenut",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Are you serious right now? Companies get to do a tax write off for health insurance premiums they pay?",
                                                    "score": 34,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Of course. It's often why non-profits pick up 100% of your premiums. It makes it easier for them to post expenses and justify the non-profit status.",
                                                            "score": 45,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 37,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I guess it follows that there is no real incentive to keep healthcare expenses low because the tax liability would be proportionally affected.",
                                                                    "score": 14,
                                                                    "author": "match_",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 19,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's still fucking stupid. \n\nInsurance companies are getting it on both sides already, \n\nPeople pay their premiums and copays. \nCompanies pay premiums\nGovernment pays the companies to pay the pay the insurance companies, with money from the people.",
                                                                    "score": 23,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "If that's true that means the government is essentially already paying for everyone's healthcare, with some profits for the insurers on top of that.",
                                                            "score": 19,
                                                            "author": "Jonne",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We spend more on health care than anybody.  We just don't get as much out of it.",
                                                                    "score": 7,
                                                                    "author": "Evil-in-the-Air"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, because you won't get any of the benefits of having a full time job you'll have to work three jobs to make up the difference.",
                            "score": 35,
                            "author": "NightmareNeomys",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It makes more sense when you ask why two companies each paying for 75% of the full time of a human being are required to pay zero percent of that human's maintenance costs",
                            "score": 19,
                            "author": "chcampb",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck this 40+ hours shit. With raised productivity and a market full of bullshit jobs that can be automated or done away with completely, most of us should be working 20-30 hours for 1.5-2 times current wages.",
                    "score": 358,
                    "author": "souprize",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Amen.  my current workplace is actually less bullshit and more productive than average and pretty much everyone does not do 40 hours of work in their 40 hours in the office.  \n\nSome places are doing new models like where you still work 80 hours in the pay period but only 9 days so you have every other Friday off.  It’s a step in the right direction, but one can only imagine how progressive society could be when people have more than 48 hours per week to work on their homes, families, and friendships.",
                            "score": 86,
                            "author": "godbottle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "... And shopping with normal disposable income.",
                                    "score": 25,
                                    "author": "1984number"
                                },
                                {
                                    "level": 3,
                                    "comment": "9/80 crew checking in. Its a nice improvement over 10/80",
                                    "score": 15,
                                    "author": "WarGrizzly",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "In my experience the 9/80 is just a way to extract more unpaid overtime from workers. More often than not I see people doing their 80 hours but still get 'asked' to work on the off Friday. I'm sure some companies consider the off Friday like a real off day but that hasn't been my experience",
                                    "score": 10,
                                    "author": "IntersnetSpaceships",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "sOciALiSt",
                            "score": 42,
                            "author": "thetruthseer",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "it's wild seeing people fight AGAINST automation, when they should be excited- the savings should be passed on to them, not just fucking hoarded\n\nif the US had some kind of enforceable regulations maybe this wouldn't happen so much",
                            "score": 27,
                            "author": "apurplepeep",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;\tthe savings should be passed on to them, not just fucking hoarded\n\nI really hope you don’t think that’s actually gonna happen....",
                                    "score": 26,
                                    "author": "ieffinglovesoup",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What if I am essential and only at a technical 38.75 hours a week because they automatically deduct lunch breaks I can't practically take?",
                    "score": 46,
                    "author": "verybakedpotatoe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "if you arent clocking out for lunch they owe you pay for lunch\n\nif you arent given time to clock out for lunch then they are in violation of the law.\n\nthis is not only wage theft but a violation of labor laws.",
                            "score": 54,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; if you arent given time to clock out for lunch then they are in violation of the law.\n\nThis is not true for all states. My state for example doesn't require employers provide lunch breaks (unless you are a minor) and there is no federal requirement either. However they obviously have to pay you for the time you work.",
                                    "score": 28,
                                    "author": "Nuttycomputer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, if the breaks are 5-29 minutes federal law says they are on the clock.  it's only longer breaks that have to be clocked out.\n\nBut yeah if they arent letting you TAKE the break an not work for half an hour, you are owed pay for that time.\n\nMy assumption was they were automatically adding lunch breaks because they were required by state law. but it could just be wage theft yeah.",
                                            "score": 13,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like you should talk to an employment lawyer if I’m understanding that correctly.",
                            "score": 22,
                            "author": "everythingiscausal"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you’re working, you deserve a living wage",
                    "score": 52,
                    "author": "dafunkmunk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think people who say this need to be more clear, as you’ll always get the boneheads like the other commented above saying “so no matter how many hours I should be paid a living wage?!?”  \n\nNo. The wage should be a living wage based on a full-time week. If you work part time, you get part of the the full time living wage. The problem is that many full time jobs don’t pay enough to even live without benefits. \n\nAnyone working a job should be paid enough to survive without relying on the government. Otherwise, the government is just subsidizing the business operations. But, that is the business model for many: profit while passing off labor costs to taxpayers.",
                            "score": 9,
                            "author": "samiwas1",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 450,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am an \"Environmental Service\" worker at a hospital, which is just a housekeeper that also has to deal with infection control and biohazard waste; they are not offering us hazard pay during this. Infact no one in our company is getting hazard pay for showing up to work, yet multiple coworkers of mine are showing signs of COVID-19. A lot of us are going to have to take sick leave, and they are telling us it will come out of our PTO. Uber bullshit.",
                    "score": 207,
                    "author": "Aniican",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; multiple coworkers of mine are showing signs of COVID-19. A lot of us are going to have to take sick leave, and they are telling us it will come out of our PTO\n\nthis is reprehensible to the highest degree",
                            "score": 105,
                            "author": "JohnFest",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "this pandemic has exposed the hyper classism which runs deep in the Western zeitgeist. I am no huge fan of China, so do not misconstrue me, but what I am seeing is a lot of privileged westerners shaming others for not \"socially distancing,\" when these shamers do not realize the working class is not afforded the luxury of practicing the recommendations in place due to their economic obligations and lack of autonomy",
                            "score": 37,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I want to upvote this 100 times.",
                                    "score": 7,
                                    "author": "MadAzza"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My wife is a nurse, I understand that there isn't enough PPE for love or money, but com'on, there's a lot of money.",
                            "score": 15,
                            "author": "jonhuang",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah we are having to have our security lock up all PPE and label who checked out specific items and at what times/when it was returned. We have extremely limited PPE at our facility, but we are a critical access hospital so we get tons of patients. Us EVS workers don't get access to any masks besides surgical masks, but we have to deal with direct contact with COVID-19. It's really upsetting, I hope your wife is doing well and I hope you all stay safe.",
                                    "score": 9,
                                    "author": "Aniican"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for what you do, I’ve seen what EVS has to do every day and you absolutely deserve hazard pay",
                            "score": 12,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If a company can't afford to pay a full time employee a living wage, then the company can't afford to hire people and needs to rethink its business model.\n\nOne could argue what the definitions of \"full time\" and \"living wage\" ought to be exactly, but the essence of the actual statement holds fast in my eyes.",
            "score": 1501,
            "author": "Rannasha",
            "replies": [
                {
                    "level": 1,
                    "comment": "THIS\n\nI am *so sick* of hearing business owners say “if I have to pay someone the raised minimum wage, l could go out of business.”\n\nIf a business can’t afford to pay people a reasonable minimum wage then that business is not successful. \n\nIt’s not the responsibility of employees to subsidize business owners so _they_ can profit and leave their workers falling behind.\n\nEDIT: was seeing replies and thought about this overnight. I’m gonna use the example *from the linked article*\n\nPeople like grocery store workers and those who work in fast food are told every day that their labor is unskilled and therefore not worth being paid more.\n\nYet here we are with Covid-19 in a position where society would basically stop and potentially descend into chaos if those people weren’t showing up for work everyday. \n\nGuess what? That is true any other day as well. Only now we’re being forced to acknowledge it.\n\nIt’s funny how fast the “expendable” workers not deserving of a living wage became “essential” overnight.\n\nSo, which is it? Are these workers not worth anything and therefore not worth being paid a fair, living wage or is the work they do day to day valuable to our society just as any other person showing up to do their job?\n\nPick one, cause it can’t be both.",
                    "score": 972,
                    "author": "blockcontroller",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know what I don't hear a lot of... \"If I have to pay to rent the building, I could go out of business.\" \n\nOr... \"If I have to actually pay for my materials, I could go out of business.\" \n\nOr... \"If I have to pay to keep the lights on, I could go out of business.\"\n\nCost of labor is a business expense, right up there with cost of materials, rent, and utilities. If your business can't cover your costs, then maybe you're running a shitty business. It's no more the responsibility of your employees and the government to subsidize your business costs than it is the responsibility of your vendors to do so.",
                            "score": 496,
                            "author": "JennJayBee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with you and the same should be applied to tipping in the US. I shouldn't have to tip people because their employer expects me to and doesn't pay them enough. I will and do tip when I want to and feel like I got more than just standard expected service.",
                                    "score": 18,
                                    "author": "seventhninja",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What a lot of businesses don't realize if that EVERYBODY had a living wage then the amount of people that are available to buy their products/service increases.",
                            "score": 15,
                            "author": "LivingDiscount",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I want to give you a safe distance e-hug for preaching this so much. take an upvote instead.",
                            "score": 13,
                            "author": "InternetJerk4U"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes. But customers need to expect to pay a a reasonable enough price to pay workers. Small business owners face this issue all the time. Customers will pay any price for gas, will pay $8 for coffee and won’t care about starbucks raising their prices, have no issue with buying plane tickets at inflated rates, but will fight your small business trying to charge more than what they paid for service 20 years ago and will just go over to the next store if you dare to charge more. \n\nMost small businesses with what you think are poor business models are tied to pricing structures they are set within an industry. So unless industries as a whole make a change, businesses can’t change change their business model to adjust pricing that reflects higher living wages for employees because the customer will say “it’s a shame minimum wage is so low” yet that same customer will take the business elsewhere if your prices increase. Rent goes up, utilities go up, tariffs raise costs, employees need higher pay to live, yet somehow prices need stay the same. \n\nConsumers need to reflect on that.",
                    "score": 16,
                    "author": "Cutiger29",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im considered An essential food service manager,(I know right), I have to work as Togo only with a skeleton crew for a 38% pay reduction and less of my benefits being paid. Meanwhile I come in contact with hundreds of people a day taking food to their cars. My mom, sister, and in-laws are all immune compromised. I’m scared to be anywhere near my wife and daughter but I have to keep the mortgage paid.",
            "score": 95,
            "author": "Lostopossum",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if you were to walk out, lock the door, and call your boss and say, \"we wont work until you give us a raise, hazard pay, and paid time off and paid medical bills if we get this.\"",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’d fire you, in at least every state that is Right To Work.",
                            "score": 19,
                            "author": "Faerco",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They'd fire the whole crew? I guess there are plenty of desperate people who will cross the picket line.",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " Boy, I agree.\n\nI wish the gov't would either require the delivery services, groceries, etc to crank up wages and benefits for these workers or include such in grants, etc as part of the stimulus.\n\nWe've taken to delivery like Instacart, and including bigger tips in hopes of being able to directly help them. But it doesn't do much good for a TJ's clerk.",
            "score": 137,
            "author": "211logos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup. My company is essential because we are manufacturing tests, but I know a solid chunk of our employees aren't working on the tests at all, it is business as usual (we even hired some temps to help us package the tests). The CEO/owner keeps sending out emails on how we should be proud etc that we are essential, etc. \n\n&amp;#x200B;\n\nWell, how about you give us some hazard pay if we are so vital. I can guarantee you that if the government required extra pay for the \"essential\" workers they would send half the people home. Shit, I'm salaried but I have been working 10 and 11 hour days for the past 3 weeks trying to get sit done, but I haven't gotten anything more than an email shout out.",
                    "score": 36,
                    "author": "SpiritFingersKitty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My job is considered essential. My coworker asked if we would be getting hazard pay since we’re still in operating business as usual. My boss said why would we. We’re not doing anything different",
                            "score": 19,
                            "author": "v______ma",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;I can guarantee you that if the government required extra pay for the \"essential\" workers they would send half the people home.\n\nAnd then they would work the other half way too hard to the point where they fall ill, even if it's not from corona, and they're fecked.\n\nGreed will kill them (companies) in the end.",
                            "score": 8,
                            "author": "Frothy_moisture",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work at a chemical recycling facility. I make $17.31 an hour. We are listed as essential because we refine trash chemicals into acetone for use in sanitizers. We have been told it's either sit at home and get nothing, or come to work for the same old pay. No punitive actions for staying home. Just no pay. We've been told we can try to get unemployment, but because there is work available we might not get it. An unemployed person makes more than i do under this bill, and management doesn't fucking care.",
            "score": 31,
            "author": "CiD7707",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a fucking atrocity.",
                    "score": 9,
                    "author": "Ask-Reggie"
                },
                {
                    "level": 1,
                    "comment": "I make less than you do (in a coffee roasterie) and have lost 1/3 of my hours due to reduced sales. So I’m making significantly less money than normal but just enough to not qualify for unemployment. Meanwhile if we shut down I would make $600 a week plus. I work with people that will be making $250 a week and not qualifying for this.",
                    "score": 5,
                    "author": "R-L-Boogenstein"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 218,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. Also unironically.",
                    "score": 61,
                    "author": "Prrcyval"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You'd think *essential* workers would get paid MORE than a living wage actually.",
            "score": 170,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Our jobs are essential, we are not. If we quit or get fired, we will be replaced by the many hundreds who can do the job. We are not essential workers, we are essential job workers. As such, we can be treated like crap by our employers and the general public. Nobody cares. And if we don't like it, they'll find somebody else who will shut up and take it.",
                    "score": 21,
                    "author": "PriscillasFluffyTail",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "i read in another similiar post that \"Essential worker\" are paid by how easy they are to be replaced, and for my job, i kinda have to agree. give a 4 hour formation to someone and anyone could do my job. i know its not the same for every \"essential worker\" but thats one thing to think about",
                    "score": 50,
                    "author": "Cuttyflame123",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Or, you know, we could just pay people a living wage because it's the right thing to do.",
            "score": 62,
            "author": "ebone23",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you want a living wage quit voting against your own interests.  In particular, quit voting for hard right Republicans.",
            "score": 73,
            "author": "Aintsosimple",
            "replies": [
                {
                    "level": 1,
                    "comment": "Problem is, most people who work minimum wage don't vote. A large portion of the voting block is older people that are represented by hard right Republicans.",
                    "score": 33,
                    "author": "koolkid93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, there's a lot of truth in that.",
                            "score": 16,
                            "author": "Aintsosimple",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Now go vote in the next election.",
                                    "score": 14,
                                    "author": "koolkid93",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "General strike and we all get a better life after this screw corporations",
            "score": 15,
            "author": "Grey___Goo_MH"
        },
        {
            "level": 0,
            "comment": "Or... and hear me out here...   We could just give everyone $1000 a month so that almost any job will add up to more than $15 an hour, force employers of shitty jobs to compete with a viable alternative, and eradicate poverty.\n\nBut idk, that sounds too radical. Maybe it's better to force them all to pay an arbitrary amount nationwide, and give them an incentive to replace people with cheap hard working robots.",
            "score": 175,
            "author": "nhorning",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 70,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here is a crazy thought.  \n\nJoin the rest of the 1st world and get rid of typical health insurance.  \n\nAs a Canadian I can't understand why people aren't more pissed about the cluster F the US health insurance scam is.  \n\nCanada's needs to be expanded to cover dental and prescriptions.",
                            "score": 127,
                            "author": "GWAE_Zodiac",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 44,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "People are extremely pissed. The majority of America supports universal healthcare. It’s just that the majority doesn’t matter because our democracy is a sham",
                                    "score": 17,
                                    "author": "Pinkieus-Pieacus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I only hope that they have overplayed their cards by taking too much and have awoken the masses and the next vote can help rectify the issue!",
                                            "score": 8,
                                            "author": "GWAE_Zodiac"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ha, my company, when I asked about hazard pay, told me I was paid industry standard and didnt need hazard pay. I do Maintenance for grocery stores. Im exposed to sick people every day. When i asked about getting ppe to protect myself. I was told to find it in my own. There is none commercially available. The folks making these decisions are all working from home.",
            "score": 30,
            "author": "LegoAllTheThings",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like businesses such as these are leaving themselves wide open to lawsuits down the line.",
                    "score": 8,
                    "author": "HwackAMole",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If they want better pay I don't think there would be a better time to threaten with a huge strike than now. Their employers would say that isn't patriotic though",
            "score": 12,
            "author": "Thrusthamster",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lmao i work for an essential company wont name that chain but they start with a k and sale groceries n gave employees a 25 gift card they could use in store n 300 bux tax free but refuse to pay hazard pay and basically run us into the ground 6-7 days u work nonstop most of us arent getting breaks and work truck after truck after truck but what do i know im just an employee",
            "score": 11,
            "author": "fedhippo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Here comes more Robotic solutions for retail and food service YANGGANG",
            "score": 18,
            "author": "K_notter"
        },
        {
            "level": 0,
            "comment": " I  just got this email. Any thoughts?\n\n\"Hello everyone,\n\nThis might get lengthy, but it is important information, and I encourage all of you to please read through it in its entirety.\n\nI want to first start out by saying that I sincerely hope that everyone is well, and taking care of themselves as best as they are able during this challenging time.  This is such new and uncharted landscape for all of us and I want to make sure that each of you feel supported and are getting your questions answered.  Many of you have reached out to me, and I appreciate how professional and patient you have been in our communications. I encourage anyone who has questions or concerns to email, text, or call me, any time. If I have somehow missed a response, please remind me- with the recent influx of communication, I want to make sure that no one gets lost in the communication shuffle. \n\nA number of people have reached out to me or their leadership team over the past two weeks regarding increased pay, company paid leave, and financial concerns related to reduced hours. Some have referenced “hazard pay”, while others have suggested that we shut down all operations and pay all team members until the Shelter in Place order is lifted.  Some have requested their vacation and sick time to offset the financial impact of reduced hours. Everyone has been incredibly professional, and their communications well thought out, and welcomed.\n\nIn response to these inquiries, and in total transparency, I want to take some time to let you know how we are doing our best to plan and implement changes in order to weather through this difficult time.\n\nAs many of you are aware, prior to the Shelter in Place order from the state, and San Francisco and Sonoma Counties, there was an incredible increase in sales in the dispensaries for a day or two.  Following the Shelter in Place and being designated as an essential business, we moved to a Delivery and Pick-up only model in order to continue to provide safe access to cannabis to our customers, as well as to stay in business and continue to employ all of our team members.\n\nDue to these changes, and the overall implications of COVID-19, we began to track a decrease in sales ranging from 20-40% in our stores.  In an effort to prevent layoffs, furloughs, or store closures, we immediately did several things:\n\n1. Our CEO Erich Pearson and COO Sean Kelley made the decision to stop getting paid at all. *Neither of them are receiving a paycheck* at this time.\n2. We reduced Director and VP salaries by 25%. \n3. We reduced most manager salaries by 15%\n4. We furloughed (Temporarily laid off) several team members who would not be able to work within their roles due to the Shelter in Place changes.\n5. Identified that there would be a lack of PPE and sanitizer, as well as other necessities, so increased our ordering levels, and began producing our own sanitizer\n6. Increased production of sanitizer to distribute to local hospitals and emergency personnel\n\nAll of these things were necessary for us to continue to maintain the level of operations and staffing we need to be able to keep our doors open, pay our overhead, pay payroll, etc. without impacting our non-leadership team members in retail and operations with layoffs or other reductions.\n\nYou might wonder why things are running so tightly financially that this is necessary, and why we are unable to pay a premium for those working in retail?\n\nAs a company, we run very conservatively. We budget very carefully, and this has allowed us to continue our operations and our organic business growth, employing 130 people, and subsidizing health insurance, paying holidays, PTO, team member discounts, etc., *while we have seen other companies our size and larger, lay-off 25-50% of their staff over the last 6 months.*\n\nFurther considerations:\n\n* Currently, the majority of our sales are coming from Delivery. Delivery has a much, much higher cost per sale due to time, mileage, insurance, and other overhead.\n* Despite many of the grants and benefits that the government has made available to other small businesses, cannabis does not qualify to receive any of these. As we are still federally illegal, we are not eligible for any federal assistance due to COVID-19.\n* Even though the state regulated and legalized cannabis, we still fall under a tax requirement called 280E. This means that we are unable to deduct most business expenses that normal businesses can deduct, meaning we pay almost twice the amount of taxes, including on payroll.\n\nThe information above outlines why it is that we cannot simply close all departments and pay our team members while they are home, and why we are unable to allow for accrued vacation time to be used to supplement changes in hours due to decreased store hours. We are making necessary reductions in all areas in an attempt to come out on the other side with everyone’s jobs intact and all stores and facilities primed to get back to normal.\n\nI realize that this is a lot of information, and I appreciate you having read it through. I want each of you to know that we are doing everything that we possibly can in order to reduce the impact to you, to keep everyone safe and well while continuing to provide safe access to our communities.  To say that this time is unprecedented is putting it lightly.  This is an incredible time of change, and change comes with unknowns, stressors, and requires adaptation and understanding. But change can also result in people coming together in ways they had not before, and in refining and improving previous processes for the future.  I read all of your feedback; all of your concerns and suggestions, and recognize the weight of it. It is appreciated, and we will continue to listen and to take into account all of the ideas and questions that are communicated as we move forward.\n\nThank you all for being a part of SPARC. Together, we can get through this.\n\nWarmly,\n\nHuman Resources\"",
            "score": 17,
            "author": "BaseAttackBonus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to say, that email is well crafted. It invokes a sense of \"togetherness\" with numbers to help build towards employee retention. I can only find two potential frustrations with it.  The first is that it mentions \"other companies\" laying off people, which is vague. If I had friends in a similar company, I would get their opinion on if this is true. The second potential frustration is that while salaries are cut, nothing is said about bonuses. If this company is heavy with performance bonuses, that game could be rigged.\n\nUltimately, if my employer gave me this memo, I would be grateful. I think few people in the marketplace receive this type of transparency.",
                    "score": 16,
                    "author": "longtailwriting"
                },
                {
                    "level": 1,
                    "comment": "This is a pretty respectable move. I admire them taking no salaries and reducing upper management pay rather than cutting lower level workers.",
                    "score": 11,
                    "author": "NoahG59"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People should be getting paid double time right now and have access to Coronavirus testing and care. \n\nThe US government continues to fail its working class people.",
            "score": 34,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Like this virus , all this “essential worker deserves better pay” stuff will be forgotten.",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How about if you're a human being that works your essential enough to be paid a LIVING wage. It's called a living wage for a reason.",
            "score": 8,
            "author": "nickcappa"
        },
        {
            "level": 0,
            "comment": "The job is essential, the specific person doing it isn’t.",
            "score": 23,
            "author": "doctordanieldoom",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 25,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That is an excellent fucking point. I don’t want to hear any more derisive bullshit about people wanting a living wage for “flipping burgers”.",
            "score": 36,
            "author": "newsreadhjw",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I just can’t seem to shake a comment I saw on a thread about this a couple days ago “the work is essential, you are not”. \n\nThe context for this comment is that there’s always someone willing to do this work for cheaper. Collective Bargaining would help folks out in these positions, however, unless they unionize, which the employers will squash at the first whiff of, there’s unfortunately no hope for getting these folks fair compensation.",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Self-realization of ones  own value as a worker bee is the last thing capitalist masters want. We need to see more articles like this, which drive this home and wake up the working class monster to deliver some change when we all get through this.",
            "score": 14,
            "author": "thejamielee"
        },
        {
            "level": 0,
            "comment": "Lemme fix that headline.\n\n\"Opinion: ~~If you’re ‘essential’ enough to work through a pandemic,~~ you’re essential enough to be paid a living wage.\"",
            "score": 12,
            "author": "AlbainBlacksteel"
        },
        {
            "level": 0,
            "comment": "Let's not forget that renting an apartment should not be a privilege, it should be a human right, and we shouldn't have to pay 2k for a studio no matter where it's located. Rent caps!",
            "score": 186,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe this is how we get there. Force every company to pay every full time employee enough to afford a 1 bedroom apartment, transportation, food, and clothing. You’ll see Walmart and Target pushing for rent control within a month.",
                    "score": 129,
                    "author": "highermonkey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Another thing we need to do is ban rent paid to foreign companies. A ridiculous amount of the astronomical CA rent goes straight to China.",
                            "score": 57,
                            "author": "HeyLookAPaper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I loathe hearing the \"free market\" argument when foreign investors, who aren't from a free market, come in with their outside money and buy up all of the property to rent it back to us. Is there a free market explanation for how to deal with that?",
                                    "score": 8,
                                    "author": "AntFace",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Completely agree. I can't even believe we're at the point where people can't afford a basic one bedroom apartment to sleep and store their belongings. Greatest country my fucking ass.",
                    "score": 77,
                    "author": "maikuxblade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Richest country ever in existence. Deals with some of the most extreme wealth inequality in the developed world. Something is very wrong.",
                            "score": 49,
                            "author": "maquila",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, it went VERY right for the people who designed the system.",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Economists of all spectrums are in agreement that rent controls severely limits supply of apartments and raises prices for everybody else to compensate. They make us work off. Denying this universally accepted fact is tantamount to denying climate change.",
                    "score": 47,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "additionally, wherever rent caps have been implemented we see black markets popping up instead.   'finders fees', 'application fees' - basically renters need to bribe landlords to have a chance at renting a unit. Or it becomes entirely based on connections, insider information, and influence.    If the rental market isnt determined by money, it will be influenced by power anyways.     \n  \nAnd when there arent nearly enough units for the number of people renting - because there is no profitability to incentivize building new units - people end up jumping through far more hoops and paying tons of money anyways. Which is why every study shows rent controls *reducing* housing supply.  And people without units have no means to get one outside of bribes.     \n  \nOr you make the government build mass housing for everyone, and you end up with [soviet era housing units](https://i.redd.it/mfrkwcq1iwuz.jpg), or  [communal apartments](https://en.wikipedia.org/wiki/Communal_apartment) where between 2 and 7 families share one tiny apartment. But they all technically have housing! What a victory for people everywhere",
                            "score": 20,
                            "author": "Stepwolve",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yeah... I'm for all kinds of progressive/liberal whathaveyou (UBI, universal healthcare, mandatory sick leave and vacation, etc.), but rent caps are a hard no. \n\nIn general, any time you place a floor or a ceiling on a market, you need to consider the side effects extremely carefully. Markets are subtle beasts that do not always work in intuitive ways. Rent caps are an extremely bad idea unless you want there to simply be not enough apartments for people to rent, or for them to be absolute shit holes.",
                            "score": 15,
                            "author": "i_speak_penguin",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thats fucking insane.",
                    "score": 9,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Ya, that's worked really well from a San Fran and New York perspective.\n\nHow about we just invest in improved infrastructure so people can commute to their jobs better?",
                    "score": 13,
                    "author": "SpellingIsAhful"
                },
                {
                    "level": 1,
                    "comment": "I believe caps have been proven to be worse for housing long term because people will just refuse to make new buildings. I would love to see it happen but idk how possible it is. Another, potentially better alternative is making x% of all multifamily housing listed at affordable prices, so you will have a mix of people living in different places and creating a more diverse community",
                    "score": 19,
                    "author": "taffyowner",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Rent control doesn’t work.",
                    "score": 14,
                    "author": "DrunkLegere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, nah, brah\n\nIf you're a person you deserve enough to live",
            "score": 6,
            "author": "Connor_Kenway198",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So glad this is being talked about. I work retail - sell weed in a legal state and I’m thrilled we are deemed essential but I gotta confess I’m getting worn down. Just plain tired from the thundering hoards of easily spooked people all making the same lame jokes about stocking up. How nice they have time to use the products I sell- I sure haven’t. And I might actually slap someone if they don’t stop talking about how bored they are with nothing to do. I’m tired. I’ve done nothing but work and sew lame ass home made masks to hopefully protect my coworkers from customers who won’t stay home and won’t stay 6 ft away and you will think I’m kidding but they cough and sneeze and think it’s funny. It’s not funny. I’m so grateful to still have a job and so grateful to have bosses that have really gone the extra mile to support us but many days I just end up shaking my head and thinking “we humans really suck and probably deserve all this bullshit we have in our lives”.\nK rant over",
            "score": 5,
            "author": "ms-tsunami"
        },
        {
            "level": 0,
            "comment": "My girlfriend works at a liqour store, deemed essential for some reason, works for minimum wage four days a week, running the whole store by herself for 9 hours. I've tried convincing her not to continue working because I work from home and make enough to survive, but she won't listen. My state has 16,000 cases roughly, and I'm a gambling man, but not with my life. Not for minimum wage",
            "score": 6,
            "author": "ShinyLotad22",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How about when this is all over with us essential employees get a month off and you home-sheltered people run things for a bit... kthanks",
            "score": 72,
            "author": "blacksantron",
            "replies": [
                {
                    "level": 1,
                    "comment": "Essential Worker is such an Orwellian term. It just means we're so inessential they can throw us into the meat grinder",
                    "score": 17,
                    "author": "judgeridesagain",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let's be honest with how markets actually work. The role is essential, the person may be replaceable.",
            "score": 17,
            "author": "ucbmckee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As a nurse, I feel I am paid fairly depending on where I work. That’s not always the case. However, pay is only half the story. America is still expensive as shit. Pretty much everything in America is overpriced except for maybe gasoline. The prices we pay for food are nonsense. Service people plainly rob you and want you to do half the setup before they even start the job. Every home is overpriced and so is most rent. We really need to rein in the greed that leads to all of this ridiculous pricing if we want to make any sort of progress.",
            "score": 12,
            "author": "FrontierForever",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Since most people were essentially forced into getting health insurance giving the people selling these ear drops free reign to jack the price up, as that money was guaranteed from the insurance companies.",
                            "score": 6,
                            "author": "FerociousFlame"
                        }
                    ]
                }
            ]
        }
    ]
}