{
    "id": "yvjde7",
    "score": 103819,
    "title": "Democrat Katie Hobbs defeats MAGA favorite Kari Lake in high-stakes race for governor in Arizona",
    "author": "slaysia",
    "date": 1668476928.0,
    "url": "https://www.reddit.com/r/politics/comments/yvjde7",
    "media_urls": [
        "https://www.nbcnews.com/politics/2022-election/democrat-katie-hobbs-defeats-maga-favorite-kari-lake-high-stakes-race-rcna55172?icid=election_results"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n **Special announcement:**\n \n r/politics is currently accepting new moderator applications.  If you want to help make this community a better place, consider [applying here today](https://www.reddit.com/r/politics/comments/sskg6a/rpolitics_is_looking_for_more_moderators/)!\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "This means Dems effectively canceled out losing the NV gov, so hot damn we had an amazing midterm for governors!",
            "score": 7433,
            "author": "ryanc533",
            "replies": [
                {
                    "level": 1,
                    "comment": "They will end up picking up 2 Gov seats with Maryland and now AZ\n\nEdit: 3 seats with MA. So a net of 2 pickups after losing NV, I believe.",
                    "score": 2735,
                    "author": "onken022",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "3, I believe. We flipped Massachusetts too.\n\nEdit: Y'all, I think Baker was a decent fellow. \n\nHowever, as the race was not between him and Healey, but between Healey and Diehl, who sucked Trump balls, it was an important win.\n\nSo for sure, the Republicans can thank Trump for another unforced error. The call was coming from inside the house!",
                            "score": 1475,
                            "author": "Petitcorbeaunoir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would have stayed R if it wasn't for Trump lmao. Charlie Baker had a very good relationship with Democrats in Massachusetts, and tbh he's not bad at all, you can argue he's to the left of Manchin ☠️☠️☠️\n\nEdit: I'd also like to add that Baker was pro choice.",
                                    "score": 870,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed. Baker was a pretty good gov all things considered. MA got the blue trifecta thanks to Trump.",
                                            "score": 493,
                                            "author": "Rapn3rd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Trump just made it easier.  I actually like Healey... nothing as bad as Patrick was, I seriously hope.  \nBaker never gave into Trump's bullshit and the party's bullshit alongside it... nevertheless, We were primed to vote Dem this year all the way (Abortion rights, etc.).  \n*Edit*  \nSomeone recently pointed out the state police scandal, and that is what I forgot was one of the biggies of Baker's fuckups here.",
                                                    "score": 179,
                                                    "author": "SilentR0b",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Shoulda coulda woulda\n\nWe still have a blue Governor. The republicans had a chance to run a Baker or a Scott and they gave us Diehl. Lmao",
                                            "score": 30,
                                            "author": "Smoaktreess",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; you can argue he's to the left of Manchin \n\nLol, no argument, he's absolutely to the left of Manchin.",
                                            "score": 26,
                                            "author": "PPvsFC_"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Baker really wasn’t bad. But that’s the problem with going full psycho as a party: people will stop voting for your candidates even if they themselves are decent because they can’t risk them deferring to the GQP",
                                    "score": 265,
                                    "author": "Guywithoutimage",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I truly believe Baker would've won this election easily, had he run again. Most people here really like him. \n\nI honestly don't understand what the MA GOP was thinking running Geoff Diehl - they may as well have served the governership to the Dems on a silver platter. Diehl was a typical MAGA type, endorsed by Trump - basically, a far cry from the usual moderate RINO governer that the otherwise-very-blue Massachusetts likes to elect. It's really no surprise that he lost spectacularly to Healey.",
                                            "score": 179,
                                            "author": "Cammibird",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I voted for Baker and don’t love Healey but you’re spot on, many MA moderates abhor Trump and the MAGA brand. Take that crap to Arkansas, no MAGA R will ever get my vote. Joe Biden could be “Weekend at Biden’s” and I’d still vote for him because the people pulling the strings are competent and not a bunch of sycophants and family members looking for personal gain instead of what’s best for the nation.",
                                                    "score": 30,
                                                    "author": "uconnboston"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "MAGA is identity politics. Someone like Baker doesn’t fit in the tent anymore, so the MAGA’s by definition wouldn’t try and have him replaced by someone like him.",
                                                    "score": 30,
                                                    "author": "Tacitus111",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well, Trump handed that one on a platter by forcing the incumbent out. But it counts!",
                                    "score": 63,
                                    "author": "Joshduman",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And Massachusetts!",
                            "score": 92,
                            "author": "Bigwheatcollector",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Awesome seeing AZ turn blue\n\nEdit: as some have pointed out, AZ is still a purple state, but I find it amusing that it turned blue after all the election denying from republicans. I also don't think being blue is some kind of magic bullet, but it's miles better than the anti science from the right.",
                    "score": 625,
                    "author": "gumbercules6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Trump should have never fucked with McCain.\n\nThis is what happens.",
                            "score": 727,
                            "author": "PussySmasher42069420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Far from a sure thing. These races were too close for comfort for how crazy these people are.",
                                    "score": 400,
                                    "author": "azwildguide",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Is it really though? AZ was a red state in presidental elections with the exception of Biden and Clinton they voted mostly Republican since the 50s. Their governors have been 50/50. The fact its shifting blue in general is a good thing even if it's just slight margins for now. It's even better considering that this was supposed to be a Red Wave with how our economy is doing and inflation yet it did not happen. Republicans had every single  election state and national that weren't heavily Democrat leaning handed to them on a Sliver platter for the taking and they fumbled that bag wanting a turd on a golden Trump plate.",
                                            "score": 162,
                                            "author": "pwn3dbyth3n00b",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I live in Arizona and it really is far from a sure thing. I think the shift blue we are seeing is more of a rebuke to MAGA and election denialism. Any traditionally conservative republican still wins hands down in AZ. Now that we have seen how bad election deniers have done across the country in general, my guess is we will see the pivot away from extreme MAGA republican candidates, like Kari Lake. We’ll still see examples of MAGA republicans and we’ll still hear about them all the time because they make for great news, but their messages just don’t resonate with enough voters.",
                                                    "score": 55,
                                                    "author": "GiftedTaco",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Simultaneously, Kelly won handily, and he’s very much not John McCain. Arizona is just trending more blue while still very much being purple.",
                                    "score": 85,
                                    "author": "Tacitus111",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dems need to go all in on making sure Nevada and Arizona stay blue.",
                                            "score": 23,
                                            "author": "arod303",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a win!  Another election denier goes down - in favor of the person who ran Arizona's 2020 election.\n\n**But we're not done yet!!!**  California still offers several weeks to cure ballots that were rejected for signature reasons, and that could push some Dems in House races over the line.  And in three weeks, Raphael Warnock has to defend Senate seat #51.  Your efforts could help win both!\n\nKeep on working hard and we'll be even closer to saving our country!  Come to r/VoteDEM if you're ready to get to work!",
            "score": 3493,
            "author": "table_fireplace",
            "replies": [
                {
                    "level": 1,
                    "comment": "GA blue voter here; we’re going to do our part to help our boy",
                    "score": 1270,
                    "author": "Darkhallows27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You guys did so well in 2020, thank you so much! I dont think 2022 would have been possible without that!",
                            "score": 502,
                            "author": "account_for_norm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Still sad that Abrams lost, but keeping Warnock in the seat is the consolation prize.  Go Georgia",
                                    "score": 263,
                                    "author": "GhostlyRuse",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People were splitting the ticket on this if you look at the numbers. Kemp shad more votes than walker did, as did Warnock than Abrams. I think it's a really good sign for Warnock honestly. Does suck  for Abrams though.",
                                            "score": 81,
                                            "author": "Derbeck6",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think it helped that Kemp pushed back against Trump. He didn’t have Trump’s support, and that may have actually *helped* him win compared to Walker.",
                                                    "score": 46,
                                                    "author": "Vegetable-Double",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "GA is the only reason we got any of the legislation passed that we did. It's the only reason Bidens judge was confirmed. \n\nGA's voters may have saved democracy. (Only being a little hyperbolic).",
                                    "score": 75,
                                    "author": "dachsj",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "CA just recieved my ballot. It took like a week for Porter to win her first election because of how many mail in ballots we have.",
                    "score": 95,
                    "author": "nolander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Katie Porter..CA47 candidate..Orange County candidate that yall got free covid testing.. Grateful 🙏 and Thankful for her and her whiteboard. \n\nKatie Porter got covid free testing for the US..3 min video..I urge you to watch this video as we have all used covid testing multiple times for free. \n\nhttps://youtu.be/mKvCAR0Akro\n\nKatie Porter grilling Chase CEO Jamie Dimon..5 mins \n\nhttps://youtu.be/2WLuuCM6Ej0\n\nKatie Porter grills Pharma CEO on price gouging \n\nhttps://youtu.be/arduwbwYB_w\n\nKatie Porter grilling then Housing Secretary Ben Carson \n\nhttps://youtu.be/sVWy3q2kmNM\n\nHow companies drive inflation - 7 min video\n\nhttps://youtu.be/NY1P1N00BZ8\n\n\nWe have someone who used to teach in College and then you have MTG and Bobo who barely passed GED.  Here is someone who speaks to you in a way you can understand and you have Bobo who can barely speak. \n\nKevin McCarthy super PAC gave 8 mill to Porters opponent, whereas Democrat leadership gave 300k to Porter.\n\nYes it is CA, but Orange County is very RED. I hope she wins. Not all heroes wear capes.",
                            "score": 97,
                            "author": "Rammiek",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly, her whiteboard is kind of a superhero icon tho...",
                                    "score": 27,
                                    "author": "veggiecoparent"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Axios has a nice little tracker to see which election deniers have won and lost their elections](https://www.axios.com/2022/11/09/election-deniers-ballot-trump-midterm-elections).",
                    "score": 162,
                    "author": "IBJON",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "A victory against MAGAism. A victory for America. Thank you Arizona.",
            "score": 5199,
            "author": "ttownfeen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck MAGA.",
                    "score": 2214,
                    "author": "CrazyLegs17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a Phoenician living in the middle of a bunch of MAGA fools, unequivocally FUCK MAGA",
                            "score": 1106,
                            "author": "OgDimension",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait, people from Phoenix are called Phoenicians?\n\nThat's fantastic!",
                                    "score": 398,
                                    "author": "MasterXaios",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lots of fun little stuff like that. People from Minneapolis are Minneapolitans.",
                                            "score": 44,
                                            "author": "Nervous_Constant_642",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kari Lake, get absolutely fucked",
            "score": 7143,
            "author": "AlexanderLavender",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a shame she’ll never have her own subreddit like r/FuckGregAbbott",
                    "score": 1699,
                    "author": "JunkyDragon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please join r/fuckmitchmcconnell",
                            "score": 332,
                            "author": "august_west_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or the slightly more subtly  named /r/badturtlenolettuce",
                                    "score": 58,
                                    "author": "StackedReverb",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You just know this ghoul and her minions are going to be whinging on Fox News for the next few weeks about a rigged election and calling for recounts, and election fraud investigations.\n\nNo doubt she'll probably appear on Carlson and that MyPillow reject's podcast to talk about the rampant fraud.\n\nBut after some time she'll fade into the background and maybe we won't have to see her terrifying face anymore.",
                    "score": 383,
                    "author": "imsowhiteandnerdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who are you kidding? She wants a job at one of those networks 😒",
                            "score": 83,
                            "author": "gokiburi_sandwich",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Side note: I’d thought for a long time that “whinging” was a misspelling of “whining”. Turns out, it’s a British verb. TIL.",
                            "score": 19,
                            "author": "lunaflect",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As an Arizonan, I support this message.",
                    "score": 298,
                    "author": "Hayduke_Deckard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As an Arizonan, I'm fucking speechless. I'm so happy right now.",
                            "score": 100,
                            "author": "Archer-Saurus",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huge... a big upset based on polling but an ENORMOUS win for sanity. Election Deniers pulled the 0-fer in big races.",
            "score": 2473,
            "author": "MC_Fap_Commander",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup,  538 had Kati Lake forecasted at a 68% chance to win going into Election Day.\n\nhttps://projects.fivethirtyeight.com/2022-election-forecast/governor/\n\nEdit:  which yes I know, it isn’t *that* big of an upset.  Still glad to see!",
                    "score": 844,
                    "author": "Oleg101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair a 32% chance of winning is still really high. That’s one in three.",
                            "score": 383,
                            "author": "Blerty_the_Boss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People fundamentally misunderstand this all the time. Most people assume if you have over a 50% chance that means you’re going to win.",
                                    "score": 373,
                                    "author": "HungryDust",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think especially in politics, it's easy to make a mistaken connection between \"68% to win\" (good odds but not insurmountable) with \"expected 68% of the vote\" (a supermassive blowout that would be impossible to overcome). Those two are very much not the same but they look very similar to the pattern-seeking parts of our brains.",
                                            "score": 238,
                                            "author": "Heyyy_ItsCaitlyn",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "More than 50% of the time, they're right.",
                                            "score": 126,
                                            "author": "abstractConceptName",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sanity. I feel like that’s been on the ballot just as seriously as democracy was on the ballot. \n\nI’m sick to god damn death of people who refuse to acknowledge objective reality. It’s wildly dangerous. Like, each party can spin things to their advantage. We can argue about who believes in and supports things like “freedom” more. But we must agree on objective truth.",
                    "score": 204,
                    "author": "KellyJoyRuntBunny",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m glad Katie Hobbs won. Kari Lake is a far-right, MAGA conspiracy theorist and it is dangerous for her to be anywhere near the governor’s mansion. Arizona made the right decision. \nThis midterm election is a disaster for Republicans at all levels. They predicted a red wave from Congress all the way to state races. Instead, it was a drip.",
            "score": 1274,
            "author": "Centrist-He-Him",
            "replies": [
                {
                    "level": 1,
                    "comment": "To quote Stephen Colbert: \"the red wave was more like a pink splash- kinda like when you accidentally wash your klan robe with your maga hat\"",
                    "score": 1176,
                    "author": "Pseudonym0101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 236,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "A rosy wash*",
                            "score": 34,
                            "author": "TheExtremistModerate"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing in the world like watching crazy republicans go down in flames.",
            "score": 11880,
            "author": "fattymcassface",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hers is particularly delicious due to all the shit-talking she's done recently",
                    "score": 1868,
                    "author": "Meth_Useler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And the fact that she crapped on Trump back in 2015 but flipped to MAGA when she thought it would help her career.\n\nThese people are worse than the true believers.",
                            "score": 1573,
                            "author": "UglyWanKanobi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My main reason for hating her is one of the simpler ones:\n\nShe used to have gay friends, went to drag shows and stuff. Then she decided to become a maga politician and not only disavowed all that stuff but straight up lied saying she was never friends with the gay guy (I think Drag Queen) who she was friends with and I think even brought her little kid to a party with them or something. The details Escape me but the gist is correct; basically she’s a vile human being, almost even viler than ones who were always crazy maga.",
                                    "score": 1099,
                                    "author": "juju611x",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep, Barbra Seville was the Queen, who got slapped with a cease-and-desist for claiming that Lake was a regular attendee. Seville responded with photos of the two of them in drag together, which Lake's side claimed was taken at \"an impersonation show, not a drag show\".",
                                            "score": 719,
                                            "author": "britishben",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Photographic proof = Fake news to these people.",
                                                    "score": 391,
                                                    "author": "AlienRosie",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m really surprised we haven’t heard the shaggy defense yet.",
                                                            "score": 90,
                                                            "author": "IntravenusDeMilo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Mrs. Lake, we caught you red-handed...\n\n***It wasn't me***",
                                                                    "score": 43,
                                                                    "author": "steveatari"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Trump did deny that the Access Hollywood tape wasn't him at one point.",
                                                                    "score": 24,
                                                                    "author": "Mickyfrickles",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Religion.  They are brainwashed from a young age that denying evidence makes you a better Christian, a TRUE believer.  So, rational thought= I'm bad, not a true believer.",
                                                            "score": 60,
                                                            "author": "sheepcrate",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah but not Kari. She used to call herself a Buddhist. In the past few years she converted to Christianity, convenient. She flip flops whenever it suits her. Republican until literally the day after Obama won Iowa and the winds were moving in his direction. Back to republican in 2012. She’s vile and just a grifter like the rest of maga.",
                                                                    "score": 38,
                                                                    "author": "dyslexicsuntied"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "There’s some delicious irony to these ‘conservatives’ having to live a lie, while drag queens are out and proud.",
                                                    "score": 25,
                                                    "author": "briareus08"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The fact that she came as close as she did to winning is pretty scary.",
                                    "score": 135,
                                    "author": "distressedacorn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 98,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Too bad she’s blocked half of AZ on Twitter, we could send her our condolences.",
                            "score": 371,
                            "author": "danjouswoodenhand",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lake eventually blocked me.  \n\n\nBut the \"Hair Trigger Award\" belongs to Kelli Ward, Chairman of AZGOP.  She blocked after one tweet, just asking her to explain why Trump won after he lost multiple times in court for lack of evidence.",
                                    "score": 300,
                                    "author": "AZScienceTeacher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you for your service.",
                                            "score": 108,
                                            "author": "reekHavok",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Arizona sends its regards",
                                    "score": 192,
                                    "author": "KnightRising21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"I want her to know it was me\"",
                                            "score": 203,
                                            "author": "Christ_votes_dem",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And the words of the wise Sir Nelson rang out across the lands… \n\n&gt;!           Ha          !&lt; &gt;!         ha!               !&lt;",
                    "score": 3565,
                    "author": "Casual_hex_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or the Republican favorite: *Womp Womp*",
                            "score": 1186,
                            "author": "Daniiiiii",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sad trombone is also acceptable",
                                    "score": 833,
                                    "author": "SirMikan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sad Price is Right ~~trombone~~ *tuba* to be specific.\n\nedit: I stand corrected",
                                            "score": 294,
                                            "author": "presidentsday",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Price is right is tuba not trombone legally have to say that as tuba player",
                                                    "score": 141,
                                                    "author": "drusteeby",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; crazy republicans\n\nKari Lake was a fascist though. It’s always good to see a fascist go down in flames :)",
                    "score": 553,
                    "author": "mountaintop111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The overlap with fascist and crazy Republican in the US right now is...",
                            "score": 448,
                            "author": "brian42jacket",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am going to head over to r/conservative. It’s going to be entertaining reading the comments there 😄",
                    "score": 379,
                    "author": "AwakPungo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did that the night they announced the democrats kept the senate. I was actually surprised how level-headed a lot of the top comments were.\n\nEdit: just checked in again. Lots of “no true Scotsman” going on over there right now 🤣",
                            "score": 392,
                            "author": "fattymcassface",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If this election cycle is anything like 2020 you just need to wait a few more days. By the end of the week it will be non-stop conspiracy theories about how the democrats stole all their wins in Arizona, Georgia, Nevada etc...",
                                    "score": 319,
                                    "author": "umm_like_totes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bingo, they will figure out more cartoonishly insane excuses to justify themselves, and deflect any wrong doing back at Democrats. They just need a little time to “fix their messaging”.\n\nSee: January 6th and the two weeks of floundering, incoherent Conservative arguments until they found some talking points that stuck better than the others.",
                                            "score": 132,
                                            "author": "pootiecakes",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You are correct.  Though that started with Lake when she decided to run.   It’s been none stop with her. So no surprise there.   She knew a couple of days ago it wasn’t looking good. She has been in az politics for a long time covering it as a news reader for local fox.  She knew when she saw the numbers what was up.   \n\nShe will come up with all kinds of bullshit. Mealteam 6 will come out of the local dennys hooting and hollering and then crickets.   She might end up being trumps running mate still.  But if not, she is done.  She has absolutely nothing to fall back on.   This was her only play.",
                                            "score": 39,
                                            "author": "BarbequedYeti",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Bear in mind they did the same soul searching after Obama crushed them, and came to the conclusion that they should be the tea party.",
                                    "score": 173,
                                    "author": "PinchesTheCrab",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Every time they soul search, they invariably conclude that they need to double down on crazy.",
                                            "score": 62,
                                            "author": "banned_after_12years",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think I'm shadow banned over there. Any thread I click on redirects me to a flaired user only midterm election megathread where I can't see any comments. I have heard that posting in this subreddit earns you a ban there. That's funny considering the conservative \"don't trample on my freedoms\"stance.",
                            "score": 68,
                            "author": "YouAlreadyShnow",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For y'all not from AZ.  If Lake and Finchem won it would have been a total shit show for the next 4 years.    I like it when there aren't law suits and scandals every other week like when Arpaio (Maricopa county sheriff) was in office.\n\nWe've had two R governors that were either impeached or had to resign b/c of scandals -- like felony level shit.\n\nEDIT: And as a comparison, the incumbent R state treasurer won her election by a huge number.  She got more votes than any other individual candidate.  Why?  She's not nuts",
            "score": 1000,
            "author": "unclefire",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t think people realize (both the left and right) that if the republicans actually have brains to elect non insane people they actually have a really good chance of winning over dems. Yet the republicans keep pandering with these Qanons and election denying morons. \n\nRegardless what the left think of someone like Youngkin, if that guy wins a republican presidential primary (doubly because they’re morons) and partner him with Sears. I guarantee you they would win the white house at the general elec.",
                    "score": 115,
                    "author": "daggeroflies",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "excited to see even more unhinged kari lake interviews with the extremely high depth of field that makes her look like a starcraft talking head",
            "score": 1175,
            "author": "PRIMEBIRD",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will not be stopped. Not by you, or the Confederates, or the Protoss or anyone! I will rule this sector or see it burnt to ashes around me.",
                    "score": 315,
                    "author": "comcoast",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I saw a video of her talking and I had the immediate impulse to hit the button to skip, like I was watching a cut scene.",
                    "score": 168,
                    "author": "Saxamaphooone",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Turns out she won the debate.",
            "score": 2041,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll be honest, I thought skipping the debate was a stupid move, only confirmed by her tanking in the polls afterwards. \n\nTurns out it was the winning move after all.",
                    "score": 920,
                    "author": "Areyouguysateam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just because she won doesn't mean it wasn't a bad move. Even if in the worst case scenario she \"lost\" that debate, it would have been bad press for a few days and then everyone would move on. Instead she got clobbered with her refusal to debate for a month straight. It definitely hurt her and that's a big part of why her race was so much closer than Mark Kelly's. \n\nI'm certainly glad she won but I'm afraid people will draw the wrong lessons from it.",
                            "score": 741,
                            "author": "PepsiMoondog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 436,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd recommend listening to [this podcast](https://thefocusgroup.thebulwark.com/p/arizona-psychologically-unfun-with#details). The host conducts focus groups across the country and this one was in Arizona. Swing voters REALLY do not like it when a candidate refuses to debate.",
                                            "score": 301,
                                            "author": "PepsiMoondog",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "i didnt hear a single thing about Kelly vs Masters debate to the point of not even knowing they had a debate, showing that not doing the debate brought far more negative attention than bombing in the debate ever could",
                                    "score": 189,
                                    "author": "amjhwk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same with Fetterman, as bad as his performance was (no fault of his own, it was the stroke) he gave Oz just enough rope to string himself up with the \"local politicians\" line",
                                            "score": 123,
                                            "author": "cinemachick",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The \"local politicians\"-line was by far the biggest talking point after, despite Fetterman not debating well.",
                                                    "score": 78,
                                                    "author": "_mort1_",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Proud Arizonan right here",
            "score": 458,
            "author": "freshprinceofkeizer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Democrats smacked the shit out of MAGA and have been since 2018.",
            "score": 764,
            "author": "cameratoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trump is 0-3 since he won the election in 2016.",
                    "score": 193,
                    "author": "Vegetable-Double",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Truly one of America's biggest losers.",
                            "score": 92,
                            "author": "cameratoo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A lot of people are saying he's the biggliest loser",
                                    "score": 43,
                                    "author": "Yeti-420-69",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;The establishment-side of the GOP is dying. This is Trump's GOP. -Kari Lake \n\nHow'd that age for you Kari?",
            "score": 270,
            "author": "DiabetesFairy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is such great news! I'm so happy.",
            "score": 401,
            "author": "Critical_Aspect",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know i am a fellow Arizonan and I’m euphoric!!",
                    "score": 96,
                    "author": "3eemo",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m so relieved!",
                    "score": 89,
                    "author": "WhereRtheTacos",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re really quiet you can hear the sound of Kari Lake’s head exploding. My god, she is going to go ballistic. I just keep refreshing her Twitter account. 🍿",
            "score": 528,
            "author": "minitrr",
            "replies": [
                {
                    "level": 1,
                    "comment": "She WANTS to say some shit but her lawyer wrestled the phone away.",
                    "score": 240,
                    "author": "MC_Fap_Commander",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Meanwhile her doctor pumped her full of mopium.",
                            "score": 105,
                            "author": "Michael_In_Cascadia",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apparently, Rudy Guliani and the My Pillow Guy are holding a press conference later tonight outside The Smithsonian to report some irregularities they found with the voting in Maricopa County.\n\nedit: Sorry, for clarification, it is The Smithsonian Bakery outside Dubuque, Iowa. Stay tuned for more updates.",
            "score": 241,
            "author": "gloomyglooom",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The Smithsonian Bakery\n\nFollowed by a reception at the Ritz-Carlton (Adult Video and Vape Shop) in Hoboken.",
                    "score": 44,
                    "author": "Frequent-Shape6950",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kari Lake called John McCain a loser. Who’s the loser now? 😂",
            "score": 852,
            "author": "TurningHelix",
            "replies": [
                {
                    "level": 1,
                    "comment": "McCain reached out from the afterlife and f'ed the GOP.  :-)",
                    "score": 350,
                    "author": "unclefire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s worth remembering that the very last thing John McCain did in life…was prevent them from repealing Obamacare",
                            "score": 369,
                            "author": "Romas_chicken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. After all that history, he was the one that saved it. Incredible ending.",
                                    "score": 151,
                                    "author": "tony-toon15",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "No matter how much shit they talk about John McCain, his legacy will always outclass everything they done in their lifetime.",
                                    "score": 76,
                                    "author": "frozt"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even though I'm across the nation, this is one I was watching closely. Kari Lake is such a steaming pile of hot diarrhea, she exemplifies the very worst of the Trump era. \n\nShe can get fucked.",
            "score": 232,
            "author": "wellarmedsheep",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Do Boebert next.",
            "score": 76,
            "author": "DiscussionAncient810",
            "replies": []
        },
        {
            "level": 0,
            "comment": "To all my fellow Arizona democratic voters, I am so proud of all of you!! We sent fascism packing!!",
            "score": 73,
            "author": "3eemo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Here's to the, \"fuck your feelings,\" crowd feeling all sorts of ways, this week. May Kari Lake and the entire bottom shelf that makes up the GOP base live long upset and die mad about it. Cheers!",
            "score": 210,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Suckit, ya fascists",
            "score": 68,
            "author": "Ya_Got_GOT"
        },
        {
            "level": 0,
            "comment": "Next time some of you shit on Arizona as a brain dead Republican state, just know there are a ton of us out here voting blue in recent years. Democrats should put more money into AZ going forward.",
            "score": 68,
            "author": "cheshire_bodega_cat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Even though Republicans will probably win the house this was the second best possible outcome for the Dems.",
            "score": 408,
            "author": "champdo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now just give us a Boebert L, and I'll be happy.\n\nEdit: I lied, if Porter loses I'll be unhappy.",
                    "score": 263,
                    "author": "Vlad_the_Homeowner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, we got greedy after the surprising turn of events. Bobo losing will satisfy me, though.",
                            "score": 101,
                            "author": "drkgodess",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree. Seeing the House very slowly go to a very narrow Republican majority has been disappointing. But if you told me a week ago that Democrats would keep the Senate, win every swing state secretary of state office and governorship with only one exception (Nevada governor), and flip a few state legislative chambers their way even if the House goes red I'd have been absolutely thrilled. Not literally the best case scenario conceivable, but significantly better than the doomsday we were all worried about.",
                    "score": 170,
                    "author": "AlwaysBeTextin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here's a note of optimism:\n\nSignificantly more Americans are living in states controlled/represented by Democrats now than before the election.\n\nStates can get a LOT done even if the Federal government is gridlocked.\n\nI believe more Americans are represented by Democratic Governors than Republican ones for the first time in... the better part of a century? Crazy stuff.",
                            "score": 143,
                            "author": "Spicey123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "States are more important because they control electoral integrity and voter rights.",
                                    "score": 37,
                                    "author": "fakeuser515357",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It makes me excited for 2024. That Blue Wave may actually become reality.",
                                    "score": 34,
                                    "author": "token_reddit",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And way beyond expectations. Vs a blood red map, Joe brought it home. Well done, Dems. Great show.",
                    "score": 89,
                    "author": "Nwcray",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biggest loser after Lake is Kristen Sinema. She rejected her whole party on the gamble Mark Kelly and Katie Hobbs would be defeated, and she can use it to justify her obstructionism and endear her to the Republicans. Now Kelly is back, Hobbs won, the whole state party is united against her, and she’s just someone who blocked the platform they won across the state on.",
            "score": 433,
            "author": "zxc999",
            "replies": [
                {
                    "level": 1,
                    "comment": "From your keyboard to God's ears",
                    "score": 170,
                    "author": "CalmDirection8",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ruben Gallego basically told her he's coming for her in 2024. she should announce she's not running for re election and skulk off into the night",
                    "score": 155,
                    "author": "thefilmer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "he is going to crush her in the primary, and he has bonafides similar to Kelly.  He is harvard educate and a marine that served in combat, and being hispanic in AZ doesnt hurt",
                            "score": 66,
                            "author": "amjhwk"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 44,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even if she does, she’s screwed. She’d lose a GOP primary. They like her as a useful, corrupt Democrat, but they’d replace her in a heartbeat with their own person.",
                                    "score": 48,
                                    "author": "Tacitus111"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 73,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank goodness.",
            "score": 50,
            "author": "lotero89"
        },
        {
            "level": 0,
            "comment": "Liz Cheney just owned Lake on Twitter. 🤣",
            "score": 55,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Glad I knocked on doors and phone banked for Hobbs and Kelly!!! \n\nYes AZ my home state isn't complete trash",
            "score": 146,
            "author": "Ramza_Claus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sanity wins!",
            "score": 138,
            "author": "janzeera",
            "replies": [
                {
                    "level": 1,
                    "comment": "Barely!! 25,000 out 2.5 million votes.",
                    "score": 82,
                    "author": "JunkyDragon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Remember, Biden only won Arizona by 11,000. So Hobbs overperformed.",
                            "score": 120,
                            "author": "disightful",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the fascists are losing. I feel hopeful for the first time in a long time",
            "score": 49,
            "author": "rp_361"
        },
        {
            "level": 0,
            "comment": "Get fucked fascists.\n\nStill too close for comfort.  But one victory at a time.",
            "score": 284,
            "author": "jethroguardian",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fuck Kari Lakes for her election denialism. And fuck Trump.\n\nAnother win for democracy and the good guys!",
            "score": 205,
            "author": "mountaintop111",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"Oh yeah, it's all coming together\" - Republicans",
            "score": 40,
            "author": "masq_yimby",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m an Arizonan, I gladly voted for Hobbs so I’m incredibly happy to see this. it’s funny because it’s not only about what it means for me as a woman &amp; a citizen, but for the rest of the state too. Lake would have been *horrible* for Arizona, a spitting image of Trump &amp; nonsense.  she would have left a stain on this state. \n\nthis election was scarily close, but this race was significant in a special way - at no point did Lake take the lead. *not once*. the most commotion that happened during the 2020 election was when Trump was in the lead and then as more votes were counted, lost that. Lake didn’t have the opportunity to point to that. neither did Blake Masters, i’m pretty sure. they’re obviously still going to call fraud (&amp; already have) but it’s going to be harder.",
            "score": 43,
            "author": "xjulesx21",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The fact that it was close is scary.",
            "score": 185,
            "author": "ATX_native",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats the saddest part. Because I keep telling my friends, its not that I think there's an army of crazy maga larpers to go civil war in streets. Its that I'm worried that there's 1 in 50,000 who are going to go March into a state capitol or DNC office, or school union meeting, and shoot the place up or lob molotov. Those odds create a lot more people than I thought were out there when I see these 50/50 splits in big elections.  The fact that we're having dead heat hand counted races with candidates like Bobert and Lake and Walker is just very very disheartening for the next 2 years.",
                    "score": 40,
                    "author": "Gryphin",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Like Walker-Warnock. Like Boebert-Frisch. What in the hell happened to this country. These razor thin races don't make sense to me. The new Republican't party.",
                    "score": 149,
                    "author": "GarbageMan59",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Governor Brian Kemp authorized hand-picked individuals to disenfranchise 130,000 Georgia voters this year.",
                            "score": 79,
                            "author": "OmManiMantra",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's massive for 2024.",
            "score": 33,
            "author": "seymourputts"
        },
        {
            "level": 0,
            "comment": "We drained the lake!! Let's fucking go Arizona!!!",
            "score": 216,
            "author": "Azguy303",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol brilliant.",
                    "score": 19,
                    "author": "jethroguardian",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Kari Lake right now.](https://c.tenor.com/bT3molQotGEAAAAd/robin-hood-i-lost.gif)",
            "score": 30,
            "author": "SpaceBeer_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lake was the most un-likable candidate I’ve ever seen.  Running as the Karen from hell was a stupid move.  She has the charisma of Ursula from the little mermaid.",
            "score": 31,
            "author": "bt2184",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Kari Lake? More like cry a lake.",
            "score": 27,
            "author": "Niyazali_Haneef",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You guys remember all the red wave guys preening and strutting on November 8th?",
            "score": 25,
            "author": "BroccoliFartFuhrer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Election deniers in swing states still batting .000 💪",
            "score": 30,
            "author": "scottthang",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Kudos to all the Gen Z people in AZ who made sure that pro-Trump nut Kari Lake didn't take office and spread her election-denying hatred!",
            "score": 24,
            "author": "Kirby_Israel",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A little Haiku from Philly\n\n\nGoodbye  Kari Lake\n\nYou were a complete asshole\n\nBack to my cheese steak",
            "score": 26,
            "author": "massivetypo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good riddance, Kari Lake! Hope I never hear from this moron again.",
            "score": 74,
            "author": "MNUnitedFan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The only R to win big in AZ was Yee, who also happens to not be a maga freak or election denier.  Maybe the GOP should seriously consider going another direction.",
            "score": 25,
            "author": "danjouswoodenhand",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Buh-bye, Lake.",
            "score": 23,
            "author": "shadearg"
        },
        {
            "level": 0,
            "comment": "Elections deniers are out in full force tonight, swarming the hive minds of reddit and getting one another riled up. The plague has been contained, but it still festers in the night",
            "score": 23,
            "author": "Whoopziedaisy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fucking : WHEW! Good job AZ… barely.",
            "score": 66,
            "author": "InventasBam",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You're welcome, America.\n\n-An Arizonan.",
            "score": 64,
            "author": "ArturosDad",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank goodness!  A razor thin win, yes.  But keep these monsters who keep trying to sow distrust in our elections far, far away from any office.",
            "score": 22,
            "author": "Silver-Legs"
        },
        {
            "level": 0,
            "comment": "Kari Lake is a disgusting human being. So happy for the good people of Arizona to see them dump that trash.",
            "score": 21,
            "author": "TheOtherUprising"
        },
        {
            "level": 0,
            "comment": "Charlie Kirk (who moved his whole operation to AZ because of Kari Lake) extreme copium right now: [live stream](https://www.youtube.com/watch?v=RJ6ORwtopGw)",
            "score": 188,
            "author": "Chadwiko",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 88,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They’re just coping and talking about how baffling it is that they could lose when the polls favored them by so much.",
                            "score": 61,
                            "author": "Galappy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Weren't they mad that polls skewed Democrat in 2016 ? They had no problems with the it then...",
                                    "score": 57,
                                    "author": "Azguy303"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh my god these people are delusional",
                    "score": 77,
                    "author": "commercialband6"
                },
                {
                    "level": 1,
                    "comment": "I thought it was just the meme images but no, he really does look like a giant thumb.",
                    "score": 60,
                    "author": "JunkyDragon",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Of course the very first thing I hear when I get in there is “legal cheating” which they described as “targeting college campuses and senior citizens.” That’s just called campaigning and specifically campaigning to your most beneficial demographics. They’ll do whatever they can to sow doubt in the minds of people.",
                    "score": 56,
                    "author": "Galappy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Lol he said he doesn’t understand gods plan",
                    "score": 25,
                    "author": "MilkWeedSeeds",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "All election deniers running for statewide office in swing states have lost.\n\nSUCK IT LOSERS!",
            "score": 19,
            "author": "thedubiousstylus"
        },
        {
            "level": 0,
            "comment": "I know people get mad when I praise Liz Cheney -- even though we're all fully aware of who she is.\n\nBut if you subtracted Liz Cheney from the last two years, I honestly think the midterms would have turned out much differently.\n\nIt's okay to admit when a bad person does a good thing.",
            "score": 18,
            "author": "Infidel8",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We are all rejoicing here. My inlaws called us, friends texted. We are so damned relieved. \n\n\nNo crazy tv lady. No serial killer vibe dude. \n\nYay us! I have a feeling that AZ is going to go more and more blue like NM, based on demographics.",
            "score": 21,
            "author": "fatesarchitect",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’ve voted straight republican my entire life.\n\nThat changed 6 days ago and I’m happy to say I helped Hobbs beat the absolute nut that is Kari Lake.",
            "score": 694,
            "author": "PoinDawg22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Salute",
                    "score": 142,
                    "author": "100_emoji_"
                },
                {
                    "level": 1,
                    "comment": "Thank you, neighbor!!",
                    "score": 97,
                    "author": "ArturosDad",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I voted for Hobbs too. Said outloud “fuck you kari lake” when I filled in the bubble for Hobbs, was so happy she won. Lake is fucking insane",
                    "score": 86,
                    "author": "adam2222",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "High five",
                    "score": 61,
                    "author": "SupertrampTrampStamp"
                },
                {
                    "level": 1,
                    "comment": "Thank you sir. I voted R for years myself. These days a lot of my positions have moved, but I'd like to think that I'd be as principled as you even if they hadn't. Godspeed.",
                    "score": 27,
                    "author": "why_did_you_make_me"
                },
                {
                    "level": 1,
                    "comment": "Respect",
                    "score": 20,
                    "author": "HannahsMirror"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My soul is at peace. These motherfuckers held our country hostage for 6 years. Killed Millions of Americans, compromised our national security, sold nuclear secrets, and made us doom-scroll every minut detail of it. This is not the America I thought it was. We need to get rid of this racist virus.",
            "score": 19,
            "author": "Interneteno",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fox News in full meltdown mode tonight, and I am 100% here for it.",
            "score": 19,
            "author": "ArturosDad"
        },
        {
            "level": 0,
            "comment": "The cope in r/conservative is great. “Its the mail in voting! The democrats are using it to their advantage” Only because your party is so dead set on trying to limit voting as much as possible that they will discourage their constituents from voting in hopes that some minorities will be disenfranchised along with them. When more people vote, liberal (and hopefully actual progressive) candidates and idea win",
            "score": 20,
            "author": "[deleted]",
            "replies": []
        }
    ]
}