{
    "id": "12yzzyb",
    "score": 8,
    "title": "Are people here extremely smart?",
    "author": "SquilliamFancysonI",
    "date": 1682466027.0,
    "url": "https://www.reddit.com/r/Colby/comments/12yzzyb",
    "media_urls": [],
    "other_urls": [],
    "postText": "The acceptance rate was around 6% this year, does that cause the student body to be \"smart\" and high achieving? I mean that in both the positive way (intellectual, goal driven, interesting) and the negative way (preppy, elitist, too focused to have fun)\n\nThank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly, there is kind of a big range of intelligence here. A lot of the student population are recruited athletes which means they don't need to be insanely smart to get in, but on the other hand, there are really smart and high achieving people here. Regardless, I think probably around 80-90% of the student body is hard working and high achieving.",
            "score": 9,
            "author": "Junno1x"
        },
        {
            "level": 0,
            "comment": "You should also note that Colby benefits from an unusually large applicant pool, as there is no cost to apply and no additional essay necessary.",
            "score": 7,
            "author": "ethanwe"
        },
        {
            "level": 0,
            "comment": "I think the bigger split in intelligence/work ethic is probably between the well-off private school kids who really wanted to go to Colby and are full pay vs the public school kids who snagged a great scholarship and attended because of the money.\n\nPretty much everyone is really capable and smart but a lot of the time it was the former group who didn’t prep for class as well as they could have. Obv a big generalization but this is what I noticed in my time at Colby",
            "score": 3,
            "author": "SemiautomaticIbex"
        },
        {
            "level": 0,
            "comment": "I think for the most part everyone is smart enough. However I think most people are smart and NOT competitive if that’s what you’re worried about. Im sure things have changed since I graduated but this is what I noticed during my time and it wasn’t…that long ago lmao",
            "score": 1,
            "author": "Adventurous_Trust_32"
        },
        {
            "level": 0,
            "comment": "I think Colby is pretty average intelligence wise, only because there are such high extremes. There are really smart people who belong elsewhere and there are really stupid bastards. Also as someone else explained, Colby’s acceptance rate is extremely misleading. It used to be around 20% like 10 years ago. Makes it look a lot more prestigious than it actually is",
            "score": 1,
            "author": "nql4263"
        }
    ]
}