{
    "id": "tkrwaw",
    "score": 17,
    "title": "I got into Colby a few days ago, and I wanted to ask some questions :)",
    "author": "Status-Dig-7035",
    "date": 1648035348.0,
    "url": "https://www.reddit.com/r/Colby/comments/tkrwaw",
    "media_urls": [],
    "other_urls": [],
    "postText": "\n•\t⁠How's the social life?\n\n•\tAre you stressed?\n\n•\tHow’s the food?(most important 😂)\n\n •\tHave you dealt with racism at the school? If yes, how did the school handle it?\n\n•\t⁠What's your favorite school tradition?\n\n•    What are the dorms like? Big/small/ similar to an apartment?\n\n•\t⁠What's your favorite part of the campus? \n\n•\t⁠What class do you most enjoy? Why?\n\n•\tOverall, would you recommend me committing to this school? If yes, why?\n\nThank you in advance for answering! :)",
    "comments": [
        {
            "level": 0,
            "comment": "Dorms are generally around 100sqft per person (200 for a double) though they can vary a lot building to building. Some are smaller some are larger. Overall nothing too fancy but they work fine. Some of the smaller ones can feel kinda cramped, and you won’t really have room for much in the way of furniture but I think that’s pretty par for the course for freshmen dorms at colleges. There are some nice suites and college-owned apartments that are available to juniors and seniors so housing does evolve with your time there",
            "score": 3,
            "author": "3quartersofacrouton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you have any issue with your roommate(s)?",
                    "score": 1,
                    "author": "Status-Dig-7035",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know of a few cases where roommates had a tough time together but I became pretty good friends with mine. I’d say the vast majority of times freshmen roommates get along well enough to coexist. Some become good friends, many don’t, but major problems are far less common",
                            "score": 2,
                            "author": "3quartersofacrouton"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Social life: can change a lot person to person, but I’d say one constant is that because Colby’s kinda far from major cities and Waterville doesn’t exactly have a night life, there tends to be a lot going on on campus. People will host parties out of their dorm rooms, usually the on campus senior apartments have a bunch going on on weekend nights, the school tends to host a fair amount of on campus activities (especially during JanPlan). Most people find a group of friends or a team or club that they tend to stick with but there’s a lot of overlap between groups, which I found nice. \n\nThere can be a social divide between non-athletes and athletes, especially with certain teams and when the teams were in season. Not being a varsity athlete, I still did become close with some varsity athletes, but I still felt like a lot of that group felt very separate. \n\nThat being said I had a great time at Colby. I found a few groups of friends I enjoyed, all of which morphed a fair amount year-to-year, and we’d play games, hang out, study together. I joined a few clubs, got close to the people in them, sometimes they’d host more unofficial events. Being on such a small campus did mean that I ran into people I knew all the time, which I really liked. Hopefully that helps? If you have any questions about specific clubs or teams I’d be happy to answer them",
            "score": 6,
            "author": "3quartersofacrouton"
        },
        {
            "level": 0,
            "comment": "Not an answer but I also really want answers to this because I am in the same boat!",
            "score": 3,
            "author": "pconti279",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same!",
                    "score": 2,
                    "author": "nobodyshippie1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As far as food goes I’d say in general it’s pretty good. Some people complain about it and I will admit sometimes it can be hit or miss, but what I’ve found is that there are some things the dining halls do well and some they struggle with, and you’ll get a sense of that over time. With three dining halls there are a fair amount of options, so if you check the menus before hand and choose where you go based on that, you’ll probably end up happy with your food a vast majority of the time",
            "score": 3,
            "author": "3quartersofacrouton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for answering! So basically the food is much better than school lunch in high school?",
                    "score": 3,
                    "author": "Status-Dig-7035",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha it was definitely better than my high school with much more variety",
                            "score": 2,
                            "author": "3quartersofacrouton",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for your answers! Could you please also elaborate on the weather? Is it cold, rainy, cloudy most of the time out there?",
                                    "score": 1,
                                    "author": "Sardor_Kirck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For sure! Is it cold? Yes. Winter (typically sub 32F, 0C with snow and ice) usually starts to hit in late October/November and last till late March. Around January it can be below 0F kinda regularly. It can be really beautiful but it’s not for everyone. \n\nOutside of that, the summers can get pretty hot/humid, and spring and autumn are gorgeous but short. \n\nThe region of New England has characteristically unpredictable weather, where it can be cold and wet one day and beautiful the next, so it’s rare to have extensive period of clouds, but equally rare to have extensive periods of sun. I love the variation but you’ll definitely want to dress for it, which means layers you can add or remove as necessary",
                                            "score": 2,
                                            "author": "3quartersofacrouton"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Favorite class was probably history of the modern Middle East. I wasn’t a history major but I took it to fulfill the history requirement and ended up really loving it. The professor was a great story teller and a lot of fun so I ended up taking more with him",
            "score": 3,
            "author": "3quartersofacrouton"
        },
        {
            "level": 0,
            "comment": "As far as stress goes: it varied a lot. I’d say it really depends on the classes you take. My sophomore year I was feeling pretty over my head and was definitely very stressed, but I think a large part of that was due to me overcommitting to classes, extra-curriculars, and on-campus work. After that I got much better at balancing my time and I had stressful periods but never at that level. So I think people can definitely get pretty stressed but not everyone and not constantly. Thankfully professors can be pretty accommodating and students can try to balance their schedules accordingly",
            "score": 3,
            "author": "3quartersofacrouton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does Colby have an open curriculum?",
                    "score": 1,
                    "author": "Status-Dig-7035",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Colby has distribution requirements. They’re pretty open ended so I was able to knock off one or two with an AP test, and my art credit I got from a creative writing course. They’re thankfully not too difficult and I ended up enjoying many of the classes I took to check them off",
                            "score": 1,
                            "author": "3quartersofacrouton"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The food is amazing.  I taught there in 2013-2014, and I would always go down and eat lunch at the dining hall.  It's not like a 5-star restaurant, but it's better than any other campus dining hall I've eaten at, and I've eaten at quite a few.",
            "score": 3,
            "author": "paithanq",
            "replies": [
                {
                    "level": 1,
                    "comment": "It used to be. I was talking with faculty and it appears the food quality is a lot poorer than it used to be. Food poisoning is now a major issue and they've created such delights such as: peanut butter and jelly chicken wings and coffee-encrusted pot roast. They are disgusting.",
                    "score": 2,
                    "author": "Skerivo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can definitely put my finger on one or two larger instances of overt racism that I was aware of but being white I know I don’t have the best perspective on how often students of color have to deal with racism. I know that it was not never.\n\nWith more systematic issues the school could be slow to respond. Until students made enough noise that the school started to worry about it’s image, it would often drag it’s feet in making large changes. That being said, students have called out problems and I’d say that the administration has made positive changes in the past few years",
            "score": 3,
            "author": "3quartersofacrouton"
        },
        {
            "level": 0,
            "comment": "Alright, to answer the last 2 questions:\n\nDoghead is definitely the biggest tradition on campus. It’s sort of a st Patrick’s day celebration that happens on the weekend before Spring break. Basically people stay up celebrating all night and anyone who manages to stay up goes to watch the sunrise from the library steps. The school also hosts events that night and there’s a bunch of free food. It’s a lot of fun. Many people try to last the night every year but most only try once or twice. It can vary a lot person to person but in general it’s pretty fun and lively.\n\nFavorite place on campus? My club had an office that was a lot of fun to hang out in, nothing fancy but just kinda relaxing. Favorite overall though is probably the arboretum (the arb). It’s a size-able forest that surrounds two sides of campus and has a bunch of trails going through it. It’s a really nice place to go for a walk or run or something. Some of the trails come out at the top of the hill by the observatory and there are pretty great views of Waterville and beyond, especially on a clear day",
            "score": 2,
            "author": "3quartersofacrouton"
        }
    ]
}