{
    "id": "zysewu",
    "score": 3,
    "title": "Out of State Traveling Worries :((",
    "author": "Agitated_Following95",
    "date": 1672379053.0,
    "url": "https://www.reddit.com/r/Colby/comments/zysewu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! \n\nSo, I'll be a freshman at Colby next year, and I was wondering how out-of-state students get to school for move-ins, move-outs, and holidays. I'm low income and live near Los Angeles, California, so I'm concerned about expenses since the distance is so great. I'm especially concerned about money because I want my entire family (3 adults and 1 EMA \\[registered\\] dog) to be present for my first move in. \n\nDo you have preferred airports for move ins compared for holidays/Do you have a preferred airport overall? Is it affordable?\n\nDo you find that the travel money provided by Colby is sufficient? \n\nHow often do you travel to get home? \n\nDo you have any money-saving apps/websites or tips? Any advice is welcome :) Thanks!! xx",
    "comments": [
        {
            "level": 0,
            "comment": "PWM is an hours drive away. Unfortunately colby money won’t be enough for your whole family",
            "score": 3,
            "author": "rant-rant-rant",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you have any money-saving apps/websites or tips? Any bus routes close to Colby? I have no idea how to get there after the flight or what the typical price range for that is",
                    "score": 1,
                    "author": "Agitated_Following95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Concord coach lines",
                            "score": 2,
                            "author": "rant-rant-rant"
                        },
                        {
                            "level": 2,
                            "comment": "I recommend getting a job on campus or [donating plasma](https://www.cslplasma.com/) to give you some steady income. If you get a job on campus, get an easy one where you can sit at a desk and not be bothered. \n\nIf you have subscriptions besides spotify, cancel them. \n\nDon't pay for food on campus unless you're hungry and the dining halls are closed. \n\nFly into Portland or Boston, and do some research to see if you can get a bus to Waterville or Augusta. If not, try to find the Groupme for your class and see if anyone can give you a ride from the airport. Worst case you'll have to rent a car.",
                            "score": 1,
                            "author": "mynamesethan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The nearest airport is the Portland International Jetport (PWM). It's about 1-1.5 hours away. From there, you can get the Concord Coach Lines straight to Colby for $19 a ticket.  \nAnother option is to rent an Enterprise Car at PWM for about $80/day and drive to Colby and back (it may be a good option if your family will fly back from PWM).\n\nIn general tho, I think you will be perfectly fine moving-in alone. My home is some 7000 miles away from Waterville and I still did pretty well. \n\nFeel free to DM me if you need any help :)",
            "score": 1,
            "author": "Sardor_Kirck"
        }
    ]
}