{
    "id": "13pb7uj",
    "score": 434,
    "title": "Alcohol consumption in the world.",
    "author": "YJ2011",
    "date": 1684808649.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/13pb7uj",
    "media_urls": [
        "https://i.redd.it/wcs20te49j1b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I highly doubt that consumption in Brazil is that low!",
            "score": 62,
            "author": "arkallastral",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe it doesn't count bootleg alcohol.",
                    "score": 21,
                    "author": "pug_grama2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These maps usually don't.\n\n\nIt's the reason Czechia always have higher stats than Slovakia, they don't make their own as much as we do.",
                            "score": 18,
                            "author": "RedexSvK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, last time we did that we had dozens of people going blind, so ...",
                                    "score": 1,
                                    "author": "JohnyAngelo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But you have to consider \"pure alcohol\" and taking account a beer's can has around 4% of alcohol, 330ml \\* 4% = 13,2ml what give us 530 beer's can by year by person.  \n\n\nhere is a good article about brazilian numbers.  \n\n\nhttps://www.unasus.gov.br/noticia/consumo-de-alcool-no-brasil-e-superior-media-mundial-diz-oms",
                    "score": 1,
                    "author": "War_Doggy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn Cook islands, y'all some drunks - Czech Republic",
            "score": 28,
            "author": "Crammit-Deadfinger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't the Cook Islands a huge vacation destination for Australians and New Zealanders? Those are two heavy drinking cultures and people tend to drink more on vacation than at home.",
                    "score": 2,
                    "author": "Psychoceramicist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;0\n\nYeah right 😂",
            "score": 15,
            "author": "die_a_third_death",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's so funny\n\n![gif](giphy|mAJdRTnj3PfmFevyIt)",
                    "score": 1,
                    "author": "Able_Visual955"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Czechia here. We are about to open two bottles of wine in our office. We are not gonna get drunk but yeah the casual subtle everyday drinking is normal. Especially in the form of a beer or three after work.",
            "score": 7,
            "author": "dynablaster161"
        },
        {
            "level": 0,
            "comment": "Assuming this statistic is accurate, it's time to rename the \"Cook Islands\" to the \"Brew Islands\"",
            "score": 8,
            "author": "disastertwink"
        },
        {
            "level": 0,
            "comment": "Hey look! Another data map with a questionable source, or even lacking a source completely! I’m definitely suspicious. In ~2015 a report came out saying that half of all deaths in Russia are related to alcohol; and that the greatest desparency in life expectancy between women (80-ish) and men (55-ish) was because of alcohol related deaths. So this map is suspect.",
            "score": 116,
            "author": "Sturnella2017",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a resident of Russia, I will share my observations. There were a lot of drinking people in the 90s. Since the middle of 2000, there have been fewer drinkers every year. For example, when I was a student, it was considered normal to go for a beer 1-2 times a week after studying at the university. Now I hardly see young people drinking. Somewhere in the middle of 2000, the country began promoting a healthy lifestyle following the example of Soviet propaganda. Broadcasts of mass sports competitions are advertised on TV. Marathons, bicycle races, swimming competitions, etc. are organized in cities for ordinary people (not athletes). Schools have increased the number of hours for physical education lessons. Everywhere there is a ban on advertising alcohol and tobacco. There is a law banning the sale of alcohol from 23:00 to 8:00. But since the beginning of the pandemic, I often see news that alcohol sales have increased. Personally, according to my observations, they drink much more in Britain. I would associate the number of deaths from alcohol in Russia with the use of low-quality alcohol by some segments of the population. This is usually found in villages or in poor areas of cities. That is, these people cannot afford high-quality alcohol and buy what they can.",
                    "score": 50,
                    "author": "Tarisper1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(19)32265-2/fulltext  \n\nRussia has had huge successes in curbing alcohol consumption. While good news healthwise it is also mentioned that it is done in the fascist tradition of \"purging the unpure from the body\" and an \"obsession with physical fitness\".",
                            "score": 3,
                            "author": "randomacceptablename",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What's wrong with promoting a healthy lifestyle and sports? Why do you compare it with fascism?",
                                    "score": 24,
                                    "author": "Tarisper1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn't, the news reports did. And it wasn't in the vain of supporting healthy lifestyles and sports. It was an obsession with physical fitness, purifying the body, militarism, etc which they related to fascism. The only positive outcomes of which were said to be improved physical health and lower drinking rates.",
                                            "score": 0,
                                            "author": "randomacceptablename",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I once watched a scientific program on the BBC about hamsters (it was somewhere in the early 2000s). They showed some kind of Hamsters from Russia. The male helped the female during childbirth. The plot ended with the words that even male hamsters are always present at childbirth, but Russian men do not like to do this. After that, I stopped watching scientific programs filmed by the BBC. I got the impression that no matter what happens in a country that one or another journalist does not like, he will always be able to twist the information so as to show other people from the bad side. We talk about hamsters - we show what Russians are bad.",
                                                    "score": 11,
                                                    "author": "Tarisper1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I see this on BBC programs and news reports about Russia all the time. It made me think Brits have an irrational hatred of everything about Russia. Back in the day, it used to be Germany. And I guess France in the centuries gone by.",
                                                            "score": 4,
                                                            "author": "refusenic",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If we remember that it was from Churchill's words that the Cold War began, then this explains a lot.",
                                                                    "score": 2,
                                                                    "author": "Tarisper1"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That would make it a really stupid program let alone scientific program. But rejecting all news programs because they may be bad is senseless as well.  \n\nEither way this was not from a scientific program nor was it BBC. It was a few writters discussing Russian culture after studying it or living there for years.  \n\nEdit:  \n\n&gt;I once watched a scientific program on the BBC about hamsters (it was somewhere in the early 2000s). They showed some kind of Hamsters from Russia. The male helped the female during childbirth. The plot ended with the words that even male hamsters are always present at childbirth, but Russian men do not like to do this. After that, I stopped watching scientific programs filmed by the BBC. I got the impression that no matter what happens in a country that one or another journalist does not like, he will always be able to twist the information so as to show other people from the bad side. We talk about hamsters - we show what Russians are bad.  \n\nWithout having watched the program I suspect you misunderstood its point or it was presented in a way to do so. I was born in a country where fathers weren't allowed into the maternity ward and it was uncommon in the West as well decades ago. What the program was probably doing is showing that mammals including humans need that physical connection. It was simply pointing out that in Russia the cultural attitudes should change. Just like saying too much drinking or smoking is a bad social practice.  \n\nI have watched the BBC for several decades and have never see them make anything as stupid as you suggested.",
                                                            "score": 3,
                                                            "author": "randomacceptablename",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I gave the example from the BBC in order to make it clear that you cannot believe everything that is said in newspapers and from TV screens. Every journalist, writer or director puts their thoughts into what is said and it will not necessarily be 100% true.\n\nI even have different views on the same things with my friends. What can we say about foreigners for whom our culture is alien or who may have a bias in judgments.",
                                                                    "score": 4,
                                                                    "author": "Tarisper1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;I gave the example from the BBC in order to make it clear that you cannot believe everything that is said in newspapers and from TV screens.\n\nSee my edit.  \n\n&gt;Every journalist, writer or director puts their thoughts into what is said and it will not necessarily be 100% true.\n\nIt can't be 100% true by definition. That changes nothing.  \n\n&gt;I even have different views on the same things with my friends.\n\nJournalists have different viewpoints and information as well. Often there are several journalists in any organization covering the same thing for this very reason.  \n\n&gt;What can we say about foreigners for whom our culture is alien or who may have a bias in judgments.\n\nBecause they are outsiders to the culture, outsiders are usually the best objective critics of it. Not the least.",
                                                                            "score": 2,
                                                                            "author": "randomacceptablename"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh look! A real source! Thanks for sharing. Part of my skepticism is not just Russia, but all the other former Soviet countries. Alcoholism was huge in all of them. Did they all have such efforts to reduce alcohol consumption?",
                                    "score": 2,
                                    "author": "Sturnella2017",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think that people 30 and under saw their parents' generation quite ravaged by alcohol consumption (when I was in my 20s in Romania I went to three funerals for friends' fathers who died in their 50s in one year), so it made them much more conscious about alcoholism.",
                                            "score": 5,
                                            "author": "Amaliatanase"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for sharing. You mean my 15 year old knowledge of a country is outdated?!? (I was actually in Russia in 1992. That makes me an expert, right?). I’m glad things have changed!",
                            "score": 2,
                            "author": "Sturnella2017",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you have seen bears on bicycles on the streets, nuclear reactors in sheds and balalaika, then your knowledge is not outdated :)",
                                    "score": 6,
                                    "author": "Tarisper1"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The map is probably based on the total consumption of alcoholic drinks, regardless of their alcohol content. That's why countries that consume a lot of beer and wine, like in Europe,  comes on top of countries that consume a lot of distillates, like Russia",
                    "score": 10,
                    "author": "defcon_penguin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Map shows consumption of pure alcohol, not just alcoholic drinks.\n\nAnyway, I saw older WHO stats documents and everything is simple: there are less drinkers in Russia than other countries with high alcohol consumption but share of heavy drinkers is higher.",
                            "score": 20,
                            "author": "tu_tu_tu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The claimed source is WHO, which isn't really questionable. But it does seem a bit weird",
                    "score": 6,
                    "author": "ArcticBiologist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "WHO gets their data from national sources - so they will be official, but they will also reflect the country's relation to independent institutions\n\nNonetheless, it seems plausible that state policies (and simple demographics - heavy drinkers dying off faster) can positively affect trends.",
                            "score": 5,
                            "author": "Raddens"
                        },
                        {
                            "level": 2,
                            "comment": "WHO is the source?",
                            "score": 1,
                            "author": "Araz99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Who",
                                    "score": 2,
                                    "author": "ArcticBiologist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, who are you? Who? WHO??",
                                            "score": 2,
                                            "author": "Sturnella2017"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe it is litres per square km. :)",
                    "score": 2,
                    "author": "jnmjnmjnm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The only metric I follow",
                            "score": 5,
                            "author": "makerofshoes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When I saw that Pakistan had more alcohol consumption than Bangladesh, I was kinda surprised.",
                    "score": 1,
                    "author": "bigphallusdino"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Burkina Faso partying it up",
            "score": 3,
            "author": "Lets_focus_onRampart"
        },
        {
            "level": 0,
            "comment": "While I totally believe Europe is at the high end after all beer and wine drinking are very common especially during summer and interteined with cultural practices. \n\nI sincerelly doubt these 0 figures, I think thats more a result of it being a faux pas and possibly illegal in their societies and thus no one admits to drinking.\n\nBangladesh is a great example of this, it's illegal due to strict Islamic laws yet they have vast local alcohol and even national Alcohol producers which is condoned by law lol. But we are supposed to believe that small time alcohol production isn't consumed by it's producers and locals, but all exported?",
            "score": 4,
            "author": "Arateshik",
            "replies": [
                {
                    "level": 1,
                    "comment": "It may be due to official sales numbers. Legally speaking, zero alcohol is made and sold in Saudi Arabia or imported from other countries into it. However, there's a **huge** black market for alcohol here but obviously that's not going on any official statistics.",
                    "score": 1,
                    "author": "sppf011"
                },
                {
                    "level": 1,
                    "comment": "We don't drink in Mauritania, we dance instead.\n\n![gif](giphy|TjehjJL3lOrZPjFH9H)",
                    "score": 1,
                    "author": "Able_Visual955"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am certain that Saudi Arabia isn’t exactly zero. The upper class likes to flaunt their Islamic values while doing the opposite in private.",
            "score": 50,
            "author": "SovietCanuckistan420",
            "replies": [
                {
                    "level": 1,
                    "comment": "No the upper class in Saudi are very open about the stuff they do and they definitely do not flaunt their Islamic values that they don't have. People like that are very secular and you can tell from a mile away.\n\nLet's be honest you don't know shit about Saudi.",
                    "score": 20,
                    "author": "Ornery-Sandwich6445",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re 100% correct. \n \nSource: live in the GCC",
                            "score": 3,
                            "author": "Positive-Sock-8853",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same",
                                    "score": 1,
                                    "author": "Ornery-Sandwich6445"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“We represent the moderate teachings and principles of Islam” - MBS.\n\nI suppose ordering the murder of a journalist is totally halal. Saudi is full of munafiqun, whether it’s alcohol or other haram activities. \n\nSit down and shut up",
                            "score": -5,
                            "author": "SovietCanuckistan420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't think you even read what he said",
                                    "score": 14,
                                    "author": "Pine_of_England",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know right lol.",
                                            "score": 4,
                                            "author": "Ornery-Sandwich6445"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wtf does this have to do with upper-class Saudis? You claim that Saudis that drink alcohol also preach Islam and you get triggered when I call you out. I never said Saudi had no “haram” activity I just said those guys are definitely not too fond of religious people.",
                                    "score": 14,
                                    "author": "Ornery-Sandwich6445"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The village drinks heavily in Russia, but the city drinks little. On average, this is less than Western Europe. I usually drink no more than 3-4 liters of beer a month. No more alcohol.",
            "score": 3,
            "author": "KirDor88"
        },
        {
            "level": 0,
            "comment": "Besser als die Deitschn!",
            "score": 3,
            "author": "DaDuky123"
        },
        {
            "level": 0,
            "comment": "People in the tropics seem to drink less alcohol. Interesting",
            "score": 5,
            "author": "MarioDiBian",
            "replies": [
                {
                    "level": 1,
                    "comment": "I guess it makes sense - nothing worse than sweating out a hangover",
                    "score": 24,
                    "author": "h0nkhunk"
                },
                {
                    "level": 1,
                    "comment": "It might be because of divisions among gender lines. At least in Vietnam, there is a pretty heavily drinking culture but it’s almost exclusively for men. \n\nSource: I am from a Vietnamese family, but a quick google search will show how much Viet men drink (it’s a lot)",
                    "score": 17,
                    "author": "Gullible-Sail-2606",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I’m surprised East Asia isn’t higher up on the scale. People there drink **a lot**",
                            "score": 10,
                            "author": "makerofshoes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Someone further up in the thread speculated that it's by actual consumption of any liquor, so your beer loving Brit or German guzzling down several pints at least a day will appear far darker than the northern Chinese men getting absolutely PLASTERED on 56% baijiu or the Koreans and Japanese with soju or sake.",
                                    "score": 0,
                                    "author": "komnenos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It says in “liters of pure alcohol” so my takeaway was that the type of beverage doesn’t matter. I’m skeptical of these maps anyways to begin with 🤷‍♂️",
                                            "score": 8,
                                            "author": "makerofshoes"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They love their happy water, mot haiba zo!",
                            "score": 3,
                            "author": "Banaan75"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why is Mexico so low?",
            "score": 2,
            "author": "doubleddan39",
            "replies": [
                {
                    "level": 1,
                    "comment": "I suspect that it's because beers typically are around 4% in alcohol by volume and \"shots\" is something that you sip.",
                    "score": 1,
                    "author": "Goblinweb"
                },
                {
                    "level": 1,
                    "comment": "Women in large portions of Méx dont drink at the same rate as men nor is it socially acceptable for them to be at bars drinking.  The countries with higher rates of alcohol consumption tend to be more gender egalitarian when it comes to boozing.",
                    "score": 1,
                    "author": "cantonlautaro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I personally am 30-40L pure alcohol per year. Who’s here to give me the bad news?",
            "score": 7,
            "author": "0HL4WDH3C0M1N",
            "replies": [
                {
                    "level": 1,
                    "comment": "These are rookie numbers",
                    "score": 12,
                    "author": "flyyyyyj"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would have thought Russia would be a bit more up there than that",
            "score": 2,
            "author": "SeanAC90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently, the ban on the sale of alcohol from 23:00 to 8:00 gave results.",
                    "score": 10,
                    "author": "ViTverd"
                },
                {
                    "level": 1,
                    "comment": "We don't drink THAT much. Not anymore\n\nAnd I rarely see youngsters who drink much\n\nLess alcohol consumption is one of the few Ws our government managed to achieve",
                    "score": 17,
                    "author": "forsythfromperu"
                },
                {
                    "level": 1,
                    "comment": "Maybe it doesn't count bootleg vodka.",
                    "score": -1,
                    "author": "pug_grama2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Russians don't drink a lot of vodka, people usually prefer beer and wine",
                            "score": 9,
                            "author": "SOFIA_433"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "do anybody understand why sober'est country is not developed one?",
            "score": 1,
            "author": "Easternlads"
        },
        {
            "level": 0,
            "comment": "Romania can into Central Europe",
            "score": 1,
            "author": "ionel714"
        },
        {
            "level": 0,
            "comment": "The more you drink the more developed your country is!",
            "score": 0,
            "author": "GazelleOdd6160"
        },
        {
            "level": 0,
            "comment": "Russia one of the most sober European countries? 😂😂😂",
            "score": -7,
            "author": "vovr"
        },
        {
            "level": 0,
            "comment": "I’m here to push the per capita consumption to 14 Liters a year",
            "score": 1,
            "author": "AlwaysBeQuestioning"
        },
        {
            "level": 0,
            "comment": "Love the map, fucking hate the scale. What a useless metric.",
            "score": 1,
            "author": "PMyourDnDfeat"
        },
        {
            "level": 0,
            "comment": "Only 3rd place? Darn. We need to reclaim primacy.",
            "score": 1,
            "author": "TheYoten"
        },
        {
            "level": 0,
            "comment": "Australia is only dark brown because Bunnings doesn’t sell alcohol",
            "score": 1,
            "author": "Ebright_Azimuth"
        },
        {
            "level": 0,
            "comment": "They need some shade of vanta black for Wisconsin",
            "score": 1,
            "author": "EgberetSouse"
        },
        {
            "level": 0,
            "comment": "There must be some hardcore private consumption to put the US on par with Vietnam and Korea. US drinking culture is pretty tame most places.",
            "score": 1,
            "author": "Teemotep187"
        },
        {
            "level": 0,
            "comment": "Europe outdrinks Australia?? Wow.",
            "score": 1,
            "author": "an_imperfect_lady"
        },
        {
            "level": 0,
            "comment": "Wow I'm in Canada and pretty much every social event with people that are not planning to drive, there's loads of alcohol consumption.",
            "score": 1,
            "author": "littypika"
        },
        {
            "level": 0,
            "comment": "Expect to see a spike in Finland with their newest drinking song “Cha Cha Cha”\n\nLittle surprised S.Korea isn’t in the top tier, those folks go HARD.",
            "score": 1,
            "author": "MitchellTheMensch"
        },
        {
            "level": 0,
            "comment": "North Korea is a lie",
            "score": 1,
            "author": "aaelias_"
        },
        {
            "level": 0,
            "comment": "I have a British friend who works as a butler to a Saudi prince… and there is a lot of alcohol at the palace !",
            "score": 1,
            "author": "Electrical-River-992"
        },
        {
            "level": 0,
            "comment": "Just to put things in perspective..9L of pure alcohol are 100 bottles of red wine.",
            "score": 1,
            "author": "SnooDogs3089"
        },
        {
            "level": 0,
            "comment": "We need to nuke Latvia they shall not outdrink- uh I mean they have alcohol of mass destruction",
            "score": 1,
            "author": "blockybookbook"
        },
        {
            "level": 0,
            "comment": "Wisconsin would be black",
            "score": 1,
            "author": "Professional_Long_21"
        },
        {
            "level": 0,
            "comment": "Europe moment.",
            "score": 1,
            "author": "sgordon900"
        },
        {
            "level": 0,
            "comment": "Why is Burkina Faso an outlier?",
            "score": 1,
            "author": "Jimmy3OO"
        },
        {
            "level": 0,
            "comment": "But what kind\nDrinking a little vodka is the same as a lot of wine",
            "score": -9,
            "author": "Amazing-Window-346",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;in litres of pure alcohol\n\nIt accounts for the ABV",
                    "score": 10,
                    "author": "eyetracker"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Um, Asians drink harder than Europeans I heard....",
            "score": -2,
            "author": "CatsEatingCaviar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Europeans have a glass of wine or beer with meals. Asians on occasion, and that's when they go hard.",
                    "score": 5,
                    "author": "skyduster88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Japanese go hard EVERY DAY after work.",
                            "score": 0,
                            "author": "CatsEatingCaviar"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Erm, Japan is ranked too long.  The work culture around alcohol alone is devastating.  \nIf you don’t know, if you want to advance in a company you better be at the company parties and you better be drinking with the boss.  A lot.",
            "score": 0,
            "author": "fightingforair"
        }
    ]
}