{
    "id": "13rqr3q",
    "score": 52,
    "title": "Population by cities in Canada in 2100",
    "author": "Reddit_NPC-1",
    "date": 1685042654.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/13rqr3q",
    "media_urls": [
        "https://i.redd.it/ot5n5ljxk22b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Wonder if anyone from 1936 predicted today’s population numbers with any accuracy. I would doubt it.",
            "score": 27,
            "author": "animbicile"
        },
        {
            "level": 0,
            "comment": "There's no way the growth of most cities will continue to that degree. Vancouver would have to look like Hong Kong or Bangkok, Toronto like Tokyo. The main factor is that global population growth is decreasing. Immigration will sharply decrease in the next 20 years as countries equalize in standard of living and Canada declines and is less appealing as a destination. Canadian births will decline further as home ownership and quality of life continue to decrease. So most cities will probably double what they are now by 2100 but they won't get close to this map.",
            "score": 23,
            "author": "Wandereed8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really, whatever little catching up developing  countries do (and it would be little because the gap between developed and developing countries is still huge, especially in quality of life), would be more than cancelled out by climate change and environmental collapse.",
                    "score": 6,
                    "author": "Atisha800",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thirty-million climate refugees to Canada is highly unlikely. Unlike poverty, you don't need to cross the world to escape it.",
                            "score": 6,
                            "author": "AcrobaticZebra1524"
                        },
                        {
                            "level": 2,
                            "comment": "You think climate change won't effect developed countries at all?",
                            "score": 2,
                            "author": "Mahameghabahana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "not at the same scale. For example wet bulb temperatures are getting dangerously close to the limit of human habitation in vast areas of South Asia, Africa and the Middle East.",
                                    "score": 2,
                                    "author": "Atisha800"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Alberta is already flooding and on fire.",
                            "score": -1,
                            "author": "WestEst101"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "2100 trend estimate? Seems kind of silly to try to predict that far out. 2050 would at least have some basis in reality.",
            "score": 8,
            "author": "Astatine_209"
        },
        {
            "level": 0,
            "comment": "One of the most profoundly meaningless maps I have ever seen",
            "score": 4,
            "author": "SubmissiveGiraffe"
        },
        {
            "level": 0,
            "comment": "Whitehorse, YT is already over 30k",
            "score": 2,
            "author": "Playhrd73",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think that means this model is predicting growth happens in just the major centres. The dots of the cities in northern bc are the same ranges as they currently are",
                    "score": 1,
                    "author": "NeilNazzer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why are Calgary and Edmonton grouped together but Ottawa and Montreal, a similar distance apart, are not?",
            "score": 2,
            "author": "cre8ivjay"
        },
        {
            "level": 0,
            "comment": "I dont think Cannada will be a country in 2100",
            "score": 4,
            "author": "Zeefukisoatmeal"
        },
        {
            "level": 0,
            "comment": "The horror.\n\nToronto is already seemingly wall to wall fugly condo towers, especially near the water. Monuments to man's desire to turn his environment into a prison of the spirit. And not even aesthetically or structurally impressive prisons at that. Not even the villainous grandeur of a Blade Runner style environment. \n\nIn the former Mimico area, the mix of OK and cheesy motels that were on the water until the 90s were in retrospect a much nicer thing to look at than the ghastly towers of the new age. \n\nGiven the pace and number of their construction, I have always wondered who all lived in them. The population has certainly grown, but not by so much. If the city had plowed under a bunch of old residential areas and people needed to be rehoused, then I could see it. Maybe if every single person who has come to TO in the last 30 years all bought a condo, then I could see it.",
            "score": 2,
            "author": "random_observer_2011",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those shitty ghetto motels were better than the condos? LOL. I've heard a lot of Rose tinted takes on this site but this is probably the worst.",
                    "score": 3,
                    "author": "zefiax"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe now they will actually build up instead of the flat single family suburban model that waste so much potential living space",
            "score": 1,
            "author": "GreatDario"
        },
        {
            "level": 0,
            "comment": "Nonsense",
            "score": 1,
            "author": "SHiR8"
        }
    ]
}