{
    "id": "13t0a9g",
    "score": 0,
    "title": "Languages and dialects of Sweden",
    "author": "JoemamaGia1",
    "date": 1685169918.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/13t0a9g",
    "media_urls": [
        "https://i.redd.it/zlewk1wtlb2b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Why are finnish enclaves deep in sourhern sweden ?",
            "score": 10,
            "author": "kingofthep",
            "replies": [
                {
                    "level": 1,
                    "comment": "They aren't a majority anywhere, not even close. This map is just very misleading",
                    "score": 9,
                    "author": "Stockholmholm"
                },
                {
                    "level": 1,
                    "comment": "There won’t be any majority areas, just like there aren’t majority Norwegian areas in the south either. I doubt there are many majority Sami areas at all.. they only number between 20k and 40k all up for the whole country.. so less than half a percent.",
                    "score": 5,
                    "author": "FlaviusStilicho"
                },
                {
                    "level": 1,
                    "comment": "Finns moved there in the 60s searching for work in the more industrialized Sweden. Agriculture became motorized so less workers were needed in it.",
                    "score": 1,
                    "author": "Jessez_FIN"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't get the joke, but we have no Finnish dialect i Småland or anywhere close to it.",
            "score": 4,
            "author": "KeyAd1597",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could be about the extinct/assimilated forest finns: wikipedia.org/wiki/Forest_Finns",
                    "score": 4,
                    "author": "Random_Researcher"
                },
                {
                    "level": 1,
                    "comment": "It could be Swedish dialect, not Finnish",
                    "score": -1,
                    "author": "JoemamaGia1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone know if Sami people in the north also speak Swedish? Like, are there very many monolingual Sami folk, or do they all pretty much all speak Swedish as well? And are there a lot of Sami who now use Swedish as their main language?",
            "score": 2,
            "author": "JohnnieTango",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would say every single one, with most also speaking pretty good English, and since you understand Norwegian pretty well by default if you speak Swedish.. that would mean most of them are probably Quad-linguals… plus they could read Danish fine, and probably understand it as well if they give their brain an hour to adapt to the tone… making them quintuple-linguals.\n\nYou don’t really count languages like that in Scandinavia though. You would say you speak Sami, Swedish, and English (the rest is just implied and doesn’t “count”)",
                    "score": 3,
                    "author": "FlaviusStilicho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is Elfdalian the language Tolkien used as template for elvish on LOTR?",
            "score": 1,
            "author": "nomadpoker"
        },
        {
            "level": 0,
            "comment": " Virgin “Scania is Swedish//Danish”\nChad “Scania is a rightful Finnish land”",
            "score": 0,
            "author": "Juhani-Siranpoika"
        }
    ]
}