{
    "id": "13tvzdz",
    "score": 2265,
    "title": "Coffee or tea in the world",
    "author": "JoemamaGia1",
    "date": 1685265768.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/13tvzdz",
    "media_urls": [
        "https://i.redd.it/b38f3d2tij2b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Every Brazilian house, first thing in the morning, even before peeing, makes coffee. Never, ever, have I have seen or heard of anyone who turns on their kettle instead.",
            "score": 543,
            "author": "Usual_Koala_2229",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's wrong af. There is no way Brazil is tea lol. Brazil is not only the main coffee producer in the world, it's amongst the highest consumption per capita.\n\nhttps://www.google.com/search?q=highest+coffee+consumption+per+capita&amp;oq=highest+coffe+&amp;aqs=chrome.3.69i57j0i10i512l14.5965j0j7&amp;client=ms-android-samsung-ss&amp;sourceid=chrome-mobile&amp;ie=UTF-8#imgrc=XytSBwD2Vzhb4M",
                    "score": 289,
                    "author": "HerrFalkenhayn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As the old song goes: “there’s an awful lot of coffee in Brazil”.",
                            "score": 47,
                            "author": "elspotto"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To the point that the term for \"breakfast\" is (correct me if I'm wrong) _café da manhã_",
                    "score": 129,
                    "author": "himmelundhoelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Correct. And it's not just a figure of speech",
                            "score": 69,
                            "author": "tomatoswoop"
                        },
                        {
                            "level": 2,
                            "comment": "Just like hobbits we have 2 café, 3 café... 58 café da manhã until noon.",
                            "score": 8,
                            "author": "allys_stark"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't drink coffee.  When I went to someone's house(here in Brazil) recently,  they told me that \"Brazilians don't trust people who don't drink coffee\".\n\nThis map makes no sense",
                    "score": 75,
                    "author": "EndlessExploration"
                },
                {
                    "level": 1,
                    "comment": "I know many Brazilians to know that the map is wrong, but I find ironic that one of my best friends is brazilian and doesn't drink coffee at all, but shitloads of tea.",
                    "score": 12,
                    "author": "shiba_snorter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, that is me. I hate coffee and drink tea (not mate) pretty much every day. But, yeah, this map is very silly.",
                            "score": 5,
                            "author": "Heatth"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tbh. Mate is also a tea - kinda. I think here they include all herbs in the \"tea\" category.",
                    "score": 70,
                    "author": "BranFendigaidd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, but that pretty much is drunk in restricted areas and states. Brasil culture is coffee. ”Pão na chapa com Pigado“ not tea! Even North and North-east goes for it while enjoy their morning cuzcuz! Let’s keep in mind that “O Sul é o meu país” is a minority in relation with the rest of the nation! I‘m from South and I grew up on coffee as mostly people from my region!",
                            "score": 54,
                            "author": "Hopps7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even mate regions drink coffee alright. Perhaps a little less than others, but coffee and mate are two different things, serving different purposes. Mate is drunk either cold in hotter regions or hot during the Southern winter, but isn't the breakfast and office staple coffee is. Unlike coffee, it's kind of a ritual, it takes time to prepare and to consume. You can bring mate to work, but it's a bit weird.",
                                    "score": 7,
                                    "author": "LuxInteriot"
                                },
                                {
                                    "level": 3,
                                    "comment": "What does “o Sul é meu país” have to do with the coffee vs tea discussion? Some people…",
                                    "score": 12,
                                    "author": "asfnwuiefniansdkq"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; ”Pão na chapa com Pigado“ not tea!\n\n&gt; I‘m from South\n\nSão Paulo can be the South?",
                                    "score": 2,
                                    "author": "LupusDeusMagnus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah. As a gaúcho i wouldn't even consider Paraná as culturally southern because of how much of a São Paulo Lite they are.\n\nPaulista colony",
                                            "score": 13,
                                            "author": "Belluuo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pingado is a São Paulo thing. They don’t say it here lol",
                                                    "score": 3,
                                                    "author": "LupusDeusMagnus"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lmao, I'm from Curitiba but have to agree. So many paulistas live here",
                                                    "score": 3,
                                                    "author": "leshagboi"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also from the South, I never drink mate.",
                                    "score": 3,
                                    "author": "escrevisaicorrendo"
                                },
                                {
                                    "level": 3,
                                    "comment": "They measure cups in grams. 10g coffee is one cup. 2.5g of tea or mate is one cup.\n\nSo there's your answer. Based on that. Yes. Brazil is a tea drinking nation 😂",
                                    "score": 0,
                                    "author": "BranFendigaidd"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep, mate is included with tea (there is some very fine print in the lower right hand corner that confirms it)",
                            "score": 16,
                            "author": "danzibara",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "and the grams per cup actually confirms it. Tbh 10g per cup is kinda also generously low. I would say 15g per coffee cup and 1-2g per tea cup.\n\nSo yeah",
                                    "score": 8,
                                    "author": "BranFendigaidd"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Mate is not a tea at all.",
                            "score": 5,
                            "author": "PFGtv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We know. But a lot of people add it to the \"tea\" category. Together with lots of herbal infusions",
                                    "score": 9,
                                    "author": "BranFendigaidd"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm also struggling with this data. Maybe they have considered mate tea, tererê, chimarrão etc. as tea. But even so, coffee is a staple in Brazilian culture.",
                    "score": 19,
                    "author": "Nevarien"
                },
                {
                    "level": 1,
                    "comment": "Well I turn in the kettle to make coffee lol\n\nI also drink tea but I’m aware I’m an exception",
                    "score": 3,
                    "author": "Happy-Cantaloupe1120"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Japan was a surprise",
            "score": 406,
            "author": "HermesOnToast",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I was going to say the same thing. I always got the impression Japan drunk more tea than coffee. Maybe it’s a generational thing…",
                    "score": 133,
                    "author": "el_disko",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Japan is actually one of the biggest coffee drinking nations. It is everywhere. You have a big coffee culture and lots of the new wave coffee equipment/invention comes from Japan or Taiwan.",
                            "score": 148,
                            "author": "BranFendigaidd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is purely anecdotal but I feel like I remember being surprised things like cold coffee cans were a thing there. Like Tommy Lee Jones used to be the face of the adverts. while here in the UK we didn't have them, fast forward 15 years and now they're big business here too.\n\nI really wouldn't be surprised if UK is in the coffee section in the next 20/30 years. Almost everyone I've met my age or younger is a coffee drinker while it's only older people that like tea a lot.\n\nBoba tea is growing but cold teas are way less popular than cold coffee here",
                                    "score": 52,
                                    "author": "SovietBatman64",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It could be. It all depends on price. Tbh third wave coffee is still way too expensive to completely replace tea. And the quality is really expensive. All while there are plenty of ego centered pseudo coffee experts who exploit a FOMO industry to sell shit beans as \"specialty\".\nTea on other hand has long lasting tradition in quality and you can clearly taste the difference. That's why for example the best coffee nations atm are again in the east, where tea was and is still tradition and quality. Western is like hipster looking dudes with tattoos on a bike pretending to know what a good coffee is 😅",
                                            "score": 18,
                                            "author": "BranFendigaidd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m not sure what third wave is and coffee is cheaper than tea here. It doesn’t have to be some fancy stuff to be good enough. Regards, Finland",
                                                    "score": 9,
                                                    "author": "joxmaskin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Third wave coffee is the new specialty coffee now. Like okay beans are around 15euros / 250g of beans . And good quality could be 60-200euros / 100g of beans.",
                                                            "score": 4,
                                                            "author": "BranFendigaidd",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yikes :) I mostly just buy pre-ground beans for about 6€ a pack of 500g, for example some Arvid Nordquist (Reko, Amigas,..) , or Paulig.\n\nI own both some hand cranked and electrical coffee mill and have used them at times, but tend to fall into old convenient habits. It’s true that the beans lose flavour pretty quickly when ground, so maybe I should do some bean buying again.\n\nMy everyday brewing is with a basic drip brewing machine (paper filter) like 99% of Finnish households. Have got a Moka Express and Aeropress too. (Those of obviously require different grinding than my standardised drip brewer I now usually buy pre-ground for.)\n\nBut hey, I even quite enjoy  instant coffee at times (Clipper has a nice one), so I guess I’m not the guy to ask about hi-fi coffee, even if I can appreciate more refined experiences.\n\nIn my town there is a local coffee shop that does their own roasting of various kinds of beans they import, and it’s pretty nice! But my everyday coffee needs are met by quite modest standards.\n\nEspresso, French press or drip brew, light or dark roast, black or with tons of milk, everything goes.",
                                                                    "score": 3,
                                                                    "author": "joxmaskin",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A big part of why some varietals of coffee, like Jamaican, are so expensive is because Japan buys the crop years in advance.",
                            "score": 10,
                            "author": "elspotto"
                        },
                        {
                            "level": 2,
                            "comment": "Iirc Iced coffee is a Japanese creation, you could buy it from vending machines in the 80s there.  Wasn't a thing in the US until late 90s",
                            "score": 7,
                            "author": "DefiantAbalone1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same as Brazil and Vietnam. The two biggest coffee producers in the world prefer drinking tea.",
                    "score": 72,
                    "author": "MasterFubar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's because Brazil is wrong, we even call breakfast \"morning coffee,\" you go to someone's house, they offer you coffee, you drink coffee at work, there's the café da tarde \"afternoon coffee.\"\n\nWhat is even this?",
                            "score": 138,
                            "author": "goozila1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, brazil feels very wrong. Never seen a brazilian drinking tea while coffee is everywhere\n\nBut please stop making it so sweet\n\nAlso Argentina feels wrong unless mate is considered tea",
                                    "score": 73,
                                    "author": "BallumBallum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I think mate is considered tea in this map because it doesnt make sense if not",
                                            "score": 27,
                                            "author": "BlueRaven56",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My guess is perhaps also that it's cups as a unit of volume not literal cups? Coffee is consumed concentrated, in smaller cup (as in the object not the measure) tea is drank as a long drink in a larger cup, so one cup of tea or maté or chimarrão or whatever could be like 4 or 5 coffees in volume. Like 1 acerage coffee is 0.25 \"cups\" in volume or whatever.\n\nStill even with that caveat this seems really wrong. Brazilians drink coffee like crazy, it's not even close",
                                                    "score": 15,
                                                    "author": "tomatoswoop"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Even if so, coffee is drinked a lot in the whole country, while mate is only in some of the southern states",
                                                    "score": 6,
                                                    "author": "tito_valland",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh yeah, I meant for Argentina. No way normal tea is more consumed than coffee for us",
                                                            "score": 3,
                                                            "author": "BlueRaven56"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Rio Grande do Sul singlehandedly carrying Brazil stats with mate consumption 💪💪💪💪, lmao.",
                                            "score": 17,
                                            "author": "Belluuo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The map is probably considering cold mate that is drunk all over Brazil as a soft drink to be \"tea\", which is *very* silly.",
                                                    "score": 11,
                                                    "author": "Heatth"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "makes sense KKKKKKKKKKK",
                                                    "score": 1,
                                                    "author": "AlexWotanson"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Also Argentina feels wrong unless mate is considered tea\n\nThat must be it. In Brazil the South drinks a lot of mate and even elsewhere it is a common drink, specially cold. Add that to the fact Brazilian's coffee serving sizes are small, I can believe that \"tea\" is drunk more than coffee.\n\nBut that is just misleading and a result of grouping different things when they shouldn't. Brazil doesn't have a tea drinking culture. When you go to someone's house you will be offered coffee, not tea. At work you will have a coffee break. Cofee machines with disposable little plastic cups are common on waiting rooms, etc etc.",
                                            "score": 8,
                                            "author": "Heatth",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The graph states that Mate is included",
                                            "score": 3,
                                            "author": "SomebodyFromBrazil"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is definitely wrong about Brazil. Been living here 8 years and I've never seen anyone in public drink tea at a coffee shop. Hell, people will buy chocolate at a shop and get an espresso. I'm the only person in my family or group of friends that drinks tea, and I drink it maybe once a week.",
                                    "score": 8,
                                    "author": "BrokenGuitar30"
                                },
                                {
                                    "level": 3,
                                    "comment": "Cha Mate.",
                                    "score": 9,
                                    "author": "MasterFubar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Blasphemy.",
                                            "score": 5,
                                            "author": "goozila1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah Brazil is just straight wrong.  I guess maybe they are saying mate but even still coffee is everywhere there.",
                                    "score": 8,
                                    "author": "MrGreen17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A Brazilian serving of coffee is quite small, while cold mate is drunk at regular sizes, like a soft drink. With that taken into account, the map makes sense.\n\nIt is very silly though.",
                                            "score": 4,
                                            "author": "Heatth"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm extremely surprised about Brazil.  I remember when i was there we drank coffee about 5 times per day, unless those tiny espresso style cups don't count!  \n\nI felt like Bolivia and PEru might be tea countries, but tough to say.  Everyone drinks Mate de Coca, which is like tea with coca leaves, and helps with the altitude.",
                            "score": 4,
                            "author": "ooo-ooo-oooyea"
                        },
                        {
                            "level": 2,
                            "comment": "Brazilians definitely don’t drink more tea than coffee\n\nMaybe in the southernmost state they do, but they are the exception and account for 10% of the population (probably less)",
                            "score": 2,
                            "author": "Happy-Cantaloupe1120"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tea is more widely consumed in Japan based on every other source I've looked at.",
                    "score": 34,
                    "author": "37119636",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, this is clearly based on misleading data\n\nMy guess is it's either not counting green tea as \"tea\" or it only includes what is purchased at a cafe.",
                            "score": 16,
                            "author": "tarepandaz"
                        },
                        {
                            "level": 2,
                            "comment": "Purely anecdotal but my whole family (also the extended and whatnot family spread in all of Japan) drinks green tea instead of water. Coffee is only for breakfast and afternoons",
                            "score": 10,
                            "author": "scientia-et-amicitia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with this. I know that a lot of my students have tea in their water bottles than water. I even heard a homeroom teacher say to her students after a PE class, \"You can drink your tea before we start with the next subject.\"",
                                    "score": 2,
                                    "author": "ckoocos",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Brazil also.",
                    "score": 10,
                    "author": "logatwork"
                },
                {
                    "level": 1,
                    "comment": "Well that's the only clue you need to know this map is inaccurate",
                    "score": 5,
                    "author": "Lapponias"
                },
                {
                    "level": 1,
                    "comment": "Pretty much every restaurant, tea is the default instead of water.",
                    "score": 3,
                    "author": "Djof"
                },
                {
                    "level": 1,
                    "comment": "Maybe it's because \"tea\" only refers to black tea, but not green tea or barley tea? idk",
                    "score": 3,
                    "author": "Few-Figure-2759"
                },
                {
                    "level": 1,
                    "comment": "For reference, we (or at least me as a young man living in the Tokyo area) drink roughly 10 cups of barley tea, 2 cups of green tea and 0-1 cup of black tea a day. Personally, I don't particularly like coffee, so I rarely drink it (of course, there are people who drink several cups every day).",
                    "score": 2,
                    "author": "Few-Figure-2759"
                },
                {
                    "level": 1,
                    "comment": "Korea too. Maybe the definition FAO is using for tea is off, like it doesn't include some more Asian ones. Also, Koreans drink tons of tea that isn't Earl grey. Corn tea, barley tea, lots of other grains.",
                    "score": 4,
                    "author": "HelloJoeyJoeJoe"
                },
                {
                    "level": 1,
                    "comment": "I thought that too, until I remembered that they literally sell coffee in vending machines.",
                    "score": 2,
                    "author": "kgullj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes, but they also sell tea in the same ones",
                            "score": 9,
                            "author": "Agree0rDisagree"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an Ethiopian it is my duty to state that 'Coffee was discovered in Ethiopia' every time it's mentioned.",
            "score": 180,
            "author": "Bright_Struggle3613",
            "replies": [
                {
                    "level": 1,
                    "comment": "TIL",
                    "score": 16,
                    "author": "echobox_rex"
                },
                {
                    "level": 1,
                    "comment": "Thank you, Ethiopia 💕💕💕",
                    "score": 23,
                    "author": "jorgitovaldivia"
                },
                {
                    "level": 1,
                    "comment": "Ethiopia, we salute you!",
                    "score": 12,
                    "author": "scottjones608"
                },
                {
                    "level": 1,
                    "comment": "Coffee drinkers of Reddit  salute you 🫡",
                    "score": 13,
                    "author": "tothemoonandback01"
                },
                {
                    "level": 1,
                    "comment": "Thank you, Ethiopia. Most important drink aside from water. Without coffee, anarchy would ensue worldwide",
                    "score": 6,
                    "author": "Dunkleosteus666"
                },
                {
                    "level": 1,
                    "comment": "Thank you, fellow Ethiopian, for your land being the creators of this marvel of the world!!!!!!!",
                    "score": 5,
                    "author": "AlexWotanson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a Brazilian I’m offended by this map",
            "score": 87,
            "author": "JoelCiclon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never been more offended by a map in my whole life",
                    "score": 25,
                    "author": "Chestergaard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmao this is wrong as fuck. There is no way people drink more tea than coffee in Brazil. We have been one of the world’s largest coffee producers for decades",
            "score": 221,
            "author": "equatornavigator",
            "replies": [
                {
                    "level": 1,
                    "comment": "Brazil is about the first country that comes into my mind when hearing the word \"coffee\".",
                    "score": 51,
                    "author": "LTFGamut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yemen, or Ethiopia.",
                            "score": 2,
                            "author": "jdmrabntursiamata"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeap, in Brazil every house, everybody drink, every day. If someone say don't drink coffee, is for reasons like sleeping, if someone drink tee is for their effects, calm, stomachs, etc.",
                    "score": 22,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "These easy-to-spot ones sometimes make me think how many bullshit maps I've seen without realizing they're wrong.",
                    "score": 18,
                    "author": "Masseyrati80",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Many many many of them are wrong. A key give-away of wrong maps is maps that use Wikipedia as a source, because of two reasons:\n\n- either they are using english-only Wikipedia, which often has incomplete, old or even wrong information about anywhere that doesn't speak English \n\n- or they are picking wikipedia in many different languages. But that also doesn't work because Wikipedia in English has much more info than on other languages.\n\nI remember seeing a map here about countries that produce the most videogames which had English Wikipedia as a source. The map seriously said China only had 6 videogames and no one seemed to think it was strange.\n\nThe amount of misinformation in this sub is worrying and baffling.",
                            "score": 7,
                            "author": "TheLSales"
                        },
                        {
                            "level": 2,
                            "comment": "There’s no information on what data they’re using or even what context they’re presenting it as. Lousy lousy.",
                            "score": 6,
                            "author": "Maximalminutiae"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The same for Vietnam. You can find coffee everywhere in Vietnam, at every corner there will be little place where you can drink some coffee. They drink tea only if they want to drink something before one more cup of coffee.",
                    "score": 17,
                    "author": "Askelb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn right. Vietnamese ice coffee is a national drink.",
                            "score": 5,
                            "author": "Simple_Throat_6523"
                        },
                        {
                            "level": 2,
                            "comment": "That is not true. Traditional Vietnamese tea culture dates back centuries and has strong roots in Vietnamese daily life. Tea is often enjoyed throughout the day and is commonly offered to guests as a gesture of hospitality. Coffee is generally more popular in big cities like Hanoi and Ho Chi Minh City, while tea is commonly consumed in the countryside where the majority of Vietnam's population lives.",
                            "score": 6,
                            "author": "LamNDL",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting detail, thank you!",
                                    "score": 3,
                                    "author": "Askelb"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I second this",
                    "score": 19,
                    "author": "afonsolage",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I third this",
                            "score": 8,
                            "author": "Mendeleus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I quarter this",
                                    "score": 8,
                                    "author": "cambeiu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i fifth this",
                                            "score": 4,
                                            "author": "Complete_Spot3771",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I sixth this",
                                                    "score": 1,
                                                    "author": "Attack_Helecopter1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I coffee this.",
                                                            "score": 2,
                                                            "author": "iporemlopsum",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For around 250 years lmao",
                    "score": 9,
                    "author": "crowkk"
                },
                {
                    "level": 1,
                    "comment": "Same for Ecuador, we drink a lot of Colombian coffee.",
                    "score": 2,
                    "author": "comodin"
                },
                {
                    "level": 1,
                    "comment": "Mate is included with tea, it says so in the bottom right. Probably any herbal tea is included then? Maybe that's why.",
                    "score": 6,
                    "author": "very_random_user",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We drink mate in the south, but even that, isn’t not even close of how much coffee we drink. I would guess that 1% of the population drinks mate and everyone else drink coffee regularly.",
                            "score": 14,
                            "author": "Alternative-Beyond78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m not Brazilian and you definitely might be right, but this map is only about consumption, not about production of coffee.",
                    "score": 0,
                    "author": "knightarnaud",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Vietnam is one of the top coffee producer and is strongly on the tea side of things.",
                    "score": 1,
                    "author": "CoffeeBoom"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This inclusion of mate creates a distorted view of Brazil.\n\nIndustrialized iced tea is consumed in Rio de Janeiro, but they drink coffee at home.\n\nIn the south of Brazil there is a state that consumes a lot of natural hot tea. They drink coffee during the day but they are also always drinking this tea.\n\nIn two other states there is also a considerable number of people who drink natural iced tea. But they also drink coffee on a daily basis.\n\nCoffee in Brazil is strong, if you consume those big cups like in the United States, you'll turn into a rocket.\n\nThe cups of hot natural tea (chimarrão) and natural iced tea (tererê) are large.\n\nMaybe this causes this distorted view.\n\nBrazil is undoubtedly a country of coffee consumers.\n\nBreakfast in Brazil is called \"Coffe of morning\"\n\nAt least coffee is more consumed in 25 of the 26 Brazilian states + federal capital. The only state that may have doubts is Rio Grande do Sul, which is the 6th most populous state in Brazil and has the 12th most populous capital.",
            "score": 72,
            "author": "RepresentativePin301",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have to see how they made this account. Coffee in Brazil is arguably more consumed than tea (whichever union you are in). In Brazil, it should only be a drink less consumed than water, and look there too, few drink pure water, drink more in juices and the like. \n\nThe research institute of Brazil (IBGE), stated that EVERY Brazilian, consumes an average of 4 to 5 cups of coffee per day.",
                    "score": 19,
                    "author": "EllanJoestar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I worked out there the tea ladies only brought coffee and everyone drank little portions constantly.",
                            "score": 8,
                            "author": "Reginaferguson"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is absolutely wrong, everyone in the Anglo Caribbean drinks tea, every single day, even more so than eating breakfast",
            "score": 36,
            "author": "UniversalBasilisk",
            "replies": [
                {
                    "level": 1,
                    "comment": "And in Brazil we drink coffee, the map is plain wrong",
                    "score": 26,
                    "author": "Dimas166"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seriously Brazil is a tea country?",
            "score": 10,
            "author": "FroZenCat31"
        },
        {
            "level": 0,
            "comment": "Da fuck - Brazil tea? That’s a joke people don’t even has tea in their homes, I can even tell is one of the few countries that some people just have tea once or twice in their lives . Now coffee is everyday everywhere multiple times a day",
            "score": 29,
            "author": "Extension_Canary3717"
        },
        {
            "level": 0,
            "comment": "As a Brazilian I have never seen such bullshit before.",
            "score": 29,
            "author": "goozila1"
        },
        {
            "level": 0,
            "comment": "This is so wrong in many ways. Brazil is by a HUGE margin coffee first country.",
            "score": 59,
            "author": "afonsolage"
        },
        {
            "level": 0,
            "comment": "Why not both? :)",
            "score": 28,
            "author": "notaedivad",
            "replies": [
                {
                    "level": 1,
                    "comment": "You also forgot +cigarette for all of Eastern Europe. Source: am Bulgarian",
                    "score": 41,
                    "author": "theczarfromBG",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Australia is very much a both. Tea from the traditional British sources, Indian immigrants etc, but a big coffee culture came with the waves of Italian and Greek immigrants.",
                    "score": 13,
                    "author": "Trashk4n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The UK is both as well. I would guess that two cups of tea are drunk for every cup of coffee. I find it odd that so many people will drink one but not the other.\n\nSaying that, in some European countries, I've found it utterly impossible to find even remotely nice tea in any shops",
                            "score": 4,
                            "author": "Arsewhistle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's just bs for Brazil, even if you include Mate, Mate isn't even a thing in large chunks of the country.",
            "score": 25,
            "author": "Barba_Rosa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say the same!",
                    "score": 4,
                    "author": "BeijumdePudim"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf is the source for this, the most popular non alcoholic beverage in Japan are the various forms of green tea. They give it out like water automatically without asking in restaurants. \n\nI feel Coffee is popular with the young but it’s mostly canned, it’s not ingrained like tea.",
            "score": 8,
            "author": "Troomdawg"
        },
        {
            "level": 0,
            "comment": "seems off for Poland we were always more of a tea country",
            "score": 8,
            "author": "Vertitto",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Im pretty sure its coffee in Brazil",
            "score": 19,
            "author": "Sunburys"
        },
        {
            "level": 0,
            "comment": "This is so wrong. Vietnam and Indonesia are major coffee drinking  and producing countries",
            "score": 6,
            "author": "BornChef3439"
        },
        {
            "level": 0,
            "comment": "The Philippines is such a coffee country that you can see some of my fellow Filipinos drinking coffee at the hottest times of the day (i.e. from noon to 3 PM, UTC+8). We poke fun at that practice too.",
            "score": 6,
            "author": "_lechonk_kawali_"
        },
        {
            "level": 0,
            "comment": "A frequent traveler to Russia says he always goes there with one suitcase full of clothing, toiletries, work-related stuff... and a second suitcase full of COFFEE and canned tuna.  So, I'm guessing the map is right about Russia.",
            "score": 16,
            "author": "Editrix-NM",
            "replies": [
                {
                    "level": 1,
                    "comment": "Plenty of good coffee and canned tuna (and fresh tuna, and canned other fish) in Russia so I don't get what the heck is your acquaintance doing.\n\nBut yeah the map is correct regarding tea consumption in Russia.",
                    "score": 5,
                    "author": "FengYiLin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I should have made that comment in the past tense.  It was 1985 when he said that.",
                            "score": 1,
                            "author": "Editrix-NM"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, North Korea actually has data on this map",
            "score": 5,
            "author": "descriptiontaker"
        },
        {
            "level": 0,
            "comment": "Brazil not has been the biggest producer of coffee since it has existed, it’s also a huge consumer. Brazilians who drink tea exist, but those are the exception to the rule. Even in areas where tea is consumed traditionally (usually mate and herbal teas), they fill different roles. Also some teas are seen as medicinal.",
            "score": 3,
            "author": "LupusDeusMagnus"
        },
        {
            "level": 0,
            "comment": "I'm brazillian and we drink unholy ammounts coffee.\n\nStomach wall piercing but whatever I won't stop-ammounts.\n\nI also drink tea, only black tea. Iced version because caffeine.\n\nBut it is far more common to drink coffee. Breakfast is café-da-manhã, \"morning coffee\".",
            "score": 4,
            "author": "JunkieWizard"
        },
        {
            "level": 0,
            "comment": "I'm Brazilian and very offended by this map... Might make a coffee to calm me down a bit",
            "score": 4,
            "author": "randomusername044"
        },
        {
            "level": 0,
            "comment": "The true reason for Brexit",
            "score": 7,
            "author": "xCheekyChappie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sovereigntea",
                    "score": 9,
                    "author": "iamapizza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Coffee 2 cups a day, tea 5 cups a day.",
            "score": 3,
            "author": "KirDor88"
        },
        {
            "level": 0,
            "comment": "Data on North Korea!?!",
            "score": 3,
            "author": "No_Zombie2021"
        },
        {
            "level": 0,
            "comment": "North Korea coffee?",
            "score": 3,
            "author": "sheytanelkebir"
        },
        {
            "level": 0,
            "comment": "Somehow we have data from North Korea, but not Somalia and Eritrea.",
            "score": 3,
            "author": "Attack_Helecopter1"
        },
        {
            "level": 0,
            "comment": "Poland is definitely tea country.",
            "score": 3,
            "author": "sexychippy"
        },
        {
            "level": 0,
            "comment": "Britain and Ireland continue to be the only nations in Europe with good taste\n\nEdit: and Turkiye soz lads",
            "score": 20,
            "author": "princeikaroth",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is all good. Turkish forgives 👐",
                    "score": 4,
                    "author": "_kewdon_"
                },
                {
                    "level": 1,
                    "comment": "idk why ppl include turkey in these europe conversations. Only 3% is in Europe",
                    "score": -19,
                    "author": "gr000t___",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because of historical significance, mainly the ottomans had a huge influence on Eastern Europe \n\nBut also Kazakhstan and Georgia are counted, so by that logic, I think Turkiye counts, seeing how both are further east",
                            "score": 19,
                            "author": "princeikaroth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Its turkey not turkiye, you write in english.",
                                    "score": -11,
                                    "author": "NoGas6430",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thought i Seen a big hullabaloo about it being changed to turkiye internationally now ? Did they go back on it or just not through with it ?",
                                            "score": 2,
                                            "author": "princeikaroth",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They demanded that in english turkey is turkiye. Cause they want to. Cause they are in charge of the english language. I demand the word bed is now deb.",
                                                    "score": -3,
                                                    "author": "NoGas6430",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah I prefer turkiye tbh think Turkey sounds retarded, its a bird I know the etymology is reverced but still \n\nAnd no one is in charge of English its taken and bastardised by any and all source im Scottish",
                                                            "score": 3,
                                                            "author": "princeikaroth"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Ok, you’re never allowed to change your name 👍",
                                                            "score": 1,
                                                            "author": "ExoticMangoz",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ehm...you can but in your own language, you cant demand every body else change their language for you.",
                                                                    "score": 2,
                                                                    "author": "NoGas6430",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Well if you were speaking as the authority of bed’s we might be inclined to",
                                                            "score": 1,
                                                            "author": "Cousin_Cactus"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Should still be left out to asia imo",
                                    "score": -1,
                                    "author": "gr000t___"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Around 15% of the population lives there, or just under 13m. There are far more Turks living in Europe than there are Irish or Portuguese.\n\nIstanbul is also one of Europe's most historically significant cities",
                            "score": 4,
                            "author": "Arsewhistle",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Eastern, Western, Northern and Southern parts of Mediterrenean basin is its own continent. You cant seperate them to be Asia and Europe. There are hundreds if not thousands years of interconnectivity between the civilizations that occupied those areas.",
                            "score": 2,
                            "author": "classteen"
                        },
                        {
                            "level": 2,
                            "comment": "3% of land but 25% of the population",
                            "score": 2,
                            "author": "Asil001",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for pointing that out, I hardly noticed those tiny orange specs on the map near Europe.",
                    "score": 1,
                    "author": "BoiledJellybeanz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome",
                            "score": 1,
                            "author": "princeikaroth"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm Tunisian and I can tell you this map is very wrong at least for Tunisia, Tunisian people drink coffee way more than tea, in Tunisia every street have a coffee shop full of people day and night (sign of unemployment unfortunately)",
            "score": 4,
            "author": "AK56xXx"
        },
        {
            "level": 0,
            "comment": "Im not from Nicaragua but based on the times I’ve been there I’m pretty sure they’d be coffee as well?",
            "score": 2,
            "author": "UniverseJefe"
        },
        {
            "level": 0,
            "comment": "I am surprised yemen is tea",
            "score": 2,
            "author": "Latiftude",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same as Turkey, which spread coffee from Yemen to Europe.\n\nAll Arabs are heavy tea drinkers (Jordanians too) except for Tunisia and Algeria, due to French influence.",
                    "score": 2,
                    "author": "FengYiLin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Australia would have changed over the last 50 years prob. Used to be tea. Now coffee.",
            "score": 2,
            "author": "porcupineapplepieces",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally. It's weird not to drink coffee but not tea. Source: only drink tea. Eyes bulge when I say I don't drink coffee. \nWhen I was a kid coffee was Nescafe, Maxwell House or International Roast. Fancy was cappuccino at a cafe.",
                    "score": 3,
                    "author": "imapassenger1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as a brazilian, whoever created this bs had ONE JOB",
            "score": 2,
            "author": "thebirty"
        },
        {
            "level": 0,
            "comment": "I think that's incorrect for Brazil. \nThere's a lot of research that shows the opposite.\n\nThis one shows that coffee is the second beverage most consumed, only behind water\nhttps://dolcearomacafe.com.br/a-dolce-aroma/noticias/estudo-revela-que-cafe-e-a-2-bebida-mais-consumida-no-brasil/108\n\nThis one shows that 98% of Brazilian families consume coffee (at least one family member)\nhttps://www.em.com.br/app/noticia/economia/2019/05/21/internas_economia,1055467/cafe-e-segunda-bebida-mais-consumida-entre-brasileiros-mostra-pesquis.shtml#:~:text=A%20pesquisa%20revela%20que%20o,98%25%20dos%20lares%20consomem%20caf%C3%A9.\n\nThis one shows that 80% of all Brazilian citizens consume coffee \nhttps://g1.globo.com/pr/parana/noticia/2013/10/pesquisa-do-ibge-aponta-que-quase-80-dos-brasileiros-consomem-cafe.html",
            "score": 2,
            "author": "andrey_araujo1"
        },
        {
            "level": 0,
            "comment": "Bro what the fuck, i live in Brazil and we literally drink coffee everyday, this shit is so wrong 💀",
            "score": 2,
            "author": "GabrielGamer790"
        },
        {
            "level": 0,
            "comment": "Tea in Ecuador? Something is wrong there",
            "score": 2,
            "author": "_Totorotrip_"
        },
        {
            "level": 0,
            "comment": "Hahaha... Brasil tea?? Es el mayor productor del mundo de café!",
            "score": 2,
            "author": "Yofuigarquetti"
        },
        {
            "level": 0,
            "comment": "Wrong for south India. The entire state of Tamil Nadu starts their day with a cup of filter coffee",
            "score": 2,
            "author": "Froogler",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Really? Brazil is tea? Every brazilian house consumes coffee at least two times at the day, morning and evening",
            "score": 2,
            "author": "mrcsbsts"
        },
        {
            "level": 0,
            "comment": "I didn't expect Turkey /s",
            "score": 2,
            "author": "RemarkableCheek4596",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I bet Paraguay, Brazil, Uruguay and Argentina counts yerba mate drinks as tea.",
            "score": 2,
            "author": "JALKHRL"
        },
        {
            "level": 0,
            "comment": "Turkey is orange again",
            "score": 4,
            "author": "bilibili_yumurta"
        },
        {
            "level": 0,
            "comment": "Uh, guys… Japan? I’ve lived there and assure you it is a tea country. \n\nI doubt the Koreas are accurate, either.",
            "score": 3,
            "author": "miles___ahead"
        },
        {
            "level": 0,
            "comment": "fun fact : coffee introduce to the world by Turks and popularized. after Ottoman empire decline on coffee businesses they switched to Turkish tea...",
            "score": 2,
            "author": "Unlucky_Lettuce_1365"
        },
        {
            "level": 0,
            "comment": "What the hell is “maté”",
            "score": 2,
            "author": "avadakedavr_",
            "replies": [
                {
                    "level": 1,
                    "comment": "A kind of tisane (herbal tea) popular in South America.",
                    "score": 3,
                    "author": "Canadairy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No no I know, I’m Argentinian. It’s mate, “maté” means “I killed”.",
                            "score": 3,
                            "author": "avadakedavr_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nz drinks tea.",
            "score": 1,
            "author": "furyfornow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I drinks coffee",
                    "score": 1,
                    "author": "RtdFgtNZ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are in the minority.",
                            "score": 1,
                            "author": "furyfornow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pssh, wannabe Poms. Love Australia",
                    "score": 1,
                    "author": "ZeTian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "coffe is life here in the ph even if the weather is hell",
            "score": -1,
            "author": "Business_Giraffe9359"
        },
        {
            "level": 0,
            "comment": "Imagine drinking leaf water\n\n- Bean gang",
            "score": -5,
            "author": "Dongodor"
        },
        {
            "level": 0,
            "comment": "What about carling",
            "score": 1,
            "author": "MarxistMann"
        },
        {
            "level": 0,
            "comment": "Indonesia isn’t a tea region…",
            "score": 1,
            "author": "awunaught"
        },
        {
            "level": 0,
            "comment": "I wanted to know if Scotland on it's own was a Tea or Coffee country and found out that The Scots drink six times as many cups of tea as the Irish (the largest drinkers of tea of any country) and that Edinburgh is apparently the biggest tea drinkers of Scotland, which is odd because 1. I'm Scottish and from Edinburgh and 2. I prefer coffee and Energy Drinks.",
            "score": 1,
            "author": "OhHiGCHQ",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a Scottish person most people I ask prefer tea.  \n(I prefer tea)",
                    "score": 1,
                    "author": "Attack_Helecopter1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fun fact, the best coffee in the world is produced by countries that prefer tea.",
            "score": 1,
            "author": "Either_Letterhead_39"
        },
        {
            "level": 0,
            "comment": "Honestly I think Ireland could be fairly close",
            "score": 1,
            "author": "GingaHead"
        },
        {
            "level": 0,
            "comment": "Explains the productivity",
            "score": 1,
            "author": "failtos"
        },
        {
            "level": 0,
            "comment": "This map vs number of Starbucks shops or profit per country. What would it look like?",
            "score": 1,
            "author": "largo_che"
        },
        {
            "level": 0,
            "comment": "WRONG, here in Brazil we drink so much coffee that is like people BREATH COFFEE. TOTALLY WRONG",
            "score": 1,
            "author": "AlexWotanson"
        },
        {
            "level": 0,
            "comment": "It's not fair to group tea with mate. They are different types of drinks, prepared amd consumed in vety different ways",
            "score": 1,
            "author": "SomebodyFromBrazil"
        },
        {
            "level": 0,
            "comment": "South America, Asia, Africa is where coffee beans are grown and they don’t wanna drink it, but we westerners crave our brown slodge like crazy apparently",
            "score": 1,
            "author": "ChimkenNuggs"
        },
        {
            "level": 0,
            "comment": "Not surprised that the UK has more Tea",
            "score": 1,
            "author": "paispro_"
        },
        {
            "level": 0,
            "comment": "Brazil is absolutly wrong",
            "score": 1,
            "author": "Athena-cosmos-888"
        },
        {
            "level": 0,
            "comment": "Change Vietnam",
            "score": 1,
            "author": "ImaFireSquid"
        }
    ]
}