{
    "id": "13u1vph",
    "score": 75,
    "title": "Continental VS Mediterranean Italy",
    "author": "_Regh_",
    "date": 1685284386.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/13u1vph",
    "media_urls": [
        "https://i.redd.it/86wjeb062l2b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "⚠️ Continental attached to Mediterranean Sea ⚠️",
            "score": 22,
            "author": "_kewdon_"
        },
        {
            "level": 0,
            "comment": "Venice is \"continental\", not Mediterranean, while Florence is Mediterranean, not continental -- according to this crappy \"map\"?\n\nThat is utmost bullshit.",
            "score": 3,
            "author": "Macau_Serb-Canadian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you ever been to Tuscan and Veneto? \n\nThere's a reason why Veneto is part of the \"butter Italy\" and Tuscany part of \"olive oil Italy\"",
                    "score": 2,
                    "author": "TMudin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, I have. Tuscany (not \"Tuscan\") ie Toscana/Etruscland is as continental as it gets in Italy -- away from all seas around the penninsula -- and Venezia la Serenissima is virtually built on the sea floor, on large poles as partly natural, partly artificial islets and it ruled the Mediterranean for centuries with dozens of colonies throughout.\n\nErgo the latter is Mediterranean, and Firenze is as continental as Arles or Brno.",
                            "score": -4,
                            "author": "Macau_Serb-Canadian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, all the western side of appennines is heavily influenced by the mediterranean climate, hence why tuscany is not continental. If you've been to tuscany, you note that forests from the hills down to plains, all the way up down to naples, are not of continental type but of mediterranean style, meaning there are some indigenous plants of the mediterranean climate (es. mediterranean pines, oaks ecc.). This is because the western side of Italy is on the western mediterranean, where mediterranean climate is strongest (it encompasses the entirety of spain and the coast of southern france) \n\nOn the other hand, northern italy and the eastern side of the appennines are heavily influenced by continental currents coming from the balkans. Especially in the po plain, where the balkan winds are trapped by the Alps and the appennines, creating a pretty cold climate, which in the winter is very rigid, becoming ad cold as north-western europe (in the western part of the po valley temperatures can even be lower than Scotland)",
                                    "score": 7,
                                    "author": "_Regh_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In principle I hate having to repeat the argument I have already made for the likes of you -- who obviously have a problem grasping facts.\n\nI am in a particularly good mood right now so I will repeat what I  have already explained: Venice is Mediterranean because it is literally built on the bottom of the Mediterranean Sea's large bay (Adriatic Sea), and because it had colonies all around the Mediterranean Sea.\n\nFlorence is in no way whatsoever Mediterranean because it is located over a hundred kilometres from the nearest sea coast, which is as far from the sea as one gets on the Appenine Penninsula. It also never had any colonies on the Mediterranean littoral. It is therefore as continental as the cities I mentioned before.\n\nThe fact that it rains one way somewhere and another way somewhere else is not related to being Mediterranean, because even the Black Sea is just a bay of the Mediterranean and the rain pattern there certainly does not match either Palma de Maiorca or Brindisi or Tel Aviv or Alexandria or Istanbul or Split (all Mediterranean cities).\n\nIf you are still unable to comprehend the facts I have carefully laid out in very straightforward and simple terms so even you could try to grasp them, sorry, but I have no more time for bullshit and will have to block you.",
                                            "score": -4,
                                            "author": "Macau_Serb-Canadian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;The fact that it rains one way somewhere and another way somewhere else is not related to being Mediterranean\n\nThis is a map of **biogeographical regions**, not whatever you're talking about. Climate and geography are a major factor that explains the kinds of species you can find on a region.\n\nIn this context:\n\n* \"Mediterranean\" means dry summers and rainy winters, with no month averaging below 0 °C.\n* \"Alpine\" means \"above the tree line\", where trees fail to grow due to cold. The warmest month averages below 10°C.\n* \"Continental\" means coldest month averaging below 0 °C and warmest month averaging above 10°C. In Italy, however, the Continental bioregion has Oceanic and Humid Subtropical climates, with year-round rain and no month averaging below 0°C.\n\nNot all Mediterranean bioregions are found in the Mediterranean basin, and not all of the bioregions found in the Mediterranean basin are Mediterranean bioregions. Those are different concepts.",
                                                    "score": 2,
                                                    "author": "locoluis"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Roman empire lives in all Europe.",
            "score": 2,
            "author": "MeiGuoGaiQuSi"
        },
        {
            "level": 0,
            "comment": "rough map, but good",
            "score": 0,
            "author": "ASTRONACH"
        },
        {
            "level": 0,
            "comment": "The only continental  I see are the Alps.",
            "score": -2,
            "author": "Ana_Reddit_me",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's about _bio_ geographic regions. Meaning it considers biomes and their location",
                    "score": 9,
                    "author": "_Regh_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty rough, yeah.",
            "score": 0,
            "author": "g_spaitz"
        }
    ]
}