{
    "id": "13vha3n",
    "score": 491,
    "title": "Map of Prūsa historical region with town names in nawaprūsiskan.",
    "author": "Crovon",
    "date": 1685423621.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/13vha3n",
    "media_urls": [
        "https://i.redd.it/ev8mzh3vjw2b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Those thin bits would be fun to walk along.",
            "score": 71,
            "author": "grapefruitzzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are... The part in Lithuania (Curonian Spit) is easily accessible from Klaipeda, the towns and coastline there is beautiful.\n\nEdit: and it is a UNESCO heritage",
                    "score": 72,
                    "author": "Kichyss"
                },
                {
                    "level": 1,
                    "comment": "There's another one in Poland with a train running along it it's great, you get a sea view out of both windows.",
                    "score": 26,
                    "author": "EconomySwordfish4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hel peninsula, there's also a city Hel on it with Seal Sanctuary.",
                            "score": 10,
                            "author": "Yurasi_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wanna go to Hel.",
                                    "score": 7,
                                    "author": "grapefruitzzz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've been there. Hell is preferable.",
                                            "score": 1,
                                            "author": "RegisterAdmirable842",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've been somewhere Nysa.",
                                                    "score": 1,
                                                    "author": "grapefruitzzz"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hel peninsula 🔥🔥🔥🔥",
                                    "score": 5,
                                    "author": "SeverynUA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Decades ago you’d even say Hel Hitler in that place 😜",
                                            "score": 5,
                                            "author": "deanza10"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is Nawaprusiskan the name of a revived Prussian language? (The pre-Germanic Prussians)",
            "score": 49,
            "author": "LiamGovender02",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes.\n\nIt’s literally “New Prussian”",
                    "score": 35,
                    "author": "Polskimadafaka"
                },
                {
                    "level": 1,
                    "comment": "I have some strong doubts on the possibility of even reviving old baltic prussian. We have very few remnants of that language, and they tend to be corrupted. Obviously there's also a lot of missing informations on dialects.\n\nI'm sure it's possible to extrapolate the toponymy somewhat, though I doubt most towns and cities would even have names in old prussian - because they didn't exist yet.\n\nI wouldn't be surprised if OP based his work on the very debatable reconstruction of old prussian by soviet linguists in the 1980s. Hopefully it's a more modern attempt.",
                    "score": 25,
                    "author": "BriarSavarin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you have more information on the Soviet reconstruction?",
                            "score": 4,
                            "author": "wegwerpacc123"
                        },
                        {
                            "level": 2,
                            "comment": "Where is the difference to Old Gaelic languages like in Scotland or Ireland?  \n(Question serious.)",
                            "score": 3,
                            "author": "Endward22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Irish and Scots Gaelic are both still living languages.\n\nIf you mean, why is it harder to reconstruct Old Prussian than it is Old Irish (which is the ancestral language of both), then we don't need to reconstruct Old Irish as there is a sizable corpus of existing documents in Old Irish - from about 1300 years ago.\n\nhttps://en.wikipedia.org/wiki/Old\\_Irish",
                                    "score": 23,
                                    "author": "DeValiantis"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does the background turn black if I open the image?",
            "score": 10,
            "author": "Iissomeoneelse",
            "replies": [
                {
                    "level": 1,
                    "comment": "The image doesn't have a background - it's sitting on transparency, so the colour of the area surrounding the image is dictated by the colour scheme of the program you are using to view it.",
                    "score": 12,
                    "author": "DePraelen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm viewing it on Reddit",
                            "score": 4,
                            "author": "Iissomeoneelse"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "its time for a United Prussian again!",
            "score": 45,
            "author": "CardiologistOk1199",
            "replies": [
                {
                    "level": 1,
                    "comment": "We don't have \"sovereign\" ambitions. We are reviving the language and culture the best we can after it fell victim to German-Polish assimilation.",
                    "score": 48,
                    "author": "Crovon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Old Prussian history is so underrated.\nHerkus Monte was basically the same hero as Arminius. Both were educated by foreign empire, defeated the invadors and died cuz of empire.\n\nPolish prince of Gdańsk was an ally in the uprising.\nBTW. 35% of Teutonic forces at battle of Grunwald were old-prussians",
                            "score": 28,
                            "author": "Witcher587"
                        },
                        {
                            "level": 2,
                            "comment": "Who's \"we\" though? Is this like a formal project?",
                            "score": 19,
                            "author": "InteractionWide3369",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are a couple \"projects\" with slightly different motivations. On the German side the Tolckemita Society - now mostly extinct (they hated everything German and many members had lived through the trauma of expulsion and being labeled German).  \nIn Poland there are various groups that honour the historical legacy such as [prusowie.pl](https://prusowie.pl) .  \nIn Lithuania the most is being done - for example [twanksta.org](https://twanksta.org) \\- a gateway to publically access language learning and immersion materials.",
                                    "score": 9,
                                    "author": "Crovon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I like the idea of museum of Prussians, but the narrative of Prussia being conquered because they were the only free people in enslaved Europe is a huge stretch from expansion of Christianity and various rulers using it as an excuse to invade non-Christian nations. Duke of Masovia invited Teutons to fight Prussians because they were sometimes pillaging his lands, the same was done by Yotvingians what causes many retaliatory expeditions and caused the fall of culture and integration into their neighbors.\n\nEdit: On polish site, I have no idea what is written on Lithuanian one",
                                            "score": 21,
                                            "author": "Yurasi_"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There still people that consider themselves Prussian (Baltic, not german)? I thought it's extinct ethnic group.",
                            "score": 13,
                            "author": "Yurasi_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That depends how you look at it - when in 1938 the Nazis formally changed all town names that had Prussian etymology it was mostly due to some youth groups challanging the Nazi narratives and uniting around the old-Prussian identity - while pretty much all Prussian language use in public ceased in the 18th century not all was forgotten and many people were still descendents of the Prūsai and were vaguely familiar with their fate.  \nNowadays the Baltic-Prussian identity is fragmanted - a story of sacrifice in the face of christianity. However, specifically people that have paternal surnames of Prussian origin tend to get curious and dig deep enough. (famous example being Tolkien - though JRR Tolkien was made aware late in his life he ultimately didn't seem to care - thankfully the same can not be said about his descendents thereafter)  \nMost modern Prussians live in Lithuania as Baltic culture prevailed there and Prussian is ultimately much easier to learn for speakers of Baltic languages. There is a new Kriwwi (high priest) of Romowe as well - a branch of Baltic paganism that continued in Lithuania.  \nThere are more Baltic languages where revival/preservation efforts are made but it's mostly up to volunteers to do so.",
                                    "score": 8,
                                    "author": "Crovon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There's a lot of confusion in this comment.\n\nThe Old Prussians went extinct a very long time ago, centuries. It doesn't mean that every trace of them vanished, but heritage is very different from culture. There's no old prussian identity today. Only LARPers.\n\nIt's a similar phenomenon to the neopagan movements that are also quite strong in the baltic states. They are modern reinventions and reinterpretations. \n\nThis is essentially history rewriting to feed  a modern nationalistic sentiment, and it's a dangerous thing that goes directly against historical sciences.",
                                            "score": 11,
                                            "author": "BriarSavarin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There is no old-prussian identity today the same way there is no old-English identity today. If to generalise more widely as \"Baltic-Prussian\" it becomes more ambiguous. Understandably a pure and 100% authentic revival is impossible, as such nawa - new. Using the legacy of the past we try to build a new legacy into the future which is as authentic of a continuation as sources allow - new elements and change being part of that continuation. As such feeding a \"modern nationalistic sentiment\" has little to do with rewriting history - all that is in the past has happened and all we can do is interpret historical accounts as accurately as possible.  \nI'm not entirely sure why you seem so hung up on an extinction to be the end of a given culture. Of course one should be wary of unjustified appropriations but beyond that let culture be culture so long as human rights and common sciences are respected.",
                                                    "score": -1,
                                                    "author": "Crovon"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I am calling BS most prussians live in germany or Poland, like my family for example, which still kept their prussian surname. This is just Lithuanian irredentism against Russia.",
                                            "score": 13,
                                            "author": "A-live666",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The thing with these Prussians is that they consider themselves Poles and Germans as you said, I find it believable since there are many movements recreating paganisms in Europe such as Norse in Scandinavia and rodnovery in slavic countries but I find it pointless as there is almost none sources to recreate this in case of slavic, so culture is not that big of a stretch.",
                                                    "score": 3,
                                                    "author": "Yurasi_"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don't see how it's Lithuanian irredentism - Lithuanians merely have an easier time intergrating into Prussian culture and learning the language as it's not that far apart.  \nMost Prussians by blood do in fact live in Germany and Poland - I don't see anyone disputing that.",
                                                    "score": 6,
                                                    "author": "Crovon"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So it's more like recreating from foundations? I guess you are one of them, are there also Yotvingians trying to rebuild their identity?",
                                            "score": 4,
                                            "author": "Yurasi_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, most Baltic branches that have written testimony have revival movements varying in size. Some languages (such as Curonian) unfortunately can't be revived as these languages were never really put on paper.",
                                                    "score": 4,
                                                    "author": "Crovon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Is there even enough of sources to recreate this culture? There are some groups in Poland recreating slavic paganism but it was never well recorded so it's kind of pointless.",
                                                            "score": 2,
                                                            "author": "Yurasi_"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, nice to see that so many people support Prussia. Sometimes you feel like the only one amongst sea of hostility",
            "score": 3,
            "author": "PoopGoblin5431"
        },
        {
            "level": 0,
            "comment": "Twanksta Paradise",
            "score": 2,
            "author": "wbwl"
        },
        {
            "level": 0,
            "comment": "Freedom for Prussia!",
            "score": 11,
            "author": "SchemeCapital",
            "replies": [
                {
                    "level": 1,
                    "comment": "poland is free to give independence to prussia",
                    "score": 13,
                    "author": "akdele5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Half of it is Russia, when it comes to Poland there is Warmia-Masuria voivodeship populated by almost 1,5 million people most of which are Poles (with many being from former eastern Poland) like over 95% and Prussians themselves are extinct ethnic group as far as I am concerned. There's no-one to give independence to.",
                            "score": 16,
                            "author": "Yurasi_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same for Russian part, 1 million people and 90% of them are from Russia, Ukraine and Belarus.",
                                    "score": 12,
                                    "author": "Ajobek"
                                },
                                {
                                    "level": 3,
                                    "comment": "True, the revival is meant to give people that live on our ancestral lands an opportunity to be in touch with the past - and if they choose to they can adopt the Prussian identity through integration.",
                                    "score": 3,
                                    "author": "Crovon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I doubt there would be many people that would choose to even within descendants of Prussians.",
                                            "score": 10,
                                            "author": "Yurasi_"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "true",
                                    "score": 0,
                                    "author": "akdele5"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah but now it's like &gt;95% polish with the biggest minority being probably ukrainians",
                            "score": 2,
                            "author": "Galaxy661_pl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Prussian People's Republic? I've seen this somewhere before ...",
                    "score": 4,
                    "author": "Botv0091"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Twānksta, interesting name for Czech Královec.",
            "score": 7,
            "author": "Kamil1707",
            "replies": [
                {
                    "level": 1,
                    "comment": "O.T., Original Twānksta.",
                    "score": 2,
                    "author": "PhreakBert"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What app is this?",
            "score": 2,
            "author": "Andrew_Tate_Enjoyer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Reddit",
                    "score": 29,
                    "author": "I_Am_Your_Sister_Bro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "🇩🇪🇩🇪",
            "score": 0,
            "author": "BlueBloodKarma"
        },
        {
            "level": 0,
            "comment": "Just to clear some thing, it's like a Baltic language or something way different?",
            "score": 1,
            "author": "Swer2078",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a Baltic language.  \nThe premise is enough mutual intelligibility with the old language while also modernizing the language to be fit for purpose in the 21st century - namely loanwords for things that didn't exist prior.",
                    "score": 6,
                    "author": "Crovon"
                },
                {
                    "level": 1,
                    "comment": "Western Baltic to be more precise",
                    "score": 3,
                    "author": "killme627278"
                }
            ]
        }
    ]
}