{
    "id": "13y8u2j",
    "score": 783,
    "title": "\"Gazaria\" the Genoese colonies of Crimea (together with the Principality of Theodoro-Mangup and the Khanate of Crimea), 1266-1475",
    "author": "zgido_syldg",
    "date": 1685701424.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/13y8u2j",
    "media_urls": [
        "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Caffa_and_Theodoro_2.svg/2560px-Caffa_and_Theodoro_2.svg.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The Principality of Theodoro is where Goths lived until their extinction.",
            "score": 148,
            "author": "mahendrabirbikram",
            "replies": [
                {
                    "level": 1,
                    "comment": "True, not for nothing did the Byzantines call the Crimea, even Gothia, and it is even thought that the Gothic language may have survived there until the 18th century.",
                    "score": 104,
                    "author": "zgido_syldg"
                },
                {
                    "level": 1,
                    "comment": "Should have done the Gothic Invasion achievement",
                    "score": 16,
                    "author": "Harold-The-Barrel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No CB East Frisia strategy enjoyer here. We’re rough first 20 years. After that it was a fantastic and funny game.",
                            "score": 11,
                            "author": "hicmar"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Their name went extinct, but their descendants still  live there. They mixed with Turkic people and Greeks and are  known today as the Crimean Tatars.",
                    "score": 56,
                    "author": "Adventurous-Moose863",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Their descendants also live in my local mall.",
                            "score": 35,
                            "author": "derstherower",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How is that? If you mean 'tartar' sauce, bro, we are tatars, not tartar. We are not  sauce.",
                                    "score": 11,
                                    "author": "Adventurous-Moose863",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly, I have never understood how tartar sauce or meat tartare came to be called that. In any case, 'Tartars' was the name used in the Christian West to refer to the Tatars. The word probably originated by crossing the word 'Tatar' with the Greek word 'Tártaros', meaning 'Hell', to indicate the terrible reputation that accompanied this population.",
                                            "score": 18,
                                            "author": "zgido_syldg",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, you understand the origin of the word correctly. At some point the word tartare began to refer to a dish of raw minced meat. Apparently because that's what barbarians were supposed to eat. The funny part is that we don't eat raw meat. One of our politicians  once told   how in Europe their delegation was served raw minced meat with a raw egg for lunch. He was shocked and didn't know what to do about it. And the hosts just wanted to please their guests😁🙈",
                                                    "score": 7,
                                                    "author": "Adventurous-Moose863"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He means mall goths",
                                            "score": 7,
                                            "author": "I_Like_Law_INAL"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I have plans.",
                                            "score": 1,
                                            "author": "blockybookbook"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There were lots of Goths in my high school.  Not sure what you mean.",
                    "score": 4,
                    "author": "cybercuzco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "'Gazaria' is the name by which the Genoese designated the Crimea in the Middle Ages (derived from 'Khazaria', although the Khanate of the Khazars had long since disappeared when the Genoese arrived). The Uffizio della Gazaria was a collegial magistracy created to look after the affairs of the Crimea and the other Genoese Black Sea colonies (1313-1529).\n\nPrrincipality of Theodoro was a Greco-Byzantine state situated in the Crimean mountains, while the Tatar Khanate stretched northwards.\n\n[Source](https://commons.m.wikimedia.org/wiki/File:Caffa_and_Theodoro_2.svg#mw-jump-to-license)",
            "score": 79,
            "author": "zgido_syldg",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've always wondered why Byzantium never conquered all of Crimea. It seems like it'd be relatively easy to hold considering how its only connection to the mainland is an isthmus a few miles wide.",
                    "score": 6,
                    "author": "derstherower",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perhaps Northern Crimea was not very attractive to the Byzantines either for resources or from a strategic point of view.",
                            "score": 17,
                            "author": "zgido_syldg"
                        },
                        {
                            "level": 2,
                            "comment": "It wasn't attractive. The south is mountainous (separate/defensible), has a warmer and drier climate (more familiar and hospitable to a Byzantine/Roman), and the north would have been windswept plains in comparison. The Isthmus isn't exactly going to help a huge amount as much as mountain fortifications would to defend against roaming bands of people coming from the steppes.",
                            "score": 7,
                            "author": "NorthVilla"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Principality of Theodore sounds a lot like The Republic of Dave.",
            "score": 66,
            "author": "Burninator05",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just need a Principality of Alvin and a Principality of Simon.",
                    "score": 18,
                    "author": "RedHeadedSicilian48",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Simon Bolivar already has a republic (Bolivia).",
                            "score": 8,
                            "author": "jss78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My name is Theodore and I’m just learning about this place.",
                    "score": 11,
                    "author": "theteedo"
                },
                {
                    "level": 1,
                    "comment": "It sounds like a name but afaik it comes from the early Middle Ages word to refer to the Germans/Germanic People groups. [Theodiscus](https://en.wikipedia.org/wiki/Theodiscus)",
                    "score": 6,
                    "author": "xlicer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was an Eastern Germanic kingdom of the Goths, so that checks out",
                            "score": 2,
                            "author": "Woutrou"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or that island called Ted’s from Captain Ron",
                    "score": 1,
                    "author": "Petrarch1603"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Centuries later, are there any traces of this Italian presence in Crimea?",
            "score": 22,
            "author": "USSMarauder",
            "replies": [
                {
                    "level": 1,
                    "comment": "There used to be a very small minority (largely dating back to an immigration that took place in the 19th century), but this has now practically disappeared (I think 300 people at most remain).",
                    "score": 30,
                    "author": "zgido_syldg"
                },
                {
                    "level": 1,
                    "comment": "There are Genoese castles.",
                    "score": 19,
                    "author": "mahendrabirbikram"
                },
                {
                    "level": 1,
                    "comment": "To some extent, yes. The Genoese colonies attracted Greek migrants from their Aegean colonies. This stopped the decline of the pre-existing local Pontic Greek community.\n\nhttps://en.m.wikipedia.org/wiki/Ukrainian_Greeks",
                    "score": 9,
                    "author": "SovietCanuckistan420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These were very important ports for the survival of the Byzantine Empire. \n\nMost of the wheat required to feed the empire were imported from modern day Ukraine via Crimea, as well as other trade goods from the Silk Road.\n\nTurkic Khaganate delivered the goods to Crimean ports, while Genoese transported them to Mediterranean ports.\n\nThis trade enabled Genoese to hold extreme political power over the Byzantine Empire. Crimean grains trade was the main form of capital transfer from the Byzantine Empire to the Italian Peninsula. Italians were able to fund Renaissance by the Crimean trade.\n\nHere is the picture of the Genoese Tower in Constantinople, aka Galata Tower.\n\nhttps://preview.free3d.com/img/2019/05/2279610415832892801/wee7im1g.jpg",
            "score": 44,
            "author": "KingKohishi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to admit that picture is not what I expected.",
                    "score": 32,
                    "author": "Wizard_Pope",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess that pic represented the process of unearthing the glory of the past. Here is the Genoese Galata tower, finally unearthed: https://en.m.wikipedia.org/wiki/Galata_Tower",
                            "score": 2,
                            "author": "Digharatta"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The last \"remnants\" of the Eastern Roman Empire 🥲\n\n(I know they were technically gothic and not greek)",
            "score": 21,
            "author": "MrDrakeTheGeneric",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well the population was quite mixed, the official language was Greek, but the population was a mixture of Greeks, Goths, Tartars and others.",
                    "score": 15,
                    "author": "zgido_syldg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's true I suppose, the Romans weren't exactly homogeneous either aswell",
                            "score": 7,
                            "author": "MrDrakeTheGeneric",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course",
                                    "score": 2,
                                    "author": "zgido_syldg"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Byzantine flag still flies over Mt Athos too",
                    "score": 2,
                    "author": "Petrarch1603"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder what the city names in (parentheses) mean? All of them seem to be modern city names except for Inkerman?",
            "score": 3,
            "author": "hlebspovidlom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Inkerman is still called that.",
                    "score": 6,
                    "author": "zgido_syldg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AFAIK, Inkerman is just a part of Sevastopol now",
                            "score": 5,
                            "author": "hlebspovidlom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Im not sure why you would say that. Its still a city, just like any suburban city next to a much bigger city. Although, Russians moved tons of people to Crimea from Russia after 2014 as part of ethnic cleansings, so Sevastopol has near twice as much people than it had before 2014.",
                                    "score": -3,
                                    "author": "thesouthbay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting point. May I see the source?",
                                            "score": 2,
                                            "author": "hlebspovidlom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There is no source for this because it's bullshit. Many people moved there, because the climate is great and there is the black sea, not because of some government actions. Also, Sevastopol was almost completely ethnic russian, there were almost no ukrainians or crimean tatars, so how exactly the ethnic cleansing would have happened?",
                                                    "score": 5,
                                                    "author": "schneeleopard8"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You want a source that the population of Sevastopol doubled since 2014? You can open Wikipedia for that. Keep in mind, that Sevastopol isnt a seaside resort like most of Crimean towns, its major military base, so most of newcomers are military personnel.\n\nOr you want a source that Russian commited ethnic cleansings in Ukraine? You can start by reading about the deportation of Crimean tatars: [https://en.wikipedia.org/wiki/Deportation\\_of\\_the\\_Crimean\\_Tatars](https://en.wikipedia.org/wiki/Deportation_of_the_Crimean_Tatars)  \nRussians deported ALL Crimean Tatars from Crimea to Central Asia, then they moved ethnic Russians from Russia into Tatar homes and started claiming that \"Crimea is Russian\". Tatars were banned to move back to Crimea until Ukraine became independent.\n\nIf you want to learn about actions of Russia under current leadership, you can start from the fact that the International Criminal Court issued an arrest warrant against Putin for ordering mass kidnapping of Ukrainian children, moving them away from their families and educating them with Russian propaganda: [https://www.icc-cpi.int/news/situation-ukraine-icc-judges-issue-arrest-warrants-against-vladimir-vladimirovich-putin-and](https://www.icc-cpi.int/news/situation-ukraine-icc-judges-issue-arrest-warrants-against-vladimir-vladimirovich-putin-and)",
                                                    "score": 1,
                                                    "author": "thesouthbay"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, I checked and you are right.",
                                    "score": 1,
                                    "author": "zgido_syldg"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Phanagoria",
            "score": 6,
            "author": "Always_was_depressed",
            "replies": [
                {
                    "level": 1,
                    "comment": "At that time, Phanagoria no longer existed; in the Middle Ages, on the ruins of nearby Hermonassa, Tmutarakan, a trading outpost linked to Kievan Rus, was built. At the time this map refers to, Matrega (or Matriga), also a Genoese colony of the Ghisolfi family, was built on the ruins of Phanagoria. Subsequently, the area was abandoned and remained almost uninhabited until the 18th/19th century.",
                    "score": 11,
                    "author": "zgido_syldg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know, just brings happy memories",
                            "score": 3,
                            "author": "Always_was_depressed"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The real question is do southern Crimeans gesticulate like this 🤌",
            "score": 16,
            "author": "IIIlllIIIlllIlI",
            "replies": [
                {
                    "level": 1,
                    "comment": "Two things are certainly in life: death and a Reddit user posting the hand gesture when he/she sees everything aven remotely connected to Italy.",
                    "score": 30,
                    "author": "Massimo25ore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can't see the symbol, but I guess he posted the \"che cosa\" hand gesture that Americans use to say \"pizza\" or \"Mario Bros\" or whatever.",
                            "score": 6,
                            "author": "clonn"
                        },
                        {
                            "level": 2,
                            "comment": "Glad I could continue the tradition",
                            "score": 3,
                            "author": "IIIlllIIIlllIlI",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's called Pavlovian reaction in psychology",
                                    "score": 3,
                                    "author": "Massimo25ore"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't know about that, but since the Genoese were there, I wouldn't be surprised if they were extremely stingy.^/s",
                    "score": 6,
                    "author": "zgido_syldg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do we have to expect Italians claiming back a piece of Crimea from Russia anytime soon ? 😜",
            "score": 2,
            "author": "deanza10"
        },
        {
            "level": 0,
            "comment": "Qirim bizimdir",
            "score": 2,
            "author": "oeoeoeoeoeoee",
            "replies": [
                {
                    "level": 1,
                    "comment": "getanxmebi dzmao",
                    "score": 1,
                    "author": "Giorgilari"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Turks are about to do a pro gamer move",
            "score": 2,
            "author": "blockybookbook"
        },
        {
            "level": 0,
            "comment": "It's part of Ukraine.",
            "score": -2,
            "author": "civico_x3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Back then, was part of Crimea",
                    "score": 4,
                    "author": "_kewdon_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where is Cherson?",
            "score": 1,
            "author": "RichRaichuReturns",
            "replies": [
                {
                    "level": 1,
                    "comment": "The city first belonged to Theodoro then was conquered by the Genoese, in 1299 it was sacked by the Mongols of the Golden Horde. The Byzantines mention it for the last time in 1396, it is assumed to have been abandoned after that.",
                    "score": 6,
                    "author": "zgido_syldg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's so sad. The same fate befell all the great Byzantine cities. Constantinople, Antioch, Barion, Ravenna, Nicaea, Nicomedia, Thessalonica, Athens, Corinth, all the anatolian cities, trebizond and so on and so forth. Really sad.",
                            "score": 1,
                            "author": "RichRaichuReturns"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It took a lot of the wonder/magic out of Marco Polo's journey when I learned he basically just travelled along the Genoese ship routes to their colonies in the black sea and the sea of Azov, and then Polo just simply followed the giant contiguous trade route along the well established horse routes of the Mongol Empire to reach the court of Kublai Khan. \n\nHe was an influential figure for the experiences he had and the information he brought back to Europe about the Far East, but he wasn't an \"explorer\" really.",
            "score": 1,
            "author": "NorthVilla"
        },
        {
            "level": 0,
            "comment": "So the worst thing that happened to Crimea this year wasn't war, but being demoted to Serie B",
            "score": 0,
            "author": "krasnyj"
        }
    ]
}