{
    "id": "140lflg",
    "score": 159,
    "title": "Global Offshore Wind Speeds",
    "author": "giuliomagnifico",
    "date": 1685902738.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/140lflg",
    "media_urls": [
        "https://i.imgur.com/SzRAmVO.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Dang, no wonder there’s a lotta windmills in Western Europe and history of sailing",
            "score": 7,
            "author": "AlwaysBeQuestioning",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now, offshore wind farms. The UK in particular is throwing them up in the North Sea at quite a rate.",
                    "score": 6,
                    "author": "cragglerock93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live near Brighton in the UK, and I love seeing them being built. They're really beautiful imho. Although hydroelectric dams are pretty good too",
                            "score": 2,
                            "author": "Extension-Ad-2760",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't know there even were any off the South Coast! There's loads in the Moray Firth (closest coast to me) but they're waaaay offshore. You can't even see them from sea level.",
                                    "score": 1,
                                    "author": "cragglerock93",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Huh. Yeah there's a massive windfarm right off Brighton. Called Rampion windfarm. You can even go on tours of them lol",
                                            "score": 2,
                                            "author": "Extension-Ad-2760",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just looked it up. It's huge, too! I don't know how I didn't know that existed, as I like to think I know a little about these things.\n\nI'd actually do that tour. I've been under a few on land but the ones at sea look even more frightening to be under when they're moving - think I'd enjoy it, though.",
                                                    "score": 2,
                                                    "author": "cragglerock93"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting to see how the offshore winds slows down around the equator.",
            "score": 27,
            "author": "Gurkeprinsen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tropical doldrums",
                    "score": 11,
                    "author": "eh17368"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well...the colors are beautiful",
            "score": 6,
            "author": "EffectiveYamSalad"
        },
        {
            "level": 0,
            "comment": "What’s with the two windspeed bumps off the west coast of southern Mexico and Nicaragua?",
            "score": 5,
            "author": "Minimum-Injury3909"
        },
        {
            "level": 0,
            "comment": "This actually kinda sucks. Where its cold you have high winds blowing frozen air at you, and where it is very hot and you want the wind to cool you down the wind seems to be very slow.\n\nI see many exceptions but as a general rule.",
            "score": 2,
            "author": "navywater"
        },
        {
            "level": 0,
            "comment": "Winds on the Equator: *breeze*\n\nWinds anywhere else: *WOOOOOOSH*",
            "score": 2,
            "author": "Vector_Strike"
        },
        {
            "level": 0,
            "comment": "Missing Antarctica, some of the windiest places in the world. Commonwealth Bay held some sort of record for consistently high wind speeds.",
            "score": 2,
            "author": "imapassenger1"
        },
        {
            "level": 0,
            "comment": "I was expecting to see the southern ocean as being much windier than the arctic area as a whole, but no.",
            "score": 2,
            "author": "Leftleaningdadbod"
        },
        {
            "level": 0,
            "comment": "The people who this actually affects use knots rather than M/S. Wind is more fun as a live representation. Check out [windy.com](https://windy.com)",
            "score": -2,
            "author": "Lurk5FailOnSax",
            "replies": [
                {
                    "level": 1,
                    "comment": "tbf this is clearly for the purpose of looking at areas suitable for offshore wind power and engineers making wind turbines will likely use meters per second rather than knots.",
                    "score": 20,
                    "author": "Youutternincompoop"
                },
                {
                    "level": 1,
                    "comment": "Cool!",
                    "score": 1,
                    "author": "Trovadordelrei"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have never experienced a more fatal wind than Patagonia. Brutal, even during a normal sunny day.",
            "score": 1,
            "author": "MavenVoyager"
        }
    ]
}