{
    "id": "141le4s",
    "score": 235,
    "title": "Nationality/Ethnicity Map of Tatarstan",
    "author": "dogesobaka",
    "date": 1685985297.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/141le4s",
    "media_urls": [
        "https://i.redd.it/emf69adwf84b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "For reference, Chuvashes are descendants of Bulgars who did not assimilate into the Horde after the Mongol conquest, while Tatars are descendants of those who did. Chuvashes have a republic of their own to the west of Tatarstan.",
            "score": 6,
            "author": "nmxt"
        },
        {
            "level": 0,
            "comment": "After the fall of kazan in 1552 and for centuries Tatars were forbidden/discouraged from settling in central quarters of kazan and on river shores, hence the map. Some green areas on the banks might be those dominated by Kireshin (Christian) Tatars.",
            "score": 32,
            "author": "jalanajak",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends what language you look at. In tatar its Керәшен which transliterates to Kerashen, but in russian it comes from Крящёный - Kryascheniy and then turns into Kryashen. Probably russian pronounciation is a bit more correct, since original word derives from the russian language.",
                            "score": 3,
                            "author": "dogesobaka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Да, опечатка, само собой креститься&gt;крещёный&gt;кряшен. \n\nЯ знаю татарский потому, что родители татары. Не знаю, откуда вы взяли эту цифру, но татарский достаточно много людей в Татарстане знает. Многие на нем только с семьей/друзьями говорят, а все остальное на русском. Плюс зависит от геолокации тоже. Я сам на востоке вырос, там татарский повседневно тоже юзается, в отличие от той же Казани.",
                                            "score": 2,
                                            "author": "dogesobaka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Да язык забывается очень быстро, особенно когда в городе живешь. У меня у самого разговорный татарский только за счет того что с родителями на нем общаюсь, но без практики никакой сразу забывается.\nВ Татарстане здорово, особенно в Казани. Я бы в Киргизии тоже побывал, постоянно в geoguessr попадается, красивые горные ландшафты. Уверен, кстати, что языки довольно похожие, там же кыпчакская группа.",
                                                            "score": 1,
                                                            "author": "dogesobaka"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, that's another transliteration.",
                            "score": 0,
                            "author": "jalanajak"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Interesting bit of info",
                    "score": 1,
                    "author": "M-Rayusa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kind of a shitty map. Russians outnumber tatars in Kazan, the capital, by decimal points, but because the map doesn’t utilize shading, it sends the message that this is a Russian ethnicity dominated city.",
            "score": 41,
            "author": "chickunsendwich",
            "replies": [
                {
                    "level": 1,
                    "comment": "True, this map is simplistic. There are lots of regions where tatars and russians are close to 50/50. That is why it says plurality in map name.",
                    "score": 44,
                    "author": "dogesobaka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plurality maps are bad maps.",
                            "score": -2,
                            "author": "chickunsendwich"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "no, not shitty. i like it a lot as is. could always be better.",
                    "score": 2,
                    "author": "M-Rayusa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's tatars precious?",
            "score": 7,
            "author": "the_smashmaster"
        }
    ]
}