{
    "id": "145ipty",
    "score": 4486,
    "title": "Percent of people in select countries who are proud of their country’s empire, think their empire made their colonies better off, and would like their country to have an empire.",
    "author": "Flagmaker123",
    "date": 1686349325.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/145ipty",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Why weren’t the Portuguese surveyed?",
            "score": 106,
            "author": "HumanTheTree",
            "replies": [
                {
                    "level": 1,
                    "comment": "YouGov.\n\nBasically the answer is \"What is Portugal and why is it inhabited with Geese?\"",
                    "score": 52,
                    "author": "Joltie",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Because it would be 100%😐",
                    "score": 14,
                    "author": "dick-slapperman",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Or the russians",
                    "score": 5,
                    "author": "SweetSoursop",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They did not survey eastern European countries.",
                    "score": 26,
                    "author": "Brilliant-Wave-2345",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get this reference!",
                            "score": 5,
                            "author": "WolfgangSho"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The same with Sweden, \n\nI know our empire is 200 years dead, and the only \"colonies\" we had were Finland and the Baltic countries, but we still have a fair few right-wing idiots that wants *Charlie Dozen* part 2 🤦‍♂️\n\nEdit: we also had that Caribbean island and a spot in Delaware.",
                    "score": 35,
                    "author": "RaDeus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; and the only \"colonies\" we had were Finland and the Baltic countrie\n\nTechnically Finland wasn't a colony, as Finns had equal representation at the Riksdag and medieval royal elections since early 14th century. The non-represented areas were Ingria, Estonia, Livonia and the possessions in Germany, as well as Skåne until 1721.",
                            "score": 18,
                            "author": "J0h1F",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The Portuguese empire was a bit bigger and historically important then that though 😅",
                            "score": 5,
                            "author": "Just-Stef",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True... but our conquests weren't *free real-estate* 😉😅",
                                    "score": 3,
                                    "author": "RaDeus"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd be very interested in hearing from any of the 18% of Belgians who answered yes to the second question.",
            "score": 2128,
            "author": "krt941",
            "replies": [
                {
                    "level": 1,
                    "comment": "I imagine they'd be pretty much what you'd expect.",
                    "score": 876,
                    "author": "DHooligan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think all of these people from each country are pretty much exactly what you’d expect",
                            "score": 599,
                            "author": "IIIlllIIIlllIlI",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I suppose some are sort of comparing it to other countries. Like a British person might think o Canada and New Zealand are way better than Congo. So yeah all good. But the Belgians are pretty bottom of the barrel and dont really have any good options.\n\nI know British and former British subjects who are happy with British colonisation. But they often are thinking about Australia, New Zealand, etc. Forgetting about colonies that didnt turn out so well.",
                                    "score": 337,
                                    "author": "Laktakfrak",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Canada and Australia wiped out a large amount of the indigenous population…there are extinct peoples in Australia due to the British colonisation. Regardless how the country fares now doesn’t really excuse the colonisation.",
                                            "score": 372,
                                            "author": "IIIlllIIIlllIlI",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The British wiped out all the native population of Tasmania, Australia,  a genocide",
                                                    "score": 95,
                                                    "author": "Overall_Performer_49",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Don't forget some of the islands in Tasmania that used to harbour tens of thousands of natives are now unpopulated because the colonies got moved elsewhere. Genocided people to not even use the land",
                                                            "score": 55,
                                                            "author": "TealDodo"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They didn't, that's a myth. The British certainly tried to (the infamous \"Black Line\" being part of it) but there are thousands of palawa people still around today.\n\nPeople often get confused because it is true that there isn't anyone of 100% palawa descent anymore, but that doesn't mean they are extinct. It would be ridiculous to claim, for instance, that an enrolled member of the Cherokee tribe of partial European descent but raised in Cherokee culture and of proven Cherokee heritage was not Cherokee.\n\nA lot of palawa culture and language was lost forever due to genocide and colonisation, but there were small groups that continued practising parts of their culture and held onto their identity. Often this was in secret until very recently because of intense racism against them, and ironically because it was widely accepted that Tasmania's First Nations peoples were \"extinct\", ergo anyone claiming to be palawa was ridiculed and not believed.\n\nOf all Australia's states and territories, Tasmania actually has the second highest proportion of the population identifying as Aboriginal and/or Torres Strait Islander (5.4%, compared to 3.2% for the whole country). Not everyone who identifies as Aboriginal in Tasmania is palawa, but the First Nations of Tasmania definitely aren't \"extinct\".\n\nEdit: To be clear, I'm *not* suggesting the palawa were not subjected to genocide or that the British \"weren't that bad\" because they didn't manage to totally annihilate the palawa (not from lack of trying). I'm trying to address the common misconception that the palawa are \"extinct\", because it is a cruel irony that acceptance of the fact they were genocided has led to constant questioning and undermining of continued modern palawa identity.",
                                                            "score": 106,
                                                            "author": "LPMcGibbon",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They were considered fauna until the 60/70s, the fact they weren't wiped out wasn't through lack of trying. That's like saying the genocide of the Jews didn't happen because there's still Jews! The empire was worse for indigenous Australians than Indians and Pakistanis but it's ok now so off you pop, nothing to see here. Well nearly nothing, yay for the Palawan",
                                                                    "score": 35,
                                                                    "author": "roxstarjc",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm not saying it wasn't genocide. What I'm trying to get at is that a consequence of the genocide is that there is a widespread narrative that the palawa are extinct, and that's an incredibly cruel irony.\n\nImagine if you were a descendant of German Jewish survivors of the Holocaust, and having your identity regularly undermined and denied by people saying things like \"you can't really be Jewish, German Jews were genocided and are extinct, everyone knows that\". In a way it's being doubly victimised by the genocide.",
                                                                            "score": 24,
                                                                            "author": "LPMcGibbon"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It doesn’t excuse what happened to the people in the modern country. As sad as it is to say, the nations that existed pre-colonialism are not related to the modern nation states on their territories. \n\nCanada today is really well off due to our physical and cultural proximity to the US and our involvement in the British Empire and Commonwealth, as well as resource wealth and a variety of other factors. Those two first factors, however, helped *most* people in this country. \n\nCanada’s modern treatment of indigenous peoples are no one’s fault but our own— even those leading as far back as 1850. The story of the Beothuk and Shanawdithit is terrible… *but* I can’t forgive modern British people if they think they’re Empire helped at least some people.",
                                                    "score": 66,
                                                    "author": "newcanadian12",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This a really strange take. If Canada did it, Britain did it too. That’s what being part of the empire means. And the genocide didn’t start in 1850.",
                                                            "score": 24,
                                                            "author": "SuperSocrates",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Didnt say I excused it.\n\nJust saying that British people would look at the wealth of their colonies compared to say Belgiums and say yeah we left the countries in a better position.\n\nOf course it wasnt like they landed gave everyone gold set up institutions for free and then left. \n\nThey did end slavery as well. Just pointing out why they would see themselves as good colonisers when comparing to others.",
                                                    "score": 22,
                                                    "author": "Laktakfrak",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Belgians ended slavery in Congo too, and contrary to the British, they didn't use it in the first place. So I guess that if they had gone the extra mile and genocided the whole population instead of a few millions, then replaced them by Europeans, we could also call it a success?\n\nedit: forgot the /s of course.",
                                                            "score": 17,
                                                            "author": "Pampamiro",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It turned out well for the settlers, not so much for the native populations.",
                                            "score": 42,
                                            "author": "Raghav_s12",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Canada turned out \"well\" after destroying the native's culture.",
                                            "score": 26,
                                            "author": "Kikkervelf",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; I know British and former British subjects who are happy with British colonisation. But they often are thinking about Australia, New Zealand, etc.\n\nThose countries might seem more positive but it's mostly because their original population's were more effectively genocided and culturally suppressed. There aren't that many Australian aboriginals who think positively of the British empire it's just that they were comprehensively displaced and genocided.",
                                            "score": 12,
                                            "author": "jteprev"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;Like a British person might think o Canada and New Zealand are way better than Congo\n\nNot so much for the natives of those countries.\n\n\nI've also heard Brits say that India benefited greatly from being colonized.",
                                            "score": 15,
                                            "author": "DerthOFdata",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Turns out the Brits were better at enacting genocide of aboriginal peoples than the others.",
                                                    "score": 6,
                                                    "author": "Spoonshape"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 23,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Indian here. Fuck the British Empire.",
                                            "score": 32,
                                            "author": "Abhi-shakes",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;Canada and New Zealand are way better than Congo. \n\nNot for all the dead natives",
                                            "score": 19,
                                            "author": "cowlinator",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The approximately 1% of British who apparently aren't proud of their empire, but believe the former subjects are better off are interesting though.",
                                    "score": 14,
                                    "author": "cnzmur",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Leopold II's reign over the Congo was about 20 years. People were appalled by what happened and ownership was transferred to the Belgian state which started developing the country and its population, profiting greatly from Congo's resources while trying to prove to the world it was bettering the Congolese.   \n\nThen in the 60s Congo became independent and Belgium was afraid of the communist leaning prime minister and losing influence so they offed him and put dictator Mobutu in place. Belgium continued to destabilize the country so it could make profitable deals with Mobutu for Congo's resources, and also to prove to the world and its people how much better things were under their control. This mostly so reparations would not be a discussion, as then you can make the case the Congolese were benefitting greatly from colonization as it brought stability and development.  \n\nBelgians in the sixties were basically brainwashed with the image of Leopold II who drove away the Muslim slave traders and started developing Congo, bringing riches to the Congolese as well as the Belgians. And how the Belgian state continued that trend. Most of the Leopold II statues in Belgium are from that time. It's the same as the confederate monuments in the US, they exist only to support a history that didn't happen. Anyway, those 18% are the uneducated brainwashed folk raised in the sixties.",
                            "score": 29,
                            "author": "Remarkable_Remove717",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And the japanese",
                    "score": 41,
                    "author": "DerpDaDuck3751",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "As a Belgian I am ashamed of what my country has done in Congo. Leopold II I hope there is an after-life and you are suffering there since the moment you died. Whoever voted \"yes\" either have no clue of what happened or are just vile and think it's ok because people in Congo were or are lesser than them. Another shameful fact is I didn't truly learn in school what atrocities our country performed there. I'm sure it was mentioned but it should be a week, a year subject.",
                    "score": 89,
                    "author": "SmellyLeopard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am also ashamed of what our king**s** and people did. \n\nI did learn about Congo in highschool. It was an important part of our 5th grade history curriculum.",
                            "score": 24,
                            "author": "Kikkervelf",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The worst of the depredations in the Belgian Congo happened when it was essentially privately owned by the king. Things improved quite a bit once Belgium officially took control. Perhaps that's what the yes votes are thinking of?",
                    "score": 140,
                    "author": "MaterialCarrot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It definitely improved a lot. Went from appalling to bad.",
                            "score": 218,
                            "author": "FlaviusStilicho"
                        },
                        {
                            "level": 2,
                            "comment": "You're giving WAY too much credit to the people who probably answered yes to that question lmao",
                            "score": 37,
                            "author": "esperadok"
                        },
                        {
                            "level": 2,
                            "comment": "It went from outright genocide to just awfully run colony. The Belguim Congo was one of the poorest colonies in the world with low education levels and little infastructure. Not mention constant Belguim attempts to interfere with independence.",
                            "score": 152,
                            "author": "BornChef3439",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;King Baudouin, representing Belgium, gave the first speech in which he praised the \"genius\" of his ancestor, King Leopold II, who began the colonisation of the Congo on his own initiative in the 1880s. Baudouin depicted the end of colonial rule in the Congo as the culmination of the Belgian \"civilising mission\" and spoke of the close relations he hoped would be maintained between the two countries.\n\n\"You know the dude who chopped hands of your ancestors to increase profits and spread fear and possibly killed 50% of your population. Absolute genius. Also be thankful we civilized you and gave you independence now. Also just a heads up, if you don't allow us to continue economically exploit you just now in a somewhat more diplomatically acceptable way, we'll partition your country, no jokes\" - King Baudouin probably",
                            "score": 48,
                            "author": "Sclavinae",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Baudouin was deeply religious, so it wouldn't surprise me if he simply thought \"converted to christianism = civilized\".",
                                    "score": 13,
                                    "author": "Pampamiro"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your typical person on the streets isn't going to compartmentalize the difference between crown colonies, charters, and trade companies. They're all colonies.",
                            "score": 60,
                            "author": "krt941",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, in Belgium this is a well known fact that it was the private property of King Leopold II before the government took over. And it's not like we had so many colonies (just Congo, plus Burundi and Rwanda as a protectorate after WWI). So unlike the British or the French, it's not that hard to remember a few key facts about them.",
                                    "score": 21,
                                    "author": "Pampamiro"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve had some interesting discussions with Europeans about colonialism. They’re typically very vocal when it comes to racism/slavery in the US and its impacts on wealth inequalities, how we need to pay reparations, etc. But when you bring up how Europe colonized Africa and kind of destroyed it, took artifacts to display at European museums, etc…many of them will tell you that those ex-colonies are unstable and in poverty because of their own corruption and bad decisions. Which is interesting.",
                    "score": 60,
                    "author": "Best_Caterpillar_673",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The pan-atlantic slave trade was literally a european invention.",
                            "score": 37,
                            "author": "crash12345",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Only because it was the first time in history technology allowed it. Europeans came to Africa and **bought** slaves to transport over. They were taken from existing slave trade stations in these African nations. Slavery has been a part of humanity since forever in all parts of the world. The only reason slavery is now banned worldwide is because Britain waged a war against it for centuries. For no profit motive and costing Britain mind boggling sums of money to the point that the last money paid to settle the debts was paid by tax money in 2015. Britain spent 40% of it's national budget in 1833 to buy freedom for all slaves in the empire. It's one of the proudest moments of British history and people are trying to blame them for slavery instead, it's honestly disgusting.",
                                    "score": 12,
                                    "author": "You_Will_Die"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Most European countries didn't have global empires.",
                            "score": 30,
                            "author": "adamkex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There’s few European countries today that also existed during colonial times (I’m including the French as existing then because it’s basically the same country). \n\nOf the ones that did, most had global empires (Dutch, French, Spanish, Portuguese, British, Germany (even if they were late to the game and lost it quickly)).",
                                    "score": 19,
                                    "author": "fleebleganger",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably the percentage of the population related to Leopold",
                    "score": 3,
                    "author": "Mein_Bergkamp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Belgians.  Wow.",
            "score": 423,
            "author": "FloridaGreek",
            "replies": [
                {
                    "level": 1,
                    "comment": "School only recently started teaching about wtf really went down there. My parent were still taught that it was a civilizing mission and that we freed the slave of the Congo from the Arab trade slaver (well its kinda true but that doesn't negate what came next) and shit ton of other propaganda that were kinda hitting that Congo would probably be better of if we took over again.\n\nAnd even a few years ago in school, it was still kinda a weird chapter in history class where the chapter talked about the atrocities but like, minimizing them. Obviously now that everyone has internet, the lie is crumbling but yeah it's still very recent for us.\n\nIn class we even learned about an independence song of the Congo, it's kind of catchy so with my friend we sang it randomly and he told me he sang it when he was at his grandmother place and she got angry because \"it's the song that made us loose the Congo\"\n\nThe great thing about ruler that do a lot of atrocities is that they love doing a ton of propaganda about how great they are and Leopold II propaganda's was never really dismantled up until recently. So there is almost a century worth of people who have been taught how great Leopold II was for getting us the Congo",
                    "score": 137,
                    "author": "nebo8"
                },
                {
                    "level": 1,
                    "comment": "I'm ashamed of and disappointed in those who made it anything more than 0%\n\nUnfortunately, until a few years ago, we did not learn about the atrocities committed there in school. In fact, it was the opposite due to catholic education: a lot of people learned about it being a great thing... (for reference, this is the same education system that taught the crusades as \"holy catholic missions\")\n\nHopefully, in the future, the number will approach zero, when the generations who were taught about it in actual critical fashion become the majority",
                    "score": 84,
                    "author": "_Dragon_Gamer_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I was surprised to see monuments and infrastructure named after Leopoldo II when I was in Brussels. Would’ve thought they would be less proud of it.",
                    "score": 3,
                    "author": "Gerf93"
                },
                {
                    "level": 1,
                    "comment": "I think the answer is simple: hardcore catholics who think \"brought christianity\" = good and don't care to hear about the rest.",
                    "score": 6,
                    "author": "jeekiii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "These aren't just any old statistics, they're empirical",
            "score": 315,
            "author": "ActuallyYeah",
            "replies": [
                {
                    "level": 1,
                    "comment": "![gif](giphy|7aBE32jCr6lOhtuE9v)",
                    "score": 3,
                    "author": "Wurschtkanone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Dutch are mad confused on this. Half of them are proud of the empire, but that number number goes way down when they're asked if the people there would be better off. How do the people who account for that disparity square that circle?",
            "score": 440,
            "author": "StupidUglyNarcissist",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's possible they're interpreting this as being proud of the Dutch Golden Age which corresponded to having an empire. Proud of the position they were in geopolitically despite being a very small country?",
                    "score": 236,
                    "author": "TribuneofthePlebs94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a dutch person i can say its probably the latter, were aware enough to know the colonies were exploited, but you know when youre a little ass Republic flanked by superpowers it does feel like an achievement you got to 'conquer' parts of the world many times your own size.",
                            "score": 88,
                            "author": "Sickeboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We're weak in Europe. Guess we have to go fuck up people around the world. Oops!",
                                    "score": 3,
                                    "author": "tittysprinkles112",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Like the heated floors and the slaves in the basement tending to the fires of the Roman Empire (\"Why did those Germanic barbarians 'forget' about heated floors?\"). \n\nAnswering the question means squaring off considering the country as the pinnacle of human development during the Golden Age (in literacy, and political, social, and economic development), and the imperial foundations on which that success rested. Overall the judgment is clearly \"Would do it again!\" for many.",
                            "score": 16,
                            "author": "AnaphoricReference"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"It didn't help make the people better off, but the tall sailing ships were dope so I'm proud of us.\"",
                    "score": 353,
                    "author": "dovetc"
                },
                {
                    "level": 1,
                    "comment": "Maybe they’re proud of how their little empire managed to stay afloat in European affairs and even defeat the British navy before ultimately usurping their crown. That may be a source of pride, but the exploitation of Indonesia which gave them the wealth and power to hold their own in Europe likely leaves a bad taste in the mouth",
                    "score": 346,
                    "author": "Emperor-of-the-moon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shout out to the Glorious Revolution. Orange in the House Yo!",
                            "score": 5,
                            "author": "zerodivzero"
                        },
                        {
                            "level": 2,
                            "comment": "While Indonesia was a source of income, it was actually not that much of the Dutch economy, the Dutch wouldnt have been off much worse without Indonesia.",
                            "score": 12,
                            "author": "Gewoon__ik",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Very unpopular truths nowadays. But, the Netherlands made ten times as much of trade with the Baltic states as it did with the Indonesian spice trade.",
                                    "score": 7,
                                    "author": "Just-Stef",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most people here are more proud of how influential we were for such a small country. The pride is mostly for our impressive navy (rivalling the Brits for a while), globe discovery, and  trading. A big point of pride is that the country had a lot of religious freedom for the time. At the time a lot of protestants and jews fled to the country for that reason.\n\nGoing from the 1st to the 2nd picture shows pretty much how many people remember that a part of that history is slave trading in the west and colonial suppression in the east. \n\nThe 3rd image is just the dumbasses who already said yes in the 2nd image. Tbh I've never heard that one outside of some populist politic rhetoric. \n\nTl:dr we like to remember the navy, our might and progressiveness for the time, but apparently 27% forgets the bad stuff.",
                    "score": 50,
                    "author": "joost013",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I believe this could also be due to different wording in the second question. OP shared the source below and it seems more to imply whether the countries are now better off for having been in the empire in the past. breaking up with an empire can be its own disaster.",
                    "score": 8,
                    "author": "Palaloa",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I mean. Considering their country is basically the result of the Corporate empire they had. I guess thats a reason to be proud. The Dutch East Indies were probably the worlds most valuable company. Ever.",
                    "score": 26,
                    "author": "TriLink710"
                },
                {
                    "level": 1,
                    "comment": "Probably proud they were powerful enought to do it just not proud of what they did.\n\nI feel this is probably a fair whack of British issues there too, especially boomers brought up on 'plucky little britain vs the world blitz spirit' post war propaganda.",
                    "score": 41,
                    "author": "Mein_Bergkamp",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone wisely commented that it wasn’t the generation who lived through the war that brought us Brexit. It was the generation after, who were brought up on “plucky Britain” war films.",
                            "score": 8,
                            "author": "ursulahx",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's more so that we're proud that we got to be the main player in the 1600s while being so small. We know fucked up stuff was done, especially in the Americas, but we also know that a lot of it (not necessarily the slavery, but the exploiting of resources at the cost of others) was simply how things were throughout most of history. We all know our empire didn't benefit the people who were conquered. We kind of view it like the Roman Empire. We all know the Romans did terrible stuff but we still find them fascinating, mainly due to their ability to conquer the entire Mediterranean.",
                    "score": 6,
                    "author": "fruittuitella",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm reminded of this conversation in Pocahontas\n\n&gt;JOHN SMITH: We’re going to build them here. We’ll show your people how to use this land properly. How to make the most of it.\n\n&gt;POCAHONTAS: Make the most of it?\n\n&gt;JOHN SMITH: Yes, we’ll build roads and decent houses and—\n\n&gt;POCAHONTAS: Our houses are fine.\n\n&gt;JOHN SMITH: You think that, only because you don’t know any better.\n\n\nOf course this launches into Colors of the Wind, and how John Smith is wrong - but I can see how this could be enough for some people.",
                    "score": 6,
                    "author": "trixter21992251"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Brazilians, Angolans, Mozambicans, Caboverdeans, and Timorese would like a word. Probably in Portuguese.",
            "score": 301,
            "author": "Tagostino62",
            "replies": [
                {
                    "level": 1,
                    "comment": "Brazilians usually don't have bad feelings towards Portugal. Some leftists do, but even among left wing it's more a complaining than real hate. I would say overall Brazilian see Portugal like the USA see Britain or Argentina sees Spain",
                    "score": 15,
                    "author": "real_fat_tony",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah if anything there's more \"hate\" in the opposite direction because Portugal is a tiny culture compared to the vast Brazilian society, and sometimes people feel that their culture is very overpowered by the dominant Brazilian words, media, accents, etc etc.\n\nThat being said, it's not super serious IMO, and there's also a lot of love between the countries.",
                            "score": 6,
                            "author": "NorthVilla",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not super serious if you’re not a Brazilian immigrant in Portugal. Then it’s pretty serious.",
                                    "score": 4,
                                    "author": "look_its_nando",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do Brazilians generally feel like the victims of empire or the offspring of it? I'd always sort of figured Brazil felt towards Portugal similar to how Americans feel towards the Brits.",
                    "score": 95,
                    "author": "dovetc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just like in the US, where indigenous Americans see themselves as victims of empire but white Anglo-Saxons see themselves as the offspring -- in Brazil the opinions would vary widely depending on if you're talking to indigenous, Afro-Brazilian, or white Portuguese/German Brazilians.",
                            "score": 144,
                            "author": "elieax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Brazil gets even weirder because Rio was the capital of the empire for the 13 years that preceded their independence, and the independence was not only triggered because they (rightfully) refused to go back to being a colony and it was led by the Portuguese crown prince , who remained the Portuguese crown prince and would even briefly be both the Emperor of Brazil and King of Portugal (the [guy](https://en.m.wikipedia.org/wiki/Pedro_I_of_Brazil) was basically the epitome of living at the center of interesting times).",
                                    "score": 63,
                                    "author": "jmcs"
                                },
                                {
                                    "level": 3,
                                    "comment": "Contrary to the US, the divisions in Brazil are not so sharp. If you ask a white Brazilian they will likely tell that they suffer from the consequences of colonialism as well, although acknowledging that pardos, blacks and Indigenous Brazilians suffer more with that.\n\nWhy that? Because in Brazil the structures created in colonial times permeate the whole society (you gringos love to talk about corruption in Latin America, right? So, here is an appropriate time to talk about it).\n\nOf course different groups are affected at different levels, but in Brazil the bad consequences of colonialism are so pervasive that they affect almost everyone. For instance: when slavery was about to be banned, the state of São Paulo started to receive loads of Italian immigrants to work for people who had just recently owned slaves in the coffee farms. Their work conditions were atrocious (of course, their bosses were such nice people /s), although corporal punishment was forbidden in their case.",
                                    "score": 18,
                                    "author": "capybara_from_hell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; you gringos love to talk about corruption in Latin America, right?\n\nNo, we usually have trouble getting the average voter to think about Latin America at all.",
                                            "score": 3,
                                            "author": "TheChance"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's a very good and complicated question. Most Brazilians are indeed descended from the colonizers, so it's really hard to think about those feelings.",
                            "score": 22,
                            "author": "RenanGreca",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most Brazilians who identify as white descend from post-independence immigrants. The Brazilians who descend from the colonisers usually *also* descend from slaves and natives, because most colonial Portuguese in Brazil were men, so this is not so simple. The Portuguese where a numerical minority before independence.",
                                    "score": 13,
                                    "author": "capybara_from_hell",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Portugal stole our gold only to send it all to britain, you will see some weirdos that miss our empire but every one would be resentfull of Portugal treating us like a colony.",
                            "score": 31,
                            "author": "XimbalaHu3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "during the entire 18th century 800 tons of gold were sent to Portugal from Brazil, in 2020 Brazillian gold mines produced 60 tons\n\n&gt; The weighted mean proportions of European, African, and Native American ancestries were 68.1%, 19.6%, and 11.6%, respectively.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6905439/\n\nBrazilians are literally (mostly) Europeans",
                                    "score": 16,
                                    "author": "BringerOfNuance",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You would need to ask the Brazilian first nations.",
                            "score": 8,
                            "author": "gs2017",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well the ones that weren't wiped out.",
                                    "score": 2,
                                    "author": "Prasiatko"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People from Goa as well",
                    "score": 5,
                    "author": "fromtheb2a"
                },
                {
                    "level": 1,
                    "comment": "what you mean? There's no data from portugal in this map",
                    "score": 5,
                    "author": "Howragnes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So... source ?",
            "score": 78,
            "author": "CoffeeBoom",
            "replies": [
                {
                    "level": 1,
                    "comment": "[here is the source](https://docs.cdn.yougov.com/g9th5mtevv/YouGov%20-%20Empires%20attitudes.pdf)",
                    "score": 8,
                    "author": "Flagmaker123"
                },
                {
                    "level": 1,
                    "comment": "We don't do that on this sub. We like making up data and then arguing about made up data.",
                    "score": 68,
                    "author": "meguskus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He did provide the source",
                            "score": 10,
                            "author": "SuperSocrates"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This has to be trolling, the source is literally in the comments lmao.",
                    "score": 7,
                    "author": "Old-Deal-4401",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huh, Japan's percentages are lower than I thought they would be. Guess it's only the far right and trolls who speak the loudest",
            "score": 220,
            "author": "lidsil",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Japanese seem to have got round the whole explainign the empire thing by just not really explaining the empire",
                    "score": 78,
                    "author": "Mein_Bergkamp"
                },
                {
                    "level": 1,
                    "comment": "Most Japanese people are pretty ignorant of history and politics, thats probably why. Its same reason why their voter turnout rate is pretty low",
                    "score": 187,
                    "author": "Golmar_gaming227",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wouldn't the ignorant be more likely to see the empire in a good light though?",
                            "score": 30,
                            "author": "_THE_SHARK_GUY_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe they're a better kind of ignorant who instead of having an uninformed opinion has no opinion. Something that is underappreciated these days.",
                                    "score": 30,
                                    "author": "RogueThrax",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Found a guy who think japan’s colonies were better off lol. \n\nI’m honestly surprised 18% of people actually think they benefited their colonies. They caused lasting harm in each and every place they touched.",
                            "score": 29,
                            "author": "MadNhater",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd guess Taiwan is one of the most popular international destinations for Japanese tourists and Taiwan is very pro-Japan.  That could easily explain the 18%.",
                                    "score": 9,
                                    "author": "studyinggerman"
                                },
                                {
                                    "level": 3,
                                    "comment": "Native born Taiwanese generally like Japan much more than China",
                                    "score": 3,
                                    "author": "Unibrow69"
                                },
                                {
                                    "level": 3,
                                    "comment": "Depends on the regions really, occupied territories got fucked up pretty hard but some colonies had like... certainly not 'good time' but more like a very confusing time",
                                    "score": 4,
                                    "author": "collectivisticvirtue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can you name an example?",
                                            "score": 4,
                                            "author": "Aoifeblack",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In my 10 years living in Asia, most people I became friends with are completely unaware that white Americans originate from Europe. They believe they have always been there, and they refused to believe me, and some would get angry with me. Bizarre",
                            "score": 20,
                            "author": "Icedanielization",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wtf? Can you tell us more?",
                                    "score": 4,
                                    "author": "lawrencelewillows",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think it has something to do with a lack of general knowledge. If it doesn't help you get a job or money, there is no point in knowing it. I had friends who also knew a lot about the world and they generally seemed to be interested in everything, but there were those who were very work/money focused who adamantly insisted that Caucasian Americans did not origiate from Europe. Of course, when I provided obvious evidence, such as building structures, commonwealth countries, why there were no cities prior to 1400 (in north america), sudden advance of technology, etc, it just made them more angry, so I left it alone.",
                                            "score": 9,
                                            "author": "Icedanielization"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "2nd highest country for \"our colonies were better off as colonies\" though. Pretty sure the Chinese would disagree. But they don't seem to want another empire - thank God for that.",
                    "score": 8,
                    "author": "Maleficent_Sector619"
                },
                {
                    "level": 1,
                    "comment": "Japanese people themselves are quite educated and not in the least as politically indoctrinated as media coverage would make it seem. Sure, they're pretty racist overall, but that's another story. If you live in a country that speaks a language no one else understands even remotely, and your school system tells you how grand and pure-blooded your 'race' is day in and day out, you're just bound to more or less assume that something about what they're saying must be right, since no one's chiming in going 'But I've heard..!'. \n\nSame thing happens in the US, so not surprising. Even the most educated Americans I've met so far held onto certain beliefs and rights (hereditary nationality, gun laws, ...) which to Europeans can only be described as literal cave man IQ. I can only assume that's because of their education system over there.",
                    "score": 10,
                    "author": "Snuffleton",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 465,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Portugal’s also doing the puppet looking the other way meme on this one 👀",
                    "score": 92,
                    "author": "OrphanedInStoryville"
                },
                {
                    "level": 1,
                    "comment": "It didn't happen but also they deserved it!",
                    "score": 161,
                    "author": "ProfTydrim",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Non of the countries in the map actually recognizes their own genocides except Germany, which is forced to recognize",
                    "score": 109,
                    "author": "RemarkableCheek4596",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Germany and German education in particular definitely goes beyond being 'forced to recognize' it's genocide(s).\nThe topic is heavily discussed in schools from a relatively young age without sugarcoating it. Most people have had school trips to concentration camps to see what happened.\nOn a bigger scale there is a certain culture of guilt surrounding the Holocaust. It's a big contributor to why there's barely any national pride or flag waving going around in Germany (except for football season)",
                            "score": 59,
                            "author": "Pericular",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty based tbh.",
                                    "score": 3,
                                    "author": "Sir12mi"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Germany is not forced to recognize the genocides of the 2nd German Empire, like the Herrero genocide. Actually things having been moving towards that only recently.",
                            "score": 25,
                            "author": "mki_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why stop there? Should add America to the list as well, given the genocide of Native Americans.",
                    "score": 31,
                    "author": "yoshinosumoto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also colonialism in the Philippines and Hawaii.\n\n(also Mexico depending on how strictly you define colonialism)",
                            "score": 20,
                            "author": "jteprev"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lets add Serbia to that list, the breakdown of Yugoslavia caused the worst genocide in Europe post WW2.",
                    "score": 24,
                    "author": "BrownThunderMK",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Every Erdogan supporter in Germany I've met glorified and idealized the Ottoman Empire. I found that quite disrespecting, considering my homeland Albania was under their occupation for almost 500 years. \n\nOnly two didn't, one of them had a Atatürk picture in his wall and the second was only half Turkish.",
                    "score": 5,
                    "author": "IamNotMike25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Part of the problem here is people are talking past each other. Better off if they had been frozen in time without ever contacting the colonial power, or better off with some alternate version of contact and trade with the colonial power without a power imbalance?\n\n\nBoth scenarios in this hypothetical are basically impossible, so it’s hard to know what people really mean when they answer this question.",
            "score": 53,
            "author": "chrisppyyyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the logic a lot of British people use; if we hadn't colonised them someone worse would have. While it may be true in some cases, I think it's a pretty weak argument for morally defending our Empire, considering that was definitely not a significant motivation.",
                    "score": 13,
                    "author": "mankytoes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dutch East India company was no charity either. Sheesh.",
            "score": 38,
            "author": "everymanandog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nor the west india company. Possibly even worse...",
                    "score": 5,
                    "author": "Karsdegrote"
                },
                {
                    "level": 1,
                    "comment": "But they had dope ships though. VOC mentaliteit",
                    "score": 4,
                    "author": "Scarred_Ballsack",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Zeg makker",
                            "score": 3,
                            "author": "LuukTheSlayer",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did Portugal escape this?",
            "score": 27,
            "author": "Revanchist99",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Moral of the story — we need to give the Dutch more shit about South Africa. Also, WTF Belgium?????",
            "score": 327,
            "author": "auximines_minotaur",
            "replies": [
                {
                    "level": 1,
                    "comment": "And indonesia, and the caribbean",
                    "score": 26,
                    "author": "cornonthekopp"
                },
                {
                    "level": 1,
                    "comment": "Listen I am the biggest anti colonialist there is and as a South African I am.actually a descendant of slaves brought over from what is now Indonesia and East Africa to Cape Town who then forced into sexual relationships with my Dutch ancestors.\n\nDespite all of this the Dutch only colonised a very small part of modern South Africa and were forced to give it up to the British after the Napoleonic wars. Most of South Africa's colonial problems come from the British and Afrikaaner settlers who themselves didn't like Dutch rule in the first place for among other things punishing masters who abused their slaves.",
                    "score": 275,
                    "author": "BornChef3439",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True daat.",
                            "score": 66,
                            "author": "Whthpnd"
                        },
                        {
                            "level": 2,
                            "comment": "It's fine, there is still Indonesia.",
                            "score": 20,
                            "author": "CoffeeBoom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, anyone who tries to justify Dutch colonialism need only look at what they(along with former SS members) did to Indonesians after WW2.",
                                    "score": 15,
                                    "author": "BornChef3439"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I was gonna say didn't the Dutch get kicked out and then shit got really OTT w/r to state sanctioned racial violence? Like, not pretending the Dutch were good in any way but most of the South Africa related shit people think of happened well after the Dutch got the ol' colonial boot.",
                            "score": 41,
                            "author": "euphonic5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "tbf the worst of the colonisers in South Africa were the Boers, who were descendants of the Dutch colonists that continued to live in South Africa after the British came to control the colony, quite a lot of them didn't like British rule and migrated northwards creating several Boer republics(which the British eventually conquer) and they were a dominant political force in South Africa and extremely pro-Apartheid.",
                                    "score": 22,
                                    "author": "Youutternincompoop",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Interesting that you separate the Afrikaners from the Dutch here...",
                            "score": 10,
                            "author": "hanrahahanrahan",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "in brazil, we had a little problem with dutch people during the colonial era. And, according to one historian, they were crueler with enslaved people.",
                            "score": 7,
                            "author": "Howragnes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "more shit about Indonesia, Dutch tried to take it back after WW2, even though they surrendered to the Germans readily",
                    "score": 64,
                    "author": "trtryt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "seriously. I read up on dutch colonization in indonesia, and it was just full of horrific crimes, and operation product and operation kraai - the dutch attempts to take indonesia back after ww2 - were a vietnam war-style genocidal shitshow before the dutch got forced to bail.",
                            "score": 43,
                            "author": "Random_Cataphract",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty sure we lost more soldiers in the Indonesian war than from the German invasion. \n\nImagine as a soldier your own government is more of a danger than Nazi Germany.",
                                    "score": 15,
                                    "author": "Carzum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;\tImagine as a soldier your own government is more of a danger than Nazi Germany.\n\nAlways has been my dude. There is a reason why Indonesian resisted the dutch attacks. If dutch was this angels sent from heaven bringing poffertjes rain, then Indonesia wouldn't have to defend.",
                                            "score": 3,
                                            "author": "lalala253"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"Hey, that was pretty shitty what Germany just did to us. Let's do it to Indonesia!\"\n\n(Obviously a super nuanced take right there.)",
                            "score": 9,
                            "author": "HetRadicaleBoven"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "South Africa? The Dutch East India Company essentially invented [for profit genocide!](https://en.wikipedia.org/wiki/Dutch_conquest_of_the_Banda_Islands)",
                    "score": 7,
                    "author": "Rc72"
                },
                {
                    "level": 1,
                    "comment": "Don’t forget the Caribbean, according to r/askthecaribbean they were perhaps the most brutal there.",
                    "score": 25,
                    "author": "RosabellaFaye",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What are you talking about? Haitians couldn't wait to get that world-renowned boiling sugar skin treatment.",
                            "score": 7,
                            "author": "SlightlyBadderBunny"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "According to this data, ~23% of the Dutch are like “yeah we ruined everything we touched, but by God we had a beautiful empire.”",
                    "score": 19,
                    "author": "iPoopLegos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We ruined everything we touched, *but we got so filthy fucking rich from it we named it our ‘golden age’.*",
                            "score": 11,
                            "author": "YoYo_Yoghurt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "While I agree the Dutch were good at ruining the places they colonized like most colonizers, the colonies only made up a relatively small percentage of the Dutch economy. The colonial empire did not make the Dutch rich (in the sense of being the source of Dutch wealth, ofourse it did increase the wealth), without it we would have been fine too, just a bit less.",
                                    "score": 5,
                                    "author": "Gewoon__ik",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Source](https://docs.cdn.yougov.com/g9th5mtevv/YouGov%20-%20Empires%20attitudes.pdf)",
            "score": 43,
            "author": "Flagmaker123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck Portugal i guess.",
                    "score": 28,
                    "author": "Yevieh66",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where is Hungary and Austria?",
            "score": 27,
            "author": "th3sly_007",
            "replies": [
                {
                    "level": 1,
                    "comment": "They went out for Hapsburgers",
                    "score": 40,
                    "author": "Call_of_Queerthulhu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow! Now that’s a pun!",
                            "score": 3,
                            "author": "v_e_x"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think our empires were a waste of time, money and resources and have brought more problems for everyone involved than solutions in the long term.",
            "score": 6,
            "author": "wolflagang",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There was also [some demographic data for the British survey](https://docs.cdn.yougov.com/z7uxxko71z/YouGov%20-%20British%20empire%20attitudes.pdf).",
            "score": 24,
            "author": "Flagmaker123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Old conservative Brexiteers. No surprises there.",
                    "score": 25,
                    "author": "paixlemagne",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone find it psycho as hell that the Dutch are like \"Man, I'm so proud of our empire, I wish we had kept those colonies\" but are also like \"Yeah, those people were totally worse off with us colonizing them lol, too bad so sad, 10/10 would colonize again.\"",
            "score": 54,
            "author": "BP_Ray",
            "replies": [
                {
                    "level": 1,
                    "comment": "My guess is: the pride is tied to the power the Netherlands had in Europe despite being small, being a major naval and economic power and even defeating the British, the entire Dutch golden age with famous painters, merchants and scientists. That's all connected, and that's what they're proud of.\n\nBut when you ask them if the people that were colonised were better off (mainly Indonesia), they know they were worse off, and know that the wealth of the Dutch golden age actually partly came from exploiting other people.\n\nAbout the people who still want an empire, I'm as baffled as you are. I'm hopeful people didn't think about it enough and just like the romanticised idea of an empire and being powerful, and don't think about the human rights violations that would be involved.",
                    "score": 25,
                    "author": "kodalife",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not really? It makes sense to be proud of what such a small country accomplished. The time period was shit for everyone, it was be ruled or be ruler kind of times. The only reason Europeans were the ones to so on such a scale was the technology they had allowed it.",
                    "score": 7,
                    "author": "You_Will_Die"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Average Dutch while hearing these questions be like:\nhttps://youtu.be/Xl5yRIfNuWQ",
            "score": 19,
            "author": "Witcher587"
        },
        {
            "level": 0,
            "comment": "GEKOLONISEERD",
            "score": 90,
            "author": "x021",
            "replies": [
                {
                    "level": 1,
                    "comment": "Again proving that Dutch is not a real language.",
                    "score": 33,
                    "author": "valleyfur",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Literally",
                    "score": 6,
                    "author": "alles_en_niets",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True dat everything_and_nothing",
                            "score": 2,
                            "author": "A_Davinus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fucking cringe comment.",
                    "score": 6,
                    "author": "ChaoChai"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Its strange that this data seems to ignore both Portugal and Denmark, the two oldest European colonial powers since the 15th century. Heck, Portugal was actually the most stubborn European colonial power in Africa, absolutely refusing to give up its African possessions until 1975! They were initially reluctant to give Goa back to India in 1961.\n\nBritain and France technically still have overseas possessions all over the world, and Denmark still technically has Greenland.",
            "score": 4,
            "author": "Legendary_B58Hustler",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Please can the UK recolonise us here in South Africa and Zimbabwe Ruins. We need you now!",
            "score": 8,
            "author": "Victor_van_Heerden",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Would be great if the same questions were asked in the former colonies. That it could be portrayed as ‘the glorious days’ at all is appalling.",
            "score": 29,
            "author": "pangasreve",
            "replies": [
                {
                    "level": 1,
                    "comment": "In Asia Pacific, current GDP per capita roughly correlates to years of Japanese rule.",
                    "score": 13,
                    "author": "lelarentaka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you elaborate?",
                            "score": 5,
                            "author": "leoyin91"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Korea and China are a lot better off not being part of Japan.",
            "score": 19,
            "author": "Esco_Dash",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Would Italy’s empire be regarded as Libya, Somalia, Eritrea, Ethiopia, Croatia and Albania, or would it be the Roman Empire they’re referring to?",
            "score": 13,
            "author": "IIIlllIIIlllIlI",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Didn't the Belgians chop the hands off of hundreds of thousands of people for not meeting a rubber quota and kill a couple million people in a short period of time? \n\nI think the Congolese would strongly disagree with the 18% who said they were better off because of Belgian rule",
            "score": 8,
            "author": "Snazzy21",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dutch Moment",
            "score": 3,
            "author": "ladyegg"
        },
        {
            "level": 0,
            "comment": "Where is this data from? In the Netherlands there are still debates about apologizing about all the horrible stuff we did in the colonies.",
            "score": 3,
            "author": "Guyke",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Source of this survey?",
            "score": 3,
            "author": "rohowsky"
        },
        {
            "level": 0,
            "comment": "As someone from the (former) Netherlands Antilles currently living in the Netherlands. I can confirm this.",
            "score": 3,
            "author": "shaddowkhan"
        },
        {
            "level": 0,
            "comment": "I will never understand why the UK is such a low % for this, and people circlejerk their past. They were a pivotal moment in stopping slavery and all their colonies are better off than if colonialism never happened. Commented by a part maori NZer, so many things here get blamed on colonialism instead of the reasons actually perpetuating the problem",
            "score": 6,
            "author": "nogap193",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Okay now do Russia",
            "score": 14,
            "author": "TheMightyYule",
            "replies": [
                {
                    "level": 1,
                    "comment": "Think this is only for countries that have lost their empire.\n\nRussia still has most of theirs",
                    "score": 13,
                    "author": "Mein_Bergkamp",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are only two things I can't stand in this world: People who are intolerant of other people's cultures, and the Dutch.",
            "score": 17,
            "author": "koozie17",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Based Germans",
            "score": 10,
            "author": "TheMightyYule",
            "replies": [
                {
                    "level": 1,
                    "comment": "That 9% is just AfD voters anyway",
                    "score": 5,
                    "author": "HHcougar",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curious as to why you ignored Russia, Portuguese, and Ottoman empires.",
            "score": 35,
            "author": "archiotterpup",
            "replies": [
                {
                    "level": 1,
                    "comment": "The [source](https://docs.cdn.yougov.com/g9th5mtevv/YouGov%20-%20Empires%20attitudes.pdf) didn’t include them.",
                    "score": 126,
                    "author": "Flagmaker123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf bro, why didn’t you go out and make a poll for those countries, this is clearly anti western propaganda /s",
                            "score": 30,
                            "author": "Hazardish08"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeh when op was doing his phone survey of all these countries",
                    "score": 4,
                    "author": "garfield_strikes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So is Germany just referring to pre ww1 colonies, or are we including the second round of imperialism?",
            "score": 7,
            "author": "Antonioooooo0",
            "replies": [
                {
                    "level": 1,
                    "comment": "1871-1918 empire is what the source says",
                    "score": 34,
                    "author": "Flagmaker123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d like to ask those Japanese who voted yes for the second question. How?",
            "score": 5,
            "author": "geeksluut",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I wonder why Mongolia didn't investigate.",
            "score": 5,
            "author": "madrid987"
        },
        {
            "level": 0,
            "comment": "They forgot to ask russians",
            "score": 4,
            "author": "CressInteresting"
        },
        {
            "level": 0,
            "comment": "Which Italian \"Empire\"? The ancient Roman is one thing, the Mussolini's \"empire\" is a pretty different thing.\n\nBoth are debatable but the Roman empire fits better the historical context. The Mussolini's one was just propaganda",
            "score": 4,
            "author": "pmmpmm",
            "replies": [
                {
                    "level": 1,
                    "comment": "It looks like observing colonialism from the Modern Era, so it’d be the more recent one.\n\nFor what is worth the Italian Empire lasted from 1882 to 1960, although it formally used the title “Empire” briefly during Fascism.",
                    "score": 4,
                    "author": "EA_LT",
                    "replies": []
                }
            ]
        }
    ]
}