{
    "id": "146df7w",
    "score": 62,
    "title": "Georgia gerrymandered so that Democrats win 10 districts and Republicans win only 4",
    "author": "rotciv0",
    "date": 1686436994.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/146df7w",
    "media_urls": [
        "https://i.redd.it/z3aha5wxq95b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "You can draw 11-3 more neatly than this in Georgia. The intent here seems specifically to be to screw MTG since in the ideal Democratic map her district is already close to a perfect pack.",
            "score": 21,
            "author": "thesteelsmithy"
        },
        {
            "level": 0,
            "comment": "If you post a hypothetical map, you have to put that in the title.",
            "score": 24,
            "author": "WoodSheepClayWheat"
        },
        {
            "level": 0,
            "comment": "r/imaginarymaps",
            "score": 50,
            "author": "DirtyDaemon"
        },
        {
            "level": 0,
            "comment": "You really need to put HYPOTHETICAL on the titles with these posts",
            "score": 5,
            "author": "DoggoLord27"
        },
        {
            "level": 0,
            "comment": "Epic Brandon moment",
            "score": 3,
            "author": "Juhani-Siranpoika"
        },
        {
            "level": 0,
            "comment": "Would this take Marjorie Taylor Green's district away?",
            "score": 2,
            "author": "crazycatlady331",
            "replies": [
                {
                    "level": 1,
                    "comment": "It could make 4 mega-maga MTGs. \n\nGerrymandering works by putting as many of the group you are trying to underrepresent into a district. So I’m this case you’d have 4 districts with maybe 70-80% republicans and 11 districts with a small democrat majority.",
                    "score": 9,
                    "author": "wallnumber8675309"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That a fantasy but great to imagine!",
            "score": 2,
            "author": "Lucky_Baseball176",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Not okay if they do it, okay if we do it”",
                    "score": 1,
                    "author": "MrRipski",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s actually not okay in any case. And democrats have done it before as well. However that doesn’t make it ok. Republicans are clearly using gerrymandering as part of their strategy to rig elections. That IS what they are doing. And it’s fucking un-American and anti-democracy. But so is the current GOP.",
                            "score": 3,
                            "author": "Lucky_Baseball176"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is hypothetical.\n\nHowever, each side tries/does this every time.    So much for the world's greatest democracy.\n\nIn many EU countries only the electoral commission can change boundaries based on demographic changes triggering it after routine reviews.",
            "score": 0,
            "author": "DomHuntman",
            "replies": [
                {
                    "level": 1,
                    "comment": "In addition, we mainly use proportional systems so the shape is even less important.",
                    "score": 3,
                    "author": "matthaeusXCI"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curious as to why you featured this map rather than even more obvious gerrymanders, such as in Ohio with Jim Jordan's ridiculous duck-shaped gerrymander. Since Georgia has a GOP governor and secretary of state, calling out this supposed gerrymander and blaming Democrats, seems highly suspect.",
            "score": -14,
            "author": "BoogaBetty",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a theoretical map, not the currently used one. I made it to show how ridiculous gerrymandering can be, to argue against it. I am not blaming Dems since this map doesn't actually exist, and they haven't proposed or enacted it. In fact, I am a Democrat, so stop assuming other people's positions without evidence, I guess?",
                    "score": 22,
                    "author": "rotciv0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, I see. It might be good to mention about it being a theoretical map when you post, lest you get both sides up in arms. I would like to see fair mapping in all states so rock on trying to get people to see the ludicrousness and unfairness or gerrymandering.",
                            "score": 9,
                            "author": "BoogaBetty"
                        },
                        {
                            "level": 2,
                            "comment": "It's fun to look at the current Dallas map. You have to zoom way in to see that the map includes/excludes specific houses to influence the vote.",
                            "score": 1,
                            "author": "rabbidrascal"
                        },
                        {
                            "level": 2,
                            "comment": "Cool. I'm a dem too and I support non-partisan districting (as well as more districts, as well as reforming the senate, etc) and it's important to remember it can go both ways. The whole system needs to be reformed.",
                            "score": 1,
                            "author": "SteviaCannonball9117"
                        },
                        {
                            "level": 2,
                            "comment": "Realities of redistricting usually puts SOME limitations on partisan ambitions. Most the Dem incumbents would oppose their already safe districts being torn apart to create a map like this. For example, I doubt Lucy McBath would like that her 7th district was suddenly on the other side of Atlanta.",
                            "score": 1,
                            "author": "VariWor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This happens all the time anyway. The representative can just run in the new district. Sometimes a goal of redistricting is to combine two current incumbents into the same district to reduce the incumbency advantage.",
                                    "score": 1,
                                    "author": "Wanderingjoke",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wouldn't call that a \"goal\" as much as unavoidable reality. Most state parties don't want to knock off their own incumbents. And yeah, sure, politicians do just run in a new district but they usually have competition then and they'd rather avoid that. Realities are that incumbents have friends in their state legislatures and their desires will impact the process.",
                                            "score": 1,
                                            "author": "VariWor"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This particular sub seems to have a frequency of RW folks with a dubious grasp on context, data, and (ironically) how that data pops up in map form. \n\nThat irony is fun...until you realize their misunderstanding has real world consequences\n\nEdit: realized i did speech to text and wrong \"their\"\nUpdating",
                    "score": -3,
                    "author": "dandrevee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "in the imaginary world where this map was put into law... maybe",
                    "score": 12,
                    "author": "TheNextBattalion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is the purpose of these maps?\n\nEdit: oh geez, looks like this was a heated comment.\nI was just curious about the purpose.\n\nEdit 2:a lot of these comments are negative on both sides, cmon guys we can do better than this.\n\nEdit 3: a lot of hateful stuff on both sides, I hope people can come together in peace!!\n\nCmon Reddit I know we can do it!",
            "score": -7,
            "author": "tiggermillion",
            "replies": [
                {
                    "level": 1,
                    "comment": "To look at maps.",
                    "score": 20,
                    "author": "AryaSyn"
                },
                {
                    "level": 1,
                    "comment": "It’s the only goddamn way to make a conservative actually understand why gerrymandering is crazy and bad",
                    "score": 5,
                    "author": "SexyPinkNinja",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’re genuinely oblivious to politics, I suppose these kind of posts are pointless. But to your point, gerrymandering generally leans to right and I think the negativity here is pretty indicative of the fact that conservatives aren’t receptive to being shown their own bullshit.",
                            "score": 2,
                            "author": "stevenmoreso"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Typical Democrat",
                    "score": 0,
                    "author": "dphayteeyl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This particular map is theoretical, not in use. But the democrats do their own stuff to influence the vote. For example, in California they opened new polling stations in the barrio to enable more Hispanics to vote (in theory, this would favor democrats).\n\nThe GOP in the last cycle did things like robo call 4m democrats to say that it wasn't safe to go to the polls.\n\nThe sleaze is real.",
                    "score": 6,
                    "author": "rabbidrascal"
                }
            ]
        }
    ]
}