{
    "id": "147aqf6",
    "score": 83,
    "title": "Trying to identify the locations of the four covers of Brian Eno’s Ambient series",
    "author": "its-copacetic",
    "date": 1686531443.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/147aqf6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Pls help identify! Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "From what I can tell, these are hand created by Brian Eno himself. [This link](https://www.djfood.org/brian-eno-ambient-2-music-for-healing/) shows notebook drawings for the album covers including an unused one for Ambient 2. These apparently are from the book \"Brian Eno: Visual Music\". \n\nThe locations are completely fictional it seems.\n\nElements look similar to cropped photos of real locations of an atlas created by [Italian artist Luigi Ghirri](https://www.thewalkman.it/luigi-ghirri-atlante/) in 1973. I don't think there's any relation between Luigi Ghirri and Brian Eno, but given the time period, I wouldn't doubt if Eno consciously or unconsciously saw this or something similar and was inspired to create his album covers that resembled  this style.",
            "score": 21,
            "author": "greymart039"
        },
        {
            "level": 0,
            "comment": "Boosting this bc I'm a huge fan of Eno and maps and never thought to combine the two",
            "score": 16,
            "author": "Monkeyman001"
        },
        {
            "level": 0,
            "comment": "I remember a long time ago on Quora there was a post with this exact same question. I don't remember if they got an answer though.",
            "score": -1,
            "author": "Petrarch1603"
        },
        {
            "level": 0,
            "comment": "i thoroughly that the pictures were identified on the album sleeve",
            "score": 1,
            "author": "cdhicks42"
        },
        {
            "level": 0,
            "comment": "Thank you so much for asking, OP. I’m a huge fan of all four and I’ve always wondered myself!",
            "score": 1,
            "author": "KramersCoolHair"
        }
    ]
}