{
    "id": "147p207",
    "score": 3317,
    "title": "Venomous animals worldwide and in the US",
    "author": "hearsdemons",
    "date": 1686578925.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/147p207",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I assume France is like that because of French Guiana and not European France?",
            "score": 696,
            "author": "vodamark",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes definitely. No freaking way European France could even be light red let alone red.",
                    "score": 338,
                    "author": "PsychologicalDark398",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That actually depends on whether \"venomous\" implies \"dangerous for human life\" bc we actually have a fair bit of venomous species. They're just either very rare or very weak.",
                            "score": 24,
                            "author": "JustAGoldenWolf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not more than our neighbors, animals don’t know about frontier (unlike radioactive clouds)",
                                    "score": 46,
                                    "author": "Mooblegum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Way too low, please, have my upvote",
                                            "score": 6,
                                            "author": "Zeugma_C10-iE"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What ? Noooo, look at Chernobyl, it was refused at the french borders and didn't enter ilegally",
                                            "score": 6,
                                            "author": "Any-Fan-2973",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "France is not any worse compared to most European countries. France being red/light red doesn't make any sense unless we include French Guinea since other European countries are green according to the map.",
                                    "score": 6,
                                    "author": "PsychologicalDark398"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No, the french venomous animals are the parisians...",
                    "score": 447,
                    "author": "WasNamedTh0mas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Parisians are toxic, not venomous.",
                            "score": 216,
                            "author": "JorisN",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Eh, I wouldn’t let one bite me anyway",
                                    "score": 82,
                                    "author": "Torre_Durant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Parisian are like Pitbull once they bite they don't realease at the ecxeption that pitbull have feelings\n\nHommage a mon pote parisien",
                                            "score": 5,
                                            "author": "watgoon7"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did you see Shaun of the dead ? It’s the same way newcomers embrace Parisian’s lifestyle",
                                            "score": 3,
                                            "author": "Tabutrayn"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As a french I confirm, Parisians are very dangerous animals. To have any chance to stay alive you have to speak the best french you can but talk to them when they are working or when they are taking a coffee or when they are un vacation. Just don't talk to them that's better",
                                    "score": 3,
                                    "author": "who18"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am parisian and upvote that 😂",
                            "score": 4,
                            "author": "VariousHistory624"
                        },
                        {
                            "level": 2,
                            "comment": "With their excessive use perfume, it might as well permeating in their flesh.",
                            "score": 23,
                            "author": "Cauhs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cologne's is actually in Germany...",
                                    "score": 13,
                                    "author": "TaringaWhakarongo1",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Hmmm clichés smell😍",
                                    "score": 3,
                                    "author": "BodybuilderLiving112"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yup, pretty sure that's the reason (I'm french)\n\nAlso, otherwise, it wouldn't make sense that those venomous animals aren't crossing the borders with belgium, germany, spain, etc...",
                    "score": 58,
                    "author": "Yukino_Wisteria",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even animals know how to respect international borders don't you know?",
                            "score": 41,
                            "author": "Litterally-Napoleon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm sure the animals have heard of Schengen",
                                    "score": 21,
                                    "author": "welshmanec2"
                                },
                                {
                                    "level": 3,
                                    "comment": "As respectful as Tchernobyl's radioactive clouds!",
                                    "score": 9,
                                    "author": "whatcenturyisit"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm pretty sure it's actually about our politicians and maybe also our lovely Parisians",
                            "score": 5,
                            "author": "Kromboy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "there used to be a lot of venomous animals in France but the French cooked them all in garlic butter and ate them",
                    "score": 10,
                    "author": "Namorath82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same in China, but they were cooked with soy sauce instead.",
                            "score": 4,
                            "author": "tothemoonandback01",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's right, it's stated in the source OP provided.",
                    "score": 7,
                    "author": "Findus_Falke",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "New Zealand looking over at Australia “thank fuck for this big ocean between us.”",
            "score": 353,
            "author": "International_Ant217",
            "replies": [
                {
                    "level": 1,
                    "comment": "Struggling to name any tbh. We have a couple of spiders that wouldn’t be a fun time but nothing that is life threatening. Wonder how venomous the animal needs to be to be considered, does a bee count?  \n\nRecently we had redbacks introduced (small pockets of the South Island). We also have a cousin of theirs (katapo) but that’s about it. \n\nSea snakes drift to our shores on the very odd occasion but I don’t think they would be considered",
                    "score": 65,
                    "author": "KJongsDongUnYourFace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why introduce red backs?",
                            "score": 15,
                            "author": "Mrmastermax",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Redbacks are sneaky and love to hide in shipping containers or underneath Australian cars. They are an introduced species in many countries as a result.",
                                    "score": 55,
                                    "author": "KJongsDongUnYourFace",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's simply a gift from us to you kiwis, little friends to play with",
                                            "score": 26,
                                            "author": "ShortInternal7033",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We take crowded house, russel crowe and pavlova,  they take our spiders and criminals",
                                                    "score": 14,
                                                    "author": "zebba_oz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They can take Russel Crowe back.",
                                                            "score": 6,
                                                            "author": "SlicketyRickety420",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They can have Russell back",
                                                            "score": 4,
                                                            "author": "quadrangle3136"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They hide in very hidden places, they love under vehicles, anything that doesn't get much sun light they love\nShipping containers and pallots are a good place to find them",
                                    "score": 7,
                                    "author": "stevenspenguin"
                                },
                                {
                                    "level": 3,
                                    "comment": "Probably not on purpose, they are pretty small and could hide in lots of places.",
                                    "score": 13,
                                    "author": "oxlasi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty small? I don’t know about your definitions but there’s one in my fence I’d class as a monster.",
                                            "score": 4,
                                            "author": "crosstherubicon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh well I mean they can get pretty big, but I pulled up my grey water cover, there were about 10 that would fit on my pinky nail.\n\nVery vibrant red though on the back.",
                                                    "score": 7,
                                                    "author": "oxlasi",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some suggestions: blue bottles (Portuguese man-of-war), stingrays, bees, wasps?",
                            "score": 10,
                            "author": "Smokey_84",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "In my opinion Kea's are secretly plotting the destruction of humanity!\n\n(And if one animal can pull it off, it would be them).",
                            "score": 9,
                            "author": "Grammarhead-Shark",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "There have been redback spiders in NZ since the 1980's.",
                            "score": 8,
                            "author": "emergency_cheese",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. They are mostly confined to the Otago region where there is an established breeding population. They are regularly intercepted on containers and vehicles coming from Australia.",
                                    "score": 7,
                                    "author": "KJongsDongUnYourFace",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sorry about that, NZ. And the possums.",
                                            "score": 5,
                                            "author": "cheshire_kat7",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nz has native red back spider (katipo). Also marine animals such as blue ring octopus. Not sure if they count though. Some Australian imports include white tail spiders which are fairly common now.",
                            "score": 6,
                            "author": "enzedmaori",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We do not have the blue ring octopus. \n\nWhite tails are venomous but not particularly so. They are just above the level of a bee sting (although some people can react badly to them).",
                                    "score": 4,
                                    "author": "KJongsDongUnYourFace",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sea snakes are the most venomous snakes in the world very unlucky to be bitten by them very small fangs but if they got you in a vein that takes a lot of blood it might be all over then.",
                            "score": 5,
                            "author": "johnnyblaze1957",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The most venomous sea snake, the beaked or hooked nosed sea snake comes in at number 6. Inland and coastal taipans, eastern brown, and tiger/black tiger are all more venomous.",
                                    "score": 6,
                                    "author": "b10v01d",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m Australian. The first time I went to NZ I thought it was funny as hell that I could walk around in long grass without worrying about snakes.",
                    "score": 68,
                    "author": "Academic_Coyote_9741",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wot; no snakes at all?",
                            "score": 14,
                            "author": "noofa01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "None. Never made it that far",
                                    "score": 14,
                                    "author": "CottMain",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Famously, even Ireland does not have snakes.",
                                    "score": 4,
                                    "author": "Unable_Explorer8277"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Meanwhile I nearly broke the world record in high jump when I almost stepped on a red belly black snake in rural NSW",
                            "score": 38,
                            "author": "International_Ant217",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't stop laughing picturing this in my head",
                                    "score": 14,
                                    "author": "Eek_the_Fireuser",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol!  Wait till you see someone do the spider dance!",
                                            "score": 11,
                                            "author": "HowDoYouSpellH",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We call this the “Instant Ninja” 😂🇦🇺",
                                                    "score": 8,
                                                    "author": "Doc-Bob-Gen8"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "A.k.a. the arachnoleptic fit",
                                                    "score": 6,
                                                    "author": "CharlieTokyo"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Suburban Sydney: Lived on edge of national parkland nthn suburbs. Small bushy backyard on edge of the native bushland. Tidying up one afternoon, in the space of 4 hrs I saw a Red Belly Snake sunning on steps, multiple red backs, funnel webs, then got swarmed, attacked and bitten by some frigging red fire ants fuckkk, multiple sudden searing stabbing shooting burning pain outta nowhere, omfg, i was running around screaming,  worst pain ive experienced in my life. Not to mention the local bees, wasps, goannas, brushtails, rock wallabies, huntsmans that all lived down the back too. Lovely afternoon in the garden.",
                                    "score": 9,
                                    "author": "WagsPup",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Got a red belly that has been living in my backyard for the past 5 years, beautiful snakes",
                                    "score": 6,
                                    "author": "vTipi",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Many years ago my mother was pulling out a net from our dam (hadn’t be touched in years) and as she pulls out the net she sees a redbelly in it. After initially falling back into the mud she got up and broke the land speed barrier at 50 years old",
                                    "score": 7,
                                    "author": "drummy23",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can relate. NT rural area, sorting out kids toy box downstairs.. u know.. rubbish, keep, keep, rubbish, st vinnie's, snake..  wtf... dropped and moved so fast.. even snake surprised. Used to it now. Lid on toy box.",
                                            "score": 4,
                                            "author": "DearFeralRural",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nearly stepped on one yesterday when I was out for a walk. Wasn't expecting that in winter, scared the shit out of me",
                                    "score": 6,
                                    "author": "RottingGraveFlower",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I doubt the snake was expecting it either",
                                            "score": 5,
                                            "author": "Houki01"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I nearly stepped on a red belly out the front of my old office, i wasn't suspecting that at all, either way he as we both paused, looked at each other until he pissed off",
                                            "score": 6,
                                            "author": "NopeH22a"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I can do anything in Nz without thinking twice",
                            "score": 5,
                            "author": "Mrmastermax",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Mate, my cousins in Sicily thought I was cooked because I couldn't bring myself to walk through long grass. I see long grass and I see Tiger snakes and Dhugites",
                            "score": 4,
                            "author": "dannydanger66",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "yeah but you ever been bitten by a kiwi?",
                            "score": 2,
                            "author": "Frankie_T9000"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah but the encephalitis will get you if you get water in your ears in the hot springs of Rotorua!  I'd rather a cute red-bellied black than those bugs you can't see in the water.",
                            "score": 2,
                            "author": "swami78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, shouldn't Australia be its own category?",
                    "score": 11,
                    "author": "elwebst",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It specifically states 'venomous', not 'dangerous'. Cassowaries aren't venomous (thank GOD) but even Steve Irwin left them alone.",
                            "score": 10,
                            "author": "Houki01",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Their venomous animals are volcanoes and earthquakes.",
                    "score": 5,
                    "author": "TaaBooOne",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "&gt; “thank fuck for this big ocean between us.”\n\nNah that's us Aussies looking over at New Zealand.",
                    "score": 11,
                    "author": "ep_soe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Legend!",
                            "score": 2,
                            "author": "prophet4all"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you come to Australia and just visit the cities you are 100% doing it wrong.",
                            "score": 10,
                            "author": "Specialist_Reality96",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Red backs are in the suburbs",
                            "score": 5,
                            "author": "RunWombat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, Redbacks are [fucking everywhere mate](https://australian.museum/learn/animals/spiders/redback-spider/#:~:text=Redback%20Spiders%20are%20found%20Australia,in%20association%20with%20human%20habitation).",
                                    "score": 2,
                                    "author": "Itsumishi"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Urban spiders can still be venomous, and there's a difference between venomous and dangerous, and venomous",
                            "score": 3,
                            "author": "leet_lurker"
                        },
                        {
                            "level": 2,
                            "comment": "LOL bullshit.\n\nI live in a middle ring Melbourne suburb. Apartment blocks going up all around me, trams and trains within a short walk from the house kind of suburb. I'm not scared of spiders in the least, but you should be cautious and aware in the cities.\n\nLast year we had a crate of \"backyard toys\" for the kids on the deck behind our house. It didn't get touched over winter. I went to clean some of the toys during spring and a giant fucking redback crawled out when I picked it up. I then tipped the crate over and started hosing the toys and four more big female redbacks and literally hundreds of males and baby spiders came out everywhere. We don't have a backyard toy-crate anymore - and when BBQ season commences each year I always check the cupboard and supplies beneath the BBQ. \n\nAnd guess where Australia's most deadly spider, the Sydney Funnel Web's primary area of habitat is?! (*hint:* the name gives you a clue).\n\nAnd don't forget the tiger snakes and brown snakes that live near basically all the creeks and rivers across Melbourne...",
                            "score": 2,
                            "author": "Itsumishi",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Well, that's not true. A Brown Snake is pretty dangerous and are often found in the suburbs. And I reckon most backyards have Redbacks. Which although nobody has actually died from the venom in a very long time are potentially deadly. Same with funnel webs. And in coastal areas there are things to worry about in the water. I was wandering along a relatively busy beach and saw a blue ringed octopus that had been washed up. Bondi beach in Sydney gets bluebottles. And if you think we only have small spiders in the towns and cities you're nuts. Huntsmen spiders are huge and very common, although not actually dangerous to humans.   \n\n\nThere's no reason to just be scared, but people definitely should be aware of certain creatures and how to behave in certain areas. Misinformation like this is not only unhelpful but dangerous.",
                            "score": 2,
                            "author": "South_Front_4589",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In TX we get the swampy death critters and the cactusy types.",
            "score": 29,
            "author": "prokool6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those are the technical terms 🤣 Love it, Swampy Death Critter, my new online pseudonym",
                    "score": 8,
                    "author": "SnooDoughnuts849",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are three types of snakes that can be found in the Nordic region: the European viper (Vipera berus), the European grass snake (Natrix natrix) and the European smooth snake (Coronella austriaca). The European viper is the only venomous snake of the three.",
            "score": 21,
            "author": "Miniblasan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha I remember the topic about reptiles in the geography class in my Polish primary school was basically 'if it has two spots behind the back of its head, you're cool, if it has a zigzag on it's back, get the fuck outta there'.",
                    "score": 5,
                    "author": "TheSupremePanPrezes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You’ve blown my mind. I’m Australian and I can’t even keep track of the venomous ones",
                    "score": 7,
                    "author": "Standard_Rock1040",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Only the coolest countries have 50+. Don’t even try to come here bruh, you can’t handle our many venoms.",
            "score": 50,
            "author": "Warioswallet",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Only the coolest countries have 50+\n\nthat can't be true! snakes don't live in cool places, only warm ones!!\n\n&gt;!/s!&lt;",
                    "score": 19,
                    "author": "Mysterious_Rent_613",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only the hottest countries have 50+",
                            "score": 3,
                            "author": "am_Nein",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mexico takes 1st place. Viva Mexico!!",
            "score": 93,
            "author": "phreaqsi",
            "replies": [
                {
                    "level": 1,
                    "comment": "congratulations from Brasil, viva los venomous latinos",
                    "score": 31,
                    "author": "churroscachorro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Viva a América Latina r/suddenlycaralho",
                            "score": 3,
                            "author": "no_named_one"
                        },
                        {
                            "level": 2,
                            "comment": "Viiii..nooo..mous... OH HI VINOMOUS 🥴",
                            "score": 3,
                            "author": "BodybuilderLiving112"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "MEXICO NUMERO UNO 💪💪🇲🇽🇲🇽🇲🇽",
                    "score": 3,
                    "author": "KhajiitSupremacist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Australia isn't that bad.  Lol.   Well mostly. 🤪",
            "score": 12,
            "author": "JonesyBB19",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, i don't get it. Every single Australian online seems to think it's cool to believe they live in a hellscape filled with deadly animals, as they comment from the centre of Sydney.",
                    "score": 16,
                    "author": "Timely_Equal_2276",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's playing into the stereotypes. Also, it's just funny to joke about it??",
                            "score": 9,
                            "author": "am_Nein",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Yes, commenting right now from the centre of Sydney 😆 (Well, 4 kilometres from Sydney CBD). I’ve also lived in rural areas in Queensland and Tasmania. \nWhile I acknowledge that we do have a lot of venomous animals here in Australia, most of them pose little risk to people, as they’re shy, and way more scared of us than we are of them. If you’re sensible, and take precautions, you won’t have any trouble with these animals (or you probably won’t see them at all).",
                            "score": 3,
                            "author": "lepetitrouge"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That seems like a very shallow database. Brazil for one, is home to over 70 known species of venomous snakes and don't get me started on spiders...",
            "score": 56,
            "author": "Phadafi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think arthropods are included in this map. If they were, everywhere would be way higher due to an abundance of spiders, bees, and wasps. Even Arctic areas have dozens of species of bees, all of which can deliver a sting.",
                    "score": 13,
                    "author": "OwlFarmer2000",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just watch out for the drop-bears in the Australian bush, bush walkers get killed every year from falling fluffy muscled koala like bears. It's a major hazard so I've heard. 🐨🌪️",
            "score": 38,
            "author": "One-Relief-1212",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wonder if they are included in the data, most tourists don't even realise they are venomous when they learn of them.",
                    "score": 11,
                    "author": "Jakepoo7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " \nIf you survive the falling bear part, they bite you and you are done. ⚠️",
                            "score": 4,
                            "author": "One-Relief-1212",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So why does longitude correlate with number of venomous species?",
            "score": 47,
            "author": "SweetBunch1109",
            "replies": [
                {
                    "level": 1,
                    "comment": "Colder countries have way lower diversity of insects, amphibians and reptiles (i.e. usually venomous animals) because for significant period of years is just too cold for them. This applies especially for reptiles and amphibians e.g. Poland has only 9 species of reptiles (1 venomous) and 19 species of amphibians.\n\nThe warmer the climate...the more poikilothermic animals...the more diversity...the more venomous species.",
                    "score": 107,
                    "author": "idk2612",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think OP is confused, should mean latitude rather than longitude. In reality both make a difference, particularly around the tropics due to the Corriolus effect leading to rainfall and rainforests which are the habitats of the majority of venomous species.",
                            "score": 25,
                            "author": "wexfordwolf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do you know what longitude is?",
                    "score": 5,
                    "author": "rumpots420",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in one of the green states, and the legend should definitely be taken literally. As in we have less than five venomous animals in total. Not species, individual creatures. Two rattlesnakes who live on the border, and three spiders called \"Brown Recluse\", which, as the name suggests, would require you to *try* and get bitten. Winter is good. Winter kills monsters.",
            "score": 10,
            "author": "RadomirPutnik",
            "replies": []
        },
        {
            "level": 0,
            "comment": "New Zealand looking over at Aus like\n\n![gif](giphy|H5C8CevNMbpBqNqFjl)",
            "score": 9,
            "author": "TheInfamousSw0le",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Interesting so many comments on Australia's dangerous animals. Let's not forget the US has bears, bears people! What would you rather come across when camping, a little snake or bear?!",
            "score": 22,
            "author": "StinkF1sh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not thrilled by either.\n\nIndia is the sleeper here. Dense population, high degrees of contact with not only venomous but very aggressive snake species, not to mention mosquito borne illness, elephants, tigers etc.\n\nEast Africa is probably the region with the highest number of per capita fatalities due to venomous species, due to proximity between wildlife and human settlements and West Africa the highest for animal associated disease born illness, due to population density, conflict zones and prevalence of various mosquito etc. birn illness.",
                    "score": 8,
                    "author": "Yung_Jose_Space",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Arguably bears are more dangerous. A lot of people perceive  all snakes as deadly and avoid any interaction at all.\n\nBears, on the other hand, are 400lb killing machines that have a fuzzy coat and a boop snoot. Some people forget the killing machine bit.",
                    "score": 7,
                    "author": "Nadger_Badger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just want to boop the snoot though",
                            "score": 3,
                            "author": "CricketSimple2726",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trouble is, our little snakes like to hide in shoes and tucked in sleeping bags.  You don't know they are there.  Then they bite you and if you're lucky it will just hurt a lot.  If not,  well, bye bye. \nI'm thinking bears are a bit more obvious?",
                    "score": 11,
                    "author": "meandhimandthose2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really. I’ve lived in Australia all my life and I can’t say I know one person that this is happened to. I would rather come across a snake any day than a bear.",
                            "score": 12,
                            "author": "StinkF1sh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Totally agree. I'm Australian but lived ten years in Canada, many of those in the Canadian mountains and wilderness. I was way more terrified walking through the woods in Canada than my entire lifetime in Australia. A snake or a spider I can handle...a bear or even a moose, no chance.",
                                    "score": 5,
                                    "author": "Bellezr"
                                },
                                {
                                    "level": 3,
                                    "comment": "I see venomous snakes all the time in summer along the coast. \nI have no idea how many people actually die from them. \nI was just replying to someone else's comment that I literally walked into a redback in its Web in my garage this morning. I live in Perth.",
                                    "score": 5,
                                    "author": "meandhimandthose2",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As an Australian I almost never come into contact with anything remotely dangerous. I’ve seen a tiger snake in the wild and a couple of redbacks in my lifetime, both times I was never remotely close to risk.\n\nAlthough we do have quite a few venomous snakes and spiders, I have the feeling most of the animals making up the list are our ocean animals. Box jellyfish and blue ringed octopus are more dangerous than anything on land imo.",
                    "score": 3,
                    "author": "Successful-Mode-1727",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "100%, i'm aussie and snakes are just dangerous if you're being oblivious. Bears will straight up hunt you down or smell your tasty sandwich and come investigate, fuck that!",
                    "score": 2,
                    "author": "Jimmi28"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Off the top of my head as an Australian I’ve encountered or seen. Dugite, funnel web, blue ring octopus, tiger snake, king brown, death adder, red back spider, white tip/ tails, Stone fish, cobbler, inland taipan, black widow spider, mouse spider.",
            "score": 8,
            "author": "Turboman1994",
            "replies": [
                {
                    "level": 1,
                    "comment": "So that was last weekend, but what about the one before that?",
                    "score": 5,
                    "author": "KTown-2006"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Worldwide and in the US? Is the US not part of this world?",
            "score": 7,
            "author": "shescarkedit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Instantly knew Australian would be the deepest shade of whatever colour",
            "score": 15,
            "author": "M0Nd0R0ck",
            "replies": []
        },
        {
            "level": 0,
            "comment": "In Brazil, most venomous animals are found in the Amazon region, which is the least populated area in the country.",
            "score": 6,
            "author": "Accomplished-Quit821"
        },
        {
            "level": 0,
            "comment": "oh no my country has over 50",
            "score": 5,
            "author": "MeringueFeeling"
        },
        {
            "level": 0,
            "comment": "Aussie Aussie Aussie!",
            "score": 14,
            "author": "2o2i",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ouch! Ouch! Ouch!",
                    "score": 9,
                    "author": "Grammarhead-Shark"
                },
                {
                    "level": 1,
                    "comment": "OI OI OI!",
                    "score": 4,
                    "author": "totesgonnasmashit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OW OW OW!",
                            "score": 2,
                            "author": "tothemoonandback01"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why a per-state map of just the US? I'm sure such a map would be pretty interesting for Brasilian states, to see the disparity between the Amazon states and the colder states",
            "score": 69,
            "author": "Logan_Maddox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also China, Russia and India would be intresting.",
                    "score": 44,
                    "author": "Yurasi_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially since Russia is in a different tier than the rest of Europe *and* Central Asia, so it'd be interesting to see where the species are concentrated",
                            "score": 25,
                            "author": "Logan_Maddox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Russia would be green because there are only vipers in European and Northern parts, and Southern parts near Cauasian mountains will have more diversity of such animals.",
                                    "score": 7,
                                    "author": "V_es",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "South of Russia (mostly the Caucasus) By the way, the most dangerous for humans are found there. And so the European viper and water shrew have the widest and northern range (I will not take into account bees, wasps, hornets). The range of the Siberian pit viper is also quite wide from the Caucasus to the south of the Far East.",
                            "score": 4,
                            "author": "AlexZas"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably because the mapmaker wanted to put the effort in for a map of the US (potentially because that’s where they are from)\n\nNot much else to it than that id wager.\n\nOp is a bot (or serious reddit addict) either way though so we cant know for sure.",
                    "score": 15,
                    "author": "killerbannana_1"
                },
                {
                    "level": 1,
                    "comment": "Australia would be good too haha.",
                    "score": 6,
                    "author": "TeacupUmbrella",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Could have just said worldwide",
            "score": 4,
            "author": "notanormy7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 1,570,677,817 comments, and only 297,005 of them were in alphabetical order.",
                    "score": 3,
                    "author": "alphabet_order_bot",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "‘Worldwide and in the us’ lmao",
            "score": 4,
            "author": "Tiny-Flamingo2130",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You do know the u.s is included in the \"worldwide\"! Lmao.",
            "score": 4,
            "author": "Bekeexx",
            "replies": []
        },
        {
            "level": 0,
            "comment": "BRAZIL NUMBER 1🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽🇲🇽",
            "score": 16,
            "author": "Any_Efficiency6191",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry, Mexico beats out Brazil.",
                    "score": 7,
                    "author": "phreaqsi"
                },
                {
                    "level": 1,
                    "comment": "Brazil…. or Mexico?",
                    "score": 4,
                    "author": "basementapproved",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Source?",
            "score": 3,
            "author": "Purple_Aardvarc",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://brilliantmaps.com/venomous-animals/",
                    "score": 5,
                    "author": "hearsdemons"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Fewer\" not \"Less\".",
            "score": 3,
            "author": "Leather_Ad_5602",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Australian sings \"at least we don't have AR15's \"",
            "score": 3,
            "author": "Telescopic-Member"
        },
        {
            "level": 0,
            "comment": "Americans here getting smug when all they have to worry about is gators and cougars",
            "score": 3,
            "author": "PoppinFlesh",
            "replies": [
                {
                    "level": 1,
                    "comment": "And every American with a gun",
                    "score": 2,
                    "author": "ivortraynor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Australia *did* give us all Rupert Murdoch.",
            "score": 3,
            "author": "_ChipWhitley_"
        },
        {
            "level": 0,
            "comment": "Oh shit, they have data on the Western Sahara? That's a rarity",
            "score": 3,
            "author": "Slimecatking"
        },
        {
            "level": 0,
            "comment": "Mate, I'm sure I have more than 50 venomous animals around my house. I don't understand what this infographic is trying to show. Perhaps something more informative is the number of hospital admissions from venomous animals per capita? Either way, you're more likely to get shot in the US than injured by a venomous animal in Australia anyway.",
            "score": 3,
            "author": "Sacha00Z"
        },
        {
            "level": 0,
            "comment": "Surprisingly, two members of my golf club have been bitten by venomous tiger snakes in the last two years. Both members survived after spending a number of days in hospital. I say surprisingly because snakes will normally move away from you but, in both cases, the golfers actually stood on them in longish grass which I presume is why the snakes attacked them.",
            "score": 3,
            "author": "Slight-War-3500"
        },
        {
            "level": 0,
            "comment": "Still rather over 50 venomous animals than guns.",
            "score": 3,
            "author": "chickenwitch"
        },
        {
            "level": 0,
            "comment": "Aaaaaaaand cue Americans with their laughably stereotyped view of Australia…",
            "score": 3,
            "author": "zenritsusen"
        },
        {
            "level": 0,
            "comment": "as someone who’s visited France, I can indeed confirm that French people are pretty venomous. They spit venomous bulshit while talking about their arrogance and piss drinking culture until you die of cringe\n\n(true story sadly)",
            "score": 30,
            "author": "Paulgeta",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok, see ya next summer",
                    "score": 13,
                    "author": "JohnGabin"
                },
                {
                    "level": 1,
                    "comment": "Least hateful German.",
                    "score": 9,
                    "author": "Samasra",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Worlwide AND US? Isnt US part of the world?",
            "score": 8,
            "author": "Feloelmago",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's a second map to the right.",
                    "score": 4,
                    "author": "helloblubb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what’s the deal with France?! Why would they have more than any neighbouring country?",
            "score": 5,
            "author": "EstherHazy",
            "replies": [
                {
                    "level": 1,
                    "comment": "French Guiana",
                    "score": 41,
                    "author": "Mr_Biscuits_532"
                },
                {
                    "level": 1,
                    "comment": "Their former colonies (now assimilated into France proper)",
                    "score": 9,
                    "author": "tmr89"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Australia should have its own color.",
            "score": 5,
            "author": "EWR-RampRat11-29",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That title is so American…\nIt should just read “Venomous animals worldwide” no need to add, an in the US ..\nDo Yankees think they aren’t part of the world ?",
            "score": 6,
            "author": "ivortraynor",
            "replies": [
                {
                    "level": 1,
                    "comment": "It could have been worded a bit better but it's because there is a second map that looks at the US specifically by state.",
                    "score": 3,
                    "author": "Lil_Mcgee"
                },
                {
                    "level": 1,
                    "comment": "They aren't.",
                    "score": 2,
                    "author": "NWJ22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curious what’s in Canada, I think black widow spider in certain areas but I don’t know if anything else",
            "score": 2,
            "author": "greach169",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rattlesnakes, mostly in Ontario and BC but climate change has enabled their adaptability to other regions.  Alberta has poisonous toads.  Manitoba, Ontario, Quebec and NB have poisonous caterpillars.  Hopefully we won't see any murder hornets this year.",
                    "score": 4,
                    "author": "blursed_words"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d live in Canada/Europe/Central Asia/Mongolia/Korea/New Zealand",
            "score": 2,
            "author": "Sorry-Yogurtcloset38",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wth France?!",
            "score": 2,
            "author": "Always_was_depressed",
            "replies": [
                {
                    "level": 1,
                    "comment": "French Guiana is pulling the amount up",
                    "score": 4,
                    "author": "Mysterious_Rent_613"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All these hot countries where the animals evolved to not have to chase prey as far.",
            "score": 2,
            "author": "midloth-crisis"
        },
        {
            "level": 0,
            "comment": "🤣🤣🤣",
            "score": 2,
            "author": "dirtyoldfart76"
        },
        {
            "level": 0,
            "comment": "I've encountered fewer venomous creatures in my life in australia than I am years old, and I'm nearing 40",
            "score": 2,
            "author": "PixelPete85",
            "replies": []
        },
        {
            "level": 0,
            "comment": "While this map does correlate relatively well to the real world, it has one flaw, the size of countries, the US, Brazil and Australia are continental countries, of course their pure numbers are going to be higher, and actual useful data would be number os species per km^2, or which % of the total species are venomous.",
            "score": 2,
            "author": "MediumOk5423"
        },
        {
            "level": 0,
            "comment": "Wow, over twenty kinds of French people",
            "score": 2,
            "author": "Hendrick_Davies64"
        },
        {
            "level": 0,
            "comment": "The great southern land o7",
            "score": 2,
            "author": "HeroBear64"
        },
        {
            "level": 0,
            "comment": "Why do spicy regions produce such spicy animals?",
            "score": 2,
            "author": "TrailerPosh2018"
        },
        {
            "level": 0,
            "comment": "Can anyone think of a way to make this also show population of venomous animals? Or maybe likelihood of encountering one? Would be pretty neat.",
            "score": 2,
            "author": "everett640"
        },
        {
            "level": 0,
            "comment": "All the black areas are where my exs are from.. coincidence.. I dont think so..",
            "score": 2,
            "author": "vangogh83"
        },
        {
            "level": 0,
            "comment": "France ☕",
            "score": 2,
            "author": "rumpots420"
        },
        {
            "level": 0,
            "comment": "I would like to see one of Australian states, I have a rough idea as an Aussie but it would be cool to see",
            "score": 2,
            "author": "Cheesycumhole"
        },
        {
            "level": 0,
            "comment": "Amazing how well that border works between the US and Mexico.",
            "score": 2,
            "author": "StinkF1sh"
        },
        {
            "level": 0,
            "comment": "Is the US not included in \"worldwide\" already?",
            "score": 2,
            "author": "DarkenedSkies",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What the fuck France?",
            "score": 2,
            "author": "Top_Mind_On_Reddit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Woo low danger in Canada. Just gotta avoid the moose and bears mainly. Moose can total your car easily in a accident.",
            "score": 2,
            "author": "RosabellaFaye",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd rather go camping in Australia than Canada. Bears scare me more than spiders",
                    "score": 3,
                    "author": "Vharlkie",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That’s the same problem in Australia, which is why you will see most of our cars and trucks are all fitted with massive Bull Bars and Roo bars.\n\nCommon animals we have that cause collisions every day:\nKangaroos \nEmus\nWombats\nCattle \nHorses\nCows\nPigs\nCamels\nBuffalo \nGoats\nFoxes\nRabbits \n\nOther impacts:\nEagles\nOwls\nParrots \n\nIt’s devastating how much wildlife gets killed through road networks across the world 😢",
                    "score": 2,
                    "author": "Doc-Bob-Gen8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cool how the venomous animals know the state boundaries.",
            "score": 2,
            "author": "bonmarky"
        },
        {
            "level": 0,
            "comment": "It’s funny cause I am Australian but I never run into anything deadly. \nThe most venomous thing I have come across was a red back ONE time but it was out in a shed so didn’t have to be near it. \nI feel like people think we’re running into things that can kill us every day.",
            "score": 2,
            "author": "Haellecarn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Australians all let us rejoice",
            "score": 2,
            "author": "Thatkidwith_adhd"
        },
        {
            "level": 0,
            "comment": "Proud to call Australia home. Haha.",
            "score": 2,
            "author": "Due-Spray-5312"
        },
        {
            "level": 0,
            "comment": "Straya",
            "score": 2,
            "author": "No-Mail-3154"
        },
        {
            "level": 0,
            "comment": "Now do countries with animals that will eat you.",
            "score": 2,
            "author": "Pythia007"
        },
        {
            "level": 0,
            "comment": "Australia: 21 of the top 25 deadliest snakes live here.\n\nMap: let us introduce you to this special shade of black",
            "score": 2,
            "author": "W2ttsy"
        },
        {
            "level": 0,
            "comment": "Yep and Australia is just the one colour, sounds about right",
            "score": 2,
            "author": "tfgdj94"
        },
        {
            "level": 0,
            "comment": "Lmao 🤣  Australia.",
            "score": 2,
            "author": "RookH1"
        },
        {
            "level": 0,
            "comment": "I feel Australian needs its own colour, for better representation",
            "score": 2,
            "author": "notathrowawayreelly"
        },
        {
            "level": 0,
            "comment": "Death by cold weather or venomous animals? The choice is yours.",
            "score": 2,
            "author": "kugelamarant"
        },
        {
            "level": 0,
            "comment": "Haha good olde Australia 🇦🇺🖤🖤🖤",
            "score": 2,
            "author": "MarjinZamasuLSD"
        },
        {
            "level": 0,
            "comment": "The Australian Government blocked a episode of Pepa Pig as the episode said spiders were not that dangerous. Uhhhhh not here.",
            "score": 2,
            "author": "DrakeAU"
        }
    ]
}