{
    "id": "148d56k",
    "score": 1185,
    "title": "European country names in Irish",
    "author": "MMChelsea",
    "date": 1686655575.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/148d56k",
    "media_urls": [
        "https://i.redd.it/no9o13gtsr5b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Léarscáil iontach, rud nua a chuir ar an mballa.",
            "score": 73,
            "author": "No_Wrap_5711",
            "replies": [
                {
                    "level": 1,
                    "comment": "Go raibh míle, cé nach bhfuil sé an léarscáil is slachtmhaire, deacair chun chur gach tír isteach uirthi!",
                    "score": 41,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "An deacair chun na logainmneacha a tá ann a dhéanamh. Anois tá ort an domhan a dhéanamh 😂",
                            "score": 25,
                            "author": "No_Wrap_5711",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hahaha, anois bheadh sin ina praiseach ceart! B'fhéidir go mbainfidh mé triail as mar sin féin.",
                                    "score": 18,
                                    "author": "MMChelsea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This map has been posted in a few languages already so I'd say someone might do it eventually.",
                                                    "score": 10,
                                                    "author": "No_Wrap_5711"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "There are a couple of those already if you search for them.",
                                                    "score": 1,
                                                    "author": "AemrNewydd"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "edit: The comment below was removed and the user banned, good work everyone!",
                                            "score": 1,
                                            "author": "SpambotSwatter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bad bot, it's just a new account - nothing related to spam or sales",
                                                    "score": 0,
                                                    "author": "XxsilverboiiiixX"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I swear I feel like I am reading some kind of a completely fictional high-elvish language right now.\n\nIt looks aesthetically and artistically pleasing indeed.\n\n(Although I bet the set of rules regarding the orthography would be a serious issue for the natives and foreigners alike.)",
                    "score": 16,
                    "author": "Sehirlisukela",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "bh makes a v sound, so does mh sometimes, though it can also make a w, or m sound or a u sound depending on accent and dialect. the language is missing a few letters so it uses combined letters to get to those sounds if you see an s in the middle of a word, its usually supposed to be a shhh noise, but not always",
                            "score": 11,
                            "author": "Spiderkite"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "man i wish i can understand Irish Gaelic, but anyways Erin Go Bragh! UP THE RA! 🇮🇪🍀",
                    "score": -15,
                    "author": "PeterTheSad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "man i wish i can understand Japanian, but anyways Dai Nippon Teikoku Banzai!",
                            "score": 4,
                            "author": "mtkveli"
                        },
                        {
                            "level": 2,
                            "comment": "What the fuck.",
                            "score": 13,
                            "author": "anonbush234"
                        },
                        {
                            "level": 2,
                            "comment": "🙄",
                            "score": 9,
                            "author": "94727204038"
                        },
                        {
                            "level": 2,
                            "comment": "supporting a horrific paramilitary organisation, excellent",
                            "score": -15,
                            "author": "tint-in",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a pretty superficial analysis of like 100+ years of Irish history, and the many iterations of the IRA 👌",
                                    "score": 24,
                                    "author": "Salty-Finish-8931",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And it's been *many* iterations since they were anything but gangsters and terrorists.",
                                            "score": 4,
                                            "author": "Lazerhawk_x"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "when has ‘up the ra’ been used to refer to absolutely anything aside from the PIRA",
                                            "score": 1,
                                            "author": "tint-in"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No one is screaming up the RA today about anyone but the provos, same story for the UVF",
                                            "score": -2,
                                            "author": "anonbush234"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Depends which iteration of the IRA you are talking about, it was the official army of Ireland, the paramilitary organisation is the provisional or pIRA for short.",
                                    "score": 3,
                                    "author": "FreyBentos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "‘up the ra’ is essentially only used to refer to the pira",
                                            "score": 2,
                                            "author": "tint-in"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "STOP SUMMONING CTHULLU!",
                    "score": 1,
                    "author": "karalamakagidi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Too late, look behind you",
                            "score": 1,
                            "author": "No_Wrap_5711",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "uuuuoooooooghh octobus bussy! EEEEEGGZZ! \n*Warps to a timeless antimaterial plane*",
                                    "score": 1,
                                    "author": "karalamakagidi"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m Swiss but all of a sudden I feel like Elvis.  Ohhh yeaaahhh",
            "score": 70,
            "author": "MIOTA_CH",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahaha glad you like it :D",
                    "score": 14,
                    "author": "MMChelsea"
                },
                {
                    "level": 1,
                    "comment": "The name sounds like Edelweiss. Is that the reason for it?",
                    "score": 1,
                    "author": "zoobook642",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Switzerland’s Latin name was Confoederatio Helvetica. I’m assuming Eilveis is derived from Helvetica.",
                            "score": 8,
                            "author": "DatuSumakwel7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm dutch, and Ísiltír sounds like a fairytale land, I love it!",
            "score": 31,
            "author": "jhvankesteren",
            "replies": [
                {
                    "level": 1,
                    "comment": "It means the low land and it’s pronounced “ee shell tear” (tear as in what comes out of your eyes when you cry)",
                    "score": 29,
                    "author": "bee_ghoul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the phonetic pronunciation. It is very much appreciated.",
                            "score": 16,
                            "author": "jhvankesteren"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's cool! Literally means 'low country'.",
                    "score": 15,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I figured Tìr meant land because of \"Tìr na nóg\". I love learning (about) languages.",
                            "score": 13,
                            "author": "jhvankesteren",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In Scots Gaelic its \"an Olaind\" \n\nIt means Holland. 🙃",
                                    "score": 6,
                                    "author": "LochLowry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Many countries called us a version of Holland, but those are just two of our 12 provencies.\nIt's why I'm so pleased with he Irish name.",
                                            "score": 5,
                                            "author": "jhvankesteren"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, same word for both. I love languages too!",
                                    "score": 3,
                                    "author": "MMChelsea"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ISILDUUUUR",
                    "score": 10,
                    "author": "Rybentor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately, our King does not resemble one from Isildurs line, haha.",
                            "score": 1,
                            "author": "jhvankesteren",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He grew a beard though",
                                    "score": 1,
                                    "author": "Wachoe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Of all the translations I've heard for our country, I think this one sounds the best by far.",
                    "score": 5,
                    "author": "Skroopy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, and it's not a version of \"Holland\".",
                            "score": 2,
                            "author": "jhvankesteren"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm an Irish language speaker, a few points of note. The definite article is used in country names with the exception of a small few. Italy for example is \"An Iodáil\", not Iodáil. Ireland, Scotland and England do not use the definite article. England is Sasana, Scotland is Albain and Ireland is Éire.\n\nThere is a very nuanced distinction for Northern Ireland. In the south, we often say **Tuaisceart na hÉireann** (The North of Ireland), but **Tuaisceart Éireann** is \"Northern Ireland\". It really just depends on what your political views are or if you see the island of Ireland as a single nation or not. I tend to use Tuaisceart na hÉireann.\n\nSome of those place names are not countries.\n\nI do love the place name for Newfoundland, as it's the only country (or land) outside of Ireland with a native Irish name. Talamh an Éisc (Land of the fish). Lots of Irish fisherman migrated there in the 1700 and 1800's due to the plentiful shoals of fish in its waters and they came from regions of Ireland which were Irish speaking.",
            "score": 54,
            "author": "FatherHackJacket",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah somebody else mentioned that to me, I know 'an' should be used in the vast majority of cases, but I left it out as I felt it might be confusing to non-speakers. Probably should have left it there, fair point. I know that some of the places are simply seeking independence rather than being countries in any sense and some are dependencies - I just wanted to have as many place names as I could on the map. Ní raibh a fhios agam faoi Thalamh an Éisc - sin an-suimiúil. Go raibh míle as do leideanna!",
                    "score": 9,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ná habair é! :)",
                            "score": 5,
                            "author": "FatherHackJacket"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wonder why it's 'talamh' rather than 'tír'. Wouldn't talamh translate as ground rather than land.",
                    "score": 4,
                    "author": "Amberleaf30",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Talamh doesn't just translate as ground, it can also mean land or earth. Also Tír na hÉisc just wouldn't make much sense. Fish don't have countries. It's more a reference to the land adjacent to where the fish are plentiful.",
                            "score": 13,
                            "author": "FatherHackJacket"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ngl Land of the Fish is hilarious.",
                    "score": 8,
                    "author": "StupidBloodyYank"
                },
                {
                    "level": 1,
                    "comment": "Do you mind if I ask how you pronounce the little h's and t's before the start of a letter (like hÉireann)? Always wondered that.",
                    "score": 2,
                    "author": "Gagulta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "H is pronounced as you'd expect it :)",
                            "score": 3,
                            "author": "FatherHackJacket"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not a political view - Northern Ireland is a place with established borders and there is an expression for it. If you refer to Northern Ireland by the wrong one it is just wrong and you are being deliberately wrong for political reasons because you refuse to respect the established borders.",
                    "score": -18,
                    "author": "escoces",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't really understand the Irish psyche. Our country was partitioned against the wishes of the majority of people here. We don't dispute that the North is a part of the UK. But nations and states are two different things. A nation is not just defined by legal borders, but by common shared culture, language, history, etc.\n\nFor example - when East and West Germany were divided, were they two distinct different nations? No.\n\nYou can use whatever terms you like, but you won't dictate what terms we use for our own island. Especially in my own language where the majority of speakers use the term I mentioned.",
                            "score": 15,
                            "author": "FatherHackJacket",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If we didn't use partitions and only vote with all island majorities then England could dictate that Scotland and Wales could cease to exist.  Self determination should come from the people themselves and not the surrounding people's.",
                                    "score": -10,
                                    "author": "anonbush234",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not a fair comparison however as Ireland wasn't just an island, it was a single country, a single nation. Scotland and England are two different nations, part of a union of countries. Not the same thing. \n\nAnd if you want to break it down into a regional matter, the majority of counties in Ulster were of an Irish nationalist majority (5 out of 9) in the 1918 Irish elections. \n\nSo there was no mandate to partition Ireland and in fact, it caused more harm than it resolved. Which is why still to this day, you have 20 feet high walls separating communities and segregated schooling in 2023.",
                                            "score": 10,
                                            "author": "FatherHackJacket",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There was a time when Ireland was also not a single nation that northern England and lowland Scotland were more of a single country than anywhere else in Britian. \n\nIreland was only truly united as part of the UK before then there was on dubious claims to a single entity nation. \n\nThe unionists in NI as it is partitioned were certainly majority, regions change and do so regularly. It's happened several times across the water without any problems. \n\nAnd there is no way you can guarantee that partition caused more harm. \n\nAt the end of the day it's not a simple decision. You can't argue for self determination for the Irish and then not for the Brits. Especially when you take the rest of the world into consideration you will eventually find yourself to be a hypocrite",
                                                    "score": -8,
                                                    "author": "anonbush234",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You're just parroting fallacious loyalist talking points at this stage. \n\nIreland has been a single nation for millennia. It may have had smaller kingdoms under a High King, but find me a single historic map that shows Ireland as anything other than a single nation. Go ahead, you won't find one. \n\nIt was occupied by a single people, with a single culture, shared laws and a single language. That is what a nation is. \n\nEngland was fragmented, because it was a bunch of different groups of people all vying for the same land. This was not the case for Ireland. It was occupied for over 1000 years by Gaels prior to the arrival of Vikings and Normans. \n\n&gt;The unionists in NI as it is partitioned were certainly majority\n\nThey were a majority in 4 of the 6 counties of the current state of NI. But they were not a majority in Ulster. If you were to argue the creation of a partitioned state, then why include 2 counties that clearly did not have a unionist majority?",
                                                            "score": 8,
                                                            "author": "FatherHackJacket"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ireland the country shares it’s name with Ireland the island for a reason. We view the island as one nation. We respect the border to preserve peace but at least 80% of the island is in agreement on this, and virtually every Irish speaker. \n\nThe holdouts will come around soon.",
                            "score": 14,
                            "author": "Trailer_Park_Jihad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fine if you have political opinions but it's wrong to say that these two expressions mean the same thing - one is correct and one is wrong. If i have the moist notion that all of ireland is part of the uk then it doesn't make me saying southern ireland to mean what is the country of ireland correct.",
                                    "score": -13,
                                    "author": "escoces",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your comparison is fallacious. Nobody stated the north wasn't in the UK. It clearly is. But we don't view the notion of state and nation being entirely synonymous and our language isn't constricted by your rigid definitions and world view. \n\nMost speakers here say Tuaisceart na hÉireann. That's not going to change anytime soon.",
                                            "score": 9,
                                            "author": "FatherHackJacket",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If they are referring to Northern Ireland (capitals) then it's wrong. If they are referring to anything on the top half of the island they could be correct. \n\nFunny, the black lines on your drawing seem to draw the exact borders of Northern Ireland. \n\nIt's quite funny, i'm talking about a named area which is defined and accepted by your country and mine, the EU, the UN, etc but which you are pointedly and deliberately using the wrong name for political reasons and you are saying that it is me who is constricted by blinkered world view.\n\nI'm not saying most people there don't use it, i'm saying that it is an incorrect term.\n\nAnd yet the same people get precious about the term \"British Isles\", which i do not use by the way.",
                                                    "score": -9,
                                                    "author": "escoces",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And nobody seems to be disputing the legally Northern Ireland is a part of the UK. It clearly is. What we are discussing is the concept of a nation, and how it doesn't always completely overlap with a legally defined state. \n\nTo most Irish people, we view the entire island as the Irish nation and that is reflected in our language. \n\nLook at Native-American tribes where their tribal nations span the borders of both Canada and the US. They have names in their native languages for the lands of their tribe, that won't directly correlate with the legal names for the US or Canada. Are you suggesting they stop using the native names for their lands, because they aren't legally defined sovereign states?",
                                                            "score": 10,
                                                            "author": "FatherHackJacket",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have not said nobody should use it, but this is a map where that incorrect term (this is not a langauge issue) is used to refer to a piece of land marked out by a border of a place which had a different name. You said yourself that there is a word for Northern Ireland but that most people prefer to use the descriptive term rather than use the name.\n\nI don't see any similarity to the native american tribes you talk about. I've haven't seen a map where they incorrectly describe another established area's border as their nation, but maybe you have examples.",
                                                                    "score": -2,
                                                                    "author": "escoces",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Native-American reservations are viewed as nations. Many reservations span the US/Canada or US/Mexico borders. They have an degree of sovereignty but aren't completely sovereign. And in their indigenous languages, they have their own names for their lands. \n\nSo they see their lands which may span multiple countries as their **nation**. In the same respect, Irish people often see the island of Ireland as our **nation** and that is reflected in our language.\n\nI was the one who initially pointed out the distinction between Tuaisceart na hÉireann and Tuaisceart Éireann to give a balanced view on naming for the region. I don't care if anybody uses the latter, I don't police the names people use for places. Remember, Irish didn't even receive official status until last year in Northern Ireland. It took a century to receive it, despite the region once being the heartland of Gaelic Ireland.",
                                                                            "score": 6,
                                                                            "author": "FatherHackJacket"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hence this island has the joys of things like Stroke City (Derry/Londonderry)",
                            "score": 1,
                            "author": "FingalForever"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What happened to Czech Republic??",
            "score": 51,
            "author": "MercatorLondon",
            "replies": [
                {
                    "level": 1,
                    "comment": "'Poblacht' is Republic, 'na' is used here to mean \"of the\", and Seice is used to mean the Czechs. So, Republic of the Czechs :)",
                    "score": 82,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "**Seic** (or *an tSeic*) is also valid.",
                            "score": 21,
                            "author": "CharMakr90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah ok, didn't know that. Thanks!",
                                    "score": 7,
                                    "author": "MMChelsea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shouldn’t there be a ‘An’ before many of the countries. i.e An Rúis instead of Rúis",
            "score": 10,
            "author": "RaiderOfSolace",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah you're absolutely right there should indeed for the vast majority of these, however I've left it out here as I thought it might be a bit confusing for non-speakers.",
                    "score": 19,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well the whole map is confusing for non-speakers. ;)\n\nTá beaganín Gaeilge agam",
                            "score": 10,
                            "author": "Panceltic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha very true. Ah, sin iontach le cloisteáil :)",
                                    "score": 7,
                                    "author": "MMChelsea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wales’s name is interesting to me",
            "score": 11,
            "author": "Maxmutinium",
            "replies": [
                {
                    "level": 1,
                    "comment": "Means 'Little Britain'. Genuinely not sure where that comes from, seems to be somewhat related to Ptolemy's naming of the British Isles.",
                    "score": 22,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Think it may relate to Brittany being the other larger country speaking a 'Briton' language",
                            "score": 5,
                            "author": "arnodomina",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah ok, that's interesting.",
                                    "score": 3,
                                    "author": "MMChelsea"
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s likely because it’s derived from the Britons, who would become the welsh. It’s not named after Brittany - Brittany is named after the Britons too.",
                                    "score": 3,
                                    "author": "ExoticMangoz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Speaking of which, it'd be interesting to have the Irish name for Brittany as well.",
                                            "score": 2,
                                            "author": "Rhosddu"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Artsakh, Transnistria, Abkhazia, South Ossetia and Northern Cyprus are all intriguing inclusions, considering that none of them are recognised by Ireland",
            "score": 57,
            "author": "tint-in",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I know what you mean. It's not that I have any opinion on them one way or the other. Just wanted to to include as many places as possible :) e.g. I have also included the Faroes and the Channel Islands etc.",
                    "score": 39,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why does everything have -ain in the end",
            "score": 21,
            "author": "SamuraiJosh26",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it's 'lainn' at the end, it's a Gaelicisation (English word to Irish) of 'land'. If it's 'áin', that's a suffix used instead of 'ia'.",
                    "score": 44,
                    "author": "MMChelsea"
                },
                {
                    "level": 1,
                    "comment": "Pain",
                    "score": 2,
                    "author": "mannenavstaal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like that the Netherlands is more of a direct translation instead of being based on the English name.",
            "score": 6,
            "author": "YoIronFistBro",
            "replies": [
                {
                    "level": 1,
                    "comment": "For sure, it's way more interesting that way.",
                    "score": 3,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does Sasana for English derive from Saxony?",
            "score": 3,
            "author": "NikolaiSoerensen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spot on!",
                    "score": 5,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is fun, I don't often see Irish words that are such clear cognates with Welsh (yr Alban for Scotland, Ffrainc for France, Isildiroedd for the Netherlands, yr Eidal for Italy)",
            "score": 4,
            "author": "Pretty_Trainer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah that's cool. The definite article 'an' is also used in most Irish country names, I just omitted it here to avoid confusion (and due to space constraints! :)",
                    "score": 3,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP Herzegovina",
            "score": 4,
            "author": "VegetaSpice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha space constraints! For the record it's Heirseagaivéin!",
                    "score": 6,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Irish is my dream language along with Greek. A language I wish to learn one day. I know they are very different, but both Ireland and Greece attract me a lot. I think the reason for my interest is very clear when I look at this map. It looks very aesthetic.",
            "score": 12,
            "author": "derBardevonAvon",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's so great to hear! I love our language :)",
                    "score": 10,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I definitely in love with Irish and I hope this musically mellifluous language will regain its former prominence in Ireland.",
                            "score": 4,
                            "author": "derBardevonAvon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In Irish, England is Satana, no surprise there\n\n/s",
            "score": 3,
            "author": "Mauri_op",
            "replies": [
                {
                    "level": 1,
                    "comment": "**Sassanach** is a mild insult when referring to the English.",
                    "score": 6,
                    "author": "DanGleeballs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So the insult for English is calling them Saxons (German)?",
                            "score": 4,
                            "author": "anonxotwod",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ta (Yes)",
                                    "score": 2,
                                    "author": "DanGleeballs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*Tá (Is)\n\n*I know this is pedantic but I couldn’t help myself*",
                                            "score": 5,
                                            "author": "BananaDerp64"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The math is mathin’",
                            "score": 1,
                            "author": "Mauri_op"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is rud íontach é! Ar rugadh tú i hÉireann?",
            "score": 3,
            "author": "_Nova26_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sea, táim as Chill Channaigh!",
                    "score": 3,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, go híontach. Táim as Cill Mhantáin",
                            "score": 3,
                            "author": "_Nova26_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Níl sé seo ceart ar chor ar bith. Cá bhfuil an t-alt?",
            "score": 3,
            "author": "Faelchu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tá a fhios agam cad atá á rá agat, ach d'fhág mé an t-alt amach mar cheap mé go mbeadh sé mearbhlach do neamhchainteoirí. B'fhéidir gur chóir dom é a fhágáil isteach ach táim amháin ag baint triail as éirim a thabhairt dóibh dár teanga.",
                    "score": 4,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ach, tá an t-alt fós le feiceáil i bPoblacht *na* Seice...",
                            "score": 2,
                            "author": "Faelchu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ceart go leor, ach cheap mé nach féidir liom cuid lárnach den ainm a fhágáil amach. Tá a fhios agam go bhfuil an 'an' tábhachtach freisin nuair atá tú ag labhairt nó ag scríobh, ach is dócha gur foirm athraithe den bhunainmhfhocal é.",
                                    "score": 3,
                                    "author": "MMChelsea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The word for Switzerland reminds me of Edelweiss. \n\nAnd what's the story behind Norway?",
            "score": 3,
            "author": "thatguyfromvienna",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh true, actually. It comes from Helvetia, which I believe is the personification of Switzerland. \n\nI didn't know about Norway, so this is stolen from u/Faelchu on another post:\n\nNorway's name in Irish is \"an Iorua\". An Iorua comes from Middle Irish \"Irúaith\". This in turn was borrowed from Hǫrð(a), plural Hǫrðar. The Hǫrðar were a Norse tribe anglicised in Irish literature as Haereth and in other English literature as the Harudes or Charudes and Gaelicised as Iruaid and Iruath. Many Irish placenames simply adopted the tribal name of the area as the name for the geographic entity, cf. Connachta = Connacht/Connaught, Laigin = Leinster, Ulaidh = Ulster, Sasainn/Sacsainn/Sasanaibh = Sasana = England, etc. Hǫrð(a) &gt; Iruaid &gt; Irúaith &gt; Iorua.\r  \n\r  \nMeanwhile, the Norse Hǫrðaland later became Norwegian Hordaland, a county or fylke in southwest Norway with its municipal seat in Bergen.",
                    "score": 4,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you so much for the insight.",
                            "score": 1,
                            "author": "thatguyfromvienna",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No problem!",
                                    "score": 1,
                                    "author": "MMChelsea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the first one I've seen to have Scotland separate fae an all over \"Britain\" type name, so cheers for that mate!",
            "score": 3,
            "author": "WaltVinegar"
        },
        {
            "level": 0,
            "comment": "I wonder if Turkey is pronounced as “Twerk”. 🤔",
            "score": 5,
            "author": "Darth-Vectivus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not quite haha, just like 'Turk'.",
                    "score": 9,
                    "author": "MMChelsea"
                },
                {
                    "level": 1,
                    "comment": "It’s pronounced exactly like the first syllabal is in English “Turk”",
                    "score": 2,
                    "author": "bee_ghoul"
                }
            ]
        },
        {
            "level": 0,
            "comment": "upvote for including Scotland",
            "score": 4,
            "author": "Patient-Shower-7403",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scotland is Albain, not Alba. The OP got that wrong. Alba is a poetic name in Irish while being the Scottish Gaelic name. But the official name in Irish is simply Albain. Most of the placenames here are actually wrong as they don't include the definite article. Unlike in English, the definite article in Irish is a requirement for placenames and should never be omitted.",
                    "score": 8,
                    "author": "Faelchu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh shit, I didn't know since Alba would be right in Scottish Gaelic. thanks for letting me know",
                            "score": 1,
                            "author": "Patient-Shower-7403"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Desperately wanted to find something to pick you up on there, OP, but you're good!",
            "score": 2,
            "author": "pumpkinguyfromsar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahaha thank you! Unfortunately Alba should be Albain!",
                    "score": 3,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do welsh if you dare",
            "score": 2,
            "author": "Amockdfw89",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would need to brush up on my Cymraeg for that I'm afraid ;)",
                    "score": 3,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Better then me haha. Out of curiosity of my heritage I tried learning Scottish Gaelic (self taught) and it was definitely a mouthful for me. Then further research I found out my maternal ancestors were from Ulster so they wouldn’t have spoken Gaelic regardless.\n\nI took several years of Mandarin and found it easier then Gaelic. The Chinese writing system is definitely hard but the grammar is super easy and simple. People say Mandarin is hard because of the tones but if you master the tones and the pinyin Latin alphabet system you can basically teach yourself.\n\nGaelic grammar seems similar to Arabic in that verbs and pronouns change considerably depending on the tense, situation, who is talking to who, plural non plural etc. not like Romance or Latin based languages where verbs and stuff have a simple algebraic like formula to follow",
                            "score": 2,
                            "author": "Amockdfw89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's very cool. I should add I have no Welsh to begin with :) That's really interesting about Mandarin! The different cases are definitely a difficult part of Irish and are I find they are often where people trip up in exams. I'm learning Spanish and I would agree, I cannot believe how much easier it is than Irish.",
                                    "score": 3,
                                    "author": "MMChelsea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea. In Spanish  memorize verb endings for present, past and future tenses and you are like 75% there. There are exceptions with weird conjugations, but those are far and few between. Once you master Spanish then Italian, Portuguese and even French become much easier since they more or less have the same grammar as Spanish",
                                            "score": 1,
                                            "author": "Amockdfw89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah exactly. Really should have chosen French as well as Spanish in school but at the time I thought two similar languages would be too much.",
                                                    "score": 1,
                                                    "author": "MMChelsea"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First of all, Éire go Brách!\n\nSecond, I love how you say Greece! How is it pronounced?",
            "score": 2,
            "author": "Obnoobillate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha go raibh míle maith agat! Greece is pronounced 'Grayg'.",
                    "score": 5,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you pronounce: Ísiltír? Had to giggle because of Portugal because geil means horny in Dutch.",
            "score": 2,
            "author": "crapaporter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh right haha! Ísiltír is pronounced \"EESH-il-teer\".",
                    "score": 5,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Awesome thnx",
                            "score": 1,
                            "author": "crapaporter"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cianar a tha sibh?",
            "score": 2,
            "author": "fnuggles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ceart go leor, go raibh maith agat :)",
                    "score": 2,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Since no-one's quite sure of the etymology of the name 'Faeroe Islands' (may or may not mean 'Sheep Islands'), what's the meaning of *Na Scigiri*?",
            "score": 2,
            "author": "Rhosddu",
            "replies": [
                {
                    "level": 1,
                    "comment": "Na Scigirí possibly comes from the Eyja-Skeggjar, meaning island-beards, which was a nickname given to the Faroese.",
                    "score": 3,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a ruisan from Ruis... Norm",
            "score": 2,
            "author": "SchemeCapital"
        },
        {
            "level": 0,
            "comment": "There is no such country as Transnistria (PMR)",
            "score": 6,
            "author": "dmt_r",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed - it's not that I support them or anything, simply wanted to put as many places as possible on the map.",
                    "score": 13,
                    "author": "MMChelsea"
                },
                {
                    "level": 1,
                    "comment": "Not yet.",
                    "score": -8,
                    "author": "Scottland83"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can someone find one in Welsh?",
            "score": 2,
            "author": "beatbox2sleep"
        },
        {
            "level": 0,
            "comment": "Transnistria is not a country. They are a Russian-occupied territory of the Republic of Moldova.",
            "score": 2,
            "author": "Awesome_Romanian",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. Believe me - I would not support anything that's a puppet of this Russian government. Simply wanted to put as many places on the map as I could.",
                    "score": 2,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey everyone an other mildly interesting map for us why we wait for the blackout to be over",
            "score": 1,
            "author": "grosbatte"
        },
        {
            "level": 0,
            "comment": "Does this mean that Albion from a Irish perspective is Scotland? or the remnant of Celtic Britan?",
            "score": 1,
            "author": "45711Host",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, that's a mistake actually, Alba is Scottish Gaelic. Should be Albain in Irish. But same thing applies, yeah, original Gaelic speakers used the name Alba, which had been used to refer to the whole of Britain, to refer to the kingdom of the Picts who lived in Scotland.",
                    "score": 5,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "awesome thank you for the explanation",
                            "score": 2,
                            "author": "45711Host",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No problem :)",
                                    "score": 2,
                                    "author": "MMChelsea"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Alba, Albain, is the kingdom of the Irish tribe the Scotti...",
                            "score": 1,
                            "author": "JasterBobaMereel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/irelandonreddit] [\\[r\\/MapPorn\\] European country names in Irish](https://www.reddit.com/r/IrelandonReddit/comments/148gjt0/rmapporn_european_country_names_in_irish/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "score": 1,
            "author": "TotesMessenger"
        },
        {
            "level": 0,
            "comment": "It looks like every A has turned into AI.",
            "score": 1,
            "author": "yimia"
        },
        {
            "level": 0,
            "comment": "I will do a Turkish version to that, enough!",
            "score": 1,
            "author": "soul_nessie"
        },
        {
            "level": 0,
            "comment": "Does the irish name for Norway mean the same as in english?\nWould Iceland then be \"Northisle\"?\nThanks for posting!",
            "score": 1,
            "author": "Eutrophy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have to admit that I didn't know this so this is stolen from u/Faelchu on another post: Norway's name in Irish is \"an Iorua\". An Iorua comes from Middle Irish \"Irúaith\". This in turn was borrowed from Hǫrð(a), plural Hǫrðar. The Hǫrðar were a Norse tribe anglicised in Irish literature as Haereth and in other English literature as the Harudes or Charudes and Gaelicised as Iruaid and Iruath. Many Irish placenames simply adopted the tribal name of the area as the name for the geographic entity, cf. Connachta = Connacht/Connaught, Laigin = Leinster, Ulaidh = Ulster, Sasainn/Sacsainn/Sasanaibh = Sasana = England, etc. Hǫrð(a) &gt; Iruaid &gt; Irúaith &gt; Iorua.  \nMeanwhile, the Norse Hǫrðaland later became Norwegian Hordaland, a county or fylke in southwest Norway with its municipal seat in Bergen.",
                    "score": 5,
                    "author": "MMChelsea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "so many \"i\" s",
            "score": 1,
            "author": "ozybu"
        },
        {
            "level": 0,
            "comment": "Huh, I thought England in Irish was the sound of spit hitting the ground.",
            "score": 1,
            "author": "WayneSkylar_"
        },
        {
            "level": 0,
            "comment": "Iorua?",
            "score": 1,
            "author": "dude_im_box",
            "replies": [
                {
                    "level": 1,
                    "comment": "From u/Faelchu:\n\nNorway's name in Irish is \"an Iorua\". An Iorua comes from Middle Irish \"Irúaith\". This in turn was borrowed from Hǫrð(a), plural Hǫrðar. The Hǫrðar were a Norse tribe anglicised in Irish literature as Haereth and in other English literature as the Harudes or Charudes and Gaelicised as Iruaid and Iruath. Many Irish placenames simply adopted the tribal name of the area as the name for the geographic entity, cf. Connachta = Connacht/Connaught, Laigin = Leinster, Ulaidh = Ulster, Sasainn/Sacsainn/Sasanaibh = Sasana = England, etc. Hǫrð(a) &gt; Iruaid &gt; Irúaith &gt; Iorua.\r  \n\r  \nMeanwhile, the Norse Hǫrðaland later became Norwegian Hordaland, a county or fylke in southwest Norway with its municipal seat in Bergen.",
                    "score": 5,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey I live in that",
                            "score": 2,
                            "author": "dude_im_box",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh really! That's cool.",
                                    "score": 2,
                                    "author": "MMChelsea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its the Cumbria of Norway with the pride of Yorkshire",
                                            "score": 1,
                                            "author": "dude_im_box"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "póg mo thoin",
            "score": 1,
            "author": "spiderman537626"
        },
        {
            "level": 0,
            "comment": "Now how do Americans that think they are Irish say them?",
            "score": 1,
            "author": "UnderstandingHot3053"
        },
        {
            "level": 0,
            "comment": "England, Scotland, Wales, Northern Ireland, the Isle of Man, Jersey, Guernsey, Gibraltar, Aland, the Faroe Islands and Greenland are not countries",
            "score": -4,
            "author": "chl_ca",
            "replies": [
                {
                    "level": 1,
                    "comment": "Neither are Abkhazia, Transnistria or South Ossetia etc. England, Scotland, Wales, Northern Ireland, Greenland and the Faroe Islands are constituent countries. Just wanted to add as many place names as I could to the map :)",
                    "score": 3,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "these are not comparable \n\nAbkhazia and South Ossetia are actually recognized by 4 UN member states (Russia, Venezuela, Nicaragua and Nauru) whereas Transnistria and Artsakh/Nagorno-Karabakh are breakaway states that are recognized by Abkhazia and South Ossetia. all of them claim to be independent and sovereign countries, while every region i mentioned in my previous comment doesn’t \n\nsure, they might have some level of autonomy, but regions like Scotland or the Faroe Islands are not independent countries nor do they even claim to be ones, unlike every other territory mentioned on the map",
                            "score": 1,
                            "author": "chl_ca",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You've been misinformed. England, Scotland and Wales are countries, not regions. They are not, however, currently sovereign states.",
                                    "score": 2,
                                    "author": "Rhosddu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "no, it’s other people who are misinformed \n\nthey think that, because they’re called “countries”, that they’re sovereign states to the same title as Germany or Nigeria, even though they’re not\n\nso there’s 0 reason they should be featured on this map",
                                            "score": -1,
                                            "author": "chl_ca",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're almost correct, but not quite. They are, as you say, countries but not sovereign states. It is highly unlikely, however, that any Scottish, Welsh, or English person is labouring under the illusion that those self-same countries are currently sovereign states.\n\nThe map features all European countries, whether sovereign or non-soverereign.",
                                                    "score": 2,
                                                    "author": "Rhosddu"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Still not countries in any meaningful sense. With only 4 states recognising them (and 3 of these being despotic dictatorships), they hold a tiny amount of international standing. The Home Nations and the Danish constituent countries are countries (agreed that they do not claim to be sovereign states) whether they claim independence or not.",
                                    "score": 1,
                                    "author": "MMChelsea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "still, 2 to 4 is better than 0",
                                            "score": 1,
                                            "author": "chl_ca"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Funny how most of these are consistent with the English names/pronunciations.\n\nEngland/Wales/Scotland and Netherlands, Norway and Switzerland are exceptions though.  \n\nSeeing it's an Irish-related post: one thing I find funny about Irish placenames, is how so many towns have the \"Bally\" prefix, despite \"y\" not even being a letter in the Irish alphabet. Likewise, how many Irish surnames end in \"y\" (Murphy, Kelly, Daly, Casey etc...)",
            "score": -8,
            "author": "whooo_me",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah most of the countries are just Gaelicisations from English. England, Wales and Scotland have native names. Ísiltír means 'low country' for the Netherlands, Eilvéis comes from Helvetia, the personification of Switzerland, and Norway makes sense when you put the definite article in front of it as you would with most country names in Irish - 'an Iorua', which sounds like 'An Nerwa'.\n\nBally is an anglicisation of the Irish word for town, 'baile'. A lot of those Irish surnames end in 'aigh' in Irish, which makes a sound similar to the 'ey' sound at the end of Casey, for example.",
                    "score": 8,
                    "author": "MMChelsea"
                },
                {
                    "level": 1,
                    "comment": "This is not a road many English people would want to travel....",
                    "score": 5,
                    "author": "_Druss_"
                },
                {
                    "level": 1,
                    "comment": "You can say the same about the prefix Kil/Kill. The letter K isn't usually found in Irish.",
                    "score": 3,
                    "author": "YoIronFistBro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Surprised England isn't 'Bastards' considering how much the terminally online Irish talk about the UK. Real life Irish people ofc are extremely nice and polite.",
            "score": -19,
            "author": "StupidBloodyYank",
            "replies": [
                {
                    "level": 1,
                    "comment": "Username checks out",
                    "score": 12,
                    "author": "Trailer_Park_Jihad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "same  \n\nshame you can't understand self-deprecation.",
                            "score": -5,
                            "author": "StupidBloodyYank"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nice username.",
                    "score": 9,
                    "author": "YoIronFistBro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see understanding the humor of self-deprecation is beyond you. Must be nice being a teenager.",
                            "score": -4,
                            "author": "StupidBloodyYank"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Isn’t it Gaelic as it’s still spoken in Scotland too",
            "score": -19,
            "author": "SwedishScoutMafia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scottish Gaelic is related to but not the same as Irish.",
                    "score": 20,
                    "author": "MMChelsea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough, isn’t Alba Scottish Gaelic though? That’s what threw me off",
                            "score": 3,
                            "author": "SwedishScoutMafia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah ok, yes that’s a mistake!",
                                    "score": 1,
                                    "author": "MMChelsea"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Scottish Gaelic and Irish Gaelic are different languages, even if they're very closely related \n\n(From Wikipedia)\nIn English (including Hiberno-English) the language is usually referred to as Irish, as well as Gaelic and Irish Gaelic.[21][22] The term Irish Gaelic may be seen when English speakers discuss the relationship between the three Goidelic languages (Irish, Scottish Gaelic and Manx).[23] Gaelic is a collective term for the Goidelic languages,[7][24][8][10][25] and when the context is clear it may be used without qualification to refer to each language individually. When the context is specific but unclear, the term may be qualified, as Irish Gaelic, Scottish Gaelic or Manx Gaelic. Historically the name \"Erse\" was also sometimes used in Scots and then in English to refer to Irish;[26] as well as Scottish Gaelic.\n\nGoidelic is a synonym of Gaelic, used mainly in linguistic typology and historical linguistics. Goidelic and Brittonic together constitute the Insular Celtic languages.",
                    "score": 6,
                    "author": "Senku_San",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, a good bit of it is mutually intelligible but they're different languages for sure.",
                            "score": 5,
                            "author": "MMChelsea"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No, their different.",
                    "score": 3,
                    "author": "pumpkinguyfromsar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Alba is Scottish Gaelic so it threw me off",
                            "score": 1,
                            "author": "SwedishScoutMafia"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're two separate languages.",
                    "score": 1,
                    "author": "YoIronFistBro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is Irish a language?",
            "score": -24,
            "author": "GGG-Money",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, it's the national language here in Ireland. First language of about 1% of people but we learn it in school for 14 years.",
                    "score": 26,
                    "author": "MMChelsea"
                },
                {
                    "level": 1,
                    "comment": "Tá. (nó sea)",
                    "score": 5,
                    "author": "pumpkinguyfromsar"
                },
                {
                    "level": 1,
                    "comment": "Is é Google do chara",
                    "score": 3,
                    "author": "mtkveli"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not even Irish could pronounce these \n\nMajority",
            "score": -30,
            "author": "Tumbleweedae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Um, I could pronounce all of these, as could most people who have studied Irish in school.",
                    "score": 6,
                    "author": "pumpkinguyfromsar"
                },
                {
                    "level": 1,
                    "comment": "They're mostly just pronounced the same as in English, with a few exceptions. And the endings -ia's and -y's are mostly just dropped.",
                    "score": 3,
                    "author": "actually-bulletproof",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah the pronunciations are fairly similar. Only very different ones, I think, are the British and Irish countries, Iorua (Norway), Eilvéis (Switzerland), Ísiltír (Netherlands), and na Scigirí (Faroe Islands).",
                            "score": 3,
                            "author": "MMChelsea"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Beasicly just eadd e's and ain's",
            "score": -6,
            "author": "RomanUngern97"
        }
    ]
}