{
    "id": "e5fgmc",
    "score": 34223,
    "title": "The longest possible train travel in the world",
    "author": "matias90",
    "date": 1575370209.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/e5fgmc",
    "media_urls": [
        "https://i.redd.it/u6k6vghvee241.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\"I need you to book me a train from Portugal to Vietnam, but make sure it goes **around** Mongolia.\"",
            "score": 5570,
            "author": "Calber4",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1216,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1312,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 482,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 739,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 282,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was in a Chinese train car for the whole trip starting in Moscow. That was in 2009.",
                                                            "score": 229,
                                                            "author": "McAroni",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 86,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "i think 5-7 days, don't remember exactly.",
                                                                            "score": 175,
                                                                            "author": "McAroni",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "how were the noodles",
                                                                                    "score": 186,
                                                                                    "author": "atomicspace",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Appears to be about 10 years so far, if my math is correct.",
                                                                            "score": 67,
                                                                            "author": "NoTimeForThat",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hey we may have been on the same train, I went from London to shanghai in the beginning of 2009. Did over about 6 weeks.",
                                                                    "score": 43,
                                                                    "author": "Crypto_dog",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I actually got on the train end of Dec 08, arrived in Beijing on Jan 5 2009 i believe.",
                                                                            "score": 37,
                                                                            "author": "McAroni",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 59,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "what was the landscape like?  nearly a week-long journey sounds like it might get tedious.",
                                                                    "score": 19,
                                                                    "author": "jjolla888",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Nothing special. But i met a couple of other backpackers, a fairly international group, so we spent the time playing cards and drinking and chatting. And i read Dostoyevsky, which went really well with the sad winter landscape.",
                                                                            "score": 69,
                                                                            "author": "McAroni",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Haha, I read Dostoyevsky too on that trip",
                                                                                    "score": 6,
                                                                                    "author": "slackslackliner"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "That sounds like there's a story in there somewhere...",
                                                            "score": 14,
                                                            "author": "omaca",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Man, I just remembered reading a photo blog of guys travelling with transsiberian train to PyongYang. Lots of interesting things along the way including crossing into North Korea where crossing for tourists is forbidden. \n\nI found the blog, surprisingly it's still available: https://vienna-pyongyang.blogspot.com/2008/04/how-everything-began.html\n\nEnjoy.",
                                                                    "score": 6,
                                                                    "author": "wtf_are_you_talking"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Fact that might be myth: Russia uses a different rail gauge from other countries because they were afraid a German or Austrian invader would use the Russian railway network to move troops beyond the Russian border quicker.\n\nEDIT: and before I get more responses to this, ayup, it's myth",
                                                    "score": 77,
                                                    "author": "Jelphine",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is a myth.  \n\nFrom Wikipedia:\n\n&gt;It is widely and incorrectly believed that Imperial Russia chose a gauge broader than standard gauge for military reasons, namely to prevent potential invaders from using the rail system. In 1841 a Russian army engineer wrote a paper stating that such a danger did not exist since railways could be made dysfunctional by retreating or diverting forces. Also the construction of the Warsaw–Vienna railway in 1,435 mm (4 ft 8 1⁄2 in) was precisely so it could be connected to the Western European network, in that case to reduce Poland's dependence on Prussia for transport. Finally for the Moscow – Saint Petersburg Railway, which became the benchmark, the choice of track gauge was between 5 ft (1,524 mm) and the wider 6 ft (1,829 mm), not standard gauge 1,435 mm (4 ft 8 1⁄2 in). However, it was just not selected with that in mind. When a railway has wooden sleepers, it is fairly easy to make the gauge narrower by removing the nails and placing them back at a narrower position, something Germany did during WWII. Destroying river bridges had a larger effect.",
                                                            "score": 71,
                                                            "author": "shingdao",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "According to Wikipedia thats not accurate. It sounds more like the Russians just doing their own thing. They did build several lines in standard 1435mm with the purpose of connecting to Western Europe.",
                                                            "score": 78,
                                                            "author": "dcviper"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes you can go from Ulan-Ude (Russia) to Ulaanbaatar (Capital of Mongolia) and then onward to Beijing, China.",
                                    "score": 16,
                                    "author": "Darthlentils"
                                },
                                {
                                    "level": 3,
                                    "comment": "Then that pretty much means the title is bullshit, right? if the route is already including non-essential detours to make it the \"longest\", then you could make up all kinds of routes snaking up and down Europe to make this path at least 2 or 3 times longer.",
                                    "score": 39,
                                    "author": "bozymandias",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Then that pretty much means the title is bullshit, right? \n\nIt's not like this is anything with any legal repercussions or a contract with anyone or cost anyone anything except a moment of their time.\n\nTo me, it seems reasonably the longest plausible non-stupid rail journey possible. Of course you could make it longer in any number of ways.\n\nIf you had to program an algorithm to calculate the longest route, that would be difficult, in the same way that pornography vs art is hard to define, but most people tend to agree which is which.\n\nThis seems like a reasonable \"longest route\". You can make arguments for different routes with various reasons, but the route here doesn't seem egregiously bent like going up and down and all around would be.\n\n&gt;Then that pretty much means the title is bullshit, right? \n\nSo I mean, if it bothers you *that* much, sure. But it seems reasonable enough to me relative to the importance of trying to calculate with legal precision what a \"longest route\" must be to qualify.",
                                            "score": 45,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It almost seems more like \"The farthest two points that are connected by rail\". Rather than the \"longest route conceivably possible using all rail lines available\"",
                                                    "score": 17,
                                                    "author": "that1prince"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Really like the way you laid out that explanation. I like the cut of your jib sir.",
                                                    "score": 7,
                                                    "author": "40acresandapool"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is no rail service through southern Asia. [But there is a spur line from the Ulan Ulde on the south end of Lake Baikal to Beijing, which cuts out that big detour into northeastern China.](https://www.seat61.com/images/Trans-Siberian-map.jpg)",
                            "score": 67,
                            "author": "olderaccount",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You can also avoid Mongolia by going to China through Central Asia.",
                            "score": 15,
                            "author": "vincentcqd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But is there passenger service on the Kazahkstan-China route? I do know it's increasingly popular for freight trains.",
                                    "score": 22,
                                    "author": "Nine_Gates"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This may intentionally be the longest possible train ride, but it might be better than taking a more direct route.\n\nThis route just goes through 9 countries or 5 visa regions (Schengen area, Belarus, Russia, China, and Vietnam). Also, these crossings are all fairly normal and not associated with any friction. You'd just have to your visas well organised in advance.\n\nThe shortest route (not taking into account if there's even a valid passenger train route through here) would have to go through 13 visa regions (Schengen area, Romania, Ukraine, Russia, Azerbaijan, Iran, Pakistan, India, Bangladesh, Myanmar, Thailand, Cambodia, and Vietnam). Lots of those border crossings are very restricted.",
                    "score": 181,
                    "author": "temujin64",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Myanmar, Thailand, Cambodia, and Vietnam\n\nThere is no railway connection at all between Thailand and Myanmar. The Japanese have built a railway in WWII (Death Railway), but it has been long dismantled and parts are even underwater. \n\nCambodia's railways are barely functional, with very few, if any, passenger trains running. Phnom Penh certainly has no connections to either Bangkok or Saigon. Once upon a time there might have been tracks in place, but most are long gone. \n\nThere's no connection between Myanamar and India or Bangladesh either.\n\nSo, that \"shortest route\" is not really a railway route, and can only be done by using alternative transport for *at least* 3 non-trivial sections. \n\nOddly enough, it *might* have been possible to do the route entirely by train sometime after WWII (perhaps in the 1950s).",
                            "score": 85,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's wild to think that as recently as the mid-70s it was not unusual to just buy a van in Istanbul and drive to India through Iran, Afghanistan, and NWFP in Pakistan.",
                                    "score": 53,
                                    "author": "nsnyder",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've visited the Pudding Shop in Istanbul, it was a place to find travelers like these, and back in the day there was a bulletin board so they could exchange messages/find fellow travelers for their next leg. There are even legends of how a girl and a boy promised to meet there at a time and date to go on their adventure, and one of them never showed...\n\nNowadays the meets would just be arranged over texts...",
                                            "score": 23,
                                            "author": "thaway314156"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Likewise 1970s backpackers would think today's backpackers traipsing through Vietnam, Cambodia, and Laos were absolutely mental.\n\nYou never know where the next peace blooms and where the next war breaks out. Take advantage of travel to a place while you can, you never know when that opportunity slips away.",
                                            "score": 11,
                                            "author": "DavidPuddy666",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;This may intentionally be the longest possible train ride\n\nIt's not - you could add effectively infinite distance by taking an even less direct route - e.g. why not loop in Scandinavia.\n\nWhat it is is the furthest 2 countries connected entirely by rail.  There are lots of different possible routes, though.",
                            "score": 76,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's absolutely *not* the longest train journey, even with that caveat.  You'd be able to add thousands of miles zig-zagging through Europe without using the same track twice.",
                                            "score": 37,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The longest train journey is the one where the train stops mid-way and you live in there for 10 years.",
                                                    "score": 25,
                                                    "author": "odraencoded",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The longest train journey is the one where the train stops mid-way and you live in there for 10 years and 1 day.",
                                                            "score": 5,
                                                            "author": "Tyler1492",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "the longest train journey is the one where you have to ride next to someone who makes these kinds of jokes.",
                                                                    "score": 19,
                                                                    "author": "DerFixer",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"The Mongols have been awfully quite lately, have you noticed? Surely they're up to something.\"",
                    "score": 15,
                    "author": "Der_Arschloch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Training Elite Mangudai and trebs as we speak",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is no train route through the Southern half of Asia available to a passenger",
                    "score": 40,
                    "author": "peter_j_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "In Vietnam I met a scottish guy that had taken trains all the way from Scotland to Vietnam. Apparently it's a pretty big thing among the hard-core train enthusiast crowd.",
            "score": 2141,
            "author": "Petrarch1603",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds incredibly expensive, but then I remember half of his total fare is just getting out of Britain.",
                    "score": 1312,
                    "author": "eunderscore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, from Eastern Europe onwards towards the East, long distance trains get much cheaper. I took a B-class night train from Lviv to Kiev a couple months ago, that's over half the width of this large country and i had a bed, the train was also full, and it cost me 15 euros. I also took a night train north to south in Thailand, and that was dirt cheap as well.\n\nBut granted, when it comes to covering massive distances spanning all of Eurasia, surely, one expensive plane flight is probably cheaper than all the accumulated cheap train fares.",
                            "score": 551,
                            "author": "MartelFirst",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve done most of the Vietnam stretch (36-hour sleeper train from Saigon to Hanoi), and that was like $20-30. Might even be cheaper if you’re a local or a better planner than I am.",
                                    "score": 186,
                                    "author": "DiveBear",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Meanwhile, it's $300 to take a coach seat from New York City to Los Angeles on Amtrak. It also takes 72 hours.",
                                            "score": 21,
                                            "author": "st1tchy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gotta find the non-peak times with deals (relatively speaking) and then get a sleeper. Unfortunately, as I can attest, it seems to always cost almost as much to go through 1/3 of the country (to Chicago) as it does 2/3 (to LA).",
                                                    "score": 14,
                                                    "author": "dumbledorethegrey"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "36 hours on a train from Saigon to Hanoi? That seems excessively long! Are there long stops, train changes and whatnot? Driving by car would be faster for that distance, but I don't know about transportation issues in Vietnam.",
                                            "score": 58,
                                            "author": "MartelFirst",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It was one train for me. Some stops, none long enough to get off. It doesn’t sound like driving would’ve been much faster, though. According to Google Maps, it’s 26 hours/1500 km driving if you cut through Cambodia/Laos or 30 hours/1700 km if you stay in Vietnam. Both of those seem slow, but I don’t know what the roads are like.",
                                                    "score": 62,
                                                    "author": "DiveBear",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Probably safer too, Vietnam is near the top of the list of countries with road deaths",
                                                            "score": 56,
                                                            "author": "fvtown714x",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah because there are thousands of scooters in Vietnam. That'll have some impact on the statistics.",
                                                                    "score": 54,
                                                                    "author": "Not_a_real_ghost",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Other countries have similar population/scooter density in urban areas, so it comes down to the rates per every 100k people. According to WHO, a large part of the deaths in Vietnam are due to traffic laws that are \"not comprehensive in scope\" and \"poorly enforced\". Also things like drunk driving and kids without helmets will add to this.\n\n[Source](https://www.who.int/violence_injury_prevention/road_traffic/countrywork/vietnam_2012.pdf?ua=1)",
                                                                            "score": 15,
                                                                            "author": "fvtown714x",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It costs me £30 to go from Oxford to Southampton on the train, which is about a 65 mile journey.",
                                    "score": 36,
                                    "author": "David98w",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that's ridiculous. I'm from France and could go double the distance by train (Paris-Tours) for half that price. We also get some incredibly \"cheap\" train services for certain routes and certain times, like a Paris-Bordeaux for 18 euros, but only at particularly less-convenient times. Still pretty good. And I think it's thanks to the fact that our trains are subsidized by the government to make them cheaper.",
                                            "score": 20,
                                            "author": "MartelFirst",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can thank privatisation and the Tories for my expensive train travel 😊",
                                                    "score": 37,
                                                    "author": "David98w"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Especially when you take time into account",
                                    "score": 34,
                                    "author": "ASK_ME_IF_IM_YEEZUS",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Plus, factor in the fine for getting a super off peak ticket on the east coast mainline but actually boarding an off peak train on the west coast mainline...",
                            "score": 13,
                            "author": "thatisRON"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trainspotters i guess? I meet some at the Stuttgart main station some years ago. They were running around trying to take pic and write down the numbers of every train. They seemed to have lots of fun!",
                    "score": 135,
                    "author": "Vennemy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lots of trainspotters in Scotland",
                            "score": 129,
                            "author": "Tinie_Snipah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Choose your future. Choose rail.",
                                    "score": 110,
                                    "author": "bigfootsleftnut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But why would I want to do a thing like that?",
                                            "score": 25,
                                            "author": "dayd121",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*and a lust for life*",
                                                    "score": 10,
                                                    "author": "w00t4me"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Choose life.\nChoose a job.\nChoose a career.\nChoose a family,\nChoose a fucking big television.\nChoose ScotRail.",
                                            "score": 12,
                                            "author": "oszillodrom"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hello there.",
                                    "score": 17,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You guys also have dead baby ghosts that crawl on the ceiling. Fuck that.",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know a family that went all the way from Singapore to Scotland without flying- there are trains Singapore to Thailand, and then a gap. Said family had eight children though and bought two camper vans for exploring Europe though because it was much cheaper.",
                    "score": 21,
                    "author": "Andromeda321"
                },
                {
                    "level": 1,
                    "comment": "Fun anecdote. The son of a family friend, a political Chinese refugee, made part of that trip alone at 12 years old. From northern China to Germany. Equipped with a couple of bottles of vodka and cigarettes in his backpack for trading in along the way.",
                    "score": 91,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The adventure of a lifetime. \n\nAlso horribly sad, but hopefully to a better life.",
                            "score": 42,
                            "author": "PensivePatriot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah sounds like a kid/adventure movie in the making. Real life might have a lot more sadness indeed",
                                    "score": 24,
                                    "author": "UnRePlayz",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I haven't met him in a long time but both he and his dad found friends really fast (which is a feat in and off itself here in Southern Germany). The kid is really cool and I doubt he had any problems later.  \nHis dad was already here in Germany, so the journey was certainly exciting but had a happy occasion (reuniting with his dad).",
                                    "score": 21,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did Liverpool to Hong Kong in 2015.\n\nUK &gt; Netherlands &gt; Germany &gt; Poland &gt; Belarus &gt; Russia &gt; Mongolia &gt; China &gt; HK",
            "score": 465,
            "author": "lawrencelewillows",
            "replies": [
                {
                    "level": 1,
                    "comment": "out of curiosity, how much did it cost (and return?) and how long was it?",
                    "score": 183,
                    "author": "BocciaChoc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly can't remember how much it cost. It was the start of a 2 year trip around the world. I think the Trans-Siberian tickets were the most expensive.   The whole train journey was about 7 weeks (I think) and definitely a highlight of my travels. \n\nUnfortunately, my bag was stolen in South America which contained all of my tickets. I wanted to frame them when I got home.",
                            "score": 340,
                            "author": "lawrencelewillows",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is awesome can you tell me a little more about your trip? Did you stay in any of the cities? Or was it just the train trip?",
                                    "score": 53,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I stayed in as many places as I could. Off the top of my head these are the cities I stopped at:\n\nAmsterdam &gt; Berlin &gt; Warsaw &gt; Minsk &gt; Moscow &gt; Omsk &gt; Novosibirsk &gt; Irkutsk &gt; Ulaan Bataar &gt; Beijing &gt; Shanghai &gt; Guilin (?) &gt; Hong Kong.\n\nI would've stayed in Russia longer if I could've but I had to declare each stop and amount of time there to get the tickets.\n\nAlso, Mongolia is one of my favourite countries so far!",
                                            "score": 117,
                                            "author": "lawrencelewillows",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What country are you from originally? How did you work out travel permits and such? Did you have to plan in advance how long each stop would be? Did you buy the train tickets in advance?",
                                                    "score": 25,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm from the UK so all train tickets were cheap compared to ours! The only ones I booked in advance were the Liverpool to London, the Eurostar and the Trans-Siberian. \nI sorted all of the visas before I left the country so this part of the trip was kind of locked in. But after that I was free!",
                                                            "score": 47,
                                                            "author": "lawrencelewillows",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks so much for the answers! I've always loved train travel when I'm in Europe and I'm realizing lately how much I want to do a trip like this.",
                                                                    "score": 13,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Do it! It's the best way to travel!\n\nEdit: Great resource for researching any train travel: [the man in seat 61](https://www.seat61.com)",
                                                                            "score": 24,
                                                                            "author": "lawrencelewillows"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; I think the Trans-Siberian tickets were the most expensive.\n\nI didn't ride the whole thing, but I did Yekaterinberg-St Petersburg and later Irkutsk-Ulanbataar both in 2018 and it's not super expensive anymore.\n\nRussia is seriously one of my favorite countries I've ever traveled in.",
                                    "score": 19,
                                    "author": "marpocky",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;my bag was stolen in South America\n\nyep, sounds like us",
                                    "score": 32,
                                    "author": "Lord_Malgus"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you have an estimation for the cost of the entire travel?  \nAlso does everyone have their bags stolen in SA or what",
                                    "score": 4,
                                    "author": "c0mplexx",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The Trans-Siberian tickets cost only £200 (!) from St Petersburg to Vladivostok in third class. For 30 days, on a backpackers budget, my  Russia trip didn't cost me more than £1000. Here's a practical [video guide](https://youtu.be/ziUSe9s3LQA) I made about the Trans-Siberian specifically.",
                            "score": 44,
                            "author": "garlenlo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What's westerners obsession with Trans-Siberian railway? Especially in 3rd-class, it's quite boring, isn't it? I've had the displeasure of traveling on it a few times when I was younger, and I don't see why you'd get it instead of paying a bit more to fly -- other than if you're a train enthusiast I guess?",
                                    "score": 20,
                                    "author": "8_800_555_35_35",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hahah. The locals I met in Russia said exactly the same thing. For me, I made 10+ stops between St Petersburg and Vladivostok so it was a travel necessity to see the country, but yeah, I definitely wouldn't get on the train from SPB/Moscow to Vladivostok without stopping just for the sake of the ride. Madness!",
                                            "score": 10,
                                            "author": "garlenlo"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's a very long and quiet voyage, very rural. Europe is crowded, think like Moscow area, so being hours/days without stopping at a major city its incredible to think of\n\nAlso, the oriental express novels",
                                            "score": 13,
                                            "author": "Franfran2424"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 381,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds exactly like something a Mercator hater would say",
                    "score": 430,
                    "author": "titanicvictim",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "case closed, excellent work detective. keep this up and someday you'll make captain.",
                            "score": 41,
                            "author": "ailyara"
                        },
                        {
                            "level": 2,
                            "comment": "Anti-mercator gang represent",
                            "score": 16,
                            "author": "InfiniteParticles"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Here's a quick one made in Google Earth](https://i.imgur.com/39wbuyJ.jpg). The route is not exact.",
                    "score": 129,
                    "author": "Nine_Gates",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck that noise. Bring back the Mercator projection.",
                            "score": 52,
                            "author": "fuckondeeeeeeeeznuts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[Here's a quick one made using Drew Roos' Mercator Extreme](https://i.imgur.com/IphaQkT.jpg). The route is not exact.",
                                    "score": 110,
                                    "author": "Nine_Gates",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yuck!",
                                            "score": 22,
                                            "author": "fuckondeeeeeeeeznuts"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Cambodia thicc",
                                            "score": 17,
                                            "author": "ted5298",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "STOP IT",
                                            "score": 8,
                                            "author": "AccountNo43"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ah fuck my neck..!",
                            "score": 13,
                            "author": "SmileFIN"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, for a map specifically dealing in superlatives, it's not the best way to go.",
                    "score": 11,
                    "author": "reedfriendly"
                },
                {
                    "level": 1,
                    "comment": "It’s BEEG Russia time",
                    "score": 7,
                    "author": "ChefInF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Worth 10 points at the end of the game.",
            "score": 163,
            "author": "sanjuka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that a Ticket to Ride reference?",
                    "score": 53,
                    "author": "hairychris88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ding ding ding 🥳",
                            "score": 21,
                            "author": "sanjuka"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, it is a bonus route too!",
                    "score": 6,
                    "author": "Devywhop",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How many days",
            "score": 85,
            "author": "DoubleLifeRedditor",
            "replies": [
                {
                    "level": 1,
                    "comment": "13.5 (327 hours), based on an article posted by /u/limubar",
                    "score": 125,
                    "author": "raur0s",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hold on, let me just add a few delays to be safe aaaannndddd.....\n\nBoom. Only 4 months now!",
                            "score": 72,
                            "author": "epicause",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's so quick! Why would anyone want to fly?",
                                    "score": 31,
                                    "author": "CreamyWaffles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No thanks, I'll take a sailing ship instead. It might be faster than the train.",
                                            "score": 9,
                                            "author": "ZuFFuLuZ"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm in, who's with me :)",
                            "score": 8,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can't be too many, you'll still have two oceans and America left to cross in short time if you're going to make it in 80 days!",
                    "score": 11,
                    "author": "Blyantsholder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Deutsche Bahn still takes longer.",
            "score": 648,
            "author": "laddaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "..and cost more.",
                    "score": 254,
                    "author": "KingKohishi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 38,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a Brit living in Germany I can honestly say we both lose. \n\nSomehow, I’d say the trains in England aren’t delayed as often (although I lived down south so idk about up north) and are slightly more reliable. However they are much worse than DB trains and cost more too normally.",
                                    "score": 30,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "This is cheating I know, but American rail is several orders of magnitude worse (slower/more expensive)",
                                    "score": 18,
                                    "author": "gvsteve",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 22,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "was going to pull up the NYC-San Fran price, but got a \"site down for maintenance\" error, so yeah...non-existant apparently.",
                                                    "score": 12,
                                                    "author": "enilcReddit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Finally got it to work. Only $308 and 86 hours NYC to San Fran.",
                                                            "score": 15,
                                                            "author": "enilcReddit",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pfftt, Amtrak would like a word.",
                                    "score": 29,
                                    "author": "dcviper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Booked Amtrak from Vancouver to Seattle. Normally a 3 hour drive with border traffic. Train ticket says Train departs at 3:20. I get there at 2:40. Wait and find out Train doesn’t depart until 5:30. Fuck. I’m tired out of my mind since I had just gotten off a cross pacific flight. Train boards at 4:30. Customs check. Sit on train for an hour waiting for it to depart. Hear these Germans complaining in the booth over. Finally the train departs. We’re going! After 10 minutes it stops. Freight traffic. 20 minute wait. Ok, it’s going again. Then the train legit stops on the border while border agents walk across a field to the tracks to do a passport check in each car. Takes about 15 minutes. Train gets going again, it’s pretty slow but whatever, the scenery is nice. Finally at 10:00pm we arrive in Seattle. The ticket stated we would arrive at 6:30. Never doing that again.",
                                            "score": 16,
                                            "author": "Supple_Meme",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Do the Brits sell tickets for destinations they don't travel? DB does.",
                                    "score": 17,
                                    "author": "KingKohishi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 39,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Einmal super sparpreis 2. Klasse nach Vietnam, bitte.",
                            "score": 181,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 80,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or your connectiontrain gets cancelled in the middle of the night in sibiria",
                                            "score": 47,
                                            "author": "3wettertaft",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 71,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I once thought I'd miss my connection and eventually accepted that I would. But then it looked like I'd miss the next possible connection an hour later, also the ac broke. Accepted that and it went on and on until we eventually stopped 1 station before mine. Even if we had gotten that far there wouldn't have been a connection until the day after. The train stopped not at the station but like 10 meters before that and it was hot (was this summer). We eventually reached the next station got out and had to wait for a few trains before we could take one that wasn't overcrowded. When I finally arrived at the station where I had to take my connection it was 3 am. Still 1 1/2 hours away from home, nocturnal buddy was there to pick me up luckily.\n\nSecond time this happened. Miss my most frequent connection 4/5 times and have to wait an hour on the next bus. No mobility warranty for delays that occur during the train ride. Only for those you know about before. I hate this company with a passion.",
                                                    "score": 17,
                                                    "author": "notexactlyflawless"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "you get €25 though for compensation if you've been delayed 10h and lost a foot to frostbite, but only if you send it in the mail and confirm twice.",
                                                    "score": 12,
                                                    "author": "ts_asum",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And you better proof that this foot has been in prime condition before the incident.",
                                                            "score": 6,
                                                            "author": "backrubbing"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Those air conditioners are always off.",
                                            "score": 5,
                                            "author": "KingKohishi"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But still not as much as a peak return 40 minute journey to london from near london",
                            "score": 7,
                            "author": "eunderscore"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's why it's the longest ride... It'll take longer to travel through Germany than through Russia and China",
                    "score": 19,
                    "author": "maiwson"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Half the joy is complaining about it.",
                            "score": 4,
                            "author": "laddaa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Side track (!), I am a Dutchmen and I try no to use an aeroplane when I can help it (environment and stuff). I went to London, Paris and all around the benelux by train. I needed to go to hamburg, took the train and that was my worst train experience ever.. No drinks sold for hours, no aircon, long travel, only cash and train stations looking worse than a prison.",
                    "score": 33,
                    "author": "eTukk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What is it with Germans and cash? (And EC cards, whatever the fuck that is.)",
                            "score": 12,
                            "author": "hungariannastyboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Germans love paying in cash and many distrust cards because they fear they and their purchases couple be tracked. The EC card is the German attempt of an card system and functions a lot like a debit card. Outside of Germany the big credit card companies help that they can be used as such.",
                                    "score": 16,
                                    "author": "me-el-nino",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "(A few weeks ago) Got my first NFC compatible phone and my new debit (EC) card is my first card to support it too.\n\n(drug -) stores* / gas stations* / restaurants / hotels usually have card terminals \n\n*(chains only)\n\nBut everything else... No chance.\n\nAn expensive cake shop or chocolate candy store. I bought 100€ worth of cake and pralines... Nope cash only. Had to run home and get my cash. \n\nFrom my own experience those EC terminals are way to expensive in small stores.\n\nYou have to pay your Pickerl (Austrian highway toll)... Better bring cash! The terminals fee is higher than the margin.\n\nJust a German pov.",
                                            "score": 6,
                                            "author": "the_harakiwi",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But it’s all worth it for the ‘sank you for travelling wiz Deutsche Bahn’",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Be grateful. We in the UK would kill for a service like DB.",
                    "score": 5,
                    "author": "Norty_Boyz_Ofishal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bus replacement service",
            "score": 22,
            "author": "shaun056"
        },
        {
            "level": 0,
            "comment": "It's long. But isn't there a shorter way to travel this route, by taking the train through Mongolia? Otherwise, you could argue that this train ride could be made even longer by visiting all European countries, taking longer ways around in China, etc?\n\nHere's other interpretations of this impressive train ride:\n\n[https://basementgeographer.com/the-longest-train-ride-in-the-world/](https://basementgeographer.com/the-longest-train-ride-in-the-world/)\n\n[http://www.traveltimes-mag.com/longest-train-journey-possible/](http://www.traveltimes-mag.com/longest-train-journey-possible/)",
            "score": 133,
            "author": "limubar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, this map, and title, isn't right.  The two furthest apart places you can travel between entirely on rail are Vietnam and Portugal.\n\nThis map shows you actually getting closer again at the very end, which is just adding travel without increasing distance.  No different from going via Scandinavia just to create extra travel.\n\nAnything after Lisbon is getting closer.",
                    "score": 41,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[I beg to differ](https://gfycat.com/warmheartedartisticgrasshopper)",
            "score": 84,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My mind went straight to London's Circle Line",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh hi, I'm here for the discussion about Snowpiercer.",
            "score": 16,
            "author": "toomanynamesaretook",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Technically this is not true. A single train cannot travel this route. There are 5 different regions with four different track gauges. In other words, you need at least 5 trains to travel this route.\n\n[https://upload.wikimedia.org/wikipedia/commons/5/5d/Rail\\_gauge\\_world.svg](https://upload.wikimedia.org/wikipedia/commons/5/5d/Rail_gauge_world.svg)\n\nThe Trans-Siberian Railrway is still the longest route that you can travel with a single train.",
            "score": 857,
            "author": "KingKohishi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean technically you could also zigzag all the way (at least in Europe) and lengthen the trip",
                    "score": 103,
                    "author": "Arkhonist"
                },
                {
                    "level": 1,
                    "comment": "Why the OP's title says \"Train travel\", not \"Single-seat trip\"\n\nIf I fly to Tahiti from New York, I'm still traveling on airplanes to get there, just more than one.",
                    "score": 314,
                    "author": "AllswellinEndwell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In this case, wouldn't the longest train travel possible be of infinite length? One could just ride in circles",
                            "score": 175,
                            "author": "AccomplishedOstrich3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 43,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "That's how you win Ticket-to-ride!",
                                    "score": 61,
                                    "author": "Justice_R_Dissenting",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But she don't care?",
                                            "score": 9,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The distance being maximized here is the straight-line distance between the starting and ending point.",
                                    "score": 12,
                                    "author": "Martin_Samuelson",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, but what's to stop you just catching trains that go out of your way to up your numbers artificially? Christ, logically that means I could take the longest train around Leeds\n\nEdit: grammar",
                            "score": 44,
                            "author": "gheeboy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Make a map of it and post it here and you’ll get 8k upvotes",
                                    "score": 36,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "a train capable of changing the gauge is quite capable of driving the entire route.  (e.g. Talgo) In addition, trains can change wheelsets at the border.  for example, trains run from Russia to Europe",
                    "score": 162,
                    "author": "BlackHust",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " 1,668 to 1,435 to 1,520 to 1,435 to 1,000. I don't think there is a commercially available train capable of that.",
                            "score": 137,
                            "author": "KingKohishi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. And what is more, the minimum distance between the tracks and station platforms needs to be taken into account. Broad gauge trains have broad coaches, which wouldn't comfortably squeeze through central European stations. So you need a narrow, slender train that leaves a huge gap in between the train and the platform in Londo.. sorry, Russia.",
                                    "score": 32,
                                    "author": "kalsoy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So a special train, changes gauge and folds out a ramp to the platform. Not impossible.",
                                            "score": 20,
                                            "author": "chepulis",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or something akin to those campers with the pop-out sides. Just make everyone stand up and squeeze in the sides when the train goes past the platform.",
                                                    "score": 11,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Train debatin",
                                    "score": 128,
                                    "author": "TheGhostOfHanni",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I will build this custom train",
                                            "score": 5,
                                            "author": "BeautifulType"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm just here for the train knowledge dick measuring contest.",
                                            "score": 22,
                                            "author": "Jabrono",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; here for the train knowledge dick measuring contest.\n\nBut dick gauges vary between countries.  You would need to engorge or disengorge when you cross borders.",
                                                    "score": 9,
                                                    "author": "Major_Mollusk",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly. And what is more, the minimum distance between the dicks and dick stations needs to be taken into account. Broad gauge dicks have broad girths, which wouldn't comfortably squeeze through central European stations. So you need a narrow, slender dick that leaves a huge gap in between the dick and the platform in Londo.. sorry, Russia.",
                                                            "score": 7,
                                                            "author": "Jabrono"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Such a train would still need to be compatible with several different security systems, and even if ETCS one day unifies the (currently over 20) different systems in Europe, there are still different systems in use farther east. Besides, electrical propulsion would mean supporting quite a lot of different voltages and catenary heights.",
                            "score": 5,
                            "author": "AccidentalNordlicht",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 35,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 79,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You wake up in the morning not expecting apologise for lots of things but that isn't one of them",
                            "score": 24,
                            "author": "Tammytalkstoomuch"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm pretty sure you could make this a lot longer, if you add some loops like going down to italy and then all the way up to copenhagen etc...",
            "score": 15,
            "author": "AffeAhoi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The longest train ride in the world starts in Portugal and ends in South Vietnam. The 11 thousand miles journey takes about 275 hours – equivalent to 12 days – and costs around $1.570.",
            "score": 11,
            "author": "CactusJack5150",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Is this an existing line?",
            "score": 9,
            "author": "tiger1296",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, every morning I'm taking it to go to work.",
                    "score": 24,
                    "author": "GeminiRocket"
                },
                {
                    "level": 1,
                    "comment": "No, but you can take that route by train without another way of transportation.\n\nYou will have to switch to another train on various stops.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Here's a complete itinerary](https://rail.cc/en/train/lisbon-to-ho-chi-minh-city) for the trip (Lisbon to Ho Chi Min) including links to purchase all the tickets needed. Bring snacks.",
            "score": 8,
            "author": "Major_Mollusk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Now imagine getting stuck next to someone on a cell phone while a child kicks the back of your seat.",
            "score": 51,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And they have the exact same destination as you in Vietnam...",
                    "score": 35,
                    "author": "Annales-NF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where does that start in Europe? Is that Sevilla? Looks like the Algarve but I can't zoom in enough.",
            "score": 7,
            "author": "MrJohnnyDangerously",
            "replies": [
                {
                    "level": 1,
                    "comment": "Looks past the Portuguese border, so I'd say Sevillla, though my Iberian geography only comes from EU4.",
                    "score": 7,
                    "author": "StreetCountdown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No it ends at Vila Real de Santo António, Portugal. Theres no train line to Huelva.",
                            "score": 10,
                            "author": "turinpt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait till the Ventiane-Kunming link is complete, then you can start from the tip of Malaysia.",
                    "score": 17,
                    "author": "kimilil",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You don't need buses in Singapore as their metro is pretty extensive. They're on their way to construct a cross-border MRT line to Johor Bahru's central station, where you can start with intercity trains run by Malayan Railways to get to Malaysia-Thailand border. Problem is the Malaysian government is currently halting that project for cost-cutting exercises.",
                                    "score": 9,
                                    "author": "kimilil",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 16,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Now I want a Ticket to Ride, World edition.",
            "score": 14,
            "author": "neuropsycho",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Here you go.](https://boardgamegeek.com/boardgame/202670/ticket-ride-rails-sails)",
                    "score": 6,
                    "author": "KristjanKa",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Going by the articles posted here, something between 2000-3400$",
                    "score": 13,
                    "author": "ntnl",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone in Portugal: “man, I could really go for some pho right now...”",
            "score": 4,
            "author": "Mr_Salty87",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone in Vietnam: \"trade you for a pastel de nata\"",
                    "score": 8,
                    "author": "marpocky",
                    "replies": []
                }
            ]
        }
    ]
}