{
    "id": "oetoob",
    "score": 37683,
    "title": "Mythical Beasts of the United States of America",
    "author": "NeilParkinsonMakes",
    "date": 1625573618.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/oetoob",
    "media_urls": [
        "https://i.redd.it/4tlm87tf3l971.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Sinkhole Sam looks like a cool dude I’d get a beer with him",
            "score": 615,
            "author": "MaudDib2",
            "replies": [
                {
                    "level": 1,
                    "comment": "We should make him the third vice president of the United States.",
                    "score": 142,
                    "author": "Draxilar"
                },
                {
                    "level": 1,
                    "comment": "I agree, Sam looks like the most friendly compared to every other",
                    "score": 40,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huggin molly is the scariest thing on this for some reason. Apparently she chases you down, gives you a big hug, and screams in your ear",
            "score": 1244,
            "author": "Colley619",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that all? Pretty sure lots of toddlers also do this sometimes lol",
                    "score": 296,
                    "author": "Arekai4098",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Happened to me last night at 3am, confirmed terrifying.",
                            "score": 133,
                            "author": "LevSmash",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Closest I've ever come to hitting my toddler, not out of anger, but fear.  \n\nWoke up to find him staring at me, about 6 inches from my face, then screaming \"HI DADDY\".",
                                    "score": 78,
                                    "author": "jimmy_three_shoes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lmaoooooo, I told my wife the same thing, I put the kid back in his room and put a gate in front of the door which upset him, and when I came back she gave me the look of disapproval, I was like \"I'm genuinely worried I might accidentally hit him if he startles me awake!\" Haven't these kids played Don't Wake Daddy?",
                                            "score": 21,
                                            "author": "LevSmash",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Indeed she’s an odd one, definitely wanted to include it. There’s a diner by the same name, I want to go there one day",
                    "score": 497,
                    "author": "NeilParkinsonMakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This map is like an X-Files filler episode guide",
                            "score": 283,
                            "author": "MusicTutor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah there was the jersey devil episode. Also supernatural has a wendigo episode.",
                                    "score": 77,
                                    "author": "bdone2012",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm pretty sure there was a mothman episode too.",
                                            "score": 45,
                                            "author": "MusicTutor",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There was one with a kid who was part fly and one with radioactive moths, but I don’t think there was ever a moth man. There was a bat man.",
                                                    "score": 10,
                                                    "author": "JohnCocktoastener",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've been there a bunch of times, it's on the way to Panama City Beach from Atlanta. It's not bad but barely worth going 20 minutes out of the way",
                            "score": 6,
                            "author": "WatifAlstottwent2UGA",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've weirdly never heard of Huggin Molly before but I grew up in the area and there was a bridge that screamed at people. If you parked on it at night or stood out there something would scream.\n\nSome friends and I thought it was bullshit and tested it one night. We were expecting a bobcat or something but it sounded like a woman stuck her head in the car and screamed at the top of her lungs. Scared one of my friends so bad he actually pissed himself, granted we were trashed.\n\nThe only mythical beast I remember anyone talking about is lots of people claim to have seen giant cats in the woods at night. Like massive tiger like things with stripes but not orange. Heard that one all the time.",
                    "score": 35,
                    "author": "Kulladar",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I dreamed of this one when I was 7.",
                    "score": 17,
                    "author": "Striped_Sponge",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m from Alabama and I’ve never heard of Huggin’ Molly. I almost want to think she’s based on Native American folklore, but Huggin’ Molly doesn’t quite sound like any of the Native American place names we have around here like Notasulga, Loachapoka, Oneonta, Sylacauga, Tuscaloosa, etc.\n\nI’d be very interested in its origins lol. I googled it but there’s not even as much as a Wikipedia article on her, and every other link is to websites like blogs that are talking about the Huggin Molly’s restaurant in Abbeville. Nothing gives a solid source for the origins of the story.",
                    "score": 24,
                    "author": "Red-Quill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm in agreement, I've never heard of her before.",
                            "score": 11,
                            "author": "schoolboy_qanon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Anyone ever tried hugging her back? Maybe she's just lonely and needs a friend",
                    "score": 10,
                    "author": "mageta621"
                },
                {
                    "level": 1,
                    "comment": "That just sounds like your average crackhead tbh.",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "WHERE IS THE CHUPACABRA",
            "score": 1591,
            "author": "ralexander26",
            "replies": [
                {
                    "level": 1,
                    "comment": "Grew up in El Paso and various places in Central Texas. Chupacabra was brought up all the time when telling scary stories at sleep overs. La Llorona too. \n\nI have never heard of El Muerto or the Lake Worth Monster that are on this map. The latter makes sense since it's just a Ft. Worth thing.",
                    "score": 475,
                    "author": "Neonimous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I grew up in the RGV in south Texas. Never heard of El Muerto either.",
                            "score": 88,
                            "author": "darth_fajita",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Lake Worth monster is actually called the Goatman. But I think several other places have a \"Goatman\" so they decided to call it that instead 🤷‍♂️",
                            "score": 42,
                            "author": "stackdablu580",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think they used La Llorna (probably meant La Llorona) in the same area.",
                    "score": 64,
                    "author": "AZWxMan",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And the Jackalope!",
                    "score": 75,
                    "author": "YourSpymaster",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 37,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Because they chupacabra is real. It doesn't belong on this map.",
                    "score": 262,
                    "author": "CoconutBangerzBaller",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Enlightened",
                            "score": 69,
                            "author": "mikebellman"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks, now I’m having flashbacks of my 6th grade mythical creatures project… ya boy got the chupacabra… and ya boy didn’t sleep well for about a month after.",
                            "score": 29,
                            "author": "SaltiestRomo",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's a Will'am Alone?  I grew up in the area and never heard of it. Google has nothing. \n\nOur family told tales of the Jackalope.",
            "score": 1314,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s a squirrel type creature that rolls up balls of poisonous lichen and drops it into the eyes of lumberjacks causing hallucinations. From the wonderful and bonkers world of lumberjack mythology",
                    "score": 1047,
                    "author": "NeilParkinsonMakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds like a dude got intoxicated on the job got caught, and rather than tell the truth he was like, nah Will'am Alone threw poisonous lichen balls at me and that's why I was licking trees!",
                            "score": 559,
                            "author": "tobygeneral",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In northern Brazilian folklore we have the pink boto (fresh water dolphin), said to transform into a handsome man in the late hours of the night and seduce young ladies, offering a mythical explanation to women who get pregnant out wedlock and/or when they're supposed to be virgins. Yeah, right",
                                    "score": 279,
                                    "author": "SubcommanderMarcos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean those dolphins can be horny fuckers.",
                                            "score": 105,
                                            "author": "Knoke1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Peter the dolphin has entered the chat:  \"Anyone seen Margaret?\"",
                                                    "score": 16,
                                                    "author": "rawfish71",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In Hawaiian Pidgin, boto means penis, so this story is even more grand!",
                                            "score": 30,
                                            "author": "Daj141649",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So it’s more socially acceptable to be impregnated by a mythical dolphin than have premarital sex, Catholicism u crazy",
                                            "score": 155,
                                            "author": "Nearby_Arachnid9683",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'd put good money on the transforming dolphin playboy being a thing before catholicism arrived in Brazil",
                                                    "score": 42,
                                                    "author": "ILikeLeptons",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[https://press.uchicago.edu/Misc/Chicago/079790.html](https://press.uchicago.edu/Misc/Chicago/079790.html) This source says it caused nightmares but that just might be a variation.\n\n[http://fearsomecritters.org/lexicon8.html](http://fearsomecritters.org/lexicon8.html) here's another source that uses alliteration to describe the critter.\n\nThanks for bringing the creature to my attention. Never heard of it before.",
                            "score": 27,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "The book you’re thinking of is “Mythical Creatures of Maine: Fantastic Beasts from Legends and Folklore” I believe\n\nEdit: you can find it on Google by instead searching “will-am-alone”\n\nFor more reading look here. http://www.mobile.fearsomecritters.org/lexicon8.html",
                            "score": 17,
                            "author": "sneakyomelette"
                        },
                        {
                            "level": 2,
                            "comment": "Is there a source?",
                            "score": 32,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. OP rubbed poisonous lichen in his eyes causing hallucinations of an evil squirrel.",
                                    "score": 98,
                                    "author": "sonic_tower"
                                },
                                {
                                    "level": 3,
                                    "comment": "I can’t remember which book it’s from off the top of my head. It’s one of the lumberjack/lumber wood books, published around 1910. Good fun to read",
                                    "score": 62,
                                    "author": "NeilParkinsonMakes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's probably Fearsome Creatures of the Lumberwoods, by William T. Cox (1910)",
                                            "score": 34,
                                            "author": "entr0py3",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I tried to do some research on it too, and from what I can find it isn't an actual myth, it's just from a limerick included in a book full of limericks.",
                                    "score": 26,
                                    "author": "b4gelbites_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not really sure how this map was made, lol.",
                                            "score": 26,
                                            "author": "niocegodwow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Looks like people have similar complaints about his other maps, and he just does his best to research the folklore associated with the local areas. \n\nThe floating head one is a legit Iroquois myth, I think overall it's a pretty cool map",
                                                    "score": 21,
                                                    "author": "b4gelbites_",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "His full name is Will.i.am Alone, and he is a depressed member of the Black Eyed Peas.",
                    "score": 444,
                    "author": "waiv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“I got a feeling….tonight’s gonna be a…sad night.”",
                            "score": 80,
                            "author": "blackmagic999",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 46,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "No Jackalope? I feel cheated!",
            "score": 177,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s because it’s real",
                    "score": 59,
                    "author": "Dahvido",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I grew up on the Ohio River and I'm pissed I never learned about mud mermaids!",
            "score": 660,
            "author": "Gophurkey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah they’re pretty cool, I liked the different take on mermaid lore",
                    "score": 235,
                    "author": "NeilParkinsonMakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is missing several that I've heard of.\n\n*[Champ](https://newengland.com/today/travel/vermont/burlington/champ-lake-champlain/) - lake Champlain's monster\n\n*[Chessie](https://en.wikipedia.org/wiki/Chessie_(sea_monster)) - Chesapeake Bay's monster\n\n*[Snallygaster](https://en.wikipedia.org/wiki/Snallygaster) - Middletown/Frederick Co. Maryland's monster\n\nEdit: Not criticism, this is an awesome map. Would just like to see some of my favorites on it",
                            "score": 218,
                            "author": "murkloar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 54,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, Wampus Cat is a big one in TN. Also the Bell Witch.",
                                            "score": 36,
                                            "author": "ComprehensiveGuard2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, skinwalkers, skunk apes, Michigan dog man, thunderbirds, etc etc",
                                                    "score": 13,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Some of what's on this map is quite the stretch I'd say, provably a lot of very lightly discussed stories. In my area SW, I don't think I've ever heard of any of the stories.",
                                    "score": 12,
                                    "author": "niocegodwow",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah there’s literally hundreds I found, space is the issue,",
                                    "score": 63,
                                    "author": "NeilParkinsonMakes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There is totally room for Chessie if you lose the big tree covering up VA!  :)",
                                            "score": 30,
                                            "author": "DoctorGluino",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also the PG county/Greenbelt Goatman!",
                                    "score": 4,
                                    "author": "operative_e",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same, I'm from Ohio and the only one in that whole region I know of is Mothman.\n\nAnd I don't even know about Mothman from word-of-mouth, I learned about Mothman on the internet. :(",
                    "score": 47,
                    "author": "Arekai4098",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Check out the Loveland Frog",
                            "score": 15,
                            "author": "Orinsi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's Loveland frog-MAN to you sir!",
                                    "score": 9,
                                    "author": "Shakazulu94"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "am from ohio have you ever heard of lemon heads?",
                            "score": 4,
                            "author": "Sad_Caregiver69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Melon Heads*",
                                    "score": 11,
                                    "author": "dick_tanner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ha, was about to say no, but this would explain why. Lemonheads are a candy lol.\n\nSadly never heard of melon heads either, though.",
                                            "score": 8,
                                            "author": "Arekai4098"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One idyllic summer I was on a water ski team.  the Rhinelander Hodags were competition and they always won.",
            "score": 104,
            "author": "EgberetSouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hard to lose with a name like that",
                    "score": 34,
                    "author": "NeilParkinsonMakes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I HAD TO SCROLL DOWN TOOO FAR TO FIND ANYTHING ABOUT RHINELANDER! I was a lifeguard at the YMCA of the northwoods. Anyone who has been to rhinelander knows how important hodags are to the local economy lol.",
                    "score": 24,
                    "author": "pincheperroloco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is true.  I am not from there, but I have been to Rhinelander and know how important hodags are to the local economy.  Mostly I know that because of all the Hodag related signs everywhere.",
                            "score": 9,
                            "author": "Sigurlion",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So that's why it's the New Jersey Devils",
            "score": 453,
            "author": "ACardAttack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah the folklore is it was some family living down in the pine barrens had a devil baby. The family was real and all, probably not the story. It’s funny once I moved to Jersey it seemed like everyone knew this tale lol",
                    "score": 117,
                    "author": "SenorBubs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember they told the story to us in elementary school and we were all horrified and screamed whenever we saw something move in the woods",
                            "score": 33,
                            "author": "Fleebo-1"
                        },
                        {
                            "level": 2,
                            "comment": "Last Podcast did a really fun episode about it. To sum it all up, Benjamin Franklin was a troll.",
                            "score": 19,
                            "author": "witchywater11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The X Files also did The Jersey Devil",
                                    "score": 5,
                                    "author": "awnomnomnom"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Grew up in Jersey, can confirm the Jersey Devil is a constant threat that must always be watched for",
                            "score": 75,
                            "author": "GiverOfTheKarma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know Brodeur is a little intense, but he seems like a great guy once you get to know him.",
                                    "score": 27,
                                    "author": "MystikxHaze",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jersey Devil real af, the origin story isn’t. Most people that spend times in the Pine Barrens will admit that somethings amiss in those woods.",
                            "score": 16,
                            "author": "Intelligent_Ad_8063",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's just the pineys or kkk",
                                    "score": 18,
                                    "author": "Metal_LinksV2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "shit u right u right",
                                            "score": 9,
                                            "author": "Intelligent_Ad_8063"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Six Flags Great Adventure just opened a new coaster called the Jersey Devil Coaster.",
                    "score": 164,
                    "author": "JennItalia269",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best six flags in the world",
                            "score": 73,
                            "author": "Smiley-McGee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s the 2nd largest theme park in the world, only behind Disney’s Animal Kingdom in Florida\n\nSafari parks take up a lot of space",
                                    "score": 39,
                                    "author": "gingerbeeer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It would be the largest if it weren't for a beer company. Disney only built Animal Kingdom because Busch Gardens Tampa was eating into their attendance numbers by offering a different experience. Kind of interesting how a small regional amusement park prompted Disney build a whole new park.",
                                            "score": 8,
                                            "author": "Draxilar"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great map! One minor correction: I believe it's \"La Llorona\" not \" La Llorna\". Means \"The [female] Crier\". Nonetheless, so fun to think of all of the mythical creatures our imagination has created.",
            "score": 534,
            "author": "lulespm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can confirm, am llorona",
                    "score": 156,
                    "author": "CoronaLlorona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "name really hits, grats",
                            "score": 27,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you and yes someone has pointed this out and it has been corrected on the file I’ve sent to the printers. It is indeed great what our minds can do",
                    "score": 207,
                    "author": "NeilParkinsonMakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 50,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely. I’m not sure about rules of advertising on here. But if you send me a message I can pass on a link",
                                    "score": 73,
                                    "author": "NeilParkinsonMakes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "~~I, too, would like a print (or 2)!~~  \nnvmd, found your Etsy.",
                                            "score": 12,
                                            "author": "dtallee",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Lake Worth Monster is my neighbor! Unless the influx of gators has taken care of him.",
            "score": 37,
            "author": "zroo92",
            "replies": [
                {
                    "level": 1,
                    "comment": "I reckon he can take em!",
                    "score": 14,
                    "author": "NeilParkinsonMakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should turn this into a jigsaw puzzle. You would sell the hell out of these!",
            "score": 50,
            "author": "cryptkeepers_nutsack",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hi all here’s the latest map I’ve made you might remember my others British and Irish Isles, Ancient Greece and Scandinavia. Anyway I hope you all enjoy it",
            "score": 353,
            "author": "NeilParkinsonMakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 104,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So so awesome. Hoping you do Canada sometime!",
                            "score": 19,
                            "author": "diecast"
                        },
                        {
                            "level": 2,
                            "comment": "Good catch thank you",
                            "score": 46,
                            "author": "NeilParkinsonMakes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Very cool map, but given that many of us have never heard of the myths even around where we’re from, how did you find out about all of these?",
                    "score": 30,
                    "author": "das_goose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve lived throughout CA from SD to LA to SF and I’d never heard of either of the two places here. Many of these seem very, very unknown, but it’s still kinda fun learning these random bits of history.",
                            "score": 10,
                            "author": "TheMooseIsBlue",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Neat map! Was a bit sad not to see the Gloucester sea serpent. Him and the kraken are the ones I grew up with up here. But it looks like you were sticking to land beasts. And of course, [who knows about the kraken since they had that giant squid wash up on plum island 40 years ago?](https://www.youtube.com/watch?v=rQ1rN2SQfs8&amp;t=3s) Maybe the old salts weren't all full of shit, lol.",
                    "score": 24,
                    "author": "badluckbrians",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never heard of the Stikini. Thought Florida would've been the Skunk Ape.",
            "score": 79,
            "author": "juwyro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Found the Stikini waaay more interesting. And also dint want it to be a map of ape like creatures, pretty much every state has one",
                    "score": 38,
                    "author": "NeilParkinsonMakes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've never heard of most of these, but I'm not from the US. Some of the names are really evocative..\n\nBoo hag?",
            "score": 153,
            "author": "TheDevilsAdvokaat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Many are based on local Native American lore, that’s why you get some perceived weird names.",
                    "score": 68,
                    "author": "cecenas",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I know this one! There are Gullah/Geechee people who live in the barrier islands off the coast of South Carolina and Georgia, respectively. They were brought over for their knowledge of rice cultivation and were largely left alone, so they’ve retained more of their west African culture than other African Americans in the US. This includes a syncretic religion “Hoodoo” (or rootwork, idk the proper term), similar to Santeria/Vodun/Voodoo. Boo hags will suck your breath out of your body but you can prevent them from coming into your house by leaving newspaper or things with lots of holes by your door, because they have to read or count anything they come across. (I think, it’s been a while).\n\nGullah people are pretty unique and have their own language and cuisine, but are dying out. My grandmother was Gullah and a lot of rootwork is illegal to practice and the culture was looked down so a lot of practices aren’t documented. Things like ring shouts, woven baskets, Brer Rabbit/other animals, and blue ceilings are distinctively Gullah. Most people are familiar with Gullah dishes like Shrimp and Grits, Red Rice, and Hoppin’ John.",
                    "score": 65,
                    "author": "pvhs2008",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recently watched the Netflix documentary series “[High on the Hog: How African American Cuisine Transformed America](https://www.augustachronicle.com/story/entertainment/2021/05/24/netflix-documentary-high-hog-african-american-food/7412763002/),” and one of the episodes was all about Gullah cuisine and culture. It's a great series if you haven't seen it.",
                            "score": 32,
                            "author": "i-hear-banjos",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Worked with a lot of Gullah. They talked about the Boohag constantly. If someone was hungover, they’d say “oh, the Boohag done rode ya”\nThey paint the windows and doors of their homes fluorescent colors to ward off the Boohag.",
                            "score": 13,
                            "author": "razpritija",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've never heard of most of these, but I *am* from the US. I imagine lots of these are hyper-local or regional",
                    "score": 113,
                    "author": "JejuneBourgeois",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A number of them are from specific (local) Native American traditions, so even a lot of the non-native locals might be unfamiliar. \n\nThen there's a bunch that originated as lumberjack stories of \"fearsome critters\". There are still lumberjacks in some places but I don't know if they still tell tall tales like they used to.",
                            "score": 39,
                            "author": "UWillAlwaysBALoser",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I've heard of a couple. I've heard of a jersey devil before.",
                            "score": 40,
                            "author": "TheDevilsAdvokaat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wendigos are pretty common in fantasy settings as well. But yeah, those two, Mothman, and Samsquanch (obvs) are the only ones I've heard of.",
                                    "score": 29,
                                    "author": "maledin",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same",
                            "score": 5,
                            "author": "German_Irish_chicken"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm an American who has only heard of 5 of these, not even including the one that is apparently from my region.",
                    "score": 147,
                    "author": "TheGreff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same.",
                            "score": 6,
                            "author": "Q_about_a_thing"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Majority of these are local legends that you probably won’t know about unless you’re from that specific county, the big three however that I feel every American knows is Bigfoot, Moth Man, and The Jersey Devil, you google those three and you’ll get a ton of articles. Though I’m surprised the Fresno Night Crawlers aren’t here.",
                    "score": 62,
                    "author": "ColumbianGeneral",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Wendigo by Algernon Blackwood is hands down one of the scariest old school short stories I’ve ever read.",
                            "score": 55,
                            "author": "_Neverknow_",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "What’s the Fresno night crawler?  I’m from Visalia. Never heard of it.",
                            "score": 7,
                            "author": "TheBlueprent",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That makes sense. I’m from California and I’ve never heard of the dark watchers.",
                            "score": 6,
                            "author": "Iheartbulge",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But where are Rhett and Link?",
            "score": 31,
            "author": "Treebeard_Jawno",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let’s talk about that.",
                    "score": 22,
                    "author": "guiporto32",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Until next LTAT, keep on BYMB, FoSho",
                            "score": 5,
                            "author": "nellsbohr"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is what I came to the comments section for. Nice.",
                    "score": 10,
                    "author": "CryingOverSpilledTea"
                },
                {
                    "level": 1,
                    "comment": "thank god im not the only one",
                    "score": 7,
                    "author": "shelbyasmith"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a resident of Illinois I can confirm that trees are in fact real.",
            "score": 31,
            "author": "Smuggly_Mcweed",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I live in New England and i had no idea we had such a banger of a Native American monster",
            "score": 70,
            "author": "scrubbysponge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I was looking for the wampus, wasn’t expecting that or the will am alone.",
                    "score": 13,
                    "author": "ayoungjacknicholson"
                },
                {
                    "level": 1,
                    "comment": "Kanontsistonties is Haudenosaunee (New York, Pennsylvania, and Ohio) and Wyandot (Southern Ontario) myth, so it wouldn't really be a New England story.",
                    "score": 16,
                    "author": "pohatu771",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's missing Pukwudgies which are one of my favorites and similarly badass",
                    "score": 15,
                    "author": "Vinicelli"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 16,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "One of my favorites that wasn't included in the Pennsylvania Squonk.\n\nAn ugly creature that constantly cries about how ugly it is. If you try &amp; catch it it'll morph into a puddle of tears to escape.",
            "score": 23,
            "author": "blckravn01",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Boo Hag is the scariest thing on here wtf is that thing",
            "score": 65,
            "author": "Reverie_39",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently they steal your skin https://en.m.wikipedia.org/wiki/Boo_hag\n\nI grew up in Charleston and heard about boo hags (you paint your porch’s ceiling blue to scare them off) but didn’t know the skin part!",
                    "score": 71,
                    "author": "humerusbones",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh man, my SC boy scout campfire stories are about to get a new feature!  Add this \"When the victim awakes, they may feel short of breath, but generally the victim only feels tired.\" on top of COVID and gets really good!",
                            "score": 20,
                            "author": "heartlessgamer"
                        },
                        {
                            "level": 2,
                            "comment": "That doesn't seem so bad, all things considered. If you casually ignore the whole skin stealing shenanigans. \n\nShe doesn't kill unless the person struggles, and otherwise just puts them in a deep sleep. I'd chance it for a full night of deep sleep.\n\nHer methods also fit near perfectly with sleep paralysis.",
                            "score": 14,
                            "author": "Turtle_Tots",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Was going to say, I think they just described my sleep paralysis demon lol",
                                    "score": 7,
                                    "author": "Floofy-beans"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I thought SC would have had lizardman representing it lol",
                            "score": 5,
                            "author": "PioneerSpecies"
                        },
                        {
                            "level": 2,
                            "comment": "I'm from Alabama so it might be a little different here. Porch ceilings are painted \"haint blue\" to keep evil spirits away. The thinking was that spirits can't transverse water, so it would ward them off. I don't know about the boo hag stuff, but the tradition definitely started in the Carolinas.",
                            "score": 5,
                            "author": "TheRandomestWonderer"
                        },
                        {
                            "level": 2,
                            "comment": "Painting your ceiling blue is a big southern thing, very popular in Louisiana and the coast of AL where I grew up. It’s believed that ghost can’t go over water, hence the blue paint to repel evil spirits. \n\n“The shade of blue used on many southern ceilings is often called “haint blue”. ... The blue color was meant to ward off “haints” or evil spirits who might want to harm the house or the family inside. Tricking Insects. Many people argue that painting your porch ceiling blue actually keeps insects away.”",
                            "score": 6,
                            "author": "_Weagle_Weagle_",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Hodag story is such a hilarious hoax that gets more and more ridiculous",
            "score": 135,
            "author": "Shubashima",
            "replies": [
                {
                    "level": 1,
                    "comment": "All the lumberjack lore is absolutely bonkers and I loved every minute of reading it",
                    "score": 86,
                    "author": "NeilParkinsonMakes",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I believe the local highschool sports teams are even called the Hodags. It’s definitely less of a hoax now and more of a fun bit of town history but definitely one of the least believe-able cryptid tales I’ve heard.",
                    "score": 40,
                    "author": "MileByMyles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unbelievable but definitely fun. Rhinelander has leaned into it pretty good, and it's one of my favorite stops when driving in northern Wisconsin.",
                            "score": 25,
                            "author": "B_Fee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Been wanting to stop by there with my buddies ever since we heard of the hodag, haven’t made the trip yet but one day for sure.",
                                    "score": 9,
                                    "author": "MileByMyles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There’s a pretty big hodag statue in Rhinelander it’s pretty funny",
                                            "score": 8,
                                            "author": "Shubashima",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yup they take it pretty seriously in Rhinelander the mascot is a Hodag, there is a Country music festival called Hodag and there even is terrifying Hodag [statue](https://www.roadsideamerica.com/story/11963) at their chamber of commerce",
                            "score": 7,
                            "author": "ImMystikz"
                        },
                        {
                            "level": 2,
                            "comment": "What's the most believable tale?",
                            "score": 5,
                            "author": "SpindlySpiders",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I suppose that raises a good point that by their nature most of these aren’t very believable, but I’d say it’s easier to give more credit to ones of more supernatural origin. So like the wendigo, or any of the more ghostly ones. Tales of just extremely unique creature surviving on their own without be spotted or documented under reliable means are just hard to get behind.",
                                    "score": 6,
                                    "author": "MileByMyles"
                                },
                                {
                                    "level": 3,
                                    "comment": "Mothman",
                                    "score": 5,
                                    "author": "J71919"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about Champ, the Lake Champlain monster?",
            "score": 127,
            "author": "HokumPokem",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's also Chessie, the Chesapeake Bay monster.",
                    "score": 32,
                    "author": "SleepyFarts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also Pepe the Lake Pepin monster, supposedly a dinosaur-like creature, but probably a giant lake sturgeon or paddlefish living in the deep, 2 1/2 mile wide, 20 mile long section of the Mississippi River.",
                            "score": 6,
                            "author": "velociraptorfarmer",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": " Couldnt fit all of them on. It’s a balance trying to get the right distribution as well as balancing out some popular ones with new ones for people to find out about",
                    "score": 65,
                    "author": "NeilParkinsonMakes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sad for no thunderbird or skin-walker.",
            "score": 97,
            "author": "TKHawk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Skin walkers were the go-to ghost story I'm the part of Arizona where I grew up.",
                    "score": 41,
                    "author": "West_Desert",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is a map of mythical beasts. That's why the Thunderbird isn't on there.",
                    "score": 13,
                    "author": "AndrewFGleich",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Thunderbird was a bit too ubiquitous and I didn’t want to include a skin Walker as it was an actual person that transforms I was worried it could be taken offensively if put under the title of beasts",
                    "score": 46,
                    "author": "NeilParkinsonMakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That fair for skinwalkers, I would have included El Chupacabra for the Southwest though",
                            "score": 19,
                            "author": "TheHetchie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Forgot Illinois's mythical beast: the balanced state budget.",
            "score": 10,
            "author": "TheRealPeterG",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lived in CA my whole life and never heard of the \"Dark Watchers\".",
            "score": 89,
            "author": "skeetsauce",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's limited to the Central California coast. Monterey - Big Sur - Cambria. Outside of that it's not a thing.",
                    "score": 75,
                    "author": "whatwronginthemind",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh neat! What do they do? Watch you drive by on the coast? 😂",
                            "score": 21,
                            "author": "Tea_Lover_55",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They are a peaceful people I've seen myself at the top of ridges they simply look at you and don't try to bother you. They will move away if you try to go closer, which strangely enough kinda breaks the biggest theory that tries to rationalize it.\n\nI've heard it all over, accounts from Spaniards in the early early settlements, I've heard accounts from natives, and you will hear random ranchers and rancheros be like \"I've seen shadow people out here before\" who haven't even heard of the folklore.\n\nIt is distinctly limited to the Santa Lucia mountain range and isn't known from everyone but is somewhat known despite this.",
                                    "score": 20,
                                    "author": "Bruhtatochips23415",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Born and raised on the Central Coast, never heard of them... And I'm totally into lore and monsters... Time to do some research!!",
                            "score": 7,
                            "author": "SBPSANOGG",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Wasn't that movie \"Absentia\" roughly based on these things?",
                            "score": 4,
                            "author": "PoloGator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have written about them before… a legend in the st Lucia/Big Sur mountains. Not widely known outside that afaik.",
                    "score": 10,
                    "author": "Warshok",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They look terrifying.",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great map. Amazing work. Thanks for sharing!",
            "score": 42,
            "author": "intrsectingdssnance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 14,
                    "author": "NeilParkinsonMakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pitch these maps to a puzzle company, would make amazing puzzles.",
            "score": 39,
            "author": "mindbnder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Things in the pipeline 🤫",
                    "score": 39,
                    "author": "NeilParkinsonMakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can confirm that the Hodag is a very well known part of Northern WI folklore (more specifically, Rhinelander, WI).",
            "score": 16,
            "author": "norwegianEel",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How can you not have the Chupacabre?",
            "score": 88,
            "author": "sanctii",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Manbearpig should be on here for Colorado, I’m  super cereal",
            "score": 95,
            "author": "BAllen_TeachingNomad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except MBP isnt mythical it’s real.",
                    "score": 48,
                    "author": "WoodyDog",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He's half man, half bear, half pig",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks, Boo Hag will haunt me forever now",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Need one of these for Europe.",
            "score": 6,
            "author": "IamTheChickenKing",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No Champ?",
            "score": 7,
            "author": "pcans802"
        },
        {
            "level": 0,
            "comment": "No Gritty?",
            "score": 6,
            "author": "Fitz2001"
        },
        {
            "level": 0,
            "comment": "whers Will I Am",
            "score": 11,
            "author": "shitterfarter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah try google will am alones, buried under a million pages of will I am nonsense 😂",
                    "score": 10,
                    "author": "NeilParkinsonMakes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Witcher vibes",
            "score": 26,
            "author": "fra_fra_fra_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never a bad thing",
                    "score": 10,
                    "author": "NeilParkinsonMakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've never met anyone in south texas that's ever heard of El Muerto\n\nThe main \"monster\" that people are afraid of in the bottom half of Texas is \n\n1. The lechuza (a big scary flying bird)\n\n2. The chupacabra \n\nAlmost every kid, especially every latino kid knows what the lechuza is.",
            "score": 24,
            "author": "popsmoke05",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a South Texas native and was also not familiar with El Muerto so I Google it and the origin story is fascinating.  Here's the pertinent part with the full story linked below:\n\n&gt;In a dramatic example of frontier justice, Wallace beheaded Vidal then lashed him firmly into a saddle on the back of a wild mustang. Tying the [outlaw’s](https://www.legendsofamerica.com/outlaws/) hands to the pommel and securing the torso to hold him upright, Big Foot then attached Vidal’s head and sombrero to the saddle with a long strip of rawhide. He then turned the bucking horse loose to wander the Texas hills with its terrible burden on his back.\n\n&gt;Soon, stories began to abound about the headless rider seen usually in remote country, with its sombreroed head swinging back and forth to the rhythm of horse’s gallop.\n\n&gt;As time went on, more and more cowboys spotted the dark horse with its fearsome cargo, and not knowing what it was they riddled it with bullets. But the horse and its rider rode on and the legend of El Muerto, the headless one, began. Soon, the South Texas brush country became a place to avoid as El Muerto was credited with all kinds of evil and misfortune.\n\n[source](https://www.legendsofamerica.com/tx-elmuerto/)",
                    "score": 8,
                    "author": "texasrigger",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I grew up in Utah and didn’t know about the Bear Lake monster.  Sneaky guy",
            "score": 4,
            "author": "Symonyc",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m a Michigan native. Never heard of a nain rouge. We always talked about dogman. Also what about the Florida skunk ape?",
            "score": 5,
            "author": "ThisisKelsea",
            "replies": []
        },
        {
            "level": 0,
            "comment": "No Tahoe Tessy?",
            "score": 5,
            "author": "young_steezy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Easily the spookiest one.",
                    "score": 7,
                    "author": "LichPineapple"
                }
            ]
        },
        {
            "level": 0,
            "comment": "See also: [Fearsome Critters of North America](https://en.wikipedia.org/wiki/Fearsome_critters)",
            "score": 4,
            "author": "mayoroftuesday"
        },
        {
            "level": 0,
            "comment": "No Headless Horseman?  Disappointed.",
            "score": 3,
            "author": "PlainTrain"
        },
        {
            "level": 0,
            "comment": "Alaska's looks awesome",
            "score": 4,
            "author": "GeneralCraft65"
        }
    ]
}