{
    "id": "oz8zf8",
    "score": 61869,
    "title": "[OC] Territories where married gay couples can buy rifles to protect their marijuana plants",
    "author": "born_in_cyberspace",
    "date": 1628263848.0,
    "url": "https://www.reddit.com/r/MapPorn/comments/oz8zf8",
    "media_urls": [
        "https://i.redd.it/ce76y8kjarf71.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "While weed is legal in Washington state, it is not legal to grow your own. I don’t know if Washington belongs on this map.",
            "score": 2985,
            "author": "jonhasglasses",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is legal to grow your own for medical use in Washington State.",
                    "score": 423,
                    "author": "yanox00",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This should be the top reply. Washington definitely belongs in the map. Also, getting a medical license is very easy.",
                            "score": 122,
                            "author": "inquiring__mind",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same with Manitoba, Canada.",
                    "score": 932,
                    "author": "advocatus_ebrius_est",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That one was such a kick in the nuts. My family is out there and I was planning to grow there.\n\n\"This province is exceptionally well-suited to growing cannabis due to it's extra long growing season. You cannot grow here.\"\n\nWell fuck ok then.",
                            "score": 697,
                            "author": "Metalbass5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just dip your head into Ontario, drive a few hundred KMs east of Winnipeg and BOOM! 3 weed plants.\n\nYou’re also in the wild fucking west Siberia of Ontario where laws barely apply, and only the drunk and bearded survive.",
                                    "score": 65,
                                    "author": "Lt_DanTaylorIII",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol. Yeah that area is uhhh...Somethin'.\n\nI've got double plants thanks to my prescription, so I get 6. Not worth it now though because I have a cheap supply. If I move away from the city; then it's totally worth it again.",
                                            "score": 19,
                                            "author": "Metalbass5",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "YOU cannot grow here. gigantic industrial farming operations that rake in millions, however…",
                                    "score": 469,
                                    "author": "delcooper11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 95,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Next you're going to tell me that his entire handling of the pandemic has prioritized business interests over the health and safety of average Manitobans. Or that he's the sort to hire a PI to stalk your political rival or making horrifyingly tone-deaf commentary in the wake of the news about mass graves at former residential schools!\n\nShocked!",
                                                    "score": 46,
                                                    "author": "Bo_Buoy_Bandito_Bu",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The worst part is how he disappeared for a month in the middle of things.\n\nStrike that: the worst part is that he came back.",
                                                            "score": 20,
                                                            "author": "Basic_Bichette",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ding.",
                                            "score": 114,
                                            "author": "Metalbass5",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Pallister is a huge idiot. A greedy, shortsighted, arrogant idiot.",
                                            "score": 23,
                                            "author": "GiantSquidd"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Meh.  No one bothers me and I do it in the open… \n\nhttps://i.imgur.com/2QDJk28.jpg",
                                    "score": 5,
                                    "author": "Thehorrorofraw",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I thought that that is regulated at the federal level, and so everyone in Canada can grow up to 4 plants per household for personal use?",
                            "score": 44,
                            "author": "CanuckBacon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Federal laws allow Canadians to grow up to four cannabis plants at home for recreational purposes, but in Manitoba, there is a ban. Manitobans can only purchase cannabis at designated retailers, and anyone caught growing faces a $2,500 fine.” - https://winnipeg.ctvnews.ca/manitoba-man-challenges-province-s-recreational-cannabis-growing-ban-1.5288491",
                                    "score": 81,
                                    "author": "jakednake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Damn, that sucks",
                                            "score": 23,
                                            "author": "CanuckBacon",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'm in Newfoundland and had a setup with 4 plants for the last 2 years. I recently sold everything because I can't grow weed cheap enough compaired to what you can buy at the weed store. Isn't it great when your favorite thing in life gets so much cheaper.  What a wonderful world we live in!! Never thought I'd see the day.",
                                            "score": 17,
                                            "author": "MelaBella_13",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Further complicating things, while growing cannabis in the US is still a grey-area felony, storing or possessing firearms while growing can net you a grey-area *armed* felony. It's generally recommended to not have firearms on the same property as your legal weed, and growing compounds this. \n\nSo do we consider this if we're already ignoring the \"possession and manufacture of cannabis is still federally illegal\"-thing to begin with? I don't have the answer, but it's difficult to put together any accurate map relating to the legality of cannabis without it looking like a rainbow when you're done.",
                    "score": 151,
                    "author": "Jabrono",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This advice really fits into the saying, ‘If you’re going to (possibly) break the law, make sure you’re only breaking one law.’",
                            "score": 58,
                            "author": "hurricanedog24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Eh kinda, possession of a firearm isn't a crime, it just puts a nice little *armed* in front of whatever crime you are committing.",
                                    "score": 15,
                                    "author": "Jabrono",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In Illinois, it's legal to grow only if you have a medical cannabis use license, and there are a lot of rules about how you can grow.",
                    "score": 62,
                    "author": "raisinghellwithtrees",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 39,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; you can't own a firearm if you smoke\n\nSame in Michigan.",
                                    "score": 6,
                                    "author": "Bass_Thumper",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 113,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You could grow weed and not smoke it, I suppose. Nobody has done it yet but it works on paper.",
                            "score": 19,
                            "author": "morethanmacaroni",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I actually know a couple people that work at legal marijuana grow facilities and don’t use weed haha (not the same as growing at home I guess). They say they don’t like the feeling when using it themselves but it’s a good job.",
                                    "score": 13,
                                    "author": "Blackadder288"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"Your honor, do you have an understanding of biology? Over the next several hours I will explain, in detail, that it was actually the marijuana plant in my closet that divided its own cells, and therefore the plant is responsible for growing weed, not me.\"",
                                    "score": 12,
                                    "author": "FlingFlamBlam",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You could also add that the sun is complicit in this crime.",
                                            "score": 3,
                                            "author": "aqua_seafoam_"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I grow at home and don’t use. I give it to others. \n\nI just really love gardening, especially illicit gardening \n\nFuck the Man.",
                                    "score": 19,
                                    "author": "shah_reza",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Fuck the Man.\n\nAND you're already growing weed. All you need now is a rifle.",
                                            "score": 16,
                                            "author": "Ich_Liegen"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "haha I do this, I like it as a hobby and surprising my friends with goodies",
                                    "score": 3,
                                    "author": "dot-logic",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You're technically correct. They specifically ask about marijuana when purchasing a firearm even.",
                            "score": 36,
                            "author": "mr_tool_throw",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same with NJ",
                    "score": 32,
                    "author": "GoT_Eagles",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I mean, the entire US map is wrong assuming the people growing the weed are using it.",
                    "score": 7,
                    "author": "yajustcantstopme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I Michigan you can grow 12 plants per resident. Have 10 kids? That’s 120 more plants you can grow lol.",
                    "score": 4,
                    "author": "El_Bistro",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "South Africa and Uruguay are particularly surprising to me, but okay.",
            "score": 1141,
            "author": "NTMonsty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I was surpised too. \n\nIn general, the biggest limitation in most countries was the marijuana legalisation status. Many more countries allow both rifles and gay marriages.",
                    "score": 774,
                    "author": "born_in_cyberspace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just a btw, you can't protect property with deadly force in South Africa. Just your life and those of others.",
                            "score": 332,
                            "author": "imperator_rex_za",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And what reason you are buying the rifle for will also impact whether you will get a licence in the first place, so in this case the exact text of buying a rifle for the purpose of protecting your marijuana plant wouldn't be legal, even if buying a rifle and having a marijuana plant are both separately legal.",
                                    "score": 120,
                                    "author": "ThaumRystra",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you're protecting your marijuanna from wild animals, then you're good",
                                            "score": 47,
                                            "author": "_shpolo"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What if, genetically, you are a parent to the flowers?",
                                    "score": 15,
                                    "author": "2drawnonward5",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m concerned about your horticulture techniques.",
                                            "score": 29,
                                            "author": "neanderthalman",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's true for most countries in the world so I assume it's a very limiting factor too",
                                    "score": 20,
                                    "author": "PM_something_German"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Uruguayan here, firearm ownership is only legal if you're a hunter and in a few very specific cases, but otherwise it is not legal to own a firearm. If you extended that logic to other places then even in Spain where I live it is legal to buy a firearm and have your own marijuana plant.",
                            "score": 22,
                            "author": "ivomo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Venía a comentar esto. Gracias compatriota.",
                                    "score": 5,
                                    "author": "FoldthrustBelt"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Few countries allow use in firearms in protection of property.",
                            "score": 16,
                            "author": "mrcrabs6464"
                        },
                        {
                            "level": 2,
                            "comment": "Considering how Marijuana isn't particularly addictive or dangerous (Or, I don't think it is on it's own), I wonder why so many countries don't tolerate it.",
                            "score": 114,
                            "author": "NTMonsty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of the founding missions of the League of Nations and later the United Nations was the end of the global trade in drugs. This formally codified in the UN Single Convention on Narcotic Drugs (UNSCND). \n\nTechnically marijuana is still illegal everywhere (besides North Korea) as a matter of *international law*. Participating in the international community, i.e. being a member of the UN system, required individual states to ban all the drugs listed listed in the UNSCND. That's why even the Netherlands never formally legalized cannabis, it just \"tolerated it\".",
                                    "score": 52,
                                    "author": "CPlusPlusDeveloper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "its even illegal in the US, federally. Under obama this:\n\n[https://www.justice.gov/sites/default/files/oip/legacy/2014/07/23/holder-memo-charging-sentencing.pdf](https://www.justice.gov/sites/default/files/oip/legacy/2014/07/23/holder-memo-charging-sentencing.pdf)\n\nhappened, and it basically said that the feds would just look the other way and let states do their own thing",
                                            "score": 27,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, you're definitely right about it still being illegal at the federal level in the US. However in Canada, Mexico, Uruguay, South Africa, and Georgia it *is* legal nationally. But still illegal under international law. North Korea is the only country where it's legal both as a matter of national and international law (since NK never signed the UNSCND).",
                                                    "score": 25,
                                                    "author": "CPlusPlusDeveloper",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 12,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "apparently it grows like a weed there",
                                                                    "score": 5,
                                                                    "author": "AwesomeBantha",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lobbying, mostly by pharmaceutical companies.",
                                    "score": 146,
                                    "author": "Kvalri",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But medical marjuana could be a product. What's the logic here?",
                                            "score": 27,
                                            "author": "Rizal95",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In recent years (since 1996) pharma has pushed patented opioid formulations such as OxyContin that had high margins. Marijuana, being not patented would not be very lucrative.\n\nThat said, it doesn’t explain why they would have cared in the 70s when they made it illegal. I think racism/moral panic of the 70s is a better explanation.",
                                                    "score": 79,
                                                    "author": "ACA2018",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "https://youtu.be/uy-VZHqwWNM\n\nYes",
                                                            "score": 7,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Marijuana was made illegal in the 70s, when opiates would have been a generic drug and not a huge money maker for pharma. It wasn’t until the 90s that the big opiates push happened with Perdue patenting OxyContin.",
                                            "score": 22,
                                            "author": "ACA2018",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Alcohol companies too",
                                            "score": 65,
                                            "author": "tehvolcanic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It used to be the cotton lobby.",
                                                    "score": 37,
                                                    "author": "SagaStrider"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not really.  The only contribution against legalization I've found is from 2010 and it was the California Beer &amp; Beverage Distributors.  The CBBD got backlash from a lot of its members for their stance:\n\n&gt; A statement from Sierra Nevada said that the company has “requested the CBBD to remove our name from their list of members, and also to disassociate the brewery from this and any future political actions.”",
                                                    "score": 26,
                                                    "author": "huskiesowow",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Us war on drugs",
                                    "score": 37,
                                    "author": "Northgates"
                                },
                                {
                                    "level": 3,
                                    "comment": "Marijuana is definetly addictive. I feel loke anyone who says otherwise doesnt no anyone who smokes or are addicted themselves and their in denial",
                                    "score": 4,
                                    "author": "redeemer4",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think defending plants with guns is seen as very questionable in many countries, and would probably be illegal.",
                            "score": 4,
                            "author": "SpaceShrimp"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "South Africans are pretty conservative, but our constitution is Liberal as FUCK. Super progressive legislation as a result. \n\nGetting a gun licence is a bit of a process. But Gay marriage and growing you own weed (only for personal use at home) is pretty easy.",
                    "score": 72,
                    "author": "Kindly_Sky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think by American standards, South Africans are quite liberal in many respects. Abortion, gay rights, religious beliefs.. Massive generalisations, but that is my experience anyway.",
                            "score": 20,
                            "author": "nmaunder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "With regards to public opinion on gay marriage South Africa and the US are virtually identical according to a recent poll: [https://www.ipsos.com/sites/default/files/inline-images/Views%20on%20same-sex%20marriage%20by%20country%20-%20Ipsos.png](https://www.ipsos.com/sites/default/files/inline-images/Views%20on%20same-sex%20marriage%20by%20country%20-%20Ipsos.png)",
                                    "score": 18,
                                    "author": "whoami_whereami"
                                },
                                {
                                    "level": 3,
                                    "comment": "It depends a LOT on demographics. Middle and upper class (still mostly European descendant) tend to be much more conservative AND economically capitalist than the rest. Then you get into more rural, poorer, regions or communities; you might find very conservative views as far as relationships, marriage, and social structure is concerned. Economic views might be very slanted to socialist policies however.  \n\n\nEven on gay marriage, in many rural and traditional communities people are still excluded and ostracised for just BEING gay. Nevermind actually marrying or having a partner. I lost all my friends and support of some of my family for eventually coming out as an atheist for example.\n\n&amp;#x200B;\n\nYouth culture and in cities have the biggest social media presence, they tend to shape how we view the \"country\" but are in no way and indication of general social/cultural ideals. South Africa is a MASSIVELY varied place as far as these aspects are concerned.",
                                    "score": 18,
                                    "author": "BottleRocketU587",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I thought it was pretty difficult to get a firearm in Uruguay, but I guess it is the 8th most in per-capita civilian gun ownership in the world.",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 52,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That makes sense. I lived in Uruguay and didn't feel like there were lots of guns, particularly in the city.",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was surprised about rifles being legal in Uruguay. Uruguay is more progressive than the average western country so gay marriage and marijuana doesn’t surprise me.",
                    "score": 38,
                    "author": "Neither_Research_225",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Actually we are one of the countries with more weapons per capita here in Uruguay.",
                            "score": 38,
                            "author": "leojg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Uruguay nomá",
                                    "score": 9,
                                    "author": "frannv__"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's a lot of ranching in Uruguay. Over 50% of their land use is dedicated to meat livestock production. There's probably a lot of rifles down there.",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We have 3.5 cows per human in Uruguay (Average of 3.5 million people)... So yeah... There is a lot of rural areas to protect.",
                                    "score": 19,
                                    "author": "Ramza1987"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Also while firearm ownership is a very liberal-conservative culture war in some countries (looking at you US) that doesn't necessarily extend to all countries.",
                            "score": 14,
                            "author": "Utretch"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 801,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You'll end up in jail unless the plant is inside your home and the thief entered armed.",
                    "score": 208,
                    "author": "arturocan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 183,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The thing is you are never gonna be sure wether or not is it about the plant or not.",
                                    "score": 122,
                                    "author": "arturocan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bien pensado",
                                            "score": 36,
                                            "author": "AlexisGPS_UY"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dead men tell no tales. \n\nAt that point it's your word.",
                                            "score": 20,
                                            "author": "Start_button",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 81,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nothing wrong with 223",
                    "score": 15,
                    "author": "guitarock"
                },
                {
                    "level": 1,
                    "comment": "you’re smoking crack if you think a 9mm is better than .223 rifle",
                    "score": 8,
                    "author": "rewanpaj",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": ".223 is a powerful round?  A .223 semi with a 10 round mag would be a really effective weapon.",
                    "score": 8,
                    "author": "Thus_Spoke",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And unlike a 9mm pistol you can probably hit someone further than ten yards away.",
                            "score": 6,
                            "author": "SonOfMcGee"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This whole map is wrong. Every example in this post is either inaccurate or nuanced beyond the point where it isn't plausible.",
                    "score": 5,
                    "author": "WarrenPuff_It",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Classic r/mapporn",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Se escapó otro de r/uruguay!",
                    "score": 5,
                    "author": "ramenmangaka"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're allowed to have one marijuana plant in Belgium, but no more than that. You can buy rifles, but you need a licence for that and gay marriage was legalised in 2003 over here.",
            "score": 1853,
            "author": "Leiegast",
            "replies": [
                {
                    "level": 1,
                    "comment": "All marijuana is illegal in Belgium. It is a myth that you can have one plant or that less than 3 grams is permitted. They probably won't persecute you but it's illegal.",
                    "score": 316,
                    "author": "MrCoconutNut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 44,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup you're right. In Dutch they're interchangeable. Not in English :).",
                                    "score": 24,
                                    "author": "MrCoconutNut",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can you shoot trespassers in Belgium?",
                    "score": 392,
                    "author": "CompactBill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can buy firearms to defend yourself, but according to Belgian law, the defence has to be proportional to the attack, so you can't just shoot people trying to steal your one marijuana plant.",
                            "score": 866,
                            "author": "Leiegast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But what if it's really good marijuana?\n\nBelgium belongs on the map.",
                                    "score": 375,
                                    "author": "menvadihelv",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Permits and a nation registry?  1984!\n\nIt is not the government's business to know I own roughly 4,000 rifles.",
                                            "score": 107,
                                            "author": "GumdropGoober",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Neither do they need to know its more than one plant...",
                                                    "score": 24,
                                                    "author": "alanairwaves",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 101,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can't in Canada either, and you need a license which is a much more strict procedure than in the US. This map is not exactly correct.",
                                            "score": 42,
                                            "author": "WarrenPuff_It",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There have been numerous cases where someone drunkenly or by accident stumbles onto a property and they're shot and killed and nothing happens.\n\nHell, one such case caused a huge diplomatic issue with Japan. And after the acquittal the court room cheered too. \n\nhttps://en.wikipedia.org/wiki/Shooting_of_Yoshihiro_Hattori",
                                            "score": 31,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So you cannot buy a rifle to protect your mamajuana plant",
                                    "score": 77,
                                    "author": "CompactBill",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well you can, but only if the attackers have guns. If they have swords then you have to sword fight.",
                                            "score": 132,
                                            "author": "hglman",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I heard gay men are good at sword fights",
                                                    "score": 84,
                                                    "author": "Leiegast",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "May I bring my Schwartz to the sword fight?",
                                                            "score": 15,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I see your Schwartz is as big as mine.",
                                                                    "score": 7,
                                                                    "author": "Dread_39"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Does it come out of a cereal box?",
                                                                    "score": 7,
                                                                    "author": "The_Glass_Cannon"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "that's the belgian spirit",
                                                    "score": 9,
                                                    "author": "nirrita"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You can, but you have to use it as a club.",
                                            "score": 13,
                                            "author": "TemptedTemplar"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can't shoot trespassers in Canada unless they are also armed with rifles. So this map would be wrong based on your criteria.",
                            "score": 17,
                            "author": "FalconThe",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Exactly. This map isn't showing what the title claims it does, and that's because of 'protect.' The number of jurisdictions where you can also use lethal force against trespassers or to protect property, where there's no threat of lethal force against you, is smaller.",
                            "score": 10,
                            "author": "John-Mandeville"
                        },
                        {
                            "level": 2,
                            "comment": "Good heavens, I'm glad you can't.",
                            "score": 3,
                            "author": "hydrocharis",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Post does say \"plants\" so I guess it's still accurate",
                    "score": 38,
                    "author": "ajlunce",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it one plant per household? Otherwise they should be able to buy one plant each.",
                            "score": 6,
                            "author": "Helahalvan"
                        },
                        {
                            "level": 2,
                            "comment": "They are a couple so they could have two plants",
                            "score": 3,
                            "author": "Bayoris"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Used to be true, but the 'gedoogbeleid' or the let's-look-the-other-way law has been cancelled some years back. Making the possession, cultivation and using of marijuana fully illegal again.",
                    "score": 3,
                    "author": "vanchauvi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just to point it out: Technically speaking you can legally own a non-military gun in my state Jalisco, but you need to go to Federal capital Ciudad de México to get the permit, and it's very hard to get (At least the last time i checked), so at least 71% of the guns on the whole country are illegal.\n\nAlso, it's legal the gay marriage on my state, but funny enough, even when my state is considered \"a gay house\", it's also a \"religious house\" so basically there are the 2 extremes here.",
            "score": 446,
            "author": "Foxwanderr",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Technically speaking you can legally own a non-military gun \n\nPlus you must have already completed the military service\n\nTo all non-Mexicans:\n\nThe military service in México almost all the time (it's up to the state) is not related with military things, you wash military vehicles, pick up garbage on the street, do excercises while the sun is killing you, paint schools, etc. Every saturday morning for one year.\n\nMost of times you are not even taught how to propertly use a weapon",
                    "score": 91,
                    "author": "NervousJellyfish1015",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And that's even considering if you got \"bad luck\" to make the service. Half the time you get the exempt so you have no need to do nothing at all.",
                            "score": 42,
                            "author": "Foxwanderr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yeah, white and black ball lottery. \n\nThose exempted guys are very lucky.",
                                    "score": 34,
                                    "author": "NervousJellyfish1015",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My generation ('99 born) didn't have to do any military service at all, at least in my city, so I don't know if the lottery thing is still going on in other places.",
                                            "score": 20,
                                            "author": "AntonioVonMatterhorn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Here in Monterrey is still going on.\n\nI was told by a guy from Tabasco, that they only need to sign some paperwork and that's it, but I am not sure about it.",
                                                    "score": 16,
                                                    "author": "NervousJellyfish1015",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly, Torreon and surrounding cities do that as well.",
                                                            "score": 4,
                                                            "author": "AntonioVonMatterhorn",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I see, here and all the country is not mandatory but if you want to work at anything related with the government or buy guns you must get it first, it's very annoying.\n\nThank God, it's not longer needed to get a passport, buy a house or any other paperwork.",
                                                                    "score": 4,
                                                                    "author": "NervousJellyfish1015"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lmao yes, I'm from Jalisco too and its fun to see the extremes lol",
                    "score": 26,
                    "author": "_Goldie_Man_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes, the utterly religious, open minded, socially conservative, drug allowing, authority loving, gun permitting, high taxing, fiscal heaven, highly regulated, lawless state of Jalisco",
                            "score": 6,
                            "author": "okthenbutwhy",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's kinda funny to use the Spanish name for Mexico City in an otherwise English reply",
                    "score": 8,
                    "author": "McCoovy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don't think that would be considered a context where firearm ownership is generally \"legal\"",
                    "score": 44,
                    "author": "amaduli",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"it's legal-enough, I paid the right people.\"",
                            "score": 54,
                            "author": "SagaStrider",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's legal enough to be \"legal\", not enough for most people the government doesn't want owning guns (basically any civilians without government connections) to get them legally.",
                            "score": 22,
                            "author": "richalex2010",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a very big legal gray area in the US becuase the Federal government says its a nono to posses firearms and Marijuana. Also several of the listed states have a duty to retreat under their state laws so using a firearm to protect \"plants\" probably won't end well.",
            "score": 98,
            "author": "Not2TopNotch",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah why did I have to scroll so far to see this? you cannot legally own a firearm and even be around marijuana, let alone be a user.",
                    "score": 28,
                    "author": "carbonarr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only half of redditors are American, fewer still actually own firearms. It's right on the 4473 with a brief note that it's still illegal federally to possess and use marijuana even if your state has legalized it.",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Speaking of gray area, all of the US should be gray on this map. I guess private sales are one thing but you'd be committing a felony if you lied on 4473 21.e if you wanted to be a part of this incorrect map.",
                    "score": 5,
                    "author": "richardeid",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don’t think it’s really a gray area at all considering how blatant the federal law on this subject is. Don’t get me wrong, as a former pot smoking gay who loves a day at the range, I would *love* to believe there was some shred of truth to this map but alas I learned the law instead.",
                    "score": 4,
                    "author": "Afraid_of_Okapi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a Canadian with an RPAL, you cannot use a firearm as a means to protect yourself in Canada.",
            "score": 320,
            "author": "charvey709",
            "replies": [
                {
                    "level": 1,
                    "comment": "There’s few situations where it can be legally argued by a good lawyer but it would still be one hell of a legal battle and the judge would likely not care. \n\nOne I can think of is you’re out in the woods, carrying a loaded gun which is legal, and someone tries killing you either with their own gun or some other kind of weapon. You try to flee, are unable to do so, so you shoot them. The gun wasn’t stored illegal, wasn’t possessed illegally, and you matched deadly force with deadly force.",
                    "score": 150,
                    "author": "Kansbol",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is one of those very niche scenarios where it's justified. It's not impossible to defend yourself with deadly force in Canada, it's just a hard threshold to pass.\n\nCould you disengage? No.\n\nDid you legally have your firearm out? Yes.\n\nWas your life *OBJECTIVELY* at risk? Yes.\n\nAre you sure you had absolutely no opportunity to flee or disengage? These are just some of the questions that will be asked and expected to be answered in court.",
                            "score": 91,
                            "author": "Tirus_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 40,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because your firearm should be locked and stored in a safe, with ammunition secured seperately by law.\n\nSo if someone enters your house you have to explain how/why you were able to unlock your firearm AND the seperately kept ammunition and use it instead of just running away to safety.\n\nYou would basically need to be in a room with no exit and your firearm and have the intruder advance on you with clear intent to kill you to get away with shooting them.\n\nHuman lives &gt; property in Canada. You are expected to abandon your property instead of shooting someone.",
                                            "score": 105,
                                            "author": "Tirus_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The ammo and gun being stored separately only applies to restricted weapons and their respective ammunition. I keep my guns and ammo in the same safe since I don’t have an RPAL and I’ve had police look in my safe and say everything is fine.",
                                                    "score": 52,
                                                    "author": "Kansbol",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When someone breaks into a home in the middle of the night, it seems unreasonable to wait and see if they are there to hurt you or take your stuff, especially if you are a woman, physically disabled, or just meek.",
                                                    "score": 17,
                                                    "author": "ArizonaHusky",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I own guns and would defend myself as well; but, as an anecdotal counter argument I remember reading a story about a teen sneaking back into his house through the window after staying out too late and his dad shot and killed him thinking it was an intruder.\n\nThat's why I sleep in a locked bedroom.  If people want to steal my TV, etc in my living room so be it but if anyone tries to break down my door they're getting shot.",
                                                            "score": 9,
                                                            "author": "56Giants",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What happens when you have an avenue of escape, but other family members don't/are unable to use one? A window might be high enough that trying leave through it could cause injury, especially if the person in question is a child without training.",
                                                    "score": 7,
                                                    "author": "TheChucklingOak",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don't understand the whole \"human lives&gt; property\" argument. \n\nIf someone breaks into my house to steal my property, they are the ones who value property over lives. Specifically, they value my property more than their own life and that of my family. \n\nIf someone breaks into my house, there is a good chance they will be getting shot. I hope I never have to fire my guns in anger, but if it comes to protecting my family (and my property), I will.",
                                                    "score": 28,
                                                    "author": "Impulse350z",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You absolutely do have a right to use a firearm to protect yourself in Canada — but only if your life is in imminent danger. You definitely cannot use a weapon or force to defend your property.",
                    "score": 55,
                    "author": "mikejaytho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can use force to defend your property. Just not lethal force. You can only use \"reasonable force\" to remove the person from the property, or remove the property from the person.",
                            "score": 14,
                            "author": "adaminc",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is the correct answer. You don’t even need a good lawyer. You will be charged with all the crimes and you will spend your time leading up to court in remand; but there’s a good chance you’ll be found innocent",
                            "score": 4,
                            "author": "agentSMIITH1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Came her to comment exactly this.   \nOk to own certain firearms, but not for protection.",
                    "score": 17,
                    "author": "Casgrain",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You can't use a gun to protect your weed plants from being stolen.\nUnder very specific circumstances, you could maybe get away with using a gun to defend yourself in a life or death situation though.",
                    "score": 25,
                    "author": "backwoodsofcanada",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Under VERY specific circumstances but be prepared for a several year long court case where every aspect of the scenario is picked apart with a fine tooth comb.",
                            "score": 9,
                            "author": "Tirus_",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the map of gay, rifle owning, marijuana growing married couples. \n\n\nNot the map of gay, marijuana thief killing, married couples.",
            "score": 200,
            "author": "LegsideLarry",
            "replies": [
                {
                    "level": 1,
                    "comment": "Correct.",
                    "score": 58,
                    "author": "born_in_cyberspace",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh Canada.",
            "score": 136,
            "author": "gtjbao",
            "replies": [
                {
                    "level": 1,
                    "comment": "This a a glorious day for Canada; and therefore, the world",
                    "score": 94,
                    "author": "aristot3l",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And the little mushroom people of Nova Scotia cheer on",
                            "score": 16,
                            "author": "Dookiefresh1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "TBF in Canada you need license to even buy a gun, unlike in US.",
                    "score": 15,
                    "author": "mangofizzy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "…Manitoba",
                    "score": 6,
                    "author": "El_Bistro",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 111,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was looking for this comment. You cannot legally protect your marijuana plants in Canada. Canada has extremely tough self defence laws. Almost anything is considered murder.\n\nBut technically it depends on your interpretation.\n\nYou can legally buy a rifle. It depends whether “legally” refers only to buying a rifle, or if it extends to the entire clause.",
                    "score": 17,
                    "author": "BlueButYou",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I agree, it's an important note. \n\nAlthough you don't *have* to use deadly force for the rifles to be helpful in self-protection.",
                    "score": 39,
                    "author": "born_in_cyberspace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can't grow your own weed in Quebec and in Manitoba, which are Canadian Provinces.",
                            "score": 22,
                            "author": "notreallyanumber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Technicaly in Québec it was overturned by supreme Court. Its currently in the grey area regarding growing at home. Federal law says you can and it overrules provincial law. I think it's in appeal currently.",
                                    "score": 8,
                                    "author": "hater_roger",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well in Canada even pointing or brandishing a gun at someone will catch you a charge.",
                            "score": 4,
                            "author": "iroxnoah",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You also can't legally own any firearms while owning or consuming Marijuana in America.  It's not Federally legal regardless of state law thereby immediately voiding your 4473 background check with the ATF.",
                            "score": 9,
                            "author": "firesidedm",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/oddlyspecific",
            "score": 77,
            "author": "Elmoslightpole",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a very common saying in the libertarian community... We have loved unregulated guns, unregulated gays, and unregulated weed since the very beginning.",
                    "score": 84,
                    "author": "total_carnage1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;  unregulated guns\n\nwell don't tell that to the west coast I guess",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "New Jersey unfortunately does not legally allow you to grow marijuana plants, though they did recently make it legal to own and use marijuana",
            "score": 43,
            "author": "Tape_measure",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same for Quebec, no growing for us",
                    "score": 22,
                    "author": "J-B_L",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And Manitoba, though there is currently a Charter challenge in Quebec (which was successful at the court of first instance).",
                            "score": 12,
                            "author": "advocatus_ebrius_est"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "FYI, it’s against federal law to possess a firearm while possessing or under the influence of a scheduled narcotic. Now don’t worry, there’s not enough federal agents to come take your guns if you have pot. But technically... they could regardless of the state law\n\nEdit: Would be helpful to say I’m talking about the US.",
            "score": 47,
            "author": "cwn1180",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm glad someone said this. Nowhere in the US can you legally own a firearm and have Marijuana at the same time. Until it is federally reclassified, it is still very much a felony.",
                    "score": 30,
                    "author": "indica_please",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Isn't possession of Marijuana also illegal federally?  Even though they don't enforce it in legal states.",
                    "score": 5,
                    "author": "oversized_hoodie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oklahoma's medical marijuana program allows patients to grow their own plants so gay married couples could legally protect their marijuana plants with rifles there as well. I should note that in Oklahoma a medical marijuana card is insanely easy to get to a point where it is nearly a recreational program. (They have issued over 400,000 cards which is roughly 10% of the entire state's population)",
            "score": 26,
            "author": "DougEatFresh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this. 6 adult plants and 6 juvenile pants iirc.",
                    "score": 6,
                    "author": "clowens1357"
                },
                {
                    "level": 1,
                    "comment": "I was fixing to say, here in Oklahoma, there’s a dispensary by the dispensary by the dollar store and then another dispensary.",
                    "score": 6,
                    "author": "divisibleby5",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Gol dang i BUSTED in through this door to yell about this, THANK you. We have so, so little… THEY CANT TAKE THIS ONE FROM US 😤",
                    "score": 4,
                    "author": "soup_party"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah Virginia, the North of the South",
            "score": 26,
            "author": "KillroysGhost",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not so progressive now, are you, Nordic countries? 👀👀\n\n/s",
            "score": 114,
            "author": "SwiggittySwagg",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the most clever of the original maps I’ve seen. \n\nThis brought me joy. Ty.",
            "score": 124,
            "author": "Exrudis",
            "replies": [
                {
                    "level": 1,
                    "comment": "It isn't accurate though.",
                    "score": 22,
                    "author": "WarrenPuff_It",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "But is incredible wrong. The law in South Africa only allows you to use weapons to protect human life, you can't use it to protect marihuana, Washington doesn't allow you to grow marihuana, and many more errors.",
                    "score": 47,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "And the whole thing is wrong. It is illegal in all states to purchase a firearm if you consume or possess marijuana",
                    "score": 7,
                    "author": "Swolebrah",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guns, Ganja and Gays sounds like a very interesting show plot",
            "score": 6,
            "author": "Kookiebanookie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think Colorado is the only in the states where you can do all of those without a permit, and even then you're still federally committing a felony.",
            "score": 14,
            "author": "SirZerty",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If that’s not freedom I don’t know what is",
            "score": 88,
            "author": "SomeRandomRealtor",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 20,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hahahaha...wait...no, don't shoot!",
            "score": 5,
            "author": "TraditionalCherry"
        },
        {
            "level": 0,
            "comment": "Oh, New Hampshire, wake up and smell the taxes.",
            "score": 5,
            "author": "takeyoufergranite",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Where it's legal to grow marijuana plants, we don't need rifles to protect them 👍",
            "score": 5,
            "author": "economyx"
        },
        {
            "level": 0,
            "comment": "Of course Uruguay is there",
            "score": 3,
            "author": "RichardSilsa"
        },
        {
            "level": 0,
            "comment": "  I'm Canadian, so let me start off by saying, I'm sorry.\n\n  Ok, now that I got that out of the way, in Canada you will be arrested for trying to protect anything with a firearm. \n\n  Once again, I'm sorry.",
            "score": 4,
            "author": "dr3wapictur3"
        },
        {
            "level": 0,
            "comment": "This is quality content.",
            "score": 24,
            "author": "stasismachine",
            "replies": []
        }
    ]
}