{
    "id": "11uu5w1",
    "score": 7,
    "title": "Cal Poly student class size",
    "author": "Bolt_Bucket",
    "date": 1679159961.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/11uu5w1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I have been admitted into Cal Poly and I am curious as to what college life would be like. I remember hearing that Cal Polys's class size was relatively small at around 20-40 students depending on the class. Is this the case? Thank you!\n\n&amp;#x200B;\n\nedit: thank you so much for your help!\n\n&amp;#x200B;",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah largest classes I've had were around 100 students and that was only since 1 was a GE and the other was an orientation class for everyone in my major. I do see there are some classes in the PAC and I have no idea how large those get\n\nPretty much high school class sizes if not a little smaller or bigger",
            "score": 14,
            "author": "VidaOnce"
        },
        {
            "level": 0,
            "comment": "Highly dependent on what level your class is. GenEds (aka history, psych, etc) are often about 125 people. Support classes (chem, physics, maths) run at about 40-50 students. Major classes are usually smaller, especially later on in the curriculum. The smallest class I’ve been in is an 18 person major specific class. Most of the time my major classes are about 30. Honestly, most classes (other than the few large ones) feel like my high school classes. It’s fairly easy to interact with professors in smaller classes. Most of the classrooms are similarly sized to my high schools.",
            "score": 10,
            "author": "benjaminl746"
        },
        {
            "level": 0,
            "comment": "Registering for class can suck because of small class sizes. Just to keep in mind. I rarely get the schedule I want.",
            "score": 7,
            "author": "sxmacy"
        },
        {
            "level": 0,
            "comment": "It is for major courses. I had a few big lectures for lower-level GE classes (like TH 210) and for lower level support courses (CHEM 127/128/129 had large lectures but the labs were small group, same for the PHYS series) but once you're through that it's all smaller class sizes taught by the professors themselves",
            "score": 3,
            "author": "girl_of_squirrels"
        },
        {
            "level": 0,
            "comment": "Classes are taught by professors (not teaching assistants) and class sizes (for major classes) are about 30 students. Expect a high school-like experience. In some other universities there are large lecture halls that hold 100s of students, and classes are often taught by graduate students.",
            "score": 3,
            "author": "innerthai"
        },
        {
            "level": 0,
            "comment": "My major has concentrations (like a added focus of study on top of your major). And in the class I'm in for the focus I chose, there is only like 10-15 students",
            "score": 2,
            "author": "cardhat_21"
        },
        {
            "level": 0,
            "comment": "Another thing to consider is the teacher:student ratio. At Cal Poly, you will almost always be taught by a professor, whereas in a lot of UC's or other big schools, you're gunna be taught by a lot of grad/teaching assistants. You may have a lab or two here that's taught by a GA, but almost every lecture/seminar will be taught by a real professor.",
            "score": 1,
            "author": "GIS_wiz99"
        },
        {
            "level": 0,
            "comment": "Typically, lecture sections are capped to 40 seats and lab sections to 20 seats. Some GE courses may have larger lecture sizes.",
            "score": 1,
            "author": "Available-Ad-6745"
        },
        {
            "level": 0,
            "comment": "They sometimes have classes in the PAC which is huge, but that was for a lower level GE (psych?)",
            "score": 1,
            "author": "ILikeScrubJays"
        }
    ]
}