{
    "id": "11ywroa",
    "score": 11,
    "title": "Community College Transfer for Computer Engineering",
    "author": "xxlalo32xx",
    "date": 1679519376.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/11ywroa",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone, \n\nI got accepted into Cal Poly SLO last evening as a Computer Engineering major. If you were a transfer to CP SLO, could you state your GPA in community college and your GPA at SLO for preferably Computer Engineering. Any major is welcome to participate. Also, how rigorous are the classes? I'm anxious about transferring.",
    "comments": [
        {
            "level": 0,
            "comment": "CPE Fall transfer 2022. Cumulative gpa 3.24 coming into calpoly from Las Positas college. Entire transfer cohort got wrecked coming in, we all passed though with decent grades. Prepare your asshole. CC was nothing in comparison.",
            "score": 12,
            "author": "Secure_Hospital7168",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m lubing up my asshole right now",
                    "score": 3,
                    "author": "xxlalo32xx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am a CPE major that came in as a transfer in Fall 2022.\n\nMy cumulative GPA coming in was around 2.6, but I think I am an outlier for GPA acceptance. My Cal Poly GPA last quarter was a 3.03 and I expect to get roughly around that this quarter as well.\n\nDepending on the classes you will have taken in CC, you might have an easy first couple quarters, but the major related classes are not something to be taken lightly. Specifically if you get credit for CPE 133 - there is essential experience in a program called Vivado that you need for CPE 233 and beyond. Not many CC's offer Vivado experience and even those that do often do not provide the same equivalent background knowledge for 233.\n\nAn issue we are facing is that almost all the classes we take are major related. This means a huge workload. We study and do homework for roughly 10 hours a day including weekends, so do not expect to have a lot of free time during the meat of the quarter.\n\nThe most important part, for me, was forming a large and knowledgeable cohort. Without it, I would 100% have failed both of my circuit classes/computer science class.",
            "score": 10,
            "author": "Sourcow"
        },
        {
            "level": 0,
            "comment": "TL;DR: Prepare Your Anus. Also informative stuff.\n\nCPE Fall Transfer 2022 from FHDA, GPA 3.35.\n\nThe entire transfer CPE class of 2022-3 is aware of your post and we'll help you cuz of how hard we got Fucked, but Prepare your Anus.\n\nThis past year, the entire transfer cohort for CPE majors got used as guinea pigs for the new transfer curriculum for circuits and the classes are tough (great professor, just a bit too much info crammed in for 315). It's certainly starts manageable, but be warned that the new curriculum basically means your prior circuits experience (if you took it) no longer transfers.\n\nYou will transfer into this and the difficulty ramps up severely. If you don't have priority enrollment, you'll be unable to get into the CS classes you need (or want) to take.\n\nAlso make sure you have SOME GEs to take because the upcoming classes will test your sanity and work ethic. CSC 357 is infamously hard, and the current transfer flowchart will likely have you taking it with CPE 333, ANOTHER infamously hard class. You want an easy course to be able to do these important things like chores.\n\nTake CPE 133 (digital design) even if you have credits in it, unless you know how to use Xlinx Vivado (I HIGHLY advise you take Prof. Hummel) and know SystemVerilog. That class will basically be How to Vivado 101 and prep for CPE 233.\n\nWanna take 16 units? Do that only in Fall and Winter. It goes downhill from there.\n\nWork? LOL.",
            "score": 9,
            "author": "piledriven1",
            "replies": [
                {
                    "level": 1,
                    "comment": "My condolences, I can’t imagine the ass stretching that you received.",
                    "score": 2,
                    "author": "xxlalo32xx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I transferred 2022 for CS with a 3.89 gpa. The classes move faster Bc quarter system and since calpolys slogan is learn by doing I found myself having more projects that were either more hands on or transferred over to the workforce better.",
            "score": 3,
            "author": "Ianmccurry11"
        },
        {
            "level": 0,
            "comment": "Chabot or LAS POSITAS?",
            "score": 2,
            "author": "tyroneblevins445"
        },
        {
            "level": 0,
            "comment": "Ag Sci transferred with a 3.8 gpa. My classes have been pretty chill so far and I generally have obtained A’s and B’s",
            "score": 2,
            "author": "1047janitor"
        },
        {
            "level": 0,
            "comment": "Fall transfer 2021, came in with a 3.4 cumulative. \n\nMy Cal Poly GPA is a 2.97 lmao.\n\nIf I can give you any advice, I’d say learn to manage your time appropriately the first year you’re here. Coming from CC, I think we had a lot of time on our hands to hang out with friends/family. It’s important that you let them know you things won’t be the same, and it’s important you tell yourself this too. I tried to commit to family gatherings + hanging out with friends at my hometown (2 hours away) and it really stressed me out, ESPECIALLY because I tried to do this while adapting to the quarter system.\n\nAlso, if you’re living off-campus make sure you get comfortable setting a dedicated amount of time to cooking + cleaning up. It can eat up a lot of time depending on what you make lol\n\nLastly, enjoy your time here! With so much studying and stress, I think it’s easy to forget that you’re doing all this because you have a passion for CPE. It’s awesome to come to this university and meet people coming from different backgrounds sharing the goal. Don’t worry about how hard classes are going to be, enjoy the time you have now. They don’t compare to CC classes, but adapting to the grind set is something you’ll learn once you’re here. If you have any questions, feel free to DM me 👍 congrats on your acceptance!",
            "score": 3,
            "author": "bigyikesroblox"
        },
        {
            "level": 0,
            "comment": "3.19 \nEE but what’s the difference \nPretty rigorous",
            "score": 1,
            "author": "Top-Incident4252"
        },
        {
            "level": 0,
            "comment": "I have 3.53 GPA most transferable courses complete and have yet to even hear back… 3 year at SDCCD…",
            "score": 1,
            "author": "SilverCrab2666"
        }
    ]
}