{
    "id": "120rkp6",
    "score": 7,
    "title": "Any good places to fish in the area?",
    "author": "PizzaTimeBruhMoment",
    "date": 1679679083.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/120rkp6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming student, just wondering if there’s any good places around to fish",
    "comments": [
        {
            "level": 0,
            "comment": "depends what kind of fishing. my roommates and i have set up small crab traps and done a little bit of spear fishing. i always see folks fishing off the piers in pismo and cayucos",
            "score": 8,
            "author": "squeezyscorpion"
        },
        {
            "level": 0,
            "comment": "Morro bay is awesome to go out on a charter boat for rock and ling cod but quite expensive for a college student. Lots of pier fishing along the coast, haven’t done much fresh water fishing here although Lake Lopez, Santa Margarita, and Lake Cachuma are options.",
            "score": 5,
            "author": "sjstirl"
        },
        {
            "level": 0,
            "comment": "If you have a kayak you can go out to port San Luis or you can always just fish off the dock.  Some people surf fish for perch from the beach too.  As far as freshwater lake Lopez and Santa margarita are nearby but the shore fishing can get rough because of the reeds.",
            "score": 3,
            "author": "dats_tuff45"
        },
        {
            "level": 0,
            "comment": "I'd give Cayucos a try! There's not many people around so it's more peaceful than Morro",
            "score": 2,
            "author": "lthlinne"
        },
        {
            "level": 0,
            "comment": "I always go surf fishing on the right side of Morro Rock",
            "score": 2,
            "author": "Zealousideal_Wave358",
            "replies": [
                {
                    "level": 1,
                    "comment": "any luck?",
                    "score": 1,
                    "author": "thatcloakdoe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Morro bay is great from the pier (just to catch small fish). Gotta use lugworms though",
            "score": 2,
            "author": "Formal_Ad_1761"
        },
        {
            "level": 0,
            "comment": "Have had some good luck at Avila for surf perch, if you get lucky you can get some that are 12+ inches",
            "score": 1,
            "author": "DaChefOnline"
        },
        {
            "level": 0,
            "comment": "A friend of mine has had luck at Laguna Lake. I haven't personally, but it's scenic at least.",
            "score": 1,
            "author": "aw5ome"
        }
    ]
}