{
    "id": "126x5i7",
    "score": 6,
    "title": "People who were originally rejected from Cal Poly Slo, appealed the decision and were later accepted. What did you write? and what advice do you have for someone currently writing their appeal?",
    "author": "sofeetuh",
    "date": 1680205387.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/126x5i7",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Backstory: I got rejected as a transfer student for Fall 2021, appealed and got in for general engineering, then switched to mechanical. \n\nFor my letter, I highlighted my unconventional academic career. Essentially, I went to community college right after high school and transferred out to UCSB for sociology. Quickly, I realized that was not the career path for me and went back to community college. There, I decided to pursue engineering and caught up on pre-reqs to transfer to Cal Poly. Then, I mentioned how this is a reflection of my determination and work ethic. Most of the paper was about this experience.\n\nI also briefly mentioned how I would be a great addition to the campus, and how Cal Poly provides a great educational opportunity for me like no other state school. Basically, a bunch of ego-stroking about Cal Poly lol. \n\n&amp;#x200B;\n\nMy advice is to just go for it. Think about why you care so much about going here, and reflect it in your writing. I shot my shot on a whim, and I even accepted to attend SJSU at the time. Also, I think acceptance really depends on your major, because I strategically applied to general engineering which is certainly easier to get into than mechanical. Regardless, just do it anyway.",
            "score": 4,
            "author": "ArtfulPizza",
            "replies": [
                {
                    "level": 1,
                    "comment": "How long was your letter? I'm tryna write mine, but I'm not sure how much/what I should talk or focus on",
                    "score": 1,
                    "author": "RoastedPineapple50"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dm me!",
            "score": 0,
            "author": "wackywandaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can't dm you. What did you write/what makes a compelling letter to cal poly?",
                    "score": 1,
                    "author": "SilverCrab2666"
                }
            ]
        }
    ]
}