{
    "id": "12bz2jb",
    "score": 4,
    "title": "Housing as a transfer",
    "author": "deadlight446",
    "date": 1680647469.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/12bz2jb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a transfer student for the fall of 2023. I was wondering if anyone would share their experiences finding housing off campus. \n\nI found out mid-March that I was accepted and have been looking since then but i either do not get responses from listings or there are ridiculous requirements like monthly income being 3x rent.",
    "comments": [
        {
            "level": 0,
            "comment": "Cal poly housing group on Facebook",
            "score": 3,
            "author": "rsaithi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Guess I have to a make a facebook account lol",
                    "score": 2,
                    "author": "deadlight446"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You might have to get your parents as a consigner, (which I think is horrible, but my fiance had to do it), and then just make sure you are responsible and your parents don't disown you because you did something stupid.",
            "score": 3,
            "author": "pendragonbob"
        },
        {
            "level": 0,
            "comment": "Hey, transfer student here from fall of 2022! My best advice is to join the cal poly Facebook housing group! That’s how I found a room off-campus in which I live with 3 other cal poly students! Usually renting a room in a house with other students is a cheaper alternative imo!",
            "score": 1,
            "author": "Traditional_Big2860"
        },
        {
            "level": 0,
            "comment": "Valencia. About $1200 per mo.",
            "score": 1,
            "author": "Tenaflyrobin"
        },
        {
            "level": 0,
            "comment": "Are you looking for housing for the whole year? I am currently looking for a subleaser for summer and fall and I’m pretty flexible if ya want more info.",
            "score": 1,
            "author": "kcm1002",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, i looking for a whole year, sept-july",
                    "score": 1,
                    "author": "deadlight446"
                }
            ]
        }
    ]
}