{
    "id": "12isdi6",
    "score": 4,
    "title": "Register only for WOW?",
    "author": "Legitimate-Time2644",
    "date": 1681236882.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/12isdi6",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve heard many say SLO days isn’t worth attending but WOW definitely is. On the reservation site though, i can’t seem to skip SLO days to get to the WOW part, it’s forcing me to choose a reservation for SLO days.\n\nHas anyone been able to book slots just for WOW and skip SLO days?",
    "comments": [
        {
            "level": 0,
            "comment": "No you have to register for both",
            "score": 9,
            "author": "rhinguin"
        },
        {
            "level": 0,
            "comment": "There will be some overlap in content, but you’re required to attend both.  SLO Days is only 1.5 days, so if you use the opportunity to meet a few people it can be decent. WOW tends to be a lot more fun though.",
            "score": 5,
            "author": "otterpopsrock"
        },
        {
            "level": 0,
            "comment": "SLO Days/Week of Welcome (WOW) Overall Exemptions\n\n\r  \nAll first-year and transfer students are required to register and attend orientation (SLO Days and the Week of Welcome). In rare and extenuating circumstances, a student may be granted an exemption from attending all or part of orientation. Circumstances may include a medical need, family circumstances, or inability to travel to San Luis Obispo at the time of sessions. \n\nAdditionally, if our department is unable to accommodate another available SLO Days session, this would qualify as a request for exemption. \r  \n\r  \nRequest to be exempted from SLO Days must be received by Friday, June 30, 2023 (5:00 p.m. PST) Exemption requests for Week of Welcome must be received by Friday, September 1, 2023 (5:00 p.m.). Failure to submit requests prior to the allotted deadlines will result in an immediate denied request. \r  \n\r  \nDocumentation may be required as part of the request, and it is not guaranteed an exemption.\r  \n\r  \nFreshman Students: All first-time freshmen students attending an in person SLO Days session are required to stay on campus in provided accommodations during the overnight portion of the session. Students may request an exemption from the overnight component for the following reasons only: \r  \n\r  \n\\-Live within or stay with family that lives in San Luis Obispo County \r  \n\\-Medical need or other extenuating circumstances \n\n\r  \nOrientation fees will remain the same regardless of whether or not the student is granted an exemption from the overnight segment of SLO Days. Overnight accommodations are not provided for registered supporters. The university provides one night of accommodations for students as part of their session. Please check our website for additional information on recommended supporter accommodations. \r  \n\r  \nAll requests for Overnight Exemptions must be received by Friday, June 30, 2023 (5:00 p.m. PST). Transfer Students: Overnight accommodations are not included with the registration for both students and guests. \n\nForm: https://docs.google.com/forms/d/e/1FAIpQLScOVL3gTy1OeuL3BXDzX1AJcP5a7YZYFRqW-ZoV\\_KtIaIUXYg/viewform?usp=send\\_form",
            "score": 2,
            "author": "Crafty_Cheesecake_20",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately wow week starts during rosh Hashanah. If my student fills out the form stating that they'll miss the first two and a half days, it should be approved, correct?",
                    "score": 1,
                    "author": "Awkward_Donut_1351",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can ask them.",
                            "score": 1,
                            "author": "Crafty_Cheesecake_20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would probably be not a good look for the uni because it would look anti Semitic. I'll check with them directly\n\nEdited: to be clear the response I left was related to their original response which was:\n\n\n\"I don't think you can ask for an exemption for that reason\"",
                                    "score": 1,
                                    "author": "Awkward_Donut_1351",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good, can you share the result here? Hopefully, they allow it.",
                                            "score": 1,
                                            "author": "Crafty_Cheesecake_20"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "just go to SLO days, it wasn't bad enough to make a huge fuss out of skipping",
            "score": 1,
            "author": "thegreatcolander"
        }
    ]
}