{
    "id": "12j01n7",
    "score": 0,
    "title": "So how hard was it to get into CS?",
    "author": "HellenKilher",
    "date": 1681252022.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/12j01n7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied to Cal Poly sort of last minute because I read about it’s CS program. I also saw that the acceptance rate was like 3% (?) so I basically forgot I even applied but I somehow got in.\n\nI know acceptance rate shouldn’t really be a factor when choosing a school but I just want to get an idea of how lucky I got or if the stats I’m seeing online are just outright wrong. \n\nAlso if anyone that is currently taking CS can tell me what it’s like that would be great.",
    "comments": [
        {
            "level": 0,
            "comment": "It's 3% because so many people apply compared to the other majors. \n\nFound this posted by someone else in the subreddit, don't remember where. \nhttps://content-calpoly-edu.s3.amazonaws.com/ir/1/images/Enrollment%20Projections_2023-24.pdf\n\n7,200 people applied to CS this year, but only 1,400 and 1,200 applied to CpE and EE this year, respectively. Both CS and EE are projected to admit ~200 people (100 for CpE).\n\nIncidentally, that's how I got into CS. I originally applied to EE in 2017, switched to CpE, and finally CS.",
            "score": 11,
            "author": "hydroptix",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think these numbers are for the number of enrolled students though, so the acceptance rate for admitted students would probably be higher",
                    "score": 8,
                    "author": "alyssvmseeds",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah, probably true. I have heard that they admit more than they expect to enroll since not everyone accepts.",
                            "score": 2,
                            "author": "hydroptix"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Jesus Christ wtf",
                    "score": 4,
                    "author": "HellenKilher"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The cs program here is amazing!! Poly cs is an interesting situation in that we’re an amazing and selective program that doesn’t really play the prestige game. Because of that some people i’ve met chose poly over less selective schools and other people chose it over more. IK at least for me and my friends that are in cs, we picked cal poly over schools like ucsd, ucla, georgia tech, boston u, hamilton, tufts, northeastern, duke, uw, etc if that’s any indicator to you of how strong our program is. The professors I’ve had (starting my upper divs now) have also all been phenomenal and the opportunities are amazing, especially considering the market rn (got an on campus apple interview within like a month of starting college).\n\nthat being said, the acceptance rate for cs is a little higher than 3%, that’s the admit rate (meaning it doesn’t account for yield) our total yield rate is 27% but it’s likely higher for engineering and specifically cs. So i’d guess our cs acceptance rate is closer to 6-8%. (still harder to get into than a humanities major at cornell 😒)",
            "score": 3,
            "author": "bel_cant-sing-o"
        },
        {
            "level": 0,
            "comment": "The same thing happened to me last year (cs, might switch to cpe). Ended up committing here, and def do not regret it. Feel free to dm me if you'd like me to talk abt my experience here.",
            "score": 3,
            "author": "kaweees",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why are you considering switching to cpe? It will be harder to get into certain CSC courses",
                    "score": 1,
                    "author": "Accomplished_One_977",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; \"The struggle itself towards the heights is enough to fill a man's heart. One must imagine Sisyphus happy.\"  \n&gt; ― Albert Camus, The Myth of Sisyphus\n\nI believe that CPE is the right choice for me, as the intersection of hardware and software fascinates me, and I'd like to have a holistic, if a not complete understanding of the layers of abstraction that encompass a computer, from the transistor to an enterprise application. This is not really useful particularly useful, but it encompassed a majority of my interests since middle school. I might not switch though because of the priority problems it might cause, but I'm definitely going to take cpe courses as tech electives.",
                            "score": 1,
                            "author": "kaweees"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No one here knows the CS acceptance rate. The College of Engineering acceptance rate is 22% fyi. [academic profiles](https://www.calpoly.edu/about/academic-profiles)",
            "score": 3,
            "author": "geosyog3"
        },
        {
            "level": 0,
            "comment": "IIUC it’s definitely the major with the highest bar",
            "score": 2,
            "author": "Taiwanese-Tofu"
        },
        {
            "level": 0,
            "comment": "Explain financial leverage at a 3rd grade level",
            "score": 2,
            "author": "CowardlyPoster1"
        },
        {
            "level": 0,
            "comment": "It's much easier to get in for CS vs Psychology: [https://www.sanluisobispo.com/news/local/education/cal-poly-university/article274047625.html](https://www.sanluisobispo.com/news/local/education/cal-poly-university/article274047625.html)",
            "score": 1,
            "author": "Dreamin_CA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last I checked, the CS admission rates were not included in this data for some reason.  \n\n&amp;#x200B;\n\nHaving said that, the PSY admission rates have traditionally been the lowest at CP for many years now.",
                    "score": 1,
                    "author": "daifukuYum"
                }
            ]
        }
    ]
}