{
    "id": "12ohe8k",
    "score": 1,
    "title": "EOP",
    "author": "Mean_Solid3392",
    "date": 1681664747.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/12ohe8k",
    "media_urls": [],
    "other_urls": [],
    "postText": "EOP has granted me a contract to attend their program, and I will soon be a freshman. Should I do it? I'm interested to learn more and see if it has any effect on me. I was also given the opportunity to enroll to be a Cal Poly Scholar, which I accepted and listed as my first choice for RLC. Suppose I accept EOP, how does that change?",
    "comments": [
        {
            "level": 0,
            "comment": "I am on both EOP and scholars. I think it's totally worth both, their requirements are super easy and they have good resources!",
            "score": 5,
            "author": "kurumexX",
            "replies": [
                {
                    "level": 1,
                    "comment": "What are the requirements for them?",
                    "score": 2,
                    "author": "Mean_Solid3392",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mostly just keep relatively good grades, be a full time student and not get in trouble. There are more specific ones for each as a first year, you can find on their websites. I know that for EOP you have to meet once a quarter with a counselor, to check your classes, grades and how you are doing. And for scholar's you have to go to at least 3 events that they have.Again, I would recommend looking into their website!",
                            "score": 5,
                            "author": "kurumexX"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know about EOP but assuming you have to choose between them, go CP Scholar. you get a free macbook, airpods, and priority enrollment. You also get a personal counselor.",
            "score": 2,
            "author": "frostyblucat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently you can enroll for both or well that’s what I’ve get told",
                    "score": 1,
                    "author": "Mean_Solid3392"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can be in both programs but I think if you join programs like EOP or TRIO then they override your scholars rlc. Dont really worry too much though because scholars, eop and trio are all usually grouped together anyway for housing. Scholars just gets more choices in room picking.\n\nI didnt do eop simply because I didnt feel like writing anything but if you want more award money then you should. I dont know that much about the program activities but I don't think its a big time commitment either.",
            "score": 1,
            "author": "SignificanceLiving42",
            "replies": [
                {
                    "level": 1,
                    "comment": "So if I accept EOP I can still receive the Cal Poly Scholars benefits, just not when it comes to housing?",
                    "score": 1,
                    "author": "Mean_Solid3392",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Accept the EOP because you will get aid/money from it \nI hella regret rejecting it just for housing preference",
                            "score": 3,
                            "author": "designerpandapanda",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I don’t like how they change your housing preferences so that’s why I’m just kind of debating on it",
                                    "score": 1,
                                    "author": "Mean_Solid3392",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am a scholar and when I was living in scholar housing it was scholar/EOP/Trio\nSo it might not change anyway and you could get extra money. I'd definitely take it",
                                            "score": 2,
                                            "author": "potate-the-tater",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Alright then. Thank you!",
                                                    "score": 1,
                                                    "author": "Mean_Solid3392"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes you will receive both benefits. As for housing, thats what happened when I joined trio at least but you can always email an eop coordinator or housing and get insight for this upcoming year because who knows if they've changed it",
                            "score": 2,
                            "author": "SignificanceLiving42"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do both! Cal poly scholars gives you a laptop and I believe EOP gives you or helps you with priority registration. I could be wrong on that priority registration part.",
            "score": 1,
            "author": "Chr0ll0_"
        },
        {
            "level": 0,
            "comment": "Do both. EOP is a great program and a small community. Scholars offers many resource for you to be successful as well. There are many scholars and EOP students so you end up in an RLC with others that are both EOP and scholars just like you. At the end of the day there are no cons for EOP.",
            "score": 1,
            "author": "Internal_Book5876"
        }
    ]
}