{
    "id": "12yqufw",
    "score": 0,
    "title": "Cal Poly SLO or UC Davis",
    "author": "Goddessjolyn",
    "date": 1682445531.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/12yqufw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im a senior right now and im deciding between UC Davis and Cal Poly SLO. I’m also considering community college but it’s nothing to do with the financial part, it’s more to do with I’d be more comfortable doing a CC. The biggest factors I’m considering are the chances I’d have at finding a job after college. I want to be something combining business and math (operations research, financial, wtv). If you guys have any input regarding this please tell me because I want to make a decision before may first.\n\nOther factors:\nWill need loans for cal poly, not UC Davis\nUC Davis 3.5 hrs from home, Cal Poly 2.5 hrs\nLive in a Latino community\nDon’t have a car\nIm ok living in communities where there’s not much to do \nWant to do lots of internships\nNeed a job right after college (I need to support my mom, she’s a single mother)",
    "comments": [
        {
            "level": 0,
            "comment": "Not trying to be down on you, but sounds like finances will be a big concern. If you don't need loans to go to UCD, go there. \n\nCollege costs more than tuition, and SLO is an expensive town.",
            "score": 7,
            "author": "ILikeScrubJays",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yeah for sure. I actually appreciate that and yeah it’s definitely an expensive town. Does UC Davis even have good future job prospects though?",
                    "score": 1,
                    "author": "Goddessjolyn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think UCD would have fine job prospects. Get involved in clubs that relate to your major. Look for internships, even your first year. Apply early and often. Network wherever you go as much as possible.",
                            "score": 7,
                            "author": "ILikeScrubJays"
                        },
                        {
                            "level": 2,
                            "comment": "UC Davis is a great school. I don't know much about their business program, but it's one of the more reputable UCs.",
                            "score": 1,
                            "author": "terracottatown"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Davis is also an expensive town fwiw",
                    "score": 1,
                    "author": "Unfair_Tonight_9797"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; Other factors: Will need loans for cal poly, not UC Davis\n\nThen UC Davis wins! They're both excellent schools, but debt free for undergrad is the way to go. Also you and your mother may need to have a tough conversation about finances if she needs additional support from your financially. It may be worth having her contact 211 and social services in her area to see if she can get any benefits to help out too",
            "score": 2,
            "author": "girl_of_squirrels"
        },
        {
            "level": 0,
            "comment": "I am close to people at both institutions.  Cal Poly has a more southern California culture, while Davis is more northern Cal while both have a strong agricultural influence.   Both are solid places to go and you literally can't make a wrong choice here.  Both SLO and Davis have a high cost of living.  Cal Poly is known for it's motto learn through doing which isn't just a slogan but an actual theme running through the school.  It's more vocational that way, for example finance majors can assist in running the school endowment for their senior project.  Not sure if you're interested in accounting, but a B average in the business school w/ an account emphasis will guarantee you a job with the big 4 firms.  Davis on the other hand will have more opportunities to take part in research as it's a full UoC with a vibrant post baccalaureate program.",
            "score": 1,
            "author": "morallyagnostic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know whether Davis’ alumni network &amp; connections are less beneficial than SLO’s? Thank you for the information though. UC’s in general being research universities is a downside for me, for sure as I only want to do 4 years if I can.",
                    "score": 1,
                    "author": "Goddessjolyn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Both are strong, I'd give the nose to Davis if your working along the 80 corridor, but to SLO if your in SL/SD.   Central Valley - it's a toss up as both are excellent ag schools.",
                            "score": 1,
                            "author": "morallyagnostic"
                        }
                    ]
                }
            ]
        }
    ]
}