{
    "id": "1398sjw",
    "score": 0,
    "title": "Will I have a better chance at transferring in if I attend Cal Poly Humboldt or UC Santa Cruz?",
    "author": "i_need_a_username44",
    "date": 1683338760.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/1398sjw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Ok basically just what the title says. I'm currently a senior in high-school, and while I was rejected from SLO this year, I want to try to transfer next year. I just got off the waitlist at UCSC to major in Psychology and I have until May 12th to decide if I'm accepting the offer to get off the waitlist, or if I'm staying with my original school Cal Poly Humboldt(also majoring in psych). I picked Humboldt originally because it is a Cal Poly and I figured that would give me an edge when it came to transfering, but UCSC is definitely the better school so what do you think? Stay in the Cal Poly system or go to UCSC?",
    "comments": [
        {
            "level": 0,
            "comment": "going to a four year university will be detrimental to your application. Public universities in California take mostly from CCs. If I have any advice, if Cal Poly is your top choice, then go to your local CC and transfer as a Junior.",
            "score": 12,
            "author": "WrensPotion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha honestly yea I know that would be smart, but I definitely want to do a 4 yr. My mom went from a CC to UCLA her junior year, and she said she wouldn't do it again. It definitely helped her, but she never got to have the real freshman yr \"college experience\" at her CC, and by the time she did transfer, a little bit of the magic that 4 year colleges have to highschool seniors who are ab to become real adults was gone",
                    "score": 2,
                    "author": "i_need_a_username44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then go to cuesta.",
                            "score": 1,
                            "author": "Ironmxn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would start at Santa Cruz.  There’s no reciprocity between the Cal Polys, so there’s no inside benefit to going to Humboldt if your goal is to transfer.  Keep in mind that Cal Poly only accepts junior (not sophomore) transfers, and the criteria for transferring is very major-specific, so be sure to look that up on the admissions website.  Also, just being candid that Cal Poly’s psych program is super competitive for admissions.  This year, Cal Poly anticipates enrolling 73 out of 3,579 first time freshman applicants for psychology and 39 out of 717 new transfer applicants.",
            "score": 6,
            "author": "otterpopsrock"
        },
        {
            "level": 0,
            "comment": "Gonna be real with you, as someone that grew up in a small town near arcata, it sucks. High crime rates, housing is expensive, not much to do at all, economy is bad, somewhat dangerous. A few nice farms towns around are safe but honestly I would not recommend going to Humboldt for college.",
            "score": 3,
            "author": "ThePanzerwaffle"
        },
        {
            "level": 0,
            "comment": "What’s wrong with UCSC, I would just take your chances there.",
            "score": 3,
            "author": "KingsIgnoramus"
        },
        {
            "level": 0,
            "comment": "Just go to CC save $$$ and transfer to Cal Poly",
            "score": 3,
            "author": "Chr0ll0_"
        },
        {
            "level": 0,
            "comment": "Go the route that has the least amount of debt. All schools are ABET accredited so it really does not matter. Employers don't care about your college only that you had a decent GPA and had internships. All California schools are overcrowded and expensive.",
            "score": 3,
            "author": "Ok_Green3543"
        },
        {
            "level": 0,
            "comment": "What do you intend to do with your degree?",
            "score": 2,
            "author": "Unfair_Tonight_9797",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not super sure yet of what specific career I want to do, but I know I want it to be some form of helping people and less of the research/experiment stuff. I want to do either a broad practice for anyone like general therapy or something more serious and specialized, like helping children with severe ASD or people with PTSD",
                    "score": 1,
                    "author": "i_need_a_username44",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So you will likely need a master’s degree correct?",
                            "score": 1,
                            "author": "Unfair_Tonight_9797",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes most likely but maybe not. One thing I'm leaning towards right now is doing suicide hotline work bc as far as I'm aware you only need a bachelor's in Psychology, and doing work that is both time and location flexible would give me an opportunity to go to auditions (I act) but if I end up really getting passionate about a field that requires further education then I have no problem doing that",
                                    "score": 1,
                                    "author": "i_need_a_username44",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Go to cc.. for this type of degree there is no reason to go into debt than you need to. Than transfer to whichever fits your budget. Your ROI on this degree is low.. so you do t want to be encumbered with a massive amount of debt.",
                                            "score": 6,
                                            "author": "Unfair_Tonight_9797"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "California Public Schools take very few people outside of the sophomore/junior transition.  If you hope to transfer, your chances will be improved if you spend 2 years wherever and get your GEs filled.  A great GPA and teacher recommendations always help since the SAT isn't part of the application process at that point.",
            "score": 1,
            "author": "morallyagnostic"
        }
    ]
}