{
    "id": "13m7qrm",
    "score": 1,
    "title": "How much free time do you guys have?",
    "author": "UIGiren69",
    "date": 1684530322.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/13m7qrm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Title.\n\nI'm an incoming transfer, and I plan to take 3-4 courses per quarter (which I know is a lot), but I think that's the only way I'll be able to finish in 2 years without summer (I'm a CS major). I was just wondering if you guys have like 2-3 day weekends of a good amount of free time often since I would like to drive down to LA or back to SF occasionally for other reasons.",
    "comments": [
        {
            "level": 0,
            "comment": "Sorry to say, 3-4 classes isn't a lot if you don't have other commitments (like a job, etc).\n\nThat being said, even with 4 classes depending on what those classes are you will have plenty free time or very little.",
            "score": 23,
            "author": "SrgManatee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I took 4 classes a quarter (math major), every quarter,  and worked 30 hours a week, every week.\n\nBetween those two things and studying/homework my time was mostly filled but even then I still had free time.\n\nYou will never have as much free time or as little responsibilities as when you are in college.",
                    "score": 9,
                    "author": "StaggeredRay"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a cs major, you will not have much if u are taking 4 cs classes. Many cs courses are extremely project heavy and grindy. If u have some GEs mixed in and are a fast worker, then it’s reasonable that you’d be free 2 days a week though. There are just some courses that can be legit 30+ hours per week commitments like 357, 454, 464, PL. depends on the courses and depends on your abilities. I personally work ~60 hours a week, but I’m taking 3 cs classes, a ge, and my senior project rn",
            "score": 3,
            "author": "kooknerd"
        },
        {
            "level": 0,
            "comment": "I was a transfer for unrelated major but commuted daily to campus. Daily because realistically it's where I could get studying done.\n\nAs a result, I was in the library 7 days a week.\n\nSaturdays, no one was in there. \n\nBut on Sundays, it would get packed! Sundays in the library is a thing. So based on this, I would say 1 or 1&amp;1/2 free days a week on average.\n\nI had so many classmates that would go live their best lives on the weekends and pull all-nighters on weeknights to catch up. I would get texts from teammates working on their portion of our group projects at 3 am lol.\n\nI had one professor openly admit that if it was between studying and going to Coachella (for example), she would choose Coachella and pay the consequences in class after lol.\n\nCongrats on getting to Cal Poly! Make sure to have fun, time goes by quick!!!!!!!!",
            "score": 1,
            "author": "UglyOutsideAnInside"
        },
        {
            "level": 0,
            "comment": "No",
            "score": 0,
            "author": "CactusEgg"
        }
    ]
}