{
    "id": "13tgxb2",
    "score": 9,
    "title": "Polyratings",
    "author": "Free-Honey753",
    "date": 1685218222.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/13tgxb2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do people use polyratings regularly? It kind of seems like a lot of the reviews are 5+ years old. For some context I'm looking at engineering courses and I guess my question is is there somewhere better I should be looking?",
    "comments": [
        {
            "level": 0,
            "comment": "[This](https://polyratings.dev/) is the new one and you can find up to date reviews and ppl currently posting.",
            "score": 24,
            "author": "Doggomp3",
            "replies": [
                {
                    "level": 1,
                    "comment": "From looking at my past professors, it seems like only 1 out of every hundred or more students who have taken a class actually post a review.",
                    "score": 2,
                    "author": "Emexectr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I mean that’s more of a student problem, I’m just pointing out the website",
                            "score": 3,
                            "author": "Doggomp3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "rate my professor is still active. poly ratings has been read only for a bit. i believe there’s a different version that might have updated stuff",
            "score": 12,
            "author": "WrensPotion",
            "replies": [
                {
                    "level": 1,
                    "comment": "okay cool, yeah I was thinking rate my prof but I looked for a couple prof a bit ago and couldn't find them? Probably just a fluke",
                    "score": 1,
                    "author": "Free-Honey753"
                }
            ]
        },
        {
            "level": 0,
            "comment": "About a year ago we launched a new site as a part of my senior project at https://polyratings.dev. Over the course of the last 12 months or so we've added about 1000 new ratings for professors?\n\nWe're still actively maintaining, and improving the site to continue making sure it's around and useful for students!",
            "score": 4,
            "author": "A-T390",
            "replies": [
                {
                    "level": 1,
                    "comment": "seconded I have posted on here and this is pretty active",
                    "score": 1,
                    "author": "wackywandaaa"
                },
                {
                    "level": 1,
                    "comment": "that's less than 0.05% of the student population if we assume everyone only has one professor a year.  it's even worse if you look assume 12 or 16 professors a year.  if no one is using your website that's a website problem",
                    "score": 1,
                    "author": "RollerSkatingHoop"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just use RMP. Polyratings always just gets revived by some new slacker kid in CSC every couple years to fill in as their senior project and then abandoned after they get a job\n\nEvery year this argument comes up again.\n\nTaking users from RMP, a service that will last a long long time and receive continuous support and updates, just hurts the overall student base in the long run.\n\nMuting replies to this because I’ve heard all the bad arguments about this already over the last many years",
            "score": 3,
            "author": "aerospikesRcoolBut",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it's muted idrc, the senior project from last year is:\n- Still Up\n- Actively receiving new professors and ratings\n- Being maintained and improved by alumni and current students\n\nWe're trying to fill the gaps of reviews from when \".com\" went read-only, but we're not at the point where we're some lazy, half-assed alternative that's gonna shut down tomorrow.",
                    "score": 1,
                    "author": "A-T390",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it's been like one year.  that's what every person who makes a new polyratings says and then it disappears its happened like 4 times",
                            "score": 1,
                            "author": "RollerSkatingHoop"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Polyratings died a few years ago. There have been a few websites made since with all the old info copied over but nothing new really seems to get added",
            "score": 2,
            "author": "entrluzrnaam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Makes sense, I thought it was pretty cool how many reviews there are then I was like damn 2008 for some of these most recent reviews",
                    "score": 1,
                    "author": "Free-Honey753",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The new polyratings is polyratings.dev and it's used and updated often",
                            "score": 3,
                            "author": "ATMisboss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think I looked at it and it had the same reviews for one prof dated to 2008 but I’ll check some others, thanks!",
                                    "score": 1,
                                    "author": "Free-Honey753"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}