{
    "id": "13y3qsg",
    "score": 2,
    "title": "Golf courses at Cal poly",
    "author": "Dry_World_4601",
    "date": 1685682858.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/13y3qsg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Are there good golf courses in the area? I can only go to close ones since I’m gonna be a freshman next year.",
    "comments": [
        {
            "level": 0,
            "comment": "Plenty of good choices but none are really close to campus. Laguna lakes is my personal favorite because it’s 10 holes and very cheap to play. I’d try to find someone with a car and carpool. That would be your best bet.",
            "score": 6,
            "author": "impulsivetobias"
        },
        {
            "level": 0,
            "comment": "For beginners Laguna Lake is close and does the trick, nothing to write home about though. Not a full size course and not exactly nice.\n\nDairy Creek is the closest full size course but is just 9 holes, tucked in the rolling green hills, pretty reasonably priced. \n\nMorro Bay is one of my favorite munis. Only like $20 for students to walk with views or the bay. Just beautiful.\n\nBest courses in the area are Hunter Ranch in Paso (35 min north), Monarch Dunes in Nipomo (30 min south, and Cypress Ridge in Arroyo Grande (20 min south). These are all full size, well kept, and more expensive, but still a great deal compared to equivalent courses in other parts of CA.",
            "score": 5,
            "author": "2005hondapilot"
        },
        {
            "level": 0,
            "comment": "Avila Beach golf resort is one of the better courses near slo, but it will cost you an pretty penny. Dairy creek is a decent 10 hole with a “top golf” type driving range. Morro Bay is decent along with chalk mountain in Atascadero.",
            "score": 1,
            "author": "Unfair_Tonight_9797"
        },
        {
            "level": 0,
            "comment": "Dairy Creek course and Laguna lake golf course",
            "score": 1,
            "author": "rsaithi"
        },
        {
            "level": 0,
            "comment": "Morro is by far the best in terms of how well its kept and it’s the prettiest. Also the most expensive but 6 bucks more than Dairy for a prettier course and 9 more holes is more than justifiable. Dairy isn’t awful either, and it’s the closest to campus. Laguna is the cheapest but you get what you paid for in terms of quality.",
            "score": 1,
            "author": "jackloot"
        },
        {
            "level": 0,
            "comment": "Monarch Dunes in Nipomo is expensive af (relative to the others listed here) but their 12-hole \"Challenge Course\" is a fun par 3 track. Much better than Laguna Lake if you've got the time to drive there and back. Plus they've got a proper range.\n\nChalk Mountain in Atascadero can get gnarly hot but it's a decent price for what it is. Hole 10 is kind of a clusterfuck though and there's a part during the back 9 where it's really easy to hit towards the wrong green by mistake.",
            "score": 1,
            "author": "rediffusion9826"
        }
    ]
}