{
    "id": "1430ara",
    "score": 3,
    "title": "Major Support Course Change and Petition...etc...",
    "author": "Zesty_Musky_Muskrat",
    "date": 1686103546.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/1430ara",
    "media_urls": [],
    "other_urls": [],
    "postText": "Well, I'll try to make this short but I'm just feeling defeated and unsure what to do. I'm a 3rd year micro major. My issue is with o-chem 2 (CHEM 217). For the microbio major, you're only required to take o-chem 1 and 2 (CHEM 216 and 217). I took o chem 1 (CHEM 216) last winter, had a terrible time with a teacher who did not teach (she drew out 2 mechanisms the entire quarter), and got a flat C. I then obviously went to take o chem 2 spring quarter 2022, but ended up doing a late drop of the class for mental health reasons. I'm currently in o chem 2 (CHEM 217) again. I don't know if I'm gonna pass (with a C-) it, and I just feel so defeated by the course, and it's not like I haven't studied. I'm just dumb and terrible at chemistry. I can't really do an emergency withdrawal for mental health reasons again for the same course, because I'm sure they won't buy that shit, even though my mental health is shit all the time and I do have suicidal thoughts quite frequently, along with severe OCD shit. I've taken and am taking all kinds of meds, etc. I don't want it to be an excuse but it won't make sense to them that I can do fine in other classes but just not this one because of mental health...\n\nI was wondering if anyone has experience with major support course changing. The thing is, I already took biochem, and got a B. We have a choice in microbiology whether to take CHEM 369 (formerly chem 371--principles of biochem) or 314 (formerly chem 313, survey of biochem). You don't need chem 217 to take chem 314, which is what I took and passed fine. So, if I've taken o chem 1 and bio chem, why do I even need o chem 2? O chem 2 is only meant for my major to prepare you for biochem principles 369/371, as it is only a prerequisite for CHEM 369/371, NOT CHEM 313/314. Would it be possible to argue that I don't need to take CHEM 217 and could replace it with something else? I was thinking quantitative analysis or something like that as a replacement. I just hate it here at cal poly and want to be done. I can't do o chem, my mental health is shit, and I feel like I'm killing myself over a course I don't even need in the first place.  I am studying, I still have a final in o chem 2 rn that is worth 40% of my grade next Thursday, but I don't know. I had an exam worth 20% of my grade today that I just felt terrible about and I'm already at like barely a 70% in the class.\n\nAny advice or experiences would help. Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": " Have you thought about asking the DRC for support regarding this? Regardless If registered or not if you went to them for advice on what to do I’m sure their help would weigh some assistance in your situation.\nThe DRC helped me out so much when I had mental health episodes, esp. when I failed Organic Chemistry and had to retake one. The amenities really helped all around make the experience of having to retake the class a lot less traumatic",
            "score": 4,
            "author": "Lets_just_be_random",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am with the DRC, what kind of support do they provide for stuff like this? I did try to sign up for the study session for CHEM 217 before the quarter started and they changed the CHEM 217 sections to CHEM 218 study sessions...I went and asked if I could stay in one of the CHEM 218 ones and still get help for CHEM 217 (they were both taught by the same guy), because literally 4 people total signed up between the two study session times...but he said he requested they change them to CHEM 218 and he didn't want to stop the session to teach me other stuff.",
                    "score": 3,
                    "author": "Zesty_Musky_Muskrat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://registrar.calpoly.edu/student-form-request\n\nI am also a 3rd year mcro major. I course substituted a class not on our 19 major elective units successfully and my friend is currently in the process of getting Bio 263 swapped for another class due to a time conflict with Med Mcro (also successfully). I do not know if they would let you switch it, but you can always try and make the case that you already took Biochem and will substitute with a more relevant chemistry course to whatever your goals are.",
            "score": 4,
            "author": "_ForestQueen_",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you do have to retake chem 217 after all, I would recommend waiting until you can take it with Kantarowski if possible; I also failed it the first time because of mental health reasons but it was way easier when I retook it with him and he's a lot more chill than some of the other ochem professors. As 1 mcro major to another feel free to reach out at all in general, some of our classes are painful but some can be fun and maybe we'll have classes together in the future :) I believe in you!",
                    "score": 3,
                    "author": "_ForestQueen_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's like barely any micro majors I probably know you anyway lol? Are you in cell bio rn? I actually took it with Dr. K last time and he expects way more than Frantz who I have rn ;\\_;",
                            "score": 3,
                            "author": "Zesty_Musky_Muskrat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am in cell bio! I didn't get to take it with Dr. Frantz but I wish I did, I took it with Palandoken before Dr. K. In that case I'd probably recommend just retaking with Dr Frantz in the future if you can't get a course sub to work :(",
                                    "score": 2,
                                    "author": "_ForestQueen_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "you can Totally withdrawb again for the same reason",
            "score": 2,
            "author": "RollerSkatingHoop"
        },
        {
            "level": 0,
            "comment": "As a biochem major, I counted down the weeks I was done with O Chem.  Sending you hugs.",
            "score": 1,
            "author": "Rough-Month7054"
        }
    ]
}