{
    "id": "9fu6nv",
    "score": 238,
    "title": "1st years in the crappy towers looking over at the new dorms across the street",
    "author": "StockMirror",
    "date": 1536947510.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/9fu6nv",
    "media_urls": [
        "https://i.redd.it/s84wt6xds8m11.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I just realized that Squidward lives inside of a giant head and in the show he is always daydreaming of a better life which means he is living inside his own head. SpongeBob is a masterpiece, man. Also good meme",
            "score": 96,
            "author": "Sfowl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh fuck",
                    "score": 27,
                    "author": "squadledge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow. And Patrick literally lives under a rock, and Spongebob lives in the most random thing possible. Totally matches both their characters too. ",
                            "score": 22,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 35,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whoever decided plain concrete is a good choice for residential buildings must be a torture chamber architect",
                    "score": 31,
                    "author": "Sanjew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The style is brutalism. It's surprisingly popular in mid century universities. ",
                            "score": 35,
                            "author": "sprucegroose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Brutalism looks good sometimes, but not when the interior looks so pathetic too.",
                                    "score": 17,
                                    "author": "Sanjew",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed. I'm actually kinda partial to the Kennedy Library, it needs a power washing but overall I enjoy the design. The towers are just sad",
                                            "score": 19,
                                            "author": "sprucegroose",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Definitely! The library looks scientific and hardcore for lack of better words, and it helps that it's a very nice space on the inside.\n\nThe towers seem like what my grandparents were taught everybody in the evil Soviet Union lived in.",
                                                    "score": 5,
                                                    "author": "Sanjew"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Those were the redbricks i believe. Not sure if the towers were by the same guy or not",
                    "score": 0,
                    "author": "BlownSphincter6"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dont worry. The towers can be fun 😁 \n\nIt is what you make of it",
            "score": 12,
            "author": "blazingkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m in the towers and my brother is in YTT. We both agree each dorms has their pros and cons tho personally I like the towers more ",
                    "score": 4,
                    "author": "level100shuckle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Towers were awesome. Yak city is going to be shit. Keep yosemite and Sierra madre lit\n\nSource: Old Salty 4th year ",
            "score": 14,
            "author": "Jayrock122",
            "replies": [
                {
                    "level": 1,
                    "comment": "They aren't lit anymore, SM is the engineering dorms lmao\n\nBut yakityutu is gonna be learning communities like \"substance free\" and \"24/7 quiet hours\" so it's gonna be a battle for which resident halls are lamer",
                    "score": 8,
                    "author": "mpgiii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Back in '15-'16 the substance free tower was lit, is that not the case any more?",
                            "score": 4,
                            "author": "andrewia",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait literally how?",
                                    "score": 1,
                                    "author": "SingleLensReflex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not many students go \"hey I want my entire dorm to be centered around not using drugs\".  Their parents, however, might.  When you put a lot of students together whose parents don't want them to do drugs, you can guess the rest.  ",
                                            "score": 2,
                                            "author": "andrewia"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "it works out for yakityutu because you find parties elsewhere but you have a cushy dorm to come back to afterwards",
                            "score": 2,
                            "author": "FolgersFinest"
                        }
                    ]
                }
            ]
        }
    ]
}