{
    "id": "mq7a9a",
    "score": 279,
    "title": "Paul Flores taken into custody in Southern California in connection with Kristin Smart case",
    "author": "KrispyKreamer",
    "date": 1618335410.0,
    "url": "https://www.reddit.com/r/CalPoly/comments/mq7a9a",
    "media_urls": [
        "https://www.ksby.com/news/local-news/slo-sheriff-to-make-major-announcement-in-kristin-smart-case"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Seeing this just made my day.  It only took 25 years....",
            "score": 73,
            "author": "GoldenGreenBird"
        },
        {
            "level": 0,
            "comment": "I lived in the same dorm as Flores when all of this started back in 1996.",
            "score": 35,
            "author": "DogShlepGaze",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s insane. How was he like as a person?",
                    "score": 15,
                    "author": "itachi194",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I never knew him personally - also I was an EE student (*don't know what his major was*).  But, some of the EE folks I hung and lived with did play basketball.  One of the things that stuck in my head were the conversations during dinner about Flores's explanations about his bruises.    Also, hate to say this but a few people on campus thought she had intentionally gone missing without telling anyone - since she disappeared right around the time when we had a break from school.",
                            "score": 22,
                            "author": "DogShlepGaze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah that’s why it took cp police so long to start an investigation - since it was a 3 day weekend they assumed she disappeared on purpose",
                                    "score": 6,
                                    "author": "ipoviged",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i also heard that SLOPD thought CPPD was handling it, and vice versa, which led to a delay in the investigation even beginning",
                                            "score": 10,
                                            "author": "squeezyscorpion",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yeah the whole case started off to a really bad start. law enforcement could’ve done a whole lot better of a job.",
                                                    "score": 11,
                                                    "author": "ipoviged",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The whole thing screams police incompetency. This is a great day for justice for the Smart family, but should be seen as a black mark on the police department. All signs pointed to Flores and the fact that he hasn't faced a trial for his crimes yet is quite the shame.",
                                                            "score": 3,
                                                            "author": "wasted12"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He’s a killer dude",
                            "score": 2,
                            "author": "TheBaconator1990"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow! That’s crazy! Did you live in Muir? There is speculation that because he had a ground floor room he was able to remove her body, with the help of his dad, either through his window or a side door to his truck parked close by. Does this seem doable to you?",
                    "score": 3,
                    "author": "CPolywiner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was Santa Lucia and I was on the ground floor and so was Paul Flores.    It seems that Ruben Flores (Paul's dad) bought his home pretty much around the time Kristen went missing.  This is the same house where they are digging.   Also, I heard that one of the witnesses was a coworker of Ruben's wife - and she says that Ruben's wife had told her that, one night Ruben received a call late at night and then left the house.  Ruben's wife didn't know what it was about - which is probably why she had mentioned that to her coworker.   So, by the sound of it - it seems plausible that Paul's dad came to help conceal the body that very night.",
                            "score": 2,
                            "author": "DogShlepGaze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow, crazy that you were on the same floor. Is it true that many kids had left campus already and it would have been pretty empty? I’m sure you’re right about his Dad helping. I’m just so angry that they didn’t solve this and arrest them 25 years ago.",
                                    "score": 1,
                                    "author": "Cohnhead1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LETS FUCKING GOOOOOOOOO\n\nEdit: \"In Your Own Backyard\" podcast people got it right all along!",
            "score": 28,
            "author": "ILoveKittens-ALot"
        },
        {
            "level": 0,
            "comment": "yourownbackyardpodcast on insta for other updates and live stream at his house!",
            "score": 22,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "OMGGGGG",
            "score": 12,
            "author": "seaglassaddict"
        },
        {
            "level": 0,
            "comment": "TIL that Scott Peterson was once considered a possible suspect. https://en.m.wikipedia.org/wiki/Disappearance_of_Kristin_Smart",
            "score": 11,
            "author": "Riptide360",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember that. I don't think it was taken all that seriously by those following Kristin's case, everyone knew Paul did it and likely had help from his disgusting parents. I am so glad that the Smarts are finally getting justice and I hope Kristin will be coming home too. She deserves a proper burial.",
                    "score": 21,
                    "author": "THATchick84",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't think anyone took it all that seriously. It was probably more a case of making sure all the Ts were crossed and Is were dotted on the case. Leaving open the possibility that she was murdered by a known murderer who attended the same college at the same time would be a pretty serious mistake.",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Made my day!!!",
            "score": 7,
            "author": "Important-Customer24"
        },
        {
            "level": 0,
            "comment": "wonder what they found",
            "score": 7,
            "author": "khanarx"
        },
        {
            "level": 0,
            "comment": "Hell yeah",
            "score": 2,
            "author": "goldman60"
        }
    ]
}