{
    "id": "12758ry",
    "score": 199,
    "title": "Finally Cancer Free",
    "author": "Resident-Way-4247",
    "date": 1680224541.0,
    "url": "https://www.reddit.com/r/columbia/comments/12758ry",
    "media_urls": [
        "https://v.redd.it/yf31ucyo4zqa1"
    ],
    "other_urls": [],
    "postText": "Hey Columbia fam, I wanted to share my story with you all. Last fall, during my semester here,  I received the shocking news that I had stage 1 cancer. Dealing with the emotional toll of the diagnosis was tough, but I underwent surgery to remove the tumor. However, the VA initially misdiagnosed it as a lipoma, and it took three months for them to properly diagnose it through a biopsy.\n\nAfter the surgery, I was relieved to be told that I was cancer-free, and I eagerly reenrolled for the spring semester. But things took a sudden turn when a radiation oncologist at the VA hospital referred me to them and informed me that I had a 50% chance of survival because the cancer was actually a stage 3b round cell, myxoid liposarcoma.I was told to drop out of school and start radiation immediately, or else the cancer would most likely return.\n\nGiven the VA's history of messing up my healthcare, I wasn't confident in their recommendation. So, I fought for a referral to Memorial Sloan Kettering in NYC, and yesterday I had my CT scans and MRI's done. Today, I received the incredible news that my cancer did not spread, and I don't need chemotherapy or radiation - I am officially cancer-free!\n\nI wanted to share my story to remind everyone that there is always hope, and there is light at the end of the tunnel. Never give up fighting and always advocate for yourself when it comes to your healthcare.\n\nHere is the video of me ringing the Cancer free bell at Sloan Kettering today ❤️",
    "comments": [
        {
            "level": 0,
            "comment": "I remember your first post. Congratulations, so happy for you!!!!!",
            "score": 7,
            "author": "Fearless-Peach"
        },
        {
            "level": 0,
            "comment": "Congrats!  The two misdiagnoses are unforgivable and terrifying!",
            "score": 7,
            "author": "frasier2122"
        },
        {
            "level": 0,
            "comment": "https://images.app.goo.gl/ofGPV9PLUMvj3TTo9",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "🤙🤙🤙",
                    "score": 3,
                    "author": "Resident-Way-4247"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations!!!!!!",
            "score": 2,
            "author": "Illustrious_Excuse85"
        },
        {
            "level": 0,
            "comment": "Biggest congrats !!!",
            "score": 2,
            "author": "Glvwh"
        },
        {
            "level": 0,
            "comment": " CONGRATULATIONS!! Now that you beat that illness graduating will be a breeze 🥳",
            "score": 2,
            "author": "Glittering-Name-6039",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you think Prezbo can give me an honorary degree? 🤔",
                    "score": 1,
                    "author": "Resident-Way-4247"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh my god this just made my day!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congrats!!!",
            "score": 1,
            "author": "upset_larynx"
        },
        {
            "level": 0,
            "comment": "Amazing news, OP! Congratulations!!",
            "score": 1,
            "author": "Prestigious_Sock_840"
        },
        {
            "level": 0,
            "comment": "Congrats!",
            "score": 1,
            "author": "TheMandoAde888"
        }
    ]
}