{
    "id": "12bo34s",
    "score": 10,
    "title": "The new Columbia Baseball Club will be having our first practice this Sunday! Come join us ⚾",
    "author": "Sosolidclaws",
    "date": 1680625197.0,
    "url": "https://www.reddit.com/r/columbia/comments/12bo34s",
    "media_urls": [
        "https://i.redd.it/ke30taiq7wra1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey everyone, we just launched the Columbia Baseball Club this year for people who want to have fun outdoors and party during the spring, summer, and fall! Everyone is welcome, even if you've never played ball before. You can join us using the QR code in the poster and [follow us on instagram](http://columbiabaseball.org/) to stay up to date!",
            "score": 3,
            "author": "Sosolidclaws",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will you guys have lefty gloves?",
                    "score": 2,
                    "author": "jordanb2882",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, we will have at least one lefty glove! However, we would encourage everyone to bring their own glove if you already have one :)",
                            "score": 0,
                            "author": "Sosolidclaws"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is awesome! Very excited about it. What time is the practice?",
            "score": 3,
            "author": "happyfish2019",
            "replies": [
                {
                    "level": 1,
                    "comment": "It will probably be around 2pm on Sunday. I'll confirm soon in the whatsapp group!",
                    "score": 1,
                    "author": "Sosolidclaws"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You guys should play some catch on South Lawn for nostalgia's sake.",
            "score": 2,
            "author": "andyn1518",
            "replies": [
                {
                    "level": 1,
                    "comment": "We already do, I love it! Our whatsapp group is also a place to meet up with people who want to throw ball on campus. You can see it this photo: https://imgur.com/a/vnLDXsF",
                    "score": 2,
                    "author": "Sosolidclaws"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Last time I played organized baseball was little league when I was 12. I went to a batting cage like 6 months ago and whiffed on 20 straight pitches 😭",
            "score": 1,
            "author": "karlnuw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha well I'm probably even worse than you! I just learned how to play last year and haven't really had a chance to practice since I moved to New York. Beginners are super welcome!",
                    "score": 2,
                    "author": "Sosolidclaws"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will you actually play games? I assume practice means hitting and catching?",
            "score": 1,
            "author": "tumamaesmuycaliente",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, we will just start with throwing / catching! Then eventually we'll get some bats and do batting practice (there's a few cages at Riverside Park). And then if we have enough people we might play some friendly games.",
                    "score": 2,
                    "author": "Sosolidclaws"
                }
            ]
        }
    ]
}