{
    "id": "12cqhzp",
    "score": 9,
    "title": "Is LitHum worth it?",
    "author": "raffinandriffin",
    "date": 1680713457.0,
    "url": "https://www.reddit.com/r/columbia/comments/12cqhzp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have an option to take LitHum or a 3000 level literature course and I’m not sure exactly what to do. \n\nOn one hand, I’ve heard LitHum is really the foundation of the core &amp; tbh I would like to have at some point in my education have read those classics. But I’ve also heard that the course (at least for some) was just a class where everyone BSs and sparknotes it. Also the pace at which books are gone through just seems like a recipe for surface level nonsense. Maybe it’s just too much work for nothing? \n\nI have no idea what 3000 level course I would do, but I’ve heard good things about Canterbury Tales for example, so maybe compare it to that (unless you have recommendations), but also other recommendations are great too. \n\nAny thoughts? Is LitHum worth it?",
    "comments": [
        {
            "level": 0,
            "comment": "If you sincerely want an educational foundation in the classics absolutely take it. Not only will you get to read those books, but by being the person who wants to be there and doesn't bullshit you will do really well in the class.",
            "score": 14,
            "author": "mercer1235"
        },
        {
            "level": 0,
            "comment": "I loved LitHum. It really is what you make of it. I did basically all the reading and relied on Sparknotes very lightly, and got a lot out of it. The reading can get quite intense but if you are interested in having a foundation in the \"classics\" then you can't go wrong with LitHum. If you want to dig deeply into a particular work/author/time period/etc. then I would recommend a literature seminar. LitHum is really more fluffy with a focus on the \"human condition\" and learning how to read literature. At the pace you breeze through works, you really don't have much time to dig deeply into individual passages and works like you would in a traditional literature seminar.",
            "score": 10,
            "author": "windowtosh"
        },
        {
            "level": 0,
            "comment": "I chose a literature course and loved it.  I also dislike surface level courses.  Diving deep into a handful of works/authors or even just one author is fun.  Bonus points if you get into one taught by an old tenured professor.",
            "score": 4,
            "author": "Ok-Afternoon-5444"
        },
        {
            "level": 0,
            "comment": "I like lithum but like you acknowledged it’s a fuckton of books / reading and we spend like 2 days per book discussing (at least in my class) bc of the sheer amount of content you have to get thru in the syllabus…I’d do ur 3000 lit course ngl",
            "score": 3,
            "author": "Longjumping_Poet_395"
        },
        {
            "level": 0,
            "comment": "I consistently tell GS students (which, based on your options, seems to apply) that Lit Hum is by far the most difficult way to fulfill that requirement.  That said, there’s nothing like it, and with a good prof, you won’t stay at “surface level,” and may well get better analysis than in a 3000 level. But you should be prepared to invest 10hrs a week or more OUTSIDE the class to get the most out of it.",
            "score": 3,
            "author": "ennfrc"
        }
    ]
}