{
    "id": "12d66f3",
    "score": 10,
    "title": "Columbia vs Georgia Tech vs UCLA",
    "author": "Infinite-Example-702",
    "date": 1680747737.0,
    "url": "https://www.reddit.com/r/columbia/comments/12d66f3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I got accepted into Columbia College (will pursue Data Science or try switching to CS) and I'm considering it with my other top choices being UCLA Data Theory and Georgia Tech CS. I'm not sure if Columbia is worth it for me since I am an international student and have to pay the full cost of 85k yearly. \n\nMy parents are willing to afford 50k every year so I'd have to take 35k loan for four years, so I would be 140k in student debt by the time I graduate. Is the ivy league tag worth this large debt? Will I be able to pay it back quickly with the high starting prices of the tech industry in NY? Or are Georgia Tech and UCLA much better options? I would not need any loan to attend GT or UCLA. (If yes, any idea on which would be better?)\n\nIf I were to take up the debt, I'm thinking that I'll earn back a decent amount of it throughout college with internships, or jobs on campus (i.e. canteen work, resident assistant, helping pHD students, etc).  Is that viable? I really don't want to miss out on this once-in-a-lifetime opportunity but idk if the debt is worth it, especially considering my other options. What do you guys think?",
    "comments": [
        {
            "level": 0,
            "comment": "Tuition you already discussed but some other factors:\n\n**Prestige:**\n\nColumbia&gt;UCLA&gt;Georgia Tech\n\n**Cost of Living:**\n\nGT&gt;UCLA=Columbia\n\n**Campus Life/Athletics:**\n\nUCLA&gt;GT&gt;Columbia\n\n**Location:**\n\nColumbia=UCLA&gt;GT\n\n**Campus:**\n\nColumbia=UCLA&gt; GT\n\nNot sure if international students are eligible for federal loans (i assume not) but that's also a factor",
            "score": 7,
            "author": "Rugby562",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just a heads up to OP, cost of living can be significantly cheaper at UCLA than Columbia, especially if you're living off campus. All the decent transit options for Columbia require you live in Manhattan or the Bronx, Westide and Southside respectably. Anywhere else like Queens, Brooklyn or Jersey you're looking at 30min+ commute. While in LA, UCLA specifically, 30min radius is a lot larger of an area so you can find a decent place to live. Especially if you buy a car, which you will want to do anyways living on the west coast.\n\nThen thats not to mention things like groceries recreation generally being cheaper in LA, the latter part of course depending on what you do for recreation but you'll definitely have more options for hobbies in LA.",
                    "score": 2,
                    "author": "Thetallguy1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea I was just going based off knowing Westwood is a crazy expensive area of LA and was judging it based off of USC off campus prices compared to here, which I looked at last year",
                            "score": 1,
                            "author": "Rugby562"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "thank you for the breakdown!",
                    "score": 1,
                    "author": "Infinite-Example-702",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are studying CS/DS, and I think the breakdown they gave for prestige is more general. Georgia Tech has a great CS program, and for job opportunities in the field it is probably Georgia Tech = Columbia &gt; UCLA. Would personally go Georgia tech, you will have just as good opportunities and not have 140k debt.",
                            "score": 5,
                            "author": "vorg7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "US news has Georgia Tech tied for 5th and us tied for 11th for undergrad CS rankings. I do think they weight research output too highly for their major specific rankings, which favors bigger schools like Tech, but for CS at least they are very clearly in our league.",
                                            "score": 0,
                                            "author": "vorg7"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is Atlanta more expensive to live in than NYC?",
                    "score": 1,
                    "author": "6SLURP9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah put it the other way around, like Atlanta cheapest, then la and nyc",
                            "score": 1,
                            "author": "Rugby562",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh that makes sense",
                                    "score": 1,
                                    "author": "6SLURP9"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did my undergrad in CS at GT. In terms of reputation in the industry GT is top tier even if outside the industry its name isn't as well known. Given your situation and how good of a time I had at GT, I would go there. For both CS and Data Science GT is going to be better than UCLA and honestly probably at the same level if not better than Columbia for SWE while Columbia will likely be better for software/data roles outside the tech industry such as finance.",
            "score": 4,
            "author": "Th3_1r0ny"
        },
        {
            "level": 0,
            "comment": "I'm so sorry to hear your predicament, but I need to make you aware that you absolutely will not be able to put even a dent in that through part time work during school. Part time jobs and internships (which are notoriously unpaid in America) would be around maybe $3-5k a year max. Furthermore, I'm not even sure your career path is a viable way to be able to pay back $140k in what would need to be private loans (as you wouldn't qualify for federal subsidized loans). I did CS and the thought of that much debt (with all of the predatory interest it will accrue) and what the job market will be when you graduate is nauseating to me. I truly believe that this decision would ruin you financially for an extremely long time, if not the rest of your life. Sorry to be a pessimist, and if anyone else has any oposing (and more optimistic) views please feel free to disagree with me.\n\nEdit: maybe if you worked full time in a store during your summer breaks you would be able to make more a year? But also you would be sacrificing getting experience working in your field, which is going to be more valuable than the Columbia diploma.\n\nEdit 2: I actually knew of someone who went to UCSD for two years and transferred into Columbia to finish his degree. Perhaps this could be something to look into for you with UCLA?",
            "score": 5,
            "author": "Financial_Idea_4835",
            "replies": [
                {
                    "level": 1,
                    "comment": "what are you talking about? i made like $20k last year from a summer internship and working part time during the semester as a ta as a CS major and I an a sophmore now. You can most definitely make a dent in loans with the kinda of money we get from CS if you do not have to worry about other expenses\n\ni know this isnt a shared experience but if u do put a lot of time and effort to get an internship and work during the semesters you can start paying off loans\n\ni dont know if i would recommend that, its what im doing now, but having columbia on my resume is definitely the reason i was able to get an internship and has opened a lot of doors",
                    "score": 6,
                    "author": "Jakasaurus_Rex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Relying on luck isn’t a real strategy and what you described has a big element of luck. You TA’d. You interned in 2022. The 2023 market is flush with thousands of laid off software engineers, data engineers, data analysts, etc.",
                            "score": 1,
                            "author": "tykuku",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wouldn't attribute all of my accomplishments to luck, there defintely has some aspects but getting jobs throughout the year does not involve luck that much. Almost everyone I know who put in effort into applications during the season got an offer for some sort of internship the next summer. The same has applied this year even thought the full time employment market it bad, it doesn't seem to be effecting interns as much.",
                                    "score": 2,
                                    "author": "Jakasaurus_Rex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I truly hope that in your life your effort always results in great success. That’s not life for most people. That’s why stories of disappointment constantly struggle with stories of hope. It’s uncomfortable to think about such things, but long-term success isn’t about ignoring majority outcomes in favor of a desired outcome.\n\nBefore accounting for unearned status and ability, it is more rational to assume an individual will be a part of the 99% than the 1%. How many people apply to the IA positions and how many would have if they had the time to apply? Were a majority of applicants accepted? Do the same for internships.\n\nAnecdotes don’t make for good arguments especially around unquantifiable things like effort. There are a good number of students that have work-study as a necessary part of their ability to provide for their needs. That means they have up to 20 fewer hours per week to dedicate to their college experience including summer prep. Also instructional assistant work is beneficial to the assistant in ways that watching the lobby of a building is not. I know current engineers at Facebook, Amazon, and Google that were rejected from IA posts and internships throughout their entire time at Columbia. I know people who unexpectedly had to live off their summer earnings meaning nothing went to debt repayment. Without real stats, these aren’t really meaningful except to say that stuff happens, in other words luck.\n\nOne way to approach luck is to maximize probability of a desired outcome. OP is asking for some experience on what choice is likely to yield a better outcome. While mitigation of debt through internships and campus roles sometimes works out, high debt burdens at high interest rates always means a tough road ahead.",
                                            "score": 0,
                                            "author": "tykuku"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for your honest opinion. Will the job market really change that drastically in 4 years? Even if it goes down a little, I'm sure i can earn a 6 figure salary in New York straight out of college, right? In that instance would paying off 150k take that long? Couple years max Id say if I don't spend carelessly",
                    "score": 1,
                    "author": "Infinite-Example-702",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Finding a 6 figure salary straight out of college is not a given. I wouldn't make financial plans relying on this outcome.",
                            "score": 5,
                            "author": "Skyline8888"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take the cheapest option. Undergrad prestige doesn't matter nearly as much as people think. Columbia is only worth it if you have a full ride. \n\n\\- Coming from someone who attended both Columbia and a UC",
            "score": 3,
            "author": "shikhaaar"
        },
        {
            "level": 0,
            "comment": "I was born and raised in LA. I attended Columbia University for two years to complete my 3-2 program. I studied Chemistry at my first institution and Industrial Engineering at Columbia. I also took some Comp sci courses and sought a degree in software engineering post graduation, where I now work.\n\nBased on your assessment of your situation. I think the price is too high to attend Columbia. Quality of life, and being able to live without the stress of debt is so important. Moreover, Columbia has a well represented international community, especially in data science and computer science courses and I often remember hearing how difficult it was for these students to get full time job opportunities after college given their international standing. And most of these students were extremely bright, talented, and hard working. \n\nAttending UCLA would not alleviate all your financial issues, but it is still a wonderful school with rigorous academics, and plentiful opportunities. Engineering disciplines are quite the meritocracy anyhow, you will go as far as you want to work. The degree can help you get in the door, but so can plane old networking. Wherever you go, I say your number one priority is getting an early internship. Work experience is everything these days.\n\nGT is also an academically strong school. Personally, I am bias against the location and I believe your opportunities will be more plentiful in NYC or LA.\n\nWish you all the best, friend.",
            "score": 2,
            "author": "Jhwelsh"
        },
        {
            "level": 0,
            "comment": "Definitely go for Columbia if you have high career ambitions! Having studied at an Ivy League and the alumni network would open so many doors for the rest of your life. However if you don't care that much about prestige and just want the most fun college experience, then go with UCLA – that would be the more beautiful campus and lifestyle.",
            "score": 2,
            "author": "Sosolidclaws",
            "replies": [
                {
                    "level": 1,
                    "comment": "Despite the large student debt?? Do you think the alumni network will help me get a high-paying job straight after graduation? (Cuz if yes paying off the debt shouldn't be a big deal I believe) What ivy did you go to?",
                    "score": 2,
                    "author": "Infinite-Example-702",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, the alumni network can be really valuable, especially if you're looking for a job in New York. However it will still be up to your hard work and initiative to look for great opportunities. I went to college in London and I'm doing grad school at Columbia now. The prestige of my undergrad definitely helped me find a good job. In fact, my first boss who hired me was a fellow alumni! Personally, I think of student loans as investing in your future. So if you believe in yourself and you're ready to take on the challenge, I would say go for Columbia. \n\nHowever, think carefully about what kind of college experience you want. If a large campus, college sports, school spirit, and sunny weather is important to you, then UCLA is a better option.",
                            "score": 1,
                            "author": "Sosolidclaws"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk check out this cool cat https://tenor.com/bVJdY.gif",
            "score": 0,
            "author": "LordOfTehGames"
        }
    ]
}