{
    "id": "12m2byp",
    "score": 9,
    "title": "is it worth staying here in the summer?",
    "author": "Successful_Prize1776",
    "date": 1681488711.0,
    "url": "https://www.reddit.com/r/columbia/comments/12m2byp",
    "media_urls": [],
    "other_urls": [],
    "postText": "i live in maryland and i really want to stay here for summer classes and a part time job. is it worth it? or should i just go home for the summer? it’s extra money that i really would have a hard time paying but if it’s worth it, i’ll work towards it.",
    "comments": [
        {
            "level": 0,
            "comment": "It gets very hot here just know that",
            "score": 10,
            "author": "sighar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very hot… But on the other hand, the city seems to empty out especially in places you might not otherwise have explored (some people are fortunate enough to be able to go to \"the Hamptons\" etc.). So the city can be really, really interesting and exciting in and of itself during the summer. Just a thought!",
                    "score": 1,
                    "author": "alocinwonibur"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re interested in studying abroad and you’re on financial aid, taking summer classes is a way you could get rid of requirements for your major/core stuff and be able to study abroad during the school year when your financial aid will actually be able to help pay towards the trip. If you’re not interested in study abroad, there’s really no use in taking classes during the summer imo unless theres a reallllllly interesting one",
            "score": 7,
            "author": "aneggsalot"
        },
        {
            "level": 0,
            "comment": "Taking a language over the summer is amazing and immersive.  It's every day for a few hours.",
            "score": 6,
            "author": "Ok-Afternoon-5444"
        },
        {
            "level": 0,
            "comment": "Have you taken a look at how much summer classes cost? One 3-point class costs about $6000; then there are your living expenses.",
            "score": 10,
            "author": "Milocat59",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes. it is a lot, but i think i would really enjoy it. it’s a rough position for me.",
                    "score": 3,
                    "author": "Successful_Prize1776"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends on the kind of job you can get.",
            "score": 2,
            "author": "TheMandoAde888"
        },
        {
            "level": 0,
            "comment": "If the experience is worth it sure, just make something awesome out of it , anything can be worth it",
            "score": 1,
            "author": "New_Assignment3979"
        }
    ]
}