{
    "id": "12z01uh",
    "score": 3,
    "title": "Which AP tests were worth taking?",
    "author": "mxrmX14",
    "date": 1682466160.0,
    "url": "https://www.reddit.com/r/columbia/comments/12z01uh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I am a C/O 27' student suffering from senioritis and am about to take AP exams. So I need to decide which ones I should spend my time studying for and which ones to skip. Were there any AP exams that you either regret not taking or are glad that you did? Or are they all worthless?",
    "comments": [
        {
            "level": 0,
            "comment": "The admissions page should have a chart of which AP tests count as credit and what scores you need on it. If you check that out you can decide which tests are worth trying for",
            "score": 6,
            "author": "Hiro4ntagonist",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with this :) I also suggest looking at the first-year required courses and seeing if there are AP credits you can earn to skip them. That way when you get to school, you don’t have to waste as much time on required courses that you don’t want to take and instead spend time on classes related to your major !",
                    "score": 1,
                    "author": "Luna8250"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got columbia credit for a 5 in ap lang, apush, and ap calc ab &amp; bc (provided i completed calc III). if it's possible that you may get a 5 in both ap macro AND micro, that would take care of your econ req if you're in the engineering school. otherwise, it doesn't matter lol.",
            "score": 3,
            "author": "Flaky-Dragonfly353",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn, AND macro. I didn’t even know college board offered that. Did your credits help much or, would you have easily graduated without them?",
                    "score": 1,
                    "author": "mxrmX14",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "usually around 16 credits a semester will allow you to meet the credit req! so yeah it’s not bad",
                            "score": 1,
                            "author": "Flaky-Dragonfly353"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it is dependent on how good your AP teachers are, how good at the subject you are, and if you’ll get any benefit from the credits.",
            "score": 2,
            "author": "nyca"
        },
        {
            "level": 0,
            "comment": "If you want to go into a STEM major, AB or BC is great because you can take upper-level calc to get the credit. \n\nLess important but other exams are also good because they will just insulate your credit number (and give you a cushion if you want to take fewer credits one semester because of outside work,  mental health, or other reasons!)",
            "score": 2,
            "author": "sequoiadendron_"
        },
        {
            "level": 0,
            "comment": "If you got Calc BC, CSA, or CSP, would definitely recommend doing those.",
            "score": 1,
            "author": "Baltteri_Vottas"
        },
        {
            "level": 0,
            "comment": "I claimed all my AP credits (almost a full semester) which was immensely helpful in freeing up time in my schedule for internships and activities! BC is the best because you can skip Calc 1 and Calc 2 - Calc 2 is especially tedious from what I’ve heard. AP Chem can get you into Honors Chem or Orgo which may be helpful depending on your major. If you do well on Micro and Macro you can escape Principles of Econ (required only in SEAS). Otherwise, just having non-techs was helpful for me in SEAS and reduced the raw number of courses I had to take substantially \n\n\nThis explains the SEAS rules very well: https://bulletin.engineering.columbia.edu/advanced-placement",
            "score": 1,
            "author": "Hereforchickennugget",
            "replies": [
                {
                    "level": 1,
                    "comment": "How does applying AP credits for the elective non technical requirement work for SEAS? Can I apply credit from any AP towards it or only credit from APs that aren't STEM related?",
                    "score": 1,
                    "author": "aquamarineblue2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only certain non STEM ones I think, but would double checj",
                            "score": 1,
                            "author": "Hereforchickennugget"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I ended up getting credit for ones I didn’t expect to. Take all of them that are listed as accepted on the sheet. It’s hard to say what they’ll count for until you get here and choose your major and it’s better to not have regrets about not taking one",
            "score": 1,
            "author": "pickles4321"
        },
        {
            "level": 0,
            "comment": "Foreign language gets you out of that requirement",
            "score": 1,
            "author": "workthrowawhey"
        }
    ]
}