{
    "id": "1360wbp",
    "score": 1,
    "title": "First Year PreMed Schedule",
    "author": "jeongguker",
    "date": 1683062964.0,
    "url": "https://www.reddit.com/r/columbia/comments/1360wbp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I'm an incoming freshman at CC. I was wondering if the course schedule below is alright for my first year--I'm planning on majoring in Neuroscience on a pre-med track. I'm not sure if the courseload will be too much/too little/on par w/ pre-med requirements, any advice would be great. Thank you!\n\nFirst Semester\n\n* LitHum\n* UW/FroSci\n* Calc I\n* Language\n* Intro Psych (Not sure if I should take this during second semester or not at all during first year)\n\nSecond Semester\n\n* LitHum\n* UW/FroSci\n* Gen Chem I \n* Gen Chem Lab\n* Language",
    "comments": [
        {
            "level": 0,
            "comment": "You should take Gen Chem I in your first semester and Gen Chem II in the second, so that you will have the year of Gen Chem you need to take Intro Bio in your sophomore year.\n\nIf you took calculus in high school and did OK, you probably have enough knowledge to take Gen Chem I without taking Calc I first, though eventually you will need to take some calc. If you took AP or IB chem in high school and scored high enough to earn credit, you may want to take the chemistry placement exam and see if you place into Intensive Second-Semester Gen Chem, which is nice because you would take that class in the fall and Chem Lab in the spring. (This would only work if you have actual credit coming to you from an exam--AP, IB, A Level and a few others. Just placing into Intensive will not give you enough chemistry credit for premed.)\n\nThese are questions you will have plenty of time to discuss with your advisor during NSOP.",
            "score": 6,
            "author": "Milocat59",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you! i'm taking ap calc ab right now (not doing very well lol, B- B range), but i saw some med schools require calc so i put it in there. would you recommend not taking intro psych? i didn't take ap chem so i can't get any credit. should i also hold off on calc then, or take it second sem? \n\nalso yep i know :) i just wanted to get a general idea of what i'll be taking so i could do a little bit of self-studying over the summer (last time i took chem was sophomore year lol)",
                    "score": 1,
                    "author": "jeongguker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A reasonable first year would be:\n\n**Fall**\n\nLit Hum\n\nUW or Fro Sci\n\nGen Chem I\n\nCalc I\n\n(maybe language?)\n\n(Four classes is OK for your first semester--you could try five, but know your limits and don't be afraid to drop the fifth if it's too much)\n\n**Spring**\n\nLit Hum\n\nUW or Fro Sci\n\nGen Chem II\n\nGen Chem Lab\n\n(You'll probably want a fifth class: language? Science of Psych? stats?)",
                            "score": 4,
                            "author": "Milocat59",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank you so much!",
                                    "score": 1,
                                    "author": "jeongguker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "if you’re thinking of doing neuroscience, you can definitely wait until sophomore year to take science of psych and you won’t be behind in the major at all! Take it easy on your first year as you figure out your study habits and limits. Best of luck :)",
                                            "score": 2,
                                            "author": "kit_k4tt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "thank you so much :)",
                                                    "score": 1,
                                                    "author": "jeongguker"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gen Chem needs to be taken your first year because it's a prereq for Intro Bio, which you'll take as a sophomore.\n\nAlso note, as a first semester student you cannot go over the course limit (18 credits) With the  schedule you list you'll be at:\n\n* LitHum (4)\n* Gen Chem (4)\n* Language (4)\n* Calc I (3)\n* UW/FroSci (3 or 4)\n\nTotal: 18 if you take UW, 19 if you take FroSci. The latter doesn't work, so you need to take UW in your first semester if you want to take all the classes you plan to take.",
            "score": 3,
            "author": "sequoiadendron_",
            "replies": [
                {
                    "level": 1,
                    "comment": "ah i had seen there was a credit limit but didn't know i would exceed it if i have frosci in the fall. thank you!",
                    "score": 1,
                    "author": "jeongguker"
                },
                {
                    "level": 1,
                    "comment": "also, is calc i a co-req for chem? i saw on the website that a \"background\" in calc is required, and im taking ap calc ab right now. would taking it in hs be considered enough background to not have to take it as a co-req or do i need ap credit?",
                    "score": 1,
                    "author": "jeongguker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It says it's a co-req but it's unenforced. The registrar won't remove you from the class if you don't have calculus on your transcript (like if you don't get AP credit). A friend of mine took Gen Chem without ever having taken Calculus—didn't even take AP Calc. Also, you don't need calculus for Gen Chem. Calculus is not used in the curriculum.",
                            "score": 1,
                            "author": "sequoiadendron_"
                        }
                    ]
                }
            ]
        }
    ]
}