{
    "id": "137kw2f",
    "score": 23,
    "title": "How stressful is Columbia and do you find time for a work/life balance?",
    "author": "Hegecee45354",
    "date": 1683207344.0,
    "url": "https://www.reddit.com/r/columbia/comments/137kw2f",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incoming '27 here. I'm really burnt out coming out of senior year, and I don't want to set myself up for a stressful hellhole in college. Could anyone talk about their experience with stress, competition, and how outcome driven (grades, accomplishments, internships, etc) Columbia is? I really don’t think I can handle another 4 years of constantly stressing about my grades and work.\n\nDo you find enough time to hang out with friends, enjoy the city, and participate in activities (intramural, clubs etc.) alongside your 5 course workloads?\n\nEdit: majoring in CS",
    "comments": [
        {
            "level": 0,
            "comment": "It's what you make of it. \n\nI crammed my first two years, taking as many classes as I could while still adjusting to college life and it was hell. Starting my third year, I took the minimum number of credits and not only did I do better in all my classes, but I also had so much time for hobbies and other things I enjoyed. \n\nMajors: Math, Philosophy",
            "score": 23,
            "author": "creamcheese5"
        },
        {
            "level": 0,
            "comment": "Columbia is extremely stressful and competitive. That’s the harsh reality of going to the most competitive school in the most competitive city in the US. CS is a challenging major for most people who don’t have significant prior experience and there is also a lot of stress surrounding internships. It’s up to you to decide if you can handle being in a stressful environment and make decisions to prioritize your work-life balance. Maybe you weren’t able to in high school, but that doesn’t mean you can’t get better at that as you mature. Being at “the top” academically, professionally etc. will always inherently be stressful, so I would personally focus on building the skillset to thrive in that environment (not the technical skillset, but the emotional skillset to find balance in your life) instead of removing yourself entirely. If you got into Columbia, it means you can handle it. It’s just a question of if it truly will be too harmful for your mental health to be in a competitive place.",
            "score": 38,
            "author": "Hereforchickennugget"
        },
        {
            "level": 0,
            "comment": "• Your first year is going to be a transition marked by a serious workload, especially with stuff from the Core. **EXPECT IT TO BE HARD,** but be confident that you will acquire the skills you need in order to make it easier.\n\n• As far as the city goes... that depends. I had classmates who could afford to party nearly every night in NYC and I had classmates who never went out at all. New York is a lot of things, but it's not cheap, regardless of what your definition of \"enjoy\" is. You will have access to museums and discounts on certain things, however, and, if nothing else, there's always Central Park and The Met.\n\n• Stress and competition: the former depends on how you quantify stress, the latter depends on how ambitious you are. Some students quite literally snap under the pressure they place on themselves and the expectations they feel they have to live up to. I urge you to keep things in perspective, *talk* to your professors if you're having a hard time, *build a support network* of friends and classmates, and *seek* counseling if you're having a rough go of it. Some classes are graded on a curve, so prepare yourself for that. Some classes are taught by burned-out TA's who make a Hell of a lot less money than you think. Some professors insist that you show up and participate, others don't care. \n\n• Outcomes: again, this is about ambition. Remember, however, that Columbia is a *learning environment.* Your goal is to *learn as much as possible* and prepare yourself for either work, grad school, or both.   \n\n\nWhat's great about Columbia profs is that they *want you to succeed.* Make the most of their wisdom. Make the most of the city. Make the most of your time. You got this.",
            "score": 8,
            "author": "JustTheWriter"
        },
        {
            "level": 0,
            "comment": "I’m a first year, and from my experience, it depends on yourself and the standards you set. I am a GS student, and older than the normal undergrad student (I am 26). I had a hard time in my first semester since I was dealing with a health issue, but this semester has been very good so far. I have not joined any club or something yet, but have been able to easily handle my 4 classes, and my life outside college (I am somehow chill with my grades and won’t kill my self for an A). I see posts sometimes from students, being stressed out that they got their first B in senior year, or complaining that their GPA is going to be 3.7. Like if what grade you get is extremely important for you, yes, you will be stressed and probably burnt out, unless you just want to chase easy A classes, which I doubt work well especially for CS! Columbia can get very competitive, but it depends on you that what you want to compete for!",
            "score": 8,
            "author": "TwistCharacter6270"
        },
        {
            "level": 0,
            "comment": "Depends a lot on you and your major.\n\nI’m a human rights major and I’ve got great balance.(involved in many clubs, able to volunteer every week, time to work on side hustles, private equity internship, participate in work study, weekly coffee chats)\n\nMy friends who are CS, Econ, Math, or any other STEM major don’t have as much free time. But, you could also be super smart and Columbia might be a joke to you, so like I said…it depends.",
            "score": 12,
            "author": "MrSandwich97",
            "replies": [
                {
                    "level": 1,
                    "comment": "a joke ? 😭huh",
                    "score": 2,
                    "author": "MeanRule7176",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve met some people who causally get all A’s in 5-6 stem classes over a semester with little to no studying. Some people are just on another level lol",
                            "score": 13,
                            "author": "MrSandwich97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gifted",
                                    "score": 1,
                                    "author": "Ok_Sport_6928"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Side question. Im a class of 27 as well, and i thought u had to be a finance or related major to get into private equity. How did u manage to get an internship while being a human rights major. Private Equity is my dream job, but not my dream major so I was looking for some advice.",
                    "score": 1,
                    "author": "PsychologicalCat1876",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Firms don’t care about your major, they care that you’re at Columbia. Have a high gpa, know your technicals, network, be interesting, and you’ll have good odds at landing a role.",
                            "score": 4,
                            "author": "MrSandwich97"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll say it's definitely stressful. Maybe not in a bad way, it really depends on you, and sometimes you don't realize how stressed or worked you are during the semester. I transferred here and it's definitely much more work than my old school (also a T50 if that means anything for comparison). You'll get used to it but I definitely suggest not being too much of a perfectionist, because you'll burn out hella quickly.",
            "score": 3,
            "author": "tressemmehairspray"
        },
        {
            "level": 0,
            "comment": "I'm not gonna lie to you, friend. It can be rough (esp in CS). I'm worried that you're coming in already burned out.",
            "score": 3,
            "author": "Prestigious_Sock_840"
        },
        {
            "level": 0,
            "comment": "\\&gt; majoring in CS\n\nDepends on you and the classes you take. If you're already competent and choose to take easier classes, you'll have more time. Research the professors before you sign up for classses to get a sense of workload. But then you also need to factor in time for interview prep. Grinding for Leetcode can feel like a 6th class. I didn't have a lot of free time but was also gunning for FAANG.",
            "score": 2,
            "author": "Cool_Cryptographer9"
        },
        {
            "level": 0,
            "comment": "Are u in SEAS, if not, will be ok",
            "score": 1,
            "author": "unluckyswede"
        },
        {
            "level": 0,
            "comment": "Lmao",
            "score": 1,
            "author": "LordOfTehGames"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah you may want to see if they’ll let you do a gap year.  Do Americorps or something similar and regain that ambition/drive before taking on Fu CS.",
            "score": 1,
            "author": "MotoManHou"
        },
        {
            "level": 0,
            "comment": "CS major and it's definitely not the easiest thing ever and I've noticed it is much more difficult during exam times than my humanities friends. When it is not midterms or finals, I manage to hang out with my friends every day, go out on the weekends, sleep a good 5-6 hours a night, do 10 hours of workstudy a week and I made dean's list last semester. it is really about how much emphasis you put on being a STRAIGHT A student, if you do not care about that, I think it is alright.",
            "score": 1,
            "author": "nanobot11"
        }
    ]
}