{
    "id": "138m0sy",
    "score": 8,
    "title": "Is it easy to sneak food out of the dining halls?",
    "author": "BasketOutrageous6203",
    "date": 1683293933.0,
    "url": "https://www.reddit.com/r/columbia/comments/138m0sy",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I just walk out with food, if it’s not Hewitt or John Jay which have actual plates. Nobody has ever said anything",
            "score": 11,
            "author": "backlash10",
            "replies": [
                {
                    "level": 1,
                    "comment": "you can walk out with plates from john jay no problem",
                    "score": 4,
                    "author": "theoneandonlygoga"
                },
                {
                    "level": 1,
                    "comment": "But obviously they **are** referring to John Jay and Hewitt. No one cares if you take food from a restaurant, open to the public or not. Buffets and all-you-can-eat joints are a different story, and that's the conflict here.\n\nBut yeah, OP, just don't be too blatant. And don't steal plates or trays, unless you need something for sledding if there's a surprise snowstorm.",
                    "score": 3,
                    "author": "Philip_J_Friday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Other places have all you can eat food, do they not?",
                            "score": 6,
                            "author": "backlash10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ferris and JJs both are all you can eat: I usually swipe in, take what I want, eat it, go grab more, then leave. Chef Mike’s subs is one meal per swipe, as is the new chef dons pizza.",
                                            "score": 4,
                                            "author": "backlash10",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Ferris and JJs both are all you can eat \n\nAh. That was not the case when I was an undergrad. I assume they don't have made-to-order sushi anymore and no longer sell alcohol?\n\nJJ's was also only serving food to order, only between 8 or 9 pm and 1 or 2 am.\n\nThe Wein Food Court was a great lunch option that is also no more. It was a real, if impromptu-seeming food court, with private operators running booths, including Korean (The Mill, a restaurant next to Community Food and Juice that recently closed), Chinese, Pizza Hut and others.",
                                                    "score": 1,
                                                    "author": "Philip_J_Friday"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah just hide it in your stomach",
            "score": 43,
            "author": "El-Disco-Bandito",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now that's the kind of genius I expect if a Columbia student",
                    "score": 17,
                    "author": "LifelessJester"
                }
            ]
        },
        {
            "level": 0,
            "comment": "if you don't have Tupperware and are planning on taking smaller stuff no one bats an eye when you use the disposable coffee paper cups. I used to stuff them with cheese/ham for sandwiches or strawberries/blueberries for later",
            "score": 8,
            "author": "mteret"
        },
        {
            "level": 0,
            "comment": "1. If you mean just taking food out of the dining hall then they have temporary containers for you to use, either disposable or reusable depending on what you prefer.\n\n2. If you mean just blatantly stealing food from the dining halls without swiping in then thats gonna be impossible.",
            "score": 3,
            "author": "ThatOneColumbiaGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "More so I was wondering if I could just take extra food I couldn’t eat out of the dining hall and bring it back home",
                    "score": 5,
                    "author": "BasketOutrageous6203",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes you can with either of the two containers they provide for you. The resuable one you have to get at the beginning of the year since thats the only time its free. Otherwise its not worth it. The disposable ones are always like 10 cents or something.",
                            "score": 2,
                            "author": "ThatOneColumbiaGuy"
                        },
                        {
                            "level": 2,
                            "comment": "Yes. I used to bring my backpack.",
                            "score": 1,
                            "author": "Braziliannewyorker"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah absolutely. You don’t even have to use the containers, but you can if you want",
                            "score": 1,
                            "author": "backlash10"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What I do is bring my reusable container with me when I eat so I always have it just in case. They never make me swipe twice.",
                            "score": 1,
                            "author": "ThatOneColumbiaGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You dont need to show them, and even if you do so what? They’ll let you in with the container and they literally wouldn’t be able to see you eating inside. So they can’t say anything when you walk out with the container. And they won’t remember anyway, and if they do they won’t care. So yes you can go in eat and take food out",
                                            "score": 1,
                                            "author": "Mahragan"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i got called fat today leaving with an ice cream from ferris by the worker at the door",
            "score": 3,
            "author": "WhitishPuertoRican",
            "replies": [
                {
                    "level": 1,
                    "comment": "wth",
                    "score": 1,
                    "author": "just-a-byte"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just have a tote/bag with you lol and keep Tupperware in there or for any of the halls that use reusable dishware, sneak it out thru that",
            "score": 2,
            "author": "CirqueDeSol"
        },
        {
            "level": 0,
            "comment": "take your ferris food upstairs and put it in a tupperware container. it’s all you can eat so you can just help yourself to “second” or “third” servings. no one will say anything ❤️",
            "score": 2,
            "author": "just-a-byte"
        }
    ]
}