{
    "id": "13gs4le",
    "score": 9,
    "title": "How do I move my stuff to campus?",
    "author": "PsychologicalCat1876",
    "date": 1684010416.0,
    "url": "https://www.reddit.com/r/columbia/comments/13gs4le",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am an incoming freshman from Michigan. I was wondering how I should transport all my stuff. I'm thinking of buying certain things and having them shipped straight there. I want to fly to NYC, but it's super expensive to buy extra suitcases and stuff.\n\nAlso for stuff like mirrors amd minifridges i imagine a bunch of seniors want to sell them so can I buy it off of them. I heard of the green sale but idk if that is the way to go. And if I do buy it from graduating seniors, where do I store it until I'm actually in NYC.\n\nAny help appreciated! 😁",
    "comments": [
        {
            "level": 0,
            "comment": "Definitely use the pre-shipping. Have as much as possible from Amazon delivered to Mail Center and they’ll get it to your room before move-in. You don’t need a fan (wohoo), and you can get a fridge at the start of the semester (Green sale). Every room comes with a body mirror. You won’t need to store anything tbh",
            "score": 10,
            "author": "Mahragan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your help. Do they provide a fan? And also where do they store the fridge and stuff.",
                    "score": 3,
                    "author": "PsychologicalCat1876",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All first year halls will have AC going forward!",
                            "score": 3,
                            "author": "yellow-mug"
                        },
                        {
                            "level": 2,
                            "comment": "All first year dorms have AC so you won’t need a fan :) People usually donate fridges to the green sale as a lot of suites (more common in upperclass housing) have big fridges. But after first year, a lot put it in summer storage (no university-affiliated storage).",
                            "score": 1,
                            "author": "Mahragan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Green sale is great, especially because it's at the beginning of the semester. You don't need to store anything at all. But there is the chance that certain things sell out.\n\nThe Mail Center will store some shipments over the summer and even deliver them to your room so they're there when you move in. It's not a guarantee and you may have to pick things up in person, which can be a hassle at the beginning of the semester, but it seemed to have worked pretty well this past year. Keep an eye on their website for when that starts.\n\nOtherwise, there's usually a trip to big box stores on a big bus during move-in and some stores will allow you to order to their New York location so you can pick up from there when you arrive.",
            "score": 5,
            "author": "yellow-mug",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your help!",
                    "score": 1,
                    "author": "PsychologicalCat1876"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just road tripped it and got a UHaul.",
            "score": 3,
            "author": "TheMandoAde888"
        },
        {
            "level": 0,
            "comment": "Hi! I went to UAF (Alaska) before I got accepted into Columbia, and moved there from upstate NY. \n\nI flew to Alaska, checking two large suitcases (I used these ones: https://www.target.com/p/hardside-large-checked-spinner-suitcase-made-by-design/-/A-79516379?preselect=53712566#lnk=sametab). I would try southwest tbh, bc they allow two free checked bags, but I used Alaska and found their fees good. \n\nI used one carry on and one personal item as well. My carry on was the 21 inch version of the linked suitcase, and my personal item was a jansport big student. \n\nI did two weeks of stuff in my checked bags. Use packing cubes and the compressing ziplock bags, especially in your 29 inches! (The ziplock extra large fit perfectly in the linked suitcase if you don’t overfill, and I have a set of packing cubes that fit perfectly in the 21 inch) with that, I was able to get comforter, pillow, most of my clothes, etc. \n\nMake sure in your carryon you have anything you’ll need for a week. Your personal should have a change of clothes and your TSA approved toiletries, in case your carryon goes under. \n\nFrom there, I shipped a few totes with USPS. This included the rest of my winter clothing, bedding, etc. the eight totes I shipped were 800 all together and took about three weeks to get from upstate NY to Alaska. \n\nI bought big items when I got there, so I could see what fit and what I actually needed.",
            "score": 2,
            "author": "Comprehensive_Ad4689"
        },
        {
            "level": 0,
            "comment": "In my freshman year I just preshipped a lot of things and then took my clothes and some shoes in my check in and carry on luggages",
            "score": 2,
            "author": "Rasengan777"
        },
        {
            "level": 0,
            "comment": "just remember that you’re gonna need to store everything over the summer so don’t go overboard!",
            "score": 1,
            "author": "samnstorbean"
        }
    ]
}