{
    "id": "13yu9bh",
    "score": 17,
    "title": "How safe is south harlem?",
    "author": "Silver_Cauliflower73",
    "date": 1685750622.0,
    "url": "https://www.reddit.com/r/columbia/comments/13yu9bh",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am thinking of renting an apartment right next to morning side park in south harlem , 122st.\nThe commute time is very short( 10min walk) but I have never been to that neighborhood. Can anybody share their thoughts?",
    "comments": [
        {
            "level": 0,
            "comment": "I swear the people in this school are still living in the 90s.  The area is quite nice imo.  Its obviously been quite gentrified in the last couple decades.  Would much prefer to live there as opposed to were I actually am (feel free to dm, don't really want to dox myself in public posts).\n\nAs other have stated.  I'd stay away from parks at night, so your walking commute might be a bit longer if you were planning on going through.  But other than that, its a city so be alert anywere.  The crime rate in NYC is generally pretty low compared to other major US cities.  There are a lot of people. So you are bound to hear the horror stories occasionally.  Just stay on your feet, an you will be fine almost anywhere in Manhattan.",
            "score": 10,
            "author": "RedNeckBillBob",
            "replies": [
                {
                    "level": 1,
                    "comment": "low but underreported for sure",
                    "score": 1,
                    "author": "GrumpGradStudent"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you can, look west of Morningside Park. You can also look slightly further north if needed (below ~145 and west of Amsterdamn)",
            "score": 8,
            "author": "yesbitchyes27",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who actually has lived in both of these areas, I would take 122nd and Morningside, if aim is to commute to campus quickly. There are a lot of nice businesses in that area, too. Area around city college (eg south of 145 and Amsterdam) is fine, and probably quieter on the side streets, but it’s a bit a food desert (no decent supermarkets) and just generally somewhat less convenient to campus.",
                    "score": 2,
                    "author": "Illustrious_Salad_33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "food universe is a pretty solid supermarket in that area from my experience!",
                            "score": 1,
                            "author": "sophialuciacan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I liked that area. I stayed off campus in that area last summer. Definitely be careful after dark, but with friends you'll be fine. There's a lot of nice people in the area too. I'm a white passing Latino, so I did hear a few disgruntled comments about white people being in the neighborhood, but it was few and far between.",
            "score": 4,
            "author": "javaper"
        },
        {
            "level": 0,
            "comment": "South Harlem is not a thing",
            "score": 11,
            "author": "ViniisLaif"
        },
        {
            "level": 0,
            "comment": "East or West of the park? In general, the closer to Broadway the better imo",
            "score": 4,
            "author": "vorg7"
        },
        {
            "level": 0,
            "comment": "SoHa is a nice community. I feel safe here. I like the resturaunts, the coffee shops, the stores, and the general vibes. I walk through the park to get to campus during the day. After dark, I take a longer route around the park (*do not* walk through the park at night).",
            "score": 26,
            "author": "Prestigious_Sock_840",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just a heads-up, longtime Harlem residents will [get very mad](https://www.nytimes.com/2017/07/06/nyregion/soha-in-harlem-the-misguided-madness-of-neighborhood-rebranding.html) if they hear you describe the area as SoHa lol.",
                    "score": 21,
                    "author": "Delaywaves",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it screams you got told about the neighborhood by a broker and not you know, by living there.\n\nSame with \"WaHi\", it's just gross.",
                            "score": 12,
                            "author": "gammison"
                        },
                        {
                            "level": 2,
                            "comment": "I thought OP was just making it up lol, I've never heard it before.  It doesn't even make sense by neighbhorhood naming precidents... it'd mean \"south of harlem.\"",
                            "score": 9,
                            "author": "Ok-Afternoon-5444"
                        },
                        {
                            "level": 2,
                            "comment": "Oh, alright. Thanks for letting me know.",
                            "score": 2,
                            "author": "Prestigious_Sock_840",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yo, why is this response being downvoted?\n\nSomeone told me that calling the area SoHa wasn't great, so I thanked them for letting me know and now I won't call it that. What am I missing?",
                                    "score": 4,
                                    "author": "Prestigious_Sock_840"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I swear its like once or twice a month one of those crime alert emails will be about someone who decided to walk through the park at night.",
                    "score": 16,
                    "author": "Thetallguy1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Like the other said, it's fine during the day.  Multiple students have been murdered in that area at night though.  South of campus is statistically much safer.  Anecdotally, almost every safety notice sent out (from stolen packages to shootings) is from north or east of the school.",
            "score": 17,
            "author": "Ok-Afternoon-5444",
            "replies": [
                {
                    "level": 1,
                    "comment": "This comment is going overboard.",
                    "score": -9,
                    "author": "Philip_J_Friday",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I'd say there is somewhat a skew of north and east crime alerrs but its isn't like the south/west is true UWS either. The Morton Williams across the street was robbed in the morning and a clerk assaulted by a homeless man in the store that same night last week. Wild.",
                            "score": 7,
                            "author": "Thetallguy1"
                        },
                        {
                            "level": 2,
                            "comment": "Definitely not going overboard. I remember the NYPD swarm after the murders. It's not safe, and it's a disservice to people asking for advice to pretend it is.",
                            "score": 1,
                            "author": "Other_Guitar_7673",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; It's not safe\n\nWhat, specifically, is not safe? Not asking as criticism, just so we are on the same page. \n\nNYC regularly has murders and other terrible crimes but is statistically safer than most places in the USA, and Morningside Heights is safer than the average NYC 'hood.",
                                    "score": 1,
                                    "author": "Philip_J_Friday",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "idt OP is deciding whether to live in Nashville or NYC. They are deciding whether South Harlem is safe. \"Don't live above 125th or east of the park\" was always common knowledge when I was an undergrad, and considering there were several students literally stabbed to death next to my dorm, I take it very seriously and give it out as advice.",
                                            "score": 1,
                                            "author": "Other_Guitar_7673",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am within 5 years of my 20th reunion (for an estimate of my age), and currently live only a few blocks from campus. \n\n&gt; \"Don't live above 125th or east of the park\" was always common knowledge when I was an undergrad\n\nMee too. That's not the general advice today. FFS, my cardiologist (with corporate lawyer husband) lives at 115th and Frederick Douglass. \n\n&gt; several students literally stabbed to death next to my dorm\n\nWhen was this? Which dorm? I know of a handful of murders of CU students since 1950 but a few near one dorm is totally alien to me.  There was that murder-suicide in Ruggles, but the lesson there wasn't \"Harlem is unsafe;\" it was \"don't date white collegiate wrestlers with psychosis.\"",
                                                    "score": 1,
                                                    "author": "Philip_J_Friday",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I graduated within the last 5 years.\n\nI remember this: [https://www.nytimes.com/2021/12/03/nyregion/columbia-student-stabbed.html](https://www.nytimes.com/2021/12/03/nyregion/columbia-student-stabbed.html)\n\nand this: [https://en.wikipedia.org/wiki/Murder\\_of\\_Tessa\\_Majors](https://en.wikipedia.org/wiki/Murder_of_Tessa_Majors)\n\nHarlem \\*is\\* unsafe, and morningside park especially so since both police precincts bordering it believe it's not their responsibility.",
                                                            "score": 0,
                                                            "author": "Other_Guitar_7673",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Those two aberrant events were a half mile apart. So, neither one was \"** literally stabbed to death next to [your] dorm**.\" Lie. \n\nAlso, you wrote \"several,\" which LITERALLY MEANS \"more than two,\" yet there were only two. So that's another lie.\n\nWhy are anti-black racists such as yourself so willing to lie? Or are you just incapable of understanding statistics?\n\nEdit: You're in SEAS, right? Most creationists with college degrees are engineers, same with fearful racists.",
                                                                    "score": 1,
                                                                    "author": "Philip_J_Friday",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "First off, I went to CC.  \nSecond, I literally dormed in EC and have Tessa Major's murder seared into my mind bcs it happened right outside it. The stairs to the part are literally within eye line.\n\nConsidering you haven't been a student since the Bush years, maybe don't give out advice to 18 year olds who are just coming to NYC about safety? \n\nSorry that I only sent you evidence of two extremely violent stabbings within several years of each other. I guess that wasn't enough to justify feeling unsafe?!? Come on.",
                                                                            "score": 1,
                                                                            "author": "Other_Guitar_7673",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt; First off, I went to CC.\n\nMe too.\n\n&gt; Second, I literally dormed in EC\n\nMe too.\n\n&gt; Tessa Major's murder seared into my mind bcs it happened right outside it\n\nI am truly sorry for that experience. \n\n&gt;you haven't been a student since the Bush years\n\nObama, please. Or Clinton? Anyway, this has the opposite meaning of what you intend. Morningside Heights in particular, and NYC more generally, has gotten safer and safer every year since substantive record-keeping started b being freely shared in 1991, and the 'hood was even more dangerous in many ways throughout the whole of the 80s and much of the 70s. The crime rate of 2022 regressed to the crime rate of 2013, not one of the actually dangerous years. The Columbia I first knew was far, far less safe than the one you did, yet even then that fear-mongering wasn't appropriate. \n\nThe 'hood is safer than most neighborhoods in every city or town in this country. I know it doesn't feel like that. But consider this: the few blocks that encompass Morningside Heights (110th to Tiemann, broadway to riverside / Edit:110th to La Salle, Broadway to Morningside Drive) hold upwards of 40,000 residents, depending on the student population. That's a mid-size city in most of the country. Those cities see more murders and other crimes but not everyone learns the name of the victims and they don't become national news for partisan purposes.",
                                                                                    "score": 1,
                                                                                    "author": "Philip_J_Friday",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you have the opportunity, why not visit the neighborhood yourself? (But maybe you're far away, making this suggestion moot.) As you can see from this discussion, people have different points of view on this topic and are ready to harness facts to support those points of view, even when the same facts may lead to different conclusions. But really, if you have the opportunity, you should visit yourself—and at different times of day—just to see what it's like and whether you'd want to live there. I would make the same recommendation for anywhere, really.",
            "score": 2,
            "author": "danuberococoscandal"
        },
        {
            "level": 0,
            "comment": "I don't know now, but it wasn't safe in the 90's. I heard a new foreign student took a job delivering pizzas, and one of his night deliveries was in Harlem. The customer who got the pizza told him \"you got balls coming here\" and gave him a $50 tip.",
            "score": 3,
            "author": "BW6611"
        },
        {
            "level": 0,
            "comment": "Only safe if you're a male and reasonably physically imposing.",
            "score": 2,
            "author": "Other_Guitar_7673",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please shut up\n- a petite woman who lives on 125th",
                    "score": 1,
                    "author": "verafigner1852",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plenty of people disagree lmao. Happy you feel safe. Not a common sentiment, and definitely not at night?",
                            "score": 1,
                            "author": "Other_Guitar_7673"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live there now and have never had issues. My neighbors are chill and it’s as safe as anywhere else in the Columbia area",
            "score": 0,
            "author": "abrownguyappeared"
        },
        {
            "level": 0,
            "comment": "I can’t say much about SoHa. My cousin lives in Harlem and felt safe but he’s also a dude. As a female, all my New Yorker friends told me to live in the UWS south of 100 st. Managed to find an affordable studio under $1900 while also living two blocks from Central Park. Best decision I made!",
            "score": -1,
            "author": "thefoodseeker"
        },
        {
            "level": 0,
            "comment": "As someone living in Northeast Harlem, you're good dawg. Don't go into a park at night, make smart choices and you'll be A-Okay.",
            "score": 0,
            "author": "Thodekk"
        }
    ]
}