{
    "id": "rsmh5i",
    "score": 159,
    "title": "How long until Columbia reaches peak prestige?",
    "author": "Jaded-Indication6644",
    "date": 1640928648.0,
    "url": "https://www.reddit.com/r/columbia/comments/rsmh5i",
    "media_urls": [],
    "other_urls": [],
    "postText": "Columbia is a top school, but it hasn't reached the level of prestige it deserves among the general populace. Clearly, current college students (and their parents) who have recently gone through the admissions process are aware of Columbia’s grand stature. At the mere mention of our school, their eyes widen with respect, and they eagerly commend us for attending such an elite and selective institution: \"Columbia? No way! How did you get in?\" \"Wow, you must be very smart.\" \"Congrats, I hope to send my kid there one day.\" \"Please. Take my daughter's hand in marriage.\" This is how it should be.\n\nUnfortunately, the older, uncultured plebeians of our society are teeming with ignorance. I seethe with godly anger when my family friends don't collapse onto their knees when I mention my college, or when my neighbors question why I would choose to study in New York when we have a community college and state school so nearby. Peasants. How can they be so obtuse? How long do you think it will take for the unwashed masses to learn about our illustrious history and academic prowess? 5 years? 10? 20?",
    "comments": [
        {
            "level": 0,
            "comment": "Spoiler? Not really?\n\n\nWell, if my prediction is correct and they send Peter Parker to Columbia, then Columbia would def get a boost. Lmao",
            "score": 85,
            "author": "Random_Ellen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Especially with Dr Strange and Daredevil being Columbia alumni, idk if theyre gonna bother with creating the fictional empire state u from the comics",
                    "score": 48,
                    "author": "Sandz_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tobey Maguire's Peter Parker from the Sam Raimi films also went to Columbia so it's not a stretch to say Peter Parker could go to Columbia :)",
                            "score": 31,
                            "author": "griffman2020"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Didn’t Peter Parker go to a fictional-NYU in the comics?",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fictional Columbia. Not nyu.",
                            "score": 13,
                            "author": "nyccomicsfan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's an amalgamation of both. It's an Ivy, but downtown, sometimes the campus is drawn to look like Columbia, other times they draw Washington Square park in it.",
                                    "score": 6,
                                    "author": "gammison",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah in the Spider-Man games it was in NYU locations. Columbia’s campus was in the game but I don’t remember it having ESU flags",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Empire State",
                            "score": 10,
                            "author": "jel2184"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once told someone--and I wish that this was a joke--that I went to Columbia and they responded: “Oh, that’s wonderful. For humanitarian purposes?”",
            "score": 46,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had a similar experience! Someone responded really happily with, \"I'm from Colombia! I can tell you what it's like!\", and I didn't have the heart to correct him. Ever since then, I've been saying I go to \"Columbia University in New York.\"",
                    "score": 22,
                    "author": "InexperiencedPikachu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When my high school did a college announcement thing for everyone I had a Colombian family very confusingly ask me why I was going to Bogota.",
                            "score": 12,
                            "author": "gammison"
                        },
                        {
                            "level": 2,
                            "comment": "Haha!",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How long until Columbia can pay its workers in prestige?",
            "score": 33,
            "author": "dingboy12",
            "replies": [
                {
                    "level": 1,
                    "comment": "BoyceBux, coming to an inbox near you",
                    "score": 14,
                    "author": "LazarusRises"
                }
            ]
        },
        {
            "level": 0,
            "comment": "lmao",
            "score": 26,
            "author": "istarisaints"
        },
        {
            "level": 0,
            "comment": "My peasant food just tasted better, this is JUICY",
            "score": 13,
            "author": "GeniusBadger"
        },
        {
            "level": 0,
            "comment": "This is some good pasta",
            "score": 25,
            "author": "AuroraFinem"
        },
        {
            "level": 0,
            "comment": "\"i seethe with godly anger\"",
            "score": 22,
            "author": "aespayuri"
        },
        {
            "level": 0,
            "comment": "Columbia acceptance rate for the class of 25 was 3%",
            "score": 8,
            "author": "Lamari-Piazza"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This.",
                    "score": 5,
                    "author": "AdZealousideal8801"
                },
                {
                    "level": 1,
                    "comment": "Awesome",
                    "score": 2,
                    "author": "A_R5568"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol UChicago shitpost. Anyway, if she ain’t quivering and wet when I tell her about how I went to Columbia then ion want her",
            "score": 8,
            "author": "Ditr231"
        },
        {
            "level": 0,
            "comment": "corny",
            "score": 11,
            "author": "godhatesxfigs"
        },
        {
            "level": 0,
            "comment": "i just say i  go to school in nyc",
            "score": 2,
            "author": "WoWiTzAtHrOwAway"
        },
        {
            "level": 0,
            "comment": "Huh",
            "score": 2,
            "author": "Random_Ellen"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "this is your brain on Dennis Reynolds",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -33,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like your greatest achievement in life is the fact that you went to Columbia 😂",
                    "score": 25,
                    "author": "Vegetable-Most5145"
                },
                {
                    "level": 1,
                    "comment": "You make a new account like once a month and post these same exact talking points and all anyone does is make fun of you. This whole post is making fun of you lmao",
                    "score": 19,
                    "author": "Spookysocks50"
                },
                {
                    "level": 1,
                    "comment": "This is narcissistic personality disorder btw",
                    "score": 12,
                    "author": "MessianicJuice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually, clinical psychopathy is essentially brain damage and is associated with all sorts of negative life outcomes: prison, bankruptcy, premature death, partner-initiated divorce, loneliness, addiction, repetitive failure, and suicide.\n\nSubclinical psychopathy is somewhat financially adaptive but personally maladaptive; unless they come from money, most subclinical psychopaths end up as  cops and bouncers.\n\nYou come off as baselessly overconfident and likely suffering from the Dunning-Kruger effect. If you've been diagnosed as a psychopath (technically, Antisocial Personality Disorder) that was just a professional politely calling you an asshole and a danger to society. If you self-diagnosed, you're probably a narcissist or a borderline that wants to feel cool and badass, but is actually a sad lonely soul with such little genuine self esteem that to do any sort of introspection is to stare into an abyss of meaninglessness so deep that the existential angst is unbearable.\n\nWhichever is the case, I wish you the best but hope to never meet you :)",
                                    "score": 10,
                                    "author": "MessianicJuice"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not sure why you’re dragging GS and grad students into this shenanigans. We all take same classes 🤣 the only difference is that GS students fund their own shit and you are still getting allowances…cry about it 😉",
                    "score": 15,
                    "author": "channhoibong"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You made a genuinely shitty, elitist comment putting people down under an obviously sarcastic joke poking fun at how ridiculous your breed of elitism is. Your comment was not humorous, was not sarcastic, was not you “trolling the troll”, it’s just a manchild that gets a thrill off of being a bad person, and once that is pointed out, you backpedal your problematic opinions as jokes. If this was an actual attempt at humor, then you are obviously so inept you actually think it’s funny and clever to just blatantly insult people. I think you forgot the part in the joke where you say something funny",
                            "score": 16,
                            "author": "RubiesAreSapphires"
                        }
                    ]
                }
            ]
        }
    ]
}