{
    "id": "g8lfpk",
    "score": 2,
    "title": "Most affordable and worth it places to live near campus",
    "author": "SONICBOOMsmash",
    "date": 1587931739.0,
    "url": "https://www.reddit.com/r/GMACEWAN/comments/g8lfpk",
    "media_urls": [],
    "other_urls": [],
    "postText": " I have been accepted and will be joining the Bachelor of Commerce program at MacEwan this fall. Can you guys please toss some insight on what are some of the best options students have in terms of housing that is located on or very close to the campus. MacEwan Residence is one option but a lot of the students I spoke to are against living in it, not sure why.. I'm looking for affordability and convenience. What do you guys suggest? \n\nps tried to post this on the bigger reddit but I've been on pending for months lmao",
    "comments": [
        {
            "level": 0,
            "comment": "try the apartments around 106 street behind macewan, most are very affordable!  Kind of a sketchy area but affordable. I’d also suggest looking in the Southgate area near train stations! Avoid mainstreet and westcorp!\n\nI wouldn’t suggest residence because it’s expensive and internet sucks, rooms are cold, you can’t really decorate. Plus random roommates + unnecessary rules about visitors and stuff like that! \n\nHope this helps. \n\nEdited to add comment on living in residence",
            "score": 1,
            "author": "jessicagabrielleee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the suggestions! What sites do you recommend using for finding rentals right now I use zumper got any better ones?\n\nPS: ill be kinda new to living in Edmonton",
                    "score": 1,
                    "author": "SONICBOOMsmash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I found all of my places through Facebook marketplace! I’d suggest looking on kijiji too! \n\nI recommend trying to live close to either a train station or bus stop if you’re new! You’ll get a bus pass through the school which will be your best friend! Welcome to the city!",
                            "score": 1,
                            "author": "jessicagabrielleee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the helpful advice :)",
                                    "score": 1,
                                    "author": "SONICBOOMsmash"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}