{
    "id": "2yt967",
    "score": 2,
    "title": "TUITION!!! I'M FREAKING OUT!!!",
    "author": "Pkmn_Trainer_Kurisu",
    "date": 1426179932.0,
    "url": "https://www.reddit.com/r/digipen/comments/2yt967",
    "media_urls": [],
    "other_urls": [],
    "postText": "For those of you currently attending DigiPen,  how much was tuition???  My friend just got a total amount of $44000 for his cost. (First year)",
    "comments": [
        {
            "level": 0,
            "comment": "I'm borrowing upwards of 20k a year but yea the other comments are on point with cost of tuition. Private loans are your friend. A horrible shitty friend. ",
            "score": 5,
            "author": "jondySauce"
        },
        {
            "level": 0,
            "comment": "For our class (Currently a junior) it is about 26K a year, so about 13K/semester.",
            "score": 2,
            "author": "darknavi"
        },
        {
            "level": 0,
            "comment": "I have spoken on other threads, but I'll mention it here as well.\n\nI'm about $100,000 in debt from DigiPen (if $44,000 is correct you would have almost double my debt $176,000). I am in the game industry and I do get paid enough to pay for my loans. But, and this is a big one, I barely have enough money left over to do stuff with, like go out to eat or simply go out and do things with friends.\n\nThink hard about going to DigiPen, especially if $44000 is close to what you'll be paying per year.\n\nThere are cheaper options that can easily get you into the game industry as well. Ones that even offer hands-on experience with developing games. DigiPen is no longer the only school that can \"get you into the game industry\".\n\nI suggest looking at all your options if you have not yet done that. No need to put yourself in exorbitant amounts of debt if you can help it.\n\nI will say that I did enjoy my experience at DigiPen, but it was literally a constant stream of work. I rarely had time to do anything else.",
            "score": 2,
            "author": "AbominableRainbow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could I ask what degree you majored in?",
                    "score": 1,
                    "author": "Pkmn_Trainer_Kurisu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doh! Totally forgot to mention that. Apologies, I graduated in 2012 from the BSGD program. I think the name may have changed, but it's the game design degree focused on programming. \n\nI learned quite a bit while attending DigiPen, but if I had the option to go somewhere else I may have, simply due to the cost. \n\nI mean, in actuality if you were to live with a roommate that paid half of rent you would probably be \"ok\" in the financial department(once you got out of DigiPen). Of course that really depends on where you live since game studios tend to be in expensive areas. Not all of them do though.\n\nI'm currently in the industry as a technical designer so just what the program was built for.\n\nEDIT: Clarification info",
                            "score": 1,
                            "author": "AbominableRainbow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I see. I'm sorry but I have just one more question. I am an incoming student for the BFA program, but after looking at the recent posts and reviews... do you think (being someone in the game industry) that attending Digipen is worth it?",
                                    "score": 1,
                                    "author": "Pkmn_Trainer_Kurisu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No worries. Well, I don't know what the rates are for people who enter the BFA program and then go on to work in the game industry as an artist.\n\nI'm uncertain about that. You will definitely work a ton of hours at DP as an artist and work even more if you're wanting to actually work on a game.\n\nI know the BFA program has a game team class now but the game team has to provide a ton of tech(engine technology requirements) before the BFA gets the \"ok\" to work on said game team.\n\nI would say to find out what those employment numbers are and if they are not in the 80% range I would look to somewhere else.\n\nBut also know that wherever you go to you should work as hard as you can because being an artist in the industry is extremely competitive.\n\nI personally think you could consider other, cheaper, options. USC is at the top of the list for the Princeton review for game design degrees. I know USC has an art-based game development degree. Something you could look into along with other colleges if you have yet to do that.\n\nWhile I was at DigiPen there always seemed to be problems with the art degree. Issues with equipment, and teachers for the most part. Always seemed to be in turmoil.\n\nI can't say whether or not you should attend but I would say to look at all your options and think hard about the cost of those options.\n\nHopefully this helps a bit and maybe a BFA will chime in.\n\nThough you could always start up another thread asking about that program as well. Might be able to get more direct info about the state of the degree in that way.",
                                            "score": 1,
                                            "author": "AbominableRainbow",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "THANK YOU SO MUCH. I really appreciate it :)",
                                                    "score": 1,
                                                    "author": "Pkmn_Trainer_Kurisu",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm an RTIS but I have many BFA friends. I wouldn't recommend it, they have a long long list of very serious complaints about thr bfa program right now.",
                                                            "score": 1,
                                                            "author": "PressF1"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you provide some proof? tuitition has been around 13k/sem and this kind of increase would be unprecedented, are you sure you aren't talking about total cost of living and everything combined? Where 44k is a pretty normal number.",
            "score": 2,
            "author": "MC_GD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, I see. And yes, I meant for the total cost. Sorry for the mix-up.",
                    "score": 1,
                    "author": "Pkmn_Trainer_Kurisu"
                },
                {
                    "level": 1,
                    "comment": "44k still sounds high. At 26k/year you'd have to spend 18k on food and housing. It's common to get your own room for 600-700/mo and eating on 400/mo is more than reasonable, which means 44k is likely way more than most people spend.\n\nI have a friend who is very budget minded and he spends around 350/mo on rent and under $200 on groceries.",
                    "score": 1,
                    "author": "PressF1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not sure what it is for freshman now but sounds about right for out of state tuition. Instate is a quite a bit better and you can qualify for it after you get your Washington state residency which happened a year after registering in WA. Make no mistake this school is not cheap or easy.",
            "score": 1,
            "author": "AtlasFumes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait there's a difference between in-state and out-of-state? How much of a difference are we talking?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a difference at most colleges, just google \"digipen tuition\" and the tuition page is the top result. It has all the numbers.",
                            "score": 1,
                            "author": "AtlasFumes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's US and Non-US, but I'm not seeing state residence differences. At least not on the tuition page",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh that's what I'm thinking of is the international stuff. State universities have different in state out of state tuitions. DigiPen is private though so it doesn't care. The high amount op mentioned is probably total student loans which include cost of living and such.",
                                            "score": 2,
                                            "author": "AtlasFumes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah yes. That makes sense",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "44k sounds 'right' if he's going by Digipen's estimation of cost of expenses. https://www.digipen.edu/financial-aid/tuition-and-budgets/  Scroll down and you'll see 44k. Meanwhile in reality my cost is about 35k a year. ",
            "score": 1,
            "author": "RandomStudent888"
        },
        {
            "level": 0,
            "comment": "I was an international student at DigiPen. My tuition was about ~13k a semester (~20 credits) and ~5k for summer sessions (~5 credits). So the tuition was ~26k a year if you don't count the non-mandatory summer sessions, and was ~31k if you count the summer sessions.  \n  \nMy Rent was ~$1200 a month for a one-bedroom apartment that was almost brand-new (2-year-old). There are definitely cheaper choices and more money-saving ways to rent a place. I knew 5 guys who shared a 2-bedroom apartment that was probably a couple decades old, and their rent was ~$200 a month per person.",
            "score": 1,
            "author": "Allen_Chou"
        }
    ]
}