{
    "id": "3msfos",
    "score": 0,
    "title": "Good laptop for going to Digipen?",
    "author": "Trophonix",
    "date": 1443497445.0,
    "url": "https://www.reddit.com/r/digipen/comments/3msfos",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I am a senior in High School and planning to attend Digipen starting next year. I have not yet been accepted, but the Digipen computer recommendations are, I feel, a good set of specs for a laptop no matter what college I end up at. I am thinking about getting a 15'' Macbook Pro, but I wanted to see what you people think. It seems like whenever I find a laptop with Windows on it that seems fair and fits the recommendations, the mac at the same price level is just... better. I'm not sure if having Winders is worth giving up the seemingly superior build quality of the Macbooks and the better hardware + software integration that Apple products boast. What are your thoughts on this, and do you have a specific laptop you would recommend for Digipen?",
    "comments": [
        {
            "level": 0,
            "comment": "Not certain you need a $2000 laptop. That's pretty hefty. I'm just looking at the base 2.2GHz 15\" laptop on apple's storefront.  \n  \nI think I dropped like $1500 on mine and it lasted me throughout my education(at DigiPen), and that was overkill to some extent. I definitely saw the age of the laptop near the end of my time at DigiPen but 4 years is quite a while tech-wise.  \n\nAlso, At least from looking at that base model for $2000, I can go grab an alienware laptop with pretty much more of everything for $1900 (I assume neither of those amounts include shipping)  \n  \n15\" macbook pro vs 15\" Alienware   \nCPU: 2.2 GHz i7 vs 2.6 GHz i7 (both supporting the turbo tech to go higher)  \nGPU: Integrated intel card vs GTX 970M with 3GB of dedicated memory  \nStorage: 256 GB solid State vs 256 GB solid state + 1 TB of a platter drive  \nMemory: 16GB 1600MHz vs 16GB 2133 MHz  \n  \nQuality can definitely win over shear power, but it's something to keep in mind. When you buy a macbook, not all of that money is going to your hardware. It's also going into the name brand and the quality of the product. Not saying which is better, just merely pointing out that you can find cheaper windows laptops with better hardware specs than a macbook.\n\nGood hunting, and good luck with DigiPen. Be absolutely sure you want to go and be aware of the debt you will be in when you leave (if you are taking out loans and the like of course).\n\nAlienware:\nhttp://www.dell.com/us/p/alienware-15-r2/pd?oc=dkcwf03m&amp;model_id=alienware-15-r2#overrides=dkcwf03m:8~2561TB\n\nMacbook:\nhttp://www.apple.com/shop/buy-mac/macbook-pro?product=MJLQ2LL/A&amp;step=config#",
            "score": 3,
            "author": "AbominableRainbow"
        },
        {
            "level": 0,
            "comment": "Another thing that you may want to take into consideration is the gaming aspect. This is very degree dependent, but as a first year BSCSGD, there are several games that I have to play for class, specifically GAT 120, that are only on PC. I know that BAGD also has to take GAT 120, so if you are interested in either of those keep that in mind while buying a computer. I don't know what the other degrees require in terms of OS specificity, but it is good to keep in mind that, at least as of right now, most software is made with Windows OS in mind.\nIt is very possible to go here with Mac's though, as I know several of my friends are doing so. Just have a friend that has a PC if you do go with a Mac.\nGood Luck!",
            "score": 1,
            "author": "Iprocks",
            "replies": [
                {
                    "level": 1,
                    "comment": "With the base Mac it might be a bit tight with the 256 GB drive but the OP could always dual boot windows and Mac. I know quite a few students who did this. \n\nBut yeah, just like what Iprocks said, definitely keep in mind that a lot of development will be targeting Windows platforms.\n\nEDIT: dual booth != dual boot",
                    "score": 2,
                    "author": "AbominableRainbow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Given that 90% of all computers here boast Windows 7 as their operating system, I would recommend veering away from any Apple products (unless you're going in as a BAMSD). Apart from that, I'd recommend optimizing for longevity/durability rather than computing power. The education you're looking to receive will also change the areas to optimize.\n\n(I'd also take issue with the idea that Apple products have better hardware &amp; software integration. That's marketing, not fact)",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually, it kind of is fact. Apple has a tendency to make as much as they can themselves rather than allowing other companies to do it for them. Their software generally works much better with their hardware. I am no Apple fan boy, but any informed individual in the computer industry knows that. As far as the operating system goes, I would almost definitely dual boot. After having some experience using Mac in my computer technology program this year, I would really like to continue using it for basic tasks, as I have grown quite fond of the UI, but I am aware that I will probably need Windows at some point, so yeah I would dual boot.",
                    "score": -1,
                    "author": "Trophonix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Listen man, you asked for my opinion and I gave it to you. I'm not really interested in arguing about Mac vs PC. It seems as though you may already have an idea of what you want to do, which is just fine. If your preference is to stay with something you already know and understand, that's going to be what's right for you. I was just trying to float the idea that doing that may cause problems in the future, so that you're aware.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well.. no, I didn't ask you for your opinion on Mac. The title of the post is \"Good laptop for digipen?\". Okay fine, you don't think I should get a Macbook, I get it, but if not that, then can you give any kind of actual answer to the question please? Not trying to be rude or anything, I was just hoping to get an answer to the question I asked rather than just being told \"DONT DO WHAT YOU SAID!\"",
                                    "score": -1,
                                    "author": "Trophonix",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I was trying to give you a general solution of what to look for that could inform your own research. I said specifically to optimize for longevity and durability rather than computing power (something most students coming here don't take into account).\n\nThe problem is I can't give you a specific answer if you don't give me what things you want to do with the laptop. I'd be recommending totally different things depending on if you're a BFA vs BAMSD vs BAGD vs CS student.",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah, I'm sorry. I am BAGD, and I am hoping to use the laptop for any kind of taking notes and daily things, and maybe some light gaming. \n\nI've just discovered the Lenovo Y50 Touch on Amazon for $1400 and it has a 1 TB SSD and 16 GB of RAM which seems pretty too good to be true, but the reviews I have found seem to hold it pretty highly. Also, I have been looking at convertible 2-in-1's, as they seem like it could be nice for taking notes.\n\nAlso, yeah when I am considering different laptops I make sure to read the reviews and make sure there hasn't been issues with durability or things going wrong quickly. I'm also trying my best to stay pretty close to the recommendations on the DP website, but since I am not a student there yet, obviously I don't really *know* exactly how important those recommendations are.",
                                                    "score": 0,
                                                    "author": "Trophonix",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well now I can give a bit more info! :)\n\nAs a BAGD, you'll need to play a lot of different games for GAT classes. While most of them end up being board games, there are a few digital ones (like Gone Home this year) that you'll need to be able to run.\n\nI have a regular old y50, and I've found it to be more than adequate so far (not a BAGD, but I've run much more taxing games on it before). Personally I'd recommend saving your money and going with the non-touch version, but that's just down to bias against touch screens and a small wallet (/big school loans)",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depending the degree you plan on pursuing, I don't think it's wise to buy a mac unless you plan on running a lot of things under WINE, so expect things not to work, or dualboot. If this laptop is going to be your only work machine then I won't argue the cost and it's all on your needs such as gaming. Almost everyone I know has a desktop so gaming isn't a consideration in buying a laptop. It's more like quadcore + some low end mobile GPU such as a 860m/960m. I also wouldn't say all Windows laptops have shit build quality.",
            "score": 1,
            "author": "randomo9999",
            "replies": [
                {
                    "level": 1,
                    "comment": "I asked this to get recommendations, not just to be told \"don't get mac\".. I know that all Windows laptops don't suck. All I said was that the windows laptops I FOUND just didn't seem up to par compared to the macbook I could get at about the same price point. This is why I asked. I want someone to say \"Oh, well here you go, this would do you!\" and give me a link or give me a brand or give me something. I am also considering a Surface Pro 3, what do you think about that?",
                    "score": 1,
                    "author": "Trophonix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wasn't saying don't get a mac. I was simply saying it's not wise since most things you'll be using will be windows based which is why I mentioned dualboot/WINE. As for actual recommendations on a brand? I honestly have no idea. You'll get a bunch of different answers, but ideally something with good warranty. Which I don't know who is the best at. Alienware I suppose? Considering you're looking at a ~year from now, there isn't much of a point for all this since they'll all be replaced with Skylake and newer mobile GPUs (or I suppose that laptop that has a desktop 980 in it)  \n\nAs for surface pro, I like it though a bit pricey for me in the higher end models. Just don't expect every professor to let you take notes on it. ",
                            "score": 1,
                            "author": "randomo9999"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't get 15, get 17 at least.",
            "score": 0,
            "author": "MC_GD"
        }
    ]
}