{
    "id": "8bnrhp",
    "score": 3,
    "title": "DigiPen or University of Utah?",
    "author": "HolyWhales",
    "date": 1523510100.0,
    "url": "https://www.reddit.com/r/digipen/comments/8bnrhp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am researching my options and was wondering if you all could offer some insight.\n\nI want to major in Game Design, and I can't happily picture myself going in any career path other than working in games. My ultimate career goal would be to be a part of writing teams for RPG's, as I am highly interested in all the creative writing aspects of games, but also with more traditional design components such as level design. I'm not very interested in computer science or programming, and I like art a lot but am not very good at it, but I am very willing to learn enough of both to communicate well with team members. Therefore, at Digipen I would be going into the BAGD program, and at the U of U I'd probably go the Film and Media Arts route with the game design focus.\n\nI've been looking at these two colleges for comparison. Academics-wise, DigiPen feels perfect for me. The pathway of the degree is in line with what I want to study, and there's a pretty high rate to land a career from the college. I love the campus and the work the college has turned out.\n\nHowever, there are some major factors that worry me, mainly being the workload that I hear so much about. I don't doubt that I could handle it, but it sounds like I would be stressed all the time and have almost no time to myself. I am willing to work hard for my future, but I was also hoping to experience some of a real college atmosphere. Not parties--I want to stay far away from those--but the change of culture that comes with going to college vs growing up. And, of course, DigiPen is expensive.\n\nIn hopes to find a solution to this problem, I started looking into the University of Utah. I had read a lot from this subreddit of people recommending that instead of DigiPen--\"the same academics for less money\". Now, there's definitely more \"traditional college experience\" that would be at U of U, and the coursework wouldn't seem to be quite so much. But looking at the class breakdown, it doesn't seem to fit nearly as well with what I want to do. Many say that it's a great game design program, but there are only a handful of game-specific classes in the program. Also, the career outlook doesn't seem as great. There are far less \"big name companies\" that are taking from U of U than DigiPen.\n\nMy interpretation from my research is this: DigiPen would be very expensive and very difficult. There is little of the \"college experience\" that I would ever get. However, I would get a great education in the path that I want and have a better chance of getting a good job after.\nAt U of U, I would have more fun and a better overall experience because not as much of my life is dedicated to academics. It would serve as the midway between growing up and going into the workforce as college is intended to be, whereas I would cross that bridge immediately with DigiPen. Although, the classes aren't as synced with my interests, and the career outlook is not as good.\n\nIs this a correct assessment? Anything that I missed? Anything you would suggest? I'm just looking to get as much information as I can before I weigh my options, and I want to make sure that I have the right understanding in the synthesis that I've made.\n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "Greetings, BSGD alumni here.\n\nSo, first off, here's the cost of the two schools from their respective websites for all 4 years and assuming you are using the loans to pay for housing.\n\nOf course, these are estimates and the cost could differ.\n\nU of U: http://admissions.utah.edu/cost/\n$111,018\n\nTaking into account that you would become a resident in your second year.\n\nDigiPen: https://www.digipen.edu/financial-aid/tuition-and-budgets/\n\n$189,000\n\nTo me, $189,000 sounds absolutely insane to me. $111,018 still sounds insane to me.\n\nI think I got out of DigiPen with somewhere around $120,000 in student loans. \n\nI graduated in 2012 and I now have about ~$70000 in private student loans and ~$20000 in federal loans.\n\nThese loans, no matter which school you choose, out of the options you have provided, will put you in debt for a very long time.\n\nAnd will most likely slow down your capability to purchase a house, a nice car or really any big purchases until you have been in the industry for a bit.\n\nThough, you could always get lucky and land a great job right of the gate. ( I know a couple people that have done that ).\n\nTo be honest though, I'm not sure if DigiPen or U of U are the right fit for what you're wanting to do.\n\nMaybe things have changed since I attended DigiPen, but when I did they didn't put a whole lot of emphasis on writing. I honestly don't know where you would need to go to have a better chance at improving your writing skills as that's not something I have had to research.\n\nGetting a job as a pure designer is tough and typically is not something that is an entry level position. Though I suppose an entry level pure designer would be a content creator. (That's a title I see floating around some studios).\n\nDigiPen has a very strong technical foundation, but I'd say their other parts are not as strong. Again though, I haven't attended DigiPen for 5 years so maybe things have changed.\n\nAlso, for all that I've said the key thing about all of this is that it's on you to make your college experience what you want it to be.\n\nYou will only ever get what you put into it. If you slack off you won't learn much, but if you dedicate yourself to your craft you'll improve immensely.\n\nNo matter where you go, be sure to make lots of friends. Particularly if you decide to go to DigiPen as the people there will be your peers in the industry.\n\nAnd your assessment of DigiPen seems reasonable though I'm a little hesitant to say that BAGD students immediately land design jobs coming out of the school.\n\nAs an anecdote, I work at a AAA studio and I worked with a friend of mine who came from U of U and he seemed competent in everything that I would expect of a technical designer. Again though, maybe he just put a lot of work into the program and is one of the outliers who achieved a lot more than others who gradated from the program.\n\nHope what I have said helps.\n\nFeel free to ask more questions!\n\nEDIT: fixed a few things",
            "score": 6,
            "author": "AbominableRainbow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I graduated in 2006 and I think I only had to take out around $88k.",
                    "score": 1,
                    "author": "M3wThr33"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; I want to major in Game Design, and I can't happily picture myself going in any career path other than working in games. \n\nGo to Digipen\n&gt; My ultimate career goal would be to be a part of writing teams for RPG's, as I am highly interested in all the creative writing aspects of games, but also with more traditional design components such as level design. I'm not very interested in computer science or programming, and I like art a lot but am not very good at it, but I am very willing to learn enough of both to communicate well with team members. Therefore, at Digipen I would be going into the BAGD program, and at the U of U I'd probably go the Film and Media Arts route with the game design focus.\n\nBAGD is a much better fit than UoU then, as I'm sure you know.\n&gt; I've been looking at these two colleges for comparison. Academics-wise, DigiPen feels perfect for me. The pathway of the degree is in line with what I want to study, and there's a pretty high rate to land a career from the college. I love the campus and the work the college has turned out.\n\nAgree, BAGD has low placement rate (for digipen) because having no CS skills is less marketable, though it still may be higher than similar degrees at other schools.\n&gt; However, there are some major factors that worry me, mainly being the workload that I hear so much about. I don't doubt that I could handle it, but it sounds like I would be stressed all the time and have almost no time to myself. \n\nPeople love to complain, college is not hard, and digipen may be harder than average but that doesn't mean that much. Everyone has personal struggles to overcome at any school, (whether in motivation, aptitude, finances, time, management, whatever) but Digipeners love to blame the \"High workload\" as the source of their troubles. Also BAGD is easiest degree if you aren't a horrible writer.\n&gt; I am willing to work hard for my future, but I was also hoping to experience some of a real college atmosphere. Not parties--I want to stay far away from those--but the change of culture that comes with going to college vs growing up. And, of course, DigiPen is expensive.\n\nFuck that play video games!\n\nSerious answer: You will make great friends at digipen, with such a high concentration of people with similar interest, and that's what matters most.\n\n&gt; In hopes to find a solution to this problem, I started looking into the University of Utah. I had read a lot from this subreddit of people recommending that instead of DigiPen--\"the same academics for less money\". Now, there's definitely more \"traditional college experience\" that would be at U of U, and the coursework wouldn't seem to be quite so much. But looking at the class breakdown, it doesn't seem to fit nearly as well with what I want to do. Many say that it's a great game design program, but there are only a handful of game-specific classes in the program. Also, the career outlook doesn't seem as great. There are far less \"big name companies\" that are taking from U of U than DigiPen.\n\nYou're answering your own question\n\n&gt; My interpretation from my research is this: DigiPen would be very expensive and very difficult. There is little of the \"college experience\" that I would ever get. However, I would get a great education in the path that I want and have a better chance of getting a good job after. At U of U, I would have more fun and a better overall experience because not as much of my life is dedicated to academics. It would serve as the midway between growing up and going into the workforce as college is intended to be, whereas I would cross that bridge immediately with DigiPen. Although, the classes aren't as synced with my interests, and the career outlook is not as good.\n\nCompletely disagree, making games is hard, but fun, you will probably make much better friends at digipen, don't assume quality of life is due to ease of school.\n\n&gt; Is this a correct assessment? Anything that I missed? Anything you would suggest? I'm just looking to get as much information as I can before I weigh my options, and I want to make sure that I have the right understanding in the synthesis that I've made.\n\nThis was kinda a waste of time cus you clearly should go to Digipen given the information you shared.\n\nSource: BAGD grad / systems designer at a great AAA studio",
            "score": 2,
            "author": "MC_GD"
        }
    ]
}