{
    "id": "bvjwh9",
    "score": 1,
    "title": "Thinking of applying for MSCS",
    "author": "Ph4ntonW0lf",
    "date": 1559388880.0,
    "url": "https://www.reddit.com/r/digipen/comments/bvjwh9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys, recently I've been thinking about applying to DigiPen as a grad student. In a couple years, I'll graduate from a different university with a BS in Computer Science and minors in mathematics and art.\n\n I was wondering if anyone had experience with this program? My school doesn't offer any sort of game development courses and I'm not even sure they offer an in depth computer graphics course. I don't want to be completely lost so I've been teaching myself how to use Unity in my spare time. I just don't want to be really lost if I get accepted.\n\nAlso, for people in the Redmond area, what is the general cost of housing for a one bedroom vs two bedroom apartment? What if it has a yard? I have two large dogs who I refuse to leave behind, since they've practically saved my life.",
    "comments": [
        {
            "level": 0,
            "comment": "I can’t speak much about housing in Redmond since I haven’t lived there in quite some time, but it’s not cheap generally. \n\nI graduated from the MSCS in 2014 so I can speak to that. Your BSCS should prepare you enough to get in I suspect. Many questions should be directed at admissions (you can find contact info for them on the website).\n\nUnity experience will help with things down the line. The school wants you to learn engine design so they’ll have you build one from scratch during the coursework.",
            "score": 3,
            "author": "AgentFeyd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your response! I have been talking to admissions with similar questions but I wanted to hear from someone's own experience :)",
                    "score": 2,
                    "author": "Ph4ntonW0lf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anything in particular you want it know about?\n\nMy feeling is that it’s decent at getting you the connections and some experience in doing the projects in games. It can apply well outside of games too, but if you’re not particularly interested in games it doesn’t make a lot of sense.\n\nDon’t plan on having a very active social life while attending. Much of your time will likely be spent on class work. Time management is critical. The dogs will provide a good reason to take short breaks.",
                            "score": 2,
                            "author": "AgentFeyd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm fine with not having a social life haha; it's already pretty minimal. \n\nI LOVE video games. I've wanted to work on them since I was in highschool, but I'm lost on how to get started besides my CS degree. My thinking was that DigiPen would be a good place to get connections and experience with actual game programming. I was just browsing jobs and everyone wants someone with professional experience that I don't know how to get. Do you have any advice in regards to obtaining relevant experience?",
                                    "score": 2,
                                    "author": "Ph4ntonW0lf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Connections are often important for that introduction, and DigiPen can help a lot in that regard.\n\nAs far as advice on getting experience, continuing to learn Unity and building projects is a solid idea. Consider doing the same with Unreal too. These independent projects are quite valuable, but so are group projects.\n\nMost roles that you will find are likely geared toward people who have been in the industry for a little bit. It’s hard to find junior positions, so maybe look at internships. This is often how a lot will start, or through other roles such as QA maybe.",
                                            "score": 2,
                                            "author": "AgentFeyd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How likely would it be for me to get an internship as a grad student? The office of admissions told me internships are generally given to undergrad. Would an internship with another software company be comparable as experience? \n\nI feel like I'll be behind because I live in an area without video game companies, and even another tech company internship will have me relocate for the length of it.",
                                                    "score": 2,
                                                    "author": "Ph4ntonW0lf",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I started with internships, so probably decent?\n\nPlenty of folks get hired in without them as well. It’s all in how you sell and present yourself. \n\nI would say that the majority of students come from places without much games industry, and that’s ok. The industry needs diversity in all forms.",
                                                            "score": 2,
                                                            "author": "AgentFeyd",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you so much for answering my questions! I really appreciate it :)",
                                                                    "score": 1,
                                                                    "author": "Ph4ntonW0lf"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}