{
    "id": "lvym7y",
    "score": 9,
    "title": "SIT Digipen Video Assessment [UXGD]",
    "author": "BlackTurtleBeans",
    "date": 1614679434.0,
    "url": "https://www.reddit.com/r/digipen/comments/lvym7y",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all, I recently got shortlisted for the BA User Experience and Game Design admissions interview for the SG campus and would like to seek advice.\n\nI saw that there's 13 video questions and 2 written questions but I have no clue what to expect.\n\nAppreciate all the help I can get. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "SG BFA Freshmen here! Went through the video assessment last year. They’d ask you fairly regular questions like how you would work in a team etc, how you handle difficulties and questions like that. They’ll give you about a minute or five (can’t remember) to prepare before answering the question! \n\nEach question also has a time limit so you have to kee track while answering each question. It’s mostly like a regular interview except you’re recording yourself with nobody replying you. \n\nAll the best! :)",
            "score": 3,
            "author": "nileux",
            "replies": [
                {
                    "level": 1,
                    "comment": "can I ask abt laptop requirements? any specific recommendations? 😊",
                    "score": 1,
                    "author": "Nervous_Anemone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "nope, you’ll probably end up using the school com anyway haha.",
                            "score": 1,
                            "author": "nileux",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that’s good but is it necessary to own an ipad for lectures?",
                                    "score": 1,
                                    "author": "Nervous_Anemone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "not at all, there is literally only 1 mod that requires you to sit and just listen. the rest are all hands-on that requires no notes, just practical art work and projects! a notebook will suffice, the bulk of your money goes to art supplies!",
                                            "score": 1,
                                            "author": "nileux",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "hi im back to ask IF THERES LIKE HOSTEL nearby SIT@SP that houses students that lives kinda far from the west? Im an eastie here 🥲 and it’ll take 2 hours each day (to &amp; fro) to get home",
                                                    "score": 1,
                                                    "author": "Nervous_Anemone",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "hi! nope unfortunately, the SP campuses are reserved for international students…there are a lot of easties here that take a super long time too! probably when SIT finally opens their campus at punggol! 😂",
                                                            "score": 1,
                                                            "author": "nileux"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "SG BFA Sophomore here, the recorded video interview seems to be a relatively new process set by SIT (and Digipen SG in your case) in place of a IRL interview. A similar process is done for financial aid applications to SIT.\n\nI can't say for sure what are the sort of questions the video interview for admissions will entail but if it's similar like their financial aid application, you should be given a set amount of time to rehearse before each new video and written question. \n\nYou should also be able to take a break before answering a new question should you need to, you'll pick up where you last left off. Also there will be a technical set-up process at the very start so I'd recommend using that time to test your webcam and mic, maybe some rehearsals to loosen your nerves.\n\nBest of luck for your video interview!",
            "score": 1,
            "author": "thisismisozen"
        },
        {
            "level": 0,
            "comment": "BAGD Senior here.   \nThey do a UX version of the BAGD program now? That's pretty cool.\n\nFor your question, I'm afraid I can't help you, my cohort was the last one that didn't even have to bring a portfolio lmao",
            "score": 1,
            "author": "Morandev"
        },
        {
            "level": 0,
            "comment": "I went throught the first video assesment in February. Would there be another interview this month or have you gone through a second interview?",
            "score": 1,
            "author": "Nervous_Anemone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, from what I understand, the only assessments that they do are firstly the submission done through SIT Admissions and secondly the video interview via the SIT Portal.\n\nThere shouldn't be any another interviews. Hope this helps!",
                    "score": 1,
                    "author": "BlackTurtleBeans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone on Reddit told me there they’re going for a face to face interview at SIT! So I was just curious if you got a response from them :)",
                            "score": 2,
                            "author": "Nervous_Anemone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh nope, I didn't know they were doing face to face interviews! I've just been waiting for a response after completing the video assessment, haha!",
                                    "score": 1,
                                    "author": "BlackTurtleBeans",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hi I just received the offer letter! I hope you did too!",
                                            "score": 1,
                                            "author": "Nervous_Anemone"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}