{
    "id": "140atkj",
    "score": 2770,
    "title": "Jew in Heaven",
    "author": "jasiekbielecki",
    "date": 1685879752.0,
    "url": "https://www.reddit.com/r/jokes/comments/140atkj",
    "media_urls": [],
    "other_urls": [],
    "postText": "An old Jew dies and goes to Heaven.  \nHe was a funny guy and meeting the God he started with telling a holocaust joke.  \nGod says \"That wasn't funny. It was offensive.\"  \nThe Jew replies \"I guess you had to be there.\"\n\n(its an old, stolen joke, I am too dumb to make it up)",
    "comments": [
        {
            "level": 0,
            "comment": "I like this, it points out the sheer depravity of the situation.It is  actually quite tasteful for a holocaust joke.",
            "score": 926,
            "author": "kaufmannenrico6",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"It is actually quite tasteful for a holocaust joke\"\n\nThat may be the first time that's been said",
                    "score": 589,
                    "author": "Ben_Thar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jews tell each other this one.",
                            "score": 68,
                            "author": "Hunter62610",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a wide margin. \n\nI have a Jewish friend and he told me the one that starts, \"What's the difference between a jew and an apple pie?\"",
                                    "score": 14,
                                    "author": "BlackRobedMage",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You take the pie out of the oven?",
                                            "score": 12,
                                            "author": "cisforcoffee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But you can’t take the oven out of the apple pie?",
                                                    "score": 6,
                                                    "author": "FillThisEmptyCup"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Something about going in an oven?",
                                            "score": 7,
                                            "author": "Hunter62610",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What's the difference between Santa Claus and Rabbi Klaus?\n\nRabbi Klaus went up the chimney.",
                                                    "score": 4,
                                                    "author": "Additional-Fix991",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wait I don’t get it, why would he go up the chimney? Lol",
                                                            "score": 1,
                                                            "author": "BrutalManners",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "As in, the smoke of his body being burned going up the chimney",
                                                                    "score": 1,
                                                                    "author": "TheJanJonatan"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Quite a few",
                                            "score": 1,
                                            "author": "Doggo_Eats"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "On the internet?",
                            "score": 4,
                            "author": "dterrible",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Located entirely within your own kitchen?",
                                    "score": 2,
                                    "author": "innergamedude"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "u/kaufmannenrico6 is hereby cancelled.",
                            "score": 64,
                            "author": "smilingbuddhauk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just from June 12-14?",
                                    "score": 27,
                                    "author": "Morewokethanur"
                                },
                                {
                                    "level": 3,
                                    "comment": "Time to go death con?",
                                    "score": 8,
                                    "author": "JP058",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "… to go what? Sounds like a terrible convention.",
                                            "score": 6,
                                            "author": "Wandering_Maybe-Lost",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sorry, I’m a bit sleepy tonight",
                                                    "score": 5,
                                                    "author": "JP058"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "tastes.......*smokey*",
                            "score": -5,
                            "author": "Im-Spreading-for-you"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m Jewish and I absolutely love telling this joke. I think it helps explains the complicated relationship many modern Jews have with the idea of G-d. He can’t have been there in the camps, and if He’s not omnipresent and omnibenevolent, then the relationship gets really complicated.",
                    "score": 101,
                    "author": "gbbmiler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Out of curiosity, why omit the \"o\" in God? Does it have to do with the 10 Commandments and not taking the name of the Lord in vain?",
                            "score": 14,
                            "author": "Bike_Chain_96",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Anything with the name of G_d (which can include that word) is considered to be holy and would need to be treated as such. \n\n   Obviously there are many occasions when you would want to use the word G_d, but might not want to treat it like a Bible/Torah for the rest of time.",
                                    "score": 20,
                                    "author": "eccezarathustra",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Correct me if I'm wrong, but are you saying that something that uses the word \"God\" is, in the eyes of Judaism, equivalent to scripture and should not be used outside of such? Because while I try to not invoke the name of God lightly, that's honestly more of an extreme take than I would have.\n\nHow do you refer to a worship of a deity, or the effects of one in your life, or well and truly anything to do with your deity, if you can't even refer to them as your God? I understand and agree with not using their \"real name\" and using a title instead, but putting even the title on such a pedestal feels extreme.",
                                            "score": 11,
                                            "author": "Bike_Chain_96",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "HaShem (the name) is often used verbally as a substitution for G_d's name. Baruch HaShem... Praise the Name (G_d).\n\n   In prayer verbally you might use Adonai (Lord). Baruch atah Adonai... Blessed are you, Lord. But in text Adonai would not be written out. You would see '' (a double yud). \n\n   I don't believe the tetragrammaton is used in any context, at least that I can think of. \n\n   I am not sure if the exclusion of the word G_d is because it's a replacement of actual name, or because it's treated as a translation of the actual name and thus equivalent. If someone knows I would love to learn.",
                                                    "score": 18,
                                                    "author": "eccezarathustra",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Same reason to avoid mixing chicken meat and cow milk, even though it wouldn't violate the underlying rule to \"not boil a calf in its mother's milk\". It's about following the rule even more than the actual rule, so you don't get anywhere close to the forbidden thing.",
                                                            "score": 12,
                                                            "author": "anally_ExpressUrself"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "But just omitting a word but with the intention to say god and everybody understanding it's god, isn't it just a technicality? You are still invoking god.",
                                                            "score": 5,
                                                            "author": "znhamz",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That is kind of a hallmark of Judaism. It's a very legalistic tradition. There's a contract with God, and contracts are subject to interpretation. And why should this one be any different? If God's all powerful and all knowing, any loopholes in the contract must be there on purpose.\n\nEdit: there's a story about this that I always thought was just a joke about how far this gets taken, but it turns out it's actually [in the Talmud.](https://en.m.wikipedia.org/wiki/The_Oven_of_Akhnai) The legalistic aspect is so baked into Judaism that there's literally a story in the talmud about some rabbis getting god himself to admit he was in the wrong when he personally weighed in on how to interpret a particularly esoteric point of religious law. And he was proud of them for pulling it off!",
                                                                    "score": 5,
                                                                    "author": "FuckIPLaw",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "When I learned about the wires strung up around Jewish communities so they wouldn't have to violate the Sabbath prohibition against work, I was \"huh.\"  Then I learned about elevators going to all floors, leaving the stove on low, etc etc, and I was \"wild.\"",
                                                                            "score": 5,
                                                                            "author": "fyrdude58"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Where's Herschel Krustovski when you need him?",
                                                            "score": 1,
                                                            "author": "fyrdude58"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He Who Shall Not Be Named",
                                                    "score": 4,
                                                    "author": "TheDieselTastesFire",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No no no, you’re talking about you-know-who, that guy’s dead! 😳 Don’t speak ill of the dead! /s",
                                                            "score": 1,
                                                            "author": "TaikaJamppa"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I just want to point out that Judaism is not monolithic, and using G-d is probably in the minority, though maybe not among the Orthodox.",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Its taking his name in vain that's the problem, meaning don't say it meaninglessly. If you say His name when you're referring to Him, or talking to Him, saying His name with reverence, then that's perfectly fine.\n\nHowever, saying His name as a filler word, or a swear, or \"just because\", that's wherein lies the problem.",
                                            "score": 4,
                                            "author": "DBProxy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "G-d d-mn it! I was going to say that.",
                                                    "score": 1,
                                                    "author": "fyrdude58"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was just wondering this, especially since the Jewish name for God is Tetragramatton.",
                                    "score": 1,
                                    "author": "allthecolorssa"
                                },
                                {
                                    "level": 3,
                                    "comment": "Because even though most religious people know that God doesn’t do anything good, they are still afraid to anger him.  Most religious texts work based on fear.",
                                    "score": 0,
                                    "author": "bacalhauqueralho84",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't say \"religious\" when you mean Christian.",
                                            "score": -2,
                                            "author": "YosephusFlavius",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't say Christian, when he is specifically talking about Judaism and can include Islam, and almost all of the  religions from the European and Asian regions.",
                                                    "score": 1,
                                                    "author": "fyrdude58"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am not religious, but do believe in God in some form. Here's the thinking. The Holocaust is not the first time that humans have done sickening things to other humans (also plants, animals, planets) and it won't be the last. There is no difference in suffering for the individual in a camp in Poland, a slave boat in the Atlantic or a village being burned by Mongols. God did not do these things, man did. God does not change these things because they are part of the whole package. If he created a universe that he controlled the actions of the people within it, what would be the point? That would be like creating a movie, stagnant and empty of meaning for those within it. God wants its creations to find their own meaning. Maybe these terrible events have purposes that we don't fully understand. The holocaust in all its disgusting influence has taught much to those that pay attention. It shows us the horrendous levels that tyranny can take. The dangers of group think and hatred of those that are different. Knowledge of it informs the educated of the insane levels of destruction that are capable by humans in a mechanized modern world. In short, it could be a valuable lesson to people now and in the future to not fuck up even worse. It has and I hope will continue to be, a reason for people to care more and try harder....or it can be trivialize and forgotten and we can repeat it again. Maybe God knows we can do better.",
                            "score": 37,
                            "author": "zwinters57",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe god doesn’t exist.  Ockham’s razor.\n\nWe really have to twist our thoughts, worldview, and experiences around in circles to justify an idea that I don’t see the world, the natural world, particularly inviting us to have.  God is an idea from a subset of humans to humans, usually offspring.  No other animal has this concept.",
                                    "score": 3,
                                    "author": "FillThisEmptyCup",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Again, it's \"occams razor\". It has nothing to do with proving or disproving the existence of God. I don't think most of the people invoking it actually understand what it says, because it is not proof of anything. It simply says that simpler reasons are easier to prove. This is obvious.",
                                            "score": 1,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Again, it's \"occams razor\".\n\n* https://en.wikipedia.org/wiki/Occam%27s_razor\n\n&gt;In philosophy, Occam's razor (also spelled Ockham's razor or Ocham's razor; Latin: novacula Occami) is the problem-solving principle that recommends searching for explanations constructed with the smallest possible set of elements. It is also known as the principle of parsimony or the law of parsimony (Latin: lex parsimoniae). Attributed to William of Ockham…",
                                                    "score": 1,
                                                    "author": "FillThisEmptyCup",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Again, it does nothing to disprove the existence of God. A universe without a God is in no way simpler or easier to explain than a universe with one. In fact, in many ways its easier to explain with a creator. Being easier to explain does nothing towards evidence. You also have no way of knowing that no other animal has a concept of God. These are assumptions that have no proof and honestly probably can't be proven either way. It goes back to the beginning. There really is no proof in support of or against the existence of God.",
                                                            "score": 1,
                                                            "author": "zwinters57",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I can't prove that animals don't believe in Santa Claus, Mars or Zeus, or C'thulu either.",
                                                                    "score": 1,
                                                                    "author": "FillThisEmptyCup",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Correct. Many animals mourn the loss of their dead. Some even return to visit the site of their loved ones death. Many have fairly advanced signs of being self aware or conscious of themselves and their position in their society. We do not know what level of spirituality they've reached. We do not know if they have thoughts of an afterlife or much about what they're thinking at all. We built much of modern societies advancements on science that we find out later is essentially wrong or at least extremely incomplete (think Einstein's work in space and time). We really don't know much at all. Too assume we do is arrogant.",
                                                                            "score": 1,
                                                                            "author": "zwinters57"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "With an iota of magical compassion dust sprinkled into the water an omniscient god who created the heavens and earth could have forgiven Eve for the apple incident and saved millions from various human tortures.   \n\nIf there is an omniscient all-powerful god, he/she/it is a voyeuristic sadist, I believe today.",
                                    "score": 31,
                                    "author": "piper63-c137",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There is no argument I’ve heard that explains the Existence of Evil problem. Furthermore the entire story arc of man’s creation, fall, and redemption is overcomplicated past the point of absurdity. I keep going to church and keep hoping to hear something that convinces me. A God may exist in some form, but it must be completely different from anything we have imagined and if it notices man at all it must laugh itself silly at our attempts at religious worship.",
                                            "score": 10,
                                            "author": "mac224b"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\"God\" doesn't have to be a giant human in the sky that oversees the earth like some sort of corporate manager. I agree this idea is silly, but it stems from a time when the capacity of the general population to understand the concept, was limited by their knowledge of the universe. People can only see things that they can understand. My personal concept of God is that \"He\" is the entirety of everything in existence. It ensues that we are all small particles of God. Trees, rocks, rabbits, humans, stars, comets...we are all pieces of the entirety. Maybe our Holocaust is like an infection in the blood of God. Are we not nearly \"all powerful\" in the face of an individual bacteria. We understand them. We know how to culture them. How to kill them. Much of what their function is. We are also made up of them. We live consciously on the backs of what we guess to be their \"unconscious\" work and when they are out of balance we are sick. In the end, what it's the universe without some form of \"god\"? What is the purpose? What is the meaning? Who then set the \"rules of physics\"? If they set themselves, then why? How? If you do not believe there is meaning, then how do you live? Do you not find meaning in the relationship you have with your kids or your mom? Does that not translate to your life as a whole? Does your life not translate to society? Does society not translate to the earth? Does the function of the earth not translate to the universe?",
                                            "score": 5,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm a rabbit",
                                                    "score": 2,
                                                    "author": "JasonFootsmell",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "What’s your blood type?",
                                                            "score": 1,
                                                            "author": "R22L16",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "H0ly+",
                                                                    "score": 1,
                                                                    "author": "JasonFootsmell"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The funny thing about a lack of objective meaning is that it doesn't inform any course of action. I find the idea I should not live without meaning as silly as the idea of meaning itself. Why get out of bed in the morning without? Why not? I can't form a basis of action on nothing and that is what there is for objective meaning. So I do things that interest me and I do my best to limit the suffering of others as I can, and I wait to see if I will be proven wrong.",
                                                    "score": 5,
                                                    "author": "dangle321",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That is because you do not truly believe in a lack of meaning. If you did, why would you try to limit the suffering of others? If their suffering had no meaning it wouldn't matter, but it does have meaning, both in their lives and in yours, hence your attempt to limit it and this lesson might be the very essence of the meaning itself.",
                                                            "score": 2,
                                                            "author": "zwinters57",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Of course limiting the suffering of others has meaning but you don't have to believe in a god to feel empathy and compassion toward others. That's like saying people who don't believe in a god are all evil and devoid of the ability to care and make this world a better place. What you are saying is pretty much standard fare for religious people but that's your reality, it's what you've been told must be right. That doesn't mean it is. Imo what you have said is all part of the brainwashing that the church practises in order to control people.",
                                                                    "score": 4,
                                                                    "author": "JasonFootsmell"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's not true. Their suffering doesn't matter, but it's still experienced by them, so why not try to reduce it?  It doesn't matter but I choose to do it. The fact that their suffering is meaningless doesn't mean I SHOULDN'T try to reduce it either.\n\nWhat is the logic that if something is meaningless you should do nothing at all? How can you draw any practically applicable philosophy from the void?",
                                                                    "score": 1,
                                                                    "author": "dangle321",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I disagree. You do something about it precisely because it does have meaning. You think it means something to them, which is why you try and help. Maybe you don't think it has cosmic or spiritual significance, but clearly you can tell that their suffering hurts them and diminishes their experience of life. It also has meaning to you. You feel bad that something is suffering and you want to help them. Is that not purpose? Everything innately has meaning by the mere fact of its existence. When someone lives and loves and is shot and killed and their children miss their father and their wife is forced to live without a husband and their children's children carry the trauma of the event and it effects the way they raise their children and there is a chain effect that in some way effects thousands of peoples experience in the life they live and how they effect other people and animals and the earth...and you would look that family in the eye and tell them that their fathers life was meaningless? Your fathers life is meaningless? Your life is meaningless? What a sad way to live.",
                                                                            "score": 1,
                                                                            "author": "zwinters57",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You only think it's sad because you don't see beyond your own view point. And that's fine. It's not inherently sad. It's not inherently happy. It's not inherently anything because none of it matters.\n\nIf there is no meaning it doesn't not mean there are no choices. You can get out of bed or not. So I choose to get out of bed. It doesn't mean it was meaningful. It was just one of several options.\n\nThe quest for meaning seems intrinsicly important to you, so why would I try to argue against it? If the world has meaning to you than it does. Let's leave it there.",
                                                                                    "score": 1,
                                                                                    "author": "dangle321",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Why is god “He” then if he is an amalgamation of all these things? Right, I agree, not a corporate manager, but more like a trickster “hey good luck with the rules I gave out. Just so you know, I gave your neighbours a different set of rules. go!”\n\nWhy does the universe need god to operate? How can one god who has to balance every spinning planet and inifinite nebulae spare a magic moment to heal my cancer?   \n\nMeaning without god? God is not present to drive meaning in anyone’s life- except by their own choosing- we choose to believe or not believe - or to have individual beliefs of the varying degrees of omnipresence of god.   \n\nI’m sorry, I don’t wish to debate or belittle the existence of the god of your understanding with you. I have a personal belief in a source energy that can be called god for lack of time and language to describe it. It’s not active in human activity much in benign ways seems to me.",
                                                    "score": 1,
                                                    "author": "piper63-c137",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm not sure our different views of \"god\" are as different as you think. I use he, because \"it\" seems crass. I don't think \"he\" has a gender or a species. I think it is simply an energy, as all things are. Remember that all matter can be broken down to \"energy\".",
                                                            "score": 2,
                                                            "author": "zwinters57",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That’s likely true. Today I’m being short tempered with human conception of god as an active force for Good as outlined by the joke. The anthropomorphic god that answers prayers in regards to human suffering seems fake and one dimensional today.",
                                                                    "score": 2,
                                                                    "author": "piper63-c137"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Sure, but why would an impersonal deterministic \"god\" need worshippers?  The easy answer is: it wouldn't.",
                                                    "score": 1,
                                                    "author": "CeruleanRuin"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That would all be well and good, except some people didn’t actually learn anything from it, so it’s hard to rationalize it as a lesson. White supremacy still exists, tyranny still exists, authoritarianism still exists, book burning still exists, oppression still exists… hell, some people even deny the Holocaust happened. \n\nSo… I can’t entirely buy into that argument.",
                                    "score": 7,
                                    "author": "Xak_Ev01v3d",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm sorry, but white supremacy does not still exist it 1/1000th of the form that it did throughout the 18th, 19th and 20th centuries. If you can't see that dramatic change in society, I'm not sure we have a basis to have a fruitful discussion. Of course oppression still exist, we don't live on a rainbow, but the Holocaust, The great famine, the nuclear bomb, I think these have all been huge lessons in the shaping of the modern world, which post WW2, unequivocally suffers far less violence and injustice than any time in history.",
                                            "score": -7,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;I’m sorry, but white supremacy does not still exist it (sic) 1/1000th of the form that it did throughout the 18th, 19th and 20th centuries.\n\nIs this the “we don’t have slavery anymore” argument? \n\nWhite supremacy is still incredibly pervasive and influential.\n\n[Here](https://amp.france24.com/en/europe/20230508-french-police-under-fire-for-allowing-neo-nazi-rally-in-paris-on-ve-day) is an article about a neo-Nazi march that took place less than a month ago.",
                                                    "score": 6,
                                                    "author": "Xak_Ev01v3d",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dude, actual Nazis ran half the world, killed over 6 million people and nearly destroyed the world as we know it. You cannot equate that to a hundred disenfranchised yokels marching in a half assed parade. If your argument is that their has been no improvement in the ending of injustice in the modern western world, you are blindly unaware of history.",
                                                            "score": 0,
                                                            "author": "zwinters57",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You might need to re-read my first response, because that wasn’t my argument at all. \n\nI can’t tell whether or not you’re being willfully ignorant/obtuse and purely argumentative, but I said my piece so I won’t engage further.",
                                                                    "score": 3,
                                                                    "author": "Xak_Ev01v3d",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think it should have taught us that the universe doesn't owe us a fucking thing so we better start being decent to each other because it doesn't care.",
                                    "score": 4,
                                    "author": "FelixTheEngine"
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s the canonical argument, and it’s powerful to many people. It seems to break down some in the face of miraculous intervention — the Nazis could have made their choice to genocide us, and Hashem could have foiled their plan without taking away their agency. Even without miracles, G-d could have tinkered around the edges and ensured the German war effort went worse and didn’t give them the time/power to do effectively exterminate European Jewry. \n\nI’m about as religious as an atheist can get, but I think the most compelling argument against the problem of evil is to say G-d isn’t omnipotent, and was simply unable to create a better world. He doesn’t have to be omnipotent to be worthy of praise.",
                                    "score": 2,
                                    "author": "gbbmiler"
                                },
                                {
                                    "level": 3,
                                    "comment": "I am polish and whenever I read \"camps in Poland\" I feel offended.",
                                    "score": 0,
                                    "author": "Ragrab",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"German camps in Poland.\" There, better? Also, don't be offended. Many polish people helped the Nazis, many more fought against them. Many Germans hated Nazis. Some died for it. We're all individuals.",
                                            "score": 5,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We are individuals now. Scary thing about holocaust is the fact it was organized by government. It was legit, nazi party won elections.\n\nI prefer term \"Nazi Camps\" as camps where located all over europe.",
                                                    "score": 1,
                                                    "author": "Ragrab"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "When your government stops blocking Jews with polish ancestory from obtaining polish citizenship, I'll stop calling them \"camps in Poland\"",
                                            "score": 2,
                                            "author": "Ionic_liquids"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you believe in God, no matter how you choose to define that belief, that’s, religion.",
                                    "score": 0,
                                    "author": "Embarrassed_Belt9379",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I did not say it wasn't. I said \"I am not religious\". Meaning subscribing to the doctrines, rules or viewpoints of one particular religion or another.",
                                            "score": 1,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My error. Is it the Christian god you believe in or one you’ve come up with yourself?",
                                                    "score": 1,
                                                    "author": "Embarrassed_Belt9379",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I think we are all trying to make sense of the same thing. The Christians, Jews, Muslims, Buddhists are all trying to describe the same force. There's a bunch of human bullshit that gets thrown in with the goodstuff...but yes, I'm describing my view of it and I, like all humans, am not immune to a little bullshit.",
                                                            "score": 1,
                                                            "author": "zwinters57",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That sounds like you are religious to me. You may not adhere to any of the organised religions but that’s definitely a religious belief you have.",
                                                                    "score": 1,
                                                                    "author": "Embarrassed_Belt9379"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well thought through  Ockham's razor suggests a simpler explanation.that you may not agree with.",
                                    "score": 1,
                                    "author": "Lower_Explanation6",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Occams Razor\" suggests that simple explanations are easier to verify than complex ones. This is quite obviously the case. It does not suggest that things can't have complex reasons for being. In the case of the origins of the universe, I would think, it has absolutely nothing to offer as the universe is quite obviously very complex and that the simplest reason for its existence doesn't exist. What would it be? \"It's very easy. The universe came into being by itself and from nothing\"...ok, we've gotten nowhere.",
                                            "score": 2,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The concept of a creator God doesn't add anything except an extra layer to explain. And there is zero objective evidence to support the extra layer, rather gross inconsistencies, such as the Holocaust, which is why it is called faith.",
                                                    "score": 5,
                                                    "author": "Lower_Explanation6"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Pretty philosophical turn for r/Jokes",
                                    "score": 1,
                                    "author": "how2446"
                                },
                                {
                                    "level": 3,
                                    "comment": "The camps were German, and happened to be in Poland, just a clarification there",
                                    "score": 1,
                                    "author": "jaquespop"
                                },
                                {
                                    "level": 3,
                                    "comment": "God is supposed to have had the ability to make the universe anyway he chose.  He chose to make it like this, knowing full well what some would do with the terrible situations he placed them in.  He knew babies would be raped, children would die of prolonged starvation and cancer, powerful people would torture and ruin the little people.\n\n#**HE KNEW**.  And he made it like this anyway.  \n\n***HE*** chose this.  \n\nIf God exists and is all-powerful, he is evil.  If he is not evil, as your strain of apologism wants to believe, then he cannot be all-powerful.",
                                    "score": 1,
                                    "author": "CeruleanRuin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No. You do not determine that there are only two answers. There may be possibilities you do not understand.",
                                            "score": 1,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Whatever helps you sleep at night pretending that the literal inventor of pain and hate is a good person.",
                                                    "score": 1,
                                                    "author": "CeruleanRuin"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Years (many years) ago I took a Philosophy of Religion class at college. There were quite a few students who were very religious in the class. The professor started out saying \"God is all powerful, right?\" Heads nod in agreement. \"All loving?\" Yes. \"All knowing?\" Again, yes.\n\n\"Then . . . why Auschwitz?\"\n\nSeveral students left the class in tears at that point.",
                                    "score": 1,
                                    "author": "eatyourdamndinner"
                                },
                                {
                                    "level": 3,
                                    "comment": "What is the use of this God if they won’t intervene to stop and punish horrible people. Either there is no God or it’s a completely useless God. There is no God and when we die, that’s it, no afterlife. \n\nMany of us have progressed so far ahead in morals and values that the so called holy books seem completely outdated and out of touch. More people are realizing it each day.",
                                    "score": 1,
                                    "author": "LifeIsARollerCoaster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If only life were so simple",
                                            "score": 1,
                                            "author": "zwinters57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "One of the turning point for me was seeing so many churchgoing people support trump, who is exactly the opposite of Jesus. I realized I was brainwashed my whole life by religion. People find weird ways to justify, supporting religious figures, and anyone supporting their religion no matter what crimes are committed.",
                                                    "score": 1,
                                                    "author": "LifeIsARollerCoaster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was kind of the opposite. Raised without much organized religion. I thought It was all bullshit. A lot of it is, but I was also throwing the baby out with the bathwater. There is a lot of ancient knowledge wrapped up in all religions. You can sort through the good stuff and toss the made up crap. It's silly to believe that thousands of years of knowledgeable people have nothing to offer us today though.",
                                                            "score": 1,
                                                            "author": "zwinters57",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If anyone made that argument, then they are wrong. Of course it does contain a lot of knowledge. But as you said you picked the good stuff. On whose authority are you allowed to toss the made up crap and who decides what is made up and what is not made up. \n\nFor a long time I thought as you did. But I was wrong. Everyone’s interpretation is different because they pick and choose what they like and ignore what they don’t like. \n\nIf some parent today says that they were taking their kid to the mountain to sacrifice in the name of god then that parent would be called insane and jailed. But it’s totally ok if Abraham did that. There are countless examples of very inappropriate and simply wrong behavior that we just ignore.  Millions of people around the world are cutting pieces of kids genitals off in the name of religion. Talk about insane behavior that is normalized. Either it is the word of God or it is not, you don’t get to pick and choose.",
                                                                    "score": 1,
                                                                    "author": "LifeIsARollerCoaster",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I do not believe the Bible, the Koran, the Torah or any other work is the direct word of God. I think they are all written by men, but I do think they contain some ancient wisdom and may be divinely inspired, at least in part. Since I believe in a direct relationship with \"god\", I get to choose what I want to follow. So, yes, I get to choose. I am not a member of any church or group. If I was I would follow their interpretation, otherwise why would I be a member? I don't think you understand how I think of it (why would you, you don't know me) so I don't think you can say, you thought as I thought. The reason you think people do circumcision, or cover their head, or don't eat pork, might not be what you think they are, so they might not be as \"insane\" as you believe them to be.",
                                                                            "score": 1,
                                                                            "author": "zwinters57",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "These divinely inspired texts certainly seem to have a lot of mistakes, praise for morally wrong behavior and made up crap. Why didn’t God correct it? \nMillions of people have killed others because they didn’t follow their version of religion. Did God strike them down? No. Even these texts contain praise for killing non believers. \n\nThere is no God. Ancient tribal leaders made up these stories to justify their evil deeds in the name of God. For too long too many have foolishly believed it.",
                                                                                    "score": 1,
                                                                                    "author": "LifeIsARollerCoaster",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not a religious person but how I understand it was according to the Old Testament the Jews were the chosen people of God.  There are many stories such as Exodus and the battle of Jericho where God acts to save and free the Jews.  To watch/witness things like the Russian pogroms and the Holocaust, many modern Jews would have lost their faith in their biblical teachings and become more secular and their Judaism becomes more about honoring their heritage (cultural link to their forefathers) than a religious act.\n\nOf course there are stories like Job where god is testing your faith - but to wipe out 6 million people including babies and kids to teach a lesson - who would want to follow that God?\n\nThe same can be said about slavery or any people that are murdered, can lose faith in their God.  The only historical difference would be the biblical covenant the Jews are said to have with God.",
                                    "score": 1,
                                    "author": "kmg18dfw"
                                },
                                {
                                    "level": 3,
                                    "comment": "We are repeating it again, now Jews are expelling and killing Palestinian out of their land with their beliefs that the land belongs to them, same as Nazi expelled them out (the Jews) out of Germany.",
                                    "score": 1,
                                    "author": "Efficient-Internet-6"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s actually more complicated than that — I wouldn’t say we believe in omnibenevolence, but we do believe that G-d is inherently good, and has a covenant to protect us in exchange for us following a ton of rules. But when talking in primarily Christian spaces it’s easier to refer to the Christian concept of omnibenevolence because it carried the same connotations, is equally broken by the problem of evil, and is more readily understood by my audience.",
                                    "score": 4,
                                    "author": "gbbmiler"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's the \"problem of evil\".",
                            "score": 2,
                            "author": "bufalo1973",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And one of the most compelling versions of it, given the level of horror involved.",
                                    "score": 3,
                                    "author": "gbbmiler"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you ever get a chance check out \"G-d on Trial\" it came out in 2008 and is based on a play. In it they hold a Rabinnical trial in the camps to determine if G-d has broken the Covenant. Really powerful film.\n\nYou can find it on YouTube if you can't get it another way.",
                            "score": 2,
                            "author": "Luke1521"
                        },
                        {
                            "level": 2,
                            "comment": "I'm a Jew and I agree.",
                            "score": 1,
                            "author": "patentmom"
                        },
                        {
                            "level": 2,
                            "comment": "An old Jewish lady I knew, an immigrant from Poland, said once that if there is a God, he has a lot of explaining to do.",
                            "score": 1,
                            "author": "Clunkyboots22"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "r/brandnewsentence right there",
                    "score": 22,
                    "author": "Free_Nebula_4158"
                },
                {
                    "level": 1,
                    "comment": "I heard it first from my Rabbi",
                    "score": 7,
                    "author": "hehehennig"
                },
                {
                    "level": 1,
                    "comment": "A Wonderful Life was a tasteful comedy about the holocaust.",
                    "score": 1,
                    "author": "Longshot1969"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds me of the  *supposed* writing on the wall in one of the camps that read ‟If there is a god，he'll have to beg for my forgiveness.”",
            "score": 730,
            "author": "sinteredCasino234",
            "replies": [
                {
                    "level": 1,
                    "comment": "All evidence suggests that it was indeed written on the wall of the Mauthausen camp.\nhttps://skeptics.stackexchange.com/questions/18913/did-a-jewish-prisoner-write-this-quote-about-god-and-forgiveness",
                    "score": 257,
                    "author": "PutinLovesDicks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ricky Gervais tells this to Jerry Seinfeld on Comedians in Cars Getting Coffee",
            "score": 60,
            "author": "HaZe905",
            "replies": [
                {
                    "level": 1,
                    "comment": "And Jerry's genuine reaction as the implication of that joke hits him is incredible.",
                    "score": 39,
                    "author": "which_tube_is_this"
                },
                {
                    "level": 1,
                    "comment": "I just watched it and didn't see the joke. Is there more than one episode?",
                    "score": 4,
                    "author": "OxycontinEyedJoe",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds me of alt.jokes.jewish on Usenet back in the 90s. (I think I have the name right) I subscribed to it because I was studying comedy. What I found was that most Jewish humor was a survival mechanism to get them through things like the Holocaust, and pogroms that murdered so many. Almost gallows humor.",
            "score": 49,
            "author": "Swiggy1957",
            "replies": [
                {
                    "level": 1,
                    "comment": "Humor and intelligence go together. That's why you don't find many fascist comedians.",
                    "score": 52,
                    "author": "JimmyHavok",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes they’ve resorted to racist ventriloquism, the lowest form of both comedy and racism",
                            "score": 24,
                            "author": "MacSanchez"
                        },
                        {
                            "level": 2,
                            "comment": "Oh, they're out there. They're not funny, but they are out there.",
                            "score": 5,
                            "author": "Swiggy1957"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God replies its not funny after you hear it 6  million times",
            "score": 191,
            "author": "coherentDrum452",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Well then, I guess you should have listened the first time\"",
                    "score": 87,
                    "author": "annapazha"
                },
                {
                    "level": 1,
                    "comment": "Jew replies: I assumed, not all of you have heard that one",
                    "score": 50,
                    "author": "jasiekbielecki"
                },
                {
                    "level": 1,
                    "comment": "r/DarkGod",
                    "score": 3,
                    "author": "RecalcitrantHuman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Banned",
                            "score": 2,
                            "author": "EdandRita"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The classic repost of the top comment from the last repost. I know because I’ve done it as well.",
                    "score": 2,
                    "author": "Klaus0225"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bro, I literally just watched Schindler's list, and this is the first post I see. Hooooooly",
            "score": 11,
            "author": "Rohit59370",
            "replies": [
                {
                    "level": 1,
                    "comment": "I recommend the director’s cut with laugh track.  It’s way to confusing when to laugh without it, no wonder you go to to r/jokes right after where it’s all predictable, as a repost.",
                    "score": 1,
                    "author": "FillThisEmptyCup"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This reminds me of something etched into the wall of a concentration camp:\n\n\"If there is a God, he will have to beg for my forgiveness\"",
            "score": 9,
            "author": "Optimal_Hunter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did Hitler write it?\nI mean Jesus was Jew, right?",
                    "score": 1,
                    "author": "whyamihere999"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“How’d you sleep?”\n“Like God through the Holocaust”",
            "score": 8,
            "author": "PhummyLW"
        },
        {
            "level": 0,
            "comment": "I first heard this one from David Baddiel (British Jewish comedian)...I guess this is the only intelligent holocaust joke out there",
            "score": 87,
            "author": "SP1570",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's a great twitter thread with Ricky Gervais after he tells it to Seinfeld. I think the conclusion is no one knows the original composer but it's credited as a brilliant joke and profound statement at the same time.",
                    "score": 59,
                    "author": "BigBird2378",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Viktor Frankl grapples brilliantly with the profundity in “Man’s Search for Meaning”.   There is a reason that book has been translated in to so many languages and reprinted millions of times.",
                            "score": 24,
                            "author": "RutCry"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's also Jimmy Carr's famous joke, \"They say there's safety in numbers, tell that to 6 million Jews\".",
                    "score": 5,
                    "author": "Mackem101"
                },
                {
                    "level": 1,
                    "comment": "&gt;..I guess this is the only intelligent holocaust joke out there\n\n[Hardly......](https://www.reddit.com/r/Jokes/comments/8l9m0n/my_grandfather_died_in_auschwitz/)",
                    "score": 2,
                    "author": "greentshirtman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a Jew I consider this to be the supreme, ultimate joke. There is no better joke that has ever been written.",
            "score": 21,
            "author": "cyrilhent"
        },
        {
            "level": 0,
            "comment": "Last Marc Maron special he has a bit about how tragedy produces comedy to cope and  there is a joke book from Auschwitz, but nope of the publishers know how to publish it.",
            "score": 7,
            "author": "alexefi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Uh....wow.",
                    "score": 1,
                    "author": "kain459"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Personally I'm pretty sensitive when it comes to Holocaust jokes.  My great grandfather died at Auschwitz.\n\n-\n\nThe railing on that watchtower was entirely too loose.",
            "score": 82,
            "author": "TooShiftyForYou",
            "replies": [
                {
                    "level": 1,
                    "comment": "I sympathize with that. My great grandfather died there too.   \n\n\nSome idiot fell off a watchtower and crushed him to death.",
                    "score": 52,
                    "author": "OctopusAlien21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My uncle died at Auschwitz.\n\nGot food poisoning from the Krakow McDonalds he had the day before he visited it. Still got the selfies he took.",
                            "score": 19,
                            "author": "Abides1948"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yikes. I did Nazi that coming.",
                    "score": 5,
                    "author": "HoodooSquad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "LDH worked with a Jewish man who called a HUGE cow finishing lot in Highway 5 in California 'Cowschwitz'.  He laughed himself to tears when telling me, but did make sure to tell me out of earshot of our kids.",
            "score": 5,
            "author": "Minflick"
        },
        {
            "level": 0,
            "comment": "Wenn es einen Gott gibt muß er mich um Verzeihung bitten.",
            "score": 3,
            "author": "proteo73",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mach Dir keinen Kopf. Es gibt weder Gott noch freien Willen. Alles nur Hirngespinste, die den Menschen ein schlechtes Gewissen einreden sollen. Hat ja auch lange genug funktioniert, die Menschheit damit zu knechten.",
                    "score": 3,
                    "author": "HairyTales",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Don't worry. There is neither God nor free will. All just pipe dreams designed to give people a guilty conscience. It has worked long enough to rule humanity with it.\"",
                            "score": 3,
                            "author": "carmium"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I heard it a little different:\n\nA holocaust survivor dies and goes to heaven. As he’s approaching god, he looks at his tattoo from the camps and notices it looks like a partial phone number. He chuckles and when god asks him what he’s laughing at he says, “You think she’ll give me the rest of her number if I ask her again?” pointing to his tattoo.\n\nGod says, “I don’t get it.”\n\nThe man says, “I guess you had to be there.”",
            "score": 4,
            "author": "p_larrychen"
        },
        {
            "level": 0,
            "comment": "Q:  Why was the black Jew angry? \n\nA:  The Nazis made him stand in the back of the gas chamber.",
            "score": 19,
            "author": "texaschair"
        },
        {
            "level": 0,
            "comment": "There are elements to the presentation of this joke that are exquisite. Either by design or subconsciously, it's comedy gold. The header with \"spoiler?\" Lol, what? Also the reference to god as \"the God.\" Thank you for this.",
            "score": 2,
            "author": "MusicPerfect6176",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is all just a coincidence",
                    "score": 2,
                    "author": "jasiekbielecki"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Comedians.\nThey can make jokes about whites.\nThey can make jokes about blacks and hispanics, even asians.\n\nBut you just cant make jokes about jews. They own the theater.",
            "score": 2,
            "author": "Additional-Fomo279"
        },
        {
            "level": 0,
            "comment": "I am in the holocaust museum in Washington DC right now and read this out loud 🥸🥸🥸",
            "score": 3,
            "author": "GuavaIceTTV"
        },
        {
            "level": 0,
            "comment": "&gt; it’s an old, stolen joke\n\nWe know.",
            "score": 3,
            "author": "Klaus0225"
        },
        {
            "level": 0,
            "comment": "I think the point is that god abandoned the Jews. The old Jew is properly taking god to task for it.",
            "score": 3,
            "author": "civex"
        },
        {
            "level": 0,
            "comment": "Ricky Gervais tells this joke to Jerry Seinfeld on an episode of Comedians in Cars\n\nEdit: I don’t know why I’m being downvoted for giving a fact lol",
            "score": 2,
            "author": "filmmaker30"
        },
        {
            "level": 0,
            "comment": "I heard the holocaust was payback for jesus.\nBut I am NOT religious, so I dgaf",
            "score": -5,
            "author": "mofoKevin"
        },
        {
            "level": 0,
            "comment": "Jews don't have or believe in heaven or hell. These were adopted by early Christians from Zoroasterism and other religions of the time.",
            "score": -38,
            "author": "mrbbrj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jews do believe in heaven, but not in hell as there is only God and no Satan in Judaism.",
                    "score": 28,
                    "author": "randomkid1227",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you ask a rabbi about an afterlife, (I did), he’ll say “I don’t know much about that.” My mother told me that was the usual answer. In other words, believe what you want.",
                            "score": 13,
                            "author": "baycommuter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Uh.. not sure which Rabbis your mother talks to, but jews one hundred percent believe in after life and heaven. We even say if you set up a couple that gets married you get a \"third of paradise\" (claiming 3 grants you entry, you can also reach it by fulfilling mitzvas making God happy).\n\nEither way, saying jews \"don't believe in heaven\" kinda erases the Adam and Eve part of the old testament.",
                                    "score": 20,
                                    "author": "randomkid1227",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Zero results for \"third of paradise\" relating to Judaism.](https://www.google.com/search?q=%22third+of+paradise%22+Judaism&amp;oq=%22third+of+paradise%22+Judaism+&amp;aqs=chrome..69i57j33i160l3.7633j0j4&amp;client=ms-android-tmus-us-sscr-revc&amp;sourceid=chrome-mobile&amp;ie=UTF-8)\n\nI'm Jewish and I've never heard any Jew declare that an afterlife in heaven exists as a fact. There is absolutely no consensus on such, and the most popular opinion is that we don't know.\n\n[Heaven in Judaism.](https://en.m.wikipedia.org/wiki/Heaven_in_Judaism). The text under the section \"Ambiguity of Jewish Afterlife\" says almost exactly what every rabbi I've ever heard says about the issue.\n\nIt's okay to believe in heaven as a Jew, obviously. But be careful making sweeping statements that imply your personal beliefs are in any way a consensus position when they are not actually.",
                                            "score": 5,
                                            "author": "DefaultSubSandwich",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am also Jewish. \n\nA lot of people misinterpret the fact that heaven is not spoken about as much in Judaism as opposed to Christianity or other beliefs as Jews not believing in an afterlife... Heaven does exist in Judaism,  regardless of afterlife, no question about that. We do believe the messiah will reincarnate us eventually, but your soul waits until then. While where it waits is debatable, most jews would agree that if you do your mitzvot you'll wait in heaven. \n\nConcensus? I am not there Jewish department of statistics but the majority of believing will surely agree. Chabad is one of the largest Jewish movements and then openly talk about afterlife in heaven. I can't sample \n\n&gt;making sweeping statements that imply your personal beliefs are in any way a consensus position when they are not actually.\n\nI am actually *very* secular. However I interact with religious Jews in Israel on a daily basis and never heard anyone claim otherwise, so I guess if you're going for a \"Gotcha! Old testament doesn't promise anyone heaven!\" Then sure I guess, but afterlife in heaven is surely discussed amongst religious Jews.",
                                                    "score": 1,
                                                    "author": "randomkid1227",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Of course it's discussed. The concept of afterlife is integral to Judaism, but that's different from the idea of claiming any definitive conception of what an afterlife might possibly entail. Even Chabad couches it very ambiguously:\n\n&gt;That being so, it’s clear why we don’t find much about heaven in Tanach: Because we've been looking in the wrong direction. **The real heaven is not what happens in a supernal realm after death. To discuss that would be a diversion and distraction from the real theme.** The real heaven is what happens down here as the fruit of our collective labor of millennia.\n\n[Link.](https://www.chabad.org/library/article_cdo/aid/4848230/jewish/Heaven-and-the-Afterlife.htm)\n\nEmphasis mine.\n\nI'm not trying to attack your personal faith. I'm simply noting that it's not a tenet of Judaism to believe in a paradise in the afterlife.",
                                                            "score": 2,
                                                            "author": "DefaultSubSandwich"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Also, remember there are different sects of Judaism. For instance, I was always taught that while there is belief in a Heaven, there is also a belief in something like reincarnation? But the latter might be more of a personal belief that happens to be held by a lot of people, I'm not sure. For instance, my mother, who has always been highly religious, had told me plenty when I was younger that jews believe in a Heaven, but not a Hell (at least most don't believe in a Hell. I think like the person above said seems to work, \"you believe what you believe\", since my fiancee can attest to being told about a hell before in yeshiva. *shrug*) but also, yes, we believe we come back.  (Not referring to messiah) .\n\nBut then again, when we were joking about her mother and brother, my mom said \"well they're both up there, annoying the shit out of each other, or hopefully staying far away from each other .\n\nBut the thing is, the usual answer you get in yeshiva and from rabbi is to not ask questions. I think it might have to do with the fact that if we don't believe in a Hell, only a Heaven, and if the belief of reincarnation is more personal than a religion-wide thing like I said, then *where the hell do all the bad people go*?? I never understood that. At least with reincarnation, I could assume that they're reincarnated and forced to be better in the next life/lives in order to be let into Heaven.",
                                            "score": 2,
                                            "author": "ansem990"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;jews one hundred percent believe in after life and heaven\n\nmost *religious* Jews\n\nmany Jews aren't religious (or were raised humanist like me)\n\nbut baycommuter is right, eschatology is not really part of mainstream judaism (you have to go over to rabbinic judaism for that) \n\n\nI would also argue that hard agnosticism (\"I don't know what comes next and neither do you\") is a common attitude, even among religiously practicing Jews\n\nheaven isn't well-sketched out or consistently envisioned \n\n\n&gt; you set up a couple that gets married you get a \"third of paradise\" (claiming 3 grants you entry, you can also reach it by fulfilling mitzvas\n\nah but you notice the tasks are meant to keep the focus on deeds done while alive on earth?",
                                            "score": 3,
                                            "author": "cyrilhent"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Jews don’t need a heaven or a hell as much as Christians. You’re either Jewish or you’re not, but Christians needed something to scare people with so they invented (or more likely stole) the concept of heaven and hell from other religions.",
                                    "score": 1,
                                    "author": "IsItSupposedToDoThat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s something I’ve always appreciated about Judaism. Heaven, when mentioned, has an open door policy, and there’s no eternal punishment. \n\nThe worst thing you get is a disappointed father figure. I’m already used to that!.",
                            "score": 2,
                            "author": "Swampwolf42"
                        },
                        {
                            "level": 2,
                            "comment": "So the book of Job?",
                            "score": 1,
                            "author": "moby__dick"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "r/woosh",
                    "score": 8,
                    "author": "smilingbuddhauk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love telling this joke.",
            "score": 1,
            "author": "onairmastering"
        },
        {
            "level": 0,
            "comment": "how did you do that thing with the no line breaks?",
            "score": 1,
            "author": "Im-Spreading-for-you",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure if I’m understanding it right, because I’m no native speaker. But if you mean  \nthis  \nwith „no line breaks“:\n\nYou have to put two spaces after the paragraph. It‘s a bit annoying on my phone, because it automatically adds a period after the sentence.",
                    "score": 2,
                    "author": "lukfi95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're correct  \nGoddamn",
                            "score": 1,
                            "author": "Im-Spreading-for-you"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ricky said this joke on comedians in cars getting coffee, he said it wasn't his but one of his favourites",
            "score": 1,
            "author": "george98788"
        },
        {
            "level": 0,
            "comment": "Didn’t Gervais tell this on Comedians in Cars Getting Coffee?",
            "score": 1,
            "author": "lawyerlyaffectations"
        },
        {
            "level": 0,
            "comment": "I heard Ricky Gervais tell that one",
            "score": 1,
            "author": "cmparkerson"
        },
        {
            "level": 0,
            "comment": "I don't get it",
            "score": 1,
            "author": "YingTang1"
        },
        {
            "level": 0,
            "comment": "The way I heard it the joke was \"you know how to get a girls number?\"......You look at her arm.\"",
            "score": 1,
            "author": "mr6fingers"
        },
        {
            "level": 0,
            "comment": "Arguably Eric Clapton's best song.",
            "score": 1,
            "author": "bjornborgcollective"
        },
        {
            "level": 0,
            "comment": "One of my favorite (old) jokes, but you have to tell it right.\n\nAfter a long life as a good person, the now-ethereal Holocaust survivor is in heaven seated at the right hand of God. He shares the deep secrets of the cosmos with her, asks her about her time on Earth. She starts telling a long involved humorous true story about a guard in the camp who was murderously cruel, tossing babies in the air and catching them on his bayonet, stomping on the hands of women who fainted after hours of standing at attention at roll call, etc. The punchline is when something awful he does causes him the most minor of inconveniences, like blood from the pregnant woman he's beating gets on his collar and he's chastised for it by his superior. God turns his magnificence upon her and says oh my child, that's not funny. She shrugs and says, guess you had to be there.",
            "score": 1,
            "author": "singularineet"
        },
        {
            "level": 0,
            "comment": "Your soul belongs to God.  But your ass belongs to me",
            "score": 1,
            "author": "GU2CU"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sory, I am not the best at good versioning",
                    "score": 1,
                    "author": "jasiekbielecki",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sorry my comment was kinda mean. But yeah this joke kinda gets put here often, so if you hear a joke somewhere try searching up the punchline on reddit first then if there’s no results post it",
                            "score": 1,
                            "author": "Professional-Pay-888",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks, will do in the future",
                                    "score": 1,
                                    "author": "jasiekbielecki"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do people keep using this spoiler shit? There's no need.",
            "score": 1,
            "author": "OnceWereCunce"
        },
        {
            "level": 0,
            "comment": "You could make this joke about a child getting raped also.",
            "score": 1,
            "author": "satmandave",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am not sure if offensive will be the right word in such context. Can u try?",
                    "score": 1,
                    "author": "jasiekbielecki"
                }
            ]
        },
        {
            "level": 0,
            "comment": "God bless Ricky Gervais.",
            "score": 1,
            "author": "obad-hi"
        },
        {
            "level": 0,
            "comment": "This is an old joke? The way God was offended, I thought this was right from 2023.",
            "score": 1,
            "author": "cwschultz"
        },
        {
            "level": 0,
            "comment": "Thank god for the spoiler alert! I avoided reading this joke so I will be surprised when I see a Jew in heaven!",
            "score": -2,
            "author": "jet_heller",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t see why a Jew couldn’t go to heaven, but would he really want to? I mean what with all the Christians there.",
                    "score": 3,
                    "author": "moby__dick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't see why this was a spoiler.",
                            "score": 1,
                            "author": "jet_heller"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blaming God and forgetting Free Will",
            "score": -16,
            "author": "Professional-Age333",
            "replies": []
        }
    ]
}