{
    "id": "140bdb2",
    "score": 40,
    "title": "Poor Sarah",
    "author": "Past-Ad-8822",
    "date": 1685881145.0,
    "url": "https://www.reddit.com/r/jokes/comments/140bdb2",
    "media_urls": [],
    "other_urls": [],
    "postText": "There are 365 bricks on a plane, one falls off how many are left?\n\n\n\n\n364\n\n\n\nHow do you put an Elephant in a fridge?\n\n\n\nOpen the door\nPut the Elephant in\nClose it\n\n\n\nHow do you put a giraffe in a fridge?\n\n\n\nOpen the door\nTake the Elephant out\nPut the giraffe in\nClose the door\n\n\n\n\nThe lion King is having a birthday party, all the animals show up except one, which one?\n\n\n\nThe giraffe because its in the fridge.\n\n\n\n\n\nSarah is trying to cross a river home to deadly alligators, there isn't a bridge but she is able to swim across, how?\n\n\n\nThe alligators are at the birthday party\n\n\n\n\n\nSarah still dies, how?\n\n\n\nThe brick falls on her head.\n\n\n\n(There's like a million diffrent people that claim this is there joke, I dont know who or where it came from)",
    "comments": [
        {
            "level": 0,
            "comment": "This joke is so old Tarzan was having the party when i first heard it, before the lion king was released.",
            "score": 14,
            "author": "KarmicComic12334",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know Jane was actually Tarzan's second partner.\n\nHe divorced his first partner because he was Cheetah.",
                    "score": 13,
                    "author": "leonscum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well that settles it... Tarzan isn't from New Zealand or she would have been a sheep",
                            "score": 2,
                            "author": "always-paranoid"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If there are 500 hundred  bricks and one falls off, then there are 49,999 left.",
            "score": 4,
            "author": "itimikk"
        },
        {
            "level": 0,
            "comment": "Q: There are 500 bricks on a plane.One falls off.How many are left?  \nA: 499\n\nQ: What are the three steps to putting an elephant in the fridge?  \nA: Open door, put elephant in, close door.\n\nQ: What are the 4 steps to putting a giraffe in the fridge?  \nA: Open door, take elephant out, put giraffe in, close door..\n\nQ: The Lion King is having a birthday party.All the animals attend but one.Which animal is it, and why?  \nA: Giraffe.He is stuck in a fridge.\n\nQ: Sally wants to cross an alligator infested river.There’s no bridge and the only way she can get across is by swimming.She swims across and makes it to the other side safely.Why?  \nA: The alligators are all  at a birthday party.\n\nQ: Sally dies anyways.Why?  \nA: She got hit in the head by a flying brick.",
            "score": 3,
            "author": "ubtcw",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the same joke",
                    "score": 2,
                    "author": "booshtukka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The same joke is always in the comments?",
                            "score": 2,
                            "author": "IDontRentPigs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why?",
                                    "score": 0,
                                    "author": "booshtukka"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}