{
    "id": "14yl6t",
    "score": 7,
    "title": "I just got accepted, but family concerns about safety have me plagued with second thoughts...help?",
    "author": "TartandTiny",
    "date": 1355696345.0,
    "url": "https://www.reddit.com/r/CSUDH/comments/14yl6t",
    "media_urls": [],
    "other_urls": [],
    "postText": "As stated in the title, I was recently accepted as a transfer to CSUDH (Behavioral Science), and I can live with my grandmother in nearby Wilmington so it seems like a good option for school to me. However, some  of my family and friends are worried about it being \"so close to Compton\" and it not being safe. I had planned to take the city bus to school instead of driving to save gas, but my boyfriend says it will be too dangerous. I've lived in San Francisco, Paris - France, and Chicago, I think I can handle it. \n\n* So it safe? \n* What are some safety tips? \n* How do I handle these folks who don't think this is a good choice for me? \n* Any thoughts on taking the bus to school (which route)? \n* What about the Behavioral Science major? Good/Bad?\n\n**Edit: Thanks for the feeback. 1 more question - Where do you live if you go to school at CSUDH, and do you drive to school?**",
    "comments": [
        {
            "level": 0,
            "comment": "It's not as bad as people make it seem. I transferred to CSUDH from CSUF a few semesters back and was worried about the same, but it's a nice campus. There are always a lot of students around and I doubt you would even FEEL like you're in danger. And I live in Wilmington too lol. So school is close. ",
            "score": 5,
            "author": "jewdo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey thanks for replying. Do you drive to school or take the bus? or carpool? What did you major in and why did you transfer? ",
                    "score": 2,
                    "author": "TartandTiny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I drive and i'm going to graduate in the Spring with a Liberal Studies degree (Elementary School teaching). I transferred cause the apartment complex i was living in got bought out and i couldnt find another apartment in time (this was in August).",
                            "score": 2,
                            "author": "jewdo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahh, are you going to continue to work on your credential there?",
                                    "score": 3,
                                    "author": "TartandTiny",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think so. I know some people in the program and they have had a good experience with the it. But I'm not ruling out other places.",
                                            "score": 3,
                                            "author": "jewdo"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The school isn't as bad as everyone makes it to be. I was a transfer student and my parents were worried because of the same reason as your family. All you have to say is that it's your education, and you can even show them this thread as proof. The school is nice and calm, other campuses have had shootings, and look UCLA was claimed about a month ago to be one of the most dangerous schools ever and it's UCLA! everyone knows the \"prestige\" that UCLA holds, yet that news was released. CSUDH is safe and people are always on campus, it's friendly, police station is on campus, along with police emergency call button stations. Also, the home depot center is right next to the campus, like literally 5 min away from each other by foot, and its home to many large sports, I don't think that if it wasn't safe there, they would have built the stadium there, and would not have the large crowds they do at those events held there. Why not have your family visit the campus for themselves? and as for transit, you should look into the toro express, I never used it as I drove to campus, but have heard good things about this bus line as it is the schools own line. Also as for the behavioral science dept, I was a psychology major (just graduated may 2012), and for the 2 years I was there, the department leaders were helpful. The political science department was also awesome and so was the sociology dept. Came back for grad school and its just as awesome as ever, and safe! Hope this helps!  ",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have plenty of family nearby in case. I'll check out toro express, thank you for the info.",
                    "score": 1,
                    "author": "TartandTiny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have nothing to be worried about.",
            "score": 3,
            "author": "sick_transit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. ",
                    "score": 1,
                    "author": "TartandTiny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd be more concerned about living in Wilmington than going to school in Carson.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why? Is it bad there? How is it worse than Carson? I live up north so I really have no point of reference how dangerous different areas of LA are.\n",
                    "score": 1,
                    "author": "TartandTiny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wilmington is a bit \"rougher\" than the university area that surrounds CSUDH.\n\nIf your grandmother can survive in Wilmington I think you'll be ok. Stop worrying and enjoy yourself. You'll be fine.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. ",
                                    "score": 1,
                                    "author": "TartandTiny"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I attend night classes almost exclusively, and I've never felt like ti wasn't safe. Sure, some people's cars have been broken into, and I believe people have been robbed, but I've never seen anything the slightest bit shady. The campus is fairly well lit, the campus police station is right on campus, and there are usually crowds of people around especially near the student union and bar on campus.\n\n",
            "score": 2,
            "author": "Keitaro_Urashima",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would hope that nothing bad would happen but bad things happen everywhere, I'm glad to know campus security is on top of things.",
                    "score": 1,
                    "author": "TartandTiny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If its any consolation, I'd fear USC's campus more than CSUDH's.",
                            "score": 3,
                            "author": "Keitaro_Urashima"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived in the dorms there and had a good time if that's out of the question I would live as close to the beach as possible. Public transportation is the way to go. ",
            "score": 1,
            "author": "eddybaboy"
        }
    ]
}