{
    "id": "9y3ryy",
    "score": 2,
    "title": "Question for math majors",
    "author": "BrilliantBeautiful",
    "date": 1542521294.0,
    "url": "https://www.reddit.com/r/CSUDH/comments/9y3ryy",
    "media_urls": [],
    "other_urls": [],
    "postText": "As a math major do you guys have the academic support from your teacher and tutoring services for upper level math?\n\nI am planning from transferring from my cal state to CSUDH.",
    "comments": [
        {
            "level": 0,
            "comment": "The TLC or Toro Learning Center provides free tutoring services to all students for many different subjects, I believe they do provide upper division math tutoring but there might only be a few that tutor",
            "score": 1,
            "author": "_kilobomb"
        },
        {
            "level": 0,
            "comment": "Yeah i can guarantee your math professors will love to help you on any issues. the school is so small that they really can have alot of one on one time. plus there is the math club where you can always ask others. Im a biology major but i had to take my fair share of math and meet with the math department. they are all nice. \n\nalso the Toro learning center really does help. People from the math club usually are the tutors for math there. the tutors are students who are knowledgeable in the subject and are usually in the upper division classes already. But if you really are on the fence about it, email a math advisor or professor. They will help you.",
            "score": 1,
            "author": "lucero100CE"
        },
        {
            "level": 0,
            "comment": "since there are few  upper level tutors .. are they actually knowledgeable about their math stuff?\n\nAt the university I am at most of the upper level tutors be looking answers online",
            "score": 1,
            "author": "BrilliantBeautiful",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, they're pretty knowledgeable. I've taken my last math classes for my whole college year (although I'm not a math major), and have gone to tutoring multiple times. They are quite helpful and the questions they make are rarely from online, some I believe make the math books themselves, and even the SIs that come along can provide assistance. I've had a couple friends come from other CSUs to here personally for math and science.",
                    "score": 1,
                    "author": "TCAT4LYST",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "are there math si's for upper level math besides calculus?",
                            "score": 1,
                            "author": "BrilliantBeautiful",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, there should be as long as those SIs have wanted to go to that class themselves or assigned to based on their own level of math I believe.",
                                    "score": 1,
                                    "author": "TCAT4LYST",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "oh okay. What do you think of the school? Is it a good school to transfer too?",
                                            "score": 1,
                                            "author": "BrilliantBeautiful",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For math, just speaking from my experience, it's very well in teaching you on how to do equations, solve the problems, etc. I've done Statistics for the most part, and I've actually failed it back in high school whereas in CSUDH, I actually passed out. Personally, it's quite full of opportunities for whatever major you're in. Consider CSUDH like a stool as well as someone to hold your hand to guide you through confusion. There's a whole new Math/Science building being constructed by the way, so more power to your major. Anyway, my plan is to stick with CSUDH for all years or transfer out after two more if my major isn't being helped out any more in the long run.",
                                                    "score": 1,
                                                    "author": "TCAT4LYST"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}