{
    "id": "fssxkn",
    "score": 4,
    "title": "Business Analytics at CSUDH",
    "author": "Blackbeard_BJJ",
    "date": 1585716594.0,
    "url": "https://www.reddit.com/r/CSUDH/comments/fssxkn",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am transferring in the fall with a declared major of Business analytics. I currently work in an entry level accounting position (billing coordinator) and am going to school in the evenings. \n\nDoes anyone have any feedback on this program? How were the professors/courses? I like math overall, and already took an Intro to Computer Science class taught in Python at my community college. \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for taking the time to answer my question thoroughly and thoughtfully! I am sad to hear about business programming being taught in visual basic! \n\nIf you don’t mind, do you regret choosing Analytics over econ at all? The reason I ask is because I also got into CSUN for Econ (as well as CSULB and CSUF for accounting). Based on those options and what you already know about the program, do you think CSUDH is as good of an option as those choices?",
                    "score": 1,
                    "author": "Blackbeard_BJJ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you again!! \n\nBased on everything you said, I am planning on continuing with my plan to attend CSUDH and major in Business Analytics. I hope your answers can help out other future students with similar questions to mine. \n\nHave a good one!!",
                                    "score": 2,
                                    "author": "Blackbeard_BJJ"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Last I heard the business program at DH isn't accredited. You should probably look into that (it was the same for their human service program)",
            "score": 1,
            "author": "darnitimmad",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know they are not aacsb accredited but from what I have seen that doesn’t seem to matter. My current company has hired people from CSUDH for accounting (the department I currently work in) I don’t think anyone really cares. But that is a good tip for those potentially looking at an academic career!",
                    "score": 1,
                    "author": "Blackbeard_BJJ"
                }
            ]
        }
    ]
}