{
    "id": "bekg5c",
    "score": 3,
    "title": "masters in material science ( stupid questions )",
    "author": "akula_Jager",
    "date": 1555587147.0,
    "url": "https://www.reddit.com/r/chalmers/comments/bekg5c",
    "media_urls": [],
    "other_urls": [],
    "postText": "So i got admission in msc material science.\n\ncurrently i am wondering whats the situation regarding projects is like.\n\n1. what are chances of securing funding and or scholarship after you join?\n2. university Hours (i tend to work and study in labs a lot)(my last university had 24 hrs schedule for labs and library)?\n3. anyone here can tell whats are the major thrust areas being researched this year?\n4. i am an international student (from pakistan) , i can speak English well enough (thinking of learning swedish) , what are the chances of getting a part time job at Chalmers or anywhere else to lessen the financial burden?\n5. and finally i intend to do a phd as well, does Chalmers have a direct msc to phd program i.e am i eligible for phd programs automatically after my msc or do i have to go through selection process etc?\n\nany info on this program or my questions would be helpful.",
    "comments": [
        {
            "level": 0,
            "comment": "Native Chalmers student here. I am currently on my last semester on Msc Materials Engineering (not the same as Materials Science). \n\n1. I don't know, never passed my mind since I get swedish student funding and loan.\n\n2. Most study places has 24h access. The library is only open on daytime(extended office hours). Classes will almost only be scheduled on office hours (08-17). There might be one time lab class on evening or similar.\n\n3. You can read about Chalmers' areas of advance on the website. But as a master's student you will not get directly involved in any research.\n\n4. Getting a job at Chalmers is quite difficult I think. PhD students do most of the research assistance and simpler teaching. For getting a low level job in Gothenburg, such as bike food delivery, usually the language is not a problem.\n\n5. As far as I know there is no direct program. You will have to go through a selection process. Although if you become friends with the professors during your master's you have a greater chance of getting selected.",
            "score": 2,
            "author": "emibor",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the info . i appreciate you taking time to answer.\n\ni am a bit disappointed for the phd direct admission but hey that just means i have to bring my A game.  \n\nwhat do you mean as a masters student we wont be directly involved in research. how do you do your masters thesis then?(a bit confused might be different system over there)",
                    "score": 2,
                    "author": "akula_Jager",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The master's thesis is only the last semester. Many students, including me, does their thesis on a company and it doesn't necessarily have to be connected to the research at University. But you can of course do a thesis for a department at Chalmers.",
                            "score": 2,
                            "author": "emibor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ok thanks . answers are much appreciated .",
                                    "score": 2,
                                    "author": "akula_Jager"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}