{
    "id": "mqvzg7",
    "score": 4,
    "title": "I’l be moving to Gothenburg this fall(mid-August) and I was wondering about doing a part-time job. Any suggestions?",
    "author": "The_Dark_Lord007",
    "date": 1618422720.0,
    "url": "https://www.reddit.com/r/chalmers/comments/mqvzg7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Yes, i know its been asked multiple times.\nYes, i know its not advisable cause it messes up with your academics and the pay isn’t enough to cover the expenses.\nI want to be practical about this and work for around 10-15 hrs/week which i feel is manageable. Maybe as a receptionist or  do deliveries or any job.\nI’m learning swedish (i’m a non-EU international student, extremely proficient in English)\n\nMy whole logic is, even if i earn 1k bucks, i can spend that on myself- maybe on food, maybe on drinks, maybe get a book from a library or something.\nThe point being, i am more than willing to put 2hrs a day or maybe 4/5 hrs in a weekend and earn some extra bucks.\n\nI think it is quite manageable and I would really appreciate if someone could help me by shedding some light as to where do i search for openings?\nHow do i find 10-15hrs/week ish jobs in Gothenburg?",
    "comments": [
        {
            "level": 0,
            "comment": "More importantly, if you work at all, you qualify for CSN low-interest student loans.",
            "score": 3,
            "author": "MastersInSverige"
        },
        {
            "level": 0,
            "comment": "Best bet, a pub. Worst bet (but still ok), food delivery like foodora etc",
            "score": 1,
            "author": "Tamazin_"
        },
        {
            "level": 0,
            "comment": "A lot of my classmates at Chalmers worked part-time at Volvo, but I'm not sure how that would work since you're a non-EU student. Worth looking into though! \n\nOtherwise I'd say getting a job at a bar would be a good option. Foodora is also an option...but they don't treat you well and you're out delivering food in the rain/wind/cold on your own bike and time.",
            "score": 1,
            "author": "emilk10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey!\nThanks a lot for the reply mate.\nAny idea about the locality/place where bars usually hire students for part-time?\nAgain, thanks for the info",
                    "score": 1,
                    "author": "The_Dark_Lord007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem, glad I can help! I'm not 100% sure but Andra Långgatan and the surrounding area is full of bars and they'd be more likely to hire you than the bars on Avenyn (more expensive and fancy). You can also try to find something part-time at a café since there are so many in Gothenburg! Bars and cafés will like your proficiency in English.",
                            "score": 1,
                            "author": "emilk10"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey guys! If anyone is interested in AI, with or without any knowledge or experience in the subject, I really recommend this super interesting article by \"Software 2.0\" (meaning AI).  \nIt gave me a great insight on how it developed, how it can be applied and how it might develop in the future! Might give you a competitive edge if you're doing or studying something like this at Chalmers...;)  \nhttps://pub.towardsai.net/software-2-0-b52131f65b68",
            "score": 1,
            "author": "adamhedin"
        },
        {
            "level": 0,
            "comment": "Hey guys! If anyone is interested in AI, with or without any knowledge or experience in the subject, I really recommend this super interesting article by \"Software 2.0\" (meaning AI).  \nIt gave me a great insight on how it developed, how it can be applied and how it might develop in the future! Might give you a competitive edge if you're doing or studying something like this at Chalmers...;)  \nhttps://pub.towardsai.net/software-2-0-b52131f65b68",
            "score": 1,
            "author": "adamhedin"
        }
    ]
}