{
    "id": "mujt2a",
    "score": 2,
    "title": "Laptops for Chalmers studies",
    "author": "Drogge3416",
    "date": 1618897829.0,
    "url": "https://www.reddit.com/r/chalmers/comments/mujt2a",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm planning on applying for Chalmers in a couple of years, but I'm wonder about which computer i should get for my studies?\n\nDo you need a beefier laptop to run some of the specialized programs for the courses, or are there computers on hand at campus for the heavy lifting?",
    "comments": [
        {
            "level": 0,
            "comment": "If it's in a couple of years there's absolutely no reason to think about it now.\n\nIf we instead pretend you'll start this fall:\nIt absolutely doesn't matter. I have finished my Bachelors on the computer science track with a laptop from 2013 that was meh when it came out. Most things are done in the browser anyways. \n\nThere's hardly any heavy lifting to be done, but when there is there are hundreds of really beefy computers around campus you can use",
            "score": 12,
            "author": "The_OptiGE",
            "replies": [
                {
                    "level": 1,
                    "comment": "^ this. Just whatever laptop that works is fine. For both computer bachelor and software engineering master atleast.",
                    "score": 3,
                    "author": "Tamazin_"
                },
                {
                    "level": 1,
                    "comment": "This info was exactly what I was looking for! Thank you!",
                    "score": 2,
                    "author": "Drogge3416"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This idea that you need a super computer for university is mostly made up by the people who profit from selling you those computers. Many students I know are doing totally fine with old laptops. It's not like an expensive computer will actually do anything to help you get through this, that's a thought error.\n\nSure, it's fun to have a nice computer, but new fancy ones are expensive and you've got plenty other things to do with your money. But basically any laptop from the last several years is really really good.\n\nThere are computers on campus and you can also remote into them to use the software. I'm running a mac and linux and just remote access for some windows programs and specialized programs that have expensive licenses.\n\nThe only time I've done actually any heavy processing on a computer of my own was in a course about deep neural networks, but even then I could easily have offloaded that to another computer/cloud if I had wanted. But that was with a \\~5 year old thinkpad and it did great.",
            "score": 4,
            "author": "always_wear_pyjamas"
        },
        {
            "level": 0,
            "comment": "I have gotten trough my five years with a Mac. There are plenty of accessible computer labs, and I don’t think we even get access to the most expensive software on our own computers. I also think that the professors are not allowed to force you to use your own computer, since it’s not a requirement for the education. \n\nI mostly use my own computer for browser based things nowadays, and at least for now you can access all computer labs remote too.",
            "score": 2,
            "author": "utterbutternutter"
        },
        {
            "level": 0,
            "comment": "I have a laptop. I did not use it for a single course at chalmers. The computer labs are open 24/7 and have everything you will ever need installed. Everything is saved in their system and you don't have to worry about your computer breaking.",
            "score": 1,
            "author": "timonix"
        },
        {
            "level": 0,
            "comment": "It's also possible to remote into computers at chalmers (both windows and linux) from home.",
            "score": 1,
            "author": "Gurxtav"
        }
    ]
}