{
    "id": "wfvaxr",
    "score": 1,
    "title": "Kan jag söka bostad på Chalmers Studentbostäder åt en vän?",
    "author": "Ok-Feeling2057",
    "date": 1659599910.0,
    "url": "https://www.reddit.com/r/chalmers/comments/wfvaxr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Har en vän som kommit in på GU som kommer från en annan stad och som är i desperat behov av bostad. Själv har jag drygt 8-års ködagar på Chalmers studentbostäder som jag aldrig kommer använda.\n\nHar någon annan gjort på liknande sätt? Är det tillåtet? Kan man göra det ändå (lite sneaky) på något sätt?",
    "comments": [
        {
            "level": 0,
            "comment": "Bara tillåtet om ni båda är studenter på GU eller Chalmers och du har en bra anledning att hyra ut i andra hand (max 12 månader och du måste ansöka minst en månad innan). Bra anledning är tex studera utomlands. En lite mer sneaky anledning skulle kunna vara \"trial relationship\" antar jag då det känns svårare att bevisa.\n\nMer info: \n\n[Link](https://www.chalmersstudentbostader.se/en/bo-hos-oss/andrahandsuthyrning-och-medboende/)\n\nLänkar på engelska då länken till ansökningsblanketten verkade vara trasig på svenska.",
            "score": 2,
            "author": "Ap0ptosis"
        },
        {
            "level": 0,
            "comment": "Bor du redan i en hyresrätt så är det tyvärr inte tillåtet enligt hyreslagen. Straff varierar, men du blir garanterat vräkt från en av lägenheterna och du kan få böter/fängelse vid grova överträdelser.",
            "score": 1,
            "author": "gloroa"
        },
        {
            "level": 0,
            "comment": "Du får inte om dom inte pluggar under tiden men det är garanterat väldigt enkelt att göra det ändå och skita i om du får eller inte, hade jag nog gjort.",
            "score": 1,
            "author": "GrimGrimGrimGrim"
        }
    ]
}