{
    "id": "10re8ig",
    "score": 2,
    "title": "Question about school year",
    "author": "Head_Web_417",
    "date": 1675305239.0,
    "url": "https://www.reddit.com/r/Kettering/comments/10re8ig",
    "media_urls": [],
    "other_urls": [],
    "postText": "Prospective student here, is it possible to skip your first co-op term to save it for later. Such that I would be done with 1 year of academics in six months?",
    "comments": [
        {
            "level": 0,
            "comment": "It is something that is available to you, but most do not recommend because you will be with a different section and have to go through making new relationships/friendships a whole second time.  You will not see anyone you meet in your first term for the majority of your school career.",
            "score": 12,
            "author": "tbabyftw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Trust me, as someone who switched sections just for a term, not worth it. Really glad to be back in my section",
                    "score": 2,
                    "author": "External_Object_6064"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You don’t HAVE to work every co-op term. Many people don’t work their first and don’t “make it up” either bc they don’t want to or didn’t get a job. You only have to work 5 minimum to graduate. However you should work as many as you can beyond the first",
            "score": 9,
            "author": "MemeMasterColon"
        },
        {
            "level": 0,
            "comment": "Correct, I did that as a B-Section freshman.",
            "score": 2,
            "author": "ku-custodialservices"
        },
        {
            "level": 0,
            "comment": "So you might be able to get away with that for your first 2 terms, but I don't see the reason why you would do that.",
            "score": 1,
            "author": "Chumeth"
        },
        {
            "level": 0,
            "comment": "Yes, it is possible.  But, only recommended if you are highly motivated and more of an individualist.",
            "score": 1,
            "author": "KU_Clown"
        },
        {
            "level": 0,
            "comment": "What’s behind your goal to get through a year of academics in six months?",
            "score": 1,
            "author": "SignalCheck511",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm an international student and for my application to be able to work in the U.S. takes about 6 months (applying in May), so I don't want to just sit around and waste time during that co-op term.",
                    "score": 2,
                    "author": "Head_Web_417",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "International students have definitely done it. DM me if you need any support or anything!",
                            "score": 1,
                            "author": "SignalCheck511"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you have a good reason, switching up your rotations is pretty easy. You can do any amount of school terms in a row and up to 2 co-op terms in a row employed or otherwise. I did 3 terms in a row when I was a freshman. I also recently finished back to back co-ops.",
            "score": 1,
            "author": "TheTunaTimes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does this mean that from those 3 academic terms you technically completed 1.5 years at a \"normal\" college (45 credit hours)?",
                    "score": 1,
                    "author": "Head_Web_417",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty much. 17, 16, 20 credit terms. Total time to complete my degree with 5 co-op terms and a thesis term will be 3.25 years.",
                            "score": 1,
                            "author": "TheTunaTimes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did that, would reccomend",
            "score": 0,
            "author": "jackthecat53"
        }
    ]
}