{
    "id": "10rntop",
    "score": 6,
    "title": "A question for the informed",
    "author": "KU_Clown",
    "date": 1675337921.0,
    "url": "https://www.reddit.com/r/Kettering/comments/10rntop",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is Kettering seeing a boom in high-salary administrators, along with a growing body of unproductive tenured faculty, like other universities?",
    "comments": [
        {
            "level": 0,
            "comment": "Oh, boy ... as an insider, any answer I give to this is likely to be problematic.  But I'll try.\n\nObligatory disclaimer: these are my opinions, and mine alone.  I don't have the authority to speak on behalf of my cat, much less the University.\n\nFirst, I'm going to separate this into two questions, because they really are independent of each other.\n\n**1.**  **\"Is Kettering seeing a boom in high-salary administrators ... like other universities?\"**\n\nFrom my perspective ... I wouldn't characterize recent activity as a \"boom\".  There have been lots of announcements of new administrative hires lately, but most of those hires have been filling vacant positions.   Sometimes those vacant positions move around in the org-chart a bit, which makes it look like there's a net increase in positions when it's merely a reorganization.   Also, eliminating administrative positions doesn't get nearly the publicity that a new hire gets.   (For example, when the Physics and Chemistry departments merged, one department head position was eliminated.)\n\nAs to the \"high-salary\" question ... equating people's value to the organization with a number is always problematic.  In my experience, someone who does their job well is usually worth far more than their salary (whatever it is), and someone who does their job poorly is usually worth far less than their salary (whatever it is).   So, arguments about \"high salaries\" are usually camouflage for arguing about performance.\n\nYes, administrators are being paid \"high salaries\".  But, you know, it's a free market out there.  People leave Kettering to get jobs at other institutions that pay better that we do.   (CS just lost its department admin for exactly this reason.)  When we replace them, we have to offer competitive salaries in order to hire.   The marketplace sets the salary range.   \n\nFull disclosure: I'm not happy with my salary here.  But complaining about how the person one floor up gets paid twice my salary doesn't result in a pay raise for me.  (At least, it hasn't so far.)\n\nPeople ought to get paid what they're worth.  Some admins contribute more than their salary to the institution; some don't.   The same could be said of rank-and-file staff, or faculty.   \n\n**2. \"Is Kettering seeing ... a growing body of unproductive tenured faculty, like other universities?\"**\n\nSome of my answer here is going to be similar to that of the previous question.  Sure, there are faculty here who contribute more to the University's mission than others.  I don't know how to characterize the ratio, or if the unproductive group is \"growing\".   I'm too close to the group in question to be able to answer that; y'all may be better situated than I to realize that.\n\nBut we need to unpack a couple of words in that sentence.\n\n**\"unproductive**\".   By what standard are you measuring productivity?   Because I can take any standard you offer, and point out the flaws in that standard.\n\nNumber of students taught?  By that standard, only ME and LA faculty are \"productive\", because of their huge class sizes, because literally 47.7% of our student body is ME, and 100% of our students have to take LA classes.  Is it my fault that I don't teach as many students in CS as ME does when there are fewer students to be taught, because Admissions isn't bringing in as many CS students as ME?\n\nPapers produced?  Sure, that's an objective metric, but somehow, I'm guessing that students really don't care about how many papers faculty write.\n\nTheses supervised?  Same problem as above, except that nobody asks LA faculty to supervise a thesis.\n\nCommittees served on?   (laughs)\n\nAnd what about all the things you can't measure?  When I talk for 30 minutes in my office with a student who's struggling in my class and help them to conquer something they don't understand, where does that show up in my productivity statistics?   Or if I take that same 30 minutes to offer a sympathetic ear to a student whose family life is stressing them out, how do I document that?\n\nIn short ... there's no good way to measure \"productivity\".   And I know that because I've sat on all the committees that have tried (and failed) to define that over the years.\n\n**\"tenured\"**.   Sure, there are tenured faculty who contribute less to the University because, well, they can get away with it.   Not having merit pay increases for a decade will do that to just about anyone, by the way --- including me.\n\nBut here's the dirty little secret about tenure: **every** company has tenure; we just don't use those words to talk about it.\n\nAt your worksite, do you know of some employee that's really not helpful to the institution, but can't be fired because of seniority?   That's tenure.   (At least, that's the bad side of tenure.)   Universities are just more honest about it than the rest of the working world.\n\nYes, there are \"unproductive tenured faculty\" here at Kettering, just like at any other University.   Figuring out what to do about that is a difficult problem --- just like at any other University.\n\nAs usual, I've talked too long.  \\*shrug\\*",
            "score": 23,
            "author": "jkhuggins",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your lengthy response!\n\nYeah, I was really more curious about **unnecessary** administrative positions. I don't have a problem with high salary, as long as it is worth it. Just so happens that administrative positions are usually higher salary. You mentioned that \"complaining about how the person one floor up gets paid twice my salary doesn't result in a pay raise for me,\" which is probably true. But at the same time, if that person one floor up isn't really providing any value to the university, that salary could be freed up to spend elsewhere. Either way, it sounds like you are saying there are **not** a bunch of unnecessary administrative positions at Kettering, which is good to hear.\n\nIn the case of professors, yeah, there are probably a lot of different standards you could use. As a student, all I really care about is the ability to teach relevant material. If a professor needs to take time outside of class to help me better understand something, and he does, then he is doing a good job in my eyes. Sadly, there are a lot of professors here that don't even try.\n\nI do think tenure is a little different than seniority, but whatever.",
                    "score": 3,
                    "author": "KU_Clown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1. Re: \"unnecessary\" administrators: such things are always judged in the eye of the beholder.  Nobody's going to tell you that their job is unnecessary, obviously.   The problem is that a lot of administrative work is, by nature, invisible, and is noticed more by its absence than its presence.\n\nI don't notice a lot of people sitting around twiddling their thumbs because they have nothing to do.   On the other hand, I don't get out of my office much, so ... *\\*shrug\\**\n\n2.  Oh, absolutely, \"tenure\" and \"seniority\" are different things.   But, in practice, the chief effect of tenure is to enforce seniority.   It shouldn't be that way, of course.   A professor who can't perform their job any more shouldn't be performing that job, regardless of tenure status --- and every academic will absolutely agree to that.   But it's harder to dismiss someone with tenure on that basis (as it should be).   It's not impossible, though; I've seen it done here.   (Or, at least, I think I've seen it done here.)",
                            "score": 4,
                            "author": "jkhuggins"
                        }
                    ]
                }
            ]
        }
    ]
}