{
    "id": "1201gwp",
    "score": 2,
    "title": "How is the engineering program (specifically computer science) at Kettering University?",
    "author": "theblobuprising",
    "date": 1679614076.0,
    "url": "https://www.reddit.com/r/Kettering/comments/1201gwp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The computer science program is not part of the Engineering department",
            "score": 14,
            "author": "hfucucyshwv",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kettering does have a [Computer Engineering degree](https://www.kettering.edu/academics/college-engineering/department-electrical-computer-engineering) in addition to their [Computer Science degree](https://www.kettering.edu/academics/college-sciences-liberal-arts/department-computer-science).",
                    "score": 8,
                    "author": "SamSpayedPI"
                },
                {
                    "level": 1,
                    "comment": "Im curious as to why ketterings CS isn’t an engineering major. My previous school had both bachelor of CSE and bachelor of CS. The differences being CSE is required more math and science, whereas CS still has you taking science and higher math courses but requires a foreign language. Also 121 cr/hr to obtain a CSE degree versus ketterings 141. \nThe curriculum at Kettering seems to be identical to above colleges CSE. So why doesn’t a self proclaimed engineering college requiring more credit hours have their CS an engineering degree?",
                    "score": 1,
                    "author": "Ok_Canary_2296",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really long answer ahead.  (I'm a professor, it's what I do ...)\n\nWhen \"computing\" degrees started in the 1950s/1960s, they arose naturally from departments with similar interests.   The problem is that there are two very different departments where computing comes from: mathematics (traditionally a liberal arts discipline), and electrical engineering (obviously an engineering discipline).  If you end up creating a \"computer engineering\" degree, it's obvious that the degree belongs in the College of Engineering.   But where does \"computer science\" belong?  The answer, at the time, was basically \"whoever got there first\".  \n\nSo, in some schools, CS lived in the liberal arts college, and in others it lived in the engineering college.    (At my alma mater, it actually lived in both; they had two independent CS degree programs, until The Powers That Be realized it was confusing for everyone and merged the two departments.)   Of course, once you've gotten it started in one place, inertia tends to keep it there, unless there's some incredibly compelling reason to move it.\n\nAbout 15-20 years ago, I compared Kettering's CS program against peer institutions; at those schools, the CS department lived in the engineering college about half the time, and in the liberal arts college the other half of the time.   There wasn't any particular reason that was apparent to an outsider.   (Of course, organization charts are often arranged for political reasons, and all politics is local --- which would be inaccessible to an outsider like me.)\n\nWhen I was an undergraduate (late 1980s) at the University of Michigan, the CS and CE programs were run by the same (engineering) department, even though the degree programs were in different colleges.   The difference between them (at the time) was much as you described above.  The computing core was identical between the programs; the CS (liberal arts) students spent their outside credits on foreign language and humanities courses, while the CE (engineering) students spent their outside credits on statics, circuits, and material science.  \n\nToday: I think the discipline of \"computing\" has grown large enough that a distinction between CS and CE degrees, in terms of the core subject matter, is more apparent.   While there's still substantial overlap (and always will be), there's also substantial differences that justify awarding two separate degrees with different names.   If you look at Kettering's CS and CE degree programs, you'll see that difference.\n\nShould CS be in the engineering college?  There's no required \"engineering core curriculum\" at Kettering right now, so moving the CS department to the College of Engineering wouldn't change anything about the student experience.  CS is now the second largest degree program at Kettering, so it's not like CS enrollment is \"suffering\" from being in the CSLA.   So ... from a ***student*** perspective, I don't see that anything would be different about CS if it was in the College of Engineering.\n\n(From an ***insider*** perspective, there might be all sorts of interesting reasons to choose which college hosts CS.   But those reasons have more to do with politics than pedagogy, and I'm not about to have that discussion in public :) :) :) )",
                            "score": 7,
                            "author": "jkhuggins"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of the CS professors are fantastic and really care about their students, a la u/jkhuggins , others though can be a bit difficult. All in all, it's a fantastic program and has grown immensely even in the past couple years",
            "score": 10,
            "author": "eyyyyono"
        },
        {
            "level": 0,
            "comment": "Mu son just graduated with a CS from Kettering. It was a tough go, but he’s kicking ass at his new job.",
            "score": 6,
            "author": "SlimShades"
        },
        {
            "level": 0,
            "comment": "Senior 3 CS and CE student at Kettering here. The CS program is good here, but at the moment there is a lot of transition in the program. Many of the tenured professors are retiring so the faculty is relatively new. This is both a good and a bad thing, but many graduates' experience in the program may not hold true. Overall I've enjoyed the classes and the program is adding concentrations useful to the workforce, but you have to be willing to adapt with a developing program.\n\nThe CE department (this is the engineering major, unlike CS) is also good and is baked in to the electrical engineering department. If you love the C programming language, this is the major for you. Kettering does not require these students to take high level CS or electrical engineering (EE) classes, but it is easy to obtain CS and EE minors by taking 3 extra classes (per minor). Personally, I am taking advantage of this to finish an EE minor. The professors in the CE department are relatively established and there is far less upturn compared to the CS department, but the ECE (electrical and computer engineering) department is done with the growing pains that the CS department deals with.\n\nOverall either choice at Kettering is a good one, but you have to be prepared to put in the work. Neither one will be easy after the introductory classes are completed, but both are fulfilling majors. Best of luck with your options, whether it involves Kettering University or not. PM me if you have further questions.",
            "score": 3,
            "author": "Brandonio725"
        },
        {
            "level": 0,
            "comment": "I’m not in CS but I heard decent things about the program. They are making moves in the right direction from what I’m told",
            "score": 2,
            "author": "DeafButterGuy"
        },
        {
            "level": 0,
            "comment": "I would say it’s okay. heavily Professor dependent so the experience from student to student varies heavilyz",
            "score": 2,
            "author": "LilAfroDude"
        },
        {
            "level": 0,
            "comment": "Heavily depends on the profs you get. Current CS major here with one term left. For me, CS here was kinda meh, someone alright, other times ass. Most profs couldn't teach. Had classes where the actual content taught was awful (Cloud was a waste of money). Had classes where I was screwed over grade wise by profs (always at the end of the term when I can't do anything). Lot's of BS that tends to piss me off to no end.\n\nIronically, my favorite classes were both seminar classes as well as my other requirements like math and communications. Even taking the co-op into consideration, I may have considered other options knowing what I know now. Speaking of co-ops, I feel like the program is somewhat overrated; the reason being that the co-op department is more focused on getting you any job as opposed to a good job (I did all my recruiting outside of Kettering after suffering through my first co-op term at a supposedly good co-op). However, I of course still believe that having a co-op is better than not having one (it's still the selling point of the program).\n\nIt's not all bad though. I came from a really good high school, so I had high expectations coming in. Two CS profs that were actually good at their jobs were Huggins and Turini. The department head is also really great and is leading the program in the right direction. The ability to finish terms in only 11 weeks is a huge plus. I attribute a significant part of my experience to entering the program during a rough transitionary period (covid, hybrid, new profs).\n\nFeel free to dm or ask more.",
            "score": 2,
            "author": "TheTunaTimes"
        },
        {
            "level": 0,
            "comment": "Take it with a grain of salt... I graduated over 20 years ago.What I learned was very good.  Take every single class you can get with Prof Huggins.\n\nI went the CE/CS route.  I haven't been in a coding or hardware design gig in at least 15 years.   I still do it, but it's for hobby projects.  Now I own an IT Security company.  I will tell you that understanding the underlying fundamental technology makes implementing, securing, and testing the higher-level tech much easier.\n\nI will also note (well, toot my own horn)- I went to a hacking/security con over the weekend.  Decided to jump on the cryptography CTF challenge.  I didn't know anyone there, so I was working solo.  Took 1st place over other teams of 5-10 people working together.  I haven't done blind decryption since my GMI crypto class in 1998 or 1999.  I still had the skills for this competition.  Admittedly, it would have been much easier if I wasn't just starting to learn Python for some of the language analysis/probability stuff.  I wrote my analysis/decrypt code in java/c/c++.\n\nAs others have mentioned, there are good, great, and not-so-great profs.  Having the advantage of time looking back, the not-so-great profs were much better than how I viewed them while a student.  I suspect this is because it was a tough subject, and their teaching style and my learning style did not jive.\n\nThe best thing you can do as a student - make some friends in CS.  Join a fraternity with them.   You'll learn just as much from each other as you do from the professors.  Because if you didn't understand a concept, the odds are good your friend did and vice versa.  You'll teach each other.\n\nWhen you get to school, head out to home depot and get an [8' x 4' hardboard sheet for $20](https://www.homedepot.com/p/EUCATILE-32-sq-ft-96-in-x-48-in-Hardboard-Thrifty-White-Tile-Board-HDDPTW48/205995949?AID=11556741&amp;PID=8335291&amp;cm_mmc=CJ-_-8335291-_-11556741&amp;cj=true).  It's a dry-erase board (minus the fancy frame and high price tag).  I got more use out of that cheap dry-erase board and a pack of multiple-color dry-erase markers than just about anything else.  Use it to plan out your coding projects, do test prep, and review concepts with your friends.   It's your new best friend for the next 4-5 years. =)\n\n~~GMI~~ ... I mean, Kettering is a tough program.  But if you work at it, you WILL know your stuff when you graduate.   Good luck!  \n\n\nShoot me a message if I can give you any more info.  \n\n\n(Out of the group of 6 guys that I studied with, 3 of us own businesses, 2 are executives, and 2 are Senior devs and managers.  One of the companies is probably going to IPO soon.  We've held stints at Amazon, Google, DoD projects, you name it.)",
            "score": 1,
            "author": "JRichmondGMI"
        }
    ]
}