{
    "id": "fffbgw",
    "score": 6,
    "title": "Do you guys have a community discord?",
    "author": "FlashTuttles",
    "date": 1583686737.0,
    "url": "https://www.reddit.com/r/Kettering/comments/fffbgw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am guessing not- but that would be pretty cool if we made a discord to just chat with each-other and do some memes and things... and I don't know.\n\nYee.  \nMaybe we could start a minecraft server..\n\nP.S: There's an admitted student program today. Anything that I should check out afterwards for the memes or go anywhere or something while I am here?  \nAlso is it possible to talk to an admissions counselor now..? Or should I figure out a different time for you guys to do that?",
    "comments": [
        {
            "level": 0,
            "comment": "yes SIR\n\nhttps://discord.gg/QG8GHke\n\nVery inactive but theres people on it 🤷\n\nthere is also a 24/7 mc server for us except currently down, hopefully up within a week. If you have any questions about campus feel free to pm me or discord me, same username",
            "score": 3,
            "author": "Cproo12"
        },
        {
            "level": 0,
            "comment": "The reddit has the /r/Kettering discord and many students use discord for things around campus including club activities and any organizations they are a part of, unfortunately people are all over the place on deciding what they want to use for communications. some people use groupme or slack, others are using facebook and some people use google as the entirety of their communication and maybe a phone call here or there. The link that Cproo sent is also found somewhere in the reddit header or community information, but I cant find it on desktop I normally just use reddit on my phone now.\n\npersonally I know there are discords for the clubs that I'm active in like the B-section video game club and the A-section Smash club, as well as weaboo discords for maybe animay club and the likes. not that I would know anything about the intricacy of chinese cartoons. I'm also in discords for the E-sports teams and with my house, its a really good central location for a lot of stuff on campus if you like to use it. \n\nAs far as talking to admissions counselors I'd at least give it a shot, worst they can say is schedule an appointment some other time and you can handle it in person instead of having to call in over the phone. As for checking things out if something seems super interesting to you ask questions before you forget about it, tons of students are very passionate about their one or two things they do around campus because of how much they have to do to support it. likewise if anything is weirding you out please let people know. If you are planning on attending KU definitely go into it understanding that the 3 month schedule as well as the profs for many classes will mean that the bare minimum effort to pass a class may be more than you would like, not in a high school not doing any homework and scrapping by with good test scores but like a you need to read the book for many classes and do every homework problem until you completely understand it. Lots of resources arent advertised very well to incoming students until they have issues with their classes or co-op that are fairly severe and that will be detrimental long term, I would take time to poke around ketterings site looking for as much information as you feel is necessary and talk to the Academic Success Center if you're worried about your grades in any course.",
            "score": 1,
            "author": "hydroin"
        }
    ]
}