{
    "id": "fmuwyr",
    "score": 24,
    "title": "kettering minecraft server vanilla 1.15.2 IP: borture.club",
    "author": "Cproo12",
    "date": 1584855871.0,
    "url": "https://www.reddit.com/r/Kettering/comments/fmuwyr",
    "media_urls": [
        "https://imgur.com/a/o4vJyGc"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "hey guys, i host this server from my home at my own cost\n\nit has been running for a looong time, but hopefully people might like to join it during the quarantine\n\ni think that somebody from here griefed it last november or something, but i have repaired...\n\nthere are no plugins or mods or whitelists besides a backup\n\nI expect people to ruin/destroy it, but hopefully people can be moderately nice. if anybody has suggestions for which mods to use for anti-grief/protection etc. please let me know!",
            "score": 10,
            "author": "Cproo12",
            "replies": [
                {
                    "level": 1,
                    "comment": " [https://www.curseforge.com/minecraft/bukkit-plugins/anti-griefing-tools](https://www.curseforge.com/minecraft/bukkit-plugins/anti-griefing-tools) \n\nof these I'd say you'd want async world edit, limit drops, server restorer and world guard.  \n\n\nyou dont need to use all of them but world edit is good for making physical backups of structures, but for a large copy of several building definitely go for the async WE or you're going to have to deal with server reboots every time you do something big  \n\n\nLimit drops just insures you don't have an asshat drop 8 million stacks of something to cause the server to lag unplayably and force you do clear entities manually, I'd basically recommend setting it to 36 stacks\\*number of average players  \n\n\nServer restorer is a command driven world backup tool instead of having to copy the game files yourself.  \n\n\nWorld guard is literally an anti-grief plugin at its core but its a bit extreme with some of its features. If you have players that arent playing anymore and structures that you want to preserve you can set zones where players cannot interact with blocks. you can also use additional game rules to the default minecraft rules like disabling TNT from functioning or limiting wither block destruction. these rules can also be set to apply to only certain areas. documentation is really good, I'd recommend not going too crazy with it and letting backups ensure player freedom for the most part.  \n\n\nI would discourage the use of mods like factions, plots or \"Grief Prevention\" where the plugins literally limit players from being able to play the game in a survival style instead opting for a more PVP based anti structure damage approach.  \n\n\nThe best way to gauruntee security is a short whitelist for players basically just a google form with username and one line of information about them and it discourages people from trying to grief a server if you know who they are even if its just \"I like dogs\" if you want this to just be an illusion of security you can have it auto whitelist from a google sheet",
                    "score": 2,
                    "author": "hydroin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you have any suggestions for anti-hack plugins?",
                            "score": 1,
                            "author": "3nder1ord"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "hello, I also host a server! Mine is 1.14.4 so it's a lil old but we have lots of fun plugins. It's themed around Greek mythology, if you want to try it out my IP is styxryvr.mcserver.ws\n\nI'm also looking for antigrief plugins,,",
                    "score": 2,
                    "author": "3nder1ord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "not going to repost the whole thing but check out the comment on cproo's comment",
                            "score": 1,
                            "author": "hydroin"
                        }
                    ]
                }
            ]
        }
    ]
}