{
    "id": "idz68h",
    "score": 65,
    "title": "Let's hope Kettering listens to their students! (Link to take survey in comments)",
    "author": "Sir-Hemsalot",
    "date": 1598024817.0,
    "url": "https://www.reddit.com/r/Kettering/comments/idz68h",
    "media_urls": [
        "https://i.redd.it/pcdded9dmdi51.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[https://forms.gle/k5T5T4EpN9W9zKJp8](https://forms.gle/k5T5T4EpN9W9zKJp8)",
            "score": 12,
            "author": "Sir-Hemsalot"
        },
        {
            "level": 0,
            "comment": "Tbh, the pass/fail option is nice but I kind of don’t think it’s necessary. While a C or D might look bad, at least you passed the class and it counts. Some of you worry way too much about your gpa when your employer will be more impressed with your school/work experience than some number. At the end of the day, just do your best and the results will follow. Choose your battles correctly, some classes are just going to be hard no matter what, but do well in the easy ones and everything will be fine.",
            "score": 1,
            "author": "Mahlmeister",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're not necessarily wrong, but many students have seen a large drop in quality of their lessons. Many of the responses to this survey have not be \"i will fail all my classes without this\" they've been more along the lines of \"My lectures are unfollowable due to the camera being too blurry to take proper notes, my prof won't record the lecture for me to go back and watch and I've had technical difficulties keeping me from viewing, taking tests on blackboard have been difficult for a variety of reasons\" etc. A lot of people are not just trying to save their GPA. Many feel they were not given a proper chance to do well given the format of their classes this term.",
                    "score": 18,
                    "author": "SuchPusheen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But isn’t that just trying to save your gpa? If you can’t follow the class, either don’t take/drop it and save yourself the time or take another class. You have to make that decision. If you’re still going to pass the class then just take the grade because you’re just going to move on anyways.",
                            "score": -10,
                            "author": "Mahlmeister",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well not all of us are rich and can afford to do that.",
                                    "score": 10,
                                    "author": "diesalotXV",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It doesn’t cost money to drop the class and you don’t lose any if you still have at least 16 credits. Load up 20 credits if you can so you can drop the hardest one if you need to.",
                                            "score": -4,
                                            "author": "Mahlmeister"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The problem is not if the class is hard or not, the problem is that some classes online are having so many issues. Some professors are not recording classes, and they take attendance through blackboard, so if your connection is bad, then you're fucked. Plus some of them don't record their lectures. It's not about if YOU think it's necessary or not. It's about the people whose blackboard keeps failing and not letting them into the collab session for 45 minutes. Also everyone has different learning styles and learning abilities. So if you don't need it, then cool, don't use it, but at least let other people have THE OPTION to get a pass/fail.\nAlso, I dunno if you're aware, but many employers ask for a minimum GPA, so if some people are having trouble with online classes, then I think it's best of they can keep their GPA.",
                    "score": 8,
                    "author": "gaymuggle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m just saying, if you’re or the class is having those kinds of issues then taking the class in general is probably a bad idea and you’re just setting yourself up for failure. You have to remember, pass/fail doesn’t stop you from actually failing the class and if you’re having issues then either drop the class or take a leap year. No one is going to blame you if you just can’t do online classes because you aren’t the only one. It’s up to each person to determine if online classes is right for them. Also, don’t forget that Kettering offers Covid relief funds if it’s a personal issue.",
                            "score": -4,
                            "author": "Mahlmeister",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are some classes that are completely online and you can't do anything about that though. And while pass/fail won't prevent someone from failing, it does help them to not have their GPA affected because of technical or unforseen issues about how a professor is handling their own situation in their lectures.\n\nAlso, who mentioned anything about financial/personal issues? You don't know what other people are going through right now, and I don't think it's fair to just assume that everyone is wired like you are and just say: \"oh you can't do it? Well boo-hoo, I can and screw you\"\n\nI, personally, don't need the pass/fail, but some of my friends do. And I am advocating for them because I don't want to see them struggle with their co-ops or scholarships. We are all already going through hard times, why put people through more? Once we go back to fully being on campus they can get rid of the pass/fail option. But due to current world circumstances I think it's in the best interest of everyone to keep it as an option.",
                                    "score": 6,
                                    "author": "gaymuggle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Look, I’m not trying to offend anyone but it’s just my opinion. I’ve gone through four years of kettering and their bs. Maybe I’m biased going into my last semester and just want to get my degree over with, but I’ve been in the trenches here so I know what it takes to get through some of these classes. I also had to already do a full online semester last B-section, so I know how it is and how much it sucks. I went into last semester with 20 credits and came out with 16. I made a decision early in the semester that I wasn’t going to do well in one of my classes so I accepted that and dropped it. Don’t get me wrong, my other classes weren’t a piece of cake either, but I grinded through them and made it out alive. \n\nSometimes you just have to accept that not everything is going to go your way. No disrespect to anyone but Kettering doesn’t owe you anything and they are going to drill that into your head every semester you come back. The classes are difficult and 75% of the professors really don’t give a shit if the class makes any sense and if you pass or not. If you’re having it rough, there is always someone who is having it even rougher. Either suck it up and figure it out or move on.\n\nI also understand the financial issues some of you may have. I’m not poor but my friends like to remind me that I’m not rich. When classes went online, my $90 laptop I bought off a friend my freshman year decided it was time to call it a career and left me. 90% of my co-op wages goes to paying tuition so buying a new laptop was a tax. Luckily though, Kettering offered the Covid Relief Fund and helped pay for a new one. The fund is there for everyone and if you’re not taking advantage of it then you’re just dumb. Books, desk, lost wages from on-campus work, computer/laptop, rent, and a bunch of other things can all be covered up to $1,800 which is just the highest amount I’ve heard of but could be more. \n\nIn the end, some of you just like to complain and not do anything rather than take action (Maybe not you if you’re reading this). I sympathize for those of you with legitimate issues but I know some people just want to take advantage of the pass/fail system and get through the class the laziest way possible. To each their own, this is just my opinion.",
                                            "score": -5,
                                            "author": "Mahlmeister",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You say we’re just complaining when KSG literally made this survey to take action to show the provost there is indeed interest on P/F this term when he believes there’s not? Dude you’re just trying to complain about your peers at this point. Not everyone who wants P/F is a trying to skate by. There are real issues and this survey is to show the administration that. But go and say keep saying we just whine and do nothing all day. \n\nAt the end of the day, this survey has accomplished what we were hoping for. We got the input from actual students showing what they wanted in regards to grades, and now KSG can represent that with actual data.",
                                                    "score": 4,
                                                    "author": "SuchPusheen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I honestly didn’t even look at the survey and just wanted to lay out what I thought about the pass/fail system itself. If you read my other posts you’ll see. At this point I’ve made so many comments that reddit is cracking down on me now. May you guys’ survey get seen and I hope for the best.",
                                                            "score": 2,
                                                            "author": "Mahlmeister"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Congratulations, shit hit the fan for you, ALL of us Kettering students understand what that's like, but you're missing a large chunk of the point here. First off, your statement of \"I knew I wasn't going to do well in a course, so I dropped it,\" isn't something that we all can afford the luxury of doing. There are classes that Kettering offers that are only offered every other year, and even worse, those are often prerequisites for something else, or are requirements for a concentration which ultimately end up pushing your exit from this place even further back.   \n\n\nSecond, your statement that Kettering doesn't owe us anything is bullshit. We pay this place to provide us with a service, with an education, something that some of these online classes barely provide (repeatedly missing 30+% of the audio due to technical issues in an unrecorded lecture doesn't really help me learn anything, now does it). Kettering failed to provide the service which we all paid for, and as a result, we have the right to demand some sort of compensation for it (ie, a pass/fail).   \n\n\nLastly, regarding people abusing pass fail, I see people skate through this place every single day on nothing more than a collection of old cribs and Chegg. The lazy people who don't want to put the effort into a class and who would abuse a pass/fail system are the exact same people who barely put any effort into this stuff in the first place anyway. Even if somebody isn't a slacker and uses pass fail to just glide through a class, they're still setting themselves up personally for failure down the road.   \n\n\nPersonally, I have no use for a pass/fail system as a Senior 3 with one foot out the door, and who has worked his ass off to succeed in this place, but I do understand how having the pass/fail option would be beneficial to some students, whether it be to keep scholarships, keep their co-op position (an extremely rare commodity anymore), fraternity/sorority requirements or just so that they don't end up on academic probation because some professor who has 2Kbps internet failed them for not being able to understand the pile of garbage that ended up on that student's computer screen.",
                                                    "score": 6,
                                                    "author": "eyyyyono",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I never stated I was some special case and I know very well that we all take Kettering’s pipe every semester. I know there are prerequisites involved but even I’ve had to get around that (I forget who I contacted). Idk, there is enough time and opportunity at this school to make up a class or take one online that you should be able catch up. \n\nI entirely believe in my statement that Kettering doesn’t owe us anything. To me, your statement is the same thing as saying life owes you something for just being alive. Sure, you pay to go to this school, but you could’ve gone to any other school as well. Maybe the class audio does suck and you don’t learn as much leading you to getting a worse grade, but is pass/fail the compensation you’re really looking for? Get angry at the school you choose to go and seek ways to improve it by reaching out. There are plenty of ways to do so. Maybe they’ll read one of your’s and your classmate’s 20 reviews and think about changing it. Or maybe they won’t and we’ll continue to have the same problems. All I know is that if the class completely sucked, and I couldn’t have done anything different myself, that a simple pass/fail wouldn’t make me feel any better. \n\nI do understand why having the system in place to help people with keeping scholarships and the rest, but the academic probation part is dumb. One professor alone isn’t going to put you at risk, if you’re on or will be going on academic probation then that’s a personal issue. You can’t tell me more than half your professors are having bad enough connection issues to warrant possibly going on academic probation. The rest of that was fine though.",
                                                            "score": -5,
                                                            "author": "Mahlmeister",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "For one, getting screwed on a prerequisite can set back anyone's career here by a decent amount, and getting around them is not always an option. \n\nYour equivalency of my statement to \"life owes me something for being born\" is invalid as it is a false equivalency. The only way those are equivalent is if I were to simply set foot on the campus and say they owe me an education. Regardless of your feelings, at the end of the day, we pay money with the expectation of receiving a service, and if said service is not provided, it is in my right to request compensation for it (what it is is irrelevant).\n\nYou act as though Kettering students have never tried to improve this school, I can tell you that we have. Myself, and many of my colleagues, have attempted to communicate with the administration, to no avail.\n\nYou are correct, one professor is highly unlikely to put you on academic probation, but it is still a possibility for some, especially those just on the threshold. To write that off as solely a personal problem is also illogical as well, as every other problem I listed is a personal problem. Also, it's not just the internet connections, many of them still have no idea how to conduct class virtually, which in turn leads to the students suffering.\n\nThe bottom line is, there is no issue with the school providing a pass/fail option to students.",
                                                                    "score": 7,
                                                                    "author": "eyyyyono"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You keep saying \"no offense to anyone... no disrespect to anyone...\" but that's all you are doing when you say \"well, if you can't take an online class, just don't take it or drop it\" some of us don't have the luxury/money to stay one or two more terms...\nLook, no one is saying that you haven't had it rough. This is also my last year, and I just want to graduate... but that doesn't mean that I don't care about everyone else in this school.\nIf you were in Spring term taking online classes, then you know people had the option to keep their grades or take a pass/fail.\nLike you said: \"If you’re having it rough, there is always someone who is having it even rougher.\"\nSo, why want the people who are having it rougher even worse?\nI get it, it's frustrating when there are people who are lazy and just take the pass/fail... but you've got to realize that most people \"having it rougher\" are the ones taking the pass/fail.\n\nSo, agree to disagree buddy.",
                                                    "score": 4,
                                                    "author": "gaymuggle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In my head, I don’t see the appeal of taking a pass/fail grade and I haven’t need to use it myself. Sure, you might save yourself a C or D from your transcript, but I would rather just take the grade. Then there’s the case where if you wanted to go for your graduate degree that the school could want you to retake the class anyways. If everyone else wants pass/fail ,then by all means keep it implemented, I just don’t care for it.\n\nI should ask though, why would you/they need to stay one or two more semesters. Kettering allows you to take 2 classes out and there are enough semesters where you could squeeze in extra classes if you needed to. Taking the semester off wouldn’t cost any money, and sure you would be behind your classmates, but if it is necessary then so be it.",
                                                            "score": 1,
                                                            "author": "Mahlmeister",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dude... are you sure you've been here for 4 years? It seems like you don't know how scheduling works. The reason for staying one or two more terms is because not all classes are offered every term. Some of them are offered every other year, some of them are offered summer/fall term or winter/spring term. Also, it's not like you can bring in any transfer credits. Registrar only allows transferring gen-eds unless you are taking some classes abroad. Also, you have to take into account that you are available to attend the university you are being a guest at either in person or online. So if you don't find an online version, good luck with finding a school that's within you co-op driving distance or school housing distance...\n\nAnd good! Why didn't you start with the \"if everyone wants to keep it implemented, then keep it, I don't care\" since the beginning!? Lol",
                                                                    "score": 7,
                                                                    "author": "gaymuggle"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The only reason i care about my gpa is scholarship and student life eligibility. I wouldnt care if my financial stability didnt depend on it, ya know",
                    "score": 7,
                    "author": "Cproo12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can understand that",
                            "score": -1,
                            "author": "Mahlmeister"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If pass/fail is implemented, what would happen with scholarships?",
            "score": 1,
            "author": "Woreo12"
        },
        {
            "level": 0,
            "comment": "I was going to add a statement that the only reason Kettering is the way it is today if from decades of improvements but you covered that. Personally, I just don’t think anyone or thing owes anyone anything, even if you payed for it. Life is unfair and you’ve got to make the best of it otherwise where is the challenge in it? Whether you agree with that or not is up to you but it’s whatever really. And if you’re on the threshold of probation then I do think it’s personal right at this point because classes just switched to online and if your issues stemmed from in personal classes then that is your fault. If this was a year from now. and classes were still online, then I could see that argument being valid. Anyways, hopefully the survey works and we get pass/fail, I don’t need it but I hope whoever does gets it.",
            "score": -3,
            "author": "Mahlmeister"
        },
        {
            "level": 0,
            "comment": "Lol, I told you it was my opinion from the start. I didn’t vote in this survey but I actually voted for having pass/fail last B-section. These are just my moral beliefs and I don’t like the concept itself. And like I said, if you’ve got extra time (semesters) then talk to your advisors or department. This is probably the best time to lay out your issues and where they’ll be understanding of them. I haven’t needed to take a class out but my friends have taken a couple over there work terms online and they’ve all been easier than Kettering classes.",
            "score": -5,
            "author": "Mahlmeister"
        },
        {
            "level": 0,
            "comment": "[Like That Will Ever Happen](https://giphy.com/gifs/laughing-applause-mike-tyson-wWue0rCDOphOE)",
            "score": -5,
            "author": "TEG24601"
        }
    ]
}