{
    "id": "j6g5l7",
    "score": 8,
    "title": "Positive Discussion: How Are Professors Doing Online Classes Right?",
    "author": "mcmannywitch",
    "date": 1602027233.0,
    "url": "https://www.reddit.com/r/Kettering/comments/j6g5l7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Yeah, it's fun to make memes and poke fun at how bad some of our classes and professors are, and it's obviously super easy to do it here. I'm gonna be that guy for a minute to try and cut in with something more positive.  \n\nWe've now had two complete terms of \"virtual\" classes, meaning both sections have had their turn of asjustments, and that we've all had a lot of time to  start figuring out what does/doesn't work. \n\nI've already seen a lot of discussion about what complaints you've all had with certain classes and how professors have made virtual learning a living hell.\n\nWhat I want to focus on here is where professors have done well. Try answering one or more of these questions: \n\n- What are some ways professors have successfully adapted to virtual learning? \n\n- What are some ways professors have used Blackboard (The website and/or the collaborative learning sessions) to make class better? \n\n- How have professors made their classes enjoyable and successful while being online? \n\nMy thought behind this post is to try and help the overall online experience. If people have similar experiences, maybe it's something that all professors could consider adopting into their classes. If someone has a class they're struggling with, maybe they'll see an idea here that they can suggest for their class. \n\nThere are so many ways to approach online learning, especially when every class calls for a different way of teaching, and professors with different levels of experience in knowing what to do. We're all adapting, and it's not perfect, but maybe if we all get talking about which parts are RIGHT,  we can get ourselves a little closer to perfect.  \n\n....Plus I'm just curious about your answers, if I'm honest.",
    "comments": [
        {
            "level": 0,
            "comment": "I took an IME course with Dr. Kamaraj, and he did a few sessions where he allowed students to write on the screen.  \n\nLike, he'd ask a question like \"what are some examples of materials?\" And then open the floor for students to have free roam to type on the screen. So we'd all be able to type answers out at the same time, similar to if we were all standing in front of a room with a white board marker and were told to write our answers out.  \n\nI didn't have any other professor do this, and I thought it was a fun way to get everyone in the class engaged and interacting. I thought it was fun!",
            "score": 5,
            "author": "mcmannywitch"
        },
        {
            "level": 0,
            "comment": "For a CS class with Dr. Huggins, he did a thing where he'd assign class reading, and then have us do a quiz before our class. The quiz would include something like \"What's one question you feel was unanswered or worth discussing based on the reading?\" \n\nHe'd collect all of our questions before class, and then these questions would be used for class discussion. It was really cool because it gave us a sort of loose structure, and also made it interesting since we were discussing the topics/questions that WE were interested in.  \n\nIt also made for some really whacky discussions, because you never knew what the question would be, and everyone was allowed to chip in with their thoughts.",
            "score": 5,
            "author": "mcmannywitch"
        }
    ]
}