{
    "id": "jonri5",
    "score": 46,
    "title": "Co-op reality - COVID is cruel",
    "author": "FlashTuttles",
    "date": 1604599892.0,
    "url": "https://www.reddit.com/r/Kettering/comments/jonri5",
    "media_urls": [
        "https://i.redd.it/2w0libxqpgx51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Culver's RN",
            "score": 7,
            "author": "diesalotXV",
            "replies": [
                {
                    "level": 1,
                    "comment": "TG Fluids unfortunately",
                    "score": 2,
                    "author": "FlashTuttles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really? I got an interview with them in like 2 weeks",
                            "score": 1,
                            "author": "FTNatsu-Dragneel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's depending what for. For me they wanted an assembly tech which basically means it's like you stand in a cell and you assemble pieces together period don't get me wrong it's still good in terms of work experience but it isn't towards a degree necessarily you still learn a bunch of quality stuff in terms of inspecting parts for quality out of rapid rate and making sure you hit quota to at least try and be efficient",
                                    "score": 1,
                                    "author": "FlashTuttles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that’s the position I’m being interviewed for, I don’t think they are hiring co-ops for any other position\n\nI’m still not 100% sure I would even take the position if I got it though",
                                            "score": 2,
                                            "author": "FTNatsu-Dragneel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I would definitely say if you can't find anything else for a co-op it will suffice as any work experience is still work experience in this time but yeah.",
                                                    "score": 2,
                                                    "author": "FlashTuttles",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Do you plan on doing it again next work term?",
                                                            "score": 1,
                                                            "author": "FTNatsu-Dragneel",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It depends necessarily. I know there's still a lot of other people who also work here so you won't be alone but just know what I've said before it is a job that will get you work experience but it's not curated towards an engineering experience most likely as an assembly tech",
                                                                    "score": 1,
                                                                    "author": "FlashTuttles",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Alright then",
                                                                            "score": 1,
                                                                            "author": "FTNatsu-Dragneel"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}