{
    "id": "k892me",
    "score": 38,
    "title": "The tiny little blip in this graph is when COVID first peaked in Michigan. At that point, Kettering decided to halt in person classes for B section to keep students safe. If Kettering doesn't go online for A section they are being extremely hypocritical in regards to student safety.",
    "author": "ProfessorCovid2",
    "date": 1607313222.0,
    "url": "https://www.reddit.com/r/Kettering/comments/k892me",
    "media_urls": [
        "https://i.redd.it/1v6hu1uwto361.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I absolutely will not attend class in person, and they want my money. They will give the option of online even if they do open campus ( which would be an incredibly evil money grab which would surprise no one).",
                    "score": 3,
                    "author": "DunnyBadger"
                },
                {
                    "level": 1,
                    "comment": "I have my doubts that B-Section will return fully in person in the Spring. Since we will be catching a little after the end of flu season (usually ends in February, but still has some activity in May). With limited numbers of vaccines, and as of now it sounding like there are two manufacturers producing (Moderna and the Pfizer/BioNTech), its going to take awhile to get to a point where college students have rhe availability to vaccines. With vaccines being prioritized to medical workers and elderly, we will see a decrease in death rate I feel like, but both those groups appeared to have been pretty careful this entire time. I think the case numbers will look similar to what we saw this summer, and will probably result in hybrid. Thats just my take and predictions for the situation.\n\nWith cases still increasing heavily, I dont feel like this is the best time to be doing in person classes for A Section. I think we can all agree we just want this to be over. Honestly with how hybrid went this summer, I would almost prefer online. I basically had fully online as it was since professors weren't very accommodating with having to drive from offsite online (since D-Spaces were mostly closed) to an in person class, and then back. I wouldnt miss any class if I just watched online compared to 5-10 if going in person.",
                    "score": 6,
                    "author": "AType75"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hybrids were so nice. Only like 2 or 3 people for each one of my classes even showed up in class, was like receiving direct tutoring from my professors. Not at all looking forward to all online this coming term.",
            "score": 3,
            "author": "Cproo12",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would argue that hybrid was worse than all online. Most of the times for hybrid I was either waiting for the prof to get the stream to online, or waiting online for the prof to join. All online keeps that from happening.",
                    "score": 3,
                    "author": "anotherguy252"
                }
            ]
        }
    ]
}