{
    "id": "kx6q59",
    "score": 19,
    "title": "What sorts of red flags popped up when you started working at a co-op you hated?",
    "author": "Stawars775",
    "date": 1610634772.0,
    "url": "https://www.reddit.com/r/Kettering/comments/kx6q59",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "My manager made me sign in and out on an iPad everytime I had to get out of my chair (even to go to the bathroom) and had pictures that she’d tape next to it if you got up and didn’t sign out to shame you.",
            "score": 39,
            "author": "SuchPusheen",
            "replies": [
                {
                    "level": 1,
                    "comment": "What the actual fuck.",
                    "score": 15,
                    "author": "DunnyBadger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When the thing they hired me to run was being dismantled as I was starting.",
            "score": 26,
            "author": "gkfbxhkgvd"
        },
        {
            "level": 0,
            "comment": "Never really hated a co-op, but a couple of red-flags...\n\nPut you on a project, with no definable goals or deadlines.  The senior programmer leaves for another job within a few weeks, and no one replaces them.  You only really interact with the office manager, never your boss, and rarely anyone other than the other co-ops.",
            "score": 19,
            "author": "TEG24601"
        },
        {
            "level": 0,
            "comment": "They hired me before they had opened. Which meant no money to pay me after a month.",
            "score": 18,
            "author": "DunnyBadger"
        },
        {
            "level": 0,
            "comment": "they made me move to Ohio.",
            "score": 54,
            "author": "MILLER_LITE_WOOO",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like the worst of it, lmk if you need to talk",
                    "score": 7,
                    "author": "anotherguy252"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having no tasks at all, and getting 7 thesis ideas rejected when my co-op couldn’t think of one for me.",
            "score": 15,
            "author": "grey1170"
        },
        {
            "level": 0,
            "comment": "When your boss doesn't even train you or give you a clear goal/overall reason of why you're there",
            "score": 7,
            "author": "throwawaystomakechan"
        },
        {
            "level": 0,
            "comment": "When I was there to help out the manager and I ended up just being a DoorDash driver for the office.",
            "score": 8,
            "author": "cheddahchase"
        },
        {
            "level": 0,
            "comment": "Doing nothing, other co-ops and full time employees are unhappy. You hope for things to get better, because your new manager says so, but they never do. You wouldnt want to work full time at a place like that anyway so why co-op there.",
            "score": 6,
            "author": "Angryv6auto"
        }
    ]
}