{
    "id": "pkwe22",
    "score": 19,
    "title": "Please Explain",
    "author": "tiredstudent007",
    "date": 1631188825.0,
    "url": "https://www.reddit.com/r/Kettering/comments/pkwe22",
    "media_urls": [],
    "other_urls": [],
    "postText": "Little late in the term to be posting this but I was wondering if someone could explain to me what ass backwards logic kettering is using by only allowing virtual for confirmed covid cases, and enforcing this on professors to not support any other student. They are already supporting online learning again so why not make it another hybrid term where students are able to decide if they want to come to the school or take classes remotely?  \n\n\nIs it just some kind of power play to flex on other universities that they have x% of in person students?",
    "comments": [
        {
            "level": 0,
            "comment": "Disclaimer: I don't speak for Kettering --- on this or any issue.  (***Oy***, do I not speak for Kettering on this issue ...)\n\nOne clarification: Kettering doesn't *forbid* me from supporting students virtually.   There's no \"enforcement\" going on, AFAIK.  But my support of virtual students is in the context of my primary responsibility of delivering in-class instruction for my courses.\n\nOkay, back to the original question: why not just go hybrid again, and let students decide?   Again, *I do not speak for Kettering*, but here are a few reasons:\n\n1. Not enough classrooms are equipped for hybrid instruction.   One of the classrooms I'm teaching in right now doesn't have a camera.   I'm required to record all class sessions as \"supplemental materials\"; how am I supposed to do that in any meaningful way without a classroom camera?   I'm using my laptop camera, but that's inadequate, and also means I can't use the fancy classroom computer.    I've mostly given up on that class and am teaching solely off PowerPoint slides instead of using the whiteboard, because there's no way for anyone on a recording to see the whiteboard.(All classrooms were supposed to be updated with proper technology before the term began.  It didn't happen.  I don't know why it didn't happen.)\n2. Kettering isn't staffed for hybrid instruction.   When I taught in hybrid mode, Kettering provided me with a graduate student to operate the camera, make sure I remembered to turn on the recording, and monitor the chatroom to make sure that I wasn't missing questions from my online students.   I don't have any of that right now, and I don't know how Kettering would pivot to provide that staffing.\n3. It sounds great to say \"why not let students decide?\".   In practice, students don't always make that decision well.   Some students come to class when they shouldn't (e.g. when they're COVID-positive), which leads to campus outbreaks.   Some students don't come to class when they should, which leads to poor performance.\n\nMy one experience teaching a hybrid course was in Winter '21.  At the beginning of the term, I surveyed the class (as required) to ask students if they'd be attending virtually or in-person.   In Week 1, 50% of students said they'd be attending in person.   I never had more than 20% of students in person, because students chose to stay in bed.   (For a Winter class meeting Monday morning at 8am, I don't blame them.)    It completely changed the dynamic for me, because I always had more online students than in-person students, and so I ended up viewing the course as an online course with a live audience.   There was absolutely no benefit to being hybrid at that point.\n\nOf course, one of the students in my hybrid course was on academic warning, because \"online courses suck\", and he'd pretty much flunked everything the previous term when he was online.  So The Powers That Be made sure that all his courses were hybrid, so that he could always go to class.    He never came to class (a choice which he had every right to make), never turned in any homework, bombed the midterm, and withdrew during 7th week.   He's on academic probation now, and probably one step away from being kicked out.\n\nThe point of the story is this: it's easy to say \"let students choose\".   But students don't always make good choices.   And there's no way to force students to make good choices, especially right now, because one of the things we're trying to get students to do is to accurately self-assess their own physical and mental health (because no-one else can do it), and students aren't experienced in doing that.   (After all, y'all are *students*, and the reason you're students is that you don't know everything yet.)\n\nTL;DR: going hybrid is complicated, and creates as many problems as it solves.",
            "score": 37,
            "author": "jkhuggins",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the insight! Always appreciated!",
                    "score": 3,
                    "author": "diesalotXV"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kettering's marketing is that classes are an \"in-person, hands on experience - not just note-taking!\"\n\nReality: Kettering University is the same as any other university with the exception of shorter terms that make hard classes harder, and you work for half the year. But for whatever reason it is considered a prestigious school because its tuition is ridiculously high and is a private school.\n\nIf the administration wasn't as focused on the outward appearance of the school and actually cared for students, then maybe we'd have a reasonable administration. But because admins like to line their pockets with the money of those who take on enormous debt for a \"prestigious\" education, they need more potential students to apply.\n\nSo I'd say yes, it's some weird power trip thing of saying \"dEspITe tHE cOOf, WE had STuDenTS IN pErsoN!\" as a way to market the school to (more likely) potential students",
            "score": 13,
            "author": "McMahan_is_a_DILF",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Reality: Kettering University is the same as any other university with the exception of shorter terms that make hard classes harder, and you work for half the year. But for whatever reason it is considered a prestigious school because its tuition is ridiculously high and is a private school.*\n\nThis is so bogus. Kettering is prestigious because of what it's graduates accomplish once they leave. It is highly ranked because other universities know what it produces even if you don't - but then maybe you do because you are here, so whine away. That's why I went here, even though I had a lot of options.\n\nIt's expensive, sure. but tuition is not rediculously high for the type of institution it is. If you compare it with a state school where you have 400 students in your Calc 1 class (like my best friend from high school) sure it's higher. But my friend who is at UofM pays about the same as I do all in (I pay a couple of thousand more/year) but I get a lot better opportunities at my co-op than UofM students do. And the head of my division and the CEO are both Kettering grads.\n\nAnyway, Kettering is not just a MI school - it one of 22 national polytechnic universities ([https://theaitu.com](https://theaitu.com)) Kettering has one of the lowest tuitions in that group.\n\n*If the administration wasn't as focused on the outward appearance of the school and actually cared for students, then maybe we'd have a reasonable administration.*\n\nEvery time I have talked to someone in the administration they have listened to me and pretty often did something about it. Not always but usually. I've gone to McMahan's office hours. Why don't you talk to them rather than whining on reddit about it, you might be surprised.",
                    "score": 10,
                    "author": "ku-mythbuster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The financial aid has also been very good in my experience, Scholarships, grants, co-op income, and federal student loans cover my tuition and living expenses for the year. I know most of my friends are graduating with about 20k in debt and will be making at least 85k a year after they finish up their classes. I will be at about 28k by the time i'm done. The school has it's issues, but at least they are being discussed. I would definitely like to see more efforts to improve diversity and better equip departments that are currently understaffed such as the ECE department.",
                            "score": 4,
                            "author": "diesalotXV"
                        },
                        {
                            "level": 2,
                            "comment": "kettering is relevant in michigan and the auto industry, and is not highly ranked at all on a national level. this isn't to say it's a \"bad\" school, it just isn't as good of a school as it's students, alum, and faculty would like to admit. schools like u of m (and most of the other universities on that list you cited) offer way more in the way of opportunities to it's students if you're interested in any industry that isn't car related.\n\nalso, you shouldn't need to show up to office hours with the president to feel like the administration is working to better the school, it should be obvious through their action.\n\ni'll say that as an alum i've felt massive disappointment over many of the administrations recent moves.",
                            "score": 2,
                            "author": "ryan4888",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*i'll say that as an alum i've felt massive disappointment over many of the administrations recent moves.*\n\nEasy to say, but how about some specifics - like what? Massive disappointment? Over what?\n\n*it just isn't as good of a school as it's students, alum, and faculty would like to admit.*\n\nI get tired of people trashing our school on Reddit. What sense does that make? I'm working hard to get a degree here and  you are out there trashing the school and making my degree worth less. Making your degree worth less too.\n\n*also, you shouldn't need to show up to office hours with the president to feel like the administration is working to better the school, it should be obvious through their action.*\n\nThis is such BS. Why do you expect professors, the administration, or whoever to read your mind? If you have a problem, talk to them. When I do, I have always found they care - a lot - for me and for students. Just because they don't read your mind or do exactly what you want, doesn't mean they don't care.\n\nI've only been here three years, but I see a lot of changes - most are for students. Obvious? Are you kidding? Look on the beach lately?",
                                    "score": 0,
                                    "author": "ku-mythbuster"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}