{
    "id": "pxuv3g",
    "score": 79,
    "title": "Why it sucks being a professor",
    "author": "jkhuggins",
    "date": 1632920394.0,
    "url": "https://www.reddit.com/r/Kettering/comments/pxuv3g",
    "media_urls": [],
    "other_urls": [],
    "postText": "Final course grades are due in 48 hours.\n\nI just found that someone posted my exam to Chegg.",
    "comments": [
        {
            "level": 0,
            "comment": "I really feel bad for what happened, Dr Huggins. It is unfortunate that students take advantage of a Professor that truly wants the best for them. I read the other post about you not wanting to use honorlock and the material being difficult — you would think there would be more gratitude based on how much students complained about honorlock and how many students always want to take a take home exam. I just want to let you know that other students do truly appreciate these efforts you put forth. I hope you figure out a solution to this situation",
            "score": 36,
            "author": "Stressedbrownpotato",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you.",
                    "score": 14,
                    "author": "jkhuggins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When receiving email about the blatant cheating that occurred I was racking my brain for what someone could have done that would be blatant. Especially after all the talking of prior cheating experiences you have had in the past.\n\nThen after seeing this post I realized I forgot to take in Dr.Fosters number 1 rule: people are stupid.\n\nI would say more but a lot of what I would say has been covered in prior responses. Please know that you are one of the best Professors I have had at Ketteirng University and am sorry this has happened to you this term.",
            "score": 22,
            "author": "Babymomty10",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you.",
                    "score": 9,
                    "author": "jkhuggins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Re: HonorLock:\n\n(1) Two wrongs don't make a right.\n\n(2) HonorLock punishes the innocent right along with the guilty.",
                    "score": 26,
                    "author": "jkhuggins"
                },
                {
                    "level": 1,
                    "comment": "Chegg is designed to support this type of behavior. It’s not a matter of if they could stop it, it’s that they do not want to stop it.",
                    "score": 6,
                    "author": "IhateTomScott"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was it posted before or after your exam was taken?",
            "score": 4,
            "author": "Woreo12",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't tell; as far as I can see, there isn't a timestamp on the page.",
                    "score": 8,
                    "author": "jkhuggins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should report the account on chegg",
                            "score": 3,
                            "author": "Stressedbrownpotato",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am trying to start an official investigation, but Chegg makes it a PITA for instructors to do so.   I have to submit a signed letter on University letterhead from Dean McCune to start any investigation.",
                                    "score": 14,
                                    "author": "jkhuggins"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can request Chegg to perform an investigation, this post says what you'll receive back:\n\n[https://www.reddit.com/r/Professors/comments/g1jiob/psa_heres_the_information_chegg_will_give_you/](https://www.reddit.com/r/Professors/comments/g1jiob/psa_heres_the_information_chegg_will_give_you/?utm_source=share&amp;utm_medium=mweb)\n\nI would definitely pursue a student who posts a complete exam to Chegg.",
            "score": 4,
            "author": "McMahan_is_a_DILF",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate the link.   I've done this before, and I'm in the process of doing this now.\n\nBut (a) it's unlikely I'll get the results before grades are due, (b) as I've said before, if the student used a burner email, there's nothing I can do about it, and (c) I shouldn't have to do any of this @#$! in the first place.",
                    "score": 10,
                    "author": "jkhuggins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gotcha, didn't know if you requested it!\n\nIt's definitely a huge blow to you, as a respected professor, to have to deal with this kind of mess.\n\nHopefully you'll get some results back soon enough for you to handle the situation effectively by the time grades are due.",
                            "score": 3,
                            "author": "McMahan_is_a_DILF"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The catch with the credit card is if they use someone else's, or additionally, they could use a prepaid debit card you can buy from like Walmart (can't remember if those have names associated with them). Sucks that this whole situation is happening.",
                                    "score": 2,
                                    "author": "AType75"
                                },
                                {
                                    "level": 3,
                                    "comment": "I didn't get any credit card information.   I did get an IP address for a server in Berlin.  (None of my students are from Germany.)",
                                    "score": 1,
                                    "author": "jkhuggins"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP. Is it possible to shift the weight to midterm more so students who didn't cheat have fair advantage?\n\nWell assuming that midterm wasn't uploaded on chegg as well.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I admire the creativity.  But then I'd get complaints about changing the announced grading scheme.   (\"I was counting on the final to pull my grade up.\")",
                    "score": 8,
                    "author": "jkhuggins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Publicly expelling people for cheating would be an obvious violation of FERPA.   That's simply not an option.   (Even though I totally agree with you.)\n\nLook, I'm not totally naïve.   I get that there's an opportunity for this to happen.  That doesn't mean I like it.    With the material I was testing, an in-person exam would be horrible for students, and I despise HonorLock.   So this is the best of many bad options.",
                    "score": 17,
                    "author": "jkhuggins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The page you linked cites 34 CFR § 99.36, which only deals with protecting the health and safety of students or others.   Academic dishonesty isn't a health and safety issue.",
                                    "score": 11,
                                    "author": "jkhuggins"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was in school, never did I ever think about cheating.  The thought was just not in my head.  Let alone giving the exam to another person.  I didn't know about Chegg, or any other site (that's how long it's been since I was in school).  I would think this student must have taken the exam and then posted it.  Otherwise, how did they get the exam to post?  It would be great if there was a randomizer for questions so each student gets different questions on their exam. This might make a good thesis project????  I appreciate your efforts Prof. Huggins.",
            "score": 2,
            "author": "Chipmunks6134",
            "replies": [
                {
                    "level": 1,
                    "comment": "Randomizers work well for certain types of problems, but not all.  Keep in mind that (a) the instructor has to write that pool of questions that could be randomly chosen, and (b) the instructor has to work to make sure that all of those questions in that pool are of equal difficulty.   \n\nIt'd be easier if everyone just played nice and did their own work.",
                    "score": 2,
                    "author": "jkhuggins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not sure that anyone will notice this comment a month later (yes, the old man doesn't really get how Reddit works), but I hate leaving things unresolved.\n\nThe matter is now closed.  As I feared, the student used fake email addresses to post the exam, so there's no way to identify the poster.\n\nThe only \"good\" news is that no-one responded to the posts, so it's unlikely that the student received any benefit.   But attempting to cheat is still cheating, even if the attempt fails.\n\nSo, chalk up one more thing to turn me towards the Dark Side.\n\nAt the same time, I want to thank all y'all for your encouraging words.  It is good to know that so many Kettering students take academic integrity seriously.",
            "score": 2,
            "author": "jkhuggins",
            "replies": [
                {
                    "level": 1,
                    "comment": "We had to take in class exams in the late 90’s.  Why can’t the kids do the same now?",
                    "score": 1,
                    "author": "jasonr1023",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This particular exam I have given for years (with different questions, of course) as a take-home exam.   Sometimes, an in-class exam isn't the appropriate format.",
                            "score": 3,
                            "author": "jkhuggins"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, if I can manage to jump through enough hoops, they'll take the information down as a copyright violation.   But that's too late; at that point, the damage is done.     \n\nSure, I can try to pursue this (and, believe me, I ***AM*** pursuing this), but the likelihood of me getting anywhere is uncertain.   If the student used a burner email to create their Chegg account, there's little I can do.\n\nThis is why professors drink.   (And then make students use HonorLock.)",
                    "score": 19,
                    "author": "jkhuggins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read that Chegg will also release the information of any accounts that accessed your problems during the exam period.",
            "score": 2,
            "author": "grantuwishs"
        }
    ]
}