{
    "id": "sdi7zd",
    "score": 21,
    "title": "Big Bucks, Big Decisions? Not as of January 26,2022.",
    "author": "Scary_Supermarket508",
    "date": 1643235844.0,
    "url": "https://www.reddit.com/r/Kettering/comments/sdi7zd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Let’s not forget, President McMahan made $683,657 in 2019(W2 from 2019 990 IRS form - most recent salary data). He is the one being payed the big bucks to make the big decisions. \n\nMcMahan should have been the one to decide the mask policy, it’s a big decision. And, working 80 hrs a week on average (2019 IRS 990) gives McMahan lots of time to make these decisions.\n\nThe decision should not be left up to faculty, they have enough to worry about (i.e. teaching students). Faculty is going to take the heat no matter what decision they make on their mask policy. It’s no longer, “it’s the administrations decision, not mine.” \n\nFaculty has enough to worry about, do your job President McMahan and the rest of the Administration. \n\nPresident McMahan should know by now that these decisions aren’t easy, as we are 2 years into a pandemic. Yet, he still passed the responsibility of policy off to the Faculty.",
    "comments": [
        {
            "level": 0,
            "comment": "McChicken is allergic to taking action",
            "score": 13,
            "author": "diesalotXV",
            "replies": [
                {
                    "level": 1,
                    "comment": "Daddy lets me make the decisions 🥰🤡",
                    "score": -1,
                    "author": "McMahan_is_a_DILF"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean no masks is better let's be honest",
            "score": 5,
            "author": "Mmmmmmmmbruh",
            "replies": [
                {
                    "level": 1,
                    "comment": "no pants is the best",
                    "score": 3,
                    "author": "buydipsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure if should be excited or concerned, either way there's no hiding the inevitable",
                            "score": 1,
                            "author": "McMahan_is_a_DILF"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What makes you think he didn’t? He chairs the Covid response team, after all. Not every decision the President of a company makes is announced on their letterhead and under their signature. I’m sure Kettering wouldn’t change their policy on Covid without the President having the final say. \n\nThe way I read it it’s not about who gets to take heat (why are you giving anyone heat anyway?) it’s about people being able to make their own decisions about the risks they take. If you wanna wear a mask wear a mask, wear 2, wear 3. Your choice.\n\nAt some point we all need to stop expecting to be treated like children and told and just take responsibility for what we do, and that includes how we put others at risk.  Otherwise it just makes it sound like you want to be told what to do so you can be pissed off at somebody even though you know it’s probably the right thing to do. That’s bogus.",
            "score": 6,
            "author": "ku-mythbuster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why is the covid response team not making the call on the policy? (Mask required, mask not required, etc.) Masks are a Covid related issue, thus they should be a Covid Response team decision. Professors should NOT be left in charge of policy, the more time they spend on Mask policies the less time they spend bettering students education.",
                    "score": 6,
                    "author": "Scary_Supermarket508",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Professors aren’t being left in charge of policy — the policy now is that they can set the rules for their classroom. Their choice. They can set rules that they feel comfortable with, not rules dictated by someone else. If they want their students to wear masks and be distanced they can mandate it. Seriously how much time does that take to set? Two lines in an email?\n\nWhat we need to do is respect their decision and live by the rules they set for their class. Seems pretty simple.",
                            "score": 5,
                            "author": "ku-mythbuster",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And if they don't?   That's the part that bothers me.\n\nSuppose I require masks and a student walks in and says \"I'm not wearing a mask, I'm done with the pandemic.\" Now what do I do?   If I don't enforce the rule, it's not a rule.   But I have no means to enforce the rule that doesn't turn me into an asshole.\n\nWhen it was a University-wide rule to wear masks, everyone followed the rule.  When there were two rules regarding masks, almost no-one wore masks because there was no way to enforce the rule (or even know who was violating the rule).\n\nI'm struggling with figuring out how to impose a rule that, realistically, I have no way to enforce.   It may force me into imposing no rule at all, even if I want a rule.\n\n(If you can't tell, I really don't know what I will do.)\n\nAnd, no, it's not \"two lines in an email\".",
                                    "score": 16,
                                    "author": "jkhuggins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When there was a University-wide rule to wear masks, what actions were professors supposed to take if a student decided, for example, to take off their mask once they entered the classroom? I'd think that if professors indicated that they are requiring masks, they'd be able to take those same actions. If not, that is a *major* oversight that needs to be corrected. (Although, for all I know, professors couldn't really do anything about it before, we just never saw it happen. Which is still a really bad edge case to ignore.)\n\nAs for being seen as a jerk, I don't think the opinions of students who are themselves jerks matter all that much, as long as the University administration gives you power to enforce a mask rule and supports your decision to do so. If the University administration refuses to support its professors, we have a major problem. We already have a problem if students don't respect their professors enough to follow such a simple requirement in the first place, but I don't know how we as a community can fix it.",
                                            "score": 2,
                                            "author": "hallb1016",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "With University-wide rules, faculty were instructed to notify the Dean of Students if a student was not complying with mask regulations.   Now ... I don't know.   (Maybe I'll get clarification on that later.)",
                                                    "score": 7,
                                                    "author": "jkhuggins",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I received a faculty-wide email this morning indicating that the Deans and Provost will assist faculty in enforcing classroom masking policies, and that I can report violators to those offices for further action.",
                                                            "score": 3,
                                                            "author": "jkhuggins"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "\nRespectfully, since you are a faculty member, and I have have taken your class and a great deal of respect for you, \n\n&gt; Suppose I require masks and a student walks in &gt; and says \"I'm not wearing a mask, I’m done with &gt; the pandemic.\" Now what do I do?   \n\nHow about failing them for violating your attendance rule? Or writing them up?\n\n&gt; If I don't enforce the rule, it's not a rule.   \n&gt; But I have no means to enforce the rule that \n&gt; doesn't turn me into an asshole.\n\nWhy does enforcing a course requirement make you an asshole? Are you an asshole for giving students a bad grade if they do poorly on an exam? Or expecting them to follow the syllabus?\n\n&gt; When it was a University-wide rule to wear \n&gt; masks, everyone followed the rule.  When there &gt; were two rules regarding masks, almost no-one \n&gt; wore masks because there was no way to \n&gt; enforce the rule (or even know who was violating \n&gt; the rule).\n\nYes, and the results in terms of the number of Covid cases on campus  were pretty much the same in both cases. Not the strongest circumstantial evidence that masking makes a difference…\n\n&gt; I'm struggling with figuring out how to impose a \n&gt; rule that, realistically, I have no way to enforce.   \n\nNot really true, you simply don’t want to be the heavy. My father was a teacher, and he used to say of his students that I can be friendly but it’s a problem if I try to be their friend. \n\n&gt; And, no, it's not “two lines in an email”. \n\nRespectfully, it sure seems like it is.",
                                            "score": -4,
                                            "author": "ku-mythbuster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"How about failing them for violating your attendance rule?\"\n\nI don't have an attendance rule, as you know.   But this situation may force me to create one, against my will.    At which point, someone will complain that I'm imposing a rule that wasn't in my syllabus when the course began.\n\n\"Or writing them up?\"\n\nI have no idea what \"writing them up\" means.  I have no way to \"write up\" a student for anything.\n\n\"Why does enforcing a course requirement make you an asshole? Are you an asshole for giving students a bad grade if they do poorly on an exam? Or expecting them to follow the syllabus?\"\n\nNo, because everything in the syllabus and on the exam has to deal with how well students demonstrate mastery of the course learning objectives.   And that's the core problem.  Flunking a student for failing to wear a mask has nothing to do with the content of the course --- as I'm sure the student will shout from the rooftop over and over again as they appeal my decision to every administrator they can find.\n\n\"The results \\[of the masking rules\\] in terms of the number of Covid cases on campus were pretty much the same in both cases.\"\n\nYou're comparing Delta with Omicron, which isn't a valid comparison.\n\n\"You simply don’t want to be the heavy. My father was a professor, and he used to say of his students that I can be friendly but it’s a problem if I try to be their friend.\"\n\nGuilty as charged.  I'm tired of viewing students as my enemies.  If that's the world you prefer, I'm sure there are plenty of instructors at Kettering who would be happy to accommodate you.",
                                                    "score": 8,
                                                    "author": "jkhuggins",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\n\"You simply don’t want to be the heavy. My father was a professor, and he used to say of his students that I can be friendly but it’s a problem if I try to be their friend.\"\n\n&gt; Guilty as charged.  I'm tired of viewing students \n&gt; as my enemies.  If that's the world you prefer, \n&gt; I'm sure there are plenty of instructors at \n&gt; Kettering who would be happy to accommodate \n&gt; you.\n\nRespectfully, this is a strawman. The choice isn’t being their best buddy or being their enemy.  I’ve had some great professors at Kettering, many good ones, and a few not so good, but I’ve never had one that treated me like their enemy. I’m surprised a professor like you would disparage his colleagues in this way.",
                                                            "score": 0,
                                                            "author": "ku-mythbuster",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No, the choice isn't binary, and you're right to point that out.   \n\nBut, respectfully, I know my colleagues better than you; I've known them for longer, and I know what they say about students when y'all can't hear them talk.   Many of them are wonderful people.  Some are not.",
                                                                    "score": 6,
                                                                    "author": "jkhuggins"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe it’s because some professors actually care about there students well being. What if masks are effective in reducing a students stress, how does virtual learning affect a students mental health, how does a mask policy affect Immuno compromised individuals mental health (do they need to constantly worry about getting Covid and possibly dying.  \n\nPlane and Simple: A uniform policy was easier for everyone, students and staff. Students didn’t worry about a professors masks policy do I need one do I not, will they be subconsciously biased if I wear one, if I don’t wear a mask. Faculty didn’t have to worry about other Faculties and students opinions on the situation.\n\nAt the end of the day an all or non policy is the simplest. Either entirely virtual or all online. Either everyone masked or none required at all. \n\nIf the pandemic has done anything, people have started to realize Mental Health Maters!",
                                                    "score": 4,
                                                    "author": "Scary_Supermarket508"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Professors aren’t in charge of policy - they can set the rules for there own classroom. (Rules are a policy!)",
                                    "score": 3,
                                    "author": "Scary_Supermarket508"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They did make their decision - allow people to make personal choices and to request others to put on a mask in group environments.\n\nI'm sorry you disagree with it?? Can't please everyone.",
                            "score": 2,
                            "author": "McMahan_is_a_DILF"
                        },
                        {
                            "level": 2,
                            "comment": "Again, how do you know they aren’t? I wrote the covid email and Homsher wrote me back. She said the covid team meets pretty much every week, and the president leads it. They discuss all this stuff and make recommendations and the President makes the final call. Write her yourself and ask if you wanna know.",
                            "score": 2,
                            "author": "ku-mythbuster"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hi, a graduate here so not a child! My large company job requires masks and it’s not because we can’t make our own decisions, it’s because they see how masks have kept our factories open and the people safe. Sometimes when you agree to work somewhere or go to a school, you follow protocols to keep you and others safe instead of making a “decision about the risks they take”. Want to make your own risks? Tell that to your manager when you don’t follow lock out protocol and see how that goes. Heads up, you’re going to get fired.",
                    "score": 10,
                    "author": "chemland",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed, same here for me (and my wife) in our corporate jobs.  Both our companies have rules in place that if you're in an open area (cubicles, meeting rooms, hallways, etc) or in an office with more than one person you have to socially distance and wear masks.",
                            "score": 4,
                            "author": "rollercoaster_fan"
                        },
                        {
                            "level": 2,
                            "comment": "Boomer\n\nStill amused that you make your argument under the pretense that you're a graduate and that automatically makes you an authority figure for a bunch of college students.",
                            "score": -2,
                            "author": "McMahan_is_a_DILF",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I stated I’m a graduate to make the point that in the real world following safety protocols isn’t wanting to be treated like a child",
                                    "score": 4,
                                    "author": "chemland",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Didn't realize I was attending college and got mugged at gun point in the Metaverse, whoops!",
                                            "score": 0,
                                            "author": "McMahan_is_a_DILF"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Clearly there wasn’t good communication between Administration and Faculty. When asking faculty what there Mask policy is, some of them asked what policy. What do you mean I’m in charge of policy?",
                    "score": 1,
                    "author": "Scary_Supermarket508"
                },
                {
                    "level": 1,
                    "comment": "I like to wear mine like underwear. No covid gonna get me 🤡",
                    "score": -4,
                    "author": "McMahan_is_a_DILF",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe I am a boomer bc I don’t get your jokes (or you’re just not funny)",
                            "score": 6,
                            "author": "chemland"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "McChicken didn't even consult faculty. There's a difference between authoritarian decisions randomly being thrown from the admin &amp; looking for the best interest of the faculty/student body",
            "score": 1,
            "author": "KUBURNER69",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would be careful about making that assertion.   The COVID-19 Response Team has faculty representatives on it, so they can truthfully say that faculty were a part of the decision.\n\nNo, the wider faculty body wasn't consulted.  But, knowing my colleagues, I'm not sure if that would lead to a better decision.   Very few of us have the training to make medical judgments, except we all have giant egos and think that we do.   \\*shrug\\*",
                    "score": 1,
                    "author": "jkhuggins"
                }
            ]
        }
    ]
}