{
    "id": "wtr32z",
    "score": 10,
    "title": "Thoughts about adding a year",
    "author": "Fearless-Reindeer-17",
    "date": 1661058021.0,
    "url": "https://www.reddit.com/r/Kettering/comments/wtr32z",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am thinking about adding a year to my schedule. I am already redoing an essential class and might have to redo it again because I fell behind due to sickness. I am thinking of just adding a year so I can spread my schedule out. Does anybody have any suggestions?",
    "comments": [
        {
            "level": 0,
            "comment": "No suggestions per se, just want to throw in some words of reassurance - even without extenuating circumstances as serious as yours, adding an extra year onto my originally planned curriculum was one of my best choices at KU. You only have a true college experience once; a graduate degree or another undergrad cannot replicate your first, wholly immersed experience, and there are some opportunities you can only seize as a young college student.",
            "score": 15,
            "author": "IronWolf0117"
        },
        {
            "level": 0,
            "comment": "Add the year. As long as you can handle it financially your stress level will be much more manageable.  Many people are so called \"super seniors\". There likely will be others in your class. It won't affect your career negatively. Even less than other schools because you can still gain more co-op experience.",
            "score": 15,
            "author": "epp1K"
        },
        {
            "level": 0,
            "comment": "If it’s a class that you can’t take it online somewhere else for cheaper (and usually easier), then sure go for it. Since you called it an essential class I’m gonna assume that taking it somewhere else isn’t possible\n\nI would go for it, just keep in mind certain scholarships only last a certain number of terms so you might not have your current scholarships helping you financially for that extra year\n\nBasically the only downside is the money part but it should relieve a lot of stress",
            "score": 6,
            "author": "FTNatsu-Dragneel"
        },
        {
            "level": 0,
            "comment": "I'm in a similar position, taking the extra year is absolutely worth it. It's better to do a few things well than many things poorly.",
            "score": 7,
            "author": "blazingarcher608"
        }
    ]
}