{
    "id": "11sk5ix",
    "score": 35,
    "title": "Case Closed (Detective Conan) Episodes 985-1005 Dubs Available Now on Tubi",
    "author": "jimmyedagawa78",
    "date": 1678941097.0,
    "url": "https://www.reddit.com/r/animedubs/comments/11sk5ix",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/11sk5ix/case_closed_detective_conan_episodes_9851005_dubs/"
    ],
    "other_urls": [
        "https://tubitv.com/series/300008260/case-closed-dubbed)"
    ],
    "postText": " **Case Closed (Detective Conan)**\n\n* **Episodes 985-1005**\nEpisode 1005 is currently not available (will be released shortly)\n\n[Dub Available Now on Tubi](https://tubitv.com/series/300008260/case-closed-dubbed)\n\n\\---\n\nCast\n\n* Conan Edogawa by Wendee Lee\n* Kogoro Mouri by Xander Mobus\n* Ran Mouri by Cristina Valenzuela\n* Sonoko Suzuki by Crystal Lopez\n* Juzo Megure by Oscar Cheda\n* Wataru Takagi by Diego Klock-Perez\n* Mitsuhiko Tsuburaya by Ghia Burns\n\nSynopsis:\n\n&gt;A high school detective is attacked by two mysterious men who force him to eat a pill that causes him to transform into a 7-year-old.",
    "comments": [
        {
            "level": 0,
            "comment": "So where are the other episodes lol",
            "score": 11,
            "author": "Environmental_Fly920",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the process of being dubbed hopfully. Can't believe they released 40 eps in the span of a month",
                    "score": 7,
                    "author": "jimmyedagawa78",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was wondering about episode 1 on, can’t seem to find it anywhere, all subbed",
                            "score": 3,
                            "author": "Environmental_Fly920",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, they haven't dubbed it yet, they just started the dub last month, but started around the 900s and have about 40 episodes out so far. If they can keep up this pace they can get the series done in a few years hopefully. It would be good if they start from the beginning soon (plus with the remasters it would be an incentive to dub from episode 1)",
                                    "score": 2,
                                    "author": "jimmyedagawa78"
                                },
                                {
                                    "level": 3,
                                    "comment": "If you want dubbed the only way to get the first 100-ish episodes is through DVD sale, which are out of print. Subbed I think Crunchyroll has most if not all of it.\n\n&amp;#x200B;\n\nEdit : It seems like Tubi is starting this far down the line, to try and keep it more current with the times, and not just starting 20 years ago, with what they had.",
                                    "score": 1,
                                    "author": "Vallyyn"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should be noted that 1003 is currently missing, but hopefully it'll be added soon.",
            "score": 7,
            "author": "pokemontrainerred93",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://tubitv.com/tv-shows/200001349/s01-e1003-the-36-cell-perfect-game-part-one?start=true It's finally been added.",
                    "score": 3,
                    "author": "pokemontrainerred93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Letsss goooo!!!",
                            "score": 2,
                            "author": "jimmyedagawa78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes! I wonder why it's still not out yet",
                    "score": 2,
                    "author": "jimmyedagawa78"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really wish these funds were used in more movie dubs or finishing lupin part 2. Sigh TMS.",
            "score": 7,
            "author": "Bluebaronbbb",
            "replies": [
                {
                    "level": 1,
                    "comment": "They had to get to the series at some point lmao, I just wish they focused on canon episodes instead everything, not complaining tho it's more conan content! Also, they do have 2 movies dubbed, just not released on home video or digital.",
                    "score": 4,
                    "author": "jimmyedagawa78",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really? Which ones? Even movie 24 do we really know for sure if they ever dubbed it? Maybe it was cancelled at the last minute cause they didn't end up dubbing it.",
                            "score": 1,
                            "author": "anime-prime-MAL",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dimensional sniper has been rumored to be completed since the start of 2021 and the Scarlet Bullet got an English Dub in 2021 in Singapore, France and other places. The last we heard of the dub was the theatrical release of M24 in Chilli just last month.",
                                    "score": 2,
                                    "author": "jimmyedagawa78",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ironically, one of the episodes in this batch (the movie prequel 1002 to be specific) actually kept the line at the end where Conan mentions Scarlet Bullet being available now, despite the fact that the English release doesn't seem to be coming any time soon.",
                                            "score": 3,
                                            "author": "pokemontrainerred93",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lmao, they just keep teasing us XD",
                                                    "score": 1,
                                                    "author": "jimmyedagawa78"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Crazy that they haven't been released yet if they have been ready for that long. The only thing that makes sense to me is that they are hoping to widen their audience through the dub episodes on Tubi before releasing further major movies.",
                                            "score": 2,
                                            "author": "anime-prime-MAL",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, my speculation is that they wanted to release the film in the theatres (discotek also said that a theatrical release would be the best move for case closed in one of their panels last year) but waited for the covid to subside a bit so people would feel more comfortable going out, but by then, the war had begun, and TMS didn't want the movie to be associated with the debut of a Conan theatrical dub in the US with a movie all about terrorism.",
                                                    "score": 1,
                                                    "author": "jimmyedagawa78"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Conan is like Sailor Moon in that main story is cool but a lot of what's fun is in the one off stuff.",
                            "score": 1,
                            "author": "Kuudered-Kun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, there's a whole site to show what's important or not, and list of episodes.",
                                    "score": 1,
                                    "author": "Vallyyn"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have been binge watching these. Having Case Closed dubs back is such a blessing after years of waiting for more.",
            "score": 2,
            "author": "NoobSlayer-4869"
        },
        {
            "level": 0,
            "comment": "IN THE THOUSANDS BABY",
            "score": 1,
            "author": "helloiamaudrey"
        },
        {
            "level": 0,
            "comment": "Holy crap, 20 new dubbed episodes?! Don't mind if I do.\n\nEdit: episode 1003 appears to be missing. Hope they upload it soon.",
            "score": 1,
            "author": "272b",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's been uploaded 🥳",
                    "score": 1,
                    "author": "jimmyedagawa78",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nice!",
                            "score": 2,
                            "author": "272b"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "they’re killing the game! at this point they’ll have the entire series dubbed in a few years",
            "score": 1,
            "author": "acityindoom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, they are going so fast!! 40 episodes in just about a month!",
                    "score": 1,
                    "author": "jimmyedagawa78",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "2.5 years and the entire series would be done",
                            "score": 1,
                            "author": "acityindoom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anybody knows where we can watch the movies? I’ve got a Crunchyroll account but for some reason there’s only the series episodes and not the movies. Checked anywhere else and it doesn’t come up. I’m in the US. Hoping somebody could help me out",
            "score": 1,
            "author": "alycatme",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi,\n\n**Your Post / Comment Has Been Removed**\n\n* It featured obvious directions towards a site for illegal streams or downloads\n* It featured promotion of piracy, use / desire to pirate or promotion of use of a site for illegal streams or downloads.\n* A request for alternative illegal options such a free pirate sites to use etc.\n\n**Keep in mind that repeat violation of the rules might result in a ban.**\n\n[Click Here For More Info On This Rule](https://www.reddit.com/r/Animedubs/wiki/rules#wiki_do_not_link_to_or_enable_illegal_content)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Animedubs) if you have any questions or concerns.*",
                            "score": 1,
                            "author": "AutoModerator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amazon prime, YouTube, and rightstuf have purchase options.",
                    "score": 1,
                    "author": "Sarikami"
                }
            ]
        }
    ]
}