{
    "id": "120qby2",
    "score": 23,
    "title": "Is there a reason HIDIVE / Sentai have got slower with there dubs and reduced there HV dub output ?",
    "author": "[deleted]",
    "date": 1679677022.0,
    "url": "https://www.reddit.com/r/animedubs/comments/120qby2",
    "media_urls": [],
    "other_urls": [],
    "postText": "You would think with that AMC buyout, deals with TV stations and them clearly having cash to go after shows again that would result in at least some improvement dub wise.\n\nBut no they have got slower there was a time when HIDIVE would start there dubs for the season at about the half way mark (6 to 7 weeks) but now we are lucky to even have a single show start before it finishes its sub run. So far we have 0 dubs for any Winter titles not even for fucking Danmachi !!\n\nLike the delay would be somewhat understandable if they where remote dubbing and bringing in more talent from outside like LA rather than stick to there small talent pool or outsourcing but again that's not happening either, so what the fuck makes them now slower than even Netflix when it comes to dubbing active simulcasts now.\n\nAbove applies to there HV side as well, been looking at there slates and there is **NOTHING NEW** for dub fans in the coming months.\n\nLike its already hard to justify paying 5 bucks a month for at most maybe 4 dub episodes a week when for a few bucks more Crunchy is dropping over 20 dubs episodes a week, so any guesses or is it simply the case of them not caring that much about dubs and dub fans.",
    "comments": [
        {
            "level": 0,
            "comment": "Sentai/Hidive has always pretty much done 3-4 dubs a season.  So that's nothing new for them. As for why they are so delayed/backlogged.  I think they got behind during COVID and just never really got caught up.  Now they are almost always a season behind on dubs.\n\nI fairness. I feel their dub quality has SUBSTANTIALLY improved over the past few years. So that's a positive tradeoff.",
            "score": 19,
            "author": "mylastdream15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very recent dubs have been very good (Sword, Urusei from what I saw, Eminence in Shadow). But I watched The Executioner And Her Way of Life, and it had rough spots. Bang Dream season 2 was just not good. They have certainly had many more good ones than bad, but they've still put out some stinkers. And it's still at a point where if Sentai licenses a show, I just assume it's not getting dubbed.",
                    "score": 7,
                    "author": "MegaAltarianite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "See. I really liked executioners dub...",
                            "score": 3,
                            "author": "mylastdream15"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Sentai/Hidive has always pretty much done 3-4 dubs a season.\n\nAlthough during their summer wave, they managed to do **6** weekly dubs if you would include the backlog Ya Boy Kongming",
                    "score": 5,
                    "author": "drawricks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah.  For a second people thought their dubbing was increasing.",
                            "score": 7,
                            "author": "mylastdream15"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; I fairness. I feel their dub quality has SUBSTANTIALLY improved over the past few years. So that's a positive tradeoff. \n\nYea as someone that didn’t really like Sentai dubs except for a handful(i.e. Food Wars, To Love Ru), I’d say Sentai’s dub quality has definitely increased in the past few months with dubs like the recent Urusei Yatsura and Akiba Maid War.",
                    "score": 4,
                    "author": "tykroma94"
                },
                {
                    "level": 1,
                    "comment": "&gt;Sentai/Hidive has always pretty much done 3-4 dubs a season.\n\nI mean yeah that output was fine when at most they would get next to nothing during a season, but now its fucking awful and leads to only a small handful of shows getting dubs from there lineup used to hate Crunchy before the buyout for that very reason guess HIDIVE is now the worse anime licensor for dub fans.\n\nI said this elsewhere but ffs they clearly got the cash to go after shows but 0 interest to improve there dub capacity, outsource or use remote recording for a wider talent pool and also its the not knowing what will get a dub that's pissing me off we are just about finished Winter and the best we can do is guess the maybe if we are lucky 4 shows that will get a dub, will the same for Spring at this rate with one of the most hyped shows of the season OSHI NO KO going its entire airing run undubbed which fucking sucks means dub fans lose out on joining in and have to spend months avoid shit.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah.  Amazon is still the worst licenser of anime if they don't outsource their dubbing.",
                            "score": 5,
                            "author": "mylastdream15",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Didn't Amazon stop licensing new anime a while ago?",
                                    "score": 2,
                                    "author": "272b",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nope.  Still stuff comes around...",
                                            "score": 0,
                                            "author": "mylastdream15",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "When was the last time they licensed a new anime? I can't seem to remember...",
                                                    "score": 2,
                                                    "author": "272b"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah I'm not really including fucking Amazon at this point as a mainstream seasonal anime licensor of simulcasts.",
                                    "score": 0,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Other than a few exceptions, their dubs always have been pretty decent. Bloom Into You was a same-season dub and it's top-notch.",
                    "score": 1,
                    "author": "272b"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Given how Reincarnated as a Sword and Akiba Maid War's dubs each didn't started until after the subs were over, and The Eminence in Shadow and Urusei Yatsura's dubs were technically simuldubs but didn't start until the sub was almost over, part of me is starting to suspect they just don't like the whole simuldubbing process and are more comfortable with waiting until the subs are (almost) over to start dubbing stuff.",
            "score": 8,
            "author": "awakening_knight_414"
        },
        {
            "level": 0,
            "comment": "To answer your question in your post title, I think the reason why Sentai/HIDIVE has fallen a season behind their dubs was because they had to handle the big wave of dubs last summer including the backlog titles I'm Quitting Heroing and Ya Boy Kongming! It was also their best season in a long time, licensing 12 titles. I don't exactly know why, but **Sentai literally let all these dubs finish first before starting their fall dubs**, consuming a lot of time.\n\n&amp;#x200B;\n\n&gt;So far we have 0 dubs for any Winter titles not even for fucking Danmachi !!\n\nHIDIVE will be attending [Anime Boston](https://twitter.com/HIDIVEofficial/status/1636097440771104775) and they will most certainly announce their winter dubs from there and probably new licenses as well. They did it just like last fall where they also at a con and made big announcements.",
            "score": 5,
            "author": "drawricks",
            "replies": [
                {
                    "level": 1,
                    "comment": "So there gonna announce there Winter dubs 1 week into the Spring anime season with them potentially starting 2 weeks in at best...amazing speed. So they are now the slowest anime licensor when it comes to dub fans. Netflix even has beaten them this Winter season.\n\nDoesn't really explain why they have reduced there new dubs for HV releasing recent titles as sub only giving us so far 0 new dubs on HV for half of 2023 or why they are so damn slow they used to give us dubs after the 6-7 week mark since they used to be able to do both somewhat well. Blaming them dubbing what 2 or 3 backlog titles all the way back in fucking Summer of 2022 is a roit.\n\nThey have more than enough money to go after titles but seemingly 0 to invest in dubs or like I said they just dont care about dubs in general that much. Which isn't a massive shocker meaning more and more titles they get will go undubbed since there's 0 sign they care about dubbing more than a small handful of what they get fucking sucks used to hate Crunchy before the buyout for that very reason guess HIDIVE is now the worse anime licensor for dub fans.",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;They have more than enough money to go after titles but seemingly 0 to invest in dubs or like I said they just dont care about dubs in general that much. Which isn't a massive shocker meaning more and more titles they get will go undubbed since there's 0 sign they care about dubbing more than a small handful\n\nThat's par for the course for AMC, they have the same reputation in the Western TV sphere for doing the bare minimum (basically taking any scraps HBO, FX, Showtime etc don't want) and cheaping on out spending once they actually get them (see walking dead). Their best shows like Mad Men and the Breaking Bad universe are just airing rights, created by other studios\n\nSo I'm honestly surprised a narrative grew that AMC buying them out would make them more aggressive again FuniRoll and the like.",
                            "score": 2,
                            "author": "Awkward_Silence-"
                        },
                        {
                            "level": 2,
                            "comment": "Disney/Hulu and most of Netflix are definitely slower at releasing dubs than Sentai",
                            "score": 1,
                            "author": "TheHeinousMelvins"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For me it's only 1 dub episode a week right now. Just *Akiba Maid War* and nothing else. \n\nHere's hoping they announce new dubs soon.",
            "score": 1,
            "author": "272b"
        },
        {
            "level": 0,
            "comment": "Where is the mew mew new dub. :(",
            "score": 1,
            "author": "Bluebaronbbb"
        },
        {
            "level": 0,
            "comment": "The other worst thing about Sentai/Hidive is that nowadays, Sentai Filmworks only dub  isekai and action shows or maybe some other genre like fanservice like Vermeil and Call of the Night or some unique anime like Kongming and Urusei Yatsura (2022).\n\nI'm glad that some of the shows i liked is finally get dubbed, however the problem is that it seems Sentai/HIDIVE are not dubbing any \"*PURE*\" romance, shoujo and slice of life ( or Cute girls doing cute things genre ) anime like **When Ayumu Makes His Move, Endo &amp; Kobayashi Live, Bibliophile Princess and Kubo won't let me be invisible** and more, once sentai announce their monthly home release, i'm pretty sure that most anime that not get DUBCAST or get a backlog dub by Sentai will be sub only and had no chance of getting dub.\n\nIn the upcoming spring season, most of the anime they got are non action or isekai and i'm not sure if they will dub it or not no matter how good or popular they are\n\n* OSHI NO KO\n* The Dangers in My Heart\n* Otaku Elf\n* Insomniacs After School\n* alice gear aegis Expansion\n* TOO CUTE CRISIS",
            "score": -1,
            "author": "farhanganteng"
        }
    ]
}