{
    "id": "1222gen",
    "score": 63,
    "title": "Welcome to Demon School! Iruma-kun - Season 3, Episode 21 (FINALE) - Dub Available Now on Crunchyroll!",
    "author": "MarvelsGrantMan136",
    "date": 1679785272.0,
    "url": "https://www.reddit.com/r/animedubs/comments/1222gen",
    "media_urls": [],
    "other_urls": [
        "https://www.crunchyroll.com/series/G6NVG970Y/welcome-to-demon-school-iruma-kun)!"
    ],
    "postText": "**Welcome to Demon School! Iruma-kun**\n\n* **Season 3, Episode 21 (FINALE) - \"Words for My Friends\"**\n\nDub Available Now on [Crunchyroll](https://www.crunchyroll.com/series/G6NVG970Y/welcome-to-demon-school-iruma-kun)!",
    "comments": [
        {
            "level": 0,
            "comment": "Oh what, I didn’t know it was the finale already! I was kinda hoping for a 24 episode season so that’s too bad since it’s my favorite feel good show of the season. \n\nHopefully we get a season 4. I really wanna see the music festival arc and more cute Ameri x Iruma moments.",
            "score": 16,
            "author": "Darwin343",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe season 4 has been approved, I think it was stated in the manga a couple of months ago with more information coming closer to release",
                    "score": 6,
                    "author": "Cardenjs"
                },
                {
                    "level": 1,
                    "comment": "Please mark spoiler",
                    "score": -8,
                    "author": "fightin_blue_hens",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's no need. Just saying the name of a certain arc really isn't a spoiler in it of itself.",
                            "score": 12,
                            "author": "awakening_knight_414",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And they already said what the next event would be in the show.",
                                    "score": 11,
                                    "author": "Jtsdtess",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that’s how I know about it since I haven’t read the manga yet.",
                                            "score": 6,
                                            "author": "Darwin343"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's one show off Bang Zoom's load, hopefully In/Spectre S2 starts soon enough.",
            "score": 10,
            "author": "drawricks"
        },
        {
            "level": 0,
            "comment": "This was a pretty feel good last episode. Other than a few good episodes, this season was pretty weak imo. The festival arc dragged on a little too slowly plus not enough Ameri episodes. The show is better when she’s involved.",
            "score": 6,
            "author": "Curt_ThaFlirt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally agree about there being not enough Ameri this season. She’s best girl after all haha. \n\nI still enjoyed this season but I don’t think it was anywhere near as good as season 2. Though, in fairness, it’s hard to top a season that had “Evil” Iruma and all those adorable Ameri and Iruma moments. Hopefully, we get all that and more next season (crossing my fingers that there is a next).",
                    "score": 6,
                    "author": "Darwin343",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She is and it’s not debatable. And you make a good point about S2. You reminded me how good it was.",
                            "score": 5,
                            "author": "Curt_ThaFlirt"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Binging time",
            "score": 5,
            "author": "Kemoy79"
        },
        {
            "level": 0,
            "comment": "Thank you so much to Jalen K Cassell, Mami Okada and the whole cast and crew for an excellent job this season. Also, Thank You so much to the folks at Bang Zoom for dubbing this Precious show",
            "score": 3,
            "author": "ButterflySilver9154"
        },
        {
            "level": 0,
            "comment": "Adored this season. Loved the finale when AzzAzz got a one up on Clara, the main three spending happy times together, the return of Milf AzzAzz, a touching scene, and finally an intro to purson!\n\nThis was such a treat that i loved spending my weekends with. I always have the most fun with this show. Loved this season too. Loved the new outfits, new personas, and that sense of accomplishment too. \n\nS4 cant come soon enough. Hopefully it gets greenlit for another. I know Jalen Cassell and the dub team have the blastiest of times recording for it.",
            "score": 3,
            "author": "Chun-Li_Forever",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; the return of Milf AzzAzz\n\nIt's always a joy when Cristina Vee shows up",
                    "score": 6,
                    "author": "eddmario"
                },
                {
                    "level": 1,
                    "comment": "Alice’s mom is definitely an S-tier anime milf.",
                    "score": 3,
                    "author": "Darwin343"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cried during Iruma’s speech to Az &amp; Clara. Thought I wasn’t gonna cry this season but oh well. Had this season as an 8/10 but moved it to a 9/10 after this episode.",
            "score": 2,
            "author": "[deleted]"
        }
    ]
}