{
    "id": "123yhnw",
    "score": 63,
    "title": "VINLAND SAGA - Season 2, Episode 10 - Dub Available Now on Crunchyroll!",
    "author": "MarvelsGrantMan136",
    "date": 1679947241.0,
    "url": "https://www.reddit.com/r/animedubs/comments/123yhnw",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/123yhnw/vinland_saga_season_2_episode_10_dub_available/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/watch/GK9U3X8M1/slave)",
        "https://www.netflix.com/title/81249833)"
    ],
    "postText": "**VINLAND SAGA**\n\n* **Season 2, Episode 10 - \"The Cursed Head\"**\n\n[Dub Available Now on Crunchyroll!](https://www.crunchyroll.com/watch/GK9U3X8M1/slave)\n\n[NETFLIX DUB](https://www.netflix.com/title/81249833) **- Episodes 1-9 Are Available Now**",
    "comments": [
        {
            "level": 0,
            "comment": "I admit, I wasn't a fan of Luis Galindo's Sweyn in Sentai's S1 (Jamieson Price from Netflix blew him out of the water) but I guess that's just another case of the actor being killed by the directing because he did a damn fine job here. I'll still probably end up preferring Netflix's take on Sweyn when they eventually cover this part (I just love Price's voice), but still, that was a solid comeback. And hey, Christopher Guerrero as Wulf! Solid ass choice.",
            "score": 5,
            "author": "Lord_Guyis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, neither was I. Luis's S1 performance lacked that authoritative punch that Jamieson's had. He sounded tired and disconnected in most scenes I remember from then. I was pleasantly surprised how well he did here. That sinister tone of voice and evil laugh at the end in Canute's quarters were REALLY well done, imo.",
                    "score": 3,
                    "author": "Gyeseongyeon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good episode. I understand Thorfinn being unsure of finally going back home after all this time, but I hope he does. It’s crazy to see how much he’s changed to get him to this point now. I’m not sure who’s voicing King Sweyn if it’s still Luis Galindo or not, but they did a great job with those scenes with Canute. Also I hadn’t seen this brought up before, but I really appreciate them getting Jason Douglas back to voice the narrator.",
            "score": 3,
            "author": "WingsofLegends"
        },
        {
            "level": 0,
            "comment": "I don’t see episode 9 dubbed on Netflix, is there any word on when they come out?",
            "score": 2,
            "author": "Noble_Auditore",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know if they have a specific scheduled release or not.",
                    "score": 3,
                    "author": "WingsofLegends"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it just me cause episode 9 of the Netflix dub isn’t showing up for me and I just checked like 30 minutes ago the last episode that’s dubbed is episode 8",
            "score": 2,
            "author": "Guishmonster"
        },
        {
            "level": 0,
            "comment": "Wrong update on Netflix part Ep 9 dub isn't available yet.",
            "score": 2,
            "author": "pratyushpati11"
        },
        {
            "level": 0,
            "comment": "Hey fellas, I really hate to be that guy to drop in bad news, but if you guys thought Mike Haimoto’s Situation was Bad, We got another VA Exposed, like Last week, looks like Olmar’s VA Anthony DiMascio is really screwed. \n[Source](https://mobile.twitter.com/OrigamiSpiller/status/1637921978119061504)",
            "score": 5,
            "author": "SatisfactionFalse641",
            "replies": [
                {
                    "level": 1,
                    "comment": "CR is just getting screwed left and right. The situation is getting worse for them.",
                    "score": 5,
                    "author": "arkhamtheknight"
                },
                {
                    "level": 1,
                    "comment": "Turns out this show having two dub versions was the right move after all",
                    "score": 5,
                    "author": "NLP19"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I've already jumped ship to the Netflix dub for the rest of the run. It's getting super ridiculous with this.",
                    "score": 6,
                    "author": "Chun-Li_Forever"
                },
                {
                    "level": 1,
                    "comment": "Have they been removed from anything already?",
                    "score": 2,
                    "author": "Bluebaronbbb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, I know for sure that Anthony's character in Bluelock won't have any more lines in the last 2 episodes (which aren't dubbed yet) at least. They'll probably replace him in the Blu-ray release.\n\nSpeaking of which, it's too bad that Love After World Domination was already released for home video, because that means it's too late to replace him there…",
                            "score": 3,
                            "author": "awakening_knight_414"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate coming to these threads every single week and seeing the exact same comments repeated each time that have nothing to do with the episode's contents. It's always something about how 'X voice actor did Y' and 'when is the Netflix version coming out?'\n\nThis is the best show of the season, why can't we talk more about what's actually happening in it?",
            "score": 3,
            "author": "ReinhardLoen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably because the Netflix version is just the other dubbed version of this and people just wanna know when that one will be available. Nothing wrong with people wanting to know when the version they prefer will be on.",
                    "score": 7,
                    "author": "Competitive-Ad2334"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact that CR has remained silent or hasn't taken action on Mike is just outright ridiculous. Unless there's an update about him that's brought up, perhaps they'll let him finish his reprisal as Thorfinn until the end, then he'll quietly be let go. I'm not sure if Sentai or Sound Cadence have cut ties with him yet but I sure damn hope he will not be getting any voice acting or directing roles ever again.",
            "score": -1,
            "author": "drawricks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmm I think something legal may be involved bc he was pulled for one episode right after the accusation hit the internet and was back after one week. Maybe he threatened to sue for breaking contract or something (though I would imagine that there are morality clauses in these contracts). But that's just guessing.",
                    "score": 3,
                    "author": "Sturdevant"
                }
            ]
        }
    ]
}