{
    "id": "125tx9e",
    "score": 50,
    "title": "Urusei Yatsura - Episode 5 - Dub Available Now on HIDIVE!",
    "author": "MarvelsGrantMan136",
    "date": 1680109345.0,
    "url": "https://www.reddit.com/r/animedubs/comments/125tx9e",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/125tx9e/urusei_yatsura_episode_5_dub_available_now_on/"
    ],
    "other_urls": [
        "https://www.hidive.com/tv/urusei-yatsura)"
    ],
    "postText": "**Urusei Yatsura**\n\n* **Episode 5**\n\n[Dub Available Now on HIDIVE!](https://www.hidive.com/tv/urusei-yatsura)\n\n\\---\n\nCast:\n\n* Lum - Jade Kelly\n* Ataru - Nathan Wilson\n* Shinobu - Cat Thomas\n* Mendo - Jack Stansbury\n* Sakura - Brianna Roberts\n* Cherry - John Swasey\n* ADR Director - Shannon Reed\n\n&gt;Chosen as humanity’s representative in a duel against invading aliens, the womanizing Ataru faces off against the alien princess Lum — and the conflict follows him home when Lum invades both planet Earth AND the reluctant Ataru’s love life!",
    "comments": [
        {
            "level": 0,
            "comment": "More eps where Ataru gets the shit beat out of him hilariously please! Had a snortfest with Lum being \"Oh how sweet! My darling took a punch from himself for me! I love you!\"\n\nAnd eitehr Ataru is dumb or is just so delusional for affection. Any love letter sent to him that's not from Lum is already a sign of a fake. Still, Ataru's ass better appreciate Lum a little more, being the only girl who falls for him. That 10K he got from Mendo, better treat Ms. Lum to somethinig REALY nice.",
            "score": 7,
            "author": "Chun-Li_Forever",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Still, Ataru's ass better appreciate Lum a little more, being the only girl who falls for him.\n\nDude has a hot space alien chick with super powers following him around who seems to love him no matter what he does, including explicitly telling her to fuck off and leave him alone, and for seemingly no reason at all hates her.\n\nI wish I was so lucky as to be in his situation lol, he's ungrateful as fuck.",
                    "score": 4,
                    "author": "jazir5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can’t force someone to love you though. If he doesn’t, he doesn’t.",
                            "score": 1,
                            "author": "SarcasmProvider76",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True, but it does seem like Ataru is falling for her slowly as he starts to give her a chance, as we saw in the end of this episode.",
                                    "score": 2,
                                    "author": "jazir5"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hurray for Sakura becoming the school nurse. Also even Ataru has limits to his rude facade, as seen by the sweet ending of the episode.",
            "score": 4,
            "author": "Shadowmist909"
        }
    ]
}