{
    "id": "125twlc",
    "score": 115,
    "title": "Tomo-chan Is a Girl! - Episode 13 (FINALE) - Dub Available Now on Crunchyroll !",
    "author": "jamiex304",
    "date": 1680109307.0,
    "url": "https://www.reddit.com/r/animedubs/comments/125twlc",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/125twlc/tomochan_is_a_girl_episode_13_finale_dub/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/series/G0XHWM5Q4/tomo-chan-is-a-girl)"
    ],
    "postText": "***Reminder***: *Please do not discuss plot points not yet seen in the dub version of the show without warning and use of the spoiler tag.*\n\n**Tomo-chan Is a Girl! - Episode 13 / 13 (FINALE)**\n\n[**Dub Available Now on Crunchyroll**](https://www.crunchyroll.com/series/G0XHWM5Q4/tomo-chan-is-a-girl)\n\n**English Crew:**\n\n* ADR Director - Caitlin Glass\n* ADR Scripter Writer - Leah Clark\n* Engineer - Helena Walstrom\n\n**English Cast:**\n\n* Tomo Aizawa voiced by Lexi Nieto\n* Junichiro Kubota voiced by Ricco Fajardo\n* Misuzu Gundo voiced by Jād Saxton\n* Carol Olston voiced by Sally Amaki (Sub &amp; Dub)\n* Tatsumi Tanabe voiced by Christopher Llewyn Ramirez\n* Kosuke Misaki voiced by Ciarán Strange\n* Ogawa voiced by Natalie Hoover\n* Mifune voiced by Marisa Duran\n* Goro &amp; Akemi voiced by Cris George &amp; Luci Christian",
    "comments": [
        {
            "level": 0,
            "comment": "Incredible ending to a great romcom, seeing Junichiro and Tomo finally be happy together as a couple is just really delightful. That kiss made me stand up from my seat, cheer and put a huge smile on my face. Just really amazing to see. I absolutely think this is a great contender for romance of the year.\n\nCast was fantastic all throughout, I know this is Lexi Nieto's first big role but she really did so well as Tomo, and I know how much this role means to her, so she deserves so much praise for doing a character so much justice the same way Rie Takahashi did. Ricco was pretty good as Jun too, as well as Jad Saxton as Misuzu (best girl!). We also gotta give a lot of credit to Sally Amaki for flawlessly playing our sweet cotton candy airhead Carol in both the sub **AND** dub, even flying to Crunchyroll's studio in Texas where she gave it her all. A big thanks to Caitlin Glass for directing this wonderful series.",
            "score": 25,
            "author": "drawricks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amaki is just an incredible talent, I want to hear more from her (both sub and dub) in the future",
                    "score": 1,
                    "author": "QueenHistoria1990"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great, great show. I echo my thoughts from last week's ep post when I thought that was the finale. This ep was just as satisfying, especially the last kiss. Felt like we were waiting a long time for this. I feel filled. Amazing work and surprised from everyone.",
            "score": 12,
            "author": "Chun-Li_Forever"
        },
        {
            "level": 0,
            "comment": "Thank you so much to Caitlin Glass and the whole cast and crew for an excellent job with this series",
            "score": 9,
            "author": "ButterflySilver9154"
        },
        {
            "level": 0,
            "comment": "And this wraps our First Dub of 2023. Truly a Beautiful Whirlwind this Anime has been, Now with all episodes released, time to Binge all of it.",
            "score": 25,
            "author": "SatisfactionFalse641"
        },
        {
            "level": 0,
            "comment": "Great final episode. Great cast. Great show overall. Loved it! \n\nA top tier RomCom that I’d recommend anybody to try. It’s definitely made it into my favorites. Easy contender for Best Romance awards.",
            "score": 9,
            "author": "Curt_ThaFlirt"
        },
        {
            "level": 0,
            "comment": "\"This isn't some sappy romance!\"  \n\nGod I love it when anime make jokes like this.",
            "score": 8,
            "author": "eddmario"
        },
        {
            "level": 0,
            "comment": "This show went from \"meh, I'll watch it if I've got nothing else to do\" to top contender for AOTY (for me at least). The English was dub was fantastic and the show itself was excellent every single week. I'm gonna miss these characters very much.",
            "score": 5,
            "author": "joeyvalentino"
        },
        {
            "level": 0,
            "comment": "First anime of the season completed and, for me, one of the best this season. The comedy was on point in every episode, and the romance was also good. The best part for me were the characters and the amount of screen time each of them had. Jun's character development/background was very good in this episode, specially Minute 9 when he talks with Tomo and 19 when he fights.\n\nIMO the best episode was the finale, with very good animation, comedy, and romance.\n\nFor me, this anime is about an 8.5, or that is what I would have said halfway through the episode, but the last minutes were AMAZING, so I'll leave it at 9 in my books.\n\nPD: Tomo best girl of the season for me.",
            "score": 3,
            "author": "MakotoGoku24"
        },
        {
            "level": 0,
            "comment": "Insert the Homelander “It was perfect” reaction. This show stole the winter season for me. It’s easily a 10/10 in my book, immediately in my top rom coms. If they made a second season for the rest of the source material that would be amazing but they wrapped it up so well that if this was the end, I wouldn’t feel like we’re missing out. Whole cast did such a great job but Sally Amaki absolutely stole the show as Carol.",
            "score": 5,
            "author": "RJPay"
        },
        {
            "level": 0,
            "comment": "As a manga reader I always heard Jad's voice for Misuzu, so for that to actualy happen in the anime was just awesome, and she killed it, but the stand out for me was Sally Amaki as Carol. With her performance It felt like Carol was ripped right out of the manga. I loved it in both the dub and sub. I really hope she pops up in more dubs in the future.",
            "score": 4,
            "author": "Vellosi"
        },
        {
            "level": 0,
            "comment": "\"Oh my God, he's obsessed with it though.\" was probably the funniest delivery of this episode.\n\nAn enjoyable show. Tomo wasn't a bad character, but what really made it entertaining was evil Gundou and the dumb blonde.",
            "score": 3,
            "author": "SoundOf1HandClapping"
        },
        {
            "level": 0,
            "comment": "One of the real \"surprises\" of the season comes to an end =/ --- Looking forward to watching this later.  Sad to see it go.  Especially since the chances of a 2nd season are pretty mixed.",
            "score": 7,
            "author": "mylastdream15",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the chances are rather low since the Anime adapted the entire Manga and while some contact did get skipped, it wasn't enough to make another Season like with Horimiya.",
                    "score": 15,
                    "author": "Slayerzilla54",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;an entirely new Season like with Horimiya.\n\nCorrection: It's not a new season, they're just going to adapt stuff from the manga that were skipped in the anime.",
                            "score": 5,
                            "author": "drawricks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, \"entirely new\" was the wrong choice of wording.",
                                    "score": 1,
                                    "author": "Slayerzilla54"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, it's not that optimistic.",
                            "score": 2,
                            "author": "mylastdream15"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time To Binge It Finally.",
            "score": 2,
            "author": "Clash__Mine"
        },
        {
            "level": 0,
            "comment": "TELEPATHY!!! TE-TE-TELEPATHY!!! TELEPATHYYYYYY!!!!!💪🏾🗣️🕺🏾\n\nAh yea the end of one of my favorite romcoms. It’s been a joy watching this show from Mizuzu Best girl, to Carol’s antics and Tomo and Jin’s lovers quarrel😂😭. So sad to see this end. That fight with Jun and Tomo’s dad was awesome as was the kiss at the end of the episode. The studio adapting this did a great job on the show fr. Also that movie theater scene was funny as hell.\n\nAnother thing, the dub for this was fire, as per usual with CR’s in-house dubs. Jax Saxton and Lexi Nieto were definitely my highlights with every dub episode. The script was excellent as well and funny as hell. Shoutout to the entire dub cast and crew for this, they did a fabulous job so hats off to them. All in all, this show was great and imma miss watching it every week.",
            "score": 2,
            "author": "tykroma94"
        },
        {
            "level": 0,
            "comment": "That kiss was perfect. It was just the way it needed to be between the two. This episode was surprisingly maybe the funniest episode of the series. If I had one direct gripe about it, I wish Misaki was more involved. We see that last shot of the five of them together, but Misaki always seemed like he was never really around. Except the little arc he had that involved Carol anyway.",
            "score": 2,
            "author": "MegaAltarianite"
        },
        {
            "level": 0,
            "comment": "This is how it ends?!?!?!",
            "score": 1,
            "author": "ConfidentPrint7728"
        },
        {
            "level": 0,
            "comment": "To people who watched both, How does the Dub compared to sub, which one would you recommend I watch?",
            "score": 1,
            "author": "Enough_Forever_"
        },
        {
            "level": 0,
            "comment": "Fun show! All I knew of it was the color 4komas on the manga subreddit.\n\nWhat i’ll miss most will be the simul dub. That was a great experience! Was Fruits Basket the last time that happened?",
            "score": 1,
            "author": "Throwaway021614"
        }
    ]
}