{
    "id": "128jl9t",
    "score": 256,
    "title": "‘The Quintessential Quintuplets’ New Anime Announced",
    "author": "MarvelsGrantMan136",
    "date": 1680348725.0,
    "url": "https://www.reddit.com/r/animedubs/comments/128jl9t",
    "media_urls": [
        "https://i.redd.it/b83e7lahvara1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I still haven't been able to watch the goddamn movie yet and they are announcing new stuff.",
            "score": 29,
            "author": "Adimus_Prime",
            "replies": [
                {
                    "level": 1,
                    "comment": "For real, I mean I’m excited about new stuff but let’s talk about adding the movie already",
                    "score": 16,
                    "author": "benisavillain13"
                },
                {
                    "level": 1,
                    "comment": "Been waiting so long and looking for info about dub release",
                    "score": 5,
                    "author": "ArkAon1248"
                },
                {
                    "level": 1,
                    "comment": "Is the movie a summary of the first season or is it new canon material? (I have only seen the current season)",
                    "score": 1,
                    "author": "Inside-Lychee1037",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's the Canon ending to the series.",
                            "score": 2,
                            "author": "Adimus_Prime"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The new anime project will adapt manga chapters that the anime skipped.\n\nThey already had their April Fools joke earlier today, and this was announced during a special event for the series.\n\n[Source](https://twitter.com/5hanayome_anime/status/1642120165193285633?s=46&amp;t=PujVqeixjk8X8lKJmxOhXg)",
            "score": 41,
            "author": "MarvelsGrantMan136"
        },
        {
            "level": 0,
            "comment": "Is this going to be a new trend where studios go back to shows and adapt shit they missed? Maybe Promised Neverland can get the same treatment",
            "score": 40,
            "author": "NerdyisHere",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's not a romance show, so don't get your hopes up lol. Besides, that shit show had the balls to skip right to the end, so there really is no point in trying now.",
                    "score": 20,
                    "author": "awakening_knight_414",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean blue exorcist did it.",
                            "score": 4,
                            "author": "niceidot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Isn't that a totally different case? The first half of season 1 was canon, the second half was not, then it ignored the second half entirely and jumped straight back into the canon timeline with season 2? It didn't necessarily skip any important arcs, unlike TPN, right? Also, I think the new project is a reboot.",
                                    "score": 8,
                                    "author": "awakening_knight_414"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It kinds helps that they had the authour there doing everything in his power to tank that shit 😂",
                            "score": 3,
                            "author": "yolo-yoshi"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Idk, Horimiya is doing it too",
                    "score": 5,
                    "author": "gogus2003",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait,  really?",
                            "score": 1,
                            "author": "Nihilismisanthrope",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, and they've got probably 10 episodes worth of cut content",
                                    "score": 5,
                                    "author": "gogus2003",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From the manga maybe. The webcomic has plenty more.",
                                            "score": 0,
                                            "author": "Nihilismisanthrope",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "True that",
                                                    "score": 2,
                                                    "author": "gogus2003"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I could go for some series remakes.",
                    "score": 3,
                    "author": "Takahemae"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was kinda hoping they would adapt an alternate route. Not sure the show will be quite the same now that we know who won.",
            "score": 17,
            "author": "GoldenTimeWatcher",
            "replies": [
                {
                    "level": 1,
                    "comment": "I watched it again after I watched the movie and I might have actually enjoyed it a little more the 2nd time through. There's a surprising number of subtle things you can suddenly see that kind of make the whole series even better.",
                    "score": 3,
                    "author": "notreal149"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I may be late but has the dubbed version of the movie been released. Last I saw was that it was in cinemas in December but I haven't seen a stream for it.",
            "score": 5,
            "author": "saltyononlyfans",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope.\n\nCant even legally stream the subbed version yet.",
                    "score": 4,
                    "author": "Draconic_Flames1260"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So it's basically season 2.5?",
            "score": 12,
            "author": "IntelligentBudget142",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hopefully, because then I can just hold off on watching the movie and it will actually still be in chronological order for me if I watch the movie after this new season, lol.  If its like 1.5 or something that would be real dumb.",
                    "score": 1,
                    "author": "rblythe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It won't be chronological unless they do anime only stuff. There's cut stuff from s1 and s2, they even add stuff that happened mid-way through s2 (in the manga that they cut) into the movie. It'll have to be episodes jumping through the timeline of both seasons.",
                            "score": 2,
                            "author": "Ghostlymagi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean, I'm excited, but between this and Horimiya, why not just adapt everything to begin with?",
            "score": 16,
            "author": "Gergnant",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think there would be pacing issues for some anime if the anime adapted EVERYTHING in the order of the manga. Like there would have to be extra episodes (awesome for us, terrible for the studio and budget) and awkward endings for episodes. Plus things would sometimes go so slow depending on the manga. Especially if it’s something like the Quintessential Quintuplets manga that went on long, random tangents sometimes I hear",
                    "score": 4,
                    "author": "sock_nsych",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like Covid screwed the 2nd season and it felt like itnprbabky should've been 24 episodes considering the amount of manga chapters it.blazed though",
                            "score": 3,
                            "author": "Joshelplex2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah fair",
                                    "score": 2,
                                    "author": "sock_nsych"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They never would have expected that the show will be that popular, so they are now simply adapting remaining content to squeeze more money out of viewers",
                    "score": 2,
                    "author": "MaleficentAd655"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know whether to trust this announcement, given what day it is. 😂 Quintuplets is one of my favorite romcoms though, so I would be happy if it's true. Depending on when it's released, I may get to watch it before the movie.",
            "score": 3,
            "author": "Heda-of-Aincrad"
        },
        {
            "level": 0,
            "comment": "still waiting on the dubbed movie crunchy..",
            "score": 3,
            "author": "Scotty10711"
        },
        {
            "level": 0,
            "comment": "If they're gonna do this I really wish they'd have made the movie into a full season. I liked it (except I think he made the wrong choice) but it felt so rushed. But also, I will absolutely be very excited to watch this new season anyway.",
            "score": 3,
            "author": "notreal149"
        },
        {
            "level": 0,
            "comment": "Is the movie dubbed?",
            "score": 2,
            "author": "DireSickFish",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was dubbed but no, it's not available to stream yet.",
                    "score": 5,
                    "author": "awakening_knight_414",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crime",
                            "score": 4,
                            "author": "DireSickFish"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nope as you cant legally watch it anywhere yet.\n\nIt mightve been dubbed in theaters but not streaming.",
                    "score": 2,
                    "author": "Draconic_Flames1260",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck",
                            "score": 1,
                            "author": "DireSickFish"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would probably watch this then the movie",
            "score": 2,
            "author": "lastdyingbreed_01"
        },
        {
            "level": 0,
            "comment": "Please Japan, for the love of god, give Fruits Basket the same treatment.\n\nEDIT: Again with the downvotes? What's wrong with you people?",
            "score": -3,
            "author": "awakening_knight_414",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconded",
                    "score": 5,
                    "author": "noboday009"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So if I haven’t seen the movie should wait watch this then the movie?",
            "score": 1,
            "author": "mrj9"
        },
        {
            "level": 0,
            "comment": "So no news as to when I can purchase the movie dub or stream it online?",
            "score": 1,
            "author": "KB_Shaw03"
        },
        {
            "level": 0,
            "comment": "So this series is getting a complete adaptation then? Nice.",
            "score": 1,
            "author": "272b"
        },
        {
            "level": 0,
            "comment": "When will releaseThe quintessential quintuplets movie dub",
            "score": 1,
            "author": "HemantSingh9339",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is everyone know about the dub release date for the movie",
                    "score": 1,
                    "author": "HemantSingh9339"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kyu Kich rahe hai ye iss anime ko aur 😑",
            "score": 0,
            "author": "atul_senpai"
        }
    ]
}