{
    "id": "12b3e98",
    "score": 37,
    "title": "Is Majikoi Dub good?",
    "author": "Technical-Put7997",
    "date": 1680567905.0,
    "url": "https://www.reddit.com/r/animedubs/comments/12b3e98",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know it has Harem king Josh Grelle as MC. I watched the sub but I’m considering rewatching in dub",
    "comments": [
        {
            "level": 0,
            "comment": "Yes. It has Harem King Josh Grelle. It is good. \n\nAlso Carli Mosier as Momoyo.",
            "score": 11,
            "author": "TheHeinousMelvins"
        },
        {
            "level": 0,
            "comment": "One of my favorite Dubs of all time, you get to hear Josh And Brittany read lines from a hentai game, you see their temple totem is a phallicly shaped mushroom that the begin to eat seductively before biting off violently. The Mc (Grelle) Spends 5-7 minutes explaining why it’s historically accurate and acceptable for him to see girls naked.\n\nAll I’m saying is that it’s a national treasure.\n\nFull title is Majikoi Oh! Samurai Girls \n\nWritten by Takahiro who wrote Akame Ga Kill which is hard to believe. Not the horny stuff, that’s his bread and butter but the much more lighthearted tone.",
            "score": 9,
            "author": "No_Discussion3053",
            "replies": [
                {
                    "level": 1,
                    "comment": "Majikoi - Oh! Samurai Girls",
                    "score": 5,
                    "author": "TheHeinousMelvins"
                },
                {
                    "level": 1,
                    "comment": "yea this dub is reallly reallly good",
                    "score": 3,
                    "author": "fantaz1986"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it is good",
            "score": 4,
            "author": "EntertainmentKind461"
        },
        {
            "level": 0,
            "comment": "I honestly watched this way before I seen a playthrough of visual novel version",
            "score": 4,
            "author": "Puzzled_Boss_3503"
        },
        {
            "level": 0,
            "comment": "I thought it was pretty good",
            "score": 3,
            "author": "BigL90"
        },
        {
            "level": 0,
            "comment": "Still waiting for it to come out of HiDive purgatory",
            "score": 3,
            "author": "Curt_ThaFlirt"
        },
        {
            "level": 0,
            "comment": "The Majikoi dub is good due to the casting, and the comedic timing they pull off in the show is good. It's true that Josh Grelle, Brittney Karbowski, and Carli Mosier are up there. But the show also has Blake Shepard, Emily Neves, Tiffany Grant, Greg Ayers, David Matranga, Margaret McDonald, and Shelley Calene-Black, among a few others.\n\nSo if you find the time to watch it dub, you'll have a chance to like it.",
            "score": 3,
            "author": "Dominion-Star-92"
        },
        {
            "level": 0,
            "comment": "Is it available to stream anywhere? I don't see it on CR or HiDive, and Anime Planet doesn't even have it listed as being dubbed, so I'd never heard of it!",
            "score": 1,
            "author": "notreal149",
            "replies": [
                {
                    "level": 1,
                    "comment": "Normally on HiDive. Probably out of rotation again (happened before and came back).",
                    "score": 4,
                    "author": "TheHeinousMelvins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks!",
                            "score": 1,
                            "author": "notreal149"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never heard of this show. When I googled it I got a bunch of game advertisements. The boy (I think) with the bandana reminds me of Hayato from Katekyo Hitman Reborn. Don’t ask me why. Is the show any good? What’s the premise?",
            "score": 1,
            "author": "steelersrg8",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s based off of a Visual Novel video game of the same name. Essentially Yamato ( Grelle) is a student at Matial Arts High School that settle differences with giant military like battles involving the entire student body.\n\nIt does have a plot but it’s more Ecchi slice of life stuff. Yamato has a harem and they all come onto him fairly aggressively (Each in their own way). To his Credit Yamato knows they are in love with him, he just doesn’t return their feelings.",
                    "score": 2,
                    "author": "No_Discussion3053",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah ok thanks! Sounds interesting might check it out!",
                            "score": 1,
                            "author": "steelersrg8"
                        },
                        {
                            "level": 2,
                            "comment": "Except he has feelings for one.",
                            "score": 1,
                            "author": "TheHeinousMelvins"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s pretty good I haven’t watched in a long time so I’m not sure how to explain",
                    "score": 1,
                    "author": "Technical-Put7997"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The plot's somewhat incoherent at times. I think the actors are good. \n\nIf you are are looking for an ero gal game-turned-anime series, I think Shuffle did probably the best one.\n\nAlso the Tsuyo-kiss anime is actually funny, but I don't think it ever got dubbed.",
            "score": 1,
            "author": "WheelJack83",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Restore my post. I did no such thing.  I didn't direct to any illegal streams or downloads. I simply talked about some other anime shows. I didn't promote piracy or illegal promotion or piracy.\n\nScrew you automod. I did nothing wrong. This is BS.",
                            "score": 1,
                            "author": "WheelJack83"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's funny 🤣🤣 in a good way. \n\nI think if an anime has a lot of dirty jokes and innuendos, then a dub would suit it.",
            "score": 1,
            "author": "Solstus22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like Shimoneta",
                    "score": 2,
                    "author": "Technical-Put7997",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. 😂 Or maybe even panty and stocking but that's another level of dirty jokes.",
                            "score": 2,
                            "author": "Solstus22"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never heard it",
            "score": -4,
            "author": "helloiamaudrey"
        }
    ]
}