{
    "id": "12kzpjx",
    "score": 136,
    "title": "‘Hell's Paradise’ English Dub Reveals Cast &amp; Crew, Premieres April 15 on Crunchyroll",
    "author": "MarvelsGrantMan136",
    "date": 1681412549.0,
    "url": "https://www.reddit.com/r/animedubs/comments/12kzpjx",
    "media_urls": [
        "https://www.crunchyroll.com/anime-news/2023/04/13/hells-paradise-english-dub-reveals-cast-crew-release-date"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The dub premieres this Saturday!\n\nCast\n\n* Gabimaru voiced by Alejandro Saab\n\n* Sagiri voiced by Marisa Duran\n\n* Chobe voiced by Nazeeh Tarsha\n\n* Toma voiced by Matt Shipman\n\n* Yuruziha voiced by Jill Harris\n\n* Shion voiced by Reagan Murdock\n\n* Tenza voiced by Ben Balmaceda\n\n* Nurugai voiced by Cassie Ewulu \n\n* Senta voiced by Jordan Dash Cruz \n \nCrew:\n\n* ADR Director: Mike McFarland\n\n* ADR Engineer: Victor Acosta\n\n* ADR Script Writer: Katelyn Barr\n\nSynopsis:\n\n&gt;Gabimaru the Hollow is one of the most vicious assassins ever to come out of the ninja village of Iwagakure. He’s ruthlessly efficient, but a betrayal results in him being handed a death sentence. He has only one hope—in order to earn his freedom, he must travel to a long-hidden island and recover an elixir that will make the shogun immortal. Failure is not an option. On this island, heaven and hell are just a hair’s breadth away.",
            "score": 17,
            "author": "MarvelsGrantMan136"
        },
        {
            "level": 0,
            "comment": "just fell to my knees in a walmart",
            "score": 15,
            "author": "HagridPotter"
        },
        {
            "level": 0,
            "comment": "I've been seeing CR VAs hype about this, I'm going in this totally blind. But I'm excited to watch. Looks like it's gonna be fun.\n\nAlso Alejandro and Marisa as co leads just like with Horimiya again!!",
            "score": 22,
            "author": "Chun-Li_Forever",
            "replies": [
                {
                    "level": 1,
                    "comment": "And Horimiya is coming back",
                    "score": 7,
                    "author": "helloiamaudrey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "isnt it just stuff they missed in s1 thou? sadge but also not sadge. wish there was a real s2 lol.",
                            "score": 1,
                            "author": "rjc523",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t care, we’re getting more content",
                                    "score": 0,
                                    "author": "helloiamaudrey"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They can do platonic and romantic like Alejandro Saab and Anairis Quiñones in The Irregular at Magic High School, How a Realist Hero Rebuilt the Kingdom and Horimiya.",
                    "score": 2,
                    "author": "mojo72400"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit I didn’t think Alejandro Saab would get a new main lead role in a shonen anime. I’m hyped and with Mike McFarland directing this, I know it’s gonna be good💪🏾🔥.",
            "score": 7,
            "author": "tykroma94"
        },
        {
            "level": 0,
            "comment": "A big Shonen Jump property directed by Mike McFarland is a recipe for success. \n\nAlejandro Saab leading a gritty and violent action Shonen? Heck yes! \n\nI can definitely see Marisa Duran matching Yumiri Hanamori's vocal performance as Sagiri and it's just nice to have her in a lead role as a really cool lady. \n\nI'm not sure if this is Jill Hariss' first Rie Takahashi character, but I think she'll have a lot of fun as Yuzuriha. \n\nI'm curious who will voice Gabimaru's wife.",
            "score": 17,
            "author": "Frontier246",
            "replies": [
                {
                    "level": 1,
                    "comment": "I checked and it seems Harris and Takahashi voice the same characters in Million Arthur and Ranpo Kitan.",
                    "score": 5,
                    "author": "Penguinfox24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's cool!",
                            "score": 1,
                            "author": "Frontier246"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I definitely wouldn't have expected Alejandro as Gabimaru, but that will be cool to hear. One of my favorite modern manga. Hopefully the anime won't be rushed",
            "score": 6,
            "author": "mayekchris"
        },
        {
            "level": 0,
            "comment": "I wonder if Alejandro is back in Texas? He's been in a few Crunchy dubs the past few seasons.",
            "score": 6,
            "author": "SomethingOrOther13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah, him and his wife are still in LA. I think LA actors getting leads in TX dubs will hopefully continue to be a thing",
                    "score": 3,
                    "author": "mayekchris",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're bouncing back and forth but are based in Texas now due to cost-of-living IIRC.",
                            "score": 6,
                            "author": "WritingZanity"
                        },
                        {
                            "level": 2,
                            "comment": "Are you sure? [Hayden Daviau’s Twitter](https://twitter.com/haybalevoice?s=21&amp;t=tcMTzkwifnqQt6rCHNRarw) says they are in TX. And someone before in a different thread told me they did move back to TX sometime last year.",
                            "score": 4,
                            "author": "Charenzard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's interesting since usually if TX VAs move there they don't tend to move back",
                                    "score": 2,
                                    "author": "mayekchris"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What? That makes no sense. He and Hayden wouldn't be getting this much work now if they were still in LA.",
                            "score": 7,
                            "author": "awakening_knight_414"
                        },
                        {
                            "level": 2,
                            "comment": "One of my old college classmates that’s doing VA for funi/crunchyroll right now is actually getting ready to go to LA because she thinks it will help her land more VA roles. So it seems like the LA actors are still gonna be a thing.",
                            "score": 3,
                            "author": "Balmong7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Expected gabimaru to sound a little more innocent/youthful I hope the actor can pull off the lighter moments, I’m not familiar with him",
            "score": 7,
            "author": "blabka3",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I hope the actor can pull off the lighter moments\n\nOh, he can pull off the lighter moments, don't you worry about that.",
                    "score": 4,
                    "author": "Raebo007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like your confidence, got any recommendations of his prior work to check out?",
                            "score": 3,
                            "author": "blabka3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Both **Hell**'s Paradise and **Heaven**ly Delusion are airing in the anime same season with simultaneous dubs! What are the odds?",
            "score": 5,
            "author": "272b"
        },
        {
            "level": 0,
            "comment": "Mike McFarland-directed dub with an Alejandro Saab lead - I'm sold.\n\nPlus a great-looking supporting cast (love seeing Reagan Murdock &amp; Cassie Ewulu on here)",
            "score": 11,
            "author": "KitKat1721"
        },
        {
            "level": 0,
            "comment": "Mike McFarland absolutely slayed the Chainsaw Man dub, so I’m looking forward to this!",
            "score": 11,
            "author": "StrangeAdamska",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also the FMA:B dub, dude’s a veteran who knows his stuff!",
                    "score": 9,
                    "author": "Chemical_Cris"
                },
                {
                    "level": 1,
                    "comment": "He did amazing in front of the mic on OddTaxi",
                    "score": 8,
                    "author": "helloiamaudrey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Noice! Can't wait 👍",
            "score": 5,
            "author": "MasterAdventZero"
        },
        {
            "level": 0,
            "comment": "Finalllllly!!! I kept refreshing this page waiting for this announcement for 2 weeks now. This is my most anticipated anime.\nSo hype right now!",
            "score": 4,
            "author": "dreaming_state"
        },
        {
            "level": 0,
            "comment": "Realizes that Gabimaru and Sagiri have the same dub VAs as Horimiya: \"WHAT THE ACTUAL SHIT?!? WHAT!?!\"",
            "score": 4,
            "author": "Lumpy-Manager8580"
        },
        {
            "level": 0,
            "comment": "So, no LA actors this time. Kind of a letdown, but not really that surprising.\n\nBefore anyone downvotes me, it's fine either way, really. I was just hoping for more of the CSM treatment again.",
            "score": 14,
            "author": "awakening_knight_414",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I feel like Chainsaw Man just had way more hype around its adaptation and the team felt more of a need to go ‘all-out’ with that dub by allowing and auditioning remote VAs. Would’ve been really cool if they did it here though.",
                    "score": 10,
                    "author": "Charenzard"
                },
                {
                    "level": 1,
                    "comment": "Yea I was thinking CR was gonna this dub the Chainsaw Man treatment but I guess CR didn’t wanna let Mike McFarland go of this time around. One of the many reasons why this mandate sucks😭.",
                    "score": 2,
                    "author": "tykroma94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of my friends seen the 2 eps. Said it's looks promising. I was thinking of checking it out too.",
            "score": 2,
            "author": "larmanrando15"
        },
        {
            "level": 0,
            "comment": "Looks great! I can't wait 😁",
            "score": 2,
            "author": "Iceyflow"
        },
        {
            "level": 0,
            "comment": "Oh snap, nazeeh Tarsha plays chobe? Im pretty shocked after hearing him in revenger. I honestly thought that was Bryce papenbrook when watching",
            "score": 2,
            "author": "blabka3"
        },
        {
            "level": 0,
            "comment": "So will this come out on time? Is it just My Hero Academia dub that crunchyroll hates?",
            "score": 1,
            "author": "ViperDaimao"
        },
        {
            "level": 0,
            "comment": "I wonder who voices Yui. I'll be surprised at the same time not if it was Anairis Quiñones.",
            "score": 1,
            "author": "mojo72400"
        }
    ]
}