{
    "id": "12l9lg6",
    "score": 83,
    "title": "'Digimon Adventure' (2020) English Dub Available Now on Digital, Full Cast Revealed",
    "author": "MarvelsGrantMan136",
    "date": 1681425606.0,
    "url": "https://www.reddit.com/r/animedubs/comments/12l9lg6",
    "media_urls": [
        "https://www.microsoft.com/en-us/p/season-1/8d6kgwxzdvd4?activetab=pivot:overviewtab"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "It's not streaming yet, but all 67 episodes of the reboot are out now on Digital.\n\nStudiopolis handled the dub.\n\nCast:\n\n* Tai- Zeno Robinson\n* Matt- AJ Beckles\n* Sora- Cherami Leigh\n* Izzy- Anne Yatco\n* Mimi- Suzie Yeung\n* Joe- Daman Mills\n* TK- Corina Boettger\n* Kari Kamiya- Ryan Bartley\n* Agumon- Ben Diskin\n* Gabumon- Dave B. Mitchell\n* Biyomon- Tara Sands\n* Tentomon- Christopher Swindle\n* Palmon- Corina Boettger\n* Gomamon- Alex Cazares\n* Patamon- Lizzie Freeman\n* Gatomon- Erine Yvette",
            "score": 22,
            "author": "MarvelsGrantMan136",
            "replies": [
                {
                    "level": 1,
                    "comment": "any the old digimon cast? and how long was the old digimon show?",
                    "score": 5,
                    "author": "rjc523",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it's a completely new cast for the reboot.",
                            "score": 5,
                            "author": "SnowWarren"
                        },
                        {
                            "level": 2,
                            "comment": "a few from tri and kizuna dubs are in it, but as different characters than they were in tri/kizuna which is funny",
                            "score": 3,
                            "author": "Muur1234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey is there a way to watch it with out the Microsoft store",
                                    "score": 1,
                                    "author": "Beneficial-Egg-7536",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No",
                                            "score": 1,
                                            "author": "Muur1234",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Will it be release any where else soon \nCause I don't have Microsoft or an Xbox 😅",
                                                    "score": 1,
                                                    "author": "Beneficial-Egg-7536",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "your guess is as good as mine",
                                                            "score": 1,
                                                            "author": "Muur1234"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "https://en.m.wikipedia.org/wiki/List_of_Digimon_episodes_and_films\n\nPress on the section named Series Overview, it was pretty much nonstop from 1999 to 2003 and then there were 3yr gaps between series.",
                            "score": 2,
                            "author": "Agret"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kind of fitting that Cherami is voicing Sora, since she voiced Biyomon, Sora's partner Digimon, in *Tri.*  \n\nI'm also suprised they didn't bring back Kirk Thornton as Gabumon, since he's the only member of the original dub cast that still does dubbing, and he works with Crunchyroll a lot.",
                    "score": 6,
                    "author": "eddmario",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dubs of Crunchyroll? What do you referring to? In house or something else?\n\nBut yeah it’s shame even he didn’t return in reboot.",
                            "score": 3,
                            "author": "PsychologicalHelp564"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is the dub gonna be uncut or censored like the previous series",
                    "score": 2,
                    "author": "Player2LightWater",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes it is fully uncensored as Saban , the former licensor of Digimon s1-5 and fusion , is no longer in business last I recall",
                            "score": 2,
                            "author": "Gundamrevival9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok. That also means the human characters will go with their Japanese names, right? Along with retaining Japanese OSTs and no \"stupid dialogues\"",
                                    "score": -5,
                                    "author": "Player2LightWater",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just like The tri and last evolution films being pretty much uncut, duh . Majority of dubcasts nowadays are uncensored. Keep in mind this isn't on Saturday mornings and that means no strict TV FCC regulations lol",
                                            "score": 2,
                                            "author": "Gundamrevival9"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They will probably keep their names from the previous dub since they are iconic",
                                            "score": 2,
                                            "author": "Animefox92"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cast looks really promising (AJ as Matt, Suzie as Mimi, and Corina as TK in particular seem like great choices I didn't even think of) and for anyone annoyed with the Microsoft release method (I can't watch them either since I don't have a PC or Xbox, I totally get it), I imagine they'll do something similar to what they're doing with One Piece and put it on streaming at a later date.\n\nAnd thankfully because it's a new license, it won't be stuck on a \"meant to be dead by now\" service like Funi haha",
            "score": 8,
            "author": "KitKat1721"
        },
        {
            "level": 0,
            "comment": "[https://withthewill.net/threads/digimon-adventure-english-dub-is-out-all-of-it-on-microsoft-movies-tv-production-cast-dub-details.29396/](https://withthewill.net/threads/digimon-adventure-english-dub-is-out-all-of-it-on-microsoft-movies-tv-production-cast-dub-details.29396/)\n\nOMG, English covers of the Japanese openings and endings. I didn't think they'd do that!\n\nThe credits and logos are in English too!\n\nI will definitely check this out. Wish it was on Crunchyroll though instead of the Microsoft store, but this is what Toei did with Dragon Quest too.",
            "score": 7,
            "author": "SnowWarren",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; OMG, English covers of the Japanese openings and endings. I didn't think they'd do that!\n\nSounds like they're really going all out with the nostalgia",
                    "score": 2,
                    "author": "eddmario",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "if they reallly wanted to lean on nostalgia theyd go all into the cheesy 4kids dub style",
                            "score": 1,
                            "author": "Greedy-Camel-8345"
                        },
                        {
                            "level": 2,
                            "comment": "Nostalgia? The show's barely two years old.",
                            "score": 0,
                            "author": "SnowWarren",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm talking about the original series dub...",
                                    "score": 2,
                                    "author": "eddmario",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But these new songs have nothing to do with the original show/dub.",
                                            "score": 2,
                                            "author": "SnowWarren"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Op &amp;Ed for someone who needs \n\n[https://youtu.be/Ub1Lr7Xv7yo](https://youtu.be/Ub1Lr7Xv7yo)  \n[https://youtu.be/8cXdfTZJCZI](https://youtu.be/8cXdfTZJCZI)",
            "score": 5,
            "author": "DanUltraseven"
        },
        {
            "level": 0,
            "comment": "Oooh! Awesome group we got here! Love love love the cast. Looking forward to watching.",
            "score": 3,
            "author": "Chun-Li_Forever"
        },
        {
            "level": 0,
            "comment": "That's a pretty all star cast for our new Digidestined and their Digimon!",
            "score": 4,
            "author": "Frontier246"
        },
        {
            "level": 0,
            "comment": "That’s one heck of a cast!",
            "score": 3,
            "author": "mab0390"
        },
        {
            "level": 0,
            "comment": "Man… $170 bucks is a bit much… to say the least.",
            "score": 3,
            "author": "Jtsdtess",
            "replies": [
                {
                    "level": 1,
                    "comment": "What do you mean? Dubbing wise?",
                    "score": 1,
                    "author": "PsychologicalHelp564",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s 5 batches, at $34 a pop for HD video. That comes out to $170 to watch the whole thing.",
                            "score": 4,
                            "author": "Jtsdtess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ha, seems to be interesting price XD",
                                    "score": 1,
                                    "author": "PsychologicalHelp564"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A fine cast, on paper everyone seems like a good choice.    \n    \nI wonder if any of the older VAs will make appearances in smaller roles?",
            "score": 3,
            "author": "SomethingOrOther13",
            "replies": [
                {
                    "level": 1,
                    "comment": "couple from tri/kizuna have said theyre MOTW no one from 1999 yet",
                    "score": 1,
                    "author": "Muur1234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now that is a bit bizarre.",
                            "score": 1,
                            "author": "Bluebaronbbb"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting. They chose to go with a completely new cast, which I guess makes sense considering this is a reboot.\n\nAmusingly, some actors who were in Digimon Adventure tri. return but play different characters: Chermai previously played Biyomon but now plays Sora; Tara Sands played Kari but now plays Biyomon.\n\nI do wonder about the decision of using the Americanized names though (based on Marvel's cast list). I thought they would go the Shaman King route and move back to the original Japanese ones.",
            "score": 6,
            "author": "ReinhardLoen",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm assuming Toei just considers those names as the official US names from now on. I still want to know about the other digimon names.",
                    "score": 2,
                    "author": "Bluebaronbbb"
                },
                {
                    "level": 1,
                    "comment": "why a new cast? even if it is a reboot. wonder if they even asked old cast. i bet some would of returned imo and i think i heard some wanted to. and odd the tri movies cast voicing other chars. also was tri the same cast as old digimon cast?",
                    "score": 2,
                    "author": "rjc523",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same thing happened in the Japanese version, where a new cast was hired to voice the characters. Probably wanted to really sell this as a reboot. \n\nTri got back which ever ones they could, but had to recast ones that had moved on from VA since 2004. The only odd case was Doug Erholtz not returning as TK ( now voiced by JYB) but still voicing a new character in the movies.",
                            "score": 4,
                            "author": "Aizen10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At least it’s not as bad than say.. Berserk 2016 as they didn’t care original cast but recasted everyone.",
                                    "score": 2,
                                    "author": "PsychologicalHelp564"
                                },
                                {
                                    "level": 3,
                                    "comment": "i might be wrong but i think he was offered tk and turned it down and asked for a different role so got daigo",
                                    "score": 2,
                                    "author": "Muur1234",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, he said he'd return only if it wasn't as T.K.   \n\nKind of fitting that the character he voiced sort of liked like *02* T.K. but with black hair",
                                            "score": 1,
                                            "author": "eddmario",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "gotta wonder why, either he didnt think hed fit a 14 year old or just really hated playing tk",
                                                    "score": 2,
                                                    "author": "Muur1234",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is second hand. But I heard he isn't too fond of his performance of TK and thinks he was miscast. \n\nWhich I guess when you look at his roles since then, makes sense. Most of the time since then, if he plays a teenage character it's one that has more of a mature \"cool\" voice. \n\nThat being said. I would've been fine if they kept him on as TK and just had him use a different voice. Cuz it's not like most the recasts even tried to match their original VAs. Tara actually did a good impression of Lara as Kari. But Robbie as Joe, Johnny as TK, and Vic as Matt were all pretty drastically different.",
                                                            "score": 5,
                                                            "author": "Unknownsage"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And I'm not sure if it was a really good edited image or not, but apparently &gt;!the reboot version of Tai meets the version of himself from the original series!&lt;, so the recasting makes sense for that.",
                                    "score": 2,
                                    "author": "eddmario",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "not the version from 1999 anime but rather there was a manga chapter where 2020 tai meets manga tai",
                                            "score": 1,
                                            "author": "Muur1234"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why tho? Since Digimon never stopped the Americanization even after it stopped being the norm. Fusion and Tri still had American names for the characters.",
                    "score": 2,
                    "author": "Aizen10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can't comment on fusion, but for tri. it made sense to use the American names considering it was a direct continuation of the other series; you'd want to retain continuity. Even there though, while the old characters retain their names, the new characters all stuck to the same as the Japanese.\n\nJust basing it on the fact it's a reboot, I suspected they might try and use the Japanese names this time in an effort of trying to stay closer to the source material; similar to what Shaman King and I believe, Sailor Moon redub did.",
                            "score": 0,
                            "author": "ReinhardLoen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've heard they kind of do both. Taichi starts out being called Taichi in the first episode, but then says to Koishiro, \"Call me Tai\". So they're acknowledging the Japanese names before using the English ones. Don't know if its the same for all of them.",
                    "score": 1,
                    "author": "SnowWarren",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The same thing they did with Koushiro to Izzy.",
                            "score": 1,
                            "author": "nvenkatr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What does Toei have against streaming services? They keep doing this.",
            "score": 6,
            "author": "SarcasmProvider76",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's the point.  It's a lot harder to have it captured and uploaded of it's not on a streaming site.",
                    "score": 1,
                    "author": "bonesandbillyclubs"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "World Trigger and Dragon Quest: The Adventure of Dai have been the same way. Toei is the main distributor of these shows, I don’t think Crunchyroll is the one specifically choosing to sell the dubs of Toei show instead of streaming them. The Dragon Ball Super and One Piece dubs have similar abnormal streaming releases. I’m pretty sure Toei control their own series and Crunchyroll is just the sub-distributor.",
                            "score": 6,
                            "author": "WingsofLegends"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are they thinking making us pay over 150 bucks I’m sorry they need to put it on a streaming service\n\nCast looks awesome though, cherami and Suzie let’s gooooo",
            "score": 2,
            "author": "Kollie79"
        },
        {
            "level": 0,
            "comment": "T.K. and Palmon are not emergency food.",
            "score": 2,
            "author": "shsl_cipher"
        },
        {
            "level": 0,
            "comment": "Anywhere to watch this yet? thats not $170?",
            "score": 2,
            "author": "SteamedGamer93",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hi,\n\n**Your Post / Comment Has Been Removed**\n\n* It featured obvious directions towards a site for illegal streams or downloads\n* It featured promotion of piracy, use / desire to pirate or promotion of use of a site for illegal streams or downloads.\n* A request for alternative illegal options such a free pirate sites to use etc.\n\n**Keep in mind that repeat violation of the rules might result in a ban.**\n\n[Click Here For More Info On This Rule](https://www.reddit.com/r/Animedubs/wiki/rules#wiki_do_not_link_to_or_enable_illegal_content)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Animedubs) if you have any questions or concerns.*",
                            "score": 1,
                            "author": "AutoModerator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did you find somewhere",
                    "score": 1,
                    "author": "the95th"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dang! It’s only in microsoft. I’m using a mac so i cant have it :(",
            "score": 2,
            "author": "Background-Hunter-72"
        },
        {
            "level": 0,
            "comment": "Animension has the first episode.\nJust about to start it",
            "score": 2,
            "author": "No_Chest_2415",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay. So I just watched the first 2 episodes.\n\nI will preface this with the fact that I watched each new episode of Digiomon, 02 and Tamers as it aired on Fox Kids every saturday morning.\n\nIt is amazing.\n\nI'm actually glad it has a new cast and didn't bring back anyone from the original dub.\n\nIn the 2 episodes, I only got to hear Tai, Matt, Izzy, Agumon/Greymon and Garurumon...but the voices work so well with this new story.\n\nI was sold on all the new voices and how faithful it was to the script.\n\nEspecially Agumon/Greymon. It's just perfect.\n\nI honestly cant wait to see more of this, and hear all the other new voices portray the other DigiDestined and Digimon.",
                    "score": 1,
                    "author": "EmilySPond"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where is it streaming",
            "score": 1,
            "author": "helloiamaudrey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right now its on the Microsoft Store",
                    "score": 12,
                    "author": "AJBecklesVO"
                },
                {
                    "level": 1,
                    "comment": "Hopefully on Crunchyroll, but it’s not released yet",
                    "score": 6,
                    "author": "Environmental_Fly920"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm sure that everyone involved is going to do an amazing job, but that cast list is a hard pass for me who grew up with the original Digimon dub.\n\nI know how ridiculously difficult it would be to keep the cast as in tact as possible, and times change, so do people and their availability. I'm not naive to the impossibility of recapturing exactly the same cast and feel.\nCan't fault them for going in that casting direction and definitely can't fault the actors for embracing such a great opportunity, but sadly, by its very design, this just isn't for me.\n\nI hope that they're able to use this to introduce Tai, Agumon and the gang to a brand new generation and it hits the same for kids nowadays as it did for me. Best of luck, Digi-destined.",
            "score": -2,
            "author": "lerdyvision",
            "replies": [
                {
                    "level": 1,
                    "comment": "they recast everyone because japan recast everyone. its a reboot",
                    "score": 4,
                    "author": "Muur1234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm well aware of that, but it doesn't change my desire to watch it.\n\nFor the Golden Age Berserk films Japan recast but we kept the same voices. For 2016 we recast. Stranger things have happened than keeping a cast between reboots, though obviously the time between is the biggest hurdle for this one.\n\nIt's fine, happened to Trigun, happened to Orphen, it's unavoidable. But I'll pick and choose what I want to watch independently of that.",
                            "score": 5,
                            "author": "lerdyvision",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean the some characters has to be re-casted considering some VAs retire or passed away.",
                                    "score": 2,
                                    "author": "Bay-Sea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Likes of Bob Papenbrook (Father of Bryce Papenbrook) so indeed they have to recasted cuz of that.",
                                            "score": 1,
                                            "author": "PsychologicalHelp564"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They would change the cast regurdless.  \nUS companies barely care whos playing the role.",
                            "score": 0,
                            "author": "Lifenblades",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they recast as much as possible in tri and kizuna",
                                    "score": 0,
                                    "author": "Muur1234",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True,  \nI don't get why we got down voted, when its clearly true.  \nNetflix and Crunchyroll, both recast actors, for basically no reason.  \nand this hurts the community.",
                                            "score": 0,
                                            "author": "Lifenblades"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully a cast list for all the other characters will follow too.",
            "score": 1,
            "author": "Bluebaronbbb"
        },
        {
            "level": 0,
            "comment": "Link?",
            "score": 1,
            "author": "supaikuakuma"
        },
        {
            "level": 0,
            "comment": "So how's the show and dub of all the eps...",
            "score": 1,
            "author": "Bluebaronbbb"
        },
        {
            "level": 0,
            "comment": "its weird that they don't even ask the old cast if they want to still play their roles.",
            "score": 1,
            "author": "Lifenblades",
            "replies": [
                {
                    "level": 1,
                    "comment": "According to Joshua Seth, they were told months before the announcement that everybody would be recast. He's fine with it.",
                    "score": 3,
                    "author": "SnowWarren",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plus, he met Zeno Robinson AKA reboot Tai in the photo on his twitter.",
                            "score": 2,
                            "author": "PsychologicalHelp564"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's really not. It's been what, 20+ years?\n\nMany of the original VAs have retired, I believe some have passed, and there might be contracts they have to honor instead.",
                    "score": 1,
                    "author": "tabletopbaazar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "0/10 if there’s no Digirap then this shit ain’t English Digimon!",
            "score": 1,
            "author": "Top-Ad-3174"
        },
        {
            "level": 0,
            "comment": "Wait can I watch it dubbed? Where and now? Omg",
            "score": 1,
            "author": "omegaap"
        },
        {
            "level": 0,
            "comment": "Any word if Crunchyroll will get to put the dubbed in their section for digimon2020?",
            "score": 1,
            "author": "7H3bear"
        },
        {
            "level": 0,
            "comment": "will it ever be on crunchyroll?",
            "score": 1,
            "author": "MostCrab"
        },
        {
            "level": 0,
            "comment": "Where are you guys seeing the cast? I can't see it anywhere.",
            "score": 1,
            "author": "BahamutAXIOM"
        },
        {
            "level": 0,
            "comment": "Where exactly is it available? I have been looking and can't.",
            "score": 1,
            "author": "Numerous_Complaint52"
        },
        {
            "level": 0,
            "comment": "Who voices valdurmon?",
            "score": 1,
            "author": "Background-Hunter-72"
        },
        {
            "level": 0,
            "comment": "where to watch this other then Microsoft?",
            "score": 1,
            "author": "SellGlad2194"
        },
        {
            "level": 0,
            "comment": "Has anyone figured out where to stream this? Damn that price is too high!\n\n(Please dm me)",
            "score": 1,
            "author": "BeeferSutherland90",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've searched for this everyday the past few days",
                    "score": 1,
                    "author": "FromPalletTown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same :/ if I hear anything I'll message you.",
                            "score": 1,
                            "author": "BeeferSutherland90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i've also been looking if i find anything ill let you know xD",
                                    "score": 1,
                                    "author": "Ultrasstrife",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same here. Lmk too",
                                            "score": 1,
                                            "author": "avlambo21"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "thought it would be expensive but it's not",
                    "score": 1,
                    "author": "Distinct-Society-670",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn't it like a 100 some odd dollars for all the seasons? Or was there a price drop?\n\nEdit: nevermind still 165 USD for all :(",
                            "score": 1,
                            "author": "BeeferSutherland90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly that's not bad",
                                    "score": 1,
                                    "author": "Distinct-Society-670",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hmm, agree to disagree.",
                                            "score": 1,
                                            "author": "BeeferSutherland90"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So where's the link to download it for free?",
            "score": 1,
            "author": "Hombrepy"
        },
        {
            "level": 0,
            "comment": "Please DM me if you find anything, I'm dying to see it",
            "score": 1,
            "author": "No_Chest_2415"
        },
        {
            "level": 0,
            "comment": "Still searching for a free option",
            "score": 1,
            "author": "aye_ayjay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any news",
                    "score": 1,
                    "author": "Beneficial-Egg-7536",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The first 13 episodes are on a site",
                            "score": 2,
                            "author": "the95th"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Daman Mills, ugh. Guess ill skip this one\nI dont support pedo’s",
            "score": -4,
            "author": "Shadownight5150",
            "replies": [
                {
                    "level": 1,
                    "comment": "What? Seperate the art from the artists",
                    "score": 1,
                    "author": "Wooka156",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That only works if the artist in question isn't getting royalties still -- (aka they're dead) because otherwise, you're supporting them.\n\nCS Lewis/HP Lovecraft/Tolkien are able to be removed from their art, because they cannot benefit from it anymore.\n\nSomeone like this, or JK Rowling, still benefit from people consuming the IP they created or are a part of.\n\nSo tl;dr: you're still supporting the people whose views aren't okay to you by separating the art from the artist. Dude still makes money off of you.",
                            "score": 2,
                            "author": "tabletopbaazar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At the end of the day it. Doesn’t matter. Me. Not watching adventure 2020 dub isnt gonna make him go broke",
                                    "score": 0,
                                    "author": "Wooka156",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "didn't the guy come out and say he made it up?",
                                            "score": 3,
                                            "author": "DaveyBlahBlah",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, it’s been pretty well documented and the accusers tweets are still out there, at this point these peoples continued hate for Daman is either pure ignorance or targeted hate\n\nI really don’t get the logic, the English voice acting community has never hesitated to blacklist deplorables within their ranks, you can make a pretty healthy list of people they’ve kicked out, daman isn’t unique in the slightest and wouldn’t get any immunity, the obvious fact is stuff just wasn’t true",
                                                    "score": 1,
                                                    "author": "Kollie79"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The accuser literally admitted he made it up. Learn to keep up to date.",
                    "score": 1,
                    "author": "Fynzou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, he harassed his victim, and told him to retract them, even though they were true",
                            "score": 1,
                            "author": "RentorarNitro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Literally not what happened.",
                                    "score": 1,
                                    "author": "Fynzou"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fake news",
                    "score": 1,
                    "author": "Distinct-Society-670"
                }
            ]
        }
    ]
}