{
    "id": "12ptz0o",
    "score": 85,
    "title": "In Another World With My Smartphone - Season 2, Episode 1 (PREMIERE) - Dub Available Now on Funimation/Crunchyroll!",
    "author": "MarvelsGrantMan136",
    "date": 1681760211.0,
    "url": "https://www.reddit.com/r/animedubs/comments/12ptz0o",
    "media_urls": [],
    "other_urls": [
        "https://www.funimation.com/shows/in-another-world-with-my-smartphone/)/[Crunchyroll](https://www.crunchyroll.com/series/GYQ4ZWV46/in-another-world-with-my-smartphone)!"
    ],
    "postText": "**In Another World With My Smartphone**\n\n* **Season 2, Episode 1 (PREMIERE) - \"Engagement Rings and a Hot Spring\"**\n\nDub Available Now on [Funimation](https://www.funimation.com/shows/in-another-world-with-my-smartphone/)/[Crunchyroll](https://www.crunchyroll.com/series/GYQ4ZWV46/in-another-world-with-my-smartphone)!\n\n\\---\n\nCast:\n\n* Touya voiced by Bryson Baugus\n* Yumina voiced by Celeste Perez\n* Elze voiced by Leah Clark\n* Linze voiced by Jill Harris\n* Yae voiced by Michelle Rojas\n* Sushi voiced by Sarah Wiedenheft\n* Leen voiced by Monica Rial\n* Kohaku (Little) voiced by Marissa Lenti\n\nCrew\n\n* ADR Director: Dani Chambers\n* Assistant ADR Director: Helena Walstrom\n* Lead ADR Engineer: Kim Morton\n* Assistant ADR Engineer: Jamal Roberson\n* Mix Engineer: Andrew Tipps\n* ADR Script Writer: Leah Clark\n* Script Supervisor: Tyler Walker\n* ADR Prep: John Van Doren",
    "comments": [
        {
            "level": 0,
            "comment": "I understand she's not a major character, but I can't make out who Renne's new (permanent) VA is (now that Alison Viktorin has moved on).",
            "score": 4,
            "author": "TVLubber",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like Madeleine Morris",
                    "score": 1,
                    "author": "Arickettsf16"
                },
                {
                    "level": 1,
                    "comment": "It's definitely Madeleine Morris. Sounds like her Klem from How not to Summnon a Demon Lord.",
                    "score": 1,
                    "author": "BlueSpiderManiac"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here's the anime that I was real surprised to see got a second season.  Just shows just about any show (at least... Isekai's) can get a sequel season now a days.  Unless you're No Game No Life.  HAHA. --- That said.  I'll watch this... Eventually.  This is one that I have in my \"plan to binge down the line\" pile.",
            "score": 9,
            "author": "mylastdream15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea no kidding. I mean, I remember enjoying it back in, what, 2020? (Bloody hell, did it really air just before the pandemic hit? Shit, time's weird). But I also remember it being unapologetically the definition of the power fantasy harem isekai. Like, shit, dude's got 4 fiancees. Or 9? I'm a little confused there. Probably should have rewatched the first season since I remember sweet fa, but then, with the VA changes, maybe it's best I didn't since I literally can't remember what any of them sounded like. \n\nAnywho, I do remember enjoying the show well enough so I'll definitely be watching this (though maybe do it waiting a few weeks in between at a time), and with the line \"don't worry, a mysterious steam cloud will conceal my naughty bits\" I sort of remember why XD I do enjoy shows that are so cliched that they're a blatant parody now and then.",
                    "score": 2,
                    "author": "Tryoxin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It came out 7 years ago.",
                            "score": 2,
                            "author": "Blu_Hedgie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Was that the dub or the sub?",
                                    "score": 1,
                                    "author": "Tryoxin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sub, but I do recall it being a simuldub.",
                                            "score": 3,
                                            "author": "Blu_Hedgie"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "His voice sounds really close to Jessie. I could easily get used to it.",
            "score": 8,
            "author": "LIL_USO760",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool",
                    "score": 2,
                    "author": "Environmental_Fly920"
                },
                {
                    "level": 1,
                    "comment": "Unless you have some video of Jessie speaking post-HRT or while taking HRT, I don't hear any closeness to Jessie's VA.",
                    "score": 2,
                    "author": "Kadmos1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As far as I understand, male to female HRT won’t have much of an effect on the voice at all, unlike the opposite situation would.",
                            "score": 1,
                            "author": "Arickettsf16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it's fucking shit I'm going to have vocal exercises ever bloody day for the rest of my life ugh😤🤬",
                                    "score": 1,
                                    "author": "CastielWinchester270"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait, I never thought about that. Touya could just set a Gate on the floor that teleported directly above, sending someone into a Portal like endless loop of hell.\n\nI'm confused. At the time of the end of season 1, he only had four fiances. But he's talking to god and they definitely mention nine. I know there will be nine eventually, but they implied that it was already the case. Also, I swear I don't remember the new goddess girl who of course is played by Jamie Marchi.  And in the next scene, the girls clarify there's only four of them. Also, how does everyone other than Elze and Touya know Excel? Isn't it a non-elemental spell that can't be learned? \n\nI was certainly right that Celeste Perez is a great voice match for Felecia Angelle. Couldn't pinpoint Alison Viktorin's replacement, but they also sounded good.",
            "score": 3,
            "author": "MegaAltarianite",
            "replies": [
                {
                    "level": 1,
                    "comment": "So the null magic is something that is RARELY seen in two people except in cases of hereditary tradition even then it's not common. There's a plot point where touya learns a healing spell from hearing about someone not being able to use I think their mother's magic?",
                    "score": 1,
                    "author": "beyd1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, and you can't teach it to someone else. But I was wrong. Elze has Boost, which Touya learns. I was thinking of Jamukha Blau who has Accel (I'm an idiot again). Which is even more suspicious. If I recall, you can't teach null magic to others. The entire gang does at the beginning. Unless Touya's ability allows him to teach null magic to others, but that never came up previously.",
                            "score": 1,
                            "author": "MegaAltarianite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I haven't sent the new ep yet so I can't speak to that. Maybe he can? Who knows, anime man.",
                                    "score": 1,
                                    "author": "beyd1"
                                },
                                {
                                    "level": 3,
                                    "comment": "The rings are enchanted with it, as well as storage. It was mentioned during the hot spring talk.",
                                    "score": 1,
                                    "author": "ThePrimitiveSword"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How come Touya isn't being voiced by Josh Grelle again in the dub? Did something happen to the guy?",
            "score": 3,
            "author": "Pokemon_Bakugan_Fan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just a heads up, her preferred pronouns are now they/them and she/her.\n\nShe came out as M2F trans last month, so it's an understandable mistake to make.\n\nMight also be related to her not returning to the role of Touya.",
                    "score": 2,
                    "author": "ThePrimitiveSword",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry.",
                            "score": 2,
                            "author": "Pokemon_Bakugan_Fan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No need to apologise to me.\n\nIt's a recent change, so I'm just helping raise awareness when people make the mistake. When people transition, others can mistakenly refer to them with their old pronouns or dead name and it's a completely innocent mistake.\n\nIt's just when people continue to do so that it's problematic and can be hurtful.\n\nIt'll probably take quite a while for people to call Jessie by her new name and pronouns. Her page on animevoiceover.fandom.com for example still uses the title Josh Grelle (but with Jessie used in the text) and Joanna Grelle's page still says she's married to Josh Grelle.",
                                    "score": 2,
                                    "author": "ThePrimitiveSword",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gotcha.",
                                            "score": 1,
                                            "author": "Pokemon_Bakugan_Fan"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hoping you’ll see this and have some info. Someone on MAL said that Jessie wouldn’t be voicing male characters anymore? Do we know if this is true? Only reason I’m concerned is bc this VA voiced Issei in High School DxD and I really don’t wanna have a third new VA for him if season 5 ever comes.",
                            "score": 1,
                            "author": "Snow-Helation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As far as I am aware, nobody knows. Even with her not returning to the role of Touya, it's just an assumption that is the reason based on the circumstances. Unless she says something herself, we can't know for certain.\n\nI thought she was still doing some male roles though, such as in Dr Stone, but that could change. It's common for women to voice male characters, but for some people who have transitioned it may not be their preference to voice characters with their old gender. It's a personal thing, so depends on each person and we just need to wait and see.",
                                    "score": 1,
                                    "author": "ThePrimitiveSword"
                                },
                                {
                                    "level": 3,
                                    "comment": "She also voiced Shido in DAL, so thaf's another role up in the air (but it's at least guaranteed to be settled whereas there's been no news of DxD s5 even going into pre-production).$",
                                    "score": 1,
                                    "author": "Talrynn_Sorrowyn"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, he got really busy 😂. Nah, he's (probably) fine, he's just doing 3 or 4 other shows this season.",
                    "score": 1,
                    "author": "notreal149",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah. Fair. Well, as long as he's healthy. He's one of my favorite dubbed voice actors. Though in terms of absolute favorites, I'd have to give it to Johnny Yong Bosch.",
                            "score": 3,
                            "author": "Pokemon_Bakugan_Fan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, definitely a top 5 male voice actor in my book as well. Somehow the only major role I've seen JYB in since Trigun 20+ years ago is Toradora, so I haven't had a chance to get to know his voice well yet.",
                                    "score": 1,
                                    "author": "notreal149",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One character I'm really glad he voiced was Lelouch vi Britannia from Code Geass: Lelouch of the Rebellion.",
                                            "score": 2,
                                            "author": "Pokemon_Bakugan_Fan"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I didn't already know about the two Voice Actor changed I probably wouldn't have notice.  But to be honest I'm not sure if that's a good thing.",
            "score": 2,
            "author": "Kuudered-Kun",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll be honest: When I heard Touya open his mouth, my first thought was, _\"Man, I guess it's been a while since I last watched the dub.  I've forgotten how everyone sounded.\"_  When I heard Yumina loud and clear, I knew.  She sounds triple her original age now.  Renne as well—at least 3x older than she originally sounded.  If they have to replace voice actors, they could at least try to pay attention to the target ages a little...\n\nI'm disappointed in Touya's new VA because it's clear from this episodes instances of his flustered reactions that he doesn't have the same range as the original VA for those moments.  I honestly felt Touya's season 1 English VA did a better job than the Japanese VA whenever he was doing duty as the foil for Leen's teasing or whatever.",
                    "score": 6,
                    "author": "Fredasa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why’d they change touya’s VA 😭",
            "score": 4,
            "author": "Memetyme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah.  Disappointing.  He did a really good job of punching up the comedy aspect in the first season with his reactions.  The new VA is very dry in this regard.",
                    "score": 5,
                    "author": "Fredasa"
                },
                {
                    "level": 1,
                    "comment": "Might be a personal choice, as Jessie announced last month that she has transitioned and (this is an assumption) due to that may feel uncomfortable voicing a male harem MC.",
                    "score": 4,
                    "author": "ThePrimitiveSword"
                },
                {
                    "level": 1,
                    "comment": "Grelle Has a Tight schedule, but don’t worry, we’ll still hear them in Vinland Saga Season 2 as Canute, guess they want to prioritize on reprising they’re characters in Bigger and more important / Big Deal Anime Dubs so we may hear them again in Dr Stone New World and The Ancient Magus Bride Season 2. Ironically, both of them will have 2 cours just like Vinland. Unlike this Anime.",
                    "score": 2,
                    "author": "SatisfactionFalse641"
                },
                {
                    "level": 1,
                    "comment": "The same goes for Yumina's. Obviously scheduling issues.",
                    "score": 1,
                    "author": "TVLubber",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still can't really think of other instances of this.  Not one but two of the main characters, including _the_ main one, being replaced.  And if I'm being frank, both instances are downgrades.  Especially Yumina, who now sounds like her own mother instead of something reasonably close to her supposed age.\n\nI want to say they should have just waited, but I get it.  It's a low-priority anime.  Even though it's always been a bit of a guilty pleasure of mine that I rewatched many times, obviously the ratings aren't convincing.",
                            "score": 4,
                            "author": "Fredasa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wasn’t planning on watching this but I’m to big of a Bryson Fan not to at least check out the first episode and give it a chance. I must say I slightly prefer him over Josh here but that’s just me. \n\nThis will be a background noise series for me. It’s not unwatchable like Rent A Girlfriend where I can’t even laugh at how awful it is, but I’m so bored. The first season felt like a big nothing burger. Stuff happened sure but I’m hard pressed to even remember what it was because the characters themselves are so dull. As the fiancés are explaining what made them fall for Touya I’m sitting there confused, saying “When did that happen?”\n\nThe especially horny Cesca voiced by the one and only Brittany Karbowski was the highlight.\n\nAgain I’ll probably keep following it as a fan of Bryson and the fact there actually seems to story to this season.",
            "score": 2,
            "author": "No_Discussion3053"
        },
        {
            "level": 0,
            "comment": "What was the point of dubbing this if Jessie and Felecia had to back out of it? Quite frankly, they really should've just put this show to the side for a while and dubbed something else more worthwhile.",
            "score": 1,
            "author": "awakening_knight_414",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be fair, They do have pretty tight schedules this Season, for Jessie (Vinland Saga S2, The Ancient Magus Bride S2, and Dr. Stone New World) guess they want to prioritize on way more bigger and important anime dubs than this small show. Additionally the three I mentioned are dubs that will have 2 cours.\n\nBut Yeah, I’m still waiting for the Vampire who Dies in No Time Season 2 to be dubbed. Jad is busy directing All of Natsume’s Book of Friends and Aristocrats. So I’m honestly someone else could help fill in directing that show for her. Like how Aaron Roberts is doing Kuma Kuma Kuma Bear Punch.",
                    "score": 2,
                    "author": "SatisfactionFalse641",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm well aware that the 2 VAs had scheduling conflicts. My point is, Crunchyroll really shouldn't have bothered to simuldub this show if they couldn't bring back either of them and should've waited until the summer to dub it.",
                            "score": 6,
                            "author": "awakening_knight_414",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hard agree.  The new Yumina.  Yikes.",
                                    "score": 8,
                                    "author": "Fredasa"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah that would’ve been a better solution.",
                                    "score": 6,
                                    "author": "SatisfactionFalse641"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is vamp getting a season two dub?",
                            "score": 2,
                            "author": "beyd1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The dub of the first season made a number of flubs, needless changes to dialogue, and, well, ***censorship decisions*** that I did not agree with.  Not a good showing compared to its contemporaries, even if I enjoyed it overall.\n\nThis dub seems to be maintaining that standard.  Right off the bat, when Touya is asked why he doesn't have his fiances on his smartphone's homepage, ***his answer specifically references NINE fiances***, which the Japanese dialogue did not.\n\nI believe it is very _safe_ to assume that he does _not_ have nine fiances at this point, having not even added that many to his party yet, let alone had the topic of engagement broached.\n\nWhoever is in charge of the scripts for the dub of this show needs to be brought under control.  They don't want to pay all that close attention to the original dialogue?  This kind of sh-- is gonna keep happening.",
            "score": -1,
            "author": "Fredasa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crunchyroll didn't censor it. It was already censored to begin with.",
                    "score": 2,
                    "author": "TVLubber",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What do you mean?  They produced two Japanese audio tracks, one of which was censored here and there, and that's what Crunchyroll worked from?\n\nLet me give you a quick example of what I'm getting at.  Episode 10, at about 15:50.  One of those brief interlude scenes the series has a penchant for, depicting Linze creating a large-breasted sand sculpture around the half-buried Elze.\n\n**Japanese:** 大きくな～れ！  (Subbed as: May you grow bigger.)  \n**English:** Here you go!  Though you're perfect the way you are.\n\nThe point of this change, of course, was that somebody on the translating team was uncomfortable with the scene and decided to inject their values into it, at the expense of faithfulness to the source material.\n\nIf I'm following you correctly, this was pre-censored in some unelaborated way?\n\n---\n\n_Edit: To reply to the \"deleted / unavailable\" account which is not in fact deleted or unavailable:_\n\n&gt; Besides, there's hardly any significant difference between the two versions of the quote.\n\nIf you believe there isn't any point in staying as close to the original dialogue as possible, even in a dub, then I'm hardly going to be the person who changes your mind.  Enjoy those dubs from the 80s and 90s.  Me?  I'm glad the majority of the modern dubbing industry is being held to a higher standard.",
                            "score": 0,
                            "author": "Fredasa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Quote:\n\n\"The point of this change, of course, was that somebody on the translating team was uncomfortable with the scene and decided to inject their values into it, at the expense of faithfulness to the source material.\"\n\nDo you have any irrefutable evidence to back this claim? Or are you just bashing Crunchyroll for something that was way beyond their control?",
                                    "score": 4,
                                    "author": "TVLubber",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Trust me bro\"",
                                            "score": 2,
                                            "author": "beyd1"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not on Crunchyroll yet",
            "score": 1,
            "author": "loki32687"
        },
        {
            "level": 0,
            "comment": "I thought Funimation was supposed to not get any new content anymore as of 2 or 3 seasons ago when they pushed everyone to move onto CR, guess not?",
            "score": 0,
            "author": "JACrazy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Iirc they're still getting some legacy shows new/future seasons until they close permanently.\n\nNew shows and dubs will always go to CR however",
                    "score": 5,
                    "author": "Awkward_Silence-"
                },
                {
                    "level": 1,
                    "comment": "New Episodes of Existing licenses will be available on both Funi and Crunchy however new Series will be Crunchy Only.",
                    "score": 2,
                    "author": "No_Discussion3053"
                }
            ]
        }
    ]
}