{
    "id": "12puq1g",
    "score": 43,
    "title": "VINLAND SAGA - Season 2, Episode 13 - Dub Available Now on Crunchyroll!",
    "author": "MarvelsGrantMan136",
    "date": 1681761687.0,
    "url": "https://www.reddit.com/r/animedubs/comments/12puq1g",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/12puq1g/vinland_saga_season_2_episode_13_dub_available/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/watch/GK9U3X8M1/slave)",
        "https://www.netflix.com/title/81249833)"
    ],
    "postText": "**VINLAND SAGA**\n\n* **Season 2, Episode 13 - \"Dark Clouds\"**\n\n[Dub Available Now on Crunchyroll!](https://www.crunchyroll.com/watch/GK9U3X8M1/slave)\n\n[NETFLIX DUB](https://www.netflix.com/title/81249833) **- Episodes 1-12 Are Available Now**",
    "comments": [
        {
            "level": 0,
            "comment": "The characters are all really well written in this show. I feel like you get a really good idea of what they’re like even if they don’t have a lot of scenes. \n\nGardar’s introduction was certainly unexpected. I didn’t think they’d introduce a new plot line like this right now, but it makes sense to give Einar more personal conflict. Some of my favorite types of stories are ones that can neatly intertwine multiple plot lines. I was unsure at the beginning because of how different it was, but I might end up liking this season more than the first.",
            "score": 7,
            "author": "WingsofLegends"
        },
        {
            "level": 0,
            "comment": "New opening is astounding!!!",
            "score": 2,
            "author": "Peacesquad"
        },
        {
            "level": 0,
            "comment": "wait, is it already on 2nd cour?\n\nwaiting for netflix to drop the next 4 at any moment then",
            "score": 1,
            "author": "IntelligentBudget142",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah there wasn’t a break between episodes, so episode 15 is the most recent. If Netflix continues the pattern of 4 episodes at once it’ll probably be another couple weeks still.",
                    "score": 1,
                    "author": "WingsofLegends",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Netflix's first dubbed episode dropped March 9, two months after the season began airing. If they continue that pattern, then we'll see episodes start dropping 2 months after the airing of episode 13. So sometime around June 3.",
                            "score": 1,
                            "author": "DarkArbiter91",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Netflix’s release pattern has been extremely unconventional, but the one consistent part has been the speed increasing. While it is technically a “new cour” I wouldn’t expect them to wait another two months.",
                                    "score": 3,
                                    "author": "WingsofLegends",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's fair. I certainly don't hope they wait 2 months, but since there's no official release schedule, we'll just have to wait and see.",
                                            "score": 1,
                                            "author": "DarkArbiter91",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i think we gotta wait till june :(",
                                                    "score": 1,
                                                    "author": "hktracks",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If it doesn't release this week, then yeah most likely. Honestly I figured this would be the case from the start. If they start dropping next week it will fit the pattern they set forward with the first half.",
                                                            "score": 1,
                                                            "author": "DarkArbiter91",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You know anything about a set release date for Netflix yet?",
                                                                    "score": 1,
                                                                    "author": "Select_Mode_7402",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Nope, no clue. I'm in the dark same as everyone else.",
                                                                            "score": 1,
                                                                            "author": "DarkArbiter91"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "how often do the dub episodes come out for crunchyroll? because i checked on monday and didn't see anything. maybe i checked too early.",
            "score": 1,
            "author": "Samm4999"
        },
        {
            "level": 0,
            "comment": "When will the dub for episode 13 onwards be released on Netflix?",
            "score": 1,
            "author": "GeekyStranger",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what I want to know so badly. I prefer the Netflix dub over the Crunchyroll one",
                    "score": 1,
                    "author": "Sttowe"
                }
            ]
        }
    ]
}