{
    "id": "137xcmb",
    "score": 85,
    "title": "Dr. STONE: New World - Episode 3 - Dub Available Now on Crunchyroll/Funimation!",
    "author": "MarvelsGrantMan136",
    "date": 1683228650.0,
    "url": "https://www.reddit.com/r/animedubs/comments/137xcmb",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/137xcmb/dr_stone_new_world_episode_3_dub_available_now_on/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/series/GYEXQKJG6/dr-stone)/[Funimation](https://www.funimation.com/shows/dr-stone/)!"
    ],
    "postText": "**Dr. STONE: New World**\n\n* **Episode 3 - \"First Contact\"**\n\nDub Available Now on [Crunchyroll](https://www.crunchyroll.com/series/GYEXQKJG6/dr-stone)/[Funimation](https://www.funimation.com/shows/dr-stone/)!\n\n\\---\n\nCast\n\n* Senku voiced by Aaron Dismuke\n* Chrome voiced by Matt Shipman\n* Kohaku voiced by Felecia Angelle\n* Gen voiced by Brandon McInnis\n* Taiju voiced by Ricco Fajardo\n* Ryusui voiced by Clifford Chapin\n\nCrew\n\n* ADR Director: Cris George\n* ADR Engineer: Jose Sandoval\n* Mixer: Neal Malley\n* ADR Script: Matt Shipman",
    "comments": [
        {
            "level": 0,
            "comment": "Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why? Why?\n\nSeriously though. I literally got chills when I read this scene in the manga.",
            "score": 23,
            "author": "Quibbrel",
            "replies": [
                {
                    "level": 1,
                    "comment": "inb4 seagulls and the interference is garbling up MINE MINE MINE MINE MINE",
                    "score": 4,
                    "author": "SoundOf1HandClapping"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The “Why” scene is iconic in the manga and just as so in the Anime. A lasting image is the spread with 4 of them with looks of terror and Senku with a borderline maniacal grin as if to say “Bring it on, Motherfucker.”\n\nGood stuff",
            "score": 15,
            "author": "No_Discussion3053"
        },
        {
            "level": 0,
            "comment": "The real MVP of the ep is the boar.\n\nI'll never get tired of Senku surprising me with the kind of tech he can recreate in the stone world: Radio towers, GPS, motor boats. I'd think that after inventing the phone and automobiles, then nothing would surprise me anymore. I guess it's this show's charm that keeps me excited.\n\nSpeaking of excited, how about that ending? Now I'm even more interested in Dr. Stone than I've ever been before. One of the shows biggest mysteries finally revealing a small piece of the puzzle.",
            "score": 12,
            "author": "Chun-Li_Forever"
        },
        {
            "level": 0,
            "comment": "That 'why?' really gave a good creep factor, did not see that coming from Dr.Stone",
            "score": 9,
            "author": "Sykah",
            "replies": [
                {
                    "level": 1,
                    "comment": "This show's got a remarkable ability to make you feel just about every emotion under the sun.",
                    "score": 5,
                    "author": "Gyeseongyeon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Couple thoughts, first being I'm surprised they could take pictures at all because I thought it took a long time with old cameras but I guess he made a bit newer one than I was thinking. \n\nLoved the throwback to Senku's love potion. Taiju finally figured out the joke 3700 years later LOL.\n\nThe whywhywhy at the end there was definitely a nice creep factor and Senku kinda shit talking them in the mic was badass.\n\nRandom side note- I know this isn't a romance but I hope Senku and Kohaku get together at the end. Just a cute couple imo despite Senku being married to science. I also know a little bit of what happens later so no spoilers please lol.",
            "score": 4,
            "author": "Valens93",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's all sped up and exaggerated. Like the boat and oil refinery.",
                    "score": 1,
                    "author": "Whats_logout"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No lie, I'm really digging what Michelle Rojas is doing with her portrayal of Francois. She's doing an EXCELLENT job keeping the character androgynous--not giving them a male or a female bent, which is perfect as their gender is never stated.\n\nEdit: I just finished the episode and Senku's last line when he's talking to \"Why Man\" is just...it's PRODIGIOUS. Aaron did a GREAT job with that read!",
            "score": 4,
            "author": "KhakiBlueSocks"
        },
        {
            "level": 0,
            "comment": "So we are introduced to why man. It is nice to have detective Suika back.",
            "score": 2,
            "author": "SolidA34"
        },
        {
            "level": 0,
            "comment": "Is the implication at the end that another human was responsible for the petrification? And seemingly did it on purpose? Certainly not expecting that twist.",
            "score": 2,
            "author": "MegaAltarianite"
        },
        {
            "level": 0,
            "comment": "Just need to say that boar are not to be pets. They can kill you",
            "score": 0,
            "author": "fightin_blue_hens"
        }
    ]
}