{
    "id": "13bwalc",
    "score": 111,
    "title": "The Eminence in Shadow - Episode 20 (FINALE) - Dub Available Now on HIDIVE !",
    "author": "jamiex304",
    "date": 1683561691.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13bwalc",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/13bwalc/the_eminence_in_shadow_episode_20_finale_dub/"
    ],
    "other_urls": [
        "https://www.hidive.com/tv/the-eminence-in-shadow)"
    ],
    "postText": "***Reminder***: *Please do not discuss plot points not yet seen in the dub version of the show without warning and use of the spoiler tag.*\n\n* **The Eminence in Shadow - Episode 20 / 20 (FINALE)**\n\n[**Dub Available Now on HIDIVE**](https://www.hidive.com/tv/the-eminence-in-shadow)\n\n**English Crew:**\n\n* Director - John Swasey\n* ADR Script - Kalin Black\n* English Mix - Brent Marshall                                             \n* Audio Engineer - Patrick Marrero\n\n**English Cast:**\n\n* Cid Kageno/Shadow - Adam Gibbs\n* Akane - Natalie Rial\n* Alexia - Olivia Swasey\n* Alpha - Christina Kelly\n* Beta - Annie Wild\n* Gamma - Elissa Cuellar\n* Delta - Raven Troup\n* Epsilon - Ellen Evans\n* Zeta - Dominique Meyer\n* Claire - Luci Christian\n* Iris - Patricia Duran\n* Po - Greg Ayres\n* Skel - Nathan Wilson\n* Zenon - Scott Gibbs",
    "comments": [
        {
            "level": 0,
            "comment": "I’ll admit, even after watching all 20 episodes, i still don’t really understand what the main character is trying to achieve. That being said, I still enjoyed it for the most part and look forward to be even more confused in season 2 😀",
            "score": 20,
            "author": "GoldenTimeWatcher",
            "replies": [
                {
                    "level": 1,
                    "comment": "In his insane chuunibiyo mind, he's literally trying to look cool.",
                    "score": 22,
                    "author": "SoundOf1HandClapping",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In my head cannon Cid is basically an insane god, playacting in a world that unconsciously shapes itself to his will.",
                            "score": 5,
                            "author": "wmansir"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cid is a chunni and doing things for the rule of cool, not realizing that his made up bullshit is real and that his actions has IRL consequences. \n\nEveryone else is 100% serious, but to Cid, he is trying to play to the camera in his head. But because of this, he has no idea that it is serious, that Shadow Garden money is his to use, or that they are serious as he think they are all \"playing\" with him.",
                    "score": 11,
                    "author": "Noy_Telinu"
                },
                {
                    "level": 1,
                    "comment": "I thought the exact same thing.  The series was one hell of a ride, but truly at the end of the season finale, I really felt like I still had no idea what the main story was about.  Was he trying to create and control a world?  Was he creating stuff from his head and just didn't even know it?  So many questions still never answered.  But damn it if the fight scenes weren't legit. And I really ended up enjoying Cid as a main character.",
                    "score": 3,
                    "author": "Campfireandhotcocoa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ha ya felt the same way. I’m not even sure who the main girls are still. From OP, you’d think the focus would be on the girls in his army. But honestly it felt like the girls at his school (plus the sister of the one girl) got the majority of screen time 🤷‍♂️. Nonetheless, I still liked it quite a bit and hope season 2 clears some more stuff up",
                            "score": 2,
                            "author": "GoldenTimeWatcher"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a weird yet entertaining show.\n\nCid is certifiably insane, and while he's off indulging in his power fantasies it's the girls who are actually moving the world along. Cid just has the devil's own luck so when he ostentatiously nukes a town or whatever he's sticking it to the cult unintentionally.\n\nI liked the side characters, with Alexia growing on me since she's almost as ridiculous as Cid. Rose was pretty cool too.",
            "score": 14,
            "author": "SoundOf1HandClapping"
        },
        {
            "level": 0,
            "comment": "Thank you so much to John Swasey and the whole cast and crew for an excellent job with this series",
            "score": 6,
            "author": "ButterflySilver9154"
        },
        {
            "level": 0,
            "comment": "And...The Eminence in Shadow makes his exit...for now.\n\nThat intense battle between Shadow vs Iris and Beatrix was really spectacular, that it's definitely a contender for fight of the year. I like that his crowbar skills as Cid from episode 1 returns for the finale, that was pretty cool. In the end, Shadow couldn't just be overpowered even as Iris borrows power. She really is a hothead, whining like a sore loser plotting vengeance while Beatrix keeps her cool even in defeat. With The Eminence now more known to the world, things are going to get even more suspenseful. The Bushin Festival is perhaps my favorite arc in this season.\n\nWhat's more interesting is that, as I called it, Rose finally gets recruited into Shadow Garden and I can't wait to see how she's going to develop and grow as a new person. Really looking forward to know more of Shadow Garden's numbers introduced in the finale as well, especially &gt;!Lambda!&lt;.\n\nShadow playing the piano at the end is such a nice finishing touch to the season, and he certainly has more in store with his role-playing. I'm also hyped to see more badassery from the Seven Shades (Epsilon best girl!) in Season 2. Also hoping Eta and Zeta get more screentime. Pretty sure the future arcs yet to be animated are certainly going to be awesome.\n\nThis was one of my top shows from last year, and I'm glad it got dubbed so I could rewatch it. Cast was enjoyable overall, Adam Gibbs once again with another incredible role, in fact, Cid/Shadow's Japanese VA even [gave him a shoutout](https://twitter.com/Shadowgarden_PR/status/1653708478362583040). Christina Kelly was so amazing as Alpha, and it's now one of my favorite roles from her. But one voice I have to note here is **Ellen Evans** as Epsilon, she was pretty good too. I believe this is her first notable role, which means she is a rising star in Sentai's talent pool and I hope she gets cast more in the future. Season 2 can't come soon enough.\n\nThat's another dub from Sentai wrapped up, so I expect the premiere and cast of the Farming Life in Another World dub to be announced this week or the next. And hold your horses for the Oshi no Ko dub, I wouldn't expect the dub until the beginning or midway through the summer season, since Sentai these days likely prefers to wait for the sub run of a show to finish before dubbing it, but it may be possible they're already starting to work on it.",
            "score": 6,
            "author": "drawricks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cid's seiyuu did a similar shout-out to \"Appare-Ranman!\" counterpart, Ivan Jasso, when Ivan was announced as Kosame.",
                    "score": 1,
                    "author": "Kadmos1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really enjoyed that one reminded me alot of overlord. Adam Gibbs was fantastic in this episode. Overall I'd give it a 9/10 definitely not your average isekai show.",
            "score": 15,
            "author": "Joker3023"
        },
        {
            "level": 0,
            "comment": "Something I got confused about that I hope someone can clarify.\n\nIn the early episodes I remember that Cid made the Cult of Diablos up in order to get the girls to start working for him (correct me if I'm wrong) but then it just became a thing and I don't remember an explanation.\n\nAm I miss remembering or was this actually what happened?",
            "score": 5,
            "author": "Skiftx",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's that writer following the rule of cool.\n\nWouldn't it be cool if he made a follower?\n\nWouldn't it be cool if she thought there was this cult?\n\nWouldn't it be cool if she gets followers?\n\nWouldn't it be cool if they were finally that organization he wanted in his other life?\n\nWouldn't it be cool if he played the piano while monologuing?\n\nEtc.\n\nThen his followers took his indifference to mean they were to fill in the blanks. That every time he's off doing something cool it's secretly for some genius move.\n\nThat's how I see it. He treats life like a story where he achieves the awesomest result and everyone in his wake makes it coherent after the fact if only to avoid the fact it's mostly random.",
                    "score": 11,
                    "author": "HisDivineOrder"
                },
                {
                    "level": 1,
                    "comment": "He did make it up and then it turned out to be real. And he himself doesn't realize it's real. He thinks the girls are just playing along with his ruse.",
                    "score": 7,
                    "author": "WheelJack83"
                },
                {
                    "level": 1,
                    "comment": "Have they busted my theory that Cid _Haruhi Suzumiya’d_ the whole thing into existence by his own will, yet?",
                    "score": 6,
                    "author": "SarcasmProvider76"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Best show of the year.",
            "score": 6,
            "author": "WheelJack83"
        },
        {
            "level": 0,
            "comment": "Omg those fucking burger wrappers make me laugh so much! Really looking forward to Season 2 and hopefully we won't wait too long for the dub!",
            "score": 5,
            "author": "ElitePowerGamer"
        },
        {
            "level": 0,
            "comment": "Our protagonist everyone! \n\nGreat adaptation, glad S2 is already announced. Things will only get more crazy from here. Biggest dub complaint is the lack of the voice effect on the atomic scenes, but this one seemed to use it this time so hopefully they can go back and fix them",
            "score": 5,
            "author": "Noy_Telinu"
        },
        {
            "level": 0,
            "comment": "I've been waiting for this day for about a year, ever since I started the Light Novels and saw the trailers \n\nIt's binging time",
            "score": 3,
            "author": "Kemoy79",
            "replies": [
                {
                    "level": 1,
                    "comment": "How are the novels?",
                    "score": 2,
                    "author": "dreaming_state",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Comedy Gold",
                            "score": 4,
                            "author": "Kemoy79",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I read a comment that said that the novels were much darker compared to the anime and manga.",
                                    "score": 1,
                                    "author": "dreaming_state",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've only seen the first 5 episodes of the Anime so far, so all I can say is the Light Novels are more comedic than the Anime",
                                            "score": 3,
                                            "author": "Kemoy79"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That was an epic finale with our final boss protagonist. Adam Gibbs nailed that evil laugh!",
            "score": 3,
            "author": "Shadowmist909"
        },
        {
            "level": 0,
            "comment": "Iris held out a lot better than I expected in the fight. Still not even really sure why Beatrix got involved, other than \"hey look, fun fight\". Then again, this show did the impossible by making me lose all interest in any of the female characters, instead only wanting to see Shadow. The show overall was certainly better than I expected.",
            "score": 3,
            "author": "MegaAltarianite"
        },
        {
            "level": 0,
            "comment": "Alright now that this show is over, does someone want to tell me if it’s worth watching or not? I don’t like isekai’s usually. But I’ve like a couple, Jobless Reincarnation, Re:Zero.",
            "score": 3,
            "author": "TheS00thSayer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Season 2 is already confirmed. \n\nBut it’s definitely worthwhile and not a generic isekai.",
                    "score": 11,
                    "author": "TheHeinousMelvins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Might have to check it out then. I appreciate the input.",
                            "score": 1,
                            "author": "TheS00thSayer"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This show is like a complete subversion of the Isekai genre.  It's fairly self aware.  And actively goes out of it's way to point out how ridiculous some of the tropes of isekais are.  In not so subtle ways.  I thought it was pretty amazing haha.",
                    "score": 8,
                    "author": "mylastdream15"
                },
                {
                    "level": 1,
                    "comment": "I dropped it about 7 episodes in. When I dropped it, I felt like it didn't really have anything it excelled at. It was a little funny how cringy the MC was and failed upwards but wasn't super funny. The battle scenes were very hit and miss. The animation wasn't anything special. It was just a generic Isekai pretending to be a parody Isekai.",
                    "score": -4,
                    "author": "scdirtdragon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I had to put this show on hold after the first half when it was still airing in sub because it wasn't really grabbing me, but I still felt obligated to give it another chance because it wouldn't stop showing up on my timeline. Having finished it a few weeks ago, I can safely say I don't hate it, but I still don't really get the hype for this show either. I just didn't find myself really caring enough about anything, which I suppose was because of the MC being OP (they established that he trained in martial arts and whatnot in his past life, but it still made things boring). I also didn't find myself laughing nearly as hard as I feel like I was supposed to during the second half. I just stuck around for the waifus I guess.\n\nThe ending took a pretty surprising and interesting turn with Rose though, I'll give it that.",
                            "score": 0,
                            "author": "awakening_knight_414",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is how the show went from something I really wanted to watch, to a background anime to me putting off finishing because Tomochan is a girl is my new background anime.",
                                    "score": -3,
                                    "author": "CouncilmanRickPrime"
                                },
                                {
                                    "level": 3,
                                    "comment": "Kudos to you for sticking though it, but with so many other good shows out there I couldn't rationalize myself to watch something so mediocre.",
                                    "score": -3,
                                    "author": "scdirtdragon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks, in that case I’ll pass on it.",
                            "score": -5,
                            "author": "TheS00thSayer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gonna have to respectfully disagree with them. Found it very funny and many others do as well. And the battle scenes progressively get more fun as the show goes. And definitely not generic isekai. \n\nWorld building is pretty good and interesting too.",
                                    "score": 6,
                                    "author": "TheHeinousMelvins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed.  I thought this show actively improved as it went along.  Although, I did enjoy it fairly on and kept enjoying it.  I liked how it didn't take itself seriously at all and really tried to do something different in the genre.",
                                            "score": 5,
                                            "author": "mylastdream15"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Watch it for yourself just because a couple of people said they didn't like it don't let that stop you.",
                                    "score": 4,
                                    "author": "Snoo59793"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I didn't realize it was comedy/parody/satire, so dropped it (temporarily, was expecting / looking for something else). It seems kind of in the vein of OPM or Misfit of Demon King Academy if you like those types of shows.",
                    "score": -2,
                    "author": "BigL90"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finally, \nF*ck hidive . Releasing dubs to so late .\nI'll pirate it. I refuse to give HIDIVE a single dime.\nThey don't deserve it.",
            "score": -11,
            "author": "stralord7544"
        }
    ]
}