{
    "id": "13c2zer",
    "score": 40,
    "title": "VINLAND SAGA - Season 2, Episode 16 - Dub Available Now on Crunchyroll!",
    "author": "MarvelsGrantMan136",
    "date": 1683576079.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13c2zer",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/13c2zer/vinland_saga_season_2_episode_16_dub_available/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/watch/GK9U3X8M1/slave)",
        "https://www.netflix.com/title/81249833)"
    ],
    "postText": "**VINLAND SAGA**\n\n* **Season 2, Episode 16 - \"Great Purpose\"\n\n[Dub Available Now on Crunchyroll!](https://www.crunchyroll.com/watch/GK9U3X8M1/slave)\n\n[NETFLIX DUB](https://www.netflix.com/title/81249833) **- Episodes 1-12 Are Available Now**",
    "comments": [
        {
            "level": 0,
            "comment": "Has anyone heard about when the Netflix dub will drop the second half?",
            "score": 13,
            "author": "SarcasmProvider76"
        },
        {
            "level": 0,
            "comment": "Askeladd haunting Thorfinn when choosing to fight is so great and eerie. Not sure how many more times he’ll pop up, but I love getting hear David Wald again.",
            "score": 10,
            "author": "WingsofLegends"
        },
        {
            "level": 0,
            "comment": "So...this has not been officially confirmed yet, but is Mike still continuing to voice Thorfinn despite the controversy about him? If so, what's the reason?\n\nAnd the fact that he's been gone off-grid from social media since the accusation makes me wanna assume his VO career is over even when he sticks around until the end of this season, right?",
            "score": 1,
            "author": "drawricks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude We're Pretty much Really Tired and past of Talking about that, I mean they got rid of Anthony DiMascio as Olmar and replaced him with Ben Balmaceda. so looks like Anthony won't be appearing in anymore future projects. and for Mike, this could be his final project and will no longer work with crunchyroll anymore as soon as this show is over, so best guess. They'll allow him to keep playing Thorfinn and when the show's Done, Goodbye Mike.",
                    "score": 2,
                    "author": "SatisfactionFalse641",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You capitalized the first sentence like it was a light novel title.",
                            "score": 5,
                            "author": "Raptorheart"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are there really two dubs of this show running at the same time? Bruh.",
            "score": 1,
            "author": "Zergrump"
        },
        {
            "level": 0,
            "comment": "I can't believe Mike Haimoto still hasn't been in social media Ina while.",
            "score": 1,
            "author": "Bluebaronbbb",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fact that he's been dead silent, off-grid only means that he's guilty and his VO career is most likely over. I think he was allowed to finish his role as Thorfinn, and when the show is over, goodbye to him. We'll certainly not see his name appear ever again in future projects.",
                    "score": 2,
                    "author": "drawricks"
                }
            ]
        }
    ]
}