{
    "id": "13l8em4",
    "score": 72,
    "title": "Dr. STONE: New World - Episode 5 - Dub Available Now on Crunchyroll/Funimation!",
    "author": "MarvelsGrantMan136",
    "date": 1684438216.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13l8em4",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/13l8em4/dr_stone_new_world_episode_5_dub_available_now_on/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/series/GYEXQKJG6/dr-stone)/[Funimation](https://www.funimation.com/shows/dr-stone/)!"
    ],
    "postText": "**Dr. STONE: New World**\n\n* **Episode 5**\n\nDub Available Now on [Crunchyroll](https://www.crunchyroll.com/series/GYEXQKJG6/dr-stone)/[Funimation](https://www.funimation.com/shows/dr-stone/)!\n\n\\---\n\nCast\n\n* Senku voiced by Aaron Dismuke\n* Chrome voiced by Matt Shipman\n* Kohaku voiced by Felecia Angelle\n* Gen voiced by Brandon McInnis\n* Taiju voiced by Ricco Fajardo\n* Ryusui voiced by Clifford Chapin\n\nCrew\n\n* ADR Director: Cris George\n* ADR Engineer: Jose Sandoval\n* Mixer: Neal Malley\n* ADR Script: Matt Shipman",
    "comments": [
        {
            "level": 0,
            "comment": "Let's go baby! Just when I didn't think I could be more excited for Dr. Stone, seeing Senku, Ryusui, and the Exploration team setting sail has got me licking my chops. I'm looking forward to seeing more questions answered, and sprikling in some Dr. Stone science know-how as welll.\n\nI think my only gripe would've been to maybe make this a two-parter? Since reconstruction of the ship was going to take a year, maybe dedicate one episode to blueprinting and building while winter and summer fun. And the other episode finishing and departing. At least, I think it would make the Good byes and the group photo a little more emotional. \n\nThat's just my very minor crit. But I still loved everything about this ep. Looking forward to the next arc.",
            "score": 6,
            "author": "Chun-Li_Forever"
        },
        {
            "level": 0,
            "comment": "Kohaku has always been the best girl, but Minami makes a strong play this season. She provides a lot of emotional necessity in a show that (very entertaining) takes a more comedic tone.",
            "score": 6,
            "author": "MegaAltarianite"
        },
        {
            "level": 0,
            "comment": "Damn this anime is good! I love it! Even more, every episode tries to make you feel emotional.\n\nFor me, this is the one anime I think it would be great if it was releasing episodes continuosly like Detective Conan; Where half of the episodes are original episodes and the manga episodes (source/canon episodes) are adapted along the way. It would be great to have some original episodes in between adapting the process of making the kingdom of science new inventions (like the ship as we have seen in this episode) and some SOL moments in the kingdom of science.",
            "score": 4,
            "author": "MakotoGoku24"
        },
        {
            "level": 0,
            "comment": "Board member:  \"Be frank with us Francois\"\n\nFrancois thinking (probably): \"I can be nothing else\".",
            "score": 3,
            "author": "fdguarino"
        }
    ]
}