{
    "id": "13n4d94",
    "score": 43,
    "title": "At this point, is it safe to say we aren't getting *any* CR backlog dubs this season?",
    "author": "brainrotter1993",
    "date": 1684611624.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13n4d94",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incredibly disappointing if so",
    "comments": [
        {
            "level": 0,
            "comment": "At this point, I wonder if Bocchi the Rock will ever get dubbed. One of the best shows that came out last year not getting a dub would be an absolute travesty.",
            "score": 51,
            "author": "Darwin343",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it's honestly not ideal anymore to randomly pre-select what shows to dub before the season begins instead of waiting if a show does really well to decide if it should be dubbed or not. Thanks to this kind of strategy, they missed really good shows to dub this past seasons such as Bocchi the Rock like you mentioned, Angel Next Door, Magical Revolution and now Skip and Loafer. Instead, CR dubbed those forgettable seasonal cheap fantasy/isekai shows instead of these titles that became popular or highly rated.\n\nI swear isekais are a priority for them. They dub most of them despite how boring and uninteresting they can be, while shafting every other genre.",
                    "score": 30,
                    "author": "drawricks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don’t even get all the isekai. They completely missed campfire cooking last season and then one hit kill sister this one.",
                            "score": 5,
                            "author": "hdjskamsndndbdj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not getting campfire cooking hurt me, I love cooking anime. There are SO many great ones that never got the dub treatment. I know they're a very niche genre, but I thought it might have a chance as it was also isekai. *\\*sigh\\**",
                                    "score": 1,
                                    "author": "Precentor_Van_Zandt"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "isekais make money money, so it makes sense.",
                            "score": 17,
                            "author": "conflictDriven",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In Japan, maybe, but how many people in the West actually love isekais that much? Everywhere I go, I see people shitting on them all the time. I'm sure that, realistically, people in the West would enjoy romance dubs because of their humor a lot more than isekai dubs.\n\nEdit: ALRIGHT GUYS I GET IT. Please stop spamming replies to this comment.",
                                    "score": -1,
                                    "author": "random_no_name_4",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah and people claim they only watch subs too.... but dubs are hugely popular in the real world.",
                                            "score": 6,
                                            "author": "BlueShipman"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If a show even looks like an isekai I’m watching it. Fucking love isekai!\n\nThat said I also love me a good romcom so I’m down for more slice of life dubs.",
                                            "score": 5,
                                            "author": "cartercr"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You see people shitting on Nickelback all the time too, but SOMEBODY must have been buying the over 50 million albums they've sold. \n\nThe over the top hatred of isekais is basically anime hipsterism.",
                                            "score": 9,
                                            "author": "Precentor_Van_Zandt"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Your very small exposure to other people, especially in the echo chambers you put yourself in online, are far from an indicator of a general audience's taste.",
                                            "score": 10,
                                            "author": "conflictDriven"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "More than you think, unfortunately. Isekai Smartphone got another season mainly because of the LN's weirdly high international sales",
                                            "score": 5,
                                            "author": "brainrotter1993",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unfortunately for you and not isekai fans",
                                                    "score": 3,
                                                    "author": "Jazzy_Beat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Even among isekai smartphone is pretty mid, especially the second season.",
                                                            "score": 3,
                                                            "author": "hdjskamsndndbdj"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "i like smartphone. not amazing but i like it and is that why? surprising lol.",
                                                    "score": 2,
                                                    "author": "rjc523"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well, they license and dub them in droves for a reason, no? If the isekais they licensed season after season didn't put up good streaming numbers or flopped in home video sales, they wouldn't pick them up as often as they do. And they probably can be picked up cheaper than other stuff.\n\nIt's like reality TV, most opinion I hear about reality TV is negative, yet year after year, more and more keep coming because they are cheap and they get ratings and views.",
                                            "score": 1,
                                            "author": "Sturdevant"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There is wish fulfillment fans across the world. They love bland potato kun, so they can insert themselves and live through them.",
                                            "score": -7,
                                            "author": "Spicywolff",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But we also cannot discount that isekai has always, always been popular. Always! Inuyasha was and continues to be a largely successful franchise in the west. dot.hack was a fairly modest hit in its heyday in the west.",
                                                    "score": 4,
                                                    "author": "conflictDriven",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "is it? idk how well the kids of inuyasha is doing. .hack was cool. both vastly better then sao too. such shit. idk how it got isekais big. even thou it isnt one.",
                                                            "score": -3,
                                                            "author": "rjc523"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Definitely it’s a popular platform. But more and more are wish fulfillment vs new and creative ideas. I get it, as a business go for the $$ to fund the passion projects that may not sell as well.",
                                                            "score": -7,
                                                            "author": "Spicywolff",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": -1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So me agreeing with you is not getting it. So then you also don’t get it?",
                                                                            "score": -2,
                                                                            "author": "Spicywolff"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I FREAKING LOVE ISEKAI, THEY DON'T DUB ENOUGH ISEKAI!",
                                            "score": 0,
                                            "author": "weeberific"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There are some good Isekai anime that CR didn't dub, its Campfire Cooking",
                            "score": 3,
                            "author": "farhanganteng"
                        },
                        {
                            "level": 2,
                            "comment": "Angel Next Door and Skip and Loafer do deserve a dub. Couldn’t care less about the other 2",
                            "score": 3,
                            "author": "Jazzy_Beat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Skip and Loafer is my favorite show of the season far. The writing for that show is just too good! The female lead is one of the most likable characters I’ve seen in all of anime.",
                                    "score": 1,
                                    "author": "Darwin343",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "With that show having other languages dub I would be shocked if we don’t get English",
                                            "score": 1,
                                            "author": "heat495",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I hope we get an English dub of Skip and Loafer.",
                                                    "score": 1,
                                                    "author": "marioskywalker"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Take my Isekais name out your fucking mouth!",
                            "score": 2,
                            "author": "beyd1"
                        },
                        {
                            "level": 2,
                            "comment": "i like isekais but ya 90% of them are average stuff. which i like but can understand why alot dont. idk how it is still so big yet alone how sao made it big when it is not even a isekai and was an average ass anime. there was better isekais yet alone animes way before it lol.",
                            "score": 1,
                            "author": "rjc523"
                        },
                        {
                            "level": 2,
                            "comment": "It's more a travesty to me that they're dubbing arguably some of the lamer Isekais, they're not even getting to all the good Isekais, let alone other genres.",
                            "score": 1,
                            "author": "weeberific"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t know if it’s a Bunny Girl Senpai situation with perhaps Aniplex owning the master license or if it’s based off a manga but if it gets a S2 maybe then CR will go back and dub S1 like with Kaguya-sama",
                    "score": 3,
                    "author": "Guishmonster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate that Aniplex won't let many of their animes get dubs. I'm still waiting for Nisekoi and the Monogatari series to get dubbed.",
                            "score": 5,
                            "author": "marioskywalker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bro with how old those shows are I doubt they will ever get dubbed maybe for anniversary Blu-ray if we’re lucky",
                                    "score": 1,
                                    "author": "Guishmonster",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Except, Natsume's Book of Friends got dubbed recently and that's an anime from 2008.",
                                            "score": 2,
                                            "author": "marioskywalker",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Who did it?",
                                                    "score": 1,
                                                    "author": "Guishmonster",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Did what exactly? Dubbed that anime? You you're asking who dubbed Natsume's Book of Friends, Crunchyroll did, I think.",
                                                            "score": 2,
                                                            "author": "marioskywalker",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Who made it Funimation, Netflix, Sentai who?",
                                                                    "score": 1,
                                                                    "author": "Guishmonster"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Has it had a North American BluRay drop yet? Home media release is usually the 99% cut off on it getting dubbed. Few exceptions not withstanding",
                    "score": 3,
                    "author": "Awkward_Silence-"
                },
                {
                    "level": 1,
                    "comment": "I had Two Worst case scenario, First  it only got dubbed in other language like German, and then follow up with French, Spanish and Portuguese thus it not get an english dub and Second, it make us waiting many years to get an english dub just like Yuru Camp, Vinland Saga, Konosuba, Re:Zero and A Place Further than Universe",
                    "score": 0,
                    "author": "farhanganteng"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m still waiting for a dub of Legend of the Galactic Heroes DNT Season 4\n\n![gif](giphy|ISOckXUybVfQ4)",
            "score": 12,
            "author": "BigTalon256",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sadly it was canceled apparently.  confirmed by  staff [https://www.reddit.com/r/Animedubs/comments/13ekvkq/comment/jjrj2y5/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/Animedubs/comments/13ekvkq/comment/jjrj2y5/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
                    "score": 3,
                    "author": "NoDubNoLove",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait wtf?? Could you link the source for that please? That’s devastating if that’s actually the case.",
                            "score": 0,
                            "author": "BigTalon256"
                        },
                        {
                            "level": 2,
                            "comment": "Just saw the link you added, and damn that really sucks. I hope it’ll eventually get dubbed, otherwise I’ll have to either watch the subs or read the light novels.",
                            "score": 1,
                            "author": "BigTalon256"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Still waiting on Attack on titan and demon slayer",
            "score": 5,
            "author": "Crimson_Rabbit04"
        },
        {
            "level": 0,
            "comment": "I am still waiting for all the funimation dubs to be moved over",
            "score": 11,
            "author": "Legonist"
        },
        {
            "level": 0,
            "comment": "Still waiting for the Vampire Dies in No Time Season 2 to get dubbed.",
            "score": 15,
            "author": "SatisfactionFalse641"
        },
        {
            "level": 0,
            "comment": "Who knows the lack of communication on whether these shows will be dubbed at all is the worst. It would be one thing to say we will dub this at some point, but not until home video release. Instead all we get is silence. We have to sit in frustration and worry they might not get dubbed.\n\nSome shows that are lesser quality not just Isekai that are poorer quality get dubs over greater quality shows. Not complaining that they get dubs period. They need to find a way to turn out more dubs. It seems they just throw darts at a board randomly to dub shows. Rather than making an effort to study or look at source material. Heck have some staff read a volume or a little of a volume to decide for dubs.\n\nHonestly if they don't improve in any regards In this matter. As much as it pains me I feel some compulsion to cancel my yearly subscription. This would pain me to do do as a huge anime fan. Still if it needs to be done to teach them a lesson so be it. \n\nThough they can stop me doing this if they just dub The Angel Next Door Spoils Me Rotten. Along with Skip and Loafer, Mix, and, Vampire Dies 2nd season. Only then will I stop complaining. Right now they are making too many mistakes and it makes me mad.\n\n I even wrote to them which was hard to find a way to do so. It takes a lot to frustrate me to write. So I hope one of the employees at Crunchyroll sees this thread at passes on the frustration. If they choose if ore enjoy losing my service for at least a little while.\n\n Maybe I will just do monthly. I can always enjoy the source material from companies that respect good material unlike Crunchyroll at the present.",
            "score": 3,
            "author": "SolidA34",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; As much as it pains me I feel some compulsion to cancel my yearly subscription.\n\nI did that after the dub announcements for this season when they un-announced Yuri is my Job. They somehow managed to not dub every single new show that I like and follow.\n\n* Yuri is my Job\n* Skip &amp; Loafer\n* Yamada 999\n* Nee-san\n* Café Terrace\n\nAnd they still haven't dubbed Birdie Wing s1, let alone s2. I even picked an isekai this season and last season, a genre I normally don't watch and rarely enjoy. CR *loves* dubbing isekai, but between MagiRevo and now Nee-san, I managed to watch what feels like the tiny fraction of isekai that they haven't bothered dubbing.\n\nIt's reached the point where [these are CR's subtitles for a small handful of shows early last season](https://i.imgur.com/idwIPCR.png) and they aren't reliably choosing to dub the kind of content I want to watch. So then I asked myself \"What value is my subscription providing to me as a customer?\" and decided the cost wasn't worth it. I'll happily pay for dubs of shows I'm interested in. I'll begrudgingly pay for *good* subtitle-only releases. I'm not going to pay for bad subs, and I'm not going to pay to fund dubs of shows I don't care about while the shows I *do* care about routinely remain undubbed.\n\nI regret to say it, but I *miss* Funimation. At least when Funi got a license, you could expect that it would be dubbed. Outside of Aniplex streams and a *very* small number of non-Aniplex shows, if Funi got it, Funi dubbed it. That reliability was nice.",
                    "score": 2,
                    "author": "Verzwei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True it seems they are not living up to Funimation getting things dubbed. They need to fix that.",
                            "score": 2,
                            "author": "SolidA34"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You never know what they'll drop as a full season but as a seasonal show, no",
            "score": 7,
            "author": "Penguinfox24",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love Live Superstar season 2, and A Place Further than the Universe, really need to drop like that, and soon.",
                    "score": 5,
                    "author": "MegaAltarianite"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://preview.redd.it/zova4qlyz21b1.jpeg?width=1125&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=2ae709d562be9f3a3f90c6a60fded40195cb1c31\n\nFunny enough, I found this comment under an article saying the same thing. I wonder if what it says about Justin Cook is true though?",
            "score": 6,
            "author": "levisimp04",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, the person who wrote that clearly has no understanding of anime dub production or the world around them. They live life in a vacuum.",
                    "score": 31,
                    "author": "conflictDriven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "u/ButterflySilver9154 Care to explain what exactly made you point the finger at Justin Cook of all people?",
                            "score": 7,
                            "author": "awakening_knight_414",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I completely understand how you feel, but that does not justify wishing someone to be fired purely because you're not getting what you want, nor does it answer my question about Justin.",
                                            "score": 11,
                                            "author": "awakening_knight_414",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": -11,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Bro……. you do realize that Justin Cook is NOT the fucking CEO of Crunchyroll, right? If you're gonna blame anyone, blame the guy who's actually running the company, not some other guy who only works for them as a VA and producer and thus has no control over the company's dubbing decisions. Just because he produces dubs doesn't mean he actually gets to decide what gets dubbed and what doesn't.\n\nJesus Christ, you're an even bigger fucking idiot than I thought. It's bad enough that you used to shoehorn dub credits on ANN with no reliable proof whatsoever (sometimes they were even based on gut feelings alone), as well as constantly whining about backlog dubs never coming out, which only showed how much of an impatient little brat you really are, but now I find out you're so fucking braindead that you can't even be bothered to look up who the real CEO of Crunchyroll is? Get a life already you prick.\n\nAnd don't even think about telling me to \"watch my language\", because I couldn't give less of a SHIT about your feelings on swear words. I can swear at who and whenever the FUCK I want. 🙂",
                                                            "score": 12,
                                                            "author": "awakening_knight_414"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Quite sad how they want someone to be fired just because they arent getting what they want.",
                            "score": 6,
                            "author": "Draconic_Flames1260",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s okay to feel like you aren’t getting what you pay for when Crunchy routinely passes over dubbing a number of fairly popular shows for no apparent reason. Though posting online to attack people who are tangentially related is just screaming into the void.",
                                    "score": 5,
                                    "author": "DeathRose007",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah we do not know which person is making the decision's. I am saying this as someone who is frustrated with Crunchyroll's dub decision's. I like Justin Cook as an Voice Actor. We do not know who makes these choices. \n\nEven if it is him will firing him fix it? I doubt it. I would rather devote my energy to let them know I want certain shows to get dubbed. Being friendly letting them know their mistakes and what you want dubbed is mor productive.",
                                            "score": 1,
                                            "author": "SolidA34"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, and aniplex not dubbing bunny girl senpai continues to be incredibly stupid. If the point of dubs is to make money, you should dub what is the most popular to get the best return on investment. \n\nMy issue is i am paying for a service they continue to do a crappy job at providing. Crunchyroll is raking in the cash and could afford to drop more cash on expanding their dub operation, but they can’t be bothered.",
                                                    "score": 0,
                                                    "author": "hdjskamsndndbdj"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I didn’t say they aren’t free to do so. But people are also free to feel if it’s not delivering on the product they are paying for. I do think calling for some guy’s firing is a little too far, but it’s mostly meaningless. Crunchy doesn’t care. It’s just about the bottom line.\n\nYou can choose to no longer pay for it, though less people who watch dubs paying for their service might incentivize them to cut costs and thus decrease sub support.\n\nThis is just the reality. Dubs would need to become more popular to increase production support for dubs, but the lack of good support makes it harder (and more frustrating) to watch dubbed.",
                                                    "score": -5,
                                                    "author": "DeathRose007"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "plus massive layoffs in the entertainment across the board + we are in a recession",
                                                    "score": 0,
                                                    "author": "conflictDriven",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -3,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well, it'd be Sony, since they own Crunchyroll. The billionaires in charge need to recognize the value of the labor of those that work for them, especially anime voice actors. Given how profitable Crunchyroll is it is absurd.",
                                                                    "score": 0,
                                                                    "author": "conflictDriven"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "People want to get other's fired who disagree with them politically.... this shouldn't be a surprise to you.",
                                    "score": 1,
                                    "author": "BlueShipman"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't know if its just me getting older or having been around for way to fucking long...but what happened in the last few years to anime fans specially dubbed anime fans.\n\nYou have become the most spoiled, impatient group I have seen amongst the anime fandoms, its actually just sad seeing how utterly impatient &amp; downright toxic dubbed anime fans have become.\n\n...Ugh anyway peace out only really meant to stop by to remove myself from the mod list now that all my scheduled posts have gone live but felt I needed to say my little piece on how bad some of you all have made the dub community over the past few years with this bitching whinny impatient mindset anyway that's it feel free downvote me cause facing the reality of how the real world works for some of you folks is to hard.",
            "score": 6,
            "author": "jamiex304",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really don't mean to call you hypocritical, but like… didn't you used to complain about Sentai's actions all the time back in the day?",
                    "score": 14,
                    "author": "awakening_knight_414",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ALL. THE. TIME.",
                            "score": 6,
                            "author": "idkyallmfs"
                        },
                        {
                            "level": 2,
                            "comment": "Calling out Sentai for there business choices, actively releasing content undubbed even on home video effectively killing any chance of a dub &amp; wasting resources redubbing shows is not the same you can try and paint it that way honestly I dont really care if you think I'm a hypocrite.\n\nNo where above did I say 'You guys should stop all your criticism' etc. You can of course want change, you can of course hope for the show you want getting a dub and discuss it etc.\n\nWhat I'm talking about for example from this thread alone calling on / targeting specific people saying they should be fired, making posts bitching and moaning cause the company that's giving what 2 dozen or so active dubs a season isnt also giving me a couple of backlogs or full season drops on top of that. Demanding that they stop dubbing X type of shows cause its not one I want / Am in favour of. While completely ignoring the bigger picture of how things work.  What else from simply scrolling through some posts on this sub I see same doom and gloom drama bitching around casting is still going on etc.\n\nBut like I said you can think whatever you want and try and paint me whatever way you want. I said my peace.",
                            "score": 4,
                            "author": "jamiex304"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "'back in my day we had to walk uphill both ways for our dubs. They were terrible AND WE LIKED IT!'",
                    "score": 7,
                    "author": "TrenderMifflin"
                },
                {
                    "level": 1,
                    "comment": "Agreed.\n\nThis subreddit has become all about what they want and they cant seem to grasp the bigger picture.\n\nSo if they dont get what they want they just complain about it.\n\nI mean theres been dry spells before so this isnt anything new.\n\nAlso, be ready to be downvoted into obscurity as everyone caught disagreeing here is getting bombed.\n\nWhich is down right hypocritical due to the \"guidelines\".",
                    "score": 8,
                    "author": "Draconic_Flames1260"
                },
                {
                    "level": 1,
                    "comment": "Shhhhhh corporate dick rider. You can go now.",
                    "score": 5,
                    "author": "BlueShipman"
                },
                {
                    "level": 1,
                    "comment": "In no way is someone wanting something to be dubbed have anything to do with being spoiled or really even impatient. If someone doesn't desire more of something they enjoy then that just means they don't actually enjoy that thing. There's not a crazy amount of anime like there is TV shows, even more so for dubbed anime. People who don't watch TV shows and only watch dubs don't have anywhere near enough content to entertain them for an anime season. It seems to me more so that you might have some sort of problems or you don't enjoy anything in your life. People should always want more, if they don't, they get nowhere in life. Obviously entertainment is a luxury so it's not the same but you don't instantly just have to be complacent with so little because it's not a necessity in life.",
                    "score": 2,
                    "author": "Nickfelix0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you. The problem is not that we are impatient. I get they only have so much staff to dub. If it is a problem use more outside studios again. The two main problems are as I cited above in another comment in this thread\n\n One lack of communication if shows not dubbed at the present will ever get them in time for home video. At least have the decency to let us know. Two quality shows are being put down the list of priority over other shows. See my comment higher up for more clarity.\n\nThe Angel Next Door Spoils Me Rotten was one of their hot shows last season trending on their Switch App. Yet no one as gone and said. We made a mistake not dubbing it sooner. Let's fix that now. \n\nThey sent several tweets about the show on their Twitter account while it aired. The posts received lots of likes. I sent an email and tweets about it to them about it getting a dub. I still send a tweet about it now.\n\n I love the novels, as have many other people here have said the same thing about wanting a dub. Yet all we get is silence, and it is frustrating for Angel Spoils along with other great shows.",
                            "score": 1,
                            "author": "SolidA34"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I’m so glad she gone\n\nPronouns are He / Him, so it should be 'I’m so glad he's gone'. But dont worry my name is gender neutral so its not the first time someone has made that mistake.",
                            "score": 0,
                            "author": "jamiex304"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's funny, I distinctly remember you shedding a *lot* of tears in every single thread about Sentai licenses because you couldn't be sure that they'd dub it and their dubs take longer to release. Every. Single. Thread. You seemed to have a personal grudge against that company and made zero effort to hide it. Now that dub fans are in the same boat with CR+Funimation, the company licensing more and more shows that they will probably never dub, you're totally OK with them doing it, even willing to defend them, and calling out the community you were supposed to help foster. If you've got a problem with something an individual said, maybe try engaging that comment chain rather than throwing everyone under the bus and putting us all on blast for the same things you yourself constantly did.\n\nBut do go off on everyone else here, that's a great way for a moderator to address a community.",
                    "score": 0,
                    "author": "Verzwei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;that's a great way for a moderator to address a community.\n\nTell me you didn't bother to actually read my initial comment without directly telling me. Well done.\n\n![gif](giphy|bC9czlgCMtw4cj8RgH|downsized)",
                            "score": 2,
                            "author": "jamiex304",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"I have no defense when called out on my blatant hypocrisy, so I'm going to pretend to be smug and use a .gif because that makes me clever.\"\n\n&gt; You have become the most spoiled, impatient group I have seen amongst the anime fandoms, its actually just sad seeing how utterly impatient &amp; downright toxic dubbed anime fans have become.\n\nThis has described you for months, if not years. It's just... so trashy that you'd step down from a moderation team and then turn around and insult the community in this way, for the exact type of toxicity that you yourself routinely contributed to. It makes the community look worse than it is, and it makes you look worse than you already are. There's just no reason to be a prick on your way out the door like this, there's nothing for anyone to gain, it's for nobody's benefit.\n\nIf you wanted to argue with the user potentially witch-hunting a CR employee, then by all means engage with that. That isn't what you did. You made a *parent-level* comment to basically say \"I hate you all and I quit.\" You probably should've stepped down sooner. Giggling Kevin is a *great* rebuttal, though, I feel very owned.",
                                    "score": 1,
                                    "author": "Verzwei",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh bored of spamming me private [chat messages](https://ibb.co/KrkbvDk) or following me into different subreddits to harass me on other posts. Thanks for being the perfect example case and for the laugh.",
                                                    "score": 5,
                                                    "author": "jamiex304"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;You probably should've stepped down sooner.\n\n[Yup for example like 4 months ago or so.](https://www.reddit.com/r/Animedubs/comments/10fyl6r/quick_update_calendar_goodbye_etc/) but it is what it is. I dont really need to defend myself again to what you see as  hypocrisy already responded to this exact question above.\n\nBut you do you I cant / nor do I care to make you like the words or sentences I used. I was saying my general peace after having modded this and another dub community's for a few years and seeing a whole lot of what this fandom offers. Which last time I checked I have the right to do but I am just one dude so feel whatever way you want.",
                                            "score": 2,
                                            "author": "jamiex304",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Quick question: [Is this you?](https://old.reddit.com/r/Animedubs/comments/vmqyz8/sentai_september_2022_releases_include_the_dororo/ie2khx1/)\n\nYou don't have to answer. It's you. I'll copy the comment text here to save anyone the click:\n\n&gt; **Welp there goes seeing Yuki Yuna S3 DUBBED so much for the 'they will will dub it on home release dont worry' some of ya all like to spout off while you simp for Sentai getting titles these days or should we just keep huffing on copium believing that Sentai actually gives two fucks about DUB fans ?**\n&gt; \n&gt; **Thanks for fucking nothing again Sentai.**\n\nThat was you, 11 months ago, when you were a moderator for this community, raging that Sentai Filmworks didn't dub the third season of a show. A show where &lt;checks notes&gt; they already hadn't dubbed the second season. A show where they *didn't even dub the first season*. The season 1 dub was done by Bang Zoom, contracted by PonyCan when they were still operating in this market. Sentai scooped up the show as a license rescue. \n\nLook, I get it. It sucks when a show you like doesn't get a dub. I feel exactly the same way. I've got no shortage of salt over Yuri is my Job. But for you to rage about it in the way in which you do, calling others in this community \"simps huffing copium\" because Sentai didn't finish a dub that *they never even started* is something else. Even in *that* thread, someone was telling you to shut up, because you did this constantly. It brings me back to what you originally said in your parent-level comment in this thread:\n\n&gt; You have become the most spoiled, impatient group I have seen amongst the anime fandoms, its actually just sad seeing how utterly impatient &amp; downright toxic dubbed anime fans have become.\n\n&gt; [...] how bad some of you all have made the dub community over the past few years with this bitching whinny impatient mindset anyway that's it feel free downvote me cause facing the reality of how the real world works for some of you folks is to hard.\n\nThis is you. You're whinging about you. The things that you said. I promise you, you will be better as a person if you can realize that. Are you *solely* responsible for this type of negativity? Of course not. Did you heavily contribute to it? Absolutely.\n\nAnd if you're wondering \"Wow, it's oddly specific that Verzwei has this example ready to rip from a random home release thread nearly a year ago\" that's because *I already complained about your outbursts and toxicity in a private discord back when it happened* so it was easy to source. [link 1](https://i.imgur.com/8ATLYsG.png) and [link 2.](https://i.imgur.com/3qCUQ21.png) *Edit: And I'm pretty sure I did report your constant negativity and toxicity through proper channels back then, and nothing was done about it, so yeah I complained about it elsewhere while visiting this community less. It was never my intention to have a public spat until you decided to put this community on blast on your way out the door, for shit you yourself did.*",
                                                    "score": -1,
                                                    "author": "Verzwei",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Like I said, already address it above in [another comment](https://www.reddit.com/r/Animedubs/comments/13n4d94/comment/jkzhp8m/?utm_source=share&amp;utm_medium=web2x&amp;context=3), weather you like / accept my reasoning is your choice not mine. I'm happy with it and you wont get me to change my mind cause you feel I'm being hypocritical / you believe it will make me a better person which is a wild assumption to make about someone you dont know so if that's your aim or whatever your wasting your time.\n\n&gt;And if you're wondering \"Wow, it's oddly specific that Verzwei has this example ready to rip from a random home release thread nearly a year ago\" that's because *I already complained about your outbursts and toxicity in a private discord back when it happened* so it was easy to source. [link 1](https://i.imgur.com/8ATLYsG.png) and [link 2](https://i.imgur.com/3qCUQ21.png)\n\nYou can stand on whatever high-ground you want and tell me I'm such a toxic person or tell me about how you complain, judge my grammatical errors *(I'm dyslexic something I have stated many times on this subreddit along with thanking people here when they offered me spelling / grammar corrections &amp; last time I checked being dyslexic is not a disqualifying aspect for a mod on reddit just as an fyi)* and seem to distain me in private discords your a part of, again your choice I cant control how a random stranger on the internet feels / see's me. Personally I think shit talking people privately and then using said private shit talk publicly in your argument doesn't paint you in the best light as a person but that's just me, I'm sure you disagree your choice not mine nor will I try and change your mind or say it will make you a better person cause we dont know know each other at the end of the day.\n\nBut I will do you us both a favour and check out of this now cause I think we both know its going nowhere and is just wasting each of our time which I'm sure we both have better use for. I hope you can enjoy this subreddit now that I am gone.",
                                                            "score": 2,
                                                            "author": "jamiex304"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only backlog dub we got this season was In/Spectre S2. Nothing aside from that.",
            "score": 4,
            "author": "272b"
        },
        {
            "level": 0,
            "comment": "It's only going to get worse with the inevitable SAG and voice actors union strikes.",
            "score": -13,
            "author": "fightin_blue_hens",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crunchyroll doesn't do union productions, so even if there is a strike, it wouldn't have any effect on Crunchyroll at all. For better or for worse.",
                    "score": 12,
                    "author": "YojimboUsagi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Still may effect them, they still have union vas that do non-union work on occasion for continuing seasons and the occasional backlog dub. If those VAs are striking I doubt that they will make exception just bc it's a non-union production.",
                            "score": -4,
                            "author": "Sturdevant",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All it means is they won't use those actors. Just like Ben Diskin refusing to return to his role on My Hero Academia in season 6, they'll just replace any actor that refuses to return or strikes. And if it is a new show, they just won't cast anyone striking. A vast majority of their actors would need to strike, but most of the Tesas-based voice actors that Crunchyroll employs probably aren't even union members because all the work they do is non-union, so that isn't going to happen.",
                                    "score": 7,
                                    "author": "YojimboUsagi"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To my understanding, it's only towards Alliance of Motion Picture and Television Producers (AMPTP) the same ones that Writers Guild of America (WGA) are striking against.",
                    "score": 5,
                    "author": "Mikey0714"
                },
                {
                    "level": 1,
                    "comment": "a strike that is long, long overdo",
                    "score": -2,
                    "author": "conflictDriven"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m STILL waiting on AOT season 4 part 3. Trying to keep myself spoiler free.",
            "score": 1,
            "author": "Toni_Odejimi"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "gross",
                    "score": 13,
                    "author": "conflictDriven"
                },
                {
                    "level": 1,
                    "comment": "I can't even wrap my head around this extremely hurtful and thoroughly insensitive mindset.",
                    "score": 12,
                    "author": "Kriscomics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your stupidity is not funny. Please shut up.",
                                    "score": 4,
                                    "author": "levisimp04"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I still don't get why Crunchyroll decided that Kamikatsu needed a dub. Yeah, it gets decent, at best, after 5 episodes, but by then, I dropped it because I thought it sucked balls.",
            "score": -2,
            "author": "marioskywalker",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's on you for having poor taste... The show is great and so is the dub.",
                    "score": 3,
                    "author": "AnimeHeretic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No Marginal Service?",
            "score": 0,
            "author": "WheelJack83"
        }
    ]
}