{
    "id": "13o6y8i",
    "score": 56,
    "title": "Mobile Suit Gundam: The Witch from Mercury - Episode 16 - Dub Available Now on Crunchyroll!",
    "author": "MarvelsGrantMan136",
    "date": 1684704624.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13o6y8i",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/13o6y8i/mobile_suit_gundam_the_witch_from_mercury_episode/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/series/G79H2307W/mobile-suit-gundam-the-witch-from-mercury)"
    ],
    "postText": "**Mobile Suit Gundam: The Witch from Mercury**\n\n* **Episode 16**\n\n[Dub Available Now on Crunchyroll!](https://www.crunchyroll.com/series/G79H2307W/mobile-suit-gundam-the-witch-from-mercury)\n\n\\---\n\nCast\n\n* **Suletta** voiced by Jill Harris\n* **Miorine** voiced by Natalie Van Sistine\n* **Prospera** voiced by Elizabeth Maxwell\n* **Guel** voiced by Bradley Gareth\n* **Elan** voiced by Aaron Dismuke\n* **Chuatury** voiced by Brittany Karbowski\n* **Nika** voiced by Bryn Apprill\n* **Shaddiq** voiced by Alejandro Saab\n* **Delling** voiced by Gabe Kunda\n* **Vim** voiced by Christopher R. Sabat\n* **Nuno** voiced by Eric Vale\n* **Lauda** voiced by Nazeeh Tarsha\n* **Lilique** voiced by Sara Ragsdale\n* **Petra** voiced by Kimberly Grace\n* **Felsi** voiced by Alexis Tipton\n* **Rouji** voiced by Kristin Payne\n* **Secilla** voiced by Cassie Ewulu\n* **Sarius** voiced by Mike Smith\n* **Rajan** voiced by Ian Sinclair\n* **Haro** voiced by Jerry Jewell\n\nCrew:\n\n* **ADR Director:** Jason Lord\n* **Assistant ADR Director:** Aaron Roberts\n* **ADR Engineer:** Noah Whitehead\n* **Assistant ADR Engineer:** Coco Caesar\n* **Script Supervisors:** Bonny Clinkenbeard, Jarrod Greene\n* **ADR Scriptwriter:** Alex Mai\n* **ADR Prep:** Olivia Harris",
    "comments": [
        {
            "level": 0,
            "comment": "Prospera really gives me the creeps. The story keeps getting more and more complex, and I love it.",
            "score": 8,
            "author": "llJay24ll",
            "replies": [
                {
                    "level": 1,
                    "comment": "She is definitely unhinged and a manipulater. Suletta will have to make a choice of following or disobeying her mother",
                    "score": 2,
                    "author": "SolidA34"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At this point, I wonder if Prospera even loves Suletta. Does Prospera even see her as her own daughter? Is Suletta even her daughter? Or is she some clone that Prospera only sees as a tool to be used?",
            "score": 3,
            "author": "Darwin343",
            "replies": [
                {
                    "level": 1,
                    "comment": "At this point, I can see three Suletta backstories.\n\nOne is that she's the second biological daughter of Prospera. This would be hard since Suletta looks almost identical to Eri and Prospera's husband was long dead before Suletta would have been conceived. It would also make her treatment of Suletta the most jarring.\n\nSecond would be that Suletta is just some random girl that got the same body modification/reconstruction that the Elans received, and had her memories altered. This would at least explain why Prospera is an uncaring bitch towards her.\n\nThird would be that Suletta is some kind of clone of Ericht. This would explain why Prospera doesn't care about her, since she's just a copy. It could also set the grounds for a climactic showdown, since Eri was apparently the only one to weather the data storms without burning her brain out. If Suletta is a clone that could mean she has the same resistance Eri had, and our final battle would be Eri/Aeriel vs Suletta.",
                    "score": 6,
                    "author": "SoundOf1HandClapping",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; and our final battle would be Eri/Aeriel vs Suletta.\n\nHonestly i cant See This Happening.\n\nProspera May or May Not Care about Suletta as a Daughter but i Believe (A)eri(el) 100% genuinely Cares about her as a Sister.\n\nWe only ever hear Sulettas Side of their conversations but that Part alone makes them Sound Like their between people who Like each other (and Eri doesnt Seem Like shed manipulate Suletta Like Prospera).\n\nEri also seems pretty protective about Suletta, raising her permet Score and taking Control whenever necessary to keep her from Losing.\n\nShe also Trusts Suletta. After she disables the Antidote against shaddik she Just sits Back at Sulettas request because she says Shell be fine and thats enough for Eri. \n\nIf anything i could See the final Fight being an emancipated Suletta with Aerial against Prospera\n\nEdit: i have now read the Prequel Story [Cradle Planet](https://en.gundam.info/about-gundam/series-pages/witch/music/novel/) and it only increased my belief in this\n\nHere are some quotes *directly* from Aerial, the POV of the Story\n\n&gt; That's my Suletta. My little pilot.\n\n&gt; I can understand his situation, but it's no reason to be mean to Suletta.\n\n&gt; She's a good girl.\n\n&gt; She isn't lying. If Suletta says we'll be back in four, we'll be back in four.\n\n&gt; But don't worry.  \n&gt; You'll always have me.  \n&gt; Even if you can't go to school or make new friends,   \n&gt; I'll still be with you.\n\n&gt; No.  \n&gt; No, Mom.  \n&gt; I don't mind going, but not Suletta. She's such a good girl.  \n&gt; If you want revenge, you and I can do it ourselves. Just keep her out of this.",
                            "score": 3,
                            "author": "dem53605"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So that's Prospera's game. Expand the permet network so Eri can leave the shell of the ~~Eri-L~~ Aerial and become some kind of transcendent techno-consciousness.\n\nIn the opening scene we see one of the Earther infantry teams take out one of the mobile suits with a rocket launcher. Antiarmor teams are a big threat to modern day tanks, so usually infantry is usually deployed alongside armor to protect the tanks. Good to see the same tactics apply even when the tanks are giant walking mechs.\n\nI had written off the two Jeturk girls as only fangirling Guel for his status, but they both seemed genuinely happy to see him back. Nice touch of character development.",
            "score": 1,
            "author": "SoundOf1HandClapping"
        },
        {
            "level": 0,
            "comment": "Prospera is becoming my favorite Gundam villain. Another great episode.",
            "score": 1,
            "author": "BigTalon256"
        }
    ]
}