{
    "id": "13pdd6y",
    "score": 64,
    "title": "Ōoku: The Inner Chambers Anime (Key Art) - June 29 on Netflix",
    "author": "AnimeXFan1995",
    "date": 1684814500.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13pdd6y",
    "media_urls": [
        "https://i.redd.it/qm4kijniqj1b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Netflix has revealed key art of the upcoming anime, *Ōoku: The Inner Chambers* with a streaming release date on June 29!\n\nNoriyuki Abe is directing the anime at Studio DEEN. Rika Takasugi is writing the script, Yōko Satō is the character designer, and Kenji Kawai is composing the music.",
            "score": 6,
            "author": "AnimeXFan1995"
        },
        {
            "level": 0,
            "comment": "Some serious Lady Eboshi vibes.",
            "score": 2,
            "author": "bonesnaps"
        },
        {
            "level": 0,
            "comment": "This is probably the most realistic looking anime in years. A lot of animes have gone for the moe artstyle or some variant for it for most of the female cast. Except the villainesses, although in some cases, even then. Not that I mind the moe aesthetics.",
            "score": 2,
            "author": "marioskywalker"
        },
        {
            "level": 0,
            "comment": "What this is getting an anime?  Holy shit!  An extremely well written manga.\n\nBut… it’s Netflix so it will be garbage.\n\nI don’t know why you’d downvote me.  I love this manga.  It’s amazing.  But Netflix doesn’t have a good reputation.  You people are weird.",
            "score": -9,
            "author": "NamisKnockers",
            "replies": [
                {
                    "level": 1,
                    "comment": "What Netflix anime were garbage?",
                    "score": 3,
                    "author": "CouncilmanRickPrime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don’t have a great reputation for adaptation.",
                            "score": -3,
                            "author": "NamisKnockers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Uncle from another world, romantic killer, I'm sure there's others but those are recent ones that come to mind",
                                    "score": 3,
                                    "author": "RexiLabs",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Romantic killer is a terrible show",
                                            "score": 1,
                                            "author": "NamisKnockers",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To each their own I guess -- I didn't love it, but I did enjoy it.  Looks like it got 8.1 on MAL, pretty decent score, always seems that only a small handful of anime each season get over 8.",
                                                    "score": 2,
                                                    "author": "RexiLabs",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The writing was absolutely horrific",
                                                            "score": 0,
                                                            "author": "NamisKnockers"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Castlevania is pretty rad.\n\nNot sure what else they produced but that was an original Netflix series.",
                                    "score": 2,
                                    "author": "bonesnaps"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, is this going to be weekly or all at once?",
            "score": 0,
            "author": "Codtahasabir",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of the Netflix Original and the Licensed Anime (released 3-4 months after) prior to Komi and Blue Period are released all at once.\n\nVinland Saga Season 2 had its episodes released weekly, Blue Period had its episodes released a week after the previous episode and Komi and Uncle from Another World had a 2 week episode delay.",
                    "score": 1,
                    "author": "AnimeXFan1995",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see.",
                            "score": 0,
                            "author": "Codtahasabir"
                        }
                    ]
                }
            ]
        }
    ]
}