{
    "id": "13rkcfd",
    "score": 228,
    "title": "Oshi no Ko | English Opening by YOASOBI (\"Idol\")",
    "author": "MarvelsGrantMan136",
    "date": 1685027502.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13rkcfd",
    "media_urls": [
        "https://v.redd.it/j1wlt8qub12b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "We almost never get official English covers, but YAOSOBI did the opening in Japanese and English. She sounds amazing in both versions.\n\nLast big show I remember doing this was Stray Kids for Tower of God, which was great.",
            "score": 44,
            "author": "MarvelsGrantMan136",
            "replies": [
                {
                    "level": 1,
                    "comment": "Didnt the Rising of Shield Hero op do this? Rise by MadKid or something? I still prefered the sub but this one sounds really good in english. Will be added it to my playlist xD",
                    "score": 9,
                    "author": "WeWillSeizeJerusalem",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yoasobi has done English versions of other songs too that weren't associated with anime, so I'm not surprised.\n\nDidn't shield hero use the English version in the dub though? The dub version of Oshi no ko uses the Japanese version of the song though, so that's the difference",
                            "score": 1,
                            "author": "Spaceguy5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For shield hero Madkid did english versions for rise and faith from season one as well as Bring back for season two.",
                                    "score": 1,
                                    "author": "Vast_Animator6928",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I know and acknowledged that, but weren't those also used in the official dub as openings?",
                                            "score": 1,
                                            "author": "Spaceguy5",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea they were. Also best guess as to why is because crunchyroll had a hand in Rising of the Shield hero being made so they asked for english versions already to go at the time of release. The japanese cd singles have the english versions included.",
                                                    "score": 1,
                                                    "author": "Vast_Animator6928"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Beverly did an English version of \"Again\", the first ending of season 1 of Fruits Basket. https://www.youtube.com/watch?v=c0T_PHv11Z4 I guess that was a little before Tower of God though.",
                    "score": 7,
                    "author": "MegaAltarianite"
                },
                {
                    "level": 1,
                    "comment": "Um Yaosobi has a tendency to do this, or are you talking about anime in general?\n\nhttps://youtu.be/b3K61cQ8_fg\n\nThey also did it with Monster (Beastars) and The Blessing (Gundam Witch). \n\nEither way, ngl not their finest work. I think it's because of the different type of singing style they used for the OG version itself. Whereas in Japanese the rap style sounds slightly tonally harsh, it sounds childish in the English version.",
                    "score": 4,
                    "author": "Dramatic-Editor-664",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yea that’s what i noticed with this song prior to this english version the english covers just don’t work",
                            "score": -1,
                            "author": "Mr_OwO_Kat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i just ment the song doesn’t really work in english",
                                            "score": 1,
                                            "author": "Mr_OwO_Kat"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bruh, the genius behind the lyrics and visuals have made this a standout OP of the season/year for me.",
            "score": 19,
            "author": "Chun-Li_Forever"
        },
        {
            "level": 0,
            "comment": "English covers from JPN bands are usually pretty hard to pull off simply because adaptive lyric writing is such a unique skill, and like a lot of others, I wish this had another pass.\n\nMost recent example I can think of where they *did* completely pull it off was probably the 1st Case Study of Vanitas ED by LMYK. If anything I probably preferred the ENG version of the song, which is so rare.",
            "score": 7,
            "author": "KitKat1721"
        },
        {
            "level": 0,
            "comment": "Watching the music video this time in the English version made me tear up again, it's just as great and hits hard as the Japanese version. English versions of anime openings especially if that anime has become a huge hit globally such as this is such an incredible way to reach more international fans. Yoasobi has delivered once more.",
            "score": 13,
            "author": "drawricks"
        },
        {
            "level": 0,
            "comment": "Huh, interesting.\n\nCan we get an English version of Mephisto by Queen Bee too please?",
            "score": 3,
            "author": "awakening_knight_414"
        },
        {
            "level": 0,
            "comment": "This is just awesome.    \nWas waiting for the dub of the show so didn't watch the sub - but watched that dub yesterday and oooooo boy did it hit hard.  Epic OP. And I love that they did it english AND japanese.  Really cool.",
            "score": 3,
            "author": "mylastdream15"
        },
        {
            "level": 0,
            "comment": "Does the dub have the op in English or is this just a music video",
            "score": 1,
            "author": "blabka3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Music video",
                    "score": 1,
                    "author": "Crusherbolt0282"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is so cool.  I’m usually not a fan of English covers but if it’s by the original artist then I’m all for it!",
            "score": 0,
            "author": "The4FiveSix",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's an original artist.",
                    "score": 6,
                    "author": "SassyHoe97"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "bruh do you even know what you're saying?",
                            "score": 5,
                            "author": "LinksXCV"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Flames also got a cover by the official singer. Its great",
            "score": 1,
            "author": "Legend-Found1"
        },
        {
            "level": 0,
            "comment": "Peak fiction",
            "score": 1,
            "author": "Hakaishin_Sama"
        },
        {
            "level": 0,
            "comment": "Just as good as the Jp version although I prefer it over the Eng by a little margin",
            "score": 1,
            "author": "Crusherbolt0282"
        },
        {
            "level": 0,
            "comment": "Was this in the ending of Episode 1 as I didn't see it?",
            "score": 0,
            "author": "arkhamtheknight",
            "replies": [
                {
                    "level": 1,
                    "comment": "No it was the Japanese version.",
                    "score": 1,
                    "author": "sarahxox1992"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this used in the English dub?",
            "score": 0,
            "author": "Bluebaronbbb",
            "replies": [
                {
                    "level": 1,
                    "comment": "No dub episodes have been released since the song was released.",
                    "score": 3,
                    "author": "WindowlessBasement",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn't the dub of ep 1 just show up?",
                            "score": 1,
                            "author": "Bluebaronbbb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, the day before the English song was released.",
                                    "score": 1,
                                    "author": "WindowlessBasement"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}