{
    "id": "13rrorw",
    "score": 44,
    "title": "The Ancient Magus' Bride - Season 2, Episode 6 - Dub Available Now on Crunchyroll!",
    "author": "MarvelsGrantMan136",
    "date": 1685044858.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13rrorw",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/13rrorw/the_ancient_magus_bride_season_2_episode_6_dub/"
    ],
    "other_urls": [
        "https://www.crunchyroll.com/series/GRZXQJJ8Y/the-ancient-magus-bride)"
    ],
    "postText": "**The Ancient Magus' Bride**\n\n* **Season 2, Episode 6**\n\n[Dub Available Now on Crunchyroll!](https://www.crunchyroll.com/series/GRZXQJJ8Y/the-ancient-magus-bride)\n\n\\---\n\nCast\n\n* Chise voiced by Dani Chambers\n* Elias voiced by Brian Mathis\n\nCrew\n\n* ADR Director: Cris George\n* ADR Engineer: Jose Sandoval\n* ADR Mix Engineer: Gino Palencia\n* ADR Script Writer: James Cheek\n\nSynopsis:\n\n&gt;Hatori Chise has lived a life full of neglect and abuse, devoid of anything resembling love. Far from the warmth of family, she has had her share of troubles and pitfalls. Just when all hope seems lost, a fateful encounter awaits her. When a man with the head of a beast, wielding strange powers, obtains her through a slave auction, Chise's life will never be the same again. The man is a \"magus,\"a sorcerer of great power, who decides to free Chise from the bonds of captivity. The magus then makes a bold statement: Chise will become his apprentice--and his bride!",
    "comments": [
        {
            "level": 0,
            "comment": "I must be dense like most harem MCs because I can’t tell whether or not Alice has romantic feelings for Renfred lol. I’m leading on the side of no but I could very well be mistaken. \n\nCan’t wait for next episode. While I did enjoy this episode, I much prefer it when Chise’s classmates are involved in the story as well.",
            "score": 4,
            "author": "Darwin343"
        },
        {
            "level": 0,
            "comment": "For anyone wondering [Tyler Carson is indeed back as Simon](https://twitter.com/TaiCheesy/status/1662219587096817664)",
            "score": 3,
            "author": "JRPictures"
        },
        {
            "level": 0,
            "comment": "God the chibi bits felt incredibly shoehorned in this episode. Like bruh just let the seriousness of the scenes flow smoothly for once. It feels immersion-breaking.\n\nLooks like next episode we'll be seeing Veronica again. Ngl I just wanna punch her fake ass smile right off her face every time I see it.",
            "score": 2,
            "author": "awakening_knight_414"
        },
        {
            "level": 0,
            "comment": "I agree with the other dude. The nice tender moments suffer mood whiplash from the stupid chibi moments.",
            "score": 2,
            "author": "SoundOf1HandClapping"
        },
        {
            "level": 0,
            "comment": "I loved the roof top scene, and the discussion of how people see their relationships. I also like when some of these scenes do not use music, but atmospheric sounds like the wind only. It is very relaxing.",
            "score": 1,
            "author": "SolidA34"
        }
    ]
}