{
    "id": "13ty945",
    "score": 113,
    "title": "'BLEACH: Thousand-Year Blood War, Part 2 – The Separation' Key Visual",
    "author": "MarvelsGrantMan136",
    "date": 1685273547.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13ty945",
    "media_urls": [
        "https://i.redd.it/2c8p32penl2b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Very excited for the 2nd half of the Thousand Year Blood War returning on July 7/8.\n\nNow let’s address the \"Elephant in the Room\" or Cat In the Room regarding Yoruichi, curious if Wendee Lee will return to voice her or much like Jamieson Price and Erin Fitzgerald who did not return to voice Yasutora \"Chad\" Sado and Franceska Mila Rose respectively due to no longer voicing people of color, Yoruichi would be voiced by a different actress instead?",
            "score": 17,
            "author": "AnimeXFan1995",
            "replies": [
                {
                    "level": 1,
                    "comment": "respectively due to no longer voicing people of color?",
                    "score": 3,
                    "author": "rjc523",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is interesting... though I will say aren't most characters in Bleach 'person of color' since they are supposed to represent Japanese? Person of color doesn't just mean darker skin individual, for a lack of a better word it just means non-white (or more specifially non-European)",
                            "score": 3,
                            "author": "Diorgenson432"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Erin Fitzgerald didn't return for the simple fact that it was non-union. She confirmed this in Twitter when asked. I do wish for Wendee Lee to make a return ideally since i like her voice. Though if that can't happen, I'd like the new voice actor to sound as close to her as much as possible (while obviously giving her own take and flaire) like Chad voice actor does for Price. In fact, Chad has had 3 voice actor so far and the new one sounds like the perfect mixture of both the original Chad and Jamieson Price.",
                    "score": 0,
                    "author": "Diorgenson432",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Erin Fitzgerald didn't return for the simple fact that it was non-union.\n\nI know that. I was mainly talking about the fact about Erin and Jamieson not returning as they don’t want to voice characters of color anymore and I was wondering If Wendee Lee would also not return to voice Yoruichi.",
                            "score": 2,
                            "author": "AnimeXFan1995"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’d say it’s a pretty safe bet that she’ll return.",
                    "score": 0,
                    "author": "Ajthekid5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I’d say it’s a pretty safe bet that she’ll return.\n\nIt’s literally just a wait and see u/Ajthekid5 and frankly I like to play things by ear, If Wendee does comes back as Yoruichi then awesome, but in the event she doesn’t want to continue voicing her, then there’s a 50/50 chance Yoruichi could get a new voice actress.\n\nUntil then we shall see.",
                            "score": 2,
                            "author": "AnimeXFan1995",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I doubt she’ll get a new actress. In a pretty recent interview with Chris Mayek she says she loves playing characters of color and I doubt she’d willingly give up one of her more popular characters.Not to mention she’s already returned as Menoly.",
                                    "score": 1,
                                    "author": "Ajthekid5",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But Chris Only had one interview with Wendee Lee back in 2020 he hasn’t had any interviews from her since then.",
                                            "score": 9,
                                            "author": "AnimeXFan1995",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That doesn’t change my point. Especially since she’s taken up roles of characters with darker skin tones like ARSHES from Bastard! (Another Studiopolis dub)",
                                                    "score": 2,
                                                    "author": "Ajthekid5",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;**That doesn’t change my point. Especially since she’s taken up roles of characters with darker skin tones like ARSHES from Bastard! (Another Studiopolis dub)**\n\nu/Ajthekid5 enough, I’m not saying Wendee is not coming to return as Yoruichi all I’m saying if she would be returning to reprise her role or not is it not difficult to understand?!?",
                                                            "score": 3,
                                                            "author": "AnimeXFan1995"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it's like Part 1, the dub should start in late July/early August.\n\n[Source](https://twitter.com/VIZMedia/status/1662783556232564736)",
            "score": 10,
            "author": "MarvelsGrantMan136"
        },
        {
            "level": 0,
            "comment": "Honestly, I hope if at all possible, they could get more of the original cast for this season for the dub. Kenpachi, I'm content it's not going to happen. But the rest like Shinji, etc it can. And hope they quit the triplet casting that they did for season 1 of the Thousand Blood Year War Arc.",
            "score": 10,
            "author": "Diorgenson432",
            "replies": [
                {
                    "level": 1,
                    "comment": "triplet casting?",
                    "score": 2,
                    "author": "rjc523",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, by that there were many new actors playing three characters. Even  within the same villain group. It was worst than Jujutsu Kaisen. For something as popular as Bleach, we shouldn't be doing this. I'm sure they could have gotten all sorts of actors to fill in the role.",
                            "score": 5,
                            "author": "Diorgenson432",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, Bleach was one of the few OG animes that had a dub that rivaled the sub in popularity. There was an insane amount of hype for this dub. If any dub deserved to be union it was this one.\n\nI'm honestly super disappointed with how promotion was handled for the dub too. Barely any cast interviews, not a single dub trailer. I feel like this dub should have received an equal amount of attention and marketing as the sub.",
                                    "score": 4,
                                    "author": "Effective_Dish8894",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I blame it being in Hulu. They rarely promote their anime.",
                                            "score": 3,
                                            "author": "Diorgenson432"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah the Dub had disappointed many fans who were all very anticipated to watch it, they could have make it Union but No, They decided to go cheap and rushed to it. It’s like they didn’t cared for us fans. \n\nDavid Lodge was really willing to reprise Kenpachi again even he was getting payed Low, but nope, they decided to still recast him.\nSome recast were understandable (Ryuken, Ikkaku and Hallibel) but Major characters (Shinji and Jushiro) recast by the same actor. I was praying so bad for Roger come back as Shinji, and hopes are crushed\n\nI’m with what you said, hopefully they can do some improvements at least. Even to get Roger to play Shinji again. Maybe that Hiatus could have done something good.",
                    "score": 1,
                    "author": "SatisfactionFalse641",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The actual dub is obviously great with many spectacular performances. Just the recasting was the main issue, and hopefully it's less so for season 2 of this Final Arc.",
                            "score": 8,
                            "author": "Diorgenson432",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If I'm being honest, I hadn't watched Bleach in so long that the recasting didn't bother me much because like you said, the performances were spectacular!",
                                    "score": 1,
                                    "author": "Darwin343"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; was getting *paid* Low, but\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "score": 0,
                            "author": "Paid-Not-Payed-Bot"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;David Lodge was really willing to reprise Kenpachi again even he was getting payed Low, but nope, they decided to still recast him.\n\nCorrection: David left during in the middle of original series which the character was recast to Patrick Seitz. Kenpachi didn't get a second recast since Patrick still reprised his role for this series.\n\n&gt;Major characters (Shinji and Jushiro) recast by the same actor. I was praying so bad for Roger come back as Shinji, and hopes are crushed\n\nLiam O' Brien and Roger Craig Smith likely stopped reprising their ongoing non-union roles as they primarily now does cartoons and Western video games. Plus, Liam is also part of Critical Role.",
                            "score": 1,
                            "author": "Player2LightWater",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; was getting *paid* Low, but\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                    "score": 2,
                                    "author": "Paid-Not-Payed-Bot"
                                },
                                {
                                    "level": 3,
                                    "comment": "Had Netflix picked this up, we would have gotten them back. Liam and Roger still do union anime, even recently. It was mostly a non-union thing.",
                                    "score": 1,
                                    "author": "Diorgenson432"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting use of language used by this announcement; \"streams in six languages starting on July 8\". Not getting my hopes up but this could infer that we could get the english dub quicker than last time.",
            "score": 5,
            "author": "mcdrac",
            "replies": [
                {
                    "level": 1,
                    "comment": "They mean the sub, since part 1 was simulcasted only in english.",
                    "score": 7,
                    "author": "Ok-Knowledge5106"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hell yeah bud! cant wait but same time i want to wait til it fully done. the arc lol",
            "score": 1,
            "author": "rjc523"
        }
    ]
}