{
    "id": "13yswun",
    "score": 12,
    "title": "Shows where a guy unexpectedly likes flowers/gardening?",
    "author": "weeberific",
    "date": 1685747458.0,
    "url": "https://www.reddit.com/r/animedubs/comments/13yswun",
    "media_urls": [],
    "other_urls": [],
    "postText": "Wondering if there's enough shows to consider it a trope, where a guy who's supposed to be tough, or thought to be, likes flowers or gardening.\n\nShows that come to mind:\n\n* Sword Art Online Alicization\n* Ice Blade Sorcerer\n* History's Strongest Disciple: Kenichi\n\nI think there are more, but I can't think of them.",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to Demon School Iruma-kun",
            "score": 4,
            "author": "Darwin343",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that in the later seasons? I only watched season 1 and I don't remember it.",
                    "score": 2,
                    "author": "weeberific"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*Ice Blade Sorcerer* is actually the only one I know of, but you beat me to the punch.",
            "score": 5,
            "author": "eddmario"
        },
        {
            "level": 0,
            "comment": "&gt; Sword Art Online Alicization\n\nI really love that scene. It shows, despite having fun in the Underworld, Kirito misses home and his love ones",
            "score": 3,
            "author": "Yakuza-wolf_kiwami"
        },
        {
            "level": 0,
            "comment": "Considering there's more than I could list here in any reasonable amount of time, I think it's safe to say it's a *very* well established trope. Hell, IRL I know people (myself included) who fit that trope! Anime-Planet even has 'gardener' and 'florist' tags for browsing characters. \n\nIf you feel like going down that particular rabbit hole, you could probably spend a good long while browsing through the many, *many* gardener and florist characters, picking out the male characters, reading bios and most likely find some great new shows to watch.\n\nhttps://www.anime-planet.com/characters/tags",
            "score": 1,
            "author": "Tricanum",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmm, I looked through all the gardeners and florists but they didn't even have the ones I listed, and nothing new that quite matches the trope here.",
                    "score": 1,
                    "author": "weeberific"
                }
            ]
        }
    ]
}