{
    "id": "144d78a",
    "score": 83,
    "title": "Farming Life in Another World - Episode 1 (PREMIERE) - Dub Available Now on HIDIVE!",
    "author": "MarvelsGrantMan136",
    "date": 1686240178.0,
    "url": "https://www.reddit.com/r/animedubs/comments/144d78a",
    "media_urls": [
        "https://www.reddit.com/r/Animedubs/comments/144d78a/farming_life_in_another_world_episode_1_premiere/"
    ],
    "other_urls": [
        "https://www.hidive.com/tv/farming-life-in-another-world?q=Farming+Life+In+Another+World)"
    ],
    "postText": "**Farming Life in Another World**\n\n* **Episode 1 (PREMIERE)**\n\n[Dub Available Now on HIDIVE!](https://www.hidive.com/tv/farming-life-in-another-world?q=Farming+Life+In+Another+World)\n\n\\---\n\nMain Cast:\n\n* Blake Shepard *as* **Hiraku Machio**\n* Katelyn Barr *as* **Lea**\n* Luci Christian *as* **Lu Lulucy**\n* Monica Rial *as* **Tia**\n\nSynopsis:\n\n&gt;When a godlike figure gives Hiraku a chance to live again, he wishes to be healthy, to live peacefully, to speak the local language, and to spend his days on an idyllic farm.",
    "comments": [
        {
            "level": 0,
            "comment": "Oh boy, I get to rewatch this show in the next couple of months… in dub this time!",
            "score": 12,
            "author": "Operation_Past",
            "replies": [
                {
                    "level": 1,
                    "comment": "It really is a fun series. My only real issue is one thing that the MC seemed to always avoid in the anime but didn't at all in the source material according to the r/anime episode discussions.",
                    "score": 6,
                    "author": "raknor88"
                },
                {
                    "level": 1,
                    "comment": "Right there with you bud, man they've really gone all out with the cast too.",
                    "score": 2,
                    "author": "DisastrousMusician17"
                },
                {
                    "level": 1,
                    "comment": "Indeed, I have been looking forward to this. I almost thought it wasn’t gonna happened. I’m glad they did.",
                    "score": 1,
                    "author": "OtakuSalvage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Feels good to revisit this iyashikei isekai, our boy Hiraku already finding satisfaction building his farm thanks to the Almighty Farming Tool. Looks like he's not gonna be alone anymore.",
            "score": 5,
            "author": "drawricks"
        },
        {
            "level": 0,
            "comment": "This show was the biggest surprise of Winter 2023 for me; it was a really chill, easygoing, and even educational show that made for the perfect way to start my weekends (it was a Friday show when it first aired). I was pretty happy to see it get announced for a dub.\n\nI only wish the dub also started on Fridays like the sub did, lol. Ah, what can ya do? :P\n\nAnyway, looking forward to revisiting this show for the next 12 weeks!",
            "score": 6,
            "author": "Gyeseongyeon"
        },
        {
            "level": 0,
            "comment": "Seems okay so far. He's getting getting farming done a little too easily, but I guess that's magical hoes and superhuman bodies for you.",
            "score": 3,
            "author": "SoundOf1HandClapping"
        },
        {
            "level": 0,
            "comment": "Seems like the last time I heard Blake Shepard was whenever season 3 of Chihayafuru got dubbed.",
            "score": 3,
            "author": "MegaAltarianite",
            "replies": [
                {
                    "level": 1,
                    "comment": "The last time I heard him was when he played a character who got &gt;!booted immediately!&lt; in Bluelock.",
                    "score": 1,
                    "author": "awakening_knight_414"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So calm and wholesome. It's almost like if Minecraft was an anime.\n\nIt's been a while since Blake and Monica were together in an anime. Last time I heard them were in Campione!\n\nI love how it began with the present, and the anime shows us how he made a farming village and became mayor.\n\nToo bad they didn't show Hiraku eating cooked boar meat.",
            "score": 3,
            "author": "mojo72400"
        },
        {
            "level": 0,
            "comment": "I still can't believe they got Monica Rial to voice Tia, it feels like an odd choice. But only time will tell how the role turns out.",
            "score": 2,
            "author": "SAAA2011"
        },
        {
            "level": 0,
            "comment": "Sometimes it takes an almighty farming tool to realize how screwed you'd be without modern convenience!",
            "score": 1,
            "author": "Shadowmist909"
        },
        {
            "level": 0,
            "comment": "Oh look it's Rial ruining yet another anime with that god awful voice.",
            "score": -21,
            "author": "BTGz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like her voice.",
                    "score": 2,
                    "author": "Pyraph"
                }
            ]
        }
    ]
}