{
    "id": "147ov1v",
    "score": 44,
    "title": "Round 2: Ian Sinclair",
    "author": "No_Pool_3866",
    "date": 1686578425.0,
    "url": "https://www.reddit.com/r/animedubs/comments/147ov1v",
    "media_urls": [],
    "other_urls": [],
    "postText": "All right, friends and acquaintances (you know who you are)! It’s time for round 2 of best performances!\n\nToday’s topic of discussion: Ian Sinclair! Personally, my favorite role he has been in is the Narrator for Kaguya-sama: Love is War. Absolutely unhinged, hilarious, and just a great performance overall.\n\nWhat are your thoughts? Which show do you think Mr. Sinclair absolutely killed in? Why that one? DISCUSS!",
    "comments": [
        {
            "level": 0,
            "comment": "Brook! YOHOHOHOHO! Love hearing Ian in a singing role",
            "score": 21,
            "author": "YuiHaruhara",
            "replies": [
                {
                    "level": 1,
                    "comment": "One of my first exposures to Ian, really made watching the dub of one piece 6 years after the sub much more enjoyable.",
                    "score": 3,
                    "author": "Cardenjs"
                },
                {
                    "level": 1,
                    "comment": "Same. Whis from db super as a close decond",
                    "score": 2,
                    "author": "Apprehensive-Pin518"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bokuto in Haikyuu!",
            "score": 13,
            "author": "Negative-Appeal9892",
            "replies": [
                {
                    "level": 1,
                    "comment": "HEY, HEY, HEEEYYY ! ! !",
                    "score": 5,
                    "author": "BlueSpark4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Space Dandy. And Space Dandy live action are iconic Sinclair.",
            "score": 12,
            "author": "cjweberunomaha",
            "replies": [
                {
                    "level": 1,
                    "comment": "Booty is All is one of the greatest songs of our generation",
                    "score": 2,
                    "author": "Sphiffi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ian was perfect in everything",
            "score": 12,
            "author": "GragonTG_sl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not everything he is in is perfect though, unfortunately.",
                    "score": 2,
                    "author": "weeberific"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No mention of Golden kamuy?",
            "score": 10,
            "author": "neverforgetbillymays",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'M THE IMMORTAL SUGIMOTO!!!!!",
                    "score": 5,
                    "author": "A5CH3NT3"
                },
                {
                    "level": 1,
                    "comment": "Golden Kamuy is my favourite anime and Ian's voice acting is definitely one of the reasons why!",
                    "score": 2,
                    "author": "Xthe_tallest_one"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ian Sinclair is easily one of my fave TX VAs.\n\nEasily my fave roles from him have been the Narrator roles, **Kaguya** obviously, but I also loved him as the **How Heavy Are the Dumbbells you Lift** narrator as well.\n\nBasically, any role that allows him to go unhinged and crazy, so **Space Dandy**, Ronaldo from **Vampire Dies in No Time,** Victor Licht in **Fire Force**, Luke Atmey from **Ace Attorney** (Funi dub)**.** But I also like his more charming roles too, like Albert Hawk from **Saint's Magic Power is Omnipotent**, Kureno Soma from **Fruits Basket**, Noah from Why Raeliana Ended Up at the Duke's Mansion.\n\nAnd other favorites that I think are a little underrated: Tsukasa from **Dr. Stone**, Sherlock Holmes from **Case File n221 Kabukicho**,",
            "score": 18,
            "author": "Chun-Li_Forever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely loved him in **Case File n221 Kabukicho.**",
                    "score": 3,
                    "author": "CaffinatedCoyote"
                },
                {
                    "level": 1,
                    "comment": "Space Dandy!",
                    "score": 2,
                    "author": "Avrution"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He’s great as Whis from DBS",
            "score": 5,
            "author": "No_Discussion3053"
        },
        {
            "level": 0,
            "comment": "- Chuya Nakahara in **Wave, Listen to Me!** (one of the best dubs to come out in recent years.)\n- Yang Wen-li in **Legend of the Galactic Heroes**\n- Einar in **Vinland Saga Season 2**\n\nA couple of those aren't his most well-known role, but you get to hear the difference in tone for the change in genre. Nakahara voice changes between dramatic and eccentric as he plays off of the fickle main character. Wen-li is him with a relaxed voice in a space opera. Einar is him adapting to a serious drama with barely any comedy.\n\nAll of these are fantastic, yet not his most popular ones.",
            "score": 5,
            "author": "ReinhardLoen"
        },
        {
            "level": 0,
            "comment": "Definitely *Yang Wen-li* from **The Legend of the Galactic Heroes: Die Neue These**. He manages to convey the exact right emotion/tone in every scene, despite voicing a pretty quiet and subdued character. His performance is amazing and fairly subtle compared to so many of his usual roles.\n\nAlso, if CR decides not to dub S4 (and subsequent seasons) for some reason I'm absolutely done with them. That's one of the best shows, and best dubs in recent years.",
            "score": 5,
            "author": "BigL90",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s possible? We might have to protest at their offices directly if that happens. They left on a cliffhanger!",
                    "score": 3,
                    "author": "TalkDontMod23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure, but somebody linked this on the \"Will it be dubbed?\" Megathread when I was asking about the status of the dub.\n\nhttps://www.reddit.com/r/Animedubs/comments/13ekvkq/crunchyroll_the_state_of_missed_season_2_popular/jjrj2y5?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
                            "score": 1,
                            "author": "BigL90"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Einar in Vinland Saga I just finished episode 20 and what a performance I swear if I don’t see him or anyone from Vinland Saga on this year’s Anime Awards Imma throw some hands\n\nhttps://preview.redd.it/lbay8ngjfn5b1.jpeg?width=1886&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b848bd02c339940b929b2d29407cd4acb7ac1951",
            "score": 6,
            "author": "Guishmonster"
        },
        {
            "level": 0,
            "comment": "The narrator in Kaguya-sama. He sounds so unhinged lmao",
            "score": 5,
            "author": "Takagun59"
        },
        {
            "level": 0,
            "comment": "He did great as Kureno Soma in Fruits Basket!",
            "score": 3,
            "author": "BerryStraws"
        },
        {
            "level": 0,
            "comment": "he's apparently the Laid-Back Camp narrator (and camping grandfather) as well",
            "score": 3,
            "author": "IntelligentBudget142"
        },
        {
            "level": 0,
            "comment": "Yang Wen Li, such a joy to listen to in Legend of the Galactic Heroes. Seriously, if you haven't seen the show, do it.",
            "score": 3,
            "author": "MrWillyP"
        },
        {
            "level": 0,
            "comment": "I liked him in Tales of Zestiria and Danganronpa 3.",
            "score": 2,
            "author": "Zergrump"
        },
        {
            "level": 0,
            "comment": "Definitely Love him as Whis from Dragon Ball Super, I feel like when he plays him, it really explains him on his cheerfulness.",
            "score": 2,
            "author": "SatisfactionFalse641"
        },
        {
            "level": 0,
            "comment": "I’ve been watching season 2 of Devil is a part-timer and I love him as Gabriel!",
            "score": 2,
            "author": "daisy_wanderlust16"
        },
        {
            "level": 0,
            "comment": "My favorite is the immortal Sugimoto from golden Kamuy.",
            "score": 2,
            "author": "Rimurutempest88"
        },
        {
            "level": 0,
            "comment": "Kaguya-sama. I love his narrations and the way he reacts to events that happen in the story.",
            "score": 2,
            "author": "marioskywalker"
        },
        {
            "level": 0,
            "comment": "He’ll always be Space Dandy to me. \n\nKills it as the Kaguya Narrator.",
            "score": 2,
            "author": "AmericanRailgun"
        },
        {
            "level": 0,
            "comment": "Narator (Kaguya) and Berkut (Fire Emblem Echoes)\n\nTwo polar opposite Roles and yet both of them are perfect.",
            "score": 1,
            "author": "dem53605"
        },
        {
            "level": 0,
            "comment": "Space dandy",
            "score": 1,
            "author": "williamdebeer"
        },
        {
            "level": 0,
            "comment": "Oh Dandy my Dandy",
            "score": 1,
            "author": "JustASyncer"
        },
        {
            "level": 0,
            "comment": "I love him as Whis in Dragon Ball Super! He also did a great job as Gabriel from The Devil is a Part-timer!",
            "score": 1,
            "author": "Iceyflow"
        },
        {
            "level": 0,
            "comment": "Seen him as more \"first boss\" villains lately",
            "score": 1,
            "author": "Cardenjs"
        },
        {
            "level": 0,
            "comment": "He’s played a lot of characters I’ve either not seen or just don’t remember. He does play Souei who I really like, but he’s not terribly talkative, and the same goes for Shouji in MHA. However, he also plays Albert Hawke in The Saint’s Magic Power is Omnipotent, so I’m going with that!",
            "score": 1,
            "author": "Aliessil_",
            "replies": [
                {
                    "level": 1,
                    "comment": "The sumo wrestling scene where he sings just a little is a wee bit of perfection. It cracks me up!",
                    "score": 1,
                    "author": "elemenno50"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Easily one of my favorite voice actors, probably my single favorite. Blows it out of the park in Love is War, was amazing as Tsukasa in Dr. Stone despite it being not in his normal type of roles, was perfect as Viktor Licht in Fire Force, and for a much more obscure one, he singlehandedly carried Infinite Dendrogram as Mr. Franklin, singlehandedly pulling my opinion on the show up significantly.",
            "score": 1,
            "author": "Eragonnogare"
        },
        {
            "level": 0,
            "comment": "God so many;\n\nDefinitely the narrator in Love is War, Gija/Kija in Yona of the Dawn, Kanda in DGrayman (came in later but was still so good), Tsukasa in Dr. stone, also really enjoying him as Noah in Raeliana.",
            "score": 1,
            "author": "Gabbyfest"
        },
        {
            "level": 0,
            "comment": "My favorite role of his is definitely the narrator in Kaguya takes real talent to make a disembodied voice a top 3 charater\n\nHe has insane range like it legit blew my mind that Victor Lict (fire force) and Tsukasa (Dr stone) were the same person",
            "score": 1,
            "author": "YaFavDubWatcher"
        },
        {
            "level": 0,
            "comment": "He does fantastic work as anyone but my biggest standout performance is Berkut from Fire Emblem: Shadows of Valentia.\n\nHe's amazing as Brook though.",
            "score": 1,
            "author": "NinjaXSkillz88"
        },
        {
            "level": 0,
            "comment": "Bokuto (haikyuu)\n\nMr tsuchigomori (toliet-bound hanako san)",
            "score": 1,
            "author": "molliemg"
        },
        {
            "level": 0,
            "comment": "Kaguya Narrator was my fav role of his.",
            "score": 1,
            "author": "Crusherbolt0282"
        },
        {
            "level": 0,
            "comment": "Brook, Yang Wen-Li and my most recent favourite role of his: Einar. Dude is absolutely crushing it this season.",
            "score": 1,
            "author": "JordanHilm"
        },
        {
            "level": 0,
            "comment": "I really liked his performance in Blood Blockade Battlefront as Zapp Renfro. I don't think anyone could have voiced him as well as Ian\n\nBut like the narrator from Kaguya-sama too 🤣🤣🤣",
            "score": 1,
            "author": "Powerful-Apartment15"
        },
        {
            "level": 0,
            "comment": "Ian is my fav male and Monica rial of course is my fav female lol Ian’s voice matches the characters he plays to T In my head at least and Monica she’s a legend plain and simple and let’s not forget Justin cook the one and only producer of eng dubbed anime lmao",
            "score": 0,
            "author": "orunim"
        }
    ]
}