{
    "id": "147skdy",
    "score": 17,
    "title": "Did you watch higurashi when they cry english dub seasons?",
    "author": "pieceof_pie",
    "date": 1686590810.0,
    "url": "https://www.reddit.com/r/animedubs/comments/147skdy",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does it make sense watching only the dubbed parts?",
    "comments": [
        {
            "level": 0,
            "comment": "I'm gonna say a big no. As S2 is key in explaining what's actually going on.",
            "score": 7,
            "author": "opeth_syndrome",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep.",
                    "score": 2,
                    "author": "mylastdream15"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Season 2 of Higurashi is literally directly connected to the first season.  And... Even with the newer seasons.  It helps to know what happened in the original seasons.  So.  I don't think you can skip the non-dubbed seasons unfortunately. \n\n(Higurashi is a top 5 anime of all time for me.  So.)\n\nHigurashi goes in question and answer arcs.  First season is the question arc.  Second season is the answer arc.  So. You need to watch both to get the complete story of each section in the series.    The fact they never dubbed season 2 AT LEAST with the new cast - which would basically print money.  Has always been surprising to me.",
            "score": 5,
            "author": "mylastdream15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know the watch order for Higurashi by any chance?",
                    "score": 1,
                    "author": "AnimeNerdy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're in order as they are supposed to be viewed.  \n\nSeason 1 is a questions arc.  Season 2 is an answer arc.  Season 3 is a little of both.  Season 4 is another questions arc.  And Season 5 is an answers arc. \n\nThe ovas aren't cannon and can be skipped.\n\nSo just watch season 1-5 in order.",
                            "score": 1,
                            "author": "mylastdream15"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish they redubbed the old seasons with the new cast just to have some consistency. Also mainly because the old dub isnt exactly the best quality.",
            "score": 4,
            "author": "Quick_Hit"
        },
        {
            "level": 0,
            "comment": "I'm holding off watching the originals in the rare hope that Crunchyroll gets a hold of it and Dubs it with the GOU cast. \n\nI've seen GOU and SOTSU, but not the originals. \n\nIf that doesn't happen and I run out of stuff to watch, then I might just watch the original subbed.",
            "score": 0,
            "author": "real_priception",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, I just keep hearing how good it is and want to watch it. Doesn’t Gou and Sotsu spoil things about the original seasons? That’s why I heard not to watch those even though they are dubbed",
                    "score": 2,
                    "author": "pieceof_pie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You heard right. Gou and Sotsu are literally Season 3 and 4.  \nDo NOT start with them.",
                            "score": 1,
                            "author": "Kemoy79"
                        },
                        {
                            "level": 2,
                            "comment": "I watched _Gou_ and _Sotsu,_ and it actually gives me a perspective on the originals that I wouldn’t have had otherwise.",
                            "score": 0,
                            "author": "TalkDontMod23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I watched in this order, which I wouldn't exactly recommend per se, but it actually kind of worked?\n\n[Original Season] → Gou → Kai → Rei → Kira → Kaku → Sotsu\n\nWatching the original season, then Gou, then Kai lets you get the effect of the beginning of Gou (which you need to have seen the original season for) while still letting some mysteries from the original *also* still be present for a while and not actually getting all that many spoilers for Kai that you wouldn't have gotten early in Kai, anyway.\n\nStill probably better to watch everything in order, though.",
                                    "score": 1,
                                    "author": "sdagasdahaha"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "s1 dubbed cause i didn’t realise the second wasn’t then watched the second sub",
            "score": 1,
            "author": "Mister_Kiwi"
        },
        {
            "level": 0,
            "comment": "The original one was absolutely horrible. I like watching dubs, I really do. There are plenty of talented voice actors and actresses...but none of them worked on the original one. It was among the worst dubs I've ever heard. Now remake and spinoffs we got recently, I did watch the dubs and those dubs were great.",
            "score": 1,
            "author": "Akemi_Tachibana"
        },
        {
            "level": 0,
            "comment": "So season 1, 3 and 4 are dubbed is that right? That's annoying",
            "score": 1,
            "author": "ShadowFlare_x",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, and the dub voice actors for season 3 and 4 are different from the voice actors for season 1  it seems like. Thinking of watching it?",
                    "score": 1,
                    "author": "pieceof_pie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I watched gou and sotsu dubbed but I watched the og higurashi, kai, and rei subbed. Show's great!",
            "score": 1,
            "author": "Shadowmist909"
        },
        {
            "level": 0,
            "comment": "Hell na. That show is far too slow paced.",
            "score": 1,
            "author": "rayquazza74"
        }
    ]
}