{
    "id": "148f6ow",
    "score": 13,
    "title": "What's your favourite way of localizing Kansai dialects?",
    "author": "Gallantpride",
    "date": 1686662009.0,
    "url": "https://www.reddit.com/r/animedubs/comments/148f6ow",
    "media_urls": [],
    "other_urls": [],
    "postText": "Kansai and Osaka dialects are translated in various ways. The most common English dub ways are a Brooklyn accent, a Bronx accent, a Southern accent, or a British accent (this seemed more common in the 90s).\n\nI'm not familiar with non-English dubs. I have heard that the Azumanga Daioh manga and anime translated Osaka in various ways: the Russian version made her Ukranian while the Korean translation made her from the city of Busan.\n\nMy favourite way is Southern US accent. Think Osaka from Azumanga Daioh (who has a Beaumont, Texas accent in particular), Nanako from Lucky Star, and Shizuru from My-Hime/My-Otome. \n\nAnime fans make fun of this localization, but I *like* the way they sound. My-Hime fans loved to make fun of Shizuru's \"bad accent\" but I think the Southern Belle trope fit her character well. Plus there's nothing *wrong* with having a Southern accent. People IRL don't choose their natural accents.",
    "comments": [
        {
            "level": 0,
            "comment": "A bit of Southern flair/accent is fine, but when it's so over the top that it becomes distracting and takes you out of the show every time they speak then it's too much.",
            "score": 15,
            "author": "KitKat1721",
            "replies": [
                {
                    "level": 1,
                    "comment": "_Kandagawa Jet Girls_ went overboard with it. Also, replacing “-chan” with “-boo” was very odd.",
                    "score": 3,
                    "author": "TalkDontMod23"
                },
                {
                    "level": 1,
                    "comment": "Diary of Our Days at the Breakwater is unbearable. Every character but the lead sounds like that.",
                    "score": 2,
                    "author": "MegaAltarianite"
                },
                {
                    "level": 1,
                    "comment": "The English dub of *Komi Can't Communicate* did it pretty well with Nokoko, especially with the character actually hiding from her classmates that she has the dialect.  \n\n*Valkyrie Drive Mermaid* also did a good job of not making the accent too over the top.  \n\nAnd of course any time Jamie Marchi does a southern accent is a treat, since she actually grew up around people with the southern accent.",
                    "score": 1,
                    "author": "eddmario"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Scottish like Becky in Trails of Cold Steel.",
            "score": 6,
            "author": "DireSickFish"
        },
        {
            "level": 0,
            "comment": "They are suddenly country bumpkins, which sometimes works really well since it lets you easily differentiate where someone is from.  I like how they only slip into their accent if they are visiting home or on occasion.",
            "score": 3,
            "author": "Avrution"
        },
        {
            "level": 0,
            "comment": "Because of the nature of the Kansai accent and where it exists... (Plus from speaking/understanding a fair amount of japanese myself and having some friends in japan that speak with it. Which just makes things confusing for me haha.)  --- I think the Southern Accent is the one.  That's the answer.  I think it makes the most sense.  Brooklyn or Bronx accent doesn't make sense to me.  Southern makes perfect sense even in a regional sense.    \n\n\nAs for anime fans disliking the localization.  I think it's perfect.  It's a quick easy way to know where a character is from and if they are not local to a certain area.  You don't have to think about it.  When you hear a character with say a southern accent in japan.  You immediately go \"oh, they must be from the Kansai region.\" --- And that's the point.  You get that they have an accent.  Quickly.",
            "score": 9,
            "author": "mylastdream15",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Azumanga manga has Osaka with a Brooklyn accent, iirc, and it feels really weird. I wish they'd re-translate it with a different accent.",
                    "score": 3,
                    "author": "Gallantpride"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Iirc Tsuruya from the haruhi series speaks in kansai-ben (technically even kyon and haruhi should but that's a different discussion), it was dubbed into some valley girl accent iirc\n\nAnd then there's aoi from laid back camp who speaks in that dialect (for some reason?), in the dub she doesn't speak any differently",
            "score": 2,
            "author": "IntelligentBudget142",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tsuruya being a Valley Girl is an unusual take on the dialect, but I can't imagine her sounding any other way.\n\nA lot of media don't adapt dialects. The Pokemon anime was iffy with it. Bill was localized with a British accent while Casey and Whitney just had standard American accents, even though they all speak in Kansai-ben in Japan.",
                    "score": 4,
                    "author": "Gallantpride"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm playing through Persona 4 Arena for the first time and was really thrown off by one character having a thick Brooklyn/Jersey accent, but then it was made apparent that the character is supposed to be from the Kansai area. At first it was jarring as I don't think I've ever heard a character dubbed with that thick of a Brooklyn/Jersey accent, but knowing what I do about the Kansai accent it seems appropriate.\n\nSomething fun for me being from Chicago would be to hear someone do the Chicago accent (think Joan Cusack as a famous example) for characters with the Kansai accent. Chicago and Osaka are considered sister cities and have a lot of similarities with each other so it would make sense to me for Kansai characters having that rough Midwestern charm and good humor.",
            "score": 2,
            "author": "Shouganai_Senpai"
        },
        {
            "level": 0,
            "comment": "Accel world does this with osaka too. Regional differences in speaking are also emphasized with southern or rural accents in Diary of our days at the breakwater and chihayafuru too. Least I think that’s the point of how Arata speaks. I don’t think the latter two are Osaka or Kansai.",
            "score": 2,
            "author": "scalliondelight"
        },
        {
            "level": 0,
            "comment": "I'm not sure of the accent they used in the English dub but a whole team in season 4 of haikyuu has the kansai accent",
            "score": 2,
            "author": "molliemg"
        },
        {
            "level": 0,
            "comment": "I long for the day when I can hear Sakuta say \"I don't flippin get it!\" in a Minnesota accent.",
            "score": 2,
            "author": "CallowayMcSmithing"
        },
        {
            "level": 0,
            "comment": "In Yu Yu Hakusho Shu had an Australian accent, while Jin had an Irish accent.",
            "score": 2,
            "author": "SirKirk2000"
        },
        {
            "level": 0,
            "comment": "Do what they did with Yun from New Game. Change nothing so I don't even know it until I read the manga.",
            "score": 1,
            "author": "MegaAltarianite"
        },
        {
            "level": 0,
            "comment": "I like the Southern accent used in the dub for Magical Shopping Arcade Abenobashi.",
            "score": 1,
            "author": "penguintruth"
        }
    ]
}