{
    "id": "imyc5o",
    "score": 704,
    "title": "Reminder That Just Because You Don’t Recognize A VA, That Doesn’t Mean They’re “New”",
    "author": "Unknownsage",
    "date": 1599298456.0,
    "url": "https://www.reddit.com/r/animedubs/comments/imyc5o",
    "media_urls": [
        "https://i.redd.it/eqbquqdwtal51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "A good rule I typically follow. Look them up and find out when their first named anime/japanese game role was. If in the time between then and now someone can finish American middle school (usually 3 years) or high school (usually 4 years), they're not new.",
            "score": 68,
            "author": "Unknownsage",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good idea, been doing this for the past few months and being pleasantly surprised.",
                    "score": 11,
                    "author": "absoul112"
                },
                {
                    "level": 1,
                    "comment": "This is literally what I do when I check voice actors. Unfortunately, not all VA's even have a wikipedia page (Faye Mata, Billy Kametz, etc.)",
                    "score": 1,
                    "author": "n0753w",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "MAL, ANN, or behindthevoiceactors is much better than wikipedia.",
                            "score": 22,
                            "author": "notathrowaway75"
                        },
                        {
                            "level": 2,
                            "comment": "That's kind of amazing that Faye and Billy's careers have picked up with so many roles and they don't even have a wikipedia page.",
                            "score": 11,
                            "author": "Frontier246",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sadly Wikipedia started cutting out a lot of VA wiki pages a couple years ago. I think in particular there was some uproar when Sarah Weidenheft’s page got deleted.\n\nHonestly it seemed like the wiki admin who was deleting those pages was just being a douche.",
                                    "score": 9,
                                    "author": "Unknownsage",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sk8trPrince was absolutely a douche.",
                                            "score": 11,
                                            "author": "ScarRed_Tiger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, no, no; he was absolutely *part* of the problem but the biggest perpetrator is Wikipedia user AngusWoof.",
                                                    "score": 10,
                                                    "author": "Lumisau",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't remember who it was. But I remember when a VA tried calling them out on social media, and once people became aware of the situation they went to wiki to voice disagreement. The one wiki user in particular pointed to this and basically said, \"They're only doing this because they're fanboys. Their voice doesn't matter.\"",
                                                            "score": 10,
                                                            "author": "Unknownsage",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wasn't there also a thing where VAs weren't being credited for a lot of their roles, because a tweet from them literally saying \"I play this character\" didn't count as proof or something like that?",
                                                                    "score": 9,
                                                                    "author": "SSJ5Gogetenks"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's why I usually just look up there IMDB page, since it usually has a lot more roles listed.  \n\nOf course, since it's all user submitted stuff there are going to be some errors, like the Smash announcer also voicing a minor character in Persona 5: Royal instead of Kyle Hebert voicing them.",
                            "score": 6,
                            "author": "eddmario"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is just the art and entertainment industry as a whole, all acting included. Not everyone bursts onto the scene and is recognized by a lot of people. Most people have to tough it out for years before they reach that...if they reach that.",
            "score": 48,
            "author": "prototypeplayer",
            "replies": [
                {
                    "level": 1,
                    "comment": "In Reddit terms,\n\nMost are active posters. But because they don't get fame, they are effectively Lurkers. But once they blow up in fame, they are recognised as \"new\"  OC Makers.",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't understand the point of this analogy, but that's not what a lurker is. Lurkers are people who don't participate *at all* by not commenting or posting. Hell, some lurkers, especially years ago before the official app came along, didn't even have an app to browse Reddit.",
                            "score": 8,
                            "author": "prototypeplayer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I don't understand the point\n\nThere is no point.",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "there’s no way they have new talent I’ve always been told they use the same 6 voices for everything :^)",
            "score": 33,
            "author": "colesyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, how dare they use anyone who isn't Josh Grelle, Brittany Karbowski or Johnny Yong Bosch. Austin who? Is that a new cerial?",
                    "score": 15,
                    "author": "Freeman_Traceur"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I remember when the Konosuba dub got announced and when we were discussing it in the MAL forums. I came across someone saying, \"why are they casting newcomers for this?\" Reading that gave me a massive face palm.\n\nFirst of all, Erica and Cristina already have had a lot major and well-known roles in their belt before voicing Megumin and Darkness. And then we have people like Faye and Arnie who may have done more minor roles before Konosuba (and I think Faye also has done some major roles before voicing Aqua), but that doesn't mean they're full-on newcomers in the voice acting industry.",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; and I think Faye also has done some major roles before voicing Aqua\n\nThe only one I can think of is Astolfo in *Fate: Apocrypha*",
                    "score": 3,
                    "author": "eddmario",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then later she's Malty in \"Shield Hero\" and something just feels wrong with the world after such good guy likeable characters.",
                            "score": 1,
                            "author": "SnugglesGodOfDeath"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It could be a form of compliment if the VA has a wide range of voices so that they’re never recognized.",
            "score": 9,
            "author": "ElDiabloNINER"
        },
        {
            "level": 0,
            "comment": "I just realized 2010 was 10 years ago. And yeah, I'd be tempted to say that someone voice acting since 2010 is (relatively) \"new\", but that's only because my sense of time is screwed up lol, 2010 feels like 2 years ago.",
            "score": 9,
            "author": "CasterlyRockLioness",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I probably should've said \"or from your childhood\" in the title aswell. Time moves so much quicker when you get older and you have to just take a second and think.\n\nLike example. When we were discussing \"new VAs\" here a couple weeks ago one that popped into my head was Bryn Apprill. And then I thought about it some more. A bunch of her biggest/iconic roles were from 2014/2015. Like half a decade ago!",
                    "score": 6,
                    "author": "Unknownsage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a shame stuff like this even happens to Khoi, because his performance as Rei Kiriyama in March Comes In Like a Lion was *incredible* and deserves way more recognition. (Although I guess that could apply to the show as well.)",
            "score": 16,
            "author": "Gyakuten"
        },
        {
            "level": 0,
            "comment": "I don't ever remember using the term \"newcomer VA.\" I usually just say something on the lines of \"I don't really know this one.\"",
            "score": 6,
            "author": "n0753w"
        },
        {
            "level": 0,
            "comment": "Who called him a newcomer?",
            "score": 6,
            "author": "WheelJack83"
        },
        {
            "level": 0,
            "comment": "\"You're either a newcomer or overused. There is no in between.\" - [Erica Mendez](https://twitter.com/tsunderica/status/1302471478433120257)",
            "score": 7,
            "author": "shsl_cipher",
            "replies": [
                {
                    "level": 1,
                    "comment": "True that. That is the other end of the spectrum that is really annoying.\n\nCan’t remember what it was. But there was one show in recent memory where the main cast was announced and it was mostly VAs who have been relevant for just like last few years.\n\nAnd someone complained about the lack of new VAs. Like c’mon! It’s pretty naive to expect a brand new pool of VAs every show. \n\nEspecially cuz (with some exceptions) a lot of the times the new VAs start off as side characters so by the time they get main roles they’re already known by people.",
                    "score": 4,
                    "author": "Unknownsage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bruh. Yall know the VAs? For me its if they sound familiar they sound familiar. The only one i know to heart is michael tatum",
            "score": 8,
            "author": "enterbasicnamehere",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know a lot of them simply because I like to search then up when I recognise their voice (which led to the legend that is Ian Sinclair).",
                    "score": 17,
                    "author": "_Mysto_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's a dandy guy...in SPACE!",
                            "score": 7,
                            "author": "OverlordPoodle"
                        },
                        {
                            "level": 2,
                            "comment": "I started doing it after Assassination Classroom( because I was able to recognize Austin Tindle's voice and went,\"Hey, that's Kaneki, right?).",
                            "score": 2,
                            "author": "Freeman_Traceur"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve never really looked up the VAs for shows/movies that I watch. The only actors I know are really popular ones outside of anime.",
                    "score": 2,
                    "author": "Quin1617"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks new guy 🥰",
            "score": 2,
            "author": "sdrumapapere"
        },
        {
            "level": 0,
            "comment": "I do try to correct myself and say \"new to me\" about a unfamiliar name.",
            "score": 2,
            "author": "ScarRed_Tiger"
        },
        {
            "level": 0,
            "comment": "And this is why research is important.\n\nI honestly only say a VA is an \"Up-And-Comer\" if they truly have an initially minuscule list before I first heard of them in a role. Khoi Dao was initially this when he got the lead in March Comes In Like A Lion, but that has clearly changed over the years he's been working if you look him up some more.\n\nAs for Lucien Dodge, Play Dust An Elysian Tail guys from 2012, seriously. And do I need to mention the fucktons of online work Kira Buckland has done?",
            "score": 0,
            "author": "UltimateScorpion",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; As for Lucien Dodge, Play Dust An Elysian Tail guys from 2012, seriously.\n\nDude, that game has [a TON of big anime dub VAs](https://www.imdb.com/title/tt2332302/fullcredits?ref_=tt_cl_sm#cast) before they got big:\n\n*  Justin Briner [Deku in *My Hero Academia*]\n* Erica Mendez [Megumin in *Konosuba*, Ryuko in *Kill La Kill*, Raphtalia in *The Rising of the Shield Hero*]\n* Chris Guerrero [Lord Ainz Ool Gown in *Overlord*]\n*  Sean Chiplock [Diabel in *Sword Art Online*, Mishima in *Persona 5*, Revali in *The Legend of Zelda: Breath of the Wild*, Subaru in *Re: Zero*]\n* Mick Lauer [Golgorosso in *Sword Art Online*, Marrow Amin in *RWBY*, Husk in *Hazbin Hotel*]\n* Joshua Tomar [Eugene in *Sword Art Online*, Chumley in *Little Witch Academia*, Spartacus in *Fate/Apocrypha*, Chentikohai in *One Punch Man*]\n* Lizzie Freeman [Sempai in *Magical Sempai*, Cardinal in *Sword Art Online*,  Erimi Mushibami in *Kakegurui*, Orlondi in *The Seven Deadly Sins*, Delia in *Ascendance of the Bookworm*]\n* Xander Mobus [Motoyasu Kitamura in *The Rising of the Shield Hero*, Vassago in *Sword Art Online*, Joker in *Persona 5*, the announcer in *Super Smash Bros. Ultimate*]\n* Kira Buckland [Do I really need to list any of the roles she's done?]",
                    "score": 3,
                    "author": "eddmario",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\\&gt;listing Mick Lauer and Lizzie Freeman  \n\\&gt;not acknowledging Abbacchio and Trish\n\nInstant fame, just be in JoJo's Bizarre Adventure. See also: Billy Kametz, Phillip Reich, Joe Zieja, Imari Williams, Mark Whitten, Jonah Scott.",
                            "score": 2,
                            "author": "shsl_cipher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "1. Pretty much anybody shows up in the Jojo dub\n2. I specifically mentioned GOOD stuff, not crap like Jojo",
                                    "score": 0,
                                    "author": "eddmario"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i swear i could listen to chris guerrero read out of a phone book\n\nhis voice is raw ASMR",
                            "score": 1,
                            "author": "colesyy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 years or 20 years professionally voice acting. Even if you're a famous and accomplished voice actor. If it is your first voice acting role in an anime then I'm still probably going to call you new to the scene.",
            "score": 1,
            "author": "TheCheesy"
        },
        {
            "level": 0,
            "comment": "I personally go on number of roles rather than years, so they could be only a few years of work but have received lots of roles, I wouldn't consider them new, but on the opposite end if they had very few roles and then recently got a burst of popularity, while they may have been around for a while their success has only been recent, so they're newer. That may sound a bit mean but that's just how i feel in regards to it, though I'd never say that to them, that's too mean.",
            "score": 0,
            "author": "JCrockford"
        }
    ]
}