{
    "id": "vjazqj",
    "score": 575,
    "title": "Johnny Yong Bosch Posted A Short Dub Preview from 'Bleach: Thousand-Year Blood War'",
    "author": "MarvelsGrantMan136",
    "date": 1656029343.0,
    "url": "https://www.reddit.com/r/animedubs/comments/vjazqj",
    "media_urls": [
        "https://v.redd.it/x2wvy9seng791"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Damn, this got me psyched. I really hope Thousand-Year Blood War makes liberal use of *Number One*. I feel like they stopped using it as much near the end of the series.",
            "score": 25,
            "author": "BigL90"
        },
        {
            "level": 0,
            "comment": "This was never really a doubt, but nice to have Bosch confirm he's back for the upcoming dub.\n\nHe won't be at the panel on July 2 at Anime Expo, but there's a good chance we get a full dub trailer.\n\n[Source](https://www.instagram.com/p/CfIQdCxJ214/?hl=en)",
            "score": 62,
            "author": "MarvelsGrantMan136",
            "replies": [
                {
                    "level": 1,
                    "comment": "Still really hope he shows up at AX as a surprise guest or even on video.",
                    "score": 3,
                    "author": "AlbertCole"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All hail JYB! Just hearing his voice in this small snippet gives me chills. I can listen to him shouting Getsuga Tenshou all day.",
            "score": 50,
            "author": "anime-prime-MAL",
            "replies": [
                {
                    "level": 1,
                    "comment": "if i remember rightly, he's been waiting for the anime ever since the manga got to this arc, and once they announced the anime was in production, he was pretty much the first of the english dub VAs publicly hyping up the anime and also trying to make sure that he could get to come back to voice ichigo",
                    "score": 21,
                    "author": "KR_Blade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's also been in a YouTube fan series by a YouTuber who's name I forgot that was created a couple of years before the new adaptation was announced.",
                            "score": 12,
                            "author": "OutlandishnessNo9182"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "God I love him as ichigo. One of my favorite dub characters by far",
            "score": 15,
            "author": "BigBallsMalone"
        },
        {
            "level": 0,
            "comment": "always the comeback king, JYB, don’t let us down comeback king",
            "score": 6,
            "author": "Gerard192021"
        },
        {
            "level": 0,
            "comment": "More than JYB, holy shit, I've missed Number One.",
            "score": 5,
            "author": "SoundOf1HandClapping",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last time we had heard it was when Aizen made Ichigo wake up to reality",
                    "score": 1,
                    "author": "InspectorExpensive83"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean if viz gave Yashahime a simuldub bleach should get one too",
            "score": 5,
            "author": "CruisinCinnamon"
        },
        {
            "level": 0,
            "comment": "Hell yeah, he still got it.",
            "score": 5,
            "author": "AlchemistMayCry",
            "replies": [
                {
                    "level": 1,
                    "comment": "He also voiced Nero in the Devil May Cry series and also Koizumi in the melancholy of suzumiya animation",
                    "score": 3,
                    "author": "QuickDealer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He also voiced Yu Narukami and Tohru Adachi in Persona 4 series.",
                            "score": 2,
                            "author": "Player2LightWater",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He is also Jonathan Joestar.",
                                            "score": 1,
                                            "author": "Player2LightWater"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our Boy JYB coming Back People!!! We gonna get another cast reunion anime just like Boruto! I feel like I’m dreaming, his voice just makes me want to hear it over and over again, so handsome! Johnny as our Shonen Soul Reaper Star is coming Back! So down for Bleach’s Return!!!",
            "score": 8,
            "author": "SatisfactionFalse641"
        },
        {
            "level": 0,
            "comment": "oh..yess baby... Funn begins... lets goooooooooooo",
            "score": 2,
            "author": "Academic-Register197"
        },
        {
            "level": 0,
            "comment": "Hype",
            "score": 2,
            "author": "WelkinBro"
        },
        {
            "level": 0,
            "comment": "🔥🔥🔥🔥🔥🔥🔥",
            "score": 2,
            "author": "YanoB23"
        },
        {
            "level": 0,
            "comment": "Hypeeeeee",
            "score": 2,
            "author": "Stegs75"
        },
        {
            "level": 0,
            "comment": "I've never watched bleach but I will Soon",
            "score": 2,
            "author": "Spirited-Airline-118"
        },
        {
            "level": 0,
            "comment": "Hyped!",
            "score": 2,
            "author": "MrFrancastic"
        },
        {
            "level": 0,
            "comment": "Yes yes yes yes",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My god I can't wait till October, I hope the opening is a remix of *~Asterisk~ (by Orange Range)",
            "score": 2,
            "author": "helloiamaudrey"
        },
        {
            "level": 0,
            "comment": "So what does this cover again? If I remember right there was the whole Aizen storyline that took 500 million years to do, then a storyline about super powered humans, and then there's the thing with the Bow using humans, the Quincy I think. And then it just sort of ends.\n\nGod Bleach really did just go on way too long didn't it?",
            "score": 1,
            "author": "SquireRamza",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Thousand Year Blood War Arc of the anime will cover the final arc of Bleach, named after the arc of the manga, where all the worlds and existence are threatened by a surviving faction of quincy named the Wandenreich, who have been preparing since the last war between quincy and soul reaper as their goal was to wipe out the soul reapers and take over all of reality",
                    "score": 6,
                    "author": "KR_Blade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, one of the two story arcs that felt just tacked on to keep it going when it really should have ended after Aizen",
                            "score": -1,
                            "author": "SquireRamza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No fullbring gave development Ichigo’s character and TYBW gave a lot of cool reveals fights and bankai’s it also revealed beckstoires for a lot of the soul reapers. Despite what people repeat from YouTubers no it shouldn’t have ended after Aizen it wouldn’t even make sense for the story for it to end there. Aizen isn’t the beginning of the world of Bleach.",
                                    "score": 8,
                                    "author": "Karma110"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Way too long” it’s only 6 arcs how is that too long? Compared to One Piece or Naruto that’s even shorter.",
                    "score": 3,
                    "author": "Karma110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably because Bleach never gave itself a chance to just sit down and BREATHE. you would go for dozens of episodes and hundreds of chapters where a legitimate summary of them could be \"and they fight and they fight and they fight and they fight and they fight and they fight and they fight and they fightand they fight and they fight and they fight and they fight\" ad infinitum. At least Naruto and One Piece remember to have a couple of cool down fluff chapters/episodes.",
                            "score": 0,
                            "author": "SquireRamza",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fullbring was the sit down and breathe arc that’s LITERALLY what it was. There’s literally a chapter/episode where Ichigo is just talking to an adult about his issues and problems in life a full chapter. Just say you don’t read or watch it and move on.",
                                    "score": 5,
                                    "author": "Karma110"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If for some reason bosch was to be replaced the only English voice actor I think could fit the role would have billy kametz RIP (my favourite English voice actor) but I’m happy Bosch is still doing the role :) he fits ichigo so well and he puts so much effort into it",
            "score": 1,
            "author": "BritishToe"
        },
        {
            "level": 0,
            "comment": "It's not confirmed yet right? but they have to be morons if they done get him back",
            "score": 1,
            "author": "Bleklteg"
        },
        {
            "level": 0,
            "comment": "What is the name of the ost ?",
            "score": 1,
            "author": "syed649",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a remix of Number One.",
                    "score": 1,
                    "author": "SaltMachine2019"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I better finish the rest of the show and fast!",
            "score": 1,
            "author": "Cheap-Hour6579"
        },
        {
            "level": 0,
            "comment": "i hope its not a mess like the manga was",
            "score": 1,
            "author": "Gred7n"
        },
        {
            "level": 0,
            "comment": "Johnny Bosch is really just perfect for Ichigo. His serious mode has just the right rumbling _snarl_ to it to let you know that Ichigo is not holding back, but working very hard to put you in the ground.",
            "score": 1,
            "author": "SarcasmProvider76"
        },
        {
            "level": 0,
            "comment": "Not hating or anything but I prefer Bleach in Japanese.  Couldn’t get into the dub.  I’m personally more excited for him to return as Vash the Stampede in the new Trigun.",
            "score": -18,
            "author": "The4FiveSix"
        }
    ]
}