{
    "id": "vlcrap",
    "score": 442,
    "title": "SPY x FAMILY | Behind The Scenes With Ricco Fajardo &amp; Aleks Le",
    "author": "MarvelsGrantMan136",
    "date": 1656272781.0,
    "url": "https://www.reddit.com/r/animedubs/comments/vlcrap",
    "media_urls": [
        "https://v.redd.it/4cm0iu9tr0891"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Saw this pop up and thought it would be nice to share since we don’t get too many of these behind the scenes clips.\n\nLove seeing how much fun they’re having, even when it’s just voicing a few lines.\n\nWe also get another look at the new CR studio.\n\n[Source](https://twitter.com/alekslevo/status/1540761635274444806?s=21&amp;t=4vaDK2MfQN0QrwpHJxfQfA)",
            "score": 45,
            "author": "MarvelsGrantMan136"
        },
        {
            "level": 0,
            "comment": "Wait, Aleks Le traveled all the way to Dallas?",
            "score": 16,
            "author": "Luigiman98",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was already in Dallas recording for the Dragon Ball movie and they asked him to record the extra lines for SPY x FAMILY.",
                    "score": 19,
                    "author": "MarvelsGrantMan136",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did he have to go all the way to Dallas? I guess they’re strict about using the studio now.",
                            "score": 4,
                            "author": "Frontier246",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure, but his part in Dragon Ball is pretty substantial playing Gamma so they probably felt it would sound better in-studio for the movie.\n\nWe’ll get a better idea of how strict they are in the Summer when shows like SHADOWS HOUSE comes back since that was a split cast between Dallas and LA.",
                                    "score": 12,
                                    "author": "MarvelsGrantMan136",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Question, since you mentioned this, I've been wondering about this for quite a while but do you think remote recording at in-house dubs will be allowed for **only reprisals/returning roles** for VA's outside TX or will they also be prompted to travel to Dallas to record in person unless they have a disability or are immunocompromised?\n\nI know Suzie Yeung, despite living in LA, managed to reprise her role as Onodera in Kaguya S3 remotely despite being a CR Dallas in-house dub. Same with Felecia Angelle with her role as Mana in Date A Live IV.",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; VA's outside TX or will they also be prompted to travel to Dallas to record in person unless they have a disability or are immunocompromised?\n\nthat last part that reminds me of Risa Mei to respond to remove remote recording is inhumane, which to me is very sad. I think apart from the sequels, she will probably never appear in the new anime dubs and at least she might focus on dubbing japanese/anime type games like Genshin Impact, JRPG games from Atlus or Nintendo, or maybe an indie Visual Novel, lets hope that she still appear in anime dubbing from Sound Cadence Studios, Okratron 5000 and Kocha Studios.",
                                                    "score": 4,
                                                    "author": "farhanganteng",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "God that would suck. I know it wasn't her first big role but my first time hearing Risa Mei was as Futaba Igarashi and after reading that series for years now she absolutely killed it for me. Would love to hear her in more dubs, and since Crunchy is top dog it would be a real shame if they don't chill out with remote recording",
                                                            "score": 6,
                                                            "author": "AllGoValcone"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks so fun to do as a career. Even the small roles!",
            "score": 15,
            "author": "JazzyKun",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah but the pay’s shit and no benefits.",
                    "score": 17,
                    "author": "Gradz45"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Voice actors goofing off and just having fun with each other. You love to see it. God, I needed something like this today. :)",
            "score": 12,
            "author": "Raebo007"
        },
        {
            "level": 0,
            "comment": "I can’t even imagine what the recording booth looks like with the Kaguya Sama dub",
            "score": 12,
            "author": "TheNorthie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just want to see one recording of Ian Sinclair doing the narrator.",
                    "score": 15,
                    "author": "spiderknight616"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how much fun they look like they’re having! This is a cool little snippet",
            "score": 10,
            "author": "jng2114"
        },
        {
            "level": 0,
            "comment": "I wanna explore Crunchyroll's new studio",
            "score": 5,
            "author": "helloiamaudrey",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s just funimation recording building",
                    "score": 1,
                    "author": "gdhghgv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They changed buildings during the pandemic",
                            "score": 1,
                            "author": "helloiamaudrey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really that’s cool",
                                    "score": 1,
                                    "author": "gdhghgv",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, from what I gather they may've been running out of room",
                                            "score": 1,
                                            "author": "helloiamaudrey"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit, had no idea that Aleks was one of those 2.",
            "score": 3,
            "author": "eddmario"
        },
        {
            "level": 0,
            "comment": "I’m so excited for it!",
            "score": 3,
            "author": "Yaemikomylovee"
        },
        {
            "level": 0,
            "comment": "So so good!",
            "score": 3,
            "author": "lhunt03"
        },
        {
            "level": 0,
            "comment": "Lol this was hilarious. Surprised Aleks flew to CR's studio in DFW to record in person.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was already in Dallas so it worked out lol",
                    "score": 2,
                    "author": "TheLegitMind"
                }
            ]
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "No-Presentation2523"
        },
        {
            "level": 0,
            "comment": "Why hasn’t episode 11 dub been released yet?",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}