{
    "id": "10sucn6",
    "score": 8,
    "title": "incoming fall 2023 when will I get my aid package",
    "author": "Koran21",
    "date": 1675456162.0,
    "url": "https://www.reddit.com/r/CUNY/comments/10sucn6",
    "media_urls": [
        "https://i.redd.it/9vxtk5mdr2ga1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "October or late September if it’s for fall 23",
            "score": 4,
            "author": "nycshawty94"
        },
        {
            "level": 0,
            "comment": "Did you file for financial aid and list the school you'll be attending? If you did, you should see the breakdown of your aid by the time school starts.",
            "score": 1,
            "author": "Historical-Beach-343",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I filed a fafsa and tap when will I see the aid Part",
                    "score": 1,
                    "author": "Koran21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1st make sure that your application was processed on both sites. You should be notified by them what you qualify for. Once your school has it you should see it on your student account. If not you should call them or jump on a zoom call to make sure they got your Fafsa information.",
                            "score": 1,
                            "author": "Historical-Beach-343",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I got a email from.cuny they recieved my fafsa. So.the aid is blank till the summer correct did you recieve any aid for fall yer 2023",
                                    "score": 1,
                                    "author": "Koran21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay. They received it and will break down what you're getting. It's blank until the school breaks it down. They see what you're eligible for and if you're eligible for the max that's what they give you. I'm already a student so I only see the 22/23 aid. I usually see if before the semester starts. Every school is different so keep that in mind. Monitor your CunyFirst account",
                                            "score": 1,
                                            "author": "Historical-Beach-343",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My efc is 0 which is what it says in the picture",
                                                    "score": 0,
                                                    "author": "Koran21",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Your school hasn't processed your package yet that's why it says 0. You said you got an email they received it. Once they process it you will see a breakdown of Pell, Tap and options for loans. You will also see distribution dates for each semester. That hasn't happened yet so monitor your account. They are dealing with current students so give it sometime. Like I mentioned every school is different.",
                                                            "score": 2,
                                                            "author": "Historical-Beach-343",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They have processed my efc because my efc is 0 for my fafsa same thing for my friend they processed the cost of attendance and the efc. However they have not processed the aid yet is that correct",
                                                                    "score": 0,
                                                                    "author": "Koran21",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Your school hasn't processed your financial aid. The fafsa determines your eligibility. It doesn't determine your efc because that's based on tuition and fees. Both Pell and Tap have a max that they cover. If you're eligible for the max your efc is based on the tuition and the number of credits you are taking. For example If you're eligible for Tap but don't take a minimum of 12 credits you won't get Tap. There is Tap for part time now but under certain requirements. What exactly is your concern? You start school in the Fall, correct?",
                                                                            "score": 2,
                                                                            "author": "Historical-Beach-343",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yes in the fall",
                                                                                    "score": 1,
                                                                                    "author": "Koran21",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}