{
    "id": "10tr6fq",
    "score": 4,
    "title": "finding jobs on campus",
    "author": "Environmental-Bag-34",
    "date": 1675544474.0,
    "url": "https://www.reddit.com/r/CUNY/comments/10tr6fq",
    "media_urls": [],
    "other_urls": [],
    "postText": "as an international students is it hard to find an on-campus job in any CC's and how much do they usually pay",
    "comments": [
        {
            "level": 0,
            "comment": "Try talking to the Career centers that are usually located in the building. Keep an eye out for all the school emails that you get on your outlook. All the lucrative jobs tend to be in the emails that are sent to the students. You will also be able to get Internships that pay well. I have seen international students participate in them as well.  There is usually a time limit for work when it comes to international students. On campus jobs are formed keeping that in consideration.",
            "score": 5,
            "author": "Unlikely_Task_2969"
        },
        {
            "level": 0,
            "comment": "Not sure if it’s hard as international but it definitely isn’t hard to find a job on-campus. The most I seen was $20 per hour.",
            "score": 3,
            "author": "FrostyObama"
        },
        {
            "level": 0,
            "comment": "You can work as a college assistant in CUNY. Pay is usually around $15/hr. (That's the minimum in NYC, I believe.) The only way to find a job is to walk around to all offices and ask if they're looking for a PT college assistant. Focus on spaces that have a lot do traffic. Take your resume and leave it if they ask for it. Good luck!",
            "score": 2,
            "author": "Awkward-Painter-2024"
        },
        {
            "level": 0,
            "comment": "Go to your career center. When I was a undergrad at York College I was hired as a college assistant at Baruch.",
            "score": 1,
            "author": "DFB-"
        },
        {
            "level": 0,
            "comment": "Do good in ENG101 and then apply to work in the Writing Center asa tutor.",
            "score": 1,
            "author": "MustLoveBoggs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm majoring in computer science I'm not very good at English haha do you know if I can tutor math, french, arab, or computer science?",
                    "score": 2,
                    "author": "Environmental-Bag-34",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah they usually have tutoring centers at every campus with all that stuff!",
                            "score": 2,
                            "author": "MustLoveBoggs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably because OP knows how to manage their time and energy unlike you who pretty much spends most of your time on Fortnite, Warzone and commenting on every single post on Reddit because of your bored.",
                    "score": 2,
                    "author": "Level_Newspaper3148",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, that was a dumb question on my end. My bad.",
                            "score": 1,
                            "author": "Nintendo_Pro_03"
                        }
                    ]
                }
            ]
        }
    ]
}