{
    "id": "10z7v0p",
    "score": 5,
    "title": "Question for those whose TAP Award disappeared from FA package. Did it get fixed?",
    "author": "nojefaturaoliderazgo",
    "date": 1676076348.0,
    "url": "https://www.reddit.com/r/CUNY/comments/10z7v0p",
    "media_urls": [],
    "other_urls": [],
    "postText": "Did any of you contact Bursar’s? \n\nI just noticed the change because when I received the e-mail about a revision, I didn’t think to check. I assumed they sent it because of Work-Study. \n\nI’m a FT student. Taking 15 credits this semester. In good academic standing.",
    "comments": [
        {
            "level": 0,
            "comment": "I contacted FA and in my case my TAP was removed due processing of an e-permit. It should take 2-3 weeks for it to be added back to my Financial Aid package.",
            "score": 1,
            "author": "nojefaturaoliderazgo"
        },
        {
            "level": 0,
            "comment": "@JL6789 Thank you! I didn’t know this bit.",
            "score": 1,
            "author": "nojefaturaoliderazgo"
        },
        {
            "level": 0,
            "comment": "I hope everyone is keeping in mind that TAP only gets applied when you are taking classes that ARE apart of you majors curriculum. You could be full time or part time ( recent addition) . But if those classes don’t consist of ones that are applied to your major you won’t get a TAP disbursement. It’ll show up in your overall F/A package but won’t be disbursed until you’ve met the criteria needed to receive it.",
            "score": 1,
            "author": "JL6789"
        },
        {
            "level": 0,
            "comment": "u/angelli_8 I honestly dont know what to think lol when I log onto the HESC to check my eligibility and whatnot. The $$ is there for this semester. It shows under ‘Estimated’ same with last semesters. So for them to take it away, and say one has to wait… And I’ve never taken out loans.\nI thought my Work-Study impacted it. I hope this gets resolved quickly.",
            "score": 1,
            "author": "nojefaturaoliderazgo"
        },
        {
            "level": 0,
            "comment": "@the_strokesmaybe Give I will be contacting both financial aid and bursar. I think you should do the same.",
            "score": 1,
            "author": "nojefaturaoliderazgo"
        },
        {
            "level": 0,
            "comment": "@the_strokesmaybe Give I will be contacting both financial aid and bursar. I think you should do the same.",
            "score": 1,
            "author": "nojefaturaoliderazgo"
        },
        {
            "level": 0,
            "comment": "@the_strokesmaybe Give I will be contacting both financial aid and bursar. I think you should do the same.",
            "score": 1,
            "author": "nojefaturaoliderazgo"
        },
        {
            "level": 0,
            "comment": "Mine disappeared too, I emailed and they said wait till 23 to see if we have it. I thought it was just me because I took out a loan and it somehow impacted it , but I guess not?",
            "score": 1,
            "author": "angelli_8"
        },
        {
            "level": 0,
            "comment": "I wrote a ticket like the financial aid website for QC says but idk if I should try contacting bursar. I wanted to speak to an advisor but they were all booked.",
            "score": 1,
            "author": "the_strokesmaybe"
        }
    ]
}