{
    "id": "11ciovb",
    "score": 3,
    "title": "Submitting tax verification late",
    "author": "bruhidk123345",
    "date": 1677422107.0,
    "url": "https://www.reddit.com/r/CUNY/comments/11ciovb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve just been admitted into Queen College this past month for the fall ‘23 term as a freshman. I didn’t realize my FAFSA was selected for verification and just saw it as a task in my CunyFirst account. The due date for verification was Feb 21st and I just did the verification tasks today(Feb 26). Will this result in me getting no aid?? Or will my aid package be delayed. Also I applied to Macaulay Honors so will that be affected in anyway?",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t think it’ll affect you in any ways? I have friends and people who got selected for verification during the first few weeks of classes AND still end up getting aid! Since you submitted it today, I think it should be ok… but if it makes you feel better, contact Queens College Financial Aid office to let them know you submitted it and ask them if it’ll affect your aid and Macaulay Honors acceptance in any way. Good luck!",
            "score": 2,
            "author": "LeonZheng646",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks",
                    "score": 1,
                    "author": "bruhidk123345"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t know about Macaulay Honors but I personally was always selected for verification and never did it until half way through the semester. I’m not recommending you wait that long but it always worked out in my favor in the end. You should be okay but I agree with ^ to contact the Financial Aid office",
            "score": 1,
            "author": "Yaelinx3"
        }
    ]
}