{
    "id": "11gklby",
    "score": 4,
    "title": "Should I pick CD or ASAP?",
    "author": "Nexro378",
    "date": 1677800239.0,
    "url": "https://www.reddit.com/r/CUNY/comments/11gklby",
    "media_urls": [],
    "other_urls": [],
    "postText": "OKAY so the thing I wanted to ask is int he title of the post and I was wondering because I was originally supposed to be in CD BUT thanks to tap taking FOREVER TO process my application I wasn’t admitted into CD thanks to me not being able to get it process by the end of September 2022 so I’m wondering which would be best for me to apply for, either CD or ASAP for the next Semester?",
    "comments": [
        {
            "level": 0,
            "comment": "ASAP has a proven track record of graduating students in a shorter period of time.",
            "score": 5,
            "author": "lexalogue"
        },
        {
            "level": 0,
            "comment": "CD if you plan on transferring to a 4 year institution.CD turns into SEEK when you go to a senior college. ASAP benefits are only for 2 year degrees.",
            "score": 4,
            "author": "W0ndurfulC",
            "replies": [
                {
                    "level": 1,
                    "comment": "ACE, the bachelor's equivalent of ASAP, is at some CUNY colleges.",
                    "score": 4,
                    "author": "lexalogue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ASAP, has great benefits! Been in it for 3 years now love my advisor to death",
            "score": 3,
            "author": "Historical_Ad_4442",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see okay thank you for the response",
                    "score": 2,
                    "author": "Nexro378"
                }
            ]
        },
        {
            "level": 0,
            "comment": "CD! For me the CD team at LaGuardia was awesome compared to ASAP. Plus CD turns into SEEK when you graduate for a senior college and then it turns into something else if you plan on continuing your education (forgot the name)",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "From that first sentence I’m guessing every college has different teams corresponding to the specific program. So far I talked to both ASAP and CD and they are both gonna start recruiting again next semester THANK YOU though !",
                    "score": 2,
                    "author": "Nexro378",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re very welcome! I hope all the different advice helps",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep all advice I’m getting is helpful !",
                                    "score": 1,
                                    "author": "Nexro378"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}