{
    "id": "11ijo2q",
    "score": 5,
    "title": "double major?",
    "author": "ProtectorofSuperman",
    "date": 1677979865.0,
    "url": "https://www.reddit.com/r/CUNY/comments/11ijo2q",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im attending to BMCC this year and im really interested in 2 different programs, Engineering Science and Economics, but im not sure if it’s possible to do it at BMCC. Does anyone has insight on this?",
    "comments": [
        {
            "level": 0,
            "comment": "Engineering science is an ok associate degree to transfer to do other engineering programs at 4 years. But it’s good for nothing alone.\nAlso, I shall add this: with associate engineering science you’re at freshmen/ sophomore level at 4year school. You’ll have a long grueling road ahead of you. \n\nIf I was u, I’d just pick an associate degree, stick with it and transfer to 4years.",
            "score": 6,
            "author": "Adventurous_Reach506"
        },
        {
            "level": 0,
            "comment": "From my knowledge, I haven't heard anyone do double major, maybe it's only for 4 year colleges",
            "score": 5,
            "author": "Johnny_boba97"
        },
        {
            "level": 0,
            "comment": "You can, but only at a 4 year. Focus on one now and most of your credits will transfer, allowing you to focus on the other (mostly) at your 4 year school.",
            "score": 3,
            "author": "Gettingfatsoon"
        },
        {
            "level": 0,
            "comment": "4 year schools you can I’m a double major at my school CCNY but 2 year schools im not sure and usually with double majors it has to be the same type of degree like 2 BA’s you can’t do a BA and BS. Economics at BMCC is an A.A degree and Engineering is a A. S degree. I’m sure their website has admission counselors contact  and ask about it.",
            "score": 2,
            "author": "Only_Albatross_4481"
        },
        {
            "level": 0,
            "comment": "I don’t think that’s possible anywhere. You can get a minor in one, though.",
            "score": 1,
            "author": "Nintendo_Pro_03"
        }
    ]
}