{
    "id": "123a4wj",
    "score": 1,
    "title": "Failing bio because never attended class",
    "author": "[deleted]",
    "date": 1679888298.0,
    "url": "https://www.reddit.com/r/CUNY/comments/123a4wj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Do you guys think I still have a chance to pass bio human anatomy ? It ends may 16 or the end of may or something , my grade is 0 in lab\n\nY’all think I can still pass and graduate this June ?\nI got Covid so I missed class",
    "comments": [
        {
            "level": 0,
            "comment": "you don't even know when it ends, you're not going to figure out the course material.",
            "score": 1,
            "author": "nygdan"
        },
        {
            "level": 0,
            "comment": "Best bet is to speak with your professor, but no I’m pretty sure it’s too late to pass, or you were prob dropped from the class from never attending.",
            "score": 1,
            "author": "itsmesarahe"
        },
        {
            "level": 0,
            "comment": "You aren't even being honest with yourself. Class started in January and you never attended class, yet you blame it on having Covid. Did you do the midterm or any of the assignments? You need to speak to your Professor ASAP. And I mean before SP.",
            "score": 1,
            "author": "thatringonmyfinger"
        },
        {
            "level": 0,
            "comment": "don't the labs count towards your credits? idk if you can get lab time back tbh",
            "score": 1,
            "author": "jenastro"
        },
        {
            "level": 0,
            "comment": "It’s good to have cards like a playing deck for  anatomy, I made some with index cards. Helps to memorize while making. There may be an app too.",
            "score": 1,
            "author": "tigermomo"
        },
        {
            "level": 0,
            "comment": "If you have those doctors notes documenting your months long COVID battle try it. If you just skipped class and had COVID for a week, you’re cooked.",
            "score": 1,
            "author": "lossandstatic"
        },
        {
            "level": 0,
            "comment": "I dropped the course friends &amp; will take it summer",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good move. Retake and start anatomy memorizing now",
                    "score": 1,
                    "author": "tigermomo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah thank you for the advice bud, I’m gonna create a school schedule and study schedule on Notion so I can succeed in the class and graduate",
                            "score": 0,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why not go to the class?",
            "score": 1,
            "author": "Nintendo_Pro_03"
        },
        {
            "level": 0,
            "comment": "How tf are you gonna make up labs for Anatomy?",
            "score": 1,
            "author": "monochroma_1487"
        },
        {
            "level": 0,
            "comment": "Bro doesn’t even know when the class ends, talking about “can I still pass”. Buddy I think it’s over for you; professors aren’t gonna wanna help you out if you haven’t communicated with them at all until the eleventh hour.",
            "score": 1,
            "author": "amalgamationsystem"
        },
        {
            "level": 0,
            "comment": "Did you miss every class bc you had Covid or bc you didn’t wanna go to class…better off dropping and taking it more serious next semester",
            "score": 1,
            "author": "bak723"
        },
        {
            "level": 0,
            "comment": "Dude just go to class.  You will get a passing grade by attending class and trying. And by now the mid terms already pass. Just drop the class.",
            "score": 1,
            "author": "DalekSupreme23"
        },
        {
            "level": 0,
            "comment": "You should speak to your professor asap",
            "score": 1,
            "author": "Mai_TaiButterfly"
        },
        {
            "level": 0,
            "comment": "Drop the course. Labs are too important especially for human anatomy. Why did you skip the labs?",
            "score": 1,
            "author": "abzu_the_noodle"
        },
        {
            "level": 0,
            "comment": "dont look for shortcuts just go to class, attenance is required for a reason, especially science classes.",
            "score": 1,
            "author": "ciggywet"
        },
        {
            "level": 0,
            "comment": "Ask your professor, not us. I also was sick but I was only out for a week or a week and a half at most, I am still doing fine.\n\nYou may need to withdraw from the class, but speak to your professor first and if your professor is INSANELY generous enough, you better spend your entire time making up that work.\n\nGood luck. Speak to your professor ASAP.",
            "score": 4,
            "author": "FrostyObama"
        },
        {
            "level": 0,
            "comment": "no dude, u didnt do the work!!",
            "score": 1,
            "author": "ciggywet",
            "replies": [
                {
                    "level": 1,
                    "comment": "What if I can make up the work ?",
                    "score": -2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Covid doesn’t mean you miss months worth of class. Only a week or so. Lab instructors work with those who miss class for legit reasons and even drop some of the lower labs. \n\nNot attending and asking strangers if your gonna pass and graduate is 🤷‍♂️",
            "score": 5,
            "author": "tweetibird"
        }
    ]
}