{
    "id": "123ymxj",
    "score": 4,
    "title": "Macaulay Honors",
    "author": "Lovely_fartz",
    "date": 1679947530.0,
    "url": "https://www.reddit.com/r/CUNY/comments/123ymxj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Did anyone who got waitlisted from a Macaulay school received an email from them about wanting to remain on the waitlist? If so, do you guys know what we should write on the statement?",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah I just said “I still remain interested in the college and hope to hear from you soon!” but im pretty sure it doesnt impact ur chances of getting in or not since its ranked its just to know if you accept the waitlist or not",
            "score": 2,
            "author": "Psychological_Hair60",
            "replies": [
                {
                    "level": 1,
                    "comment": "this whole process is odd, like is there ranks? is it random? how soon can we find out if we get in?",
                    "score": 2,
                    "author": "adriana2471",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m also confused about that, and I’m hoping we receive the decision before May 1st",
                            "score": 2,
                            "author": "Lovely_fartz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ohhh…I was literally about to write a whole paragraph 😭",
                    "score": 1,
                    "author": "Lovely_fartz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i got waitlisted last year &amp; wrote my statement on how i visited the school &amp; loved the atmosphere and how i was able to get a glimpse of the community and would love to be apart of that community, if you are accepted off the waitlist you should receive a notification in may, if you don’t you receive an official rejection in july/august",
            "score": 2,
            "author": "anonymousgirl_25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh 😕 I was hoping to receive decisions before may since most schools needs us to commit by May 1st. But thank you!!",
                    "score": 1,
                    "author": "Lovely_fartz"
                },
                {
                    "level": 1,
                    "comment": "Heyy, I have a quick question. When you submitted your letter of interest for Macaulay, did they sent you a confirmation email that they received it? I haven’t received a single email from Macaulay after this specific email, so idk if that’s normal. I’ve noticed that CUNY doesn’t really seem to send out emails when we accept or submit things 😅",
                    "score": 1,
                    "author": "Lovely_fartz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hey! and no they didn’t send a confirmation email after i sent the letter of interest, you’ll only get an email if you got off the waitlist but otherwise you get nothing!",
                            "score": 1,
                            "author": "anonymousgirl_25",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! 💕💕💕💕💕",
                                    "score": 2,
                                    "author": "Lovely_fartz"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what is macaulay honors? i'm curious",
            "score": 1,
            "author": "jenastro",
            "replies": [
                {
                    "level": 1,
                    "comment": "Macaulay honors is a selective honors college. To me, it’s like a four-year CUNY honors program. In your senior year, you are only allowed to choose one school for Macaulay. For instance, I chose Hunter for Macaulay. You don’t have to pay for tuition if accepted. Also, I've heard that you get a free MacBook and first-day registration privileges. Also, you have the choice to dorm for free. Additionally, Macaulay is known for providing its students with pretty good internship opportunities. Students will likely receive two graduations, one for Macaulay and one for the CUNY from which they are graduating. Some Macaulay students attend institutions such as Hunter, Queens, Baruch, City, etc. If you’re attending a four year CUNY school, you might also have some Macaulay students as well. I strongly advise anyone in your family who is a junior to consider in applying for Macaulay. I'm on the waitlist, but it’s an incredible opportunity.",
                    "score": 1,
                    "author": "Lovely_fartz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh i'm already in my second year of CC so i don't think i qualify 🥲 but that would've been nice to know when i was in highschool",
                            "score": 2,
                            "author": "jenastro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh :/ I feel like they should do something to be more well known, especially since not many are aware of this opportunity. Some of my friends didn’t know about it either.",
                                    "score": 1,
                                    "author": "Lovely_fartz"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}