{
    "id": "12540v3",
    "score": 6,
    "title": "Medgar Evers College",
    "author": "Wired_Head1955",
    "date": 1680041181.0,
    "url": "https://www.reddit.com/r/CUNY/comments/12540v3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y’all, I’ve accepted Medgar Evers admission offer but I didn’t get my admission letter so I called the admission office today and the lady told me she’ll work on it after I told her my CUNYFirst ID and now I logged onto my CUNYFirst and y’all won’t believe this…my admission term has been changed to summer 2023 from fall 2023 and my commitment deposit fee has charged from “Required” to “Waived”\n\nWhat does this mean someone please explain to me, I need help.",
    "comments": [
        {
            "level": 0,
            "comment": "Your accepted . All admitted students for fall term will switch to summer as some will have the opportunity or May be required to take summer classes",
            "score": 4,
            "author": "Chocolatepooh_25"
        },
        {
            "level": 0,
            "comment": "OP waived means exactly what it says. You don’t have to pay the deposit… It’s usually waived if you’re a nyc high school student I believe. If you filled out the fasfa and your efc is 3,000 or less you’re eligible to get it waived also. You don’t have to start in the summer but the option is there if you want. If you plan on starting in the fall then that’s fine as well. Being admitted for summer doesn’t change anything except taking a summer class before the regular semester if you want.",
            "score": 3,
            "author": "Only_Albatross_4481",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah but I’m an international student I’m wondering why it got waived",
                    "score": 1,
                    "author": "Wired_Head1955",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not sure maybe you qualified for the waived deposit through  other means. Regardless it’s a good thing. $100 you get to keep nothing to worry about.",
                            "score": 2,
                            "author": "Only_Albatross_4481",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you don’t mind could you briefly explain to me how this summer thing works at a 4yr college, I honestly have no idea",
                                    "score": 1,
                                    "author": "Wired_Head1955",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not only 4 year Cuny schools. It’s possible at 2 year schools as well. Cuny isn’t the only schools to do this. A lot of colleges may do this. Being admitted for summer gives you the opportunity and flexibility to enroll in summer  courses if you want or if you’re maybe required to.",
                                            "score": 2,
                                            "author": "Only_Albatross_4481",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well thank you, I’ll contact them when the office is opened and I’ll ask them to enlighten me.",
                                                    "score": 1,
                                                    "author": "Wired_Head1955",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s nothing to worry about honestly. If you want to take a summer class before you start in the fall whether to get ahead or other  reasons being admitted for the summer allows this. But yes still call the admission office if you’re still confused. Maybe they can explain in a clearer way!",
                                                            "score": 1,
                                                            "author": "Only_Albatross_4481"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same thing happened to me, I applied to queens college for fall 2023 and they admitted me for summer 2023 which is tricky cause I have to take my last class this summer but can’t cause they admitted me for summer",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You got accepted &amp; will get admission letter emails soon and by summer you will officially be a medgar Evers college student",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}