{
    "id": "12eprc4",
    "score": 24,
    "title": "My 4 years as a CSI computer science student",
    "author": "thisismynewaccount9",
    "date": 1680882894.0,
    "url": "https://www.reddit.com/r/CUNY/comments/12eprc4",
    "media_urls": [],
    "other_urls": [],
    "postText": "**Intro, 4 years ago:** When thinking about what tf to do with my life post high school, the easy route was college. I’m from Staten Island and CSI has a very high acceptance rate so college choice was an easy decision. \n\n**Fall 2019:** I'm an undeclared major. The classes I was taking were those of general education, classes all majors need: ENG 111, SOC 100, ART 100, MTH 30, GEG 100. These classes were very easy. I met with my advisor only once throughout the entire term and only because it was mandatory to remove a hold that disallows you from enrolling in classes next term. It was at this meeting I officially declared my major as computer science.\n\n**Spring 2020:** This term contained my first CSC course: CSC126 (along with ENG151, COR100, MTH123). It's worth noting I essentially had no experience in the world of computer science. No true exposure to programming languages, computer architecture, software engineering, etc. The first half of the semester was going smoothly as I learned VERY basic c++. I was honestly enjoying the class. I was getting good grades across all classes, and was spending time with friends on campus. Until.. Covid. It was only supposed to be a week of remote classes, and I was taking full advantage of that 1 week; Sleeping in, doing anything but paying attention to lectures, and not studying. Turns out, the entire term was online, and guess what? My habits mentioned before persisted and I half assed my way through my first computer science class (and all other classes for that matter). I met with my advisor through zoom for the same reason mentioned before. There was no real connection between us and I was going into my third term without a real mentor. When registering classes, I realized all of them were fully online. My thoughts at the time: “lets go, I'll just enjoy one more term fully online, then I will be in person for 2 and 1/2 years”. \n\n**Fall 2020:** My classes: CSC211, CSC220, MTH130, HST272. I truly tried to break out of my lazy habits because I knew it wouldn't work once we were in person. But my god, my 211 class was absolutely horrific!!! It is called intermediate programming  and this is just a buffed CSC126. Basic programming skills anyone can learn on youtube; Introducing students to pointers, classes, recursion, etc. The professor is, to this day, one of the worst professors I ever had. She single handedly almost made me switch my majors because of how uninspirational she was. There was no communication among students in my class either. We all joined the meet, and left. I met no new people and I was very close to switching my majors. My other CSC class (211) was on assembly language which I found rather easy and interesting. Perhaps a bit too easy; the professor would quite literally give us answers for homework, and would give us an entire day to submit exams. As for MTH130, I didnt understand the point of this class. It was titled precalc, but was just taught mth123 content with a bit more topics added. I met with my advisor once for the same reason and still, no mentor offering to give me guidance. \n\n**Spring 2021:** How are we still fully remote? I was a terrible computer science student. At this point students had a general idea on what field they wanted to go in. Me on the other hand barely knew how to program, and just knew the absolute fundamentals of c++ and assembly, something that could be done from watching youtube videos. My classes: mth229+mth231, csc228, csc326, geo115+116. My 326 class was difficult. This is known as the class that most people decide to commit or drop as a computer science major. I enjoyed the professor, she motivated us and taught a wide range of data structures. For the first half of the term, I was able to pass quizzes and exams without outside help, but as the term went on, I stooped to a new low. Chegg. Calculus, discrete math, data structures &amp; algorithms were all difficult and Chegg offered solutions. I started to feel tremendous guilt and doubt. Cheating my way through a computer science degree? What am I going to do when we're in person? Calculus 2 I was especially scared of, since I cheated through calc 1 how was I supposed to know what's going on in calc 2? My solution, take an online summer course for calc 2. That's right, while my peers were doing internships for the summer, I was busy b.s.ing a class. At this point, I wasn't even meeting with my advisor, rather it was just me sending an email to them to remove the hold, and they did. I had no career direction and was just getting a computer science degree for the sake of it. I started to go into a depression.\n\n**Fall 2021:** I passed calculus 2. Thank you Symbolab. The transition to in person classes has started, yet not really. Classes for this term: GEO102+103, CSC330, MTH233, MTH338. With only 2 being hybrid: CSC330 and MTH233. I couldn't b.s these classes, right? Kind of. For CSC330, the professor made everything but the final online. My bad habits remained, except it only got worse. There were also labs assigned for the class. Being the lazy person I am, I would get code from github, from people who have taken this class before, tweak some lines of code, and call it a day. There was also a big project he assigned where we were to work in groups and create a project using java. Someone in my group was a very experienced java programmer and went above and beyond what was required. It was entirely his project and the most I did was work on the gui yet barely even that. Lastly, the in person final. At finals week, I had no idea what was going on during the lectures. The day before the exam, someone in a discord chat sends last term's final. I spent the entire day of the final memorizing the answers to the questions. Come exam time; It was the exact same as last term's final, and I get one of the easiest 100s ever. Moving onto MTH233 all exams were in person, so I was actually studying and paying attention in class. Luckily enough, the beginning of calc 3 doesn't really require knowledge from calc 1 or 2 and I was able to get a really good grade on the first in person exam. As the term progressed, however, I really needed that prior knowledge from calc 1 and 2. I manage to just pass exam 2. The class started off with about 30 students but by the end there were literally 11 people in the classroom during finals. For the final, I got an absolutely horrible grade (a 43). The professor was very lenient with the grading (I think due to how many students dropped his class) and I managed to get a C as a grade. My calc sequence is completed.\n\n**Winter 2022:** I signed up for a program called tech talent pipeline. It provides students with a Fullstack bootcamp, resume prep, and an internship for the summer. This program really did help me by giving me a career route. I spent my month break learning the pern stack. \n\n**Spring 2022:** After 2 years, all classes are finally in person. I left as a freshman and am coming back as almost a senior. Classes: BIO170+171, CSC346+347, CSC225, CSC226. The only \"difficult\" class out of these were CSC346+347. Even then, they didnt require any prior knowledge with c++ or java, and the professor was one of the best I've taken, so with just studying and showing up I was able to get an A in the class. Since these classes weren't too challenging I spent time on leetcode and preparing for the internship I had coming for the summer. At this point I did not have a true mentor for 3 years or have any friends in any of my classes. I was not indulged in CSI's campus activities, only showing up for classes and leaving. CSI finally changed my advisor after the entire covid shut down. I got the advisor I wish I had from the very beginning, Kristi. I have heard great things about her prior. She helps give guidance to computer science students who don't have direction which would have been absolutely ideal for me. Who do they assign as my advisor though for 2 years? Someone who doesn't even reply to emails. It's difficult being a first generation college student, and I wish more people like Kristi were available for CSI.\n\n**Summer 2022:** I finally had an internship as a full stack developer. It went smoothly and I enjoyed working for the company. The only thing was their company size was very small so I was doing work solely with little room to learn. I really should have gotten an internship earlier than my last summer as an undergraduate. Only 1 internship is low for a computer science student. At least I had something now though. A career route, linkedin, github commits, personal website, etc. Better than just being a computer science student for the sake of it.\n\n**Fall 2022:** Is it really my last year? I was taking difficult classes and was scared It would not be my last year. Classes: CSC305+332, CSC315, CSC446, CSC421. This term I started to notice something. The professors make classes way too easy to pass. I'll just blatantly say it: I should have failed 332. I did not show up most of the time, I didn't do my homework and I absolutely flunked the final. The professor was horrible; Confused himself at times, uninspiring, and did not know how to teach. The thing is though, he allowed cheat sheets for exams. I never understood this from a professor's point of view. Why would you allow us to cheat on exams? Even with a cheat sheet for the final, I got a fcking 30 on my final. I did the calculations on what I should be getting as a final grade and it came to a 59, exactly 1 point less than what's needed to get a D, and I deserved to fail too. Final grade is posted and I get a C. How? Idk but ill take it. Moving onto CSC315. He gave take-home exams which just made the class way too easy, and I got an A. CSC421, I did have to study for everything except the final. He used the exact same final as last year's exam and I just memorized the answers to all questions. The professors made difficult classes into rather easy to pass classes. This started to make me realized, anyone can get a computer science degree at CSI. They make the classes too easy to pass where anyone who does the most minimal amount of work, like me, can pass the class. I think this has to be fixed. Why should people like me be rewarded with a computer science degree?\n\n**Spring 2023:** My last term. Classes: CSC430, CSC382, CSC490. 430 is very simple, no exams, just projects. CSC490 is very simple, no exams, just presentations and a paper. CSC382 is difficult but I'm managing it. I'm managing it because again, professors make the class too easy to pass. When I say the class is too easy to pass, I do not mean the content, I mean the grading structure.\n\n**Conclusion, the present:** CSI has potential to have an amazing computer science program. The biggest problems CSI for computer science has are the advisors and the professors. I've had 3 advisors and all but 1 have given me any guidance, but even then I was a senior at that point and did not drastically change anything. There are some amazing professors in the computer science department. However, for every amazing professor, there are absolutely atrocious professors who seem to not even understand the material they present. If you are reading this, and you are transferring to CSI as a computer science student, please please please reach out for guidance, because they do not care enough to reach out to you.",
    "comments": [
        {
            "level": 0,
            "comment": "This is such an interesting account. The one thing I was looking for toward the end was where you landed in terms of skills and competence. I guess you became a person who can function in that world based on your internships and stuff, but what would you say your competence level is on a scale of 1-10?",
            "score": 7,
            "author": "MustLoveBoggs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the read! Your assumption is correct. I am able to work my way around almost any basic computer science topic such as circuit design, basic algorithms and DS, c++ programming, and web development. My skills grew after my bootcamp, which is way to late into my undergraduate studies. Students in Verezzano or Macauley gain skills in there field by freshmen year. The way I was able to achieve this point wasnt by CSI though, it was more of me watching youtube videos and practicing leetcode. My competence level? 6 maybe. I think there are students at CSI with even lower competence; i know people at CSI who literally are there just to get a degree. The reason i give myself a 6 is because I always get the job done, i pass all my classes, i completed an internship, and I think at this point my skills are strong. Yet a big problem i have is i do a half ass job",
                    "score": 5,
                    "author": "thisismynewaccount9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very good post, O.P.!\n\nThe professors might be an issue for all colleges and all majors, not just CSI and Computer Science. And add to that that there are literally very limited course options for every class, which is very annoying.",
            "score": 3,
            "author": "Nintendo_Pro_03"
        },
        {
            "level": 0,
            "comment": "Yo I'm at CSI too, is Tech Talent Pipeline the same in terms of helping you as CUNY Tech Prep?",
            "score": 2,
            "author": "justjeffo7",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you asked me this 2 years ago, i would have said no and that cuny tech prep is the better route. TTP’s bootcamp at the time was VERY rushed being that it was only 3 weeks. This means html, css, javascript, react, databases, postgres, mongodb, node, api’s, express, and many other technologies are taught within 2 and 1/2 weeks(with a project taking up the remaining week). Now, however, the bootcamp is in the summer, similar to cuny tech prep. Ultimately, I cant give you a direct answer because I never been a part of cuny tech prep, but i can tell you the goods and bads about ttp. TTP had an amazing instructor and career coach(omar). TTP also gives a path to students who dont know what field they want to go in; giving an internship, resume prep, and job alerts. Now, let me tell you about workshops. The morning session of a day in the bootcamp was a lecture, the afternoon was the workshop, where you were to work on an assignment in a group with a “helper”. Id say half of these helpers were not qualified enough to be helping us when we were absolutely stuck. Id imagine this would be the same for cuny tech prep though. So while i cant say which is better, i hope this helps a little (sorry for making such a long response)",
                    "score": 2,
                    "author": "thisismynewaccount9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’re still here, do you remember when TTP started?",
                            "score": 1,
                            "author": "justjeffo7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it starts in june, maybe they are still doing interviews",
                                    "score": 1,
                                    "author": "thisismynewaccount9"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "thank you for your post! it was insightful as a student switching majors. can i ask, what was your gpa/what were your grades? are C’s okay for comp sci? i’m worried i’ll barely manage to pass classes",
            "score": 2,
            "author": "tealeaves2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im glad my post was useful! I graduated 2 days ago with a gpa of 3.6 . C’s get degrees my friend. In all seriousness, C is the minimum grade you have to get to move onto the next class. For example, CSC330 (and a lot of other CSC classes) requires a grade of C or higher in CSC326. However, some classes you can get D’s and be completely fine like CSC382 and CSC446. Since you ask, the lowest grade I received in my 4 years was a C. You read my post so you can understand how mediocre I was as a compsci student. If i can do it, i truly believe you can do it. Some classes will be tough but I think with enough work, every class is manageable to pass. I feel I need to out 2 professors to absolutely avoid: Herschkorn for MTH classes and Gueorguieva for CSC classes. Ive seen bad professors but these 2 are atrocious and almost made me switch majors. Also, try to get into TTP or Tech Talent Pipeline as soon as possible. I regret not signing up sooner. Good luck! And if you ever have questions feel free to reach out. Im more than happy to answer",
                    "score": 1,
                    "author": "thisismynewaccount9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thanks so much for the detailed reply, i appreciate it! congratulations on graduating, wishing you all the best in your future endeavors!! and thanks for the heads up on the professors. i might take you up on that offer, thank you again for all the help😊",
                            "score": 2,
                            "author": "tealeaves2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Any time !",
                                    "score": 2,
                                    "author": "thisismynewaccount9"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interested in the CUNY discord server?\nhttps://discord.gg/9cxwGrh\nCheck out the sidebar for other CUNY related Discord servers!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CUNY) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}