{
    "id": "12n398r",
    "score": 3,
    "title": "CCNY or UBuff",
    "author": "dark_chigga",
    "date": 1681567017.0,
    "url": "https://www.reddit.com/r/CUNY/comments/12n398r",
    "media_urls": [],
    "other_urls": [],
    "postText": "Which one should i chose for computer science?",
    "comments": [
        {
            "level": 0,
            "comment": "UB",
            "score": 2,
            "author": "RawGrit4Ever",
            "replies": [
                {
                    "level": 1,
                    "comment": "Explain please?",
                    "score": 1,
                    "author": "dark_chigga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "UB is an amazing research STEM school and has really good focus programs there. \n\nSource: studied there for a bit",
                            "score": 3,
                            "author": "chriskhad"
                        },
                        {
                            "level": 2,
                            "comment": "SUNY over cuny.. UB well established, but 2 different lifestyles whenever you land. NYC hustle and noise population versus Buffalo quiet and comparable middle America life.",
                            "score": 1,
                            "author": "RawGrit4Ever"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same exact dilemma here, interesting to hear what people say. I’m personally leaning towards UB myself as it seems way higher ranking and I can actually seem to get an actual college experience plus it seems I get to have a higher chance of landing a job outside of NY with UB as opposed to CCNY. But I’m still deciding and comparing to see which one",
            "score": 1,
            "author": "OkButterscotch7679",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah fr I don't want to go to highschool again but the question is are the loans worth it.",
                    "score": 1,
                    "author": "dark_chigga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah and I am also transferring to either UB or CCNY from BMCC so it might be a different situation for me. And that’s the main problem for me as well, the price difference but atp it might seem worth it for me but I still want to hear other opinions",
                            "score": 1,
                            "author": "OkButterscotch7679",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish I could just go to UB but loans are an ass so I have to think smart.",
                                    "score": 2,
                                    "author": "dark_chigga",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m in the same exact position UB is better than all CUNYs in every way opportunities, internships, job market, even for grad school and social life etc. the only thing holding me back like you said is the loans. Are you transferring or coming in as a freshman? If freshman why don’t you go to a CC for the first two years and the transfer? To minimize the loans",
                                            "score": 1,
                                            "author": "OkButterscotch7679"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Try to qualify for the EOP program they help you pay for your loans",
                                            "score": 1,
                                            "author": "chriskhad"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}