{
    "id": "12xzf8x",
    "score": 3,
    "title": "Applying to cuny",
    "author": "Proof_Brush2110",
    "date": 1682376373.0,
    "url": "https://www.reddit.com/r/CUNY/comments/12xzf8x",
    "media_urls": [],
    "other_urls": [],
    "postText": "I sent out my application for cuny , but now I don’t know how to send over my Ged diploma , help pls",
    "comments": [
        {
            "level": 0,
            "comment": "https://www.reddit.com/r/CUNY/comments/sp21nf/how_do_i_send_my_ged_transcript_to_cunyuapc_for/",
            "score": 1,
            "author": "LilC410"
        },
        {
            "level": 0,
            "comment": "Look on the Application it should tell you. You may have to send over the transcripts directly from the State and not a copy. You can request one sent to the school you applied to .",
            "score": 1,
            "author": "Historical-Beach-343",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can I add it to the “supporting documents “ part of my application",
                    "score": 1,
                    "author": "Proof_Brush2110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What are you adding an official transcript or a copy? My fiance has his GED and he had to get a transcript from the State or School he attended. It should be sent directly to each school.",
                            "score": 1,
                            "author": "Historical-Beach-343",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hi, I am applying too, and I had missed one document. When you subbmited the form they sent you a notificacion confirming you succesfully subbmited it and there you can find 2 emails where you can ask for help on missing documents, one of them is like the main email and the other one is for someone assigned to help you in the process, you just have to send them the document you missed and they will add it. Btw they are very quick answering emails so I recommend you to use it for every questiong regarding the admission process.",
                                    "score": 1,
                                    "author": "001tzt"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}