{
    "id": "12yjez5",
    "score": 5,
    "title": "Hunter College Masters: How Do Nursing Students Juggle Between Work and School?",
    "author": "Weiming2124",
    "date": 1682429215.0,
    "url": "https://www.reddit.com/r/CUNY/comments/12yjez5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am going back to school in the fall for my master's in nursing at Hunter College and I was wondering what everyone else is doing to juggle between work and school.\n\nI plan on doing full-time school and work, but I'm worried that I might not have the time for both.\n\nI have a couple of questions:  \n1. How are the classes usually scheduled for Hunter?  \n2. From the information I read, it's a 3-year program. 3rd year is clinical, do I have to pay tuition for the 3rd year too?  \n3. I know that it is clinical during the 3rd year, but do I also have to do some sort of clinical work as well while attending classes for the 1st and 2nd year?  \n4. I don't qualify for any financial aid, but are there any additional scholarships I can look into? \n\nThank you",
    "comments": [
        {
            "level": 0,
            "comment": "Your job has to be understanding towards your academic demand and schedule accordingly. If that doesn't work then you need to find a more flexible job.\n\nSecond  many students use student loans to manage expenses. Granted this will leave you in debt but you will be able to survive through Grad school while staying on top of rent and bills. Some sacrifices will have to be made and what those are, are upto you.",
            "score": 2,
            "author": "Nervous-Passion-1897",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a really good answer. Especially having a job that is flexible and will cater to your school schedule. I recommend also contacting your department and asking if there are any department scholarships you can apply for and/or available to minimize how much loans you will take out if you go that route.",
                    "score": 1,
                    "author": "Only_Albatross_4481"
                }
            ]
        }
    ]
}