{
    "id": "1359c7v",
    "score": 10,
    "title": "BMCC",
    "author": "PauseOdd9974",
    "date": 1682996149.0,
    "url": "https://www.reddit.com/r/CUNY/comments/1359c7v",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just committed to BMCC I literally don’t know anything about it but I’m a broke immigrant soooo \nLet me know your experiences with bmcc my plan is to transfer to barnard after since I couldn’t go bc I couldn’t afford it",
    "comments": [
        {
            "level": 0,
            "comment": "my professors have been alright although it really depends on what major you’ll be doing \n\nhmmm about the social life I know there’s clubs but most of the people in here are commuters so they really just want to get their work then and leave lol \n\nlastly I really recommend (if you haven’t already) to really know how to study and manage your time so you just really be efficient and get the most out of it yk???",
            "score": 3,
            "author": "strawberryshitcake_",
            "replies": [
                {
                    "level": 1,
                    "comment": "The clubs here are actually pretty good, as there are people who definitely try to be involved on campus but you do have to seek out the experiences",
                    "score": 2,
                    "author": "IndypendentPop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah that’s true I know someone in my lab class who actually runs a clubs and they have a budget and everything",
                            "score": 2,
                            "author": "strawberryshitcake_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "don't know your exact financial situation but because i made pennies i was able to join the ASAP program and it saved me so much. semester long metrocards which were clutch, even though all my classes were online hahah. my advisor was kinda weak but it was nice to have one that was with me throughout the whole thing and knew my history. as for the school itself, it has the nicest facilities out of all the cunys, if you care about that kinda thing. the clubs are cool. the students are cool but don't expect to make lifelong friends. i had 95% dope professors. i go to john jay now and i can honestly say a lot of the material i learned at bmcc was harder than what i'm doing now. it's a great school that gets a bad rap.",
            "score": 2,
            "author": "flashcapulet",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate this, I wish I could join the asap program but im not a U.S. citizen or resident so I can’t even get finacial aid so I have to pay everything myself 😭",
                    "score": 1,
                    "author": "PauseOdd9974",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dreamers js like fafsa but for immigrants i was in that",
                            "score": 1,
                            "author": "Ok-Blacksmith5436",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For illegal immigrants dreamers are for",
                                    "score": 1,
                                    "author": "Ok-Blacksmith5436",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I’m working on trying to get dream status bc I didn’t know about it and apparently my mom did and she never told us about it and she never did it for us 🫠",
                                            "score": 2,
                                            "author": "PauseOdd9974",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No no no not the dream thing for immigrants i never had dream nor was part of the program there something called NYC financial aid for dreamers. DM tonight and ill send u the page",
                                                    "score": 1,
                                                    "author": "Ok-Blacksmith5436",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Omg thank u I did not know",
                                                            "score": 1,
                                                            "author": "PauseOdd9974",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah np. Fill it out asap",
                                                                    "score": 1,
                                                                    "author": "Ok-Blacksmith5436",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oof Nevermind I did not graduate from a ny high school and I have only been here for a bit so I don’t qualify rip 🪦",
                                                                            "score": 1,
                                                                            "author": "PauseOdd9974",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "When u qualify for it then apply for how long have u been in NY?",
                                                                                    "score": 1,
                                                                                    "author": "Ok-Blacksmith5436"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Only a couple of months so I might qualify for state aid for my second year",
                                                                            "score": 1,
                                                                            "author": "PauseOdd9974",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah once that happens get into ASAP program advisors might be trash when giving you advice for enrolling classes this advisor did me dirty w this high level class so lmk if u need help",
                                                                                    "score": 1,
                                                                                    "author": "Ok-Blacksmith5436"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah once that happens get into ASAP program advisors might be trash when giving you advice for enrolling classes this advisor did me dirty w this high level class so lmk if u need help",
                                                                                    "score": 1,
                                                                                    "author": "Ok-Blacksmith5436"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Haha who was your ASAP advisor?",
                    "score": 1,
                    "author": "positivityprince"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Overall it’s not so bad it’s just very far into Manhattan and there’s a lot of foot traffic because of it’s location (world trade center/Brooklyn bridge) great professors if I had to rate them all as one group I would give them a 9/10",
            "score": 1,
            "author": "RRV19"
        },
        {
            "level": 0,
            "comment": "I'm graduating from KCC but did go to BMCC for a semester. I've heard great things about BMCC. If you do a search here a lot of students say it should be a 4 year. I know the Nursing and HIM Programs are really good. The good thing about CC is that after your 2 years if you are an honors student you can get a free ride to any school of your choosing. Advice: Do your due diligence and advocate for yourself. Look up Professors before taking every class. See what students are saying. Don't let an advisor select your core classes. Be proactive in every decision. Lastly as an Immigrant you have to work twice as hard as everyone else. Do the work in these 2 years, graduate and transfer to your dream school. Look on-line for grants and scholarships that your status has no bearing. Good Luck",
            "score": 1,
            "author": "Historical-Beach-343",
            "replies": [
                {
                    "level": 1,
                    "comment": "hi I’m not op but what gpa is considered “honors” 90+???",
                    "score": 1,
                    "author": "strawberryshitcake_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It maybe. You can check on BMCC website. It tells you what GPA is required. I'm graduating with a 3.9. I made Dean's list twice, PTK and Honors. I was going to go to Columbia but deferred to Syracuse University because of housing.",
                            "score": 1,
                            "author": "Historical-Beach-343"
                        }
                    ]
                }
            ]
        }
    ]
}