{
    "id": "136yxj9",
    "score": 2,
    "title": "Transfer application timeline?",
    "author": "runchihiro",
    "date": 1683146635.0,
    "url": "https://www.reddit.com/r/CUNY/comments/136yxj9",
    "media_urls": [],
    "other_urls": [],
    "postText": "I applied to a few CUNY CC's a few weeks ago, and I wanted to know generally how long it takes to hear back. I applied for this fall. I'm sort of a transfer because I dropped out of a 4-year this Spring and I'm trying to go to BMCC this fall. How long after everything is in do they evaluate transcripts/send a decision? Does my application being past the official deadline affect anything?",
    "comments": [
        {
            "level": 0,
            "comment": "i submitted my app around 3-4 days before they were due and they got back to me late march, early april. you might have to wait a few more weeks (rougly 6), but considering you applied a few weeks ago, it should be coming soon, just have a lookout in your emails. as for transcripts, they evalulate it once you commit (correct me if im wrong). i accepted it on april 30th and they haven’t evaluated my transcripts yet. since you applied after the deadline, it might just take longer for you to receive an acceptance. ik certain colleges will give you a spot based on availability, but if youre trying to get into BMCC, they should just be accepting you. lmk if you have questions, good luck !",
            "score": 1,
            "author": "Upset_Dragonfruit_27",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the info! So looong but it's not too bad i guess",
                    "score": 1,
                    "author": "runchihiro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "npp! and yeahh, cuny typically takes a while 😭 but, it will eventually come through :)",
                            "score": 1,
                            "author": "Upset_Dragonfruit_27"
                        }
                    ]
                }
            ]
        }
    ]
}