{
    "id": "1383s4u",
    "score": 2,
    "title": "What is the regent grades required to avoid remedial class?",
    "author": "PapiNina",
    "date": 1683243067.0,
    "url": "https://www.reddit.com/r/CUNY/comments/1383s4u",
    "media_urls": [],
    "other_urls": [],
    "postText": "I heard the requirements changed but I’m not really sure. What’s the grade you need to avoid remedial class in college?",
    "comments": [
        {
            "level": 0,
            "comment": "This may be of interest to you:\n\nhttps://www1.cuny.edu/mu/forum/2023/01/12/cuny-ends-traditional-remedial-courses/",
            "score": 5,
            "author": "thisfilmkid",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great, thank you",
                    "score": 1,
                    "author": "PapiNina"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you get told you need remediation, make sure you take what is called a corequisite remedial course, not a prerequisite remedial course. With the former you take a college-level class but get extra help, and with the latter you take a course that is considered a precollege course that gives you no college credit and that either you or your financial aid has to pay for. Research has shown that students are most likely to pass and graduate when they take corequisite instead of prerequisite remedial courses. Also, if what we're talking about is math (as opposed to reading or writing), if you don't need algebra for your major, be sure to take statistics instead of algebra. Students who take statistics have higher pass rates and generally report more enjoyment of the course than if they take algebra.",
            "score": 4,
            "author": "lexalogue",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your advice, I’ll make sure to pick corequisite and statistics (depending on my major) as you said, if i ever is asked to do remediation",
                    "score": 1,
                    "author": "PapiNina"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remedial classes are painful to take, especially English and that one held me back from graduating. Fortunately, I got through it and then I passed all of my remaining classes, earning my associates degree in the process. Now the bachelor's in English is next on my path to becoming a writer.",
            "score": 3,
            "author": "Scary-Training-1401",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got 93 in my English regent and as for my algebra one I got 75 😬",
                    "score": 2,
                    "author": "PapiNina",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You might have to take math. The required grade is 85+.",
                            "score": 2,
                            "author": "Catstarla",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dang, I guess I’ll have to then. Thanks",
                                    "score": 2,
                                    "author": "PapiNina"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "75 or 85 and above. But sometimes you could ask the department to test you to avoid this",
            "score": 2,
            "author": "sexylassy"
        },
        {
            "level": 0,
            "comment": "Checkout this info on CUNY’s proficiency index : https://www.cuny.edu/academics/testing/testing-faqs/",
            "score": 2,
            "author": "Reasonable_Sense_349",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is this still valid? I heard it changed to 80+ for algebra 1 but i am not sure",
                    "score": 3,
                    "author": "PapiNina"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought Regents grades did not matter too much for CUNY applications? I don’t think SAT matters too much, either.",
            "score": 1,
            "author": "Nintendo_Pro_03",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know myself. All I know is my teacher said if I get a bad grade in the regent, even if I pass, I’ll need to take remedial class in college.",
                    "score": 2,
                    "author": "PapiNina"
                }
            ]
        }
    ]
}