{
    "id": "13edc49",
    "score": 3,
    "title": "Anyone have advice for Macaulay Honors and colleges for pre dental",
    "author": "Firm_Newt_4484",
    "date": 1683780656.0,
    "url": "https://www.reddit.com/r/CUNY/comments/13edc49",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im thinking of applying to Macaulay Honors next year. However, the application process isn’t tied with Naviance. Has anyone ever just asked a teacher for a letter of recommendation and just applied the same one to both naviance and Macaulay. I was thinking of asking 4 different teachers for 4 long recs, but the process seems tedious. In addition, I’m thinking of majoring in pre dental. I was thinking of Hunter because it’s known for its med program, but after reading some posts, I think Baruch might be a better fit. Any advice?",
    "comments": [
        {
            "level": 0,
            "comment": "The people I’ve known who did pre-dental at Macaulay all went to either Brooklyn or CSI. All did very well and got accepted right away to great dental schools. Either would be a better choice than Hunter for that major, and definitely better than Baruch (which I would not recommend for anything non-business).",
            "score": 3,
            "author": "lepidio"
        },
        {
            "level": 0,
            "comment": "Yup it isn’t tied to Naviance but idk your school might make you put it on Naviance \n\nWhen you do the application you’ll put their emails down and then it’ll send some email to them for them to submit their apps\n\nDo you really need 4 recs?",
            "score": 2,
            "author": "stopsakura10"
        },
        {
            "level": 0,
            "comment": "I would go through reddit and look at what students are saying about Hunter. Someone just posted about withdrawing from Chemistry and transferring to Baruch. I agree that I would not go to Baruch for anything not realized to Business. I'm not sure about Dental but BC and CSI are the best schools for pre-health tracks. Hunter used to have a great program but something is going on at that school. People have to understand that there's a lot of politics that goes on at CUNY and students pay dearly for that. I think that's what's happening at Hunter. They say where there's smoke, there's fire.",
            "score": 1,
            "author": "Historical-Beach-343"
        }
    ]
}