{
    "id": "13iipi3",
    "score": 3,
    "title": "Question about schedule builder",
    "author": "mentallydepressedme",
    "date": 1684180893.0,
    "url": "https://www.reddit.com/r/CUNY/comments/13iipi3",
    "media_urls": [],
    "other_urls": [],
    "postText": "If I'm taking English Composition I in College Now (Freshman Composition) as a high school senior, what should I do about selecting my English class for the fall? It won't let me choose the next course after that. Should I just wait until the summer, or should I ask my advisor and/or the one who does the transfer credits to give me temporary enrollment given that I will pass (I have a 90/100 average in the class and how I keep up with it)\n\n&amp;#x200B;\n\nI'm going to CCNY btw",
    "comments": [
        {
            "level": 0,
            "comment": "I took the same course and my credits transferred over. I’m also going to CCNY and I think you should set up an appointment with your advisor soon to build your schedule. I’m making my schedule tomorrow since I took my placement test last week.",
            "score": 2,
            "author": "ReporterSweaty9193",
            "replies": [
                {
                    "level": 1,
                    "comment": "I already had my appointment today. She told me that I might be able to put myself in the next level of English since Im in the process of getting credits for composition. But the system won’t let me so I’m asking what I should do rn as I want to complete my schedule ASAP before it all fills up",
                    "score": 2,
                    "author": "mentallydepressedme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh I understand. I thought our advisors help us understand how to use schedule builder not just tell us what to do.",
                            "score": 2,
                            "author": "ReporterSweaty9193"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You need to have the advisor put an exception in. It's not going to work otherwise. It might not even work then. Speak to the department head if it doesn't.",
            "score": 1,
            "author": "flashcapulet",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the best answer  the English class you’re taking now is a pre-requisite for English 2 so since you didn’t get a grade yet it won’t let your enroll.",
                    "score": 1,
                    "author": "Only_Albatross_4481"
                }
            ]
        }
    ]
}