{
    "id": "13orjoc",
    "score": 3,
    "title": "Dropping classes.",
    "author": "Separate_Ad7674",
    "date": 1684763553.0,
    "url": "https://www.reddit.com/r/CUNY/comments/13orjoc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I Would like to know how much time you have to drop a class in city college and if you do so does that affect something? Like does that affect my financial aid? \n\nThanks!!!!",
    "comments": [
        {
            "level": 0,
            "comment": "You missed it. The last day to get a W was on the 16th. If you drop now, you will get a WU which is worst on your GPA and Financial Aid. Take your current grade and retake the course some other semester.",
            "score": 7,
            "author": "abzu_the_noodle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not planning to drop ain't classes for this semester. I just want to know for next semesters.",
                    "score": 6,
                    "author": "Separate_Ad7674",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How many credits are you currently enrolled in?",
                            "score": 2,
                            "author": "abzu_the_noodle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For spring 11 and for summer 12",
                                    "score": 2,
                                    "author": "Separate_Ad7674",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "12 in the summer? You will be in my prayers.",
                                            "score": 5,
                                            "author": "monochroma_1487",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Why? 😭",
                                                    "score": 2,
                                                    "author": "Separate_Ad7674",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The summer session is shorter  so usually a lot of work is crammed into like 4 weeks",
                                                            "score": 5,
                                                            "author": "Only_Albatross_4481",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It's not that bad, depending on the class. I took physics, speech and macroeconomics and it was a breeze, not much work at all. Cost accounting on the other hand.. Not so much. 😂",
                                                                    "score": 5,
                                                                    "author": "flashcapulet"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How many classes would you recommend for summer?",
                                                                    "score": 2,
                                                                    "author": "Separate_Ad7674",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Honestly that depends on your study and multitasking habits. I tend to not take difficult classes in the summer like if I know the class will be challenging and I know my limits I’ll take it during the regular semester and take something else in the summer. I’ve never taken more than 6 credits",
                                                                            "score": 3,
                                                                            "author": "Only_Albatross_4481"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "At least, 1-2 course(s) in the summer. Usually 3-8 credits, depending on the course. Anything more than that can be difficult for most.",
                                                                            "score": 3,
                                                                            "author": "abzu_the_noodle"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lol i didn’t even know anything past 9 credits was allowed.",
                                                    "score": 2,
                                                    "author": "Only_Albatross_4481",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’d be taking math 195, introduction to art, English composition and other one that I don't remember right now.",
                                                            "score": 2,
                                                            "author": "Separate_Ad7674",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Those are solid summer choices.",
                                                                    "score": 4,
                                                                    "author": "flashcapulet"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Okay these are mostly intro classes so that’s sounds doable for sure!",
                                                                    "score": 2,
                                                                    "author": "Only_Albatross_4481"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check the calendar. Usually in the beginning of the semester you have a few days to get a WD and then at the end of the semester if you think you aren't going to pass it's the same day as the last day of classes. You get a regular W then.",
            "score": 3,
            "author": "flashcapulet",
            "replies": [
                {
                    "level": 1,
                    "comment": "This spring was my first semester on college so I don't know what “WD” is😂😭 can you please tell me",
                    "score": 2,
                    "author": "Separate_Ad7674",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "so i was partially wrong. you have 3 weeks to drop a class, in the first week you don't get a grade or anything, i don't even think it shows on the transcript. in the 2 weeks after you get a WD. after that, up until the last day of classes you get a W. none of them affect your GPA but the WD may affect your financial aid. if you have too many W/WDs over the course of the year it may affect your academic standing which may affect your financial aid.",
                            "score": 3,
                            "author": "flashcapulet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!!!",
                                    "score": 2,
                                    "author": "Separate_Ad7674"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}