{
    "id": "140dunq",
    "score": 1,
    "title": "It’s been 16 hours yet I have not received my CUNYfirst login details, any idea what’s happening?",
    "author": "shitakemushroom8",
    "date": 1685886990.0,
    "url": "https://www.reddit.com/r/CUNY/comments/140dunq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I paid the application fee but it says it’s still processing and not submitted",
    "comments": [
        {
            "level": 0,
            "comment": "You need to write to the administration at the CUNYFirst when I found out that I put don't know the username and password that I how I got my information but it's really your first and last with your last two numbers of your student ID.",
            "score": 3,
            "author": "Morena8582",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did not get the email with the student id, it says not assigned, that’s what I am waiting for",
                    "score": 2,
                    "author": "shitakemushroom8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you actually hit submit once you paid the fee? Paying the fee is not the same as submitting",
            "score": 3,
            "author": "Chocolatepooh_25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I am sure I did, I double checked it as well",
                    "score": 2,
                    "author": "shitakemushroom8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmmm and did you get the email confirmation that it submitted ?",
                            "score": 2,
                            "author": "Chocolatepooh_25",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, it still says processing even after I clicked submit",
                                    "score": 2,
                                    "author": "shitakemushroom8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Can you walk me through how you submitted your app ? I’m trying to see if something was missed possibly or it’s a technical error?",
                                            "score": 2,
                                            "author": "Chocolatepooh_25",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So I paid the fee first then I submitted it but it’s not reflecting on the application view page that I did",
                                                    "score": 2,
                                                    "author": "shitakemushroom8",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I also emailed the administration but I doubt they will get back to me anytime soon since it’s a Sunday",
                                                            "score": 2,
                                                            "author": "shitakemushroom8",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Try going into your app and submitting it again",
                                                                    "score": 1,
                                                                    "author": "Chocolatepooh_25",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The system is horrid and doesn’t always process",
                                                                            "score": 1,
                                                                            "author": "Chocolatepooh_25",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "They should update it fr",
                                                                                    "score": 1,
                                                                                    "author": "shitakemushroom8",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The button is grey now so it’s unclickable  …",
                                                                            "score": 1,
                                                                            "author": "shitakemushroom8"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you check all of your emails properly? If you still didn’t find one, email the admissions office.",
            "score": 1,
            "author": "Farvardin_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I have multiple times, even the spam and bin",
                    "score": 1,
                    "author": "shitakemushroom8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe it went to your spam folder? Or something happened with your network connection and it needs to be resubmitted?",
            "score": 1,
            "author": "_bitemeyoudamnmoose",
            "replies": [
                {
                    "level": 1,
                    "comment": "I checked the spam folder multiple times, unfortunately it isn’t there, I doubt there was a network issue or else there would have been a pop up, how do I resubmit? The submit button is grey which should, in normal cases, imply that it’s submitted, I honestly don’t know what to do except wait, it’s extra nerve wrecking cause I paid the application fee already, hopefully I get it by tmr",
                    "score": 1,
                    "author": "shitakemushroom8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d honestly wait until Monday and see if the problem fixes itself. It could be that since no one is in the office it wasn’t exactly “received.” If Monday comes and nothing happens, maybe call admissions.",
                            "score": 2,
                            "author": "_bitemeyoudamnmoose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s the plan, thank you for your advice, I appreciate it!",
                                    "score": 1,
                                    "author": "shitakemushroom8"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}