{
    "id": "142ppmi",
    "score": 5,
    "title": "ASAP help",
    "author": "Federal-Bunch3865",
    "date": 1686077446.0,
    "url": "https://www.reddit.com/r/CUNY/comments/142ppmi",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, so I have committed to bmcc and also registered for classes this fall. Can i still apply to ASAP and is it worth it ? Because my tuition and everything is coverd by financial aid and TAP. Please let me know that if i can still apply and is it worth applying and will it have any affect on my financial aid? \nAnother thing I registered for classes last Friday but still didn't receive any email for my cuny email account and my student ID ? How long does it take to get cuny email and student ID? \nThanks for your help!!",
    "comments": [
        {
            "level": 0,
            "comment": "Won't effect financial aid. If you somehow lose financial aid they'll pay your tuition so you're covered regardless. You can still apply for it i applied and got in literally a week before classes started. It's absolutely worth it. Textbook stipend, free metrocard, bunch of job/life/academic events and other free stuff. There's no downside to joining. As for the other thing, you mean the bmcc email? Give it some time they SHOULD tell you soon since you've already enrolled in a class.",
            "score": 5,
            "author": "flashcapulet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude a quick Google, try this link to get your email https://repass.bmcc.cuny.edu/UI#aw/PasswordResetCenter",
                    "score": 2,
                    "author": "flashcapulet",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks !",
                            "score": 1,
                            "author": "Federal-Bunch3865"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks bro. Much appreciated 👍",
                    "score": 1,
                    "author": "Federal-Bunch3865"
                },
                {
                    "level": 1,
                    "comment": "One small question do i also get another advisor ?",
                    "score": 1,
                    "author": "Federal-Bunch3865",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yea you get a personal ASAP advisor. so whoever initially advised you won't be the same person you keep in contact with, it'll be someone from ASAP and they will be with you until you graduate.",
                            "score": 2,
                            "author": "flashcapulet",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay. That's good  thank you very much.",
                                    "score": 2,
                                    "author": "Federal-Bunch3865"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ASAP is *wonderful*!  If you have a chance to be in ASAP, grab it!!",
            "score": 3,
            "author": "lexalogue",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks !",
                    "score": 1,
                    "author": "Federal-Bunch3865"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should definitely join asap you still have time but I would get in contact with someone as soon as possible. You get early registration, metrocard , money for books",
            "score": 3,
            "author": "Main_List8268",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you I'll do that asap",
                    "score": 1,
                    "author": "Federal-Bunch3865"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YESS i’m an asap student and i love my advisor &amp; the extra financial aid it gives me.. also free metrocard?? i’m not paying 2.75 everyday lol so yes definitely go for it",
            "score": 3,
            "author": "ali1124",
            "replies": [
                {
                    "level": 1,
                    "comment": "As of this moment I talked with them and they said i am eligible and i can apply. I am going through my application now.",
                    "score": 2,
                    "author": "Federal-Bunch3865"
                },
                {
                    "level": 1,
                    "comment": "Quick question do i get to make my schedule or pick my classes and which teacher i wanna take or they just give it to you ?",
                    "score": 1,
                    "author": "Federal-Bunch3865",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should speak to the ASAP advisor. They’ll set you up appropriately for courses that will set you up to succeed.",
                            "score": 2,
                            "author": "effdotemm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks",
                                    "score": 1,
                                    "author": "Federal-Bunch3865"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re still eligible for ASAP even if you’ve already registered for the fall. Get in contact with the program and they’ll advise you accordingly. If you’re accepted, you’ll gain access to a dedicated advisor through graduation. Receive financial supports, such as MetroCards and textbooks. If you end up having a gap in your tuition and fees down the line, the program covers the difference and will support you with winter and summer tuition coverage, to ensure that you graduate within 2-3 years. Can also assist you with transferring to senior colleges once you’ve earned your degree.",
            "score": 2,
            "author": "effdotemm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. Should i just do the application or should I talk with them first?",
                    "score": 1,
                    "author": "Federal-Bunch3865",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Talk to the program first. They’ll walk you through.",
                            "score": 2,
                            "author": "effdotemm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay thank you.",
                                    "score": 1,
                                    "author": "Federal-Bunch3865"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As much as I hate the group meetings with ASAP .. the advisors been saving my ass and helping me! It’s worth it",
            "score": 2,
            "author": "SKY-911-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Quick question do i get to make my schedule or pick my classes and which teacher i wanna take or they just give it to you ?",
                    "score": 2,
                    "author": "Federal-Bunch3865",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The advisor will make it for you but you can talk to them and let them know which classes you wanna take and don’t wanna take right away and they will do their best to make you one.",
                            "score": 2,
                            "author": "SKY-911-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " much help my last advisor didn't even care what i said",
                                    "score": 1,
                                    "author": "Federal-Bunch3865"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}