{
    "id": "1497awd",
    "score": 3,
    "title": "F Retake Policy",
    "author": "Spiritual_Tax_9056",
    "date": 1686747689.0,
    "url": "https://www.reddit.com/r/CUNY/comments/1497awd",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi.  I just finished up my freshman year and I got a F in one of my classes.  I went through the approval  process to take the course at a college closer to me (I am out of state) and it was approved.  I passed the class and it transferred in, but the \"F\" is still factored into my GPA since it is CUNY's policy that the only way to have the F removed from the GPA calculation is to take the class at the same \"Institution\" you received the F from.  Is there any way to appeal this policy?  I feel there is no logic at all around why it needs to be retaken at the same college you got the F in.  Since I was approved to take the course from another college, and passed it, who cares that it was not through the same college?  Any help in how I could have this looked at would be appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Even though it’s dumb in theory, I honestly feel like this makes sense since your GPA resets when you attend another college. I’d speak to the registrar, I’m sorry you spent 8 months for this one class to just have this runaround.",
            "score": 4,
            "author": "notplayingfair",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks.   Actually I am full time at ccny, but taking classes at another college in the summer, so my GPA does not reset.  I am out of state, so the cost for me to attend a CUNY school is triple what it would be if I was in state..",
                    "score": 1,
                    "author": "Spiritual_Tax_9056"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which CUNY are you attending?",
            "score": 2,
            "author": "andrea_dee_",
            "replies": [
                {
                    "level": 1,
                    "comment": "CCNY.",
                    "score": 2,
                    "author": "Spiritual_Tax_9056",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can try to petition through the Committee on Course and Standing for the school to accept the class as an F grade replacement. I’m not familiar with CCNY so I don’t know the contact info, but looking there may be a good place to start.",
                            "score": 1,
                            "author": "andrea_dee_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks.",
                                    "score": 1,
                                    "author": "Spiritual_Tax_9056"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have the same situation but I’m transferring from cuny to a suny",
            "score": 1,
            "author": "Far_Mushroom8999",
            "replies": [
                {
                    "level": 1,
                    "comment": "My brother went to a SUNY school and had a great experience.  You will enjoy it I am sure.",
                    "score": 1,
                    "author": "Spiritual_Tax_9056"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it's a CUNY wide policy i don't see how it can be changed. That sucks.",
            "score": 1,
            "author": "flashcapulet"
        }
    ]
}