{
    "id": "gyiw7k",
    "score": 93,
    "title": "An Open Letter to CUNY Admins",
    "author": "tonyg31897",
    "date": 1591558927.0,
    "url": "https://www.reddit.com/r/CUNY/comments/gyiw7k",
    "media_urls": [],
    "other_urls": [],
    "postText": "To all CUNY Admins, Chancellor, Presidents. The last few months have been difficult to say the least; transitioning to online classes, the stress of living in a pandemic, living in close quarters with family non-stop for the last three months. I can say with utmost certainty many students want to begin to resume life, even if it isn’t even close to what we used to consider normal. But that isn’t going to happen if you continue to remain silent.\n\nEvery week or so, the COVID page on CUNY.edu updates to add minor details regarding CR/NCR policies, wishing the graduates well and so on. However one important detail has been left out - some kind of plan of how you plan on reopening. We haven’t heard a word. There have been rumors of memos flying around, articles about how adjuncts have been laid off and even the DOE Chancellor for NY public schools saying it’s a 50/50 shot of them going back to in person in any capacity.  But we have yet to hear anything directly from a CUNY Admin. I understand that it’s not entirely your call; our “wonderful” Governor probably hasn’t thought about it yet. I get it. But what isn’t ok is the complete silence as you begin to take our money for the fall semester. \n\nI think it’s come across all our minds that in-person just isn’t possible within the CUNY ecosystem. We are too crowded, too few teachers and too little space. It’s understandable in a public university. Not only that, but you are unable to hire enough cleaning staff to keep surfaces disinfected. We get these issues; but these are things that should be transparent to every student, faculty and staff members. We’re tired of staying in the dark.\n\nI’m asking for some kind of transparency; something that has been completely lacking throughout this entire pandemic. Tell us what to expect, or at the very least tell us when we can expect an announcement.     \n\nMy hope is that more students will add ideas below, but I can only ask that if classes should be moved online, that teachers adopt a format designed to be online rather than just pretend we are in person. This was the major issues with transitioning online- teachers expected us to keep up with the same level of work without taking into consideration many students are cramped into a small apartment with anywhere from 3-5, or possibly even more family members. This was a major issue for me, trying to concentrate using a small table to balance my laptop and textbook. It didn’t work. So my hope that all of this time spent not talking to us was used to train what remaining faculty is left to teach online. \n\nTo my fellow students, I hope this post is used to offer more suggestions and voice more concerns to CUNY admins should they find it.",
    "comments": [
        {
            "level": 0,
            "comment": "Can I ask you a question? Do you think it would’ve been better for you to have an asynchronous class (not live, but a recorded class) that you could access anytime? What do you think can be done to improve online classes?",
            "score": 11,
            "author": "depressed_aesthetic",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve taken online courses in previous semesters, and I’m taking a synchronous physics 110 class online over the semester. The summer class is done well, where the professor lectures and quizzes are done instead of exams. You can’t do big exams with an online class, I just don’t think they are done well.\n\nWith asynchronous they let you do things on your own time, which is good if you have decent time management skills. \n\nSo long story short, I’d say both should be offered if possible so someone can choose the best way they learn, however asynchronous learning would be better if recorded lectures and assignments aren’t ridiculous",
                    "score": 8,
                    "author": "tonyg31897",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for your thorough reply.",
                            "score": 2,
                            "author": "depressed_aesthetic"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think this would be a solution that would bridge the gap. ridiculous I only have one section available for two separate classes, but cant take them because they are scheduled at the same time ONLINE.",
                    "score": 2,
                    "author": "mikerobinsonsho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s so ridiculous. Are the classes asynchronous or will there be live sessions?",
                            "score": 1,
                            "author": "depressed_aesthetic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nobody knows yet. Last semester, professors were trying as much as possible to keep the status quo, so everything was synchronous and modeled after a traditional class.",
                                    "score": 1,
                                    "author": "mikerobinsonsho"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for posting. As a CUNY student, I also think its disingenuous to take our money, but not tell us anything about the fall semester. Another massive issue I've run into is that the urban studies courses I need I can't get for fall because they've fired so many professors that there is only 1 section for each, which are now all full. So, my options are to take a semester off or take a bigger leap and switch my major. It sounds crazy, but if this is at all predictive of what they'll be doing to the urban studies department, why would I stick around to find out? Why would I waste my money? They must realize what they're doing will only force people into a few select majors(the more popular ones like STEM majors clearly get more funding to begin with) and alienate everyone else, right?",
            "score": 31,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Can out of state tuition please be lowered during these times. At other schools out of state tuition is = instate tuition when classes are online.",
            "score": 6,
            "author": "AKInvestments"
        },
        {
            "level": 0,
            "comment": "Is there anywhere we can post this where CUNY admin will respond?",
            "score": 1,
            "author": "mikerobinsonsho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably not. I mean the issue is even if admins see it, it’s not up to them at all. Cuomo hasn’t issues any directives that would actually let them make a decision. It sucks, but it’s unfortunately the sucky part of being a public university. I mean to be fair, I think private universities have their heads up their asses if they think in person classes/forming is gonna happen in nyc",
                    "score": 2,
                    "author": "tonyg31897"
                }
            ]
        }
    ]
}