{
    "id": "jvfsjy",
    "score": 47,
    "title": "Anyone lowkey happy about going to CUNY during the pandemic?",
    "author": "Royal-Raccoon9151",
    "date": 1605562684.0,
    "url": "https://www.reddit.com/r/CUNY/comments/jvfsjy",
    "media_urls": [],
    "other_urls": [],
    "postText": "I had the choice to go to other schools, but chose CUNY because of money. I planned on going to grad school and wanted to save as much as possible. I was pretty bitter and jealous that all my friends had real college experience: Greek life, parties and dorming together, and professors who were famous experts.     \n       \nWith the pandemic, none of that is happening. 3 semesters (maybe 4) was completely wasted. That's two years of money actually saved with no downside and no education quality change. It's mean but I feel petty about it. That's not to say online school isn't stressful and lonely, but it was pretty bad before already.",
    "comments": [
        {
            "level": 0,
            "comment": "People who are spending $60,000 on tuition for zoom university: 🤡",
            "score": 80,
            "author": "tbear2019",
            "replies": [
                {
                    "level": 1,
                    "comment": "My friend went to Colombia and she’s STILL paying off her loans nearly a decade later,  and I think she only JUST hit the halfway point. \n\nI’m sure the quality of her education was better, but she ended up becoming a teacher in the end and she doesn’t make nearly enough to justify the cost of her tuition.",
                    "score": 7,
                    "author": "reinakun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thats why I left after one semester. 😂 i am at CCNY getting the same education",
                            "score": 4,
                            "author": "MaverickMil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how is ccny for business and economics, imm 99% into baruch but ccny was my choice before that",
                                    "score": 3,
                                    "author": "krimsongreen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You gotta make lemonade no matter where you go",
                                            "score": 2,
                                            "author": "MaverickMil"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Forreal 😂🤣😂",
                    "score": 1,
                    "author": "MaverickMil"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am happy that I didn't pick a more expensive school before this happened. My online courses have been pretty decent. The only thing I do not like right now is the excessive cheating.",
            "score": 6,
            "author": "lovescheesecake"
        },
        {
            "level": 0,
            "comment": "No. You get what you pay for tbh. \n\nCuny may be cheaper but you get what you pay for. People who pay more tuition have more resources. I’m sitting in my statistics class where my professor literally teaches in the dark.",
            "score": 23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "HEAVY ON the you get what you pay for",
                    "score": 17,
                    "author": "mehedi7218"
                },
                {
                    "level": 1,
                    "comment": "I agree, I'm taking 3 classes and only one class even has a lecture and it's optional. The other class has recordings on canvas and my chem class has no recordings or lectures. They want me to teach myself the whole course.",
                    "score": 7,
                    "author": "ibeatyou",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly online courses here is not even worth it for me",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not worth it. I don't go to CUNY but I go to community college of Philadelphia in PA and classes are awful here also. I learned so little this semester it's ridiculous.",
                                    "score": 7,
                                    "author": "ibeatyou",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly. \n\nI can’t believe people prefer online courses. Online courses are good for the common core classes or the prerequisite classes but what about the courses that you actually need for your career? I know for sure I don’t want to go into my career clueless. I’ll make a fool out of myself",
                                            "score": 6,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’ve been to private schools before CUNY where this is true, though, and I was paying for it...",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends on which CUNY you go to. I go to John Jay and it has the greek stuff, parties, dorms, and somewhat famous professors (Some were local leaders or politicians). Seemed like there was always an event going on in the main hub. I wasn't really interested in that stuff but it was there for people that wanted it. I did, however, take some of the food they had leftover after the event. There were also a lot of educational opportunities and job opportunities that they offered. I'm currently apart of ACE (A program in John Jay) which has helped me a lot such as getting free textbooks. I also recently joined CUNY Cultural Corp and I'm working with some amazing people. I was planning on joining a club but covid happened. I am hopeful that things will return back to normal in Fall 2021 though.",
            "score": 4,
            "author": "BuyingGF_1Upvote"
        },
        {
            "level": 0,
            "comment": "I mean as someone currently in community college I'm sure there are educational differences between top-tier and Ivy Leagues colleges and state schools such as CUNY and community colleges. If you go to a top-tier university, there's still going to be famous professors that you read about in your textbooks who are teaching you and making the curriculum for your class. Some of the professors in top-tier universities created or discovered the topics you are studying in your classes.",
            "score": 6,
            "author": "ibeatyou",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I don’t go to a CUNY, but one of my friend does. He showed me his physics problem and it was a joke.",
                    "score": -2,
                    "author": "13141314Dankeee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I transferred out of Columbia to CCNY and it was the same fuckin material. You’re buying a name.",
                            "score": 19,
                            "author": "MaverickMil",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Go ahead and put Columbia University on your resume for the price tag of $300k. \n\nI will put CUNY for the price tag of $0. \n\nBtw, i got hired as a swe apprentice and now a employee at well known tech company. \n\nFuck Columbia. I am making lemonade bitches!",
                                            "score": 3,
                                            "author": "MaverickMil",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, the engineering department is a major clusterfuck and everything you been told. I am a CS-Math major. \n\nIf you want an engineering degree check out CSI. Not as bad as CCNY. But no brand name. Many students are recruited from Boeing, Con Edison, etc.. the department is full of Columbia professors.",
                                                            "score": 3,
                                                            "author": "MaverickMil",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Stonybrook is great. Definitely better CpE program",
                                                                            "score": 1,
                                                                            "author": "MaverickMil"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hi, I transfered to CCNY this Fall as a Computer Engineering student. Let me tell you it is a clusterfuck. First of all, you need 130 credits to graduate not 120. I am taking the max amount of credits which is 18. Some of the professors actually care, but other don't even teach shit. Part of it is because some of the professors are old and they're not very tech savy... But also keep in mind, I have not even step a foot into the school as everything has been online. This is my experience as a Computer Engineering student from Zoom University sponsored by CCNY.",
                                                            "score": 1,
                                                            "author": "car0-"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Isn't Columbia really generous with financial aid if your family is middle class? It's a rich school and no one should be out with 300k with student loans unless your family is super rich and can afford it.",
                                                    "score": 1,
                                                    "author": "ibeatyou",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Generous?😂\n\nThey have need blind admission but that does not equate to full rides or financial assistance from the institution. There is no financial assistance for the school of general studies. They are somewhat generous for the engineering and A&amp;S departments. Even then, most non-wealthy students are stuck in some level of high debt.",
                                                            "score": 1,
                                                            "author": "MaverickMil",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Idk why I just thought the Ivy leagues were super rich and gave their students generous financial aid/scholarships. I know that other Ivies if your family makes like under $60k you get your tuition and board paid for. I guess that's not the case at Columbia",
                                                                    "score": 1,
                                                                    "author": "ibeatyou"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Over a year later, do you still feel the same?",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Which CUNY does he attend?",
                            "score": 5,
                            "author": "internally",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Brooklyn College",
                                    "score": 1,
                                    "author": "13141314Dankeee"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is that one problem reflective of the entire system? I’m sure there are joke classes but come on",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cringe.",
            "score": 1,
            "author": "Resident-Variety"
        },
        {
            "level": 0,
            "comment": "Not happy at all due to losing my federal pell.",
            "score": 1,
            "author": "NemuNemuChan"
        },
        {
            "level": 0,
            "comment": "Ha! i went to Buffalo State and was paying to dorm and everything. Def had fun, but i transferred to John Jay and came back to NYC for fall 2019 onward and BOY AM I HAPPY LMAO",
            "score": 1,
            "author": "surfsolar666"
        },
        {
            "level": 0,
            "comment": "You have a point there with the cost. The plus with the online classes is not having to talk to a soul.",
            "score": 1,
            "author": "TheWhiteCrowParade"
        }
    ]
}