{
    "id": "r0lcoq",
    "score": 44,
    "title": "Updates on New Relief Funds for Students",
    "author": "cunyedu",
    "date": 1637696460.0,
    "url": "https://www.reddit.com/r/CUNY/comments/r0lcoq",
    "media_urls": [
        "https://www.reddit.com/r/CUNY/comments/r0lcoq/updates_on_new_relief_funds_for_students/"
    ],
    "other_urls": [
        "https://www.cuny.edu/coronavirus/university-updates/you-are-receiving-a-financial-aid-grant/)).",
        "https://www.cuny.edu/wp-content/uploads/sites/4/media-assets/Student-Revocation-of-Consent-Letter-template-2.pdf)",
        "https://www.cuny.edu/about/administration/offices/budget-and-finance/services/treasury-services/student-financials/bursar-contacts/).",
        "https://www.cuny.edu/studentrefunds)."
    ],
    "postText": "CUNY is sending out the third wave of federal emergency relief funds to students (letter [here](https://www.cuny.edu/coronavirus/university-updates/you-are-receiving-a-financial-aid-grant/)).\n\nStudents will receive the funds automatically and **do not** need to take action in CUNYfirst in order to receive them. You will receive the funds through direct deposit (if you have set it up) or via a mailed check.\n\nIf you want the funds to apply directly to your tuition balance instead, please check CUNYfirst &gt; Student Center &gt; To Do List to complete the permission form labelled **Fed ARPA Student Grant Fall**.\n\n**Students who have signed the form by mistake** and want to receive the funds by direct deposit/check must fill out [this form](https://www.cuny.edu/wp-content/uploads/sites/4/media-assets/Student-Revocation-of-Consent-Letter-template-2.pdf) and send it to [their college's Bursar Office](https://www.cuny.edu/about/administration/offices/budget-and-finance/services/treasury-services/student-financials/bursar-contacts/).\n\nIf you have not signed up for direct deposit, you can do so here: [cuny.edu/studentrefunds](https://www.cuny.edu/studentrefunds). If you are receiving a check, double-check your mailing address on CUNYfirst in the Student Center.",
    "comments": [
        {
            "level": 0,
            "comment": "Does anybody know when these checks are supposed to clear for direct deposit? Still haven't gotten mine.",
            "score": 5,
            "author": "OnlySlightlyDeranged"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you have no outstanding debts from Fall or Summer 2021, the money will be issued directly to you via direct deposit (if you've set it up) or as a check, even if you signed the form.",
                    "score": 4,
                    "author": "cunyedu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mine posted as a refund since Wednesday but I still haven’t received anything . Are they delayed ?",
            "score": 3,
            "author": "Due-Driver-8087"
        },
        {
            "level": 0,
            "comment": "So, this grant won’t pay off my “future due” balance, right?",
            "score": 2,
            "author": "jeffboxxx",
            "replies": [
                {
                    "level": 1,
                    "comment": "The grant should not pay off a future due balance.\n\nAre you asking because you signed the form in CUNYfirst but actually want to directly receive the money? You should be safe if you have no outstanding charges for the \\*Fall\\*, but you can always fill out the form linked in the OP and send to the bursar as an extra precaution.\n\nReach out to your campus bursar if this needs more clarification.",
                    "score": 3,
                    "author": "cunyedu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately this is incorrect. The grant has seemed to apply to my future balance on CUNY first even though I currently owe 0.00",
                            "score": 4,
                            "author": "TisNoot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i also signed the form but it didn't apply to my future due. it says refund but i still haven't received the deposit.",
                                    "score": 2,
                                    "author": "jenastro",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same here",
                                            "score": 1,
                                            "author": "Meechspeachesx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "it seems that everyone's payments are delayed.",
                                                    "score": 1,
                                                    "author": "jenastro"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wasn’t the form to allow for it to pay off previous OR balances? Spring dues aren’t a future due for me, but a due now. Wouldn’t the ARP grant be allocated there IF I signed that waiver? It’s how it worked each time before.",
                            "score": 1,
                            "author": "gogogadgetgen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn't have any outstanding balance for fall but my ARPA grant still applied to my spring 2022's future balance. How can I get it direct deposit ??",
            "score": 2,
            "author": "herafatima_"
        },
        {
            "level": 0,
            "comment": "Do i have to send this form by mail ?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "As u/UniverseSucks2020 said, you can email the form to your campus Bursar's office. Contact info can be found [here](https://www.cuny.edu/about/administration/offices/budget-and-finance/services/treasury-services/student-financials/bursar-contacts/).",
                    "score": 1,
                    "author": "cunyedu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I signed the form but I haven’t signed up for classes, does that mean I still get the grant refunded?",
            "score": 1,
            "author": "bitchinghours",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you referring to Spring 2022 classes? You will still receive the grant, and it will be refunded if you have a $0 balance on CUNYfirst for the Summer 2021 and Fall 2021 semesters.\n\nSee the FAQ [here](https://www.cuny.edu/financial-aid/federal-and-state-grants/federal-grants/arp-faqs/).",
                    "score": 1,
                    "author": "cunyedu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I was talking about the grant! Thank you for your help, now I realized I sent a revocation letter for no reason",
                            "score": 1,
                            "author": "bitchinghours",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sure thing! And it's better to be safe than sorry, submitting the letter will still mean you receive the funds via direct deposit/check, so you should be all set.",
                                    "score": 1,
                                    "author": "cunyedu"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you accepted the award and have no outstanding balance from the Fall/Summer semesters, you will still receive a check (or direct deposit, if you've set it up).",
                    "score": 1,
                    "author": "cunyedu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're welcome! And yes, some people \"accidentally\" signed it.\n\nTo clarify, to receive the refund as direct deposit, you did not \\*need\\* to sign the form on CUNYfirst. The form on CUNYfirst is only if you want the grant to be directly applied to outstanding tuition &amp; fees. But if you sign the form and don't owe tuition, you get the money regardless.",
                                    "score": 1,
                                    "author": "cunyedu"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there a deadline on when to submit the revocation letter? I just sent it in but it’s saying the payment has been applied to my account already",
            "score": 1,
            "author": "Traditional-Two-3552"
        },
        {
            "level": 0,
            "comment": "So what if the grant already paid off the small remainder of my spring 2022 balance? Would the remaining money be sent to me through direct deposit?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Does anyone got their money?",
            "score": 1,
            "author": "ApplicationOne9225",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also haven’t gotten any money yet. Is there a reason why?",
                    "score": 1,
                    "author": "gabe_0707",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Being honest, i don’t know, we would just have to wait until Monday to see🤷🏽‍♀️",
                            "score": 1,
                            "author": "ApplicationOne9225"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I accidentally signed the form but it’s been under refund since 12/1 and my fall semester is paid off already just wanted to make I will receive it in the bank I haven’t gotten anything in the bank yet",
            "score": 1,
            "author": "Early_Importance_632",
            "replies": [
                {
                    "level": 1,
                    "comment": "the last day to sign the revoke form was on 11/29 too :(",
                    "score": 1,
                    "author": "Llamika"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm confused cause I had no past or future dues and signed the form, I didn't reverse it since it was supposed to still refunded. However in my cuny first it is listed under payment still and has seemingly applied to fees I already payed",
            "score": 1,
            "author": "Noshib",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it went to your spring term. Several students at hunter signed the form (despite having no past dues) but it went to their spring term tuition. \n\nAre you registered for spring term? You should have future due if you registered for spring term classes. \n\nIf not, speak to bursar.",
                    "score": 1,
                    "author": "rosieareposie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am but I had payed my tuition before the grant was dispersed, when I look at what fees it went towards it was all fall 2021",
                            "score": 1,
                            "author": "Noshib",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "speak to bursar about this issue. :/ they know best",
                                    "score": 1,
                                    "author": "rosieareposie"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So were we not suppose to sign the document? Because I already had nothing due but I still haven’t received the grant yet and when I check under financial aid it says its for fall 2021 still. So I’m really confused.",
            "score": 1,
            "author": "gabe_0707"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No , but if you don’t pay at the end of the semester your account will be on hold and you won’t be able to register for courses",
                    "score": 1,
                    "author": "Maniiijose"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is great. It is too bad that CUNY does not care about professors who are afraid to go to class after being called into the public safety office because the student who was just throwing a temper tantrum in class has possibly made violent threats against such professors! CUNY needs to apologize immediately for being so terrible! CUNY degrees are absolute trash! IF YOU HAVE A CUNY DEGREE, YOU NEED TO BURN IT IMMEDIATELY BECAUSE IT IS FUCKING WORTHLESS!",
            "score": 0,
            "author": "jvanname40320",
            "replies": [
                {
                    "level": 1,
                    "comment": "💀",
                    "score": 3,
                    "author": "stick_it_in_your_mom"
                }
            ]
        }
    ]
}