{
    "id": "rt097i",
    "score": 59,
    "title": "Thoughts on CUNY Requirement of Booster shots starting 1/15/22",
    "author": "Ok-Calligrapher-3503",
    "date": 1640975741.0,
    "url": "https://www.reddit.com/r/CUNY/comments/rt097i",
    "media_urls": [],
    "other_urls": [],
    "postText": "I believe that CUNY’s lack of regard for students is really telling m. Yes booster shots will help but the whole plan and goal of having a 70% in person classes when we are hitting new Covid Case milestones is ridiculous. Most if not all private schools in the city are adapting and changing their courses online but leave it to CUNY to put us at risk of exposure.",
    "comments": [
        {
            "level": 0,
            "comment": "I heard that everyone also have to submit a negative test in order to enter campus. Is this going to be a daily thing or weekly thing? Or just for the first day of classes?",
            "score": 14,
            "author": "rosieareposie"
        },
        {
            "level": 0,
            "comment": "I'm staff at cuny and they told us we have to come back in person or find a new job. They don't give af about anyone",
            "score": 43,
            "author": "Revolutionary-Ride76",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really? I thpught they would be more accommodating...thats so messed up wow.",
                    "score": 15,
                    "author": "Theprofessionalist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yea they literally are horrible",
                            "score": 11,
                            "author": "Revolutionary-Ride76"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not an email but it was a convo with the Dean on Zoom",
                            "score": 4,
                            "author": "Revolutionary-Ride76",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Said they had no choice it was a directive from the Chancellor",
                                    "score": 4,
                                    "author": "Revolutionary-Ride76"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can’t the students of CUNY organize a form of protest? This is getting ridiculous and I’m pretty sure everyone has a limit, we just can’t keep following in line, when will it stop?",
            "score": 34,
            "author": "CancelTeenTitansGO",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what I would like to happen. Why are they targeting college students with the mandates. The first two shots, that’s fine but the booster is tedious.",
                    "score": 2,
                    "author": "queenxine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just paid my tuition, but now I’m deciding whether or not to drop this semester. What they’re doing is very unethical towards our health and morals. I hope karma gets them",
                            "score": 1,
                            "author": "johnnydoodoo_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Create a petition and lets get it started. I'm fed up with this bullshit. There'll be 3 new fucking shots every single year and it won't ever end.",
                    "score": 2,
                    "author": "Own_Aside2045",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let’s start this petition.",
                            "score": 1,
                            "author": "Accurate_Concept_869"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so annoying i have 1 SEMESTER left I got the shit that they asked. Requiring the booster is just ridiculous at this point. EVERYONE damn there was vaccinated and it didn't stop the \"spread\" so WTF else do they think the booster will do?",
            "score": 27,
            "author": "ajaxxg",
            "replies": [
                {
                    "level": 1,
                    "comment": "To make the pharmaceutical industry and interest group richer and richer",
                    "score": 18,
                    "author": "Korben02"
                },
                {
                    "level": 1,
                    "comment": "it is incredible to me what these people say... check out this letter that someone started, crying and demanding to get online classes. [https://docs.google.com/document/d/1phiinWcSo15nIalDTFWne1ewBXorTIKUQMVg3YbvNRM/mobilebasi](https://docs.google.com/document/d/1phiinWcSo15nIalDTFWne1ewBXorTIKUQMVg3YbvNRM/mobilebasic)\n\nOn the first paragraph, \"During a pandemic that is still raging on with some of the worst positive rates we have seen since it began two years ago, you take the choice away from your students.\"\n\nlmao 🤦🏽‍♂️",
                    "score": 3,
                    "author": "Leba-0495"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah booster is cool and all, but it’s not physically possible to get every single CUNY student a booster by 01/15/22. And the fact that they want 70% of classes back in person with little to no social distancing, the booster isn’t gonna do much",
            "score": 15,
            "author": "Schmebulock_Crybaby",
            "replies": [
                {
                    "level": 1,
                    "comment": "The booster is the lazy approach. They are still packing students like sardines in auditoriums with no ventilation. While all the private colleges moved their finals online, CUNY mostly refused to do so. A friend who's double vaccinated and boosted is pretty sure caught covid during her bio final at hunter. The students begged for the exam to be moved online, but the department refused. The auditorium was packed and they even had to escort out a student who wouldn't stop coughing. My friend is ok, but she was still in bed with flu-like symptoms for a week despite the triple jab.",
                    "score": 7,
                    "author": "HomeWild830"
                },
                {
                    "level": 1,
                    "comment": "This is actually a smart comment.",
                    "score": 1,
                    "author": "Thunderjamtaco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol I’m very glad I graduated this semester, not longer have to deal with CUNY bullshit.",
            "score": 22,
            "author": "DollarPepperLemon"
        },
        {
            "level": 0,
            "comment": "I can see a lot of people don't agree with this.  Can't we form some sort of group and try to send some sort of message to the administration? Edit: anyone interested DM me, I will form a discord",
            "score": 17,
            "author": "millipedecreed",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m down to form a protest or even a discord server to communicate with each other, we are tired of this!",
                    "score": 16,
                    "author": "CancelTeenTitansGO",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "your username LMFAO",
                            "score": 7,
                            "author": "surfsolar666"
                        },
                        {
                            "level": 2,
                            "comment": "Interested in the CUNY discord server?\nhttps://discord.gg/9cxwGrh\nCheck out the sidebar for other CUNY related Discord servers!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CUNY) if you have any questions or concerns.*",
                            "score": 1,
                            "author": "AutoModerator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m with you buddy against this dumb new mandate, but I can’t help but notice that your 14 day account is kinda sus.",
                    "score": 9,
                    "author": "LampshadeThis"
                },
                {
                    "level": 1,
                    "comment": "Interested in the CUNY discord server?\nhttps://discord.gg/9cxwGrh\nCheck out the sidebar for other CUNY related Discord servers!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CUNY) if you have any questions or concerns.*",
                    "score": 1,
                    "author": "AutoModerator"
                },
                {
                    "level": 1,
                    "comment": "I’m interested",
                    "score": 1,
                    "author": "queenxine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My question is how many times do we need to get vaccinated until they're satisfied? Are we just gonna be getting boosters indefinitely? Because as beneficial as the vaccines are at increasing antibodies, the virus isn't gonna disappear. Just mutating and spreading. Unless they're planning on treating this like the flu and make it an immunization requirement. They should make that clear.",
            "score": 33,
            "author": "Quiet-Awareness",
            "replies": [
                {
                    "level": 1,
                    "comment": "We gotta get boosters until the world wide life threatening disease goes away, silly. You don’t have to go to CUNY. But we do have to get rid of Covid.",
                    "score": -7,
                    "author": "Thunderjamtaco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Read what you typed and realize how crazy you sound right now",
                            "score": 9,
                            "author": "TheFIREInvestor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You seriously don't understand sarcasm...",
                                    "score": -4,
                                    "author": "Jurgy97",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They weren’t being sarcastic if you actually scrolled through the thread",
                                            "score": 4,
                                            "author": "TheFIREInvestor"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The virus isn't gonna go away, that's one of my points. No matter how many boosters we take. I feel some skepticism is warranted when the vaccine was developed, tested, FDA-approved, and released to the public in under a year. Regardless of previous research on similar viruses. Nonetheless, I'll have to take the booster anyway to participate in regular society, and go to school. Really no choice in the matter.",
                            "score": 3,
                            "author": "Quiet-Awareness"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All in all fuck CUNY. I think we can all agree on that",
            "score": 23,
            "author": "Ok-Calligrapher-3503",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol",
                    "score": 1,
                    "author": "worktogther55"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is ridiculous! What if you’re not eligible for the booster (since you have to wait six months)…?",
            "score": 22,
            "author": "EntertainmentBig8701",
            "replies": [
                {
                    "level": 1,
                    "comment": "The mandate only requires a booster if you're eligible: that is 6 months post moderna or pfizer, 2 months post j&amp;j, and sufficient time after the last positive test",
                    "score": 5,
                    "author": "YetYetAnotherPerson"
                },
                {
                    "level": 1,
                    "comment": "Idek, I was in like september for my second dose",
                    "score": 3,
                    "author": "Theprofessionalist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so stupid. Clearly this vaccine does nothing to prevent omicron transmission. Cornell had a ridiculously high vax rate and it spread like wildfire. Additionally, omicron is milder, unless someone is immunocompromised, we are all just better off catching it, it's just a matter of time; everyone I know who has had a booster ended up catching it anyway.",
            "score": 8,
            "author": "HomeWild830"
        },
        {
            "level": 0,
            "comment": "Organize and say no.. common. I'm happy I graduated this last may. NYC has gone crazy with these mandates. They could careless if the second shot almost killed you.",
            "score": 8,
            "author": "Intelligent-Front433"
        },
        {
            "level": 0,
            "comment": "It’s crazy! A lot of people aren’t even eligible for the booster since it requires you to have the initial two shots for six months (at the least). I know lotsss of students in my major who are being forced to drop their classes now",
            "score": 17,
            "author": "EntertainmentBig8701",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you're not eligible then you don't need it. Who do you know that was forced to drop, because that sounds made up?",
                    "score": 9,
                    "author": "nygdan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You think CUNY will check your eligibility before kicking you out halfway through the semester?\n\nI just recovered from COVID. I can’t get a booster for 90 days. I’ll put money that CUNY’s shitty administrators will cause issues that I won’t have a booster",
                            "score": 17,
                            "author": "TheNotoriousA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "According to the CDC you can get a booster 10 days after you test positive or 10 days after your symptoms started [CDC](https://www.facebook.com/100064543430012/posts/284247027070076/?d=n)",
                                    "score": -7,
                                    "author": "keepingupwith_g"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All of these booster shots are fucking ridiculous and I'm not getting one. Either they add more online sections for classes or I'm dropping all of my classes.",
            "score": 9,
            "author": "QuestioningThink"
        },
        {
            "level": 0,
            "comment": "Bruh I can't! I gotta wait 6 months regardless, but I ain't taking any more shots.",
            "score": 7,
            "author": "NemuNemuChan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well get covid more then",
                    "score": -4,
                    "author": "Thunderjamtaco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Stfu",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was a well thought out argument. I apologize for my own argument, but history is not on your side.",
                                    "score": -4,
                                    "author": "Thunderjamtaco",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tf you mean by history? You a history teacher or sum shit",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Since you are so eager to go to college, go look up (google) the Spanish flu and Polio. We, as a global community fixed the problems in distinct ways. If you choose not to google, the Spanish flu killed a bunch of us. We just let it kill enough people, and hoped it wouldn’t happen again. Polio, we cured it with vaccines.\n\nEdit: or, just don’t go to CUNY.",
                                                    "score": 1,
                                                    "author": "Thunderjamtaco",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ok Mr.Wannabe. First of all, wanting to get an education, is not something bad. Unfortunately according to your dictionary, I guess being educated makes someone “eager”. I don’t know about you but we living in 2022, people are fully vaccinated and these variants of covid will continue and boosters doesn’t guarantee anyone to not catch covid again. These are just bullshit excuses for cuny to not close and people are obviously against it.",
                                                            "score": 4,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ok, I appreciate the response. Wanting an education is something great. When I first registered at BMCC I had to show proof of vax to be allowed to go to school. This was 3 years before covid.  The booster keeps you safe from new variants, such as omicron.  You can be boosted and still catch covid. But, if you are boosted and catch covid, you probably are not going to the hospital with life threatening reactions.\n\nAlso, getting an education is something great. I would just hope it leads to a smarter community.",
                                                                    "score": 2,
                                                                    "author": "Thunderjamtaco",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh really? Now we switching up words? I do not care where you applied or showed any proof. We talking about the presence not the past. Who said it doesn’t give the same symptoms? I’m fully vaccinated and still got covid, same symptoms, same pain. And? Is it making it any better? No. There’s no fucking point. \n\n\nLearn to respect other’s decisions and opinions &amp; not be childish about it by saying “get covid then”, please grow up. Thank you.",
                                                                            "score": 3,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Sorry dude, sounds like you got the long end of the stick. Had you got the short end, well you’d be dead. But it sounds like you proved my argument, vaxed folk can still fight people on the internet, unvaxed people just die.",
                                                                                    "score": 2,
                                                                                    "author": "Thunderjamtaco",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Covid booster survey! \n\nhttps://www.surveymonkey.com/r/JJD3ZV2",
            "score": 2,
            "author": "GregScott-"
        },
        {
            "level": 0,
            "comment": "Its fuckING BULLSHIT. Thats what it is, \n\n\nHOW MANY BOOSTERS ARE YA'LL GNNA TAKE? HOW MANY RANDOMIZED TESTING? FIGHT. BACK.",
            "score": 15,
            "author": "Theprofessionalist",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's too late to fight back now the whole idea of a vaccine mandate should have been seen as tyranny but too many people are sheep and went along with it out of fear. now as a consequence anytime the powers that be want to coerce students into being injected with something  there's nothing the students can effectively do about.",
                    "score": 10,
                    "author": "z-man82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s never too late to start fighting",
                            "score": 9,
                            "author": "Lipstick_on_mirror"
                        },
                        {
                            "level": 2,
                            "comment": "Yea, fuck science. I hate the govenrment, and lets all shoot guns at the sun. Idiot. Take the shot it goes away. “What’s in the shot”? He says, sipping his mountain dew.",
                            "score": -2,
                            "author": "Thunderjamtaco",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People have different values you value obedience to authority more than you do individual freedom. The science is irrelevant. How about we try letting people do whatever they want to do without setting up penalties for those who don't want to obey our masters like dogs",
                                    "score": 1,
                                    "author": "z-man82",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s not obedience to the gov, bro. Polio woulda killed us all, globally. But, YOU TOOK THAT SHOT. Didn’t ya? So, yea, obedience. Schmuck.\n\nEDIT: also, I’m not doing boosters because CUNY says to. I’m not taking my shots because the gov says to. I’m taking it so I can take my fucking mask off. “My personal freedom” bitch please.  Do actual research and you will see, it’s good to vax. Asshat",
                                            "score": -3,
                                            "author": "Thunderjamtaco",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But you can't take your mask off they implemented a mask mandate. I don't give a fuck about the research I don't care it is irrelevant to my moral argument",
                                                    "score": 7,
                                                    "author": "z-man82",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Okay, don’t go to CUNY anymore. Problem solved. Dueces.",
                                                            "score": -2,
                                                            "author": "Thunderjamtaco",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Most people who go to  CUNY are of a lower socio-economic status and can't afford to go elsewhere. This is a racist policy and that nasty (white) governor knows it.",
                                                                    "score": 6,
                                                                    "author": "HomeWild830",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "They don't care they just want people to conform and obey especially if you are black or non white and the sad part is that people who think they are smart are supporting their own subjugation",
                                                                            "score": 4,
                                                                            "author": "z-man82",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yes, obey. CUNY aint great, but it is also not Hitlter Germany. Pump yer brakes",
                                                                                    "score": -1,
                                                                                    "author": "Thunderjamtaco",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "How is free vaccines for all people racists?",
                                                                            "score": -1,
                                                                            "author": "Thunderjamtaco"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "People should do want they want period even if that means not doing what may be in their best interest. I took the shot because I wanted to but I don't agree with cuny or the state of New York trying their best to force people to get it",
                                                    "score": 2,
                                                    "author": "z-man82",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, here’s the thing Geoff. If we want to go back to life, without masks and mandates and vax cards, we gotta fix the problem. So, how do you think we should fix it? Science, engineers from CUNY, and smart people around the world have provided us all a solution. But people thought it was bad. So, how do we make the problem go away? Mandates. We hit middle school with this shit. Don’t want to take the booster? Don’t go to CUNY. Stay home, spread covid.",
                                                            "score": -1,
                                                            "author": "Thunderjamtaco",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Those are empty promises. They promised the same thing after 2 shots. Mandates will never go away once they are implemented. You don't make a virus with an animal reservoir go away using a non-sterilizing vaccine. You protect the immunocompromised and let the virus run its course through the healthy population. Eventually it will become as harmful as the strain of coronavirus that give you the common cold.",
                                                                    "score": 3,
                                                                    "author": "HomeWild830",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "This post is non sensical . Wut? I did not promise anything. Use booster, don’t get bad covid. Caveman draw on wall",
                                                                            "score": 0,
                                                                            "author": "Thunderjamtaco"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If you are so scared of covid don't leave your house. People like you are holding society hostage. It will stop some day soon one way or another. Also 99.98% survival rate LMAO",
                                                                    "score": 1,
                                                                    "author": "GekkoTrader"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why are you fighting science? Covid isn’t the government. Protest real things, like wage gaps and the loss of woman’s rights. Fucking covid is global. We get the shots IT GOES AWAY. Idiot",
                    "score": -6,
                    "author": "Thunderjamtaco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most People don't have a problem with science they just don't believe they should be coerced by government and millions of people got the shot and it didn't go away.",
                            "score": 3,
                            "author": "z-man82",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not enough people got the shot. We had to get to 70%. We, as a people, failed. Zombie apocalypse is here, but the zombies have guns. Asshole.",
                                    "score": 0,
                                    "author": "Thunderjamtaco",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not enough people got the shot? You're hilarious. \n\nThis city literally has the highest vaccination rate among other top cities in the country, the strictest mandates, and you're telling me not enough people got vaccinated?",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yup. We needed 70, we got like, 63. So, yup.",
                                                    "score": 1,
                                                    "author": "Thunderjamtaco"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You are not making any sense goodbye and happy new year",
                                            "score": 4,
                                            "author": "z-man82"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You get the shots, it goes away? Where did I hear that before?!",
                            "score": 2,
                            "author": "HomeWild830",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I dunno, I still don’t have polio. I got that shot.",
                                    "score": 1,
                                    "author": "Thunderjamtaco"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Who is the science?",
                            "score": 1,
                            "author": "Intelligent-Front433",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who is the science? Ok, go fight the sun. Shoot arrows at the moon until the women’s moon blood goes away. Who is the science? Wtf kinda question is that? Jeff. He’s the science",
                                    "score": 1,
                                    "author": "Thunderjamtaco"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Since this pandemic started from China, we don't even know what exactly causes the pandemic. There are just so many variants going on that seems out of control. If we really trust in science, why not having more remote classes(at least 70percent remote) before the pandemic ended? \\[Remote learning also helps lower income family.\\]",
                            "score": 1,
                            "author": "Korben02"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And remember, employees, including faculty in classes, are not required to vaccinate.",
            "score": 4,
            "author": "nygdan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Faculty now needs to be vaccinated under the new mandate",
                    "score": 16,
                    "author": "Atmosphere_Dapper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just heard that, it's good, and  notice it was the governor's office requiring it, not CUNY.\n\nRemains to be seen if CUNY will implement it, I doubt it will go through for the spring semester  but would love to be proven wrong.",
                            "score": 0,
                            "author": "nygdan"
                        },
                        {
                            "level": 2,
                            "comment": "Good",
                            "score": 0,
                            "author": "Thunderjamtaco"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Faculty and staff will be require to be vaccinated under the new mandate.",
                    "score": 7,
                    "author": "hongtnyc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was just announced by the governor, yes, in suspect it won't be implemented this semester for one reason or another.",
                            "score": 3,
                            "author": "nygdan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's going to be a 💩show. Tenured professors are practically impossible to fire and have significantly more control over their working conditions. This is going to land squarely on poorly paid adjuncts and staff. \n\nPlus, they're still requiring masking on campus AND random testing. God forbid they ever reduce class sizes or implement other meaningful virus mitigation procedures. Most CUNY campuses are not residential so almost everyone will be commuting via packed public transportation and returning to cramped living quarters.",
                                    "score": 4,
                                    "author": "LotusEagle"
                                },
                                {
                                    "level": 3,
                                    "comment": "It is in best interest to implement this semester, funding for Senior colleges comes from state.",
                                    "score": 2,
                                    "author": "hongtnyc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Of course it's in every ones best interest. That doesnt mean anything to CUNY admins.\n They will drag their feet on the details of how it will be done and what the deadlines are.There will probably be a lawsuit like there was for other sectors that will delay implementation. Then they have to negotiate with the union. Then they will push back the deadlines as people lie and say they were caught off guard.",
                                            "score": 2,
                                            "author": "nygdan"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I understand where the feelings behind this post are coming from but on the other side of this are the countless people who have very actively urged CUNY to return classes to in person modals. Back when the first vaccine requirements were put in people were furious with the thought of having to do that just to be on campus, but they did it anyways because they valued being on campus more than either losing their chance to continue their degree or losing their chance to not be in person if the class would allow for it. \n\nIt's not like the intial 70% figure for inperson classes came out of nowhere. So many students aregued to the tooth with CUNY to return back to classes because \"things got better\" and so forth. \n\nAlso have to acknowledge that it is probably easier to do huge administrative shifts such as changing class modalities in private schools versus public schools like the CUNY ones. \n\nRegardless, these times are difficult for everyone and it must be known that both sides of returning to schopl or staying online are being argued by students/families/stakeholders on a continuous basis. Just take a look at the past posts on this sub-reddit alone. You can see the yo-yo of sentiments from people who believe these changes are good or who believe they're bad and must change.",
            "score": 1,
            "author": "ThyShakeandBake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea but 70 percent is too much maybe 50 is fine then slowly in the summer 70 that makes  Sense this is ridiculous",
                    "score": 7,
                    "author": "No-Umpire9632",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel your frustration and agree with you. 70% does seem like too much compared to a 50% push, spread throughout the spring/summer terms. \n\nIf they had done a slower roll out like that it could have potentially played better for covid case reasons i.e. potentially less spread?",
                            "score": 3,
                            "author": "ThyShakeandBake"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get the fucking booster. That’s my thought. We fixed polio, we coulda fixed this but people are triflin.",
            "score": 0,
            "author": "Thunderjamtaco",
            "replies": [
                {
                    "level": 1,
                    "comment": "What was polio death rate?\nWhat is covid death rate?",
                    "score": 4,
                    "author": "Intelligent-Front433",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The death rates are fabricated to increase News ratings",
                            "score": 4,
                            "author": "Signal-Priority6551"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are the consequences if you don’t get the booster and have an in person class?",
            "score": 1,
            "author": "Nba4life2k21",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Students who miss the deadline will not be able to register for Summer 2022 or Fall 2022 classes.\"",
                    "score": 1,
                    "author": "FreshlySqueezedDonut"
                }
            ]
        }
    ]
}