{
    "id": "wkdgr2",
    "score": 44,
    "title": "online classes/monkey pox response",
    "author": "Master_Challenge_545",
    "date": 1660076061.0,
    "url": "https://www.reddit.com/r/CUNY/comments/wkdgr2",
    "media_urls": [],
    "other_urls": [],
    "postText": "i feel like ill probably be downvoted for this but whatever. why the hell are so few online classes being offered?? they’re always the first ones to be filled, so there’s clearly a demand. lots of baruch/cuny students are commuters and also work, so it would be convenient for them. i see plenty of people on the subreddit who also seem to prefer online classes versus in person. to go along with that considering that not only covid cases are still very prevalent, there’s also a rise of monkeypox, and manhattan is the most effected area. how is it that the only thing that cuny has said regarding the situation is that they’re watching it closely? do they think it’s not gonna spread on campus? the way it spreads is intimate contact, do they think college students are celibate creatures who don’t interact with each other? it’s obvious it’s only going to get worse once the semester starts, so they should at least give the option to students to take classes virtually. istg they’re gonna put off doing anything worthwhile until plenty of students are already infected.\n\nedit: also wanted to add that it can take up to 3 weeks for monkey pox symptoms to show, and isolation is recommended for 2-4 weeks. what is their plan to accommodate students who need about of month of quarantining??",
    "comments": [
        {
            "level": 0,
            "comment": "It's absolutely on purpose and insulting. Like the government and all these companies, it's not about protecting our health, it's about keeping people working and spending. The Adams administration sees people back at work in-person as some kind of victory for this dystopic \"return to normal,\" and the same goes for the CUNY administration, who is beholden to them.  \n\nMy program this semester has 0 online classes. I read all the studies about the longterm effects of covid and know it's in my best interest to not get infected. CUNY offers basically no protections. And for all the in-person crusaders bemoaning your inability to learn online, the quality of the education, or not getting what you paid for—IT'S NOT ALL OR NOTHING. Asking for SOME online classes does not interfere with your ability to go in-person. \n\nFor monkeypox, it looks like we're repeating all the same mistakes as early covid, and I agree nothing will be done until it's way too late. Their email was a bunch of PR hot air that basically said we don't have any plan yet. Monkeypox is spread through close contact, which obviously includes sexual, but it is also *airborne*, a fact the CDC and WHO recognised but scrubbed at the beginning of this outbreak, and it can live on surfaces for a long time. If you can get vaccinated, I would do it. This twitter account has a lot of useful information https://twitter.com/VioletEglantine\n\nStay safe and good luck",
            "score": 29,
            "author": "PoorMissHavisham"
        },
        {
            "level": 0,
            "comment": "Hi. They don't care about you. Or you getting monkeypox. (Protip: Don't fuck anyone with a visible rash at this time.) \n\nWhat they do care about is that people commute to midtown etc. to spend money. \n\nCUNY is a government entity, and the State of New York has a vested interest in the commercial real estate industry not crumbling and MTA traffic returning to normal levels.",
            "score": 23,
            "author": "Elaine_Benes_Lovr",
            "replies": [
                {
                    "level": 1,
                    "comment": "And the Mayor is a major advocate for “return to the office” so I doubt we will see online classes like before, I am curious how will they accommodate for those that get it or if there’s an outbreak.",
                    "score": 11,
                    "author": "plantanosuprnova"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The experience of the past two years is that online classes have significantly worse outcomes. Students don’t do learn as much, in general, in these courses, even when they prefer it. Some students may do fine, a few do even better, but the overwhelming majority of students are not getting the education they need in online courses. \n\nTo be clear—this the situation with *online courses in the way they’ve been offered during the pandemic*.  We have decades of evidence proving that when online courses are taught by well-prepared, well-supported, well-trained faculty, to well-prepared, well-supported, well-trained students, in an effective, rich, and robust online learning environment, the learning outcomes are just as good. But that’s not the way it’s done at CUNY, not the students or faculty or system we have. \n\nSo CUNY will do everything possible to maximize in-person classes (not including specifically online programs). Because it’s better for student learning. \n\nAs for monkey pox, at this time it’s clear that for this outbreak, transmission is happening by close, extended, akin to skin contact. Only. That doesn’t happen in classrooms. \n\nIf that changes (virus variant?), then that’s going to change things. But for now, even though it’s theoretically possible for monkey pox to stay on surfaces or spread through respiratory particles (note, this is *not* the same as aerosol spread, like covid), that is not currently happening.",
            "score": 16,
            "author": "lepidio",
            "replies": [
                {
                    "level": 1,
                    "comment": "As we languish in the third year of the pandemic, the CUNY administration should have the ability to prepare, support, and train its faculty and students to succeed with *some* online instruction in an effective, rich, and robust online learning environment, rather than pretending that SARS-2 isn't still raging. Further, students should be allowed to prioritise their health over the quality of their education if they so choose. \n\nDespite the current dominant strain being the most contagious, masks aren't required. Results of the ventilation audits have not been released. Classrooms don't have adequate HEPA filtration. What options do students who wish to be more cautious have besides their own N95 mask? Hiding behind \"it's better for student learning\" is PR sleight of hand to avoid the work and investment of doing what's best for faculty and students during a global health emergency. We must adapt.  \n\nThere is enough [evidence](https://its-airborne.org/mpx-timeline.html#event-evidence-that-monkeypox-is-airborne) to show monkeypox droplet *and* aerosol transmission, even if not the primary means of infection, to take adequate precautions, much like other governments advise, especially during a time when the virus is spreading at a perplexingly faster rate than previously observed. Classrooms are small, crowded, and highly trafficked. Why shouldn't we be overly cautious with a pox virus that is more fatal in children, that disfigures and can cause blindness, and whose pain can be so intense it drives patients to contemplate suicide? Even if we pretend for a minute this virus isn't a concern, SARS-2 *still* is—why no precautions? Corruption. Negligence. Incompetence. Follow the money.\n\n\nedit: typo",
                    "score": 5,
                    "author": "PoorMissHavisham",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Despite the current dominant strain being the most contagious, masks aren't required. Results of the ventilation audits have not been released. Classrooms don't have adequate HEPA filtration. \n\nAnd instructors do NOT have to be vaccinated. They can be unvaccinated and unmasked in classrooms.",
                            "score": 3,
                            "author": "nygdan"
                        },
                        {
                            "level": 2,
                            "comment": "Students are always free to prioritize health over education. Or anything else over education. They can make that decision anytime by deciding not to go to CUNY. There are plenty of excellent online degree programs available. (Some even at CUNY)\n\nNobody is required to go to CUNY. It’s actually pretty easy to avoid. \n\nIf you’re convinced that you’re attending a university that cares only about money, a university that is corrupt and negligent, then what in the world are you doing at CUNY? Find somewhere better. Self-educate. There are other options, and plenty of them.",
                            "score": 2,
                            "author": "lepidio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not sure why prioritising my health is part of this all or nothing game. Why can't I do that *and* attend CUNY? Why can't the nation's largest urban public university system, with a $1.4 billion budget and a president whose salary is nearly 700k, take adequate steps to protect students? \n\nIt's also quite possible to recognise this pathetic failing of the CUNY administration at large while still loving my program, it's world-class professors and staff, and my talented cohort. I will always self-educate, but the reality is I want the official degree that will allow me to advance further in our capitalist society. I also want to learn from leaders in my field. \n\nI shouldn't have to pursue an online degree program, avoid CUNY, or seek out other 'plentiful' options to be protected during an airborne pandemic three years on. I don't want an excellent online degree program—I would like to attend in-person the program I am in with adequate protections, and failing those, *have the option,* at CUNY, to take an online course if the college refuses to seriously acknowledge a disabling virus and safeguard its community.",
                                    "score": 2,
                                    "author": "PoorMissHavisham",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can’t go do both (your version of prioritize health *and* attend CUNY) because CUNY is not an online university (again, with the exception of some programs). This is the fact, and it’s the fact for good and sufficient reasons (I discussed some of them above). Everything, always, is a balance of risk and reward. \n\nThe risk here (of keeping most or all classes in person while having a vaccine requirement and random testing) is very small. The reward (much better educational outcomes for students) is very large and critical to CUNY’s mission. \n\nThat’s the calculus CUNY has made, and it’s CUNY’s role (not yours) to make that decision. You are completely feee to disagree with it. If you strongly disagree with it, then you have many many options. But CUNY isn’t one of them. For you, the risk is higher than the reward. Totally up to you to decide for yourself. \n\nThe problem is your insistence on a malicious or corrupt intent on the part of CUNY in making this decision. That’s unjust, cynical, and harmful.",
                                            "score": 2,
                                            "author": "lepidio",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I already disagreed with your reasoning why, despite not being an online university, CUNY should take steps to offer some online instruction, like other institutions, in the face of the public health crisis. \n\nThe problem is, despite all the manufactured messaging, the risk isn't small with only a vaccine requirement and poorly managed random testing, as more and more studies and experts are proving. Their calculus in this regard is wrong, and it's totally within my role as a recipient of the consequences of this calculus to demand them to do more.\n\nTheir decision-making is absolutely driven by corporate interests and not public health, and it ties right into our city's wish to get bodies in the city (and here, students in seats) so people are spending money as we declare 'victory' over a virus. Inaction can be the most malicious kind of action. All this isn't cynical, it's just the sad reality.\n\nedit: missing word",
                                                    "score": 2,
                                                    "author": "PoorMissHavisham"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;They can make that decision anytime by deciding not to go to CUNY. \n\nExcellent policy in an enrollment crisis. Push students away, brilliant. \n\n&amp;#x200B;\n\nDoes everyone else see how stubborn and stupid some people are about not just covid but online education in general?\n\nThey'd rather let millions die than have masks and vaccines or take the virus seriously.\"\n\nThey'd rather have the colleges close than offer enough online classes.",
                                    "score": 1,
                                    "author": "nygdan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There is no evidence whatsoever that a lack of online classes has anything to do with the current enrollment issues. In fact, the opposite is true.  As in-person classes have increased, so has enrollment.",
                                            "score": 2,
                                            "author": "lepidio",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"as in person increased so has enrollement\"\n\n&amp;#x200B;\n\nCan't really make that argument. First I don't even think it's true in a broad sense, but it could be in so far as: the pandemic suppressed enrollment and as it ends enrollment is going up. DOn't know how it can be pulled apart and separated. Second, from what I've seen, online classes fill up immediately while in person classes have a handful of students. \n\n&amp;#x200B;\n\nAnyway, you're the one saying 'let them go to another school if they want online\", so you're the one saying it affects enrollment, in a negative way, which would be a really bad policy.",
                                                    "score": 1,
                                                    "author": "nygdan"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;ut the overwhelming majority of students are not getting the education they need in online courses.\n\nThat's not even true but if we pretend it is, that STILL doesn't mean they should cut online classes. In person classes are open and available for this pretend majority with worse outcomes.\n\n&amp;#x200B;\n\n\"So CUNY will do everything possible to maximize in-person classes (not including specifically online programs). \"\n\nI mean, this is a blatant contradiction. And we've heard it from CUNY too, absurdly. \"Online classes aren't real, ALSO, we're here to promote our online programs and ALSO we have an entire campus this is only online and that is the future\".\n\nOnline classes can be problematic at CUNY because CUNY doesn't invest in them, support them, or train (well) for them. They've figured all along that this is all temporary anyway so they let it rot (this is actually a problem throughout CUNY, just look at the buildings for example).  Nearly 3 years latter and there's a lot rotten but the online classes are still here to stay.",
                    "score": 1,
                    "author": "nygdan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most departments have determined that classes are better done in-person, and the ad-hoc online classes were not working well for many professors. Yes, they could be developing better on-line options, but they aren't there yet, and maybe never will be.\n\nThere are some online classes, other online schools, and online options. But, long-term, most CUNY classes will be in-person. I guess, at this point, you have to decide if it's the right fit for you.",
            "score": 3,
            "author": "MulysaSemp"
        },
        {
            "level": 0,
            "comment": "I don't think monkeypox is relevant given how it spreads. And remember, CUNY doesn't care about COVID or diseases. When COVID started we had sick students in classrooms and they wouldn't even let \\*that\\* class go remote. CUNY did nothing and just waited until the Governor's office forced a shutdown. CUNY hadn't even planned for it, it was just announced in the middle of the day that that was the last day.\n\n&amp;#x200B;\n\nAs far as online classes, there are lots of 'it's just the flu' types in CUNY and CUNY has also always been actively against online classes. They have basically no preparation or support for faculty and  they do nothing to improve or monitor online classes even now years into it. They simply assume that the whole thing is going to go away and everything will be 'the old normal', soon. \"Soon\", for rolling on nearly 3 years now.\n\nIt's nuts, because like you noted, online classes fill up very quickly. If they add more online classes, they'll enroll more students.",
            "score": 2,
            "author": "nygdan"
        },
        {
            "level": 0,
            "comment": "I've been wondering the same given COVID, but I know they recently sent an email out trying to get 70% of students back on campus. I'm had to drop a class that only has one professor teaching it (And viola -- only in person). CUNY is wilin', but like any of these other companies they don't care. They just want heads on campus by all means necessary. I'm assuming they're purposely cutting down on teachers doing online courses.",
            "score": 3,
            "author": "HuntsPointWarlord",
            "replies": [
                {
                    "level": 1,
                    "comment": "but i really don’t get why? we’re paying the same tuition for online classes and in person",
                    "score": 4,
                    "author": "Master_Challenge_545",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see it akin to the same reason jobs are pushing to bring people back into the office, though many don't want to. Seems like a form of control to me and not conforming to evolving. Everyone wants to things to stay exactly how they have been forever. That's not how the world works.\n\nMix that in with most of us attending being adults, with full time jobs, kids and other duties. Then trying to build a class schedule, except it's during days/times most of us at are at work, so we are assed out.\n\nI have no idea as to why either. But it's becoming really annoying. I have 9 classes left after this summer session. I can't wait to get the hell out of CUNY.",
                            "score": 13,
                            "author": "HuntsPointWarlord"
                        },
                        {
                            "level": 2,
                            "comment": "And they can have a professor teach \\*more\\* students. Meanwhile for in person classes I've seen full profs with normal full pay teaching THREE OR FOUR  students per in person class.\n\nThe people running CUNY basically have no idea what they are doing. A lot of people try to come up with all kinds of complicated reasons, but it's simply: they don't know what they are doing.",
                            "score": 2,
                            "author": "nygdan"
                        },
                        {
                            "level": 2,
                            "comment": "Money, nothing more.",
                            "score": 1,
                            "author": "plantanosuprnova"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "    Touching objects, fabrics (clothing, bedding, or towels), and surfaces that have been used by someone with monkeypox.\n\nIs not just through close contact.",
                    "score": 8,
                    "author": "plantanosuprnova"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im actually all for in person. Since resuming in person since Spring 2022 (Fall 2021 was mostly online for my programs), I've connected more meaningfully with professors and even got some job and graduate program recommendations. The awful part of remote was not having the opportunity to flex the interpersonal connections that really make college a necessity. There are a lot of online only degrees for getting that piece of paper but remote will never offer the same degree of networking with classmates and professors!",
            "score": 1,
            "author": "porkbellydonut"
        }
    ]
}