{
    "id": "13wh5b1",
    "score": 276,
    "title": "Sam Lake On Alan Wake 2: \"There Was Never A Time When I Felt Like It Would Not Happen\"",
    "author": "Tokyono",
    "date": 1685524665.0,
    "url": "https://www.reddit.com/r/Games/comments/13wh5b1",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I played the first game only just last year and I think it lost a lot of punch to age because the gameplay got stale for me super fast, but the narrative was so captivating that I couldn't stop pushing forward. I'd probably hop into anything they made, at this point. Control was outstanding (if also perhaps suffering a little bit from stale gameplay and phenomenal narrative/world-building, but the staleness came far later), so I'm definitely looking forward to this.\n\nI didn't end up playing the DLC of the original or America Nightmare, though I do own both. Do they feel substantially different from the original base game? Should I go through them if only to be prepped for the Alan Wake 2?",
            "score": 53,
            "author": "Sand_Coffin",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's not really an age thing - the gameplay variety wasn't there to begin with. It's still a great experience, but yeah.",
                    "score": 61,
                    "author": "An_Absurd_Word_Heard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's fair. I mostly meant it in a \"maybe in 2010, these mechanics were way cooler than I think they are now\" way. Wasn't sure how it was actually received on launch.",
                            "score": 8,
                            "author": "Sand_Coffin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I played the game when it was more recent (a couple years after launch). The mechanics were neat and the lighting elements were novel for the time, but it really did get stale after the first couple of acts. There's only so many ways you can spice up \"aim flashlight at humanoid blob then shoot with gun.\" I remember stopping after the first real night section, though I enjoyed my time with the game. I think the general consensus is that the game was niche but had its audience.",
                                    "score": 11,
                                    "author": "Anonigmus"
                                },
                                {
                                    "level": 3,
                                    "comment": "I played the game not long after it launched, and ground to a halt after about 2-3 hours. I went back to it years later after loving Control and pushed through some of the clunkiness. The narrative really grabbed me and got me through the repetitive sections. \n\nI dunno, I would say the gameplay is definitely not great, but it feels oddly nostalgic at this point? The stiffness and clunk is almost part of the charm these days.",
                                    "score": 3,
                                    "author": "Wes_Anderson_Cooper"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think it reviewed around 7/10 back then, certainly didn't feel like it was going to be a cult hit with the noise fans make.\n\nPlayed it a couple of years ago and I felt like I went in with wrong expectations.  Like it's not a scary horror game, and it's more interesting if you approach it as a narrative experiance. Control is sort of similar except throwing objects around has a fun factor like that of a Star Wars jedi I suppose.",
                                    "score": 1,
                                    "author": "bombader"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I disagree with the others saying to skip the Alan Wake DLC. I'd highly recommend you play them for their narrative since that's the main thing that interests you.",
                    "score": 28,
                    "author": "ClydeDiscoPants",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I'm with you. The two DLC's don't change much plot-wise, but they dig deep into Alan's psyche. I don't think the game would have hit as hard for me without playing them.",
                            "score": 20,
                            "author": "Wes_Anderson_Cooper",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's been about 10+ years since I've played them but I remember them being great for that reason. And the environments and levels they have in the DLC are a bit more creative than the base game in my opinion.",
                                    "score": 8,
                                    "author": "ClydeDiscoPants",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should revisit them: they are not good and despite the added tension are quite superficial.",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Been wanting to replay the game for a while, somewhere down the line I'll get around to it.",
                                                    "score": 2,
                                                    "author": "ClydeDiscoPants"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "American Nightmare added a lot to the lore and spiced the gameplay up considerably. It's a smaller game and it, by it's very nature, has quite a bit of repetition, but if you're invested in Remedy's continuing narrative, then I think it's a must-play. \n\nAlan Wake's DLC can safely be skipped though. I don't remember those two add-ons providing anything meaningful narratively.",
                    "score": 8,
                    "author": "DRACULA_WOLFMAN"
                },
                {
                    "level": 1,
                    "comment": "Remedy has had more than one game where the gameplay wears out before the story ends, but the story carries the game.",
                    "score": 3,
                    "author": "pikagrue"
                },
                {
                    "level": 1,
                    "comment": "If you didn’t, you should 100% play the AWE DLC for *Control*. I’m not sure it will play directly into AW2 but I would be shocked if it didn’t.",
                    "score": 5,
                    "author": "rashmotion"
                },
                {
                    "level": 1,
                    "comment": "That's honestly how it felt at the time.",
                    "score": 2,
                    "author": "QueenNebudchadnezzar"
                },
                {
                    "level": 1,
                    "comment": "&gt;  I think it lost a lot of punch to age because the gameplay got stale for me super fast...\n\nThat was everyone's complaint when it released. 10 hours of shadow rednecks gets old. \n\nThe DLC fixed it a little with variety, but tripled down on the combat.",
                    "score": 2,
                    "author": "ICBanMI"
                },
                {
                    "level": 1,
                    "comment": "The two DLC are kind of not worth it, they try to get into the sort of gameplay that AW2 is going in, but it gets so repetitive. Playing them before AW2 might honestly burn you out from wanting to play AW2. American Nightmare is unrelated to the major plot but expands the world so it's nice to play if you get the AW itch.\n\nControl's DLC is also worth playing, especially AWE. The Foundation is also good but mostly for Control reasons and not for the connected universe they're building.",
                    "score": 0,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I played Alan Wake about a year after it was released and it thought the gameplay was pretty repetitive back then. While Control was much better, I think the game asked a bit much of how long the gameplay could keep you around for.",
                    "score": 1,
                    "author": "Noxvenator"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really hope this ends up a success, and ends up being a great game. I've full faith in them. Especially knowing what they wanted from the original Wake that they just couldn't do due to time and technology constraints.\n\nI'm still a bit sad Alan Wake Remastered didn't get more post-launch support - PC version is still a visually buggy mess and sometimes you can still be soft locked at a glitchy elevator on all platforms. But that's the nature of things - Lake said a while back they still hadn't made any money off of it, so I'm just thankful we had it at all.",
            "score": 63,
            "author": "MooseTetrino",
            "replies": [
                {
                    "level": 1,
                    "comment": "I honestly think the PC version of the original is the best way to experience the game today, if people have the machine to run it at 60 at a decent resolution. \n\nI think a lot of the underlying geometry is the same in the remaster, just with higher res textures that end up making the game look flatter and somehow *less* detailed (ground feels less like its \"covered in leaves\" and more like \"covered in a leaf-covered-ground texture\", if that makes sense). The atmosphere just felt a little dulled when I booted up the remaster after finishing the original.\n\nTurns out a lot of 360/PS3 era stuff looks kinda great running at higher resolutions?",
                    "score": 23,
                    "author": "detessed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m in agreement with you, however there are some differences. There is a lot more level clutter in the remaster, and there actually is a lot more ground grass etc - but one of the bugs is a broken depth layer for them, so the gras always looks semi-transparent.\n\nI will say that very few games of the Wake era hold up anywhere near as well - but when they do, usually due to great texture and level work, they’re amazing. Mirror’s Edge comes to mind.",
                            "score": 15,
                            "author": "MooseTetrino"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks I was actually going to get the remaster but looks like I’ll just get the original.\n\nI played it back on the 360 when it came out, but I honestly don’t remember anything about it. Wanted to get back to it before the sequel.",
                            "score": 0,
                            "author": "1evilsoap1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I made this little comparison image a second ago. Definitely look into it a bit and decide for yourself, especially with the remaster being a bit cheaper on Epic right now than the original (though I wouldn't be shocked if the original goes on a pretty deep sale in the summer sale).\n\nRemaster is on the left, original is on the right.\n\nhttps://i.imgur.com/tovTVBO.png\n\nTexture quality is certainly higher in the remaster, but things like the wood on the cabin looking almost too uniform and new, the general mood of the lighting, etc. I just think the original has a lot more character to how it looks generally.",
                                    "score": 4,
                                    "author": "detessed",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The only problem with the original pc port is the fmv sequences look kinda terrible compared to the actual game, which is always kind of a bummer.",
                                            "score": 3,
                                            "author": "Kalinzinho",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "for me that's nostalgia, baby",
                                                    "score": 1,
                                                    "author": "detessed"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Probably would have sold better if it wasn't epic game store exclusive",
                    "score": 5,
                    "author": "BaconCheeseburger700"
                },
                {
                    "level": 1,
                    "comment": "I never finished the expansion game for the original, would you say its required info before 2?",
                    "score": 1,
                    "author": "Paradethejared",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't think we really know much about the story in 2 so there's no telling. \n\nIt's a short game and pretty good. You've got four months to play it so might as well.",
                            "score": 3,
                            "author": "MVRKHNTR"
                        },
                        {
                            "level": 2,
                            "comment": "Most likely not required. We don't know if it's canon and if it is, it wasn't even remotely hinted towards in Control which means it's likely minor.\n\nI'd finish it anyway if you can just for the fun of it.",
                            "score": 2,
                            "author": "MooseTetrino"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The nostalgic part of me is hoping this game will feature a surprise action sequence where Alex Casey goes all Max Payne. \n\nAlex Casey, the detective character Alan Wake's books are about and sighted in the trailer, basically *is* Max Payne, after all.",
            "score": 17,
            "author": "geraltseinfeld",
            "replies": [
                {
                    "level": 1,
                    "comment": "is that the black FBI woman?",
                    "score": -1,
                    "author": "RayzTheRoof",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Alex Casey is the detective standing with the black FBI woman in the trailer, whose name is Saga Anderson. Casey looks and sounds (same voice - James McCaffrey) just like Max Payne (who is modeled after Sam Lake.)\n\nedit: in the trailer",
                            "score": 16,
                            "author": "geraltseinfeld",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Saga Anderson\n\nJesus I love how blatantly \"Airport Bookstore Mystery\" all of Wake's characters are named",
                                    "score": 17,
                                    "author": "SurlyCricket"
                                },
                                {
                                    "level": 3,
                                    "comment": "And Director Trench from Control!  Wonder if they're gonna reference that.",
                                    "score": 4,
                                    "author": "Gekokapowco"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Picked the remaster of the first up on sale on Series X. Excited to dip into it tonight. I loved Control to the point of getting all the achievements.",
            "score": 5,
            "author": "LucarioSpeedwagon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you play Quantum Break? Really liked that, too.",
                    "score": 6,
                    "author": "Mitrovarr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Very bold of Sam Lake to say that when the game hasn't released yet, as if every game ever has successfully released on time once they announced a release date.",
            "score": -24,
            "author": "itsyaboihedgepedge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Development of the game isn’t going to stop immediately, kinda missing the point, he’s just saying this didn’t come from no where the road that their studio was on was always going to lead back to AW2, and that’s the kind of passion that I admire. Made several top tier products in between making your dream.\n\nEasy to have a dream, rare to do what’s necessary to see it to fruition.",
                    "score": 26,
                    "author": "AnswerAi_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;the road that their studio was on was always going to lead back to AW2\n\nI mean hell, American Nightmare came about because they wanted to implement some of the concepts they had for a sequel *just in case* it would take a decade or more to get there - or something else happened that prevented a proper sequel.",
                            "score": 9,
                            "author": "MooseTetrino"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean its been 13 years, that's about as close to \"not happening\" as it would get. This is virtually a reboot.",
            "score": -8,
            "author": "hairy_mayson"
        }
    ]
}