{
    "id": "13wlvxv",
    "score": 177,
    "title": "Double Dragon Gaiden: Rise of the Dragons - Release Date Trailer",
    "author": "Turbostrider27",
    "date": 1685538588.0,
    "url": "https://www.reddit.com/r/Games/comments/13wlvxv",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Release date is July 27th",
            "score": 24,
            "author": "Turbostrider27"
        },
        {
            "level": 0,
            "comment": "The artstyle led me to think it was made by the same developers from TMNT Shredder's Revenge, but it's not. How's this Dev's past portfolio?",
            "score": 15,
            "author": "Monomate",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the first major release from Secret Base, their only notable past game was Streets of Red, which is a pretty cool beat'em up, but decidedly indie / low budget.  \n\nThey're now getting support from Arc System Works, best known for Guilty Gear, and published by MODUS, best known for Them's Fightin' Herds.  \n\nSo ideally we'll get a pretty cool beat'em up from a developer who has cut their teeth on their own, and now has support from industry giants when it comes to art and battle systems.",
                    "score": 13,
                    "author": "Dreadgoat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like the thumbnail artwork more than the game's graphics. I never thought of double dragon as a chibi thing. Maybe I am too old. I remember the original in arcades. Yeah I'm too old.",
            "score": 31,
            "author": "Redfeather1975",
            "replies": [
                {
                    "level": 1,
                    "comment": "It might be a budget thing as chibi stuff is just easier to make look okay animation wise than more realistically proportioned people. Either that or their style is more an update of the NES graphics than the Arcade.",
                    "score": 14,
                    "author": "TatteredCarcosa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah even in the old days the more \"realistic\" looking beat-em-ups had animations that had like... 3 frames.",
                            "score": 13,
                            "author": "Lazydusto"
                        },
                        {
                            "level": 2,
                            "comment": "It has a similar art style to their Streets of Red game, though improved for DD.  I guess they just went with what they know.",
                            "score": 4,
                            "author": "DrunkeNinja"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;  I never thought of double dragon as a chibi thing. Maybe I am too old. \n\nYou're not.\n\nIf anything deserved a gritty style, it's Double Dragon.",
                    "score": 5,
                    "author": "Sloi"
                },
                {
                    "level": 1,
                    "comment": "Double Dragon was the first game I ever beat, on Atari ST.  This looks terrible.  Still, we have Streets of Rage 4 and the Turtles game so it's not like there aren't *any* decent beat-'em-ups these days.  Plus Yakuza as the modern evolution of that style.  A dud here and there isn't the end of the world.",
                    "score": 1,
                    "author": "defeattheenemy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;  Still, we have Streets of Rage 4 and the Turtles game so it's not like there aren't any decent beat-'em-ups these days.\n\nRiver City Girls (1/2) is pretty good as well",
                            "score": 1,
                            "author": "maglen69"
                        },
                        {
                            "level": 2,
                            "comment": "I got in big trouble for playing double dragon at the convenience store when the family was leaving for dinner with our grandparents. I got banned from playing it after that, but I snuck down to the store sometimes. 😇",
                            "score": 1,
                            "author": "Redfeather1975"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm glad we are getting these beat'em ups that follow in the footsteps of those old NES/SNES games and improve on the mechanics. Double Dragon II: Revenge was my jam back in the NES era. My cousin and I used to play it together through over and over again, always dreading the helicopter interior scene where the door opens occasionally and the airflow tries to suck you out of the copter.\n\nOn a similar note: does anyone remember an indie beat'em up from, I'd say, mid-2000s called Little Fighters 2? It was this anime/chibi-style beat'em up with a pretty decent roster of playable characters, each having their own supermoves (one guy was a bow-and-arrow dude, one had the Goku style Saying hair and could knee kick people off the screen, one was a ninja, one had a spear and so on). The levels were kinda basic, just walk to the left and fight the multitude of enemies that appeared. You could pick up some weapons, baseballs and bottles as well. I think there was also a coop option for like at least 4 players, maybe more and the only limit was the size of the keyboard.",
            "score": 6,
            "author": "HenkkaArt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh man, you just triggered some core memories there with the mention of Little Fighters…I had a family friend who worked on our PC who graciously installed it for me just because he knew I was into gaming…had never heard of it or seen it before, but I had friends come over and we would share the keyboard and play for hours. I remember liking the bow and arrow guy a lot too! Wonder if there is still a way to play it on modern PCs?",
                    "score": 1,
                    "author": "PoisonousGARY",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Apparently they're working on a remake.](https://hypebeast.com/2021/4/little-fighter-2-remastered-project-announcement-info) (of 2, at least) Article is 2 years old, so don't know if it's dead or not.",
                            "score": 1,
                            "author": "samus12345"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ugh...\n\nI still hate the art style and the constant motor mouthing of the characters.\n\nDoes not fit the Double Dragon aesthetic at all.",
            "score": 5,
            "author": "OmNomFarious",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not a fan either. It kind of looks like a flashier Neo-Geo Pocket Color game. I hope it's fun to play at least.",
                    "score": 1,
                    "author": "BruiserBroly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, hmm.\n\nThat looks to have little in common with Double Dragon. What are the chances they did their own game, then gave it a Double Dragon face lift? Either way, I love the IP enough to buy it. The music alone does it for me.\n\nBut if you are going to make a 4th character, why no Abobo? Didnt see him as an enemy either.",
            "score": 3,
            "author": "Charrbard",
            "replies": [
                {
                    "level": 1,
                    "comment": "Abobo was shown as a stinger in the previous trailer.\n\nThe distinctive DD music is the only thing maintaining my interest in the franchise after RC Girls and DD4. Neon is over a decade old.",
                    "score": 6,
                    "author": "ema_G"
                },
                {
                    "level": 1,
                    "comment": "Abobo was in a previous trailer so he's there.  I'm not totally into the artstyle myself but it's not like Neon wasn't a big departure in a number of ways and that game is well regarded these days.  Then you had the recent DD4 which decided to look almost a exactly like the NES games.  \n\nEven way back in the day, DD was never a consistent franchise.  You had games like DD3 arcade.  that SNES fighting game based on the cartoon which was very unlike the classic games.  There was battle toads and double dragon which was a battle toads game with some DD characters.  It's just a very inconsistent franchise so I don't mind seeing a different take if it's good, much like Neon.  The devs appear to be fans of the series at the very least.  \n\nI hope this turns out well and we get more good DD games on the way.",
                    "score": 3,
                    "author": "DrunkeNinja",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean you don't want some obtuse, dated beat 'em up mechanics with some really shitty platforming mixed in?!\n\nI love me some NES DD2... But my fucking God the platforming sections are horrific. And if we're honest, that knee move is the only reason the game is fun.",
                            "score": 4,
                            "author": "GreenVisorOfJustice",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I loved DD2 as a kid.  I didn't own it on NES but my best friend and I both rented it numerous times.   Absolutely loved that game but even then I disliked the platforming stuff.  I don't think I ever met anyone who was like \"oh man, I love that DD platforming!\"  I'm sure someone out there like that exists but I never came across them lol",
                                    "score": 2,
                                    "author": "DrunkeNinja"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "DD is the series that invented the 2 player beat 'em up, so it makes sense it would have wildly different interpretations of the genre. Always kinda wished Capcom had made one in their style.",
                            "score": -1,
                            "author": "samus12345"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "i was playing a bunch of the old beat em ups and some modded ones made by the community.\n\nthis genre is actually quite good.   \npure gameplay with no annoying interruptions or weird cinematic pacing.\n\ni really hope some indie studio lands a hit so more of these are made.   \nStreets of rage 4 was fine but i think there is way more possible.",
            "score": 1,
            "author": "TheyCallMeAdonis"
        }
    ]
}