{
    "id": "13x2bbe",
    "score": 49,
    "title": "Etrian Odyssey Origins Collection Interview: Developers Discuss Art, Music, Mapping, and More",
    "author": "Tesg9029",
    "date": 1685577170.0,
    "url": "https://www.reddit.com/r/Games/comments/13x2bbe",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Excited for more people to check out those games, Etrian Odyssey is the pinnacle of turn-based combat for me, no one does it better than them.\n\nThe [new battle theme](https://www.youtube.com/watch?v=nHJ6btDrmQU) for EO3's 6th stratum is intense, another Yuzo Koshiro banger.",
            "score": 17,
            "author": "Last0",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just wish it wasnt 40 bucks a piece for something that feels almost like the same thing.",
                    "score": 4,
                    "author": "iamBoDo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed. I want to check out these games but I'm not paying that much for an enhanced DS port. Wishlisted and waiting on a sale.",
                            "score": 6,
                            "author": "ThorAxe911"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "wait there is new music in the remaster?",
                    "score": 4,
                    "author": "RaxusPrime",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One track specifically; EO3 didn't have a 3rd normal battle track to go with it's 6th Stratum, instead reusing the 2nd normal battle theme. At the time, this was due to space; EO3 also had an extra Boss Battle Track for it's Ship battles, and there just wasn't the room (Or, at least, this was the stated reason).\n\nSince the HD remasters don't have that consideration, they asked Yuzo to make a new track, and that's what we got... whatever it is (Video is unavailable).",
                            "score": 8,
                            "author": "FurbyTime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, that's so cool to hear. There is nothing on spotify on his profile, so I hope it will be properly released soon.",
                                    "score": 1,
                                    "author": "RaxusPrime"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What makes the TBS combat stand out in those games?",
                    "score": 3,
                    "author": "CptFlamex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Random encounters &amp; bosses are very well designed, they put a lot of care in giving each enemy clear strengths &amp; weaknesses that the player has to overcome, the game is difficult but mostly fair.\n\nLots of choices in terms of classes &amp; character building, you have to balance offense, defense &amp; utility but you're given a lot of different ways to do so, tons of ways to experiment.\n\nYou can check out more explanation [here](https://www.reddit.com/r/JRPG/comments/13qk0cg/why_do_you_like_etrian_odyssey/) if you want.",
                            "score": 4,
                            "author": "Last0"
                        }
                    ]
                }
            ]
        }
    ]
}