{
    "id": "13xcj4l",
    "score": 1937,
    "title": "Sonic Creator Yuji Naka Gets Over 2 Years In Prison",
    "author": "Tokyono",
    "date": 1685610181.0,
    "url": "https://www.reddit.com/r/Games/comments/13xcj4l",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "From what I could understand he didn't get sentenced to anything yet, prosecutor just demanded and the trial is not over. The sentence will be given on 7th next month.",
            "score": 1296,
            "author": "inyue",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, this is correct. We'll find out next month. [Source in Japanese (All-Nippon News Network)](https://news.yahoo.co.jp/articles/45fa1ea1eac753e1d78519fc2b01a98c0c75cbab)\n\n**Edit:** I should have also mentioned that he's asking for a suspended sentence. So that's the best case scenario for him at this point. How likely he is to get that though I'm not sure...",
                    "score": 414,
                    "author": "reibitto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn, that website gives me mid-2000s vibes.",
                            "score": 103,
                            "author": "Lightbringer20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve found quite a lot of Japanese websites tend to be like that, even for things like Tokyo Disney are a bit jank",
                                    "score": 152,
                                    "author": "CMDR_omnicognate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I went to Disney Sea (the park next to Tokyo Disneyland) about 6 months ago and the online experience and ticketing was AWFUL. They do not sell tickets in person anywhere, so you must use their site. The site does not allow you to use a foreign credit card for payment while in Japan. I had to call my parents back in the states and have them purchase my tickets with my card info back home. Then, to top if all off, you cannot use a digital version of the tickets to get in the park and you must print them out on paper, so I had to spend time figuring out how and where to print these tickets in Tokyo. What a mess.",
                                            "score": 27,
                                            "author": "Emperor_Neuro",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I went to Disneyland Tokyo this month and just needed to show the tickets QR code on my phone",
                                                    "score": 3,
                                                    "author": "Vodakhun",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm glad they've improved it, then. I went right as the Covid restrictions were coming down and tourism was gearing back up again. It may have been more of a pandemic policy than anything, but it was definitely a hassle.",
                                                            "score": 2,
                                                            "author": "Emperor_Neuro",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Answer in Progress did an interesting video about this a few months back: [why Japan's internet is weirdly designed](https://youtu.be/z6ep308goxQ)",
                                            "score": 89,
                                            "author": "SquiggleMonster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There was another video that came out that was an answer to that one, and it explained how in East Asian societies people process information differently, and thus maximalist designs work for them.\n\nEDIT: [The video in question](https://www.youtube.com/watch?v=Opy-SjDU0UY)",
                                                    "score": 33,
                                                    "author": "Brainwheeze",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's not just that. Japan's web design isn't just different, it's also more primitive. Even just visiting, when you have to go around to different sites and book things, makes that very clear.\n\nIt often feels like you're stepping back in time a decade or more.",
                                                            "score": 6,
                                                            "author": "LLJKCicero",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I did get a sense of that when I purchased a digital copy of a game from a Japanese website once. It was Trails to Zero (back before the official translation was out), and had to rely on the help of a friendly reddit user in order to make my purchase.",
                                                                    "score": 6,
                                                                    "author": "Brainwheeze",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Everyone processes information like that, modern web is designed so you can't focus on too much information, information gets in the way of ads.",
                                                            "score": 5,
                                                            "author": "ms--lane"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This makes sense considering their written language is logographic.",
                                                            "score": 17,
                                                            "author": "Prineak"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; maximalist \n\nHuh, that's interesting. Is that why so much media from Japan doesn't really do subtlety well? I really dislike how exposition heavy and boisterous Japanese fiction can be, it's really off-putting to me and it seemed that more muted and unstated stories don't really get a lot of traction.",
                                                            "score": 7,
                                                            "author": "crapmonkey86",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Well this is purely from a graphic design standpoint, but from what I've observed minimalism has its place as well. I have a number of Japanese posters and print ads saved on a disk drive that follow a more minimalist presentation.",
                                                                    "score": 12,
                                                                    "author": "Brainwheeze",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I should've quoted larger, but I was also speaking to your point in saying East Asian societies process information differently with reference to your maximalist design statement. \n\nAnd that's true that Japan can do subtlety. Ico's japanese cover art infamously demonstrates this, and it's not like anime like Cowboy Bebop and Bartender don't exist, it's simply not the norm. I just feel like a lot of time when Japan tries to be subtle, they can't help but be loud about it lol",
                                                                            "score": 4,
                                                                            "author": "crapmonkey86",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I'm not an expert on the subject, but I have heard that a lot of Japanese media is based on Kabuki and Noh theatre, and that that's why there's less subtlety.\n\nAnother really cool minimalist show is Mushishi. It's gorgeous and tells a lot of really compelling stories.",
                                                                                    "score": 10,
                                                                                    "author": "Brainwheeze"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You can find plenty of subtle Japanese media. Since you mentioned it not being the norm in anime, I think it's important to remember that it is also the norm for anime to be tv adaptations aimed at teenagers. You're just less likely to find a lot of subtlety in those ones.",
                                                                                    "score": 5,
                                                                                    "author": "MustarMayo"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The older looking style doesn't make them janky. Just like many new approaches to website designs don't make them better; sometimes even the contrary. \n\nStyle != Functionality.",
                                            "score": 104,
                                            "author": "Boesesjoghurt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its the sole reason I'm still using the old Reddit design.",
                                                    "score": 140,
                                                    "author": "Cleverbird",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Legit. Once they force me to use the new Reddit design that'll be the day I finally quit this website, and I think they know that a lot of people feel the same given they *really* don't want people to keep using old Reddit.",
                                                            "score": 72,
                                                            "author": "TaleOfDash",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They got rid of the compact version for mobile and I was super close to quitting, but I tried out the RIF app and loved it.\n\nJust opened my app this morning to a warning from the dev that new rules will make RIF unsustainable in about a month.\n\nI'll be taking my leave at that point. Fuck this company and their shitty decisions.",
                                                                    "score": 64,
                                                                    "author": "Thorumar",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Same thing will likely happen to Joey, my fave Reddit app :(. We desperately need a viable alternative to Reddit to pop up because their power tripping decisions are getting insane.",
                                                                            "score": 32,
                                                                            "author": "TaleOfDash",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I think the problem is that you'll never convince enough reddit users to swap to another site because there's always going to be a bigger community here.\n\nEven if reddit got shut down tomorrow somehow, people would split up between like 5+ different apps and I doubt the best one wouldn't even get all the users, just the one that manages to handle the traffic surge the best",
                                                                                    "score": 9,
                                                                                    "author": "st-shenanigans",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Aye, all of them are scrambling.\n\nApollo just received a 20 million bill which they obviously can't afford. Neither can RIF, and that dev is seeing the writing on the wall.\n\nRIF *is* Reddit for me. If it shuts down it just means I no longer have reddit.\n\nI do wonder if their choice to effectively price out third party apps will be worth it in the end.",
                                                                            "score": 25,
                                                                            "author": "MistarGrimm",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Apollo didn't receive a bill for 20 million, the devs estimated that that is what the yearly cost would be",
                                                                                    "score": 21,
                                                                                    "author": "ToxicMonkeys",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They got rid of the compact mobile design and I'm trying to wean myself off of Reddit",
                                                            "score": 17,
                                                            "author": "FUTURE10S"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hell, I don't even bother with mobile app Reddit, desktop old Reddit on mobile just has so good content density.",
                                                            "score": 9,
                                                            "author": "BoxOfDust",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I always use the old desktop version on mobile. But often it will switch me to the horrible mobile version and I have to request desktop site again. For some reason.",
                                                                    "score": 6,
                                                                    "author": "IRLHamburglar"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Agreed.\n\nNevertheless, there's a lot of janky Japanese sites out there. Been prepping for another trip to Japan and been getting more reminders of that. E.g. the ANA mileage award flight website is drastically more primitive than American equivalents.",
                                                    "score": 3,
                                                    "author": "LLJKCicero"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "God, I wish more people had this mindset.",
                                                    "score": 3,
                                                    "author": "CreaturesLieHere"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Information that compresses well travels further easily.\n\nAlternate post comment: *How dare you come here with a reasoned, nuanced approach! Get out of here with that healthy attitude!*",
                                                    "score": 0,
                                                    "author": "cardfire"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I see. Well, I've heard they're stubborn when it comes to changing things, so that makes sense. The only thing I notice is that it's partly designed with mobile scrolling in mind (I'm on PC), but other than that this website looks almost straight out of like 2006.",
                                            "score": 18,
                                            "author": "Lightbringer20",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Japan &amp; Germany are the kings of keeping fax machines alive and mandatory.",
                                                    "score": 31,
                                                    "author": "MonkeyCube",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Germany has issues, but as someone who lived in Germany for a few years and occasionally visits Japan, I'd say Japan is worse. A lot of consumer-oriented websites in Japan feel weirdly backwards or primitive.\n\nAlso, the whole \"hanko\" thing feels even dumber than using faxes.",
                                                            "score": 4,
                                                            "author": "LLJKCicero"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Theres a unique history to Japanese web development that's kind of interesting.  Through the 90s and early 2000, Japanese consumer technology was outpacing the world, any new phone innovation would come from Japan first.\n\nIt's because of this 10 year lead that Japanese phones had on the world that this was when the most impactful years of the internet would form also, And having the first phones that could browse the web made the internet grow hand in hand with Japanese phones.     \n\nAt this point I'm not even sure why things are so stagnant, maybe everyone still uses Japanese phones for primary web surfing device",
                                                    "score": 21,
                                                    "author": "UpV0tesF0rEvery0ne",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I recently watched a 1 hour video of Japan's Rearmament Strategy in light of its recent geopolitical situation and the analyst in the video said that the JSDF operates on two settings: \"Staunch Conservatism\" and \"Rapid Change\", where they do not change anything for years and likely decades, but once they do, they change really rapidly.\n\nEvents in relatively recent Japanese history such as the Sakoku era, the forced opening of Japan to the world by Matthew C. Perry, the Meiji Restoration, and the post WW2 miracle were cited as examples of the two settings so to speak.\n\nParaphrasing and using some of my own words, \"If it isn't broken, don't fix it. If it IS broken, leap forward dozens of years in the future in a blink.\"",
                                                            "score": 31,
                                                            "author": "Harrason",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Their work culture is super broken. They really have to take a leap there or Japan will work itself into nonexistence.",
                                                                    "score": 8,
                                                                    "author": "kingmanic",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; 1 hour video of Japan's Rearmament Strategy\n\nThat 100% sounds like it would be a Perun video/power point presentation lol.",
                                                                    "score": 2,
                                                                    "author": "Fiddleys"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Older demographics being so overwhelmingly the majority of the Japanese population would definitely favour conservative attitudes to keeping tech and internet browsing experience as decades past.",
                                                            "score": 3,
                                                            "author": "Cattypatter"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[Oh man, it is your lucky day, today!](https://youtu.be/z6ep308goxQ)",
                                                    "score": 2,
                                                    "author": "cardfire",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wait, what did she say about old.reddit?",
                                                            "score": 7,
                                                            "author": "jarfil",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "She talks about information density and the extreme portability of Japanese web design language. \n\nI thought the sub-topic was \"why does the Japanese internet tend still feel early-200's to us westerners?\"\n\nBut, I'm with you on only old.reddit, only all the time!",
                                                                    "score": 9,
                                                                    "author": "cardfire"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That's the JP web, generally.",
                                    "score": 3,
                                    "author": "treerabbit23"
                                },
                                {
                                    "level": 3,
                                    "comment": "I rather like it",
                                    "score": 3,
                                    "author": "lordaezyd"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah but it's Japan we're talking about, with their conviction rates he may as well be sentenced already",
                    "score": 150,
                    "author": "goodwarrior12345",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 73,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I heard part of it is also that they keep suspects detained until they confess. They more or less coerce a confession once they decide someone is guilty",
                                    "score": 122,
                                    "author": "ieatsmallchildren92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup, they're allowed to hold for about a month without cause. Confessions are indeed high.\n\nGranted I'm working off 10 year old knowledge here so happy to be corrected.",
                                            "score": 79,
                                            "author": "Tangocan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Sounds like a good way to get a good number of false confessions.",
                                                    "score": 43,
                                                    "author": "Andigaming",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah some people don't realize the Ace Attorney franchise is also basically a parody on what a fucking uphill battle it is to get an innocent person off the hook sometimes",
                                                            "score": 43,
                                                            "author": "tom641",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There's a line at the beginning where they say there is a 99% conviction rare and the first time I played I thought \"Well that's pretty cartoonish\".\n\nThen they said the same thing in Judgement and I looked it up and found out it was true.",
                                                                    "score": 16,
                                                                    "author": "dacookeymonsta",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Same, when they said it in Lost Judgment, I was like that's pretty outlandish, they could've chosen a more realistic number... and then I found out it's a real figure. Insane.",
                                                                            "score": 3,
                                                                            "author": "PL-QC"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wasn't that final case in \"Ace Attorney Apollo Justice\" intended to introduce (Japanese) people to jury trials? I know there was a change to Japanese courts where they introduced \"lay judges,\" who are members of the public that help with adjudication. It's not quite a jury as know it in the west, but it's a step in that direction.\n\nEdit: I say \"in the West,\" but I really just mean the US and other Common Law counties. Plenty of other Western countries don't use US-style jury trial/adversarial systems, but rather inquisitorial systems (such as that portrayed in the AA series).",
                                                                    "score": 9,
                                                                    "author": "gioraffe32",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah - Japan doesn't practice common law/judicial precedent, and so their legal system is actually *significantly* different from what we consider the norm.  \n  \nAA Apollo Justice was released just a couple of years before lay judges were officially introduced into the Japanese legal system - the game treats a jury as a novel thing because it kinda *was.*",
                                                                            "score": 10,
                                                                            "author": "Riddle-of-the-Waves"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep, there is a pretty recent case where someone that had served like 70 years in prison and always claimed his innocence was proven to be wrongly convicted.\n\nOn his deathbed the judge that sentenced him basically said he knew the guy didn't do it but if he didn't convict he would have killed his career.",
                                                            "score": 20,
                                                            "author": "FappingMouse",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just one case like this proves that the death sentence must be abolished world wide, forever.",
                                                                    "score": 14,
                                                                    "author": "AzettImpa"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yup. Absolutely awful system.",
                                                            "score": 28,
                                                            "author": "darklightrabbi"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "For context, the USA achieves 98-99% of federal convictions via a confession too.\n\nI’m not defending the Japanese system at all, just providing context with a legal system a lot of redditors are familiar with.",
                                                    "score": 9,
                                                    "author": "Gellao",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep, the USA is very similar. Japan can hold someone until they confess, the USA can hold them for years before they give them a trial. For an innocent person, it's often better to just plead guilty and get started doing the time, rather than wait ages for trial and then probably lose and have to do a longer sentence on top of that. Prosecutors and judges in the USA will reward people who save their time and just plead guilty, they don't care whether they're innocent or not. Awful systems in both countries.",
                                                            "score": 13,
                                                            "author": "Bloody_Conspiracies",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Hey, I just remember reading about this a few days ago. http://www.japansubculture.com/the-99-has-a-very-different-meaning-in-japan/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-99-has-a-very-different-meaning-in-japan",
                                                    "score": 3,
                                                    "author": "AsteriskCGY"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, it only is because the Japanese utopia proves yet again how efficient and just they are.\n\nCertaintly no other human rights breaking method with which this conviction rate is achieved.",
                                    "score": 60,
                                    "author": "Weegee_Spaghetti"
                                },
                                {
                                    "level": 3,
                                    "comment": "Above 99.8% once the case actually goes to court.",
                                    "score": 2,
                                    "author": "GrayMagicGamma"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Convicting and sentencing are completely separate things",
                            "score": 34,
                            "author": "AllMyBowWowVideos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Japan has like a 99.9% conviction rate for those charged with a crime due to the way their legal system works",
                                    "score": 23,
                                    "author": "lotg2024",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know but sentencing is determining how long he goes to prison, which hasn’t been done yet",
                                            "score": 47,
                                            "author": "AllMyBowWowVideos"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In other words he said \"He's likely to be convicted but *THE SENTENCE* hasnt been determined\"",
                                            "score": 7,
                                            "author": "AstroPhysician"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think you missed the point of this comment entirely. Like, 100% of it whooshed.",
                                            "score": 10,
                                            "author": "meetchu"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe in the West. Not in Japan.",
                                    "score": 9,
                                    "author": "chankunsama"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you count plea deals the US has a similar rate.",
                            "score": 2,
                            "author": "BluEyesWhitPrivilege"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sorry, but company policy at thegamer requires the stupidest headlines possible",
                    "score": 3,
                    "author": "pantsfish"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a few particular sites mods should consider banning as valid new sources: [videogameschronicle.com](https://videogamechronicle.com) is one, [thegamer.com](https://thegamer.com) being another. These aren't journalistic sources, just fan blogs that post every social media rumor that comes their way.",
            "score": 42,
            "author": "uselessoldguy"
        },
        {
            "level": 0,
            "comment": "&gt;Naka was alleged to have purchased shares worth more than 100 million yen each, hence the lofty fine of ¥172 million, which is around $1.2 million or just under one million pounds (£989,344).\n\nAiming peaks at 1000 yen in 2020. https://www.marketwatch.com/investing/stock/3911?countrycode=jp\n\nAnd ATeam Entertainment peaks at 1,750 yen in 2021. https://finance.yahoo.com/quote/3662.T/\n\n&gt;Naka was alleged to have known about its existence prior to the title being announced, and as such had purchased 10,000 shares of developer Aiming's stock. \n\n10,000\\*1000 = 10,000,000                 \n10,000\\*1750 = 17,500,000                 \nThe fine: 172,000,000\n\n&gt;Naka was alleged to have purchased shares worth more than 100 million yen each\n\nThis article does not identify how this is possible, or who is alleging this. The only way it's feasible with the companies listed is if they have different quality shares available.",
            "score": 22,
            "author": "QuintonFlynn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How is it that mods will remove a post in r/games because of a slight formatting rule break, but something with as misleading as a title as this simply gets a flair added but stays up?",
            "score": 523,
            "author": "ThorAxe911",
            "replies": [
                {
                    "level": 1,
                    "comment": "You seem to think mods are paragons of society, when they're actually the kind of people who walk dogs 10 hours a week for a living.",
                    "score": 333,
                    "author": "chaotic----neutral",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hoooooly shit that interview LMAO okay good point.",
                            "score": 133,
                            "author": "ThorAxe911",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "out of the loop, what's this referencing?",
                                    "score": 2,
                                    "author": "PointmanW",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "/r/antiwork moderator went on fox News and gave an interview basically exemplifying the worst stereotypes of that movements. Talking about how they only walk dogs 10 hours a week as their job, and consider that too much work, and similar such gems. Caused a big uproar and schism that led to the popularization of /r/workreform to distance from that guy.",
                                            "score": 22,
                                            "author": "King_Of_Bel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Antiwork always gave my clown vibes but this somehow manages to make it seem even dumber. Thanks for the link to a more level-headed sub.",
                                                    "score": 3,
                                                    "author": "RollingDownTheHills",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it's because it uses the exact article title from the site and it's one of their accepted \"news\" sites.",
                    "score": 7,
                    "author": "fallouthirteen"
                },
                {
                    "level": 1,
                    "comment": "They’re clearly uneducated so go easy on them",
                    "score": 30,
                    "author": "billiam632"
                },
                {
                    "level": 1,
                    "comment": "Because it's been up for a while with a high score and adding the flair does more to clear up the misunderstanding at this point than removing the post would, perhaps. \n\nIf you're gonna complain about mods, pick some of the ones that are undeniably assholes. /r/movies mods called me mentally ill, Ikd bug them instead.",
                    "score": -2,
                    "author": "MemeTroubadour",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Because it's been up for a while with a high score\n\nThat's never, EVER stopped /r/Games from nuking a thread on the spot",
                            "score": 48,
                            "author": "MegamanX195"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "level 2 stage 3: prison island\n\nneutral mission : find the goal ring\n\nhero mission :  defeat eggman\n\ndark mission : free yuji naka",
            "score": 15,
            "author": "Accessx_xDenied"
        },
        {
            "level": 0,
            "comment": "Oh waw. Didn't expect that. That's quite heavy for insider trading, no? \n\nAlso: *Sonic ring noises*",
            "score": 583,
            "author": "Throwy_away_1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe we're just used to financial crimes going unpunished in North America?",
                    "score": 741,
                    "author": "whynonamesopen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Insider trading typically averages 2 year sentences in the US.",
                            "score": 91,
                            "author": "DarkMetroid567",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Only if you’re outside of the “boys” clubs, ie Wall Street and Congress. \n\nExamples; Martha Stewart and Nancy Pelosi.",
                                    "score": 98,
                                    "author": "LueyTheWrench",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s not really true. The SEC takes insider trading very seriously, partially because their tips and complaints come from people who insider traders have allegedly defrauded (e.g. other Wall Street types). People who work on Wall Street obviously do not tolerate someone illegally taking their money, regardless of whether that person also works on Wall Street or not.",
                                            "score": 16,
                                            "author": "cdstephens",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "if the SEC takes insider trading so seriously why do so many members of your government openly partake in insider trading with no consequences",
                                                    "score": 51,
                                                    "author": "herpesface",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Because it's literally not against the law for them.  Insider trading laws don't cover knowing what companies are going to be effected by upcoming legislation.\n\nThis is a loophole that should be fixed, but your complaint makes little sense as long as that loophole exists.",
                                                            "score": 55,
                                                            "author": "Yolectroda",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It IS against the law. That was the whole point of the STOCK act. It’s just hard to enforce, and the exec branch is often reluctant to even try to enforce it, and when they do, the penalties are laughable.",
                                                                    "score": 12,
                                                                    "author": "Rentun",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Because it’s not illegal for members of Congress to commit insider trading.",
                                                            "score": 19,
                                                            "author": "pnt510",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "What a loaded question. Why do you allow yourself to be ruled by a pedophile king who killed his wife?",
                                                            "score": 4,
                                                            "author": "hoyboy2",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Maybe because the mere perception of impropriety isn't enough on its own to charge or convict. Or maybe they aren't actually insider trading.",
                                                            "score": -3,
                                                            "author": "tarekd19",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Dude go look what happened during Covid with Congress investing into medical supply industry the day after their closed door senate hearing.\n\nAnd then again into technologies the day before voting on CHIPS act. \n\nCongressional insider trading is almost a requirement at this point.",
                                                                    "score": 6,
                                                                    "author": "yesnomaybenotso"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We need evidence to convict? Oooh, reddit isn't gonna like that...",
                                                                    "score": 0,
                                                                    "author": "shiftup1772"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;The SEC takes insider trading very seriously,\n\nOnly if you don't do it right. They don't do anything about members of congress insider trading.",
                                                    "score": 2,
                                                    "author": "Dhiox",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Because that’s not illegal. The SEC can only enforce laws. Unfortunately to make it illegal would require congress to change it",
                                                            "score": 2,
                                                            "author": "obvious_bot"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "How often are people convicted though? And are certain types of people more likely to get a pass?",
                                    "score": 4,
                                    "author": "SaraHuckabeeSandwich"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey, don't hog all the credit for corruption and nepotism!, the rest of America have some too!",
                            "score": 84,
                            "author": "Metrack14"
                        },
                        {
                            "level": 2,
                            "comment": "It's more one of those things where if you owe the bank a million dollars it's your problem but if you owe them a billion it's theirs. The collosal malfeasance like before a major recession is frequently not actually illegal, despite it's consequences, but white collar prosecution is actually pretty common in the US, you just don't really hear about it, because much of it doesn't make the news and what does draw a lot of attention moves too slowly through prosecution for the news to care.",
                            "score": 11,
                            "author": "BagNo4331"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, got done for making the underwater breathing mechanic/music - traumatising a generation of kids.",
                    "score": 15,
                    "author": "crosbot"
                },
                {
                    "level": 1,
                    "comment": "Is it? Martha Stewart went to federal prison for 5 months. If you Google, “light” insider trading gets you a prison sentence or 1-2 years in the US. Heavy hitters like Raj Rajaratnam got over a decade in prison (the maximum is 20 years).",
                    "score": 11,
                    "author": "cdstephens"
                },
                {
                    "level": 1,
                    "comment": "Eh, not really. It's not like 2 years is enough to completely destroy is life, well, at least, not any more than he already did by doing this lol. 2 years seem pretty reasonable.",
                    "score": 56,
                    "author": "juh4z",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With this criminal charge and him burning every bridge with companies he's worked for; he may never lead a game project again.",
                            "score": 8,
                            "author": "kingmanic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And Japan has a huge stigma with criminal history. Way more than even the US",
                                    "score": 2,
                                    "author": "KingOfWeasels42"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, he would have been better off just being in possession of [CP](https://www.google.com/amp/s/comicbook.com/anime/amp/news/rurouni-kenshin-nobuhiro-watsuki-arrest-verdict-crime/)",
                    "score": 3,
                    "author": "headbanger1186"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Insider trading is when a person illegally trades in stocks to their own advantage using confidential information. In Naka's case, it was believed that he purchased stock in two developers before plans about games in development were made public so that he could sell it at a later date when it would be worth more.\n\nI've always wondered how could authorities possibly do much against insider trading...\n\nThe one who has the confidential information doesn't even need to buy/sell the stocks himself. It's always been weird to me, in my mind insider trading happens on a daily basis everywhere, and I assume *some* people are caught sometimes, but most of the time not.",
            "score": 10,
            "author": "hidden_secret"
        },
        {
            "level": 0,
            "comment": "I know Balan was terrible but this seems like an overreaction.\n\nOf course he did unleash the Sonic fandom on humanity so that probably qualifies as a crime against humanity.",
            "score": 150,
            "author": "Dagordae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah the sonic fandom does have a large number of bad apples, and in more recent times there's now a faction of them that considers sonic 06 an underated masterpiece somehow, I'm not joking",
                    "score": 55,
                    "author": "mrmehmehretro94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Sonic fandom is hell bent on gaslighting any negativity around Sonic games. Some of the same types that try to discredit negativity around 06 and Forces even go as far as to discredit Mania's popularity as a \"boomer thing\", or it not being canon.",
                            "score": 36,
                            "author": "EnderMB",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If Mania isn't canon then neither is Forces lol. Mania is a direct prequel to Forces XD.",
                                    "score": 6,
                                    "author": "Sarria22"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah and trying to actively rewrite history by claiming that sonic colours brought the \"real dark age\"on the franchise when it was actually the first well received sonic game in years at the time",
                                    "score": 16,
                                    "author": "mrmehmehretro94",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Most people who say that are talking about story quality, which did drop pretty hard until Frontiers.",
                                            "score": 4,
                                            "author": "GreyouTT"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Just call them sonic boomers. They'll get it.",
                                    "score": 16,
                                    "author": "Tidusx145",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This comment is a work of art.",
                                            "score": 3,
                                            "author": "OdinTheAesir"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Because of P06, I assume.\n\nBut the reality is P06 is a different beast entirely.",
                            "score": 8,
                            "author": "remmanuelv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It started before P06 got it's first release I think",
                                    "score": 2,
                                    "author": "mrmehmehretro94"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The amount of Sonic fans that defend 06's story as a masterpiece are basically ousting themselves as having never read a work of fiction written by somebody not completely incompetent at their job in their lives.\n\nYou then also have delusional fans begging for Sonic Adventure 3, which while yes 1&amp;2 are fantastic games, they fail to realize SA3 exists. \n\nIt's called Sonic Heroes. It's 100% a sequel to SA2--one story with every group intertwined in it, the best level in the game is also the first level, almost all of the sound effects are stolen straight from SA2, you collect emblems after levels and side missions like SA1/2, the camera is ass, A rank scoring system functions the exact same way, basic mechanics like the homing attack are a total tossup whether or not they function just like SA2, rail grinding is completely dysfunctional (just like SA2), and after every story you access a final story with the true final boss. Oh and the exact same plot too--Eggman tries controlling a power that rebels against him and is gonna kill everyone. \n\nLike you dense bastards, it's SA3. And here's something more mindblowing for you Sonic fans--SA4 ALSO exists! It's Sonic 06, which also hits every point on that list but leans slightly more to SA1 since it actually has hub areas. Really buggy and incompetent hub areas, but it sure has them!\n\nWhat you actually want is SA5, correctly designed and not hideously incompetent like SA1/2 were.",
                            "score": 12,
                            "author": "DBrody6",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I assume this is because 06 is the only Sonic game written specifically to appeal to furries",
                            "score": 8,
                            "author": "jmdg007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well it's more so because of nostalgia blindness since a lot of the current fanbase were kids when 06 came out",
                                    "score": 9,
                                    "author": "mrmehmehretro94"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "People think the Star Wars prequels are good nowadays. It's nostalgia at the end of the day.",
                            "score": 10,
                            "author": "DemonLordDiablos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The sequels just made the prequels look like a masterpiece + they have aged pretty well with still good looking CGI and the overlying plot is good except for the idiotic lovestory, just some of the writing and characterdevelopment is a mess. Many people that are now grown up will have watched these movies as a child, it's no surprise that they are not as harsh as you on them lol.",
                                    "score": 9,
                                    "author": "Jademond",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The CGI has *not* aged well imo. Compare the SW prequels to LOTR, which in comparison relied much more on practical effects, and there's just no competition. In most cases, LOTR looks much better. Reliance on CGI and green screen is one of the prequels' greatest weakness.\n\nAnd I say this as someone who was 6 when Phantom Menace came out (and loved it), and thought Attack of the Clones was one of the best movies I'd ever seen at the time. I can't even finish AotC anymore due to how bad it is.",
                                            "score": 6,
                                            "author": "420thiccman69",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The guy blamed it on SE for his game being terrible product &amp; threaten to sue them, lol. That's why SE dug up his dirt &amp; paid him back with this.",
                    "score": 9,
                    "author": "asakura90"
                },
                {
                    "level": 1,
                    "comment": "2 years seems very light in that case.",
                    "score": 4,
                    "author": "thatmitchguy"
                },
                {
                    "level": 1,
                    "comment": "Naka was a really big dick at Sega. Most commonly cited cases being the Sonic X-treme engine shenanigans and the Geist Force incident:\n\n&gt; However, Subotnick says Naka assumed that his team didn't understand Japanese, which most of his team was fluent in, including his lead engineer. Naka reportedly started speaking Japanese and talked about which parts of the studio's tech he would take to work on the Sonic franchise. Then, as soon as the studio shipped Geist Force, Subotnick says Naka suggested firing everyone except a single engineer and rolling them into the Sonic team.",
                    "score": 2,
                    "author": "GreyouTT"
                },
                {
                    "level": 1,
                    "comment": "Hell, they should give him 5 more years for Balan",
                    "score": 1,
                    "author": "bennyr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't mess with Japan when it comes to Dragon Quest. They make national holidays out of the mainline releases. Insider trading based on Dragon Quest insider info? Straight to jail.",
            "score": 150,
            "author": "ArchAngelZXV",
            "replies": [
                {
                    "level": 1,
                    "comment": "And yet there are no HD pixel remasters of all mainline games like Final Fantasy.",
                    "score": 28,
                    "author": "HugoRBMarques",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe people didn't complain about the \"Random Resolution Remasters\" they already made like they did with FF.",
                            "score": 6,
                            "author": "Spram2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The problem was not \"random resolutions\". The problem is some FF releases had their sprites so smoothed out, it ruined their artstyles and made them look like generic smartphone shovelware.",
                                    "score": 12,
                                    "author": "HugoRBMarques"
                                },
                                {
                                    "level": 3,
                                    "comment": "Nobody critiques old FF like a FF fan can. DQ fans come across as slightly more chilled out, I don’t know why.",
                                    "score": 1,
                                    "author": "panlakes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe they're not as chilled, maybe Dragon Quest is not as big cultural milestone internationally and so there's not a big community of loud critics.",
                                            "score": 5,
                                            "author": "HugoRBMarques",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is a good point about the community sizes",
                                                    "score": 2,
                                                    "author": "panlakes"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"They make national holidays out of the mainline releases.\"\n\nIt´s a cool story, but it's not true.",
                    "score": 29,
                    "author": "dani3po",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was referring to Japan's unofficial practice of taking the day off on Dragon Quest's launch day, so much [that it's become a major disruption and release days had to be moved to Saturdays](https://www.gameinformer.com/e3-2018/2018/06/13/myth-confirmed-square-enix-talks-selling-dragon-quest-on-school-days). But also, [there is an nationally recognized Dragon Quest Day](https://gonintendo.com/stories/309909-japan-anniversary-association-recognizes-may-27th-as-dragon-ques).",
                            "score": 127,
                            "author": "ArchAngelZXV",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just checked DQ9 and 11 release date in Japan and they were all released in Saturday",
                                    "score": 10,
                                    "author": "samuel9727"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ugh all this DQ talk making me wish for #12.. hope they make it soon",
                                    "score": 3,
                                    "author": "JonZ82",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "The JAA isn't a part of the government. If you read the article it even mentions that.",
                                    "score": -12,
                                    "author": "ThatBoyAiintRight",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He didn't say that they were part of the government? Nor that it was an officially recognised day?",
                                            "score": 19,
                                            "author": "TaleOfDash",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d ask how stupid you’d have to be to get popped for Insider Trading, but it’s Yuji Naka. We know how dumb and petty he can be. \n\nPersonally 2 years is two low, but we can’t legally try him for bad games. Yet.",
            "score": 9,
            "author": "dagreenman18"
        },
        {
            "level": 0,
            "comment": "Jesus. From being a superstar to Balan Wonderland, and now this. He must be really suffering. Poor man",
            "score": 173,
            "author": "mekilat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't feel sorry for him, no one forced him to do insider trading. Plus there have been stories about Yuji Naka for years regarding screwing over other developers. By all accounts, he isn't a particularly likable person.",
                    "score": 466,
                    "author": "Macho-Fantastico",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Him being an asshole is an indisputable fact.\n\nAfter the first Sonic game was made, he actually quit Sega. Mark Cerny, who was about to move back to the US to form Sega Institute of Technology, personally went to his apartment and convinced him to work with him instead. Cerny is also the reason Sonic exists as a franchise, because he pushed hard with Sega on allowing his team to make Sonic 2, with Naka. \n\nIn gratitude, Naka called Cerny and his American developers lazy, caused so much friction and stress that Cerny quit, and then when Naka moved back to Japan to reunite with Sonic Team at Sega Japan, held the technology for Nights into Dreams hostage from SIT (then developing Sonic Xtreme) and bluntly told Sega leadership that he'd quit again if said technology was shared with them.\n\nNaka is all class if you remove the C and L.",
                            "score": 329,
                            "author": "BlueMikeStu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeahhhh… Yuji Naka isn’t so much the guy who created Sonic as he is the guy who ruined Sonic.",
                                    "score": 80,
                                    "author": "we_are_sex_bobomb",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hell, he's easily the worst part about the franchise even back in the old days.\n\nHe and the group that would become Sonic Team basically only worked on the original. Sega Institute of Technology made Sonic 2 and 3/Knuckles (the latter with an all Japanese staff at Naka's insistence), and Sonic CD was developed by the Streets of Rage team as directed by Naoto Ohshima, the other Sonic co-creator.\n\nSonic Team made a decent first Sonic game, let everyone else make the better 2D games, and then rode the nostalgia into Sonic Adventure. They have Sonic's name as their studio name and they're responsible for all the worst games in the franchise. Every time you come across a good entry, it's codeveloped by Dimps or someone else.",
                                            "score": 45,
                                            "author": "BlueMikeStu"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I believe you, but do you have a more detailed source for the story? Really want to read up on this bit of SEGA history.",
                                    "score": 45,
                                    "author": "thr1ceuponatime",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I read the bit about Night's engine being used for Xtreme and Naka going nuts when he found out, in an old issue of Retro Gamer.",
                                            "score": 27,
                                            "author": "Furinkazan615"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "For those unaware, Cerny then went on to lead the design of the PS4 and PS5. \n\nKind of an insane arc. From being insulted and chewed out by Naka to creating the dominant console in the industry. Also interesting how he went from software to hardware.",
                                    "score": 47,
                                    "author": "your_mind_aches",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cerny has more accolades than that, that's a long skip. But damn am I thankful for him for steering Sony in the right direction on hardware design after seeing what a disaster PS3 was for a few years going with the cell processor. He made that decision to go with off the shelf parts and an architecture developers actually had experience with. Thank god.",
                                            "score": 29,
                                            "author": "SuchAppeal",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't forget knack.",
                                            "score": 17,
                                            "author": "Don-Tan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And solo developed marble madness.",
                                                    "score": 10,
                                                    "author": "kingmanic"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He once threatened, in Japanese, to fire a whole department and steal their tech for their own game\n\nSome people there spoke Japanese, told the others and everyone quit and their game never came out.\n\nOr the time he said he’d rather Sega die than leave the console market because he wanted to develop for consoles. Or when told that Sega consoles were failing in the west accused the marketing executive of lying and doctoring footage and focus group responses to the point the man just cursed him out and later quit…and went on to lead the launch of the XBox",
                                    "score": 22,
                                    "author": "snakebit1995"
                                },
                                {
                                    "level": 3,
                                    "comment": "Damnit and I'm an ass guy.",
                                    "score": 33,
                                    "author": "ezone2kil",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "But the dungeon graphics he coded for Phantasy Star 1 are pretty sweet though",
                                    "score": 3,
                                    "author": "Hattes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah honestly I don’t feel sorry for a man who committed crimes this blatantly",
                            "score": 22,
                            "author": "konumo"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Don't feel sorry for him, no one forced him to do insider trading.\n\nAnd no one forced him to make Balan Wonderland, which some may consider to be the real crime.",
                            "score": 84,
                            "author": "TheIllusiveGuy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love how Balan Wonderworld is such a bad game that nobody bothers to remember its actual name at all lmao.",
                                    "score": 67,
                                    "author": "missing-pigeon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It doesn’t help that Wonderland would have been a better name for it than Wonderworld",
                                            "score": 37,
                                            "author": "randompersonE",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah but that's all Japanese transliterated titles. Like, \"Death Note\" is a  mistranslation. It's supposed to be Death Notebook. But Death Note sounds cooler and more poetic.",
                                                    "score": 4,
                                                    "author": "your_mind_aches",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's not at all relevant to Balan Wonderworld. Unlike ノート which would be translated as notebook, ワンダーワールド would neither be transliterated nor translated as wonderland.",
                                                            "score": 26,
                                                            "author": "Furin"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He didn’t have to do insider trading. Seems like he’s getting what he deserves. If only we were this strict with insider traders in the US.",
                    "score": 188,
                    "author": "ThatGuyNamedJoey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;this strict with insider traders in the US.\n\nThen US politicians would be screwed. Heck, Nancy Pelosi would be destroyed by this",
                            "score": 34,
                            "author": "Hopeful-for-EE-Movie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In a perfect world…",
                                    "score": 50,
                                    "author": "ThatGuyNamedJoey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Men like me... would not exist",
                                            "score": 10,
                                            "author": "Lazydusto"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Dumb comment",
                                    "score": 3,
                                    "author": "carl_pagan"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m not even a Nancy Pelosi guy but the fact that you guys are accusing someone seeing 4% ROI of insider trading just shows how stupid &amp; propagandized the general public are.",
                                    "score": 11,
                                    "author": "Dougiethefresh2333",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The real argument should be whether legislators should be allowed to own stocks at all, given their influence over the laws that affect any given market.",
                                            "score": 17,
                                            "author": "rKasdorf"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "the fuck do the likes of you talking about,\n\n&gt;https://www.reddit.com/r/wallstreetbets/comments/119277a/nancy_pelosis_100m_stock_portfolio/\n\nYou too could have trippled your money by just investing in FAANG and Visa post 2008.\n\n&gt;https://www.reddit.com/r/wallstreetbets/comments/10l98o3/pelosi_strikes_again/",
                                    "score": 10,
                                    "author": "The_Keg",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't even think she's top ten in the house. There's far bigger outperformers",
                                            "score": 21,
                                            "author": "ReallyNiceGuy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean it would be impressive if she is even top 50 in the Senate since she was elected to the House of Representatives.",
                                                    "score": 15,
                                                    "author": "Ipokeyoumuch",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Nancy Pelosi hasn't committed insider trading.\n\nEdit: to clarify, broadly, insider trading is making trades on the stock market based on confidential information.\n\nThe entire process in which laws are passed in the United States is public information, from introductions in committee to votes on the house and Senate floors. ~~Furthermore Pelosi's trades are also public information that literally anyone could mimic.~~\n\nWhat's not inside trading: buying stocks in Nvidia during the months long process in which the government passed the CHIPS act for microchip manufacturing in the US\n\nWhat is insider trading: say the CEO of Nvidia was indicted by a grand jury and you either worked in the case or knew someone involved, so you traded your stock before the indictments became public. Grand juries are sealed and therefore confidential.",
                                    "score": 11,
                                    "author": "LightbringerEvanstar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\n&gt;The entire process in which laws are passed in the United States is public information, from introductions in committee to votes on the house and Senate floors. Furthermore Pelosi's trades are also public information that literally anyone could mimic.\n\nI can tell you haven't traded a single stock in your life, because by the time her trades are a  public information the pump is already in full swing and you'd be a fool to buy that high.",
                                            "score": 8,
                                            "author": "Seek_Adventure",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Forgive me, I don't pay attention to Nancy Pelosi's trades much. It was a minor point anyway.",
                                                    "score": 1,
                                                    "author": "LightbringerEvanstar"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You're right,  he shouldn'thave. It's also possible to have empathy for the pain that someone is going through, and still think they did bad things. I feel sorry for him.",
                            "score": -30,
                            "author": "mekilat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yuji Naka is the guy who sabotaged other developers' careers, pushed for entire teams to be fired after taking their tech, and refused to allow other internal teams at Sega to use the same tools and technology his team had access to. \n\nYou don't need to feel sorry for him, he inflicted plenty of misery on others, and two years in prison is not the end of the world.",
                                    "score": 95,
                                    "author": "Jazz_Potatoes95",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is the first I’ve heard of any of this (because I haven’t been paying attention). Is there a worthwhile source to read more?",
                                            "score": 5,
                                            "author": "selfish",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All of the above is widely documented across various reputable media sites, via interviews with Naka and other developers. I don't have time to provide links, but a quick Google will provide you a bunch of sources on the above.",
                                                    "score": 23,
                                                    "author": "Jazz_Potatoes95",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; It's also possible to have empathy for the pain that someone is going through\n\nSure, the first few times. The guy has always been described as an utter dick to work besides/under. At some point, my benefit-of-the-doubt has to run out.",
                                    "score": 8,
                                    "author": "Carighan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Poor financial criminal :(",
                    "score": 24,
                    "author": "RaduW07"
                },
                {
                    "level": 1,
                    "comment": "Mr. Yuji Naka is not alright, and most likely never was, as evidenced by all the stories that have come out about him.",
                    "score": 27,
                    "author": "VarioussiteTARDISES"
                },
                {
                    "level": 1,
                    "comment": "I still think Balan Wonderworld was a lower point.",
                    "score": 11,
                    "author": "Meret123"
                },
                {
                    "level": 1,
                    "comment": "He did a crime so he got punished, he isn’t rich enough to be above the law.",
                    "score": 9,
                    "author": "Flagrath"
                },
                {
                    "level": 1,
                    "comment": "And to think, people used to put this guy on Miyamoto's level. It's like two totally opposite trajectories.",
                    "score": 5,
                    "author": "SuchAppeal"
                },
                {
                    "level": 1,
                    "comment": "Balan Wonder*world*, you silly billy.",
                    "score": 2,
                    "author": "TKDbeast"
                },
                {
                    "level": 1,
                    "comment": "Wonderworld. And man blue mascot platformer characters have it rough when it comes to their creators, first Inafune and now this.",
                    "score": 3,
                    "author": "Kingnewgameplus"
                },
                {
                    "level": 1,
                    "comment": "Honestly, this was an absolutely unforgivable crime and he deserves life in prison for it. Oh, and insider trading is pretty bad too I guess.",
                    "score": 4,
                    "author": "DrSeafood"
                },
                {
                    "level": 1,
                    "comment": "He was good at two things. Low level programming and taking all the credit. He was an infamously terrible person and incompetent manager. \n\nOnce he didn't have hyper talented people to leech off of and his coding skills didn't mean anything he was just an abject failure and a terrible person.",
                    "score": 1,
                    "author": "kingmanic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty sure that title is fake. He was one of the programmers of the original game but he isn't the creator any more than a dozen other names are.",
            "score": 16,
            "author": "piclemaniscool",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Better be for not adding the chao game in sonic adventure 2 in other sonic games. Should be a criminal offense 💀",
            "score": 2,
            "author": "Tom-Pendragon"
        },
        {
            "level": 0,
            "comment": "Can anyone ELI5 insider trading for me. And why this dude is getting arrested for it but in America everyone and their brother does it?",
            "score": 1,
            "author": "solidshakego",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's making stock moves based on insider only knowledge. IE he bought a bunch of stock in a no name studio because his connections told him they're making a Dragon Quest game, IE the most popular game series in Japan. Typically executives who own stock in their own company are supposed to announce long in advance their stock moves to avoid accusations.",
                    "score": 2,
                    "author": "Clamper",
                    "replies": []
                }
            ]
        }
    ]
}