{
    "id": "13xie12",
    "score": 165,
    "title": "Etrian Odyssey Origins Collection — Launch Trailer | Nintendo Switch, Steam",
    "author": "Turbostrider27",
    "date": 1685628090.0,
    "url": "https://www.reddit.com/r/Games/comments/13xie12",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Whoever decided this should be $80  for all 3 should be slapped.\n\n  \nOnce I learned it was $40 each my interest dropped so fucking hard.",
            "score": 101,
            "author": "Frequently_Bashful",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea if they were smart they'd get $60 from a lot of people, going for $80 is just greedy and I think will bite them in the ass.",
                    "score": 21,
                    "author": "traxfi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, that extra $20 is why I didn't buy the games even though I've heard a lot of good stuff about the series.",
                            "score": 5,
                            "author": "messem10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "These games have a special place in my heart and i highly recommend them to someone interested in hardcore RPG games with expansive team building, there's not many like these games in the market. The map making also adds another layer to the game, making exploration a puzzle itself that you uncover yourself as you master the dungeon.\n\nBut i certainly will tell you not to spend 80 bucks on them. The price is a complete rip off.",
                                    "score": 5,
                                    "author": "cheekydorido"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I figured maybe twenty per game, sixty for the entire collection. That was on my high-end estimate given what these games seem to be.",
                    "score": 47,
                    "author": "Hawk52"
                },
                {
                    "level": 1,
                    "comment": "Yep, this exactly.  At $40 for the set, this would have been a no-brainer. If they'd included the extra content from the 3DS remake/re-release, I'd probably have paid $60 for the set.  At $80, I'll wait for a 50% off sale.\n\nI just hope that if this doesn't sell as well as they'd like, that they take away the right message from that. More often than not, these kinds of companies assume that \"lack of sales\" means \"lack of interest\". I'm definitely *very interested* in these games, but the price has pushed me away.",
                    "score": 4,
                    "author": "yukeake"
                },
                {
                    "level": 1,
                    "comment": "If there's one lesson I've learned from reddit it's that every time there's an overpriced game everyone on here will complain and claim they're boycotting the game and then the game will sell like *crazy* and the complainers will begrudgingly buy it on sale. Not saying you're wrong, but this isn't exactly a case like Forsaken or Redfall.",
                    "score": -3,
                    "author": "iWriteYourMusic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think reddit is right in this case. This is a very niche, hardcore turn based rpg series, priced at a premium despite just being upscaled ports of DS games. These aren’t even the updated 3DS versions that have 3D graphics.",
                            "score": 28,
                            "author": "Dat_Dragon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course they're right! But being *right* doesn't mean they won't buy it anyhow. These are great games on a system that has a lack of dungeon crawlers on a platform known for charging a premium for content. I'll bet they sell fine and then go on sale.",
                                    "score": -13,
                                    "author": "iWriteYourMusic"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not always \n\nPeople complained on reddit when Square released a bunch of smaller scale titles for $60. [Turns out that they ended up selling poorly](https://www.rpgsite.net/news/13882-square-enix-says-forspoken-sales-have-been-lackluster-and-many-small-and-mid-sized-titles-did-not-perform-as-well-as-we-had-expected)",
                            "score": 12,
                            "author": "planetarial",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This website is aids on mobile. Basically a 3 paragraph article with massive ads everywhere. What an awful experience.",
                                    "score": 2,
                                    "author": "parkesto",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you use Android, you can switch to Firefox. \n\nFirefox on Android lets you install extensions/addons, and that includes uBlock Origin. IMO it's just as good as the desktop version in terms of ad blocking.",
                                            "score": 1,
                                            "author": "crazeman"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To be fair, Square Enix outwardly claims every damn release of theirs to be a financial flop",
                                    "score": -3,
                                    "author": "iWriteYourMusic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Over time, this has become almost a meme.  SquareEnix seems to *always* have unrealistic expectations for sales, especially in the US market.",
                                            "score": 1,
                                            "author": "yukeake"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You assume that most gamers are on Reddit, which they definitely aren’t.",
                            "score": 0,
                            "author": "1OneQuickQuestion"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Extremely interested in this but never played one before. It looks fully turn based in movement and combat, and they've added in auto mapping in this release? Is that right? Anything else I should know before potentially going in?\n\nEdit: Holy shit the price for each game, that caught me off guard.",
            "score": 42,
            "author": "Hawk52",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, that price is to milk fans of the series. Those games are amazing, but not a that price.",
                    "score": 59,
                    "author": "DuckofRedux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you only get one of these, fans will likely recommend 3. It is one of the most polished and beloved games in the series while 1 and 2 had a lot more issues (although apparently they fixed some of them for this release)",
                            "score": 21,
                            "author": "Zeph-Shoir"
                        },
                        {
                            "level": 2,
                            "comment": "I imported the physical version for $70, $10 cheaper than the digital version. Have to pay for the shipping fees though",
                            "score": 3,
                            "author": "samuel9727"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Know that it's *difficult.* These are really, *really* hard games. By design you'll avoid most high level encounters, and once you hit a roadblock you'll head back and start hunting them.",
                    "score": 13,
                    "author": "WillemDafoesHugeCock",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "While this is absolutely true for the original games, this version *did* add difficulty options to each game.  The hardest difficulty, Expert, matches the original release but there are two new options if you're not looking for as much of a challenge (and from what I remember of when I tried the easier difficulties in the Untold versions, the lowest one was very easy).\n\nI'd still recommend trying Expert, but it's more accessible now if you're not looking for something that hard.",
                            "score": 7,
                            "author": "Eldryth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is the difficulty selection set for the save file or can you adjust it like several dungeons in?",
                                    "score": 1,
                                    "author": "Do_It_USSR",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can change it.  Might have to be in town to do it but I'm not sure about that.",
                                            "score": 2,
                                            "author": "Eldryth"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I was thinking about picking these up, until I saw the price. And *then* I saw that Mary Skelter 2 was on sale for ten bucks in the eShop, and picked that up instead.\n\nIs an Iffy game as good as an Atlus game? Probably not. But given the price difference, I'm happy.",
                    "score": 6,
                    "author": "APeacefulWarrior",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mary Skelter 2 is well liked within the genre, it's also 2 games in 1, so yeah it's a pretty good deal.",
                            "score": 7,
                            "author": "ProudPlatypus"
                        },
                        {
                            "level": 2,
                            "comment": "I'd say EO is the premier DRPG series. But Mary Skelter 2 is definitely solid and worth picking up. And MS2 also comes with the first game included (though the recommended order to play is MS2 and then MS1). Enjoy!",
                            "score": 4,
                            "author": "yuriaoflondor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you already find manual mapping tedious, I'd advise against playing without some sort of basic character skill guide open in a browser tab. At least when when it comes to understanding character classes, going 100% blind is a sure way to hit frustrating realisations by the midgame. That's because even if you get an UI preview of what's later down a character's ability tree (which is not a guarantee), the exact effect of abilities is described in-game in rather vague terms (e.g. \"Repeated katana slashes from the overhead stance\" or \"Pulsing beat that increases the party's strength\") - rather infuriating for a game that asks precision from its players - and the progression of these skills upon levelling up doesn't follow a linear (or predictable) pattern. Which would be fine if you could cheaply experiment to retroengineer how things exactly work; except respec-ing characters whenever you realise an ability doesn't exactly work as you thought it would (so, most the time) is a one-way ticket to grindland.  \n  \n(And to your edit - yup, this seems to be a niche coming (rightfully or wrongfully) to the conclusion that it's a ultraniche, pricing accordingly to the expected low volume of sales and low competition, and uninterested in onbarding (and disappointing) people who aren't 100% confident this is their jam.)",
                    "score": 3,
                    "author": "Clairval"
                },
                {
                    "level": 1,
                    "comment": "Sadly it is an Atlus game, which means it will be milked to the high heavens. The series is solid though and in my opinion the best dungeon crawler series out there in terms of gameplay.",
                    "score": 1,
                    "author": "Soderskog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I say this as a fan who owns all of the DS and 3DS games, this collection of upscaled DS games should be 50$ and the individual releases 20$ at most.",
            "score": 18,
            "author": "Anxious_Temporary",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not even sure why they chose these particular versions for the re-release, and not the 3DS versions that had updated visuals. Especially at this price point…Hell, at this price, I’d expect both versions of the games with the option to choose.",
                    "score": 5,
                    "author": "Dat_Dragon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; and not the 3DS versions that had updated visuals.\n\nThe extra weird part is that the 3DS versions aren't *just* updated visuals. Each 3DS remake has a brand new story-focused mode and additional content in the form of a new class.  \n\nI love the series, but there's no way I'm picking up 1 and 2 again. I *might* pick up 3 if it ever goes on sale simply because I never actually owned (I borrowed a friend's copy back in the day).",
                            "score": 4,
                            "author": "yuriaoflondor"
                        },
                        {
                            "level": 2,
                            "comment": "Never played the Untold games, but don't EO fans hate those two games?",
                            "score": 2,
                            "author": "Rizzan8"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's cheaper to import the multi-language physical copy than it is to buy it digitally. Wild. (Cheaper =/= cheap, though... Also I'm in the UK.)",
            "score": 3,
            "author": "AdditionalStickers"
        },
        {
            "level": 0,
            "comment": "I strongly suggest playing the Etrian Odyssey games on DS/3DS if possible. The big appeal of these games (compared to other dungeon crawlers) is that you can draw your own maps. They're right at home on DS/3DS with two screens and a stylus, but will be significantly clunkier on a single screen with a keyboard + mouse or controller. To the point that automapping will likely become the ideal way to play, which strips out a huge portion of the games' identity. That and these ports are ludicrously overpriced, $40 per game or $80 for the bundle, for bare minimum remasters of old games.\n\nIt's sad because I do want to see the franchise succeed, but I just can't imagine it having a future on modern platforms. These games were made for the DS/3DS dual screens.",
            "score": 9,
            "author": "BlishBlash",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you don't mind me asking, what exactly does having to map your own maps add to the game's identity? Cause that's a huge turn off to me compared to auto mapping. That's a major reason I don't play many of the old school 1st person dungeon crawlers.",
                    "score": 6,
                    "author": "Hawk52",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It makes the exploration feel much more personal. On the surface level, yeah, it's an extra layer of work - you have to map what's there, so you know for your next run. Walls, one-way paths, FOE paths, farm spots, dungeon mechanics like pitfalls or whatever. That's what you start with, and it does seem like a pain.\n\nBut as you get used to drawing the lines for the paths, then realizing there's a secret route, so you mark it, and over time, each floor's map changes from the \"default\" semi-automap you've made, to this detailed bit of your personal RPG narrative (almost). I liked to mark where I've had trouble, or where the FOEs gang up on me, or areas I still need to check out, or great farming locations. When I move on from a floor, it feels like I explored this area and learned it in full, and it's satisfying. \n\nPlus, using the stylus has this nice \"writing\" sound when drawing walls, and that experience is still, STILL, so unique. I'm trying to find my Super Mario Maker 2 stylus, to use with the Switch version of the HD remasters. \n\nIt's just so specific, and it doesn't make the game easier for pick-up-and-go gameplay. But the end result is an RPG satisfaction that is actually unique for EO.",
                            "score": 17,
                            "author": "ohgoditsabear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, there were many maps like mine, but the map I drew was my map. \n\nIt also gave a nice sense of discovery as map drawing skill sorta evolved as you got deeper. Nothing like returning to the early levels and realising you were using the sparkly symbol for teleport traps instead of the number symbol system established when they became more complex.",
                                    "score": 4,
                                    "author": "accoil"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "With the way it was implemented and the form factor of the DS/3DS, it just *felt* right. The game will be just as fun with automap IMO. Those prices are crazy however.",
                            "score": 4,
                            "author": "BL4ZE_"
                        },
                        {
                            "level": 2,
                            "comment": "I’d assume nostalgia for the most part. \n\nModern dungeon crawlers have auto mapping and auto navigation to take a lot of the tedium out of mapping and back tracking. The map is still blank from the start",
                            "score": 3,
                            "author": "SpeckTech314"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some of the decisions in this collection actually baffle me. Why use the OG versions of the game when they have the untold versions that have a storyline and QoL/balancing? Why pay for denuvo on each game when there are dozens of ways to obtain the original versions for the DS/3DS? Why charge $60CAD for each game? \n\nLike these are amazing games but this is a trash collection.",
            "score": 2,
            "author": "marksteele6",
            "replies": [
                {
                    "level": 1,
                    "comment": "They accidentally uploaded the collection without denuvo too, so all that money they burned for denuvo just got wasted",
                    "score": 2,
                    "author": "planetarial"
                }
            ]
        }
    ]
}