{
    "id": "13xjn5p",
    "score": 37,
    "title": "The Expanse: A Telltale Series preview — Trust your gut before your head gets in the way",
    "author": "HeinieKaboobler",
    "date": 1685631214.0,
    "url": "https://www.reddit.com/r/Games/comments/13xjn5p",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Cautiously optimistic about this! Exploring in zero-g and using mag-boots to walk through wrecked ships could be super cool. Hopefully they can nail the vibe of the source material.\n\nInteresting to hear that its actually made by Deck Nine, who did two favorably received games in the Life is Strange series.",
            "score": 15,
            "author": "icecreamsocial",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is the source material worth digging into? I tend to put long book series at the bottom of my backlog because there are so many standalone novels or shorter series available to read, but I keep hearing about The Expanse and tempted to pick up Leviathan Wakes.",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Definitely worth checking out! The tv show is great too. While it doesn't cover all the books, it stops at the logical end point for the story arcs it covers.",
                            "score": 9,
                            "author": "icecreamsocial",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh rad, I've got so many freaking TV shows recommendations from people I trust, The Expanse being one of them. I don't know how I'm ever going to find the time.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The books are really good, I'd highly recommend them. The audio book narration is also fantastic if you're into that. As for the side stories, they're supplemental but worth reading. They have a collection where they're all in the same volume now, so you wouldn't need to buy 8 or however many there are smaller books.",
                            "score": 3,
                            "author": "FriscoeHotsauce",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love audiobooks! Thanks for the rec.",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I read the whole series top to bottom. Great sci-fi comfort food. Very easy read, too",
                            "score": 2,
                            "author": "malnourish"
                        },
                        {
                            "level": 2,
                            "comment": "From what I understand, this game has more roots in the TV adaptation, which is available on Prime.",
                            "score": 2,
                            "author": "spamjavelin"
                        },
                        {
                            "level": 2,
                            "comment": "I'm not generally a huge fan of sci-fi. I like Mass Effect. I like Firefly. I can respect Star Wars, Star Trek, etc for what they are but don't particularly care for them. \n\nI fucking loved The Expanse.",
                            "score": 2,
                            "author": "Divio42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh dang, are we talking TV show or books?",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Both. Well, audiobooks for me. I started with the show - seasons 1-3 before Amazon continued the series. Loved it so much that I picked up the audiobooks. \n\nI like the setting and the characters. Scifi always has to strike a balance of where the viewer has to suspend their disbelief. Star Wars is straight up space fantasy to me. While not totally, The Expanse is more grounded in reality.\n\nIt takes place in our reality, just a few centuries in the future. They even pay some consideration to the laws of physics. Things like ship acceleration and the effects it has on thrust gravity and even the human body. Or the effects that growing up in zero g has on the human body. Though the books do a better job than that as it's pretty hard to find enough tall lanky people to play as actors to the people growing up in the asteroid belts. Even the way the ships are designed has ruined other scifi for me - stacked more like office buildings where the nose of the ship is up and the thrusters are down, to account for the fact that as you accelerate it generates thrust gravity. As opposed to most other scifis where ships are built more like airplanes where the nose is facing forward for everyone.\n\nThen there's the politics - very well written about political struggles, war, and even poverty among the factions - notably Earth, Mars, and the Asteroid Belt (Belters). Belters being the systematically oppressed people who have to pay even for the oxygen they breathe. They went as far as to work with linguist to develop a Belter creole language. The main character of this game is one of the Belters.\n\nBoth the books and the show are well worth it to check out.",
                                            "score": 1,
                                            "author": "Divio42"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}