{
    "id": "13yuyj4",
    "score": 352,
    "title": "Day in the Life of a Japanese Street Fighter 6 Game Planner",
    "author": "Ksma92",
    "date": 1685752492.0,
    "url": "https://www.reddit.com/r/Games/comments/13yuyj4",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Still waiting for Paolo to do a \"Day in the life of a yakuza\".\n\n*Look guys, Hiroshi is is going to show us how to make an ashtray using only a cigarette and a snitch's tongue.*",
            "score": 100,
            "author": "BrassMoth",
            "replies": [
                {
                    "level": 1,
                    "comment": "“HEYYYY WHAT DO YOU DO HERE????”",
                    "score": 36,
                    "author": "The_Leisure_King",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AND THIS IS WHERE THEY CUT THEIR PINKIES OFF! LET’S WATCH!",
                            "score": 23,
                            "author": "romeopwnsu"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah you have wetshaving eletric razors.",
                    "score": 10,
                    "author": "Top_Ok"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I use a OneBlade and it's incredible. No more irritation.",
                    "score": 2,
                    "author": "oxygen_addiction"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watching this was an absolute treat. Getting to see the behind the scenes development makes you appreciate the final product that much more!",
            "score": 52,
            "author": "RVP_20_"
        },
        {
            "level": 0,
            "comment": "I love seeing A day in the life on his channel and seeing a game company again after bandai namco and square enix is great, even more with capcom. Would be nice if he was able to get into more of the other companies because its always cool to see the inside of the studios.",
            "score": 31,
            "author": "brzzcode"
        },
        {
            "level": 0,
            "comment": "Despite this guy's overly enthusiastic tone, this was a nice look in the company's backroom. It's very exciting to see how much the crew working on the newest SF is putting their hearts in developing the game. Can't wait to buy the game when my financial situation allows for it.",
            "score": 19,
            "author": "BCslav"
        },
        {
            "level": 0,
            "comment": "This guy's day in the life videos are great. S lot of his videos are awesome. Used some of them to help plan my Japan trips",
            "score": 9,
            "author": "wobblydavid"
        },
        {
            "level": 0,
            "comment": "bandai namco one was really nice to see the variety of games. I tried looking hard but it seemed like it was just street fighter everywhere. I guess I shouldn't have expected more because this video title was so specific but still.",
            "score": 6,
            "author": "TheEnlightenedOne212"
        },
        {
            "level": 0,
            "comment": "I thought Capcom did not want players to be using a Hitbox as much as possible? Their own developers are actually using it based on the video.\n\nhttps://www.youtube.com/watch?v=M6hf4Ll_WkE&amp;t=944s",
            "score": -7,
            "author": "hidedatdiscordtech",
            "replies": [
                {
                    "level": 1,
                    "comment": "they don't want advantages based on a certain controller. They disallow controllers which decide the input at the hardware level (which is what hitbox did up until a hardware update), and instead allow controllers which let the input be made at the game level, which makes it fair for all controllers.",
                    "score": 11,
                    "author": "MikeDunleavySuperFan"
                }
            ]
        }
    ]
}