{
    "id": "140he86",
    "score": 875,
    "title": "Geoff Keighley: Thursday, Summer Game Fest is LIVE! Here's the hype trailer I edited to highlight great games so far in 2023 and get us in the mood for a big gaming summer.",
    "author": "Turbostrider27",
    "date": 1685894503.0,
    "url": "https://www.reddit.com/r/Games/comments/140he86",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I'm surprised by the negativity in the comments here. Having enjoyed the shared hype of E3 for many years, I appreciate him trying to capture some of that spirit. It's a harmless and fun event which doesn't affect anyone who doesn't watch in the slightest - the trailers show up on YouTube pretty immediately. \n\nGood for him, I say.",
            "score": 409,
            "author": "Tarcion",
            "replies": [
                {
                    "level": 1,
                    "comment": "However much or little you enjoyed it, losing E3 (most likely for good) was bad for the industry. One dude is actually trying to recapture what it stood for at least in some form, and the gaming community just goes \"nah, fuck off!\"",
                    "score": 221,
                    "author": "JmanVere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I miss E3 season. Watching all the press conferences compressed in one week used to feel like a genuine celebration of gaming that happened once a year. Regardless of all the cringey corporate bs, it was special.",
                            "score": 83,
                            "author": "-LaughingMan-0D",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I used to watch the whole thing on G4 every year. It really felt like a celebration!",
                                    "score": 4,
                                    "author": "ThisIsRyGuy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For me it was the Giant Bomb E3 commentary, good times",
                                            "score": 2,
                                            "author": "-LaughingMan-0D",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Giant Bomb was really good too. I miss those days",
                                                    "score": 2,
                                                    "author": "ThisIsRyGuy"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I miss it too. It was so funny.",
                                    "score": 5,
                                    "author": "Hazakurain",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You ever wonder what the bottom of an avatar's foot looks like?",
                                            "score": 2,
                                            "author": "Dasnap"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Agreed. Although I don't nessecarily agree that losing E3 is bad for industry (it was mostly aiming toward shareholders anyway.) I do think that some form of event like E3 still have its place and need to exist in some form or another.\n\nThis is an era of indie gaming and event like this does wonder for Indie gems discovery. Not every game is gonna become the next Stardew Valley. And while I do agree that too much of that make the event feel lame as hell (Sorry, Sony) I think not having it at all will make me missed it entirely. \n\nAnd I think that in the end, it simply just does more harm than good for dev team that doesn't have marketing power like big corporate one.",
                            "score": 8,
                            "author": "dadvader"
                        },
                        {
                            "level": 2,
                            "comment": "Losing whatever E3 has become recently has been zero loss.\n\nYeah, E3 of decade ago sure, would be nice to have something like that back.",
                            "score": 7,
                            "author": "Specialist_Duty5736",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bro, 2018 Sony E3 showcase was their best.\nNone of Sony's showcases have been great after that. \n\nNo showcase have the same festivities and pomp.\n\nFor 2018, Sony had live orchestra and showed off Spiderman, Ghost of Tsushima, TLOU2.",
                                    "score": 39,
                                    "author": "fxzkz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "2016 was pretty crazy too IIRC.\n\nYeah E3 was far superior to those showcases, they knew to bring everything here to \"compete\" in a way. \n\nThe weird thing is that even if it's online and not the same location, many publishers still do their stuff at the same time (Sony was a little early but still in that period) and you got MS, Devolver, avrious third party shows (SGF, PC Gaming show), Devolver and Ubisoft. So you'd think those would try to \"compete\" and show their best. \n\nBut they often don't really do it. At best you get a few exciting things but not a full great show",
                                            "score": 13,
                                            "author": "Radulno"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wasn't that also the show that was an absolute disaster in show planning?\n\nI remember that they extremely long breaks in between segments because they had multiple themed showrooms planned but moving the crowd of attendees and the stream setup proved to be difficult, so stream viewers had to wait an eternity.\n\nI think the scrapped the concept after the first location change and just presented the rest of the show from the TLOU2 themed ball room.\n\nThe games were great but the show itself had problems. So I wasn't surprised that Sony decided to stop doing in-person shows at E3 back  then.",
                                            "score": 5,
                                            "author": "RoLoLoLoLo",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That was 5 years ago. I don't see how that invalidates what you replied to. E3's plan to stay relevant (before covid happened) was to have social media and influencer circlejerk for a couple days. Hardly something to cry over.",
                                            "score": -1,
                                            "author": "hery41",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;That was 5 years ago. I don't see how that invalidates what you replied to.\n\nThe comment they replied to said \"decade ago\", 5 years ago is not a decade.\n\nAlso, 2018's E3 was the third last E3 in history. 2020, 2022 and 2023 were all canceled and 2021 was online-only, limited in scope. If we talk about E3 events, 2018 was one of the most recent ones.\n\nYes, many of the old E3's were better, but even the last few ones were cool (maybe besides 2021 for obvious reasons). Unlike many people here, I appreciate what Keighley is trying to do, but SGF is still far off in terms of production value and attendance from even the below-average E3's.",
                                                    "score": 5,
                                                    "author": "stonekeep",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We're talking about one (1) conference (not even full show) in that decade time span. Is that worth doing the whole reddit pedantry spiel?",
                                                            "score": 1,
                                                            "author": "hery41",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I would agree with you if it was 9 years ago and I said \"ackshually it wasn't a decade ago\". But that's not it.\n\nThe person implied that only the \"old\" E3's were good. Meanwhile, 2018 E3 is one of the newest ones.\n\nIt's not being pedantic, those are just two very different things.\n\nI also only just realized that the two comments I replied to are from you. That wasn't on purpose.",
                                                                    "score": 5,
                                                                    "author": "stonekeep"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "tell you gamers deserve it",
                            "score": -6,
                            "author": "CardAble6193",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "deserve what? Not being choke-fed lies because every publisher had to cook up some cinematics to compete in the same time frame every year for the last 20?",
                                    "score": 4,
                                    "author": "Toannoat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "you can prefectly enjoy some cinematics while knowing clearly its not gameplay, and sometimes they show gameplay",
                                            "score": 18,
                                            "author": "CardAble6193",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;and sometimes they show gameplay\n\nyou mean the \"In-Engine Footages\"? \n\nHonestly whatever, yea, they can be enjoyable, but framing E3 being gone as anything but a net-positive in the pro-customer direction is dishonest. Had this not happened, the people who would go \"hah get that gamers!\" now would be saying \"ugh gamers are so gullible for falling for these trailers\", it's contrarian behaviour.",
                                                    "score": -9,
                                                    "author": "Toannoat"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How was it bad for the industry? AFAIK most developers prefer not being forced to prepare something for E3.",
                            "score": 1,
                            "author": "Dealiner",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Who is complaining? I don’t see any complaints anywhere.",
                            "score": -4,
                            "author": "weglarz"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;I'm surprised by the negativity in the comments here. \n\nit's all bark and no bite, they will all watch the show or watch the most popular segment but will still complains about it",
                    "score": 79,
                    "author": "Alastor3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why is Reddit for if not complaining?",
                            "score": 5,
                            "author": "Radulno"
                        },
                        {
                            "level": 2,
                            "comment": "The trailers and gameplay will be posted here and on overview sites.",
                            "score": 3,
                            "author": "MumrikDK"
                        },
                        {
                            "level": 2,
                            "comment": "Suffering the cringe to get to trailers you want is time-honored  tradition, doesn't mean we should be happy about it.\n\nOr just https://gamesrecap.io I guess",
                            "score": -1,
                            "author": "Specialist_Duty5736"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I have no clue why Keighley always gets *this* much hate in the lead-up to both SGF and TGA. I don't really remember what it was like the time before last, but most discussion threads for last year's TGA were surprisingly positive.\n\nLike, I get that this no one likes a shitton of ads and streamers with the most grating personalities in gaming, but deals like that is what gets you money to finance events like this. Sure, it's not ideal, but a lot of the hate this guy gets is borderline irrational, just nonsense being thrown around by people who have no idea how difficult it must be to organize something like this - getting a ton of publishers, developers, even \"creators\" to sign up for something where *their* brand or *their* product isn't the main thing, but part of something larger, something that's a big plus for both fans and the industry at large. \n\nE3 could suck ass (and a lot of the time, it did), but I'd be lying if I said I didn't miss it. If Keighley wants to try and bring it back, more power to him. This is all just... fun, ya know? It costs you, the average viewer, nothing. If you're not into it, just don't tune in.",
                    "score": 28,
                    "author": "AT_Dande",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Like, I get that this no one likes a shitton of ads and streamers with the most grating personalities in gaming, but deals like that is what gets you money to finance events like this.\n\nSo you **do** understand why those events get the hate.\n\n&gt;E3 could suck ass (and a lot of the time, it did), but I'd be lying if I said I didn't miss it. \n\nThe one thing I miss about is TotalBiscuit's snarkathon laughing at the industry but, well, both are dead now :(",
                            "score": -15,
                            "author": "Specialist_Duty5736"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People just really can't get past things like ads and that some selling out has to be done in order to run these large events. It's pretty obvious how genuinely passionate Geoff is about gaming and bringing it to the forefront and all the effort needed to put these things together, but people just don't care. I can understand if people just aren't a fan of the format of the Game Awards—it wouldn't surprise me if the people complaining didn't watch things like the Oscars or the Grammys either—but they act like Geoff fucking shot their dog and is only out here to take advantage of \"real gamers\" or something.",
                    "score": 13,
                    "author": "Shradow"
                },
                {
                    "level": 1,
                    "comment": "I have literally marked my calendar for this one. E3 was one of my favorite weeks of the year, so this is about as close as we’re gonna get to that. I just wish Sony had done their presentation during that same week.",
                    "score": 13,
                    "author": "tarheel343"
                },
                {
                    "level": 1,
                    "comment": "&gt;I'm surprised by the negativity in the comments here.\n\nYou might be in the wrong sub, my friend.",
                    "score": 2,
                    "author": "jerrrrremy"
                },
                {
                    "level": 1,
                    "comment": "The problem is that it has never gotten even close to e3 levels of hype  and he tries to market it as that leaving many disappointed. The game awards is the closest thing we will ever get to feeling that e3 experience again and even that isn’t as hype. E3 dying is such a huge dissapointment to anyone who loves getting excited about video games.",
                    "score": 0,
                    "author": "MikeDunleavySuperFan"
                },
                {
                    "level": 1,
                    "comment": "Because the guy is a scumbag.",
                    "score": -13,
                    "author": "DannyBiker"
                },
                {
                    "level": 1,
                    "comment": "It's because the last time I watched his show there was a ridiculous amount of padding from streamers making what should be a 1hr show something like 3 hours.\n\nHe's rubbish",
                    "score": -22,
                    "author": "segagamer"
                },
                {
                    "level": 1,
                    "comment": "&gt; It's a harmless and fun event\n\nSo you genuinely enjoy his show?\n\nThe negativity is from people who have tried to do the same over the years, but found it impossible.",
                    "score": -18,
                    "author": "MumrikDK",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then what’s the point in even coming here to talk about it if it’s obviously not for you.",
                            "score": 3,
                            "author": "Mawnix"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The state of gaming communities is just fucking dreadful at the moment,\n\nCan’t believe how many people are straight up self entitled when it comes to people being excited,\n\nLet people be excited for these shows, what harm does it do you if somebody else gets joy and excitement from watching these shows? Holy fuck.",
            "score": 304,
            "author": "zenithzinger",
            "replies": [
                {
                    "level": 1,
                    "comment": "the worst part about gaming is other gamers",
                    "score": 172,
                    "author": "doug4130",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "my favorite part about gaming is when i talk about my favorite video games on reddit and I get demolish by being critical about it even tho i like the game",
                            "score": 56,
                            "author": "Alastor3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thats not how it works. If you like a game then you have to like everything about it. If someone says something bad about it then you are duty-bound to knife them in a back alley.",
                                    "score": 38,
                                    "author": "XileLerinril"
                                },
                                {
                                    "level": 3,
                                    "comment": "Don't think it's only about gaming, I dare you say you didn't enjoy Marvel movie X and soon there will be tons of comments telling you are wrong.  On some aspect I kind of understand that when you have a great time and want to share your positive experience, seeing a negative post bumps you out, but for me every aspect is interesting. I see that before stating a negative opinion, you have more civil discussion if you say first that you absolutely loved movie/game even if you have mixed feelings about it. \n\nAlso for some reason manga discussions are more accepting of criticism you say it's trash and reply will be \"I know, still love it\" :D",
                                    "score": 7,
                                    "author": "Gdach",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I find the opposite way more common tbh; trying to say anything positive about an internet punching bag only to have people hit you with a three page essay on why your own opinion is objectively wrong. \n\nEspecially with marvel lately, seems the trend is to hate on everything with its name. I got pretty heavily downvoted a little while back for simply saying “I had a good time with Love and Thunder even if it was disappointing compared to Ragnarok” \n\nBut yeah, agree overall, it feels like there’s no room in online discussion for any nuance. Everything’s either gotta be outstanding or awful and the “discourse” just involves circlejerking those stances",
                                            "score": 4,
                                            "author": "RyanB_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Every movie discussions boil down to \"I liked it\" or \"I hated it\" and jokes sprinkled here and there, so the thread doesn't have anything really substantial. I quite enjoy the jokes and as I said people like to share their overall immediate opinions which I don't mind. Just wish it was not so one-sided all the time. But that's what a voting system does.\n\nAnd it's not like regular forum system were that much better, usually you posted your opinion which would be likely ignored and forgotten if someone engaged it would be interrupted by other 5 guys discussing unrelated topic and then buried by memes pictures taking 50 pages.\n\nI'm yet to see latest Thor movie, kind of never finding time to watch it. As I am really a fan of Taika Waititi works it is shame that his new movie is currently on mixed.",
                                                    "score": 3,
                                                    "author": "Gdach"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Or being talking about a flawed game you liked if its one Reddit decided is trash.",
                                    "score": 7,
                                    "author": "AscensoNaciente"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Gamers in online forums can be some of the most insufferable people to (attempt to) have discussions with. So many egos, entitlement, cynicism...",
                            "score": 39,
                            "author": "Marzoval"
                        },
                        {
                            "level": 2,
                            "comment": "When I was a kid I felt slightly ashamed to be a gamer as it wasn’t really that popular. But now that it is I have LESS interest in ‘’calling myself’’ a gamer, because the gaming community is so fucking miserable. I’m just gonna enjoy it on my own (and on Reddit from time to time).",
                            "score": 6,
                            "author": "FlasKamel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm right there with you haha. summed up my experience to a t",
                                    "score": 4,
                                    "author": "doug4130"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Worst part about /r/gaming is /r/games",
                            "score": -8,
                            "author": "mazzysturr"
                        },
                        {
                            "level": 2,
                            "comment": "Nope, it's by far what gaming media had become",
                            "score": -14,
                            "author": "Specialist_Duty5736"
                        },
                        {
                            "level": 2,
                            "comment": "The worst part about gaming is the labeling you get from people that are non-gamers.",
                            "score": -4,
                            "author": "Ameratsuflame"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is why I rarely ever dip into the comments of r/games posts anymore. It's good as a general gaming news/ trailers aggregate, but man the cynicism is overwhelming at times. I used to look at the comments a ton, and I found that that cynicism was kind of rubbing off onto me, and I was like damn I just wanna enjoy my hobby haha",
                    "score": 8,
                    "author": "kch75"
                },
                {
                    "level": 1,
                    "comment": "I'm looking forward to the show but making fun of Keighley is a hallowed tradition.",
                    "score": 18,
                    "author": "strugeler",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm all for making fun of Keighley because stuff like \"Game of the Year, sponsored by G Fuel and Doritos\" is objectively funny shit when you're trying to do a \"serious\" industry event, but I swear, some people act as though Keighley shoved their grandma down the stairs and kicker her puppy on the way out.",
                            "score": 62,
                            "author": "AT_Dande",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was *two* puppies. And a baby seal",
                                    "score": 15,
                                    "author": "Specialist_Duty5736"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, his events can be a little cringe but I still have mad respect for him for bringing some of that E3 hype back",
                                    "score": 3,
                                    "author": "premortalDeadline"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel like whoever drew that comic of people playing a game while one dude in the back is furiously screaming at them hit the nail on the for general gamer attitude.\n\nI didn't grow up getting bullied relentlessly because I played video games as a kid to make others feel bad for playing the games they like.\n\nIf your favorite game is Hello Kitty: Island Adventure. I'm glad you enjoy it.",
                    "score": 8,
                    "author": "nugood2do"
                },
                {
                    "level": 1,
                    "comment": "I mean i agree theyre miserable people but they are in no way preventing anyone from enjoying it...jesus christ turn down the theatrics a bit.",
                    "score": -3,
                    "author": "EvenOne6567"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 66,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 27,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "-Monday: Diablo 4 Release\n\n-Thursday: SGF\n\n-Saturday: (off topic) Champions League Final\n\n-Sunday: Xbox Showcase\n\nWhat a great week.",
            "score": 58,
            "author": "DanOfRivia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Monday we may also see Apple announce their VR headset.\n\nNot directly gaming related, but the competition and mainstream appeal will help accelerate VR. Better VR, better VR gaming :D",
                    "score": 19,
                    "author": "PutridUniversity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everything that’s been out there has pointed to it being not consumer focused this go-around, especially when it comes to price. Also it’s being unveiled at a developer’s conference, so expect it to be more dev focused. \n\nThough Meta losing their shit and doing an emergency pre-emptive strike last week was pretty hilarious.",
                            "score": 4,
                            "author": "kbuis",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, very good week for gaming showcases. I'm personally hoping for crimson desert and maybe another dragons dogma 2 trailer at SGF and to finally get a good look at avowed on Sunday.",
                    "score": 4,
                    "author": "Idreamofknights"
                },
                {
                    "level": 1,
                    "comment": "Future Games Show is also happening on Saturday.",
                    "score": 2,
                    "author": "Firmament1"
                },
                {
                    "level": 1,
                    "comment": "Oh fuck yeah, I forgot champions league final was Saturday (American, nobody talks about soccer here except my dad)",
                    "score": 2,
                    "author": "Explosion2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 115,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 49,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 28,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -134,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 50,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 37,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -8,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can someone tell me what are the games shown at the following time stamps? Very few shown of course but seems interesting (enough to at least know what it is)\n\n* 0:18\n* 0:44\n* 0:46\n* 0:50\n* 0:57",
            "score": 4,
            "author": "Radulno"
        },
        {
            "level": 0,
            "comment": "What can we expect here? Any announcements?",
            "score": 2,
            "author": "gitovito",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Out of curiosity, is there a reason it's on a Thursday instead of, say, Friday or the weekend days? I'd assume viewership would be bigger if it was on a different weekday.",
            "score": 3,
            "author": "mcmacmac"
        },
        {
            "level": 0,
            "comment": "Fun week.\n\nD4 official release, SGF, FF16 event with maybe demo?",
            "score": 3,
            "author": "parkwayy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Demo should be around Sunday/Monday.",
                    "score": 2,
                    "author": "Massive_Weiner_Alert",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think maybe the funniest Keighley bit is how he will cut these \"trailers\" for his shows that don't really have anything to do with the show itself or the games that will be in it. It is like he is advertising video games as a concept.",
            "score": -23,
            "author": "strugeler",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the guy just loves the industry.",
                    "score": 87,
                    "author": "MVRKHNTR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And he loves presenting things.",
                            "score": 18,
                            "author": "strugeler"
                        },
                        {
                            "level": 2,
                            "comment": "I think he just loves being employed",
                            "score": -3,
                            "author": "Specialist_Duty5736",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean…wasn’t he going to the first few E3s when he was a teenager? Seems like he has a genuine passion for gaming.",
                                    "score": 10,
                                    "author": "TheVaniloquence"
                                },
                                {
                                    "level": 3,
                                    "comment": "who employs him?",
                                    "score": 7,
                                    "author": "Frank_Castle1980",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sponsors. Well, fund, but still.\n\nNot gonna fault him for getting paid to do stuff people want him to do, but he clearly wouldn't be doing it out of goodness of his heart",
                                            "score": -5,
                                            "author": "Specialist_Duty5736",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bro, what are you smoking? I have to assume you're just young and you don't really know the history. Keighley has been doing this stuff out of the passion in his heart for decades. Nobody asked him or paid him to start doing this stuff. He pushed for it all because he wanted to. Pretty sure he funded the original Game Awards with his own money. He does it entirely because he genuinely loves the industry and loves doing this shit.",
                                                    "score": 18,
                                                    "author": "RwYeAsNt"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He doesn't *have* to make these. He does it because he enjoys it.",
                                    "score": 17,
                                    "author": "MVRKHNTR",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well I doubt he'd be doing it for free. There is nothing wrong with liking what you do and being paid for it",
                                            "score": -1,
                                            "author": "Specialist_Duty5736",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's his show that he fully owns and operates. \n\nHe genuinely seems to edit these together just because he enjoys it.",
                                                    "score": 17,
                                                    "author": "MVRKHNTR",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To be fair, not being unemployed is pretty great except for that whole work thing.",
                                    "score": 2,
                                    "author": "RhysPeanutButterCups"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You want him to include games from the show, that are to be revealed, in the trailer?...",
                    "score": 23,
                    "author": "parkwayy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want Geoff to have a good time out there, I just think it's funny (as is the concept of a trailer for this)",
                            "score": 0,
                            "author": "strugeler"
                        },
                        {
                            "level": 2,
                            "comment": "Most definitely, need to know whether to bother watching it at all...",
                            "score": -7,
                            "author": "Specialist_Duty5736"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I mean...it's a hype trailer that celebrates gaming. Of course that is what it is. He isn't going to spoil shit in something like this.",
                    "score": 6,
                    "author": "cubcos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Geoff has been leeching the publicity from independent showcases and masquerading them as if they fall under his \"Summer Game Fest\" event.\n\nHe's trying to recreate the E3 magic without actually having to do the hardwork around arranging partnerships.",
            "score": -246,
            "author": "iChatShit",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;He's trying to recreate the E3 magic without actually having to do the hardwork around arranging partnerships. \n\nWhat? How do you think he gets companies to show trailers at these shows? They don't just magically show up.",
                    "score": 44,
                    "author": "jamsterbuggy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He conjures the trailers out of thin air using pixie dust.",
                            "score": 10,
                            "author": "GuiltyAs_Charged"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't get why people think it's such a bad thing to try and recreate the idea of a seasonal event period where we get announcements, even if it's not actually partnered with every  event. Is that not what people wanted?",
                    "score": 209,
                    "author": "noreallyu500",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I don't care whether or not they're all officially under the same banner, I'm just glad there's a certain stretch of time throughout the year where the announcements are concentrated because we still get a few weeks with all the big reveals. Summer Game Fest covers them all, both the stuff that is announced through them and the stuff that is announced independently.",
                            "score": 58,
                            "author": "_Robbie"
                        },
                        {
                            "level": 2,
                            "comment": "I seriously don’t understand why so many people seem to have such a hatred for Keighley. The guy’s always come across as genuinely passionate about gaming to me.",
                            "score": 131,
                            "author": "Krioniki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He’s “passion for gaming” in a nutshell. Doesn’t make any sense to me either.",
                                    "score": 26,
                                    "author": "fuzzynavel34"
                                },
                                {
                                    "level": 3,
                                    "comment": "Because some people just need to be permanently mad about everything that doesn't specifically cater to their exact tastes.",
                                    "score": 79,
                                    "author": "Twinzenn"
                                },
                                {
                                    "level": 3,
                                    "comment": "And everyone in the industry is always extremely positive about how great he is as a person. Dude just seems to really like video games and wants to make a fun show about them",
                                    "score": 12,
                                    "author": "Jdmaki1996"
                                },
                                {
                                    "level": 3,
                                    "comment": "I admire the shit out of him. He played the game for years, taking embarrassing sponsorships and advertising deals, all while working to establish the Game Awards as the definitive awards show for video games. He could’ve easily rested on his laurels once TGA became huge, but instead the dude went and said “well I made the video game Oscar’s, how about I make the new E3?”",
                                    "score": 26,
                                    "author": "GuiltyAs_Charged",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Seriously! He puts in a ton of work. I bet in 10 years the next generation of gamers will be hyped when it’s “summer games fest” time of the year. \n\nI’m really glad the gaming community has him.",
                                            "score": 18,
                                            "author": "ineednaughty"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I remember him trying to make the Spike Gaming Awards show actually serious, in a time where people like Roger Ebert said gaming isn’t art and will never be taken seriously.",
                                            "score": 8,
                                            "author": "TheVaniloquence"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Some people are just grumpy I guess",
                                    "score": 31,
                                    "author": "Kalecraft"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't know either! I don't really have any strong feelings about him actually. He seems to be good at what he does and that's more than enough fo me.",
                                    "score": 16,
                                    "author": "noreallyu500"
                                },
                                {
                                    "level": 3,
                                    "comment": "Weird nerds and being mad about something that doesn't matter from like ten years ago, name a better duo",
                                    "score": 9,
                                    "author": "ngwoo"
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah I gotta be honest and I didn't like him back in the gametrailers days but since he took control of the game awards I think he did a great job\n\nmaybe people don't remember the shit show that the game awards was before that",
                                    "score": 5,
                                    "author": "Brandhor"
                                },
                                {
                                    "level": 3,
                                    "comment": "idk i think the doritos pope era left a sour taste",
                                    "score": 5,
                                    "author": "lestye",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That was like 10 years ago tho??",
                                            "score": 17,
                                            "author": "rf32797"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "People cheered for E3's demisal and are actively cheering against Summer Fest as well. It's almost an agenda. \n\nOther than pure cynicism and an almost nihilistic hatred for the hobby, the only other plausible explanation is those people would enjoy a world without consolidated game announcements in conferences, instead preferring to hardwire a RSS feed to their brain so they can keep up with every single micro announcement scattered throughout 360 days.",
                            "score": 17,
                            "author": "giulianosse"
                        },
                        {
                            "level": 2,
                            "comment": "With the danger of sounding like a dinosaur, I think that concept only really works for in-person events and not being able to replicate that E3-magic, or have  seasonal events at all, is a casualty of digital showcases. \n\nFrom my perspective, what Geoff has done is effectively planted a flag in the summer months and said \"anything announced/shown during these 3 months is under my event\". He's got his own showcase which is totally fine (last one sucked, though), but going from tweets alone he's really just swimming in the wake of other publishers/platforms' events and giving the impression that he helped deliver them.\n\nWhat he's doing is entirely different from what IGN, for example, does with their showcase coverage.",
                            "score": -31,
                            "author": "iChatShit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see where you're coming from but I have to disagree with the notion that it only works for in-person events - since for the vast majority of viewers E3 was already an online event. The partnerships helped with keeping the publishers together, but it seems that they're now converging to the same period regardless.\n\nAnd while I feel that Geoff is obviously trying to connect the whole period with his show, isn't that exactly what E3 was doing? If I'm not mistaken, some shows were already technically not from E3 for years. I don't see why that'd be prejudicial for the consumer at all.",
                                    "score": 25,
                                    "author": "noreallyu500",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What does leeching actually refer to here? He's been doing events like this for a long time and has built up a lot of it with his own financing. He's put together these showcases because E3 has been slowly dying for years. I don't really see any reason to criticize what he's doing.",
                    "score": 78,
                    "author": "myyummyass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Leeching meaning dozens of showcases are considered \"part\" of SGF that SGF has nothing to do with. Presentations that were going to happen regardless of other events.",
                            "score": -15,
                            "author": "Kariodude"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone tries to bring visibility to games and devs by gathering announcements under a single large audience in a cost effective and fun way, while also creating the Oscars of gaming for everyone to enjoy new trailers, music and awards.\n\n\"hE's beEn LeeChIng puBliCitY frOm iNdePenDenT sHowCasEs wItHouT dOiNg anY woRk\"",
                    "score": 54,
                    "author": "Twinzenn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;hile also creating the Oscars of gaming for everyone to enjoy new trailers, music and awards.\n\nAnd sell advertisement space.",
                            "score": -50,
                            "author": "killingqueen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that's how things work in this world. Is that supposed to be some kind of dunk?",
                                    "score": 41,
                                    "author": "favorscore"
                                },
                                {
                                    "level": 3,
                                    "comment": "Do you think all that shit is just free? It has to be paid for somehow. And it's his full time job to do this kind of stuff, let him make some money on it.",
                                    "score": 21,
                                    "author": "Interloper633",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately gamingbros live under a rock and think nothing costs money.    Just look at how they get up in arms everytime MTX comes up.",
                                            "score": 7,
                                            "author": "saltiestmanindaworld"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wtf do you think E3/gaming news June is supposed to be if not a big advertising month?",
                                    "score": 28,
                                    "author": "LostInStatic"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes? Are you mad that he's not running a charity and doing all of this for free?",
                                    "score": 35,
                                    "author": "Twinzenn"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Which is exactly my point, he's not really done anything.\n\nOh, and the Game Awards? THE Game Awards? Is that the event where the actual award element is filler for trailers and CHVRCHES to do a set?  \n\nHe's a total cape tailor.",
                            "score": -48,
                            "author": "iChatShit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What have you got against CHVRCHES, man? Face it, you're looking for an excuse to get mad. Not surprised, you're a gamer on Reddit, after all.",
                                    "score": 23,
                                    "author": "JmanVere",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Okay well half the comments I see surrounding any individual publisher's showcase is people bitching and moaning that they have to follow 8 different livestreams to see upcoming games because E3 is dead. I'm not gonna fault the guy for giving the people what they want.",
                    "score": 16,
                    "author": "LostInStatic"
                },
                {
                    "level": 1,
                    "comment": "Ridiculously uncharitable thing to say with no evidence.",
                    "score": 13,
                    "author": "favorscore"
                },
                {
                    "level": 1,
                    "comment": "Lmao you think what the Esa was doing was the hard work?",
                    "score": 13,
                    "author": "stillherelma0",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Geoff one of the few people in games media that seems to still genuinely give a shit about making worthwhile events. He's not perfect and his shows aren't either, but in the absense of e3 at least he's trying. Hard to fault the guy for that. Ya there are too many ads, ya there's plenty of missteps. But I don't see anyone else taking the mantle and running with it.",
                    "score": 6,
                    "author": "Sirromnad"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please read our [rules](https://www.reddit.com/r/Games/wiki/rules), specifically Rule #2 regarding personal attacks and inflammatory language. We ask that you remember to remain civil, as future violations will result in a ban.",
                            "score": 1,
                            "author": "Cactus_Bot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Are you... Jealous?",
                    "score": 20,
                    "author": "RedditFilthy",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He does plenty of hard work and they arrange a ton of partnerships for SGF. I do agree that Geoff takes a lot of credit for things he has nothing to do with.",
                    "score": 2,
                    "author": "Kariodude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really hope they then summer game show around, Last years closing title was picture of Tlou multiplayer, which was now cancelled\n\nThen there's the adverts such as black Adam coffee drink\n\nI suppose someone has to flip the bill",
            "score": -1,
            "author": "SirTobyGirl"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -286,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Man, I’ve seen you comment on a lot of gaming stuff and you seem like such a negative person.\n\nEdit: like [this ](https://reddit.com/r/Games/comments/1405woj/_/jmuhyd4/?context=1) Diablo 4 complaint. Why get so worked up over this stuff?",
                    "score": 195,
                    "author": "ineednaughty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe the term is “Terminally Online”",
                            "score": 67,
                            "author": "Thanks-Basil"
                        },
                        {
                            "level": 2,
                            "comment": "Most of this website are negative people",
                            "score": 120,
                            "author": "GangstaPepsi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s kind of a bumming me out. I like games, Geoff Keighley likes games, most of us here probably like games. \n\nWhy can’t we just have a casual discussion rather than nitpick every aspect of every game to death?",
                                    "score": 110,
                                    "author": "ineednaughty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just don't engage with negative stuff if it bums you out. Made using Reddit way better for me.",
                                            "score": 44,
                                            "author": "MrTopHatMan90",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can't believe the people on /r/pcgaming are more positive in the same thread. The inverse is usually true.",
                                                    "score": 33,
                                                    "author": "Just_a_user_name_"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "For sure, but sometimes it’s worrying because it’s so dang negative it feels like I can’t really interact with Reddit at all. \n\nFor example, I’m enjoying Diablo 4 and the gaming subs are just echoing hatred for any minuscule issue they can come up with the game rather than actually talking things out.",
                                                    "score": 17,
                                                    "author": "ineednaughty",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm enjoying the game also and got 5 of my friends to pick it up so we could play together. We're here too! Just ignore the negative nancies man",
                                                            "score": 9,
                                                            "author": "sepehrack"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You know this site is fucked when for every major gaming release the main game/series subreddit usually splits into two, one being a \"low sodium\" version where any complaint is showered in downvotes and the other where any positive opinion is also showered in downvotes.",
                                                            "score": 2,
                                                            "author": "giulianosse"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I do feel like the community culture here usually defaults to negative and needlessly cynical, as if people are so intent on not being labelled a fanboy that they take it to the opposite extreme.\n\nThere's also a weird victimhood complex of people acting like game companies are out to get them when this is literally a luxury entertainment, nobody is forced into buying or doing anything they don't want to. The act of not buying a game is super dramatic here haha as if that's taking a strong political stance.",
                                            "score": 2,
                                            "author": "yesthatstrueorisit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Geoff Keighley likes games\n\nIdk I do have some issues with his formatting, like I don't think a place to discuss the best games of the year and the industry's accomplishments should have half its runtime devoted to advertisements. \n\n&gt; Why can’t we just have a casual discussion rather than nitpick every aspect of every game to death? \n\nWhy can't we just fawn and not criticize? Some people get too grouchy about it but criticism is essential.",
                                            "score": -14,
                                            "author": "mudermarshmallows"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Impossible to say this without sounding condescending but there are a ton of unhappy young adults/teenagers projecting their feelings and circumstances onto the world around them, who will one day realize that the world doesn't suck as much as they once thought it did.",
                            "score": 54,
                            "author": "greenbluegrape",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There’s also a lot of older gamers who are extremely cynical because of unrelated stuff and they go around parading the “modern game bad old game good” flag without realizing a lot of old games were also shitty\n\nTo be fair newer AAA games have gotten shittier with their monetization and a lot of games launch broken when they shouldn’t but bad games have always existed",
                                    "score": 9,
                                    "author": "LiquidCringe2"
                                },
                                {
                                    "level": 3,
                                    "comment": "With gaming it’s different i think. It’s mainly older people who are still trying to capture the feeling that games gave them when they were children. Naturally that’s impossible so they end up hating everything that’s releases now",
                                    "score": 19,
                                    "author": "Howdareme9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And heaven forbid should you be an old guy like me who never lost that feeling.  I love games more now than I even did as a kid.   \n\nHell, I'm hesitant to even reply here because of just how negative Reddit has become.",
                                            "score": 20,
                                            "author": "GamingTrend"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This problem is *really* bad with Zelda. BotW/TotK are different from the classic formula and can definitely be criticized but you've got older fans conspiracizing that the devs are being forced by corporate to chase an open world trend while constantly talking about how sad they are that they're never getting any good Zelda game ever again.",
                                            "score": 9,
                                            "author": "mudermarshmallows",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People are raging because they changed the colour of Link's shirt, it's insane.",
                                                    "score": 3,
                                                    "author": "ThiefTwo"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's actually all over the place on Reddit. As much as this specific post has been downvoted, you see the same vitriol on many, many posts. Just look at how seething people are about Diablo, or Destiny. People put all their effort into video games and then when it's not ideal they lash out about it. These people need to, sincerely, go touch grass and get out of their little video game bubbles and gain some perspective",
                            "score": 8,
                            "author": "iMini"
                        },
                        {
                            "level": 2,
                            "comment": "Just blockerooo. Why keep seeing more stuff from someone that doesn't delight you.",
                            "score": 7,
                            "author": "ExitPursuedByBear312"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He’s literally passion for games in human form. I don’t see how you could have a problem with him 🤣",
                    "score": 8,
                    "author": "fuzzynavel34"
                },
                {
                    "level": 1,
                    "comment": "But it doesn't even have every game released this year.",
                    "score": 2,
                    "author": "Kr4k4J4Ck"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "We lost e3 for this.... now we just gotta watch these rubbish events and showcases and hope for the best. Bummer.",
            "score": -67,
            "author": "MotherLoveBone27",
            "replies": [
                {
                    "level": 1,
                    "comment": "You don't have to watch shit. Keighley isn't the one who killed E3. They essentially did that themselves.",
                    "score": 27,
                    "author": "cubcos"
                },
                {
                    "level": 1,
                    "comment": "You know, you don't *have* to watch it...",
                    "score": 26,
                    "author": "JmanVere",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "What's the difference between e3 and this exactly for consumers ? Also blame nintendo and sony who were the one that quit and are still refusing to put their showcase inside the summer game fest unlike xbox.",
                    "score": 7,
                    "author": "DreamMaster8",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You’re allowed to enjoy things. It’s okay.",
                    "score": 4,
                    "author": "AnimZero"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can't stand Keighley, his events are always trash. All the game trailers get uploaded on YouTube anyways, really no reason to sit through them.",
            "score": -88,
            "author": "Comrade_Jacob",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah well this is kinda how it works. Even sony, nintendo and microsoft upload trailers and shit after their events lol",
                    "score": 31,
                    "author": "Xawfire",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Why go out for dinner when you can get it delivered? Why go to the movies when it'll be out on digital in a few months? Because it's a fun thing to do you miserable jackass.",
                    "score": 28,
                    "author": "cubcos",
                    "replies": []
                }
            ]
        }
    ]
}