{
    "id": "140hikg",
    "score": 60,
    "title": "Forester Simulator - Gameboom VR - Cozy adventure in the breathtaking woods of Beaverly Hills awaits!",
    "author": "ZandorathPL",
    "date": 1685894747.0,
    "url": "https://www.reddit.com/r/Games/comments/140hikg",
    "media_urls": [],
    "other_urls": [
        "https://store.steampowered.com/app/1418380/Forester_Simulator/)",
        "https://discord.gg/kqR2SMtVWh)"
    ],
    "postText": "Hello there!\n\nI'm Kacper from Gameboom VR (VR Game of the Year 2021 Awards for Cooking Simulator VR). Today we proudly presents our new upcoming PC game - Forester Simulator. It's a simulator game that combines cozy and adventure gameplay allowing to step into the boots of a forester.\n\n[If you want to follow the game’s development, you can follow/wishlist it on Steam](https://store.steampowered.com/app/1418380/Forester_Simulator/)\n\n[You can also join our Discord server](https://discord.gg/kqR2SMtVWh)\n\nEmbark on an immersive adventure as a forester in charge of the breathtaking open world of Beaverly Hills. Spend cozy time in nature while exploring diverse ecosystems in the freeplay mode or engage in a story driven campaign. Experience a forest filled with lush wildlife, surprising characters and important work to be done, all from the comfort of your home!\n\nTired of city life? Look no further! Keep the forest healthy and thriving by completing your tasks and engaging with this unique environment. From planting trees, tracking animals and identifying rare plants, through taking part in ethical harvesting, to preventing fires, helping police find missing people and pursuing forestry criminals, supervise the everyday life of Beaverly Hills. Interact with animals and tourists, complete side characters’ quests and face various challenges while rebuilding a picturesque haven that will return the favor by slowly revealing its secrets.\n\nExplore the vast open world of Beaverly Hills! There’s more to this forest than meets the eye. With many distinct ecosystems and various activities spread across the map, observe lifelike complex simulations of wildlife and its natural habitats. Each animal has a unique temper and some can even become friendly enough to stay by your side. Become a part of this world and watch it change. Delve into every nook and cranny and meet the locals of Beaverly Hills. Interacting with them can prove useful in the long run. Get popular among the forest community and gain their favor to make future tasks easier. Who knows, they might also reveal a little something about the hidden gems of this area.\n\nIf you have any questions feel free to ask! I will try to answer most of the questions, although there may be some that will require consultation with the programmers. Then I will probably reply the next day.",
    "comments": []
}